[{"header":"Saul Tries to Kill David"},{"num":19,"verse":"Now Saul told Jonathan his son and all his servants to kill David. But Saul’s son Jonathan found much joy in David. "},{"num":2,"verse":"So Jonathan told David, “My father Saul wants to kill you. I beg you, be careful in the morning. Stay hidden in a secret place. "},{"num":3,"verse":"I will go out and stand beside my father in the field where you are. I will speak to my father about you. If I find out anything, I will tell you.” "},{"num":4,"verse":"Then Jonathan spoke well of David to Saul his father, saying, “Do not let the king sin against his servant David. He has not sinned against you. What he has done has been good for you. "},{"num":5,"verse":"He put his life in danger and killed the Philistine. And the Lord helped all Israel with His saving power. You saw it and were glad. Why then will you sin against him who has done no wrong, by killing David for no reason?” "},{"num":6,"verse":"Saul listened to Jonathan, and promised, “As the Lord lives, David will not be killed.” "},{"num":7,"verse":"Then Jonathan called David and told him all these things. He brought David to Saul, and David stayed with Saul as before."},{"num":8,"verse":"When there was war again, David went out and fought with the Philistines. He killed many of them, and the others ran away from him. "},{"num":9,"verse":"Then a bad spirit sent from the Lord came upon Saul as he was sitting in his house with his spear in his hand. David was playing the harp. "},{"num":10,"verse":"Saul tried to nail David to the wall with the spear, but David got out of the way. Saul hit the wall with the spear, and David ran away that night."},{"num":11,"verse":"Then Saul sent men to David’s house to watch him, that he might kill him in the morning. But David’s wife Michal told him, “If you do not save your life tonight, tomorrow you will be killed.” "},{"num":12,"verse":"So Michal let David down through a window, and he ran away. "},{"num":13,"verse":"Michal took a house god and laid it on the bed. She put a goat hair pillow at its head, and covered it with clothes. "},{"num":14,"verse":"When Saul sent men to take David, Michal said, “He is sick.” "},{"num":15,"verse":"Then Saul sent men to see David, saying, “Bring him up to me in the bed, that I may kill him.” "},{"num":16,"verse":"When the men came in, the house god was on the bed, with the goat hair pillow at its head. "},{"num":17,"verse":"So Saul said to Michal, “Why have you fooled me like this and let the man I hate go? Now he has run away to be safe.” Michal said to Saul, “He said to me, ‘Let me go! Why should I kill you?’”"},{"num":18,"verse":"Now David ran away from Saul and came to Samuel at Ramah. He told him all that Saul had done to him. Then he and Samuel went and stayed in Naioth. "},{"num":19,"verse":"Saul was told, “See, David is at Naioth in Ramah.” "},{"num":20,"verse":"So Saul sent men to take David. But when they saw the men of God saying what was going to happen, with Samuel leading them, the Spirit of God came upon the men sent by Saul. And they began saying what was going to happen also. "},{"num":21,"verse":"When Saul heard this, he sent other men, and they began saying what was going to happen. So Saul sent men for the third time, and they began saying what was going to happen. "},{"num":22,"verse":"Then he himself went to Ramah, and came as far as the large well in Secu. He asked, “Where are Samuel and David?” And someone said, “See, they are at Naioth in Ramah.” "},{"num":23,"verse":"So he went to Naioth in Ramah. And the Spirit of God came upon him also. As he traveled he said what would happen, until he came to Naioth in Ramah. "},{"num":24,"verse":"He took off his clothes and said what was going to happen in front of Samuel. He lay down without clothing all that day and all that night. So they say, “Is Saul among those who say what will happen?”"}]