[{"num":19,"verse":"And Sha’ul spoke to Yonatan [Yehonaton] bno, and to all his avadim, that they should kill Dovid. But Yehonatan Ben Sha’ul liked Dovid me’od."},{"num":2,"verse":"Yehonatan reported [this] to Dovid, saying, Sha’ul aviv seeketh to kill thee; now therefore be shomer in the boker, and abide baseter (in a secret place) and hide thyself;"},{"num":3,"verse":"And I will go out and stand beside avi in the sadeh where thou art, and I will speak of thee with avi; and what I see, that I will tell thee."},{"num":4,"verse":"And Yehonatan spoke tov of Dovid unto Sha’ul aviv, and said unto him, Let not HaMelech commit chet against his eved, against Dovid; because he hath not committed chet against thee, and because his ma’asim have been toward thee tov me’od:"},{"num":5,"verse":"For he did put his nefesh in his yad, and slaughtered the Pelishti (Philistine), and Hashem wrought Teshuah Gedolah for kol Yisroel; thou sawest it, and didst rejoice with simcha. Why then wilt thou commit chet against dahm naki (innocent blood), to slay Dovid chinom (without cause)?"},{"num":6,"verse":"And Sha’ul paid heed unto the voice of Yehonatan; and Sha’ul swore a shevuah, As Hashem liveth, he shall not be slain."},{"num":7,"verse":"And Yehonatan called Dovid, and Yehonatan reported to him all these devarim. And Yehonatan brought Dovid to Sha’ul, and he was in his presence, as in times past."},{"num":8,"verse":"And there was milchamah again; and Dovid went out, and fought with the Pelishtim (Philistines), and slaughtered them with a makkah gedolah (with a great blow); and they fled from him."},{"num":9,"verse":"And there was a ruach Hashem ra’ah upon Sha’ul, as he sat in his Bais with his khanit (spear) in his yad; while Dovid menaggen (was playing music) with his yad."},{"num":10,"verse":"And Sha’ul sought to pin Dovid to the wall with the khanit; but he slipped away out of Sha’ul’s presence, and he drove the khanit into the wall; and Dovid fled, and escaped that lailah."},{"num":11,"verse":"Sha’ul also sent malachim unto Bais Dovid, to put him under surveillance, and to slay him in the boker; and Michal his isha warned Dovid, saying, If thou not escape with thy nefesh halilah (tonight), makhar (tomorrow) thou shalt be slain."},{"num":12,"verse":"So Michal let Dovid down through the chalon; and he went, and fled, and escaped."},{"num":13,"verse":"And Michal took the terafim, and laid it in the mittah, and put a piece of woven goat’s hair at its head, and covered it with beged (cloth, garment)."},{"num":14,"verse":"And when Sha’ul sent malachim to capture Dovid, she said, He is choleh (ill)."},{"num":15,"verse":"And Sha’ul sent the malachim back to see Dovid, saying [to them], Bring him up to me in the mittah (bed), to have him slain."},{"num":16,"verse":"And when the malachim were come in, hinei, there was the terafim in the mittah, with a piece of woven goats’ hair at its head."},{"num":17,"verse":"And Sha’ul said unto Michal, Why hast thou so deceived me, and sent away mine oyev, that he is escaped? And Michal answered Sha’ul, He said unto me, Let me get away; why should I kill thee?"},{"num":18,"verse":"So Dovid fled, and escaped, and came to Shmuel at Ramah, and told him all that Sha’ul had done to him. And he and Shmuel went and dwelt in the dwellings of the nevi’im."},{"num":19,"verse":"And it was told Sha’ul, saying, Hinei, Dovid is at the dwellings of the nevi’im in Ramah."},{"num":20,"verse":"And Sha’ul sent malachim to capture Dovid; and when they saw the kat (sect, group) of the nevi’im prophesying, and Shmuel standing as nitzav (overseeing) them, the Ruach Elohim was upon the malachim of Sha’ul, and they also prophesied."},{"num":21,"verse":"And when it was told Sha’ul, he sent other malachim, and they prophesied likewise. And Sha’ul sent malachim again shelishim (third ones) and they prophesied also."},{"num":22,"verse":"Then went he also to Ramah, and came to a bor hagadol (great pit) at Sechu; and he asked and said, Where are Shmuel and Dovid? And one said, Hinei, they are at the dwellings of the nevi’im in Ramah."},{"num":23,"verse":"And he went there to the dwellings of the nevi’im at Ramah; and the Ruach Elohim was upon him also, and he walked along prophesying, until he came to the dwellings of the nevi’im at Ramah."},{"num":24,"verse":"And he stripped off his beged also, and prophesied before Shmuel in like manner, and lay down arom (naked) all that day and all that lailah. Thus they say, Is Sha’ul also among the nevi’im?"}]