[{"num":1,"verse":"but Jesus went to the Mount of Olives."},{"header":"The Pharisees Bring Jesus a Woman Caught In Adultery"},{"num":2,"verse":"Now at dawn, He again arrived in the temple. And all the people were coming to Him. And having sat-down, He was teaching them. "},{"num":3,"verse":"And the scribes and the Pharisees bring a woman having been caught in adultery. And having stood her in the middle, "},{"num":4,"verse":"they say to Him, “Teacher, this woman has been caught in the-act, while committing-adultery. "},{"num":5,"verse":"Now in the Law, Moses commanded us to be stoning such women. What then do You say?” "},{"num":6,"verse":"Now they were saying this testing Him, in order that they might have grounds to be accusing Him. But Jesus, having stooped down, was writing in the ground with His finger. "},{"num":7,"verse":"But as they were continuing-on asking Him, He straightened-up and said to them, “Let the sinless one among you throw a stone at her first”. "},{"num":8,"verse":"And again having stooped-down, He was writing in the ground. "},{"num":9,"verse":"And the ones, having heard it, were going out one by one, beginning from the older ones. And He was left-behind alone, and the woman being in the middle. "},{"num":10,"verse":"And Jesus, having straightened up, said to her, “Woman, where are they? Did no one condemn you?” "},{"num":11,"verse":"And the one said, “No one, Sir”. And Jesus said, “Neither do I condemn you. Go. And from now on, do not be sinning any longer”."},{"header":"I Am The Light of The World, To Which I And My Father Are Testifying"},{"num":12,"verse":"Then Jesus again spoke to them, saying, “I am the light of the world. The one following Me will never walk in the darkness, but will have the light of  life”. "},{"num":13,"verse":"So the Pharisees said to Him, “You are testifying about Yourself— Your testimony is not true”. "},{"num":14,"verse":"Jesus responded and said to them, “Even if I am testifying about Myself, My testimony is true, because I know from where I came, and where I am going. But you do not know from where I come, or where I am going. "},{"num":15,"verse":"You are judging according to the flesh. I am not judging anyone. "},{"num":16,"verse":"But even if I am judging, My judgment is true, because I am not alone— but it is I and the Father having sent Me. "},{"num":17,"verse":"But even in your Law, it has been written that the testimony of two people is true. "},{"num":18,"verse":"I am the One testifying about Myself. And the Father having sent Me is testifying about Me”. "},{"num":19,"verse":"So they were saying to Him, “Where is Your Father?” Jesus answered, “You know neither Me nor My Father. If you knew Me, you would also know My Father”. "},{"num":20,"verse":"These words He spoke in the treasury, while teaching in the temple. And no one seized Him, because His hour had not yet come."},{"header":"I Am Going Away. Unless You Believe That I Am The One, You Will Die In Your Sins"},{"num":21,"verse":"Then He said again to them, “I am going away. And you will seek Me. And you will die in your sin. Where I am going, you are not able to come”. "},{"num":22,"verse":"So the Jews were saying, “He will not kill Himself, will He— because He says, ‘Where I am going, you are not able to come’?” "},{"num":23,"verse":"And He was saying to them, “You are from below, I am from above. You are from this world, I am not from this world. "},{"num":24,"verse":"Therefore I said to you that you will die in your sins. For unless you believe that I am the One, you will die in your sins”."},{"header":"I Am What I Have Been Saying I Am From The Beginning"},{"num":25,"verse":"So they were saying to Him, “Who are You?” Jesus said to them, “What thing from the beginning I am indeed telling you! "},{"num":26,"verse":"I have many things to speak and to judge concerning you. However, the One having sent Me is true. And what things I heard from Him— these things I am speaking to the world”. "},{"num":27,"verse":"They did not know that He was speaking to them about the Father."},{"header":"When You Lift Up The Son of Man, You Will Know I Am The One"},{"num":28,"verse":"Then Jesus said to them, “When you lift-up the Son of Man, then you will know that I am the One, and I am doing nothing from Myself, but I am speaking these things just as the Father taught Me. "},{"num":29,"verse":"And the One having sent Me is with Me. He did not leave Me alone, because I am always doing the things pleasing to Him”. "},{"num":30,"verse":"While He was speaking these things, many believed in Him."},{"header":"If You Remain In My Word, Then You Are Truly My Disciples And The Truth Will Set You Free"},{"num":31,"verse":"Then Jesus was saying to the Jews having believed Him, “If you remain in My word, you are truly My disciples, "},{"num":32,"verse":"and you will know the truth, and the truth will set you free”."},{"header":"You Are Slaves of Sin. If The Son Sets You Free, You Will Truly Be Free"},{"num":33,"verse":"They responded to Him, “We are the seed of Abraham, and to no one have we ever been slaves. How is it You say that ‘You will become free’?” "},{"num":34,"verse":"Jesus answered them, “Truly, truly, I say to you that everyone doing sin is a slave of sin. "},{"num":35,"verse":"Now the slave does not remain in the house forever. The son remains forever. "},{"num":36,"verse":"Therefore if the Son sets you free, you will really be free. "},{"num":37,"verse":"I know that you are the seed of Abraham. But you are seeking to kill Me, because My word is not advancing in you. "},{"num":38,"verse":"I am speaking the things which I have seen with My Father. And you therefore are doing the things which you heard from your father”."},{"header":"You Are Doing The Works of Your Father, Not Abraham"},{"num":39,"verse":"They responded and said to Him, “Our father is Abraham”. Jesus says to them, “If you are children of Abraham, you would be doing the works of Abraham. "},{"num":40,"verse":"But now you are seeking to kill Me— a man Who has told you the truth, which I heard from God. Abraham did not do this. "},{"num":41,"verse":"You are doing the works of your father”."},{"header":"If God Were Your Father, You Would Be Loving Me. Your Father Is The Devil"},{"num":42,"verse":"Jesus said to them, “If God were your Father, you would be loving Me, for I came-forth and am-here from God. For I have not even come of Myself, but that One sent Me forth. "},{"num":43,"verse":"For what reason are you not understanding My speaking? It is because you are not able to hear My word. "},{"num":44,"verse":"You are of your father the devil. And you are wanting to do the desires of your father. That one was a murderer from the beginning, and was not standing in the truth, because there is no truth in him. Whenever he speaks the lie, he speaks from his own things, because he is a liar, and the father of it. "},{"num":45,"verse":"And because I am speaking the truth, you are not believing Me. "},{"num":46,"verse":"Which of you convicts Me concerning sin? If I am speaking truth, for what reason are you not believing Me? "},{"num":47,"verse":"The one being of  God hears the words of God. For this reason you are not hearing— because you are not of God”."},{"header":"I Am Honoring My Father. If You Keep My Word, You Will Never See Death"},{"num":48,"verse":"The Jews responded and said to Him, “Do we not rightly say that You are a Samaritan and have a demon?” "},{"num":49,"verse":"Jesus answered, “I do not have a demon, but I am honoring My Father, and you are dishonoring Me. "},{"num":50,"verse":"But I am not seeking My glory. There is the One seeking it, and judging. "},{"num":51,"verse":"Truly, truly, I say to you— if anyone keeps My word, he will never see death, ever”."},{"header":"You Do Not Know God, But I Do. And Abraham Was Glad When He Saw My Day"},{"num":52,"verse":"So the Jews said to Him, “Now we have come-to-know that You have a demon. Abraham died, and the prophets! And You say, ‘If anyone keeps My word, he will never taste death, ever!’ "},{"num":53,"verse":"You are not greater than our father Abraham who died, are you? The prophets died also. Whom do You make Yourself ?” "},{"num":54,"verse":"Jesus answered, “If I glorify Myself, My glory is nothing. The One glorifying Me is My Father— Whom you say that ‘He is our God’. "},{"num":55,"verse":"And you have not come-to-know Him, but I know Him. And if I say that I do not know Him, I will be a liar like you. But I know Him, and I am keeping His word. "},{"num":56,"verse":"Abraham your father rejoiced-greatly to see My day. And he saw it, and was glad”."},{"header":"Before Abraham Was, I Am. Hearing This, They Picked Up Stones To Kill Jesus"},{"num":57,"verse":"So the Jews said to Him, “You do not yet have fifty years, and You have seen Abraham?” "},{"num":58,"verse":"Jesus said to them, “Truly, truly, I say to you— before Abraham came-into-being, I am”. "},{"num":59,"verse":"Therefore they picked up stones in order that they might throw them at Him. But Jesus was hidden, and went out of the temple."}]