[{"num":8,"verse":"Jesus went to the Mount of Olives."},{"num":2,"verse":"Early in the morning he went back to the Temple area. The people all came to him, and he sat and taught them."},{"num":3,"verse":"The teachers of the law and the Pharisees brought a woman they had caught in bed with a man who was not her husband. They forced her to stand in front of the people."},{"num":4,"verse":"They said to Jesus, “Teacher, this woman was caught in the act of adultery."},{"num":5,"verse":"The Law of Moses commands us to stone to death any such woman. What do you say we should do?”"},{"num":6,"verse":"They were saying this to trick Jesus. They wanted to catch him saying something wrong so that they could have a charge against him. But Jesus stooped down and started writing on the ground with his finger."},{"num":7,"verse":"The Jewish leaders continued to ask him their question. So he stood up and said, “Anyone here who has never sinned should throw the first stone at her.”"},{"num":8,"verse":"Then Jesus stooped down again and wrote on the ground."},{"num":9,"verse":"When they heard this, they began to leave one by one. The older men left first, and then the others. Jesus was left alone with the woman standing there in front of him."},{"num":10,"verse":"He looked up again and said to her, “Where did they all go? Did no one judge you guilty?”"},{"num":11,"verse":"She answered, “No one, sir.”"},{"header":"Jesus Is the Light of the World"},{"num":12,"verse":"Later, Jesus talked to the people again. He said, “I am the light of the world. Whoever follows me will never live in darkness. They will have the light that gives life.”"},{"num":13,"verse":"But the Pharisees said to Jesus, “When you talk about yourself, you are the only one to say that these things are true. So we cannot accept what you say.”"},{"num":14,"verse":"Jesus answered, “Yes, I am saying these things about myself. But people can believe what I say, because I know where I came from. And I know where I am going. But you don’t know where I came from or where I am going."},{"num":15,"verse":"You judge me the way people judge other people. I don’t judge anyone."},{"num":16,"verse":"But if I judge, my judging is true, because when I judge I am not alone. The Father who sent me is with me."},{"num":17,"verse":"Your own law says that when two witnesses say the same thing, you must accept what they say."},{"num":18,"verse":"I am one of the witnesses who speaks about myself. And the Father who sent me is my other witness.”"},{"num":19,"verse":"The people asked, “Where is your father?”"},{"num":20,"verse":"Jesus said these things while he was teaching in the Temple area, near the room where the Temple offerings were kept. But no one arrested him, because the right time for him had not yet come."},{"header":"Some Jews Don’t Understand Jesus"},{"num":21,"verse":"Again, Jesus said to the people, “I will leave you. You will look for me, but you will die in your sin. You cannot come where I am going.”"},{"num":22,"verse":"So the Jewish leaders asked themselves, “Will he kill himself? Is that why he said, ‘You cannot come where I am going’?”"},{"num":23,"verse":"But Jesus said to them, “You people are from here below, but I am from above. You belong to this world, but I don’t belong to this world."},{"num":24,"verse":"I told you that you would die in your sins. Yes, if you don’t believe that I Am, you will die in your sins.”"},{"num":25,"verse":"They asked, “Then who are you?”"},{"num":26,"verse":"I have much more I could say to judge you. But I tell people only what I have heard from the one who sent me, and he speaks the truth.”"},{"num":27,"verse":"They did not understand who he was talking about. He was telling them about the Father."},{"num":28,"verse":"So he said to them, “You will lift up the Son of Man. Then you will know that I Am. You will know that whatever I do is not by my own authority. You will know that I say only what the Father has taught me."},{"num":29,"verse":"The one who sent me is with me. I always do what pleases him. So he has not left me alone.”"},{"num":30,"verse":"While he was saying these things, many people believed in him."},{"header":"Jesus Talks About Freedom From Sin"},{"num":31,"verse":"So Jesus said to the Jews who believed in him, “If you continue to accept and obey my teaching, you are really my followers."},{"num":32,"verse":"You will know the truth, and the truth will make you free.”"},{"num":33,"verse":"They answered, “We are Abraham’s descendants. And we have never been slaves. So why do you say that we will be free?”"},{"num":34,"verse":"Jesus said, “The truth is, everyone who sins is a slave—a slave to sin."},{"num":35,"verse":"A slave does not stay with a family forever. But a son belongs to the family forever."},{"num":36,"verse":"So if the Son makes you free, you are really free."},{"num":37,"verse":"I know you are Abraham’s descendants. But you want to kill me, because you don’t want to accept my teaching."},{"num":38,"verse":"I am telling you what my Father has shown me. But you do what your father has told you.”"},{"num":39,"verse":"They said, “Our father is Abraham.”"},{"num":40,"verse":"I am someone who has told you the truth I heard from God. But you are trying to kill me. Abraham did nothing like that."},{"num":41,"verse":"So you are doing what your own father did.”"},{"num":42,"verse":"Jesus said to them, “If God were really your Father, you would love me. I came from God, and now I am here. I did not come by my own authority. God sent me."},{"num":43,"verse":"You don’t understand the things I say, because you cannot accept my teaching."},{"num":44,"verse":"Your father is the devil. You belong to him. You want to do what he wants. He was a murderer from the beginning. He was always against the truth. There is no truth in him. He is like the lies he tells. Yes, the devil is a liar. He is the father of lies."},{"num":45,"verse":"“I am telling you the truth, and that’s why you don’t believe me."},{"num":46,"verse":"Can any of you prove that I am guilty of sin? If I tell the truth, why don’t you believe me?"},{"num":47,"verse":"Whoever belongs to God accepts what he says. But you don’t accept what God says, because you don’t belong to God.”"},{"header":"Jesus Talks About Himself and Abraham"},{"num":48,"verse":"The Jews there answered, “We say you are a Samaritan. We say a demon is making you crazy! Are we not right when we say this?”"},{"num":49,"verse":"Jesus answered, “I have no demon in me. I give honor to my Father, but you give no honor to me."},{"num":50,"verse":"I am not trying to get honor for myself. There is one who wants this honor for me. He is the judge."},{"num":51,"verse":"I promise you, whoever continues to obey my teaching will never die.”"},{"num":52,"verse":"The Jews said to Jesus, “Now we know that you have a demon in you! Even Abraham and the prophets died. But you say, ‘Whoever obeys my teaching will never die.’"},{"num":53,"verse":"Do you think you are greater than our father Abraham? He died, and so did the prophets. Who do you think you are?”"},{"num":54,"verse":"Jesus answered, “If I give honor to myself, that honor is worth nothing. The one who gives me honor is my Father. And you say that he is your God."},{"num":55,"verse":"But you don’t really know him. I know him. If I said I did not know him, I would be a liar like you. But I do know him, and I obey what he says."},{"num":56,"verse":"Your father Abraham was very happy that he would see the day when I came. He saw that day and was happy.”"},{"num":57,"verse":"The Jews said to Jesus, “What? How can you say you have seen Abraham? You are not even 50 years old!”"},{"num":58,"verse":"Jesus answered, “The fact is, before Abraham was born, I Am.”"},{"num":59,"verse":"When he said this, they picked up stones to throw at him. But Jesus hid, and then he left the Temple area."}]