[{"header":"Micaiah Prophesies Against Ahab"},{"num":18,"verse":"Jehoshaphat had abundant riches and honor. He also formed a marriage alliance with Ahab."},{"num":2,"verse":"After some years passed, Jehoshaphat went down to visit Ahab in Samaria. Ahab sacrificed sheep and cattle in great numbers for him and for the troops with him. So Ahab persuaded him to go up against Ramoth Gilead."},{"num":3,"verse":"Ahab king of Israel said to Jehoshaphat king of Judah, “Will you go with me to Ramoth Gilead?”"},{"num":4,"verse":"But Jehoshaphat also said to the king of Israel, “Please seek the word of the Lord today.”"},{"num":5,"verse":"So the king of Israel assembled the prophets, four hundred men, and he said to them, “Should we go up to make war on Ramoth Gilead, or should I refrain?”"},{"num":6,"verse":"But Jehoshaphat said, “Is there no longer a prophet of the Lord here? We should inquire from him.”"},{"num":7,"verse":"Then the king of Israel said to Jehoshaphat, “There is still one man from whom we could inquire of the Lord, but I hate him because he doesn’t prophesy anything good about me. He continually prophesies only bad things. He is Micaiah son of Imlah.”"},{"num":8,"verse":"So the king of Israel summoned one of his officials and said, “Quickly bring Micaiah son of Imlah here.”"},{"num":9,"verse":"Now the king of Israel and Jehoshaphat king of Judah were sitting on their thrones, arrayed in their robes. They were sitting by the threshing floor at the entrance to the gate to Samaria, and all the prophets were prophesying before them."},{"num":10,"verse":"Zedekiah son of Kena’anah had made iron horns for himself, and he said, “This is what the Lord says. With these you will gore the Arameans until they are destroyed.” "},{"num":11,"verse":"All the prophets were prophesying in this same way: “Go up to Ramoth Gilead and triumph, for the Lord will give it into the hand of the king.”"},{"num":12,"verse":"The messenger who was sent to summon Micaiah said to him, “Pay attention to the words of the prophets. With one mouth they are promising good things to the king. Please! Your words should be like the words of one of them. You should say something good.”"},{"num":13,"verse":"But Micaiah said, “As surely as the Lord lives, whatever my God says, that is what I will say.”"},{"num":14,"verse":"Then he came to the king, and the king said to him, “Micaiah, should we go to Ramoth Gilead for battle, or should I refrain?”"},{"num":15,"verse":"The king said to him, “How many times must I make you swear to me that you will tell me nothing but the truth in the name of the Lord?”"},{"num":16,"verse":"Micaiah said, “I saw all Israel scattered on the mountains like sheep that have no shepherd. The Lord said, ‘They have no masters. Let each one return to his home in peace.’”"},{"num":17,"verse":"The king of Israel said to Jehoshaphat, “Didn’t I tell you that he does not prophesy anything good about me but only bad?”"},{"num":18,"verse":"Then Micaiah proclaimed:"},{"num":23,"verse":"Then Zedekiah son of Kena’anah came over and struck Micaiah on his cheek and said, “Where is this pathway on which the spirit of the Lord has traveled from me to speak to you?”"},{"num":24,"verse":"Micaiah said, “You will see on the day you go into the inner room to hide.”"},{"num":25,"verse":"Then the king of Israel said, “Seize Micaiah and take him back to Amon, the administrator of the city, and to Joash, son of the king. "},{"num":26,"verse":"You are to say to them, ‘This is what the king says. Put this man in prison and feed him nothing more than bread and water until I come back safely.’”"},{"num":27,"verse":"Micaiah said, “If you ever come back safely, then the Lord has not spoken through me.”"},{"header":"Ahab Dies in Battle"},{"num":28,"verse":"Then the king of Israel and Jehoshaphat king of Judah went up to Ramoth Gilead."},{"num":29,"verse":"The king of Israel said to Jehoshaphat, “I will disguise myself when I go into the battle, but you wear your robes.” So the king of Israel disguised himself, and they went into battle."},{"num":30,"verse":"The king of Aram had ordered his chariot commanders, “Do not fight against anyone, whether small or great, but only against the king of Israel.”"},{"num":31,"verse":"When the chariot commanders saw Jehoshaphat, they said, “That is the king of Israel!” So they turned to fight against him."},{"num":32,"verse":"When the chariot commanders realized that he was not the king of Israel, they stopped pursuing him."},{"num":33,"verse":"But a man shot an arrow at random and struck the king of Israel in the seam between two parts of his armor."},{"num":34,"verse":"The battle increased in intensity all that day. The king of Israel was propped up in his chariot facing Aram until evening. He died at sunset."}]