[{"header":"Jehoshaphat Allies with Ahab"},{"num":18,"verse":"Now Jehoshaphat had great riches and honor; and he allied himself by marriage to Ahab."},{"num":2,"verse":"Some years later he went down to visit Ahab at Samaria, and Ahab slaughtered many sheep and oxen for him and the people who were with him. And he incited him to go up against Ramoth-gilead."},{"num":3,"verse":"Ahab king of Israel said to Jehoshaphat king of Judah, “Will you go with me against Ramoth-gilead?” And he said to him, “I am as you are, and my people as your people, and we will be with you in the battle.”"},{"num":4,"verse":"However, Jehoshaphat said to the king of Israel, “Please request the word of the Lord first.”"},{"num":5,"verse":"So the king of Israel assembled the prophets, four hundred men, and said to them, “Should we go to battle against Ramoth-gilead, or should I refrain?” And they said, “Go up, for God will hand it over to the king.”"},{"num":6,"verse":"But Jehoshaphat said, “Is there no longer a prophet of the Lord here, that we may inquire of him?”"},{"num":7,"verse":"And the king of Israel said to Jehoshaphat, “There is still one man by whom we may inquire of the Lord, but I hate him, for he never prophesies anything good regarding me, but always bad. He is Micaiah the son of Imlah.” But Jehoshaphat said, “May the king not say so.”"},{"header":"Ahab’s False Prophets Assure Victory"},{"num":8,"verse":"Then the king of Israel summoned an officer and said, “Bring Micaiah son of Imlah quickly.”"},{"num":9,"verse":"Now the king of Israel and Jehoshaphat the king of Judah were sitting, each on his throne, dressed in their robes, and they were sitting at the threshing floor at the entrance of the gate of Samaria; and all the prophets were prophesying before them."},{"num":10,"verse":"Then Zedekiah the son of Chenaanah made horns of iron for himself and said, “This is what the Lord says: ‘With these you will gore the Arameans until they are destroyed!’”"},{"num":11,"verse":"All the prophets were prophesying this as well, saying, “Go up to Ramoth-gilead and be successful, for the Lord will hand it over to the king.”"},{"header":"Micaiah Brings Word from God"},{"num":12,"verse":"Then the messenger who went to summon Micaiah spoke to him saying, “Behold, the words of the prophets are unanimously favorable to the king. So please let your word be like one of them, and speak favorably.”"},{"num":13,"verse":"But Micaiah said, “As the Lord lives, whatever my God says, I will speak it.”"},{"num":14,"verse":"When he came to the king, the king said to him, “Micaiah, should we go to battle against Ramoth-gilead, or should I refrain?” He said, “Go up and succeed, for they will be handed over to you!”"},{"num":15,"verse":"Then the king said to him, “How many times must I make you swear that you will tell me nothing but the truth in the name of the Lord?”"},{"num":16,"verse":"So he said,"},{"num":17,"verse":"Then the king of Israel said to Jehoshaphat, “Did I not tell you that he would not prophesy anything good regarding me, but only bad?”"},{"num":18,"verse":"And Micaiah said, “Therefore, hear the word of the Lord. I saw the Lord sitting on His throne, and all the angels of heaven standing on His right and on His left."},{"num":19,"verse":"And the Lord said, ‘Who will entice Ahab king of Israel to go up and fall at Ramoth-gilead?’ And one spirit said this, while another said that."},{"num":20,"verse":"Then a spirit came forward and stood before the Lord and said, ‘I will entice him.’ And the Lord said to him, ‘How?’"},{"num":21,"verse":"He said, ‘I will go out and be a deceiving spirit in the mouths of all his prophets.’ Then He said, ‘You shall entice him, and you will also prevail. Go out and do so.’"},{"num":22,"verse":"Now therefore, behold, the Lord has put a deceiving spirit in the mouths of these prophets of yours, for the Lord has declared disaster against you.”"},{"num":23,"verse":"Then Zedekiah the son of Chenaanah approached and struck Micaiah on the cheek; and he said, “How did the Spirit of the Lord pass from me to speak to you?”"},{"num":24,"verse":"And Micaiah said, “Behold, you are going to see how on that day when you go from one inner room to another trying to hide yourself.”"},{"num":25,"verse":"Then the king of Israel said, “Take Micaiah and return him to Amon the governor of the city, and to Joash the king’s son;"},{"num":26,"verse":"and say, ‘This is what the king says: “Put this man in prison, and feed him enough bread and water to survive until I return safely.”’”"},{"num":27,"verse":"But Micaiah said, “If you actually return safely, the Lord has not spoken by me.” And he said, “Listen, all you people!”"},{"header":"Ahab’s Defeat and Death"},{"num":28,"verse":"So the king of Israel and Jehoshaphat king of Judah went up against Ramoth-gilead."},{"num":29,"verse":"And the king of Israel said to Jehoshaphat, “I will disguise myself and go into battle, but you put on your robes.” So the king of Israel disguised himself, and they went into battle."},{"num":30,"verse":"Now the king of Aram had commanded the commanders of his chariots, saying, “Do not fight with the small or great, but only with the king of Israel.”"},{"num":31,"verse":"So when the commanders of the chariots saw Jehoshaphat, they said, “He is the king of Israel!” And they turned aside to fight against him. But Jehoshaphat cried out, and the Lord helped him, and God diverted them from him."},{"num":32,"verse":"When the commanders of the chariots saw that it was not the king of Israel, they turned back from pursuing him."},{"num":33,"verse":"Now one man drew his bow at random and struck the king of Israel in a joint of the armor. So he said to the driver of his chariot, “Turn around and take me out of the battle, for I am severely wounded.”"},{"num":34,"verse":"The battle raged on that day, and the king of Israel propped himself up in his chariot in front of the Arameans until the evening; and at sunset he died."}]