[{"num":3,"verse":"Finally, my brethren, rejoice in the Lord. To write the same things to you, to me indeed is not irksome, but for you it is safe. "},{"num":2,"verse":"Beware of the dogs, beware of the evil workers, beware of the concision: "},{"num":3,"verse":"for we are the circumcision, who worship by the Spirit of God, and glory in Christ Jesus, and have no confidence in the flesh: "},{"num":4,"verse":"though I myself might have confidence even in the flesh: if any other man thinketh to have confidence in the flesh, I yet more: "},{"num":5,"verse":"circumcised the eighth day, of the stock of Israel, of the tribe of Benjamin, a Hebrew of Hebrews; as touching the law, a Pharisee; "},{"num":6,"verse":"as touching zeal, persecuting the church; as touching the righteousness which is in the law, found blameless. "},{"num":7,"verse":"Howbeit what things were gain to me, these have I counted loss for Christ. "},{"num":8,"verse":"Yea verily, and I count all things to be loss for the excellency of the knowledge of Christ Jesus my Lord: for whom I suffered the loss of all things, and do count them but refuse, that I may gain Christ, "},{"num":9,"verse":"and be found in him, not having a righteousness of mine own, even that which is of the law, but that which is through faith in Christ, the righteousness which is from God by faith: "},{"num":10,"verse":"that I may know him, and the power of his resurrection, and the fellowship of his sufferings, becoming conformed unto his death; "},{"num":11,"verse":"if by any means I may attain unto the resurrection from the dead. "},{"num":12,"verse":"Not that I have already obtained, or am already made perfect: but I press on, if so be that I may lay hold on that for which also I was laid hold on by Christ Jesus. "},{"num":13,"verse":"Brethren, I count not myself yet to have laid hold: but one thing I do, forgetting the things which are behind, and stretching forward to the things which are before, "},{"num":14,"verse":"I press on toward the goal unto the prize of the high calling of God in Christ Jesus. "},{"num":15,"verse":"Let us therefore, as many as are perfect, be thus minded: and if in anything ye are otherwise minded, this also shall God reveal unto you: "},{"num":16,"verse":"only, whereunto we have attained, by that same rule let us walk."},{"num":17,"verse":"Brethren, be ye imitators together of me, and mark them that so walk even as ye have us for an ensample. "},{"num":18,"verse":"For many walk, of whom I told you often, and now tell you even weeping, that they are the enemies of the cross of Christ: "},{"num":19,"verse":"whose end is perdition, whose god is the belly, and whose glory is in their shame, who mind earthly things. "},{"num":20,"verse":"For our citizenship is in heaven; whence also we wait for a Saviour, the Lord Jesus Christ: "},{"num":21,"verse":"who shall fashion anew the body of our humiliation, that it may be conformed to the body of his glory, according to the working whereby he is able even to subject all things unto himself."}]