[{"num":3,"verse":"· ho Finally loipos,  my egō brethren adelphos,  rejoice chairō in en the  Lord kyrios.  To  write graphō the ho same autos things  again  to  you hymeis is  no ou trouble oknēros for  me egō,  and de it is a  safeguard asphalēs for  you hymeis. "},{"num":2,"verse":"Beware blepō of  the ho dogs kyōn,  beware blepō of  the ho evil kakos workers ergatēs,  beware blepō of  those ho who  practice  mutilation katatomē. "},{"num":3,"verse":"For gar we hēmeis are eimi the ho true  circumcision peritomē,  who ho worship latreuō by  the  Spirit pneuma of  God theos and kai glory kauchaomai in en Christ Christos Jesus Iēsous and kai have peithō no ou confidence peithō in en the  flesh sarx— "},{"num":4,"verse":"even kai though kaiper I egō have echō reason pepoithēsis for  confidence  in en the  flesh sarx.  If ei anyone tis else allos thinks dokeō he  has  reason peithō for  confidence  in en the  flesh sarx,  I egō have  more mallon: "},{"num":5,"verse":"circumcised peritomē on  the  eighth oktaēmeros day , a member  of ek the  nation genos of  Israel Israēl,  of  the  tribe phylē of  Benjamin Beniamin, a  Hebrew Hebraios born  of ek Hebrews Hebraios.  In  regard kata to  the  law nomos, I was a  Pharisee Pharisaios; "},{"num":6,"verse":"as kata for  zeal zēlos, a  persecutor diōkō of  the ho church ekklēsia;  as kata for  the  righteousness dikaiosynē · ho set  forth ginomai in en the  law nomos, I was  blameless amemptos. "},{"num":7,"verse":"But alla whatever hostis things  were eimi gain kerdos to  me egō,  these houtos I  have  come  to  regard hēgeomai as  loss zēmia because dia of  · ho Christ Christos. "},{"num":8,"verse":"More  than  that alla,  I  regard hēgeomai all pas things  as eimi loss zēmia because dia of  the ho surpassing hyperechō worth  of ho knowing gnōsis Christ Christos Jesus Iēsous · ho my egō Lord kyrios,  for dia whom hos I have suffered the loss of  · ho all pas things  and kai regard hēgeomai them  as  rubbish skybalon,  in  order hina to  gain kerdainō Christ Christos"},{"num":9,"verse":"and kai be  found heuriskō in en him autos,  not mē having echō a  righteousness dikaiosynē of  my emos own  that ho comes  from ek the  Law nomos,  but alla that ho which  comes  through dia faith pistis in  Christ Christos,  the ho righteousness dikaiosynē from ek God theos that is based  on epi · ho faith pistis— "},{"num":10,"verse":"that ho I  may  know ginōskō him autos and kai the ho power dynamis of ho his autos resurrection anastasis and kai the ho fellowship koinōnia of ho his autos sufferings pathēma,  becoming symmorphizō like  him  in ho his autos death thanatos, "},{"num":11,"verse":"if ei somehow pōs I  may  attain katantaō the ho resurrection exanastasis · ho from ek the  dead nekros. "},{"num":12,"verse":"Not ou that hoti I  have  already ēdē obtained lambanō all this  or ē have  already ēdē reached teleioō my  goal ,  but de I  press diōkō on  in  order  to ei · kai make  it  my  own katalambanō because epi hos · kai Christ Christos Jesus Iēsous has  made  me  his  own katalambanō. "},{"num":13,"verse":"Brothers adelphos,  I egō do logizomai not ou consider logizomai to  have  made katalambanō it  my emautou own ;  but de this  one heis thing  I do:  forgetting epilanthanomai what ho lies  behind opisō and de reaching  out  to epekteinomai what ho lies  ahead emprosthen, "},{"num":14,"verse":"I  press  on diōkō toward kata the  goal skopos for eis the ho prize brabeion of  the ho upward anō call klēsis of ho God theos in en Christ Christos Jesus Iēsous. "},{"num":15,"verse":"So oun those hosos of  us  who  are  mature teleios should  take  this houtos point  of  view phroneō;  and kai if ei in  anything tis you  think phroneō differently heterōs,  that houtos too kai · ho God theos will  make  known apokalyptō to  you hymeis. "},{"num":16,"verse":"In  any  case plēn,  let  us  live stoicheō up  to eis what hos we  have  already autos attained phthanō.  · ho"},{"num":17,"verse":"Join ginomai in  following symmimētēs my egō example ,  brothers adelphos,  and kai pay  close  attention  to skopeō those ho who  are  living peripateō this  way houtōs,  as kathōs you  have echō us hēmeis as  an  example typos. "},{"num":18,"verse":"For gar many polys are  living peripateō ( I  have legō often pollakis told legō you hymeis about legō them hos but de now nyn tell legō you  even kai with  tears klaiō)  as ho enemies echthros of  the ho cross stauros of ho Christ Christos. "},{"num":19,"verse":"Their hos · ho end telos is  destruction apōleia,  their hos · ho god theos is  the ho belly koilia,  and kai they  · ho glory doxa in en · ho their autos shame aischunē.  Their ho minds  are  set  on phroneō · ho earthly epigeios things . "},{"num":20,"verse":"But gar our hēmeis · ho citizenship politeuma is hyparchō in en heaven ouranos, and it is  from ek there hos · kai that  we  eagerly  await apekdechomai a  Savior sōtēr, the  Lord kyrios Jesus Iēsous Christ Christos, "},{"num":21,"verse":"who hos will  transform metaschēmatizō · ho our hēmeis lowly tapeinōsis bodies sōma · ho into the  likeness symmorphos of ho his autos glorious doxa body sōma,  · ho by kata the ho power energeia that ho also kai enables dynamai him autos to  subject hypotassō all  things pas to  himself autos.  · ho"}]