[{"header":"Chapter 3"},{"num":1,"verse":"Finally, my brethren, rejoice in the Lord."},{"num":2,"verse":"Beware of the dogs! Beware of evil-doers! Beware of those who mutilate the flesh!"},{"num":3,"verse":"For we are the circumcision, we who worship by the Spirit of God and who boast in Christ Jesus and do not place any confidence in the flesh—"},{"num":4,"verse":"even though I too have reason for confidence in the flesh."},{"num":7,"verse":"All these I once regarded as assets, but now I have come to regard them as losses because of Christ."},{"num":8,"verse":"Even more than that, I count everything as loss because of the supreme good of knowing Christ Jesus my Lord. For his sake, I have suffered the loss of all other things, and I regard them as so much rubbish, in order that I may gain Christ"},{"num":9,"verse":"and be found in him."},{"num":12,"verse":"Racing toward the Goal. It is not that I have already attained this or have yet reached perfection. But I press on to take hold of that for which Christ once took hold of me."},{"num":13,"verse":"Brethren, I do not claim to have taken hold of it as yet. Only this one thing: forgetting what is behind and straining forward to what lies ahead,"},{"num":14,"verse":"I press on toward the finishing line to win the heavenly prize to which God has called me in Christ Jesus."},{"num":15,"verse":"Those of us who are mature should adopt this same attitude. If on any matter you have a different point of view, this too God will make clear to you."},{"num":16,"verse":"Only let us hold fast in our conduct to what we have already attained."},{"num":17,"verse":"Our Citizenship Is in Heaven. Brethren, join in imitating me, and take note of those who conduct themselves in accord with the model you have in us."},{"num":18,"verse":"As I have told you before, and now remind you with tears, many live as enemies of the cross of Christ."},{"num":19,"verse":"Their end is destruction. Their god is their stomach. Their glory is in their shame. Their minds are set on earthly things."},{"num":20,"verse":"But our citizenship is in heaven, and from there we await our Savior, the Lord Jesus Christ."},{"num":21,"verse":"He will transform our lowly bodies so that they will be conformed to his glorified body by the power that also enables him to make all things subject to himself."}]