[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O Lord God . . . O God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Three names of God—Adonai, Jehovah, Elohim.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That I may be at once avenged of the Philistines.—Again we see that Samson stood at a comparatively low level of spiritual enlightenment as well as of moral purity. One cannot help feeling that Milton has read into the hero’s character an austere grandeur which it did not possess. His Samson of the Samson Agonistes is rather Milton himself than the Jewish hero. That stern classic poem is the “thundering reverberation of a mighty spirit, struck by the plectrum of disappointment.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "That I may be at once avenged of the Philistines.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Again we see that Samson stood at a comparatively low level of spiritual enlightenment as well as of moral purity. One cannot help feeling that Milton has read into the hero’s character an austere grandeur which it did not possess. His Samson of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Samson Agonistes ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is rather Milton himself than the Jewish hero. That stern classic poem is the “thundering reverberation of a mighty spirit, struck by the plectrum of disappointment.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For my two eyes.—The words rendered “at once” in the previous clause may be rendered “that I may avenge myself the revenge of one of my two eyes.” If so, there seems to be in the words a grim jest, as though no vengeance would suffice for the fearful loss of both his eyes (LXX., “one revenge for my two eyes”), “one last tremendous deed, one last fearful jest.” There is a curious parallel to this achievement of Samson in the story of Cleo-medes of Astypalæa, who in revenge for a fine pulls down a pillar, and crushes the boys in a school (Pausan. Perieg. Vi. 2, 3). Cassel tells us that on July 21st, 1864, many people were killed by the breaking of a granite pillar in the Church of the Transfiguration at St. Petersburg.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "For my two eyes.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words rendered “at once” in the previous clause may be rendered “that I may avenge myself ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the revenge of one ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of my two eyes.” If so, there seems to be in the words a grim jest, as though no vengeance would suffice for the fearful loss of both his eyes (LXX., “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "one ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "revenge for my ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "two ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "eyes”), “one last tremendous deed, one last fearful jest.” There is a curious parallel to this achievement of Samson in the story of Cleo-medes of Astypalæa, who in revenge for a fine pulls down a pillar, and crushes the boys in a school (Pausan. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Perieg. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Vi. 2, 3). Cassel tells us that on July 21st, 1864, many people were killed by the breaking of a granite pillar in the Church of the Transfiguration at St. Petersburg.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 16:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 16:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samson called unto the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This prayer proceeded not from malice and revenge, but from faith in, and zeal for, God, who was there publicly dishonoured, and from a concern to vindicate the whole commonwealth of Israel, which it was his duty to do to the uttermost of his power, as he was judge. And God, who heareth not sinners, and would never exert his omnipotence to gratify any man’s malice, manifested by the effect that he accepted and owned Samson’s prayer as the dictate of his own Spirit. And although, in this prayer, he mentions only the personal injuries done by the Philistines to himself, and not the indignities which they had offered to God and his people, yet that may be ascribed to the prudent care which he had manifested upon former occasions, to draw the rage of the Philistines upon himself alone, and divert it from the people. For which end, it is supposed that this prayer was made by him with an audible voice, though he knew the Philistines would entertain it only with scorn and laughter. “We must always consider Samson,” says Dr. Dodd, “in the light of an extraordinary person, immediately raised up by God for the chastisement of the Philistines. In this view, his death was heroic, as he voluntarily sacrificed himself, by the only means in his power, to the service of his country, in the destruction of those who had, in a base manner, insulted him and his God, and who, holding Israel in bondage, vainly imagined their Dagon superior to the eternal ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Indeed, as the same author observes further, “Samson was unquestionably a very singular type of the Messiah; called and sanctified in and from the womb; set apart to deliver his people out of the hands of all their enemies; performing all by his own personal strength alone, without assistant, and almost without weapons, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and in his death evidently doing more than in his life, thereby destroying the power of the devil, and triumphing over all his enemies,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:25-31 Nothing fills up the sins of any person or people faster than mocking and misusing the servants of God, even thought it is by their own folly that they are brought low. God put it into Samson's heart, as a public person, thus to avenge on them God's quarrel, Israel's, and his own. That strength which he had lost by sin, he recovers by prayer. That it was not from passion or personal revenge, but from holy zeal for the glory of God and Israel, appears from God's accepting and answering the prayer. The house was pulled down, not by the natural strength of Samson, but by the almighty power of God. In his case it was right he should avenge the cause of God and Israel. Nor is he to be accused of self-murder. He sought not his own death, but Israel's deliverance, and the destruction of their enemies. Thus Samson died in bonds, and among the Philistines, as an awful rebuke for his sins; but he died repentant. The effects of his death typified those of the death of Christ, who, of his own will, laid down his life among transgressors, and thus overturned the foundation of Satan's kingdom, and provided for the deliverance of his people. Great as was the sin of Samson, and justly as he deserved the judgments he brought upon himself, he found mercy of the Lord at last; and every penitent shall obtain mercy, who flees for refuge to that Saviour whose blood cleanses from all sin. But here is nothing to encourage any to indulge sin, from a hope they shall at last repent and be saved.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At once avenged - \"i. e. with one final revenge.\" These words do not breathe the spirit of the Gospel, but they express a sentiment, natural to the age, knowledge, and character of Samson. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. Samson called unto the Lord—His penitent and prayerful spirit seems clearly to indicate that this meditated act was not that of a vindictive suicide, and that he regarded himself as putting forth his strength in his capacity of a public magistrate. He must be considered, in fact, as dying for his country's cause. His death was not designed or sought, except as it might be the inevitable consequence of his great effort. His prayer must have been a silent ejaculation, and, from its being revealed to the historian, approved and accepted of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This prayer was not an act of malice and revenge, but of faith and zeal for God, who was there publicly dishonoured; and justice, in punishing their insolences, and vindicating the whole commonwealth of Israel, which was his duty, as he was judge, to do. And this is manifest from hence, because God, who heareth not sinners, and would never use his omnipotency to gratify any man’s impotent malice, did manifest by the effect that he accepted and owned his prayer, as the dictate of his own Spirit. And that in this prayer he mentions only his personal injury, the loss of his eyes, and not their indignities to God and his people, must be ascribed to that prudent care which he had, and declared upon former occasions, of deriving the rage and hatred of the Philistines upon himself alone, and diverting it from the people. For which end I conceive this prayer was made with an audible voice, though he knew they would entertain it only with scorn and laughter, which also he knew would quickly be turned into mourning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Samson called unto the Lord,.... In an ejaculatory manner, by mental prayer; though he might possibly express it aloud, without being heard and observed by the people, amidst their noise and mirth; and if it was heard, it might only furnish out more ridicule and contempt; and be it as it may, the prayer must have been preserved by the Lord himself, and given by inspiration to the writer of this book; since there were none that heard it that lived to relate it to others, no, not Samson himself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, O Lord God, remember me, I pray thee; the office that I bear as judge of Israel, the reproaches cast upon me, and which fall upon thy people, cause, and interest; remember thy lovingkindness, formerly expressed to me, the gracious promises made unto me, and the help and assistance I have had from thee: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and strengthen me, I pray thee, only this once, O God; and it was a prayer of faith, as appears by its being heard, accepted, and answered; and shows that his strength did not come with his hair, but was owing to the immediate communication of it from the Lord: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I may be at once avenged of the Philistines for my two eyes; once for all, and no more; take his last and final vengeance on them; or one vengeance for his two eyes, or vengeance for one of his two eyes; either senses will bear. This was said not from a private spirit of revenge for personal injuries; but as a civil magistrate, a judge of Israel, whose office it was to be a revenger, to execute wrath; and though he mentions only his own eyes, yet he suffered the loss of them, and every other indignity and injury, as a public person, the common enemy of the Philistines, and destroyer of their country, and protector of Israel; and in this character he now acted. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that I may be at once avenged of the Philistines for my two eyes; once for all, and no more; take his last and final vengeance on them; or one vengeance for his two eyes, or vengeance for one of his two eyes; either senses will bear. This was said not from a private spirit of revenge for personal injuries; but as a civil magistrate, a judge of Israel, whose office it was to be a revenger, to execute wrath; and though he mentions only his own eyes, yet he suffered the loss of them, and every other indignity and injury, as a public person, the common enemy of the Philistines, and destroyer of their country, and protector of Israel; and in this character he now acted. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Samson called unto the LORD, and said, O Lord GOD, remember me, I pray thee, and strengthen me, I pray thee, only this once, O God, that I may be at once {n} avenged of the Philistines for my two eyes.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Samson called unto the LORD, and said, O Lord GOD, remember me, I pray thee, and strengthen me, I pray thee, only this once, O God, that I may be at once ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " avenged of the Philistines for my two eyes.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) According to my calling which is to execute God's judgments on the wicked.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that I may be at once avenged",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A questionable rendering; follow the mg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that I may be avenged … for one of my two eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The grim humour of the words, as Moore points out, is altogether in character. The utmost vengeance would barely compensate for the loss of one eye alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Samson called unto the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is the first mention we have of Samson praying since the memorable occasion when he gave the fountain the name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "En-hakkoreh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note). Perhaps we may see in this an evidence that his affliction and shame had not been without their effect, in bringing him back to God humbled and penitent. The language is very earnest. \"O Lord, Jehovah, remember me  strengthen me only this once, O God!\" The threefold name by which he addresses the Almighty implies great tension of spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That I may be at once avenged",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Meaning ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "at one stroke",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  - he would take one vengeance so terrible that it would be sufficient for his two eyes, which makes very good sense if the Hebrew will bear it. The literal translation would be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that I may be avenged with a vengeance of one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stroke. Others take it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that I may be avenged with a vengeance for one of my two eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which it is not easy to understand the meaning of. Judges 16:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Samson prayed to Jehovah, \"Lord Jehovah, remember me, and only this time make me strong. O God, that I may avenge myself (with) the revenge of one of my two eyes upon the Philistines,\" i.e., may take vengeance upon them for the loss of only one of my two eyes (משּׁתי, without Dagesh lene in the ת: see Ewald, 267, b.), - a sentence which shows how painfully he felt the loss of his two eyes, \"a loss the severity of which even the terrible vengeance which he was meditating could never outweigh\" (Bertheau).",
        "children": []
      }
    ]
  }
]