[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And wherewith thou mightest be bound.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The narrative, if taken as a full account of all that took place, would leave in the mind an impression of almost incredible fatuity on the part of Samson. The general lesson is that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Esdras 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “Many have gone out of their wits for women, and have become slaves on account of them; many have perished and erred and sinned by reason of women.” (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Eastern legends constantly show how women have deceived even prophets. But there was no reason why the sacred historian should linger over the details of scenes so unworthy. If Delilah spoke thus plainly at once, we can only imagine that she was professing to treat the whole matter as a jest. Josephus says: “When Samson was drinking, or at other moments, expressing admiration of his deeds, she kept scheming how to ascertain in what way he was so pre-eminent in valour.” An illustration may be found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Esdras 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “I saw Apame taking the crown from the king’s head and setting it on her own head; she also struck the king with her left hand, and yet for all that the king gaped and gazed upon her with open mouth. If she laughed upon him, he laughed; if she took displeasure at him, he flattered her, that she may be reconciled to him.” The genius of a great poet has depicted such wiles in the idyll of Merlin and Vivi-enne, and it is only by supposing that such wiles were put forth in this instance that we can retain credit for even the most ordinary sense on the part of the Danite hero. But his fault was not stupidity—it was sensual infatuation; and in the ruin and shame which this sensual weakness brought upon him, and the way in which, step by step, it led him to forfeit the great gift of God, lies the chief moral of the story. We find the same lesson in the legend of Hercules and Omphale; and even if this legend was not influenced by the story of Samson’s life, yet there is a general analogy between the character of the Greek and the Jewish hero. Samson was no Solomon, and yet the heart of even Solomon—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“. . . . though large,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Beguiled by fair idolatresses, fell.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 16:6-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 16:6-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wherewith thou mightest be bound to afflict thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This seems rather to express the sum of what Delilah aimed at than her very words. For it is scarcely credible that she put this question so openly to Samson, which would have discovered that she had some design against him. But, rather, she wormed it out of him by degrees, and in such an artful manner as gave him no cause of suspicion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samson said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Samson was guilty both of the sin of lying, and of great folly, in encouraging her inquiries, which he should at first have checked: but as he had forsaken God, so God had now forsaken him, otherwise the frequent repetition and vehement urging of this question might easily have raised suspicion in him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With seven green withs — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably osiers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The lords of the Philistines brought — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sent; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for it is not to be supposed they came themselves with these things.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:4-17 Samson had been more than once brought into mischief and danger by the love of women, yet he would not take warning, but is again taken in the same snare, and this third time is fatal. Licentiousness is one of the things that take away the heart. This is a deep pit into which many have fallen; but from which few have escaped, and those by a miracle of mercy, with the loss of reputation and usefulness, of almost all, except their souls. The anguish of the suffering is ten thousand times greater than all the pleasures of the sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the lords of the Philistines - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His great strength lieth - Rather, \"wherein his strength is great.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eleven hundred pieces of silver - The greatness of the bribe offered to Delilah, 5,500 shekels of silver, nearly two talents (Exodus 38:24, note), shows the importance attached to Samson's capture. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Eleven hundred pieces of silver - The greatness of the bribe offered to Delilah, 5,500 shekels of silver, nearly two talents (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", note), shows the importance attached to Samson's capture. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the lords of the Philistines—The five rulers deemed no means beneath their dignity to overcome this national enemy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Entice him, and see wherein his great strength lieth—They probably imagined that he carried some amulet about his person, or was in the possession of some important secret by which he had acquired such herculean strength; and they bribed Delilah, doubtless by a large reward, to discover it for them. She undertook the service and made several attempts, plying all her arts of persuasion or blandishment in his soft and communicative moods, to extract his secret.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherein thy great strength lieth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what is the cause of this prodigious strength, or wherein doth it consist? She seems to ask merely out of curiosity, to understand the state of a person whom she so highly values. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Delilah said to Samson,.... At a proper opportunity, when in his hands and caresses, as Josephus relates (e), and introduced it in an artful manner, admiring his strange exploits, and wondering how he could perform them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "tell me, I pray thee, wherein thy great strength lieth; which she proposed seemingly out of mere curiosity, and as it would be a proof of his affection to her, to impart the secret to her: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and wherewith thou mightest be bound to afflict thee; not that she suggested to him that she was desirous to have him afflicted, or to try the experiment herself in order to afflict him, but to know by what means, if he was bound, it would be afflicting to him so that he could not relieve himself; she knew he might be bound, if he would admit of it, as he had been, but she wanted to know how he might be bound, so as to be held, and could not loose himself. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Ut supra. (Antiqu. l. 5. c. 8. sect. 9.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Ut supra. (Antiqu. l. 5. c. 8. sect. 9.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Delilah said to Samson, Tell me, I pray thee, wherein thy great strength lieth, and wherewith thou mightest be bound to afflict thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Allured by the reward in prospect, Delilah now sought to get from him the secret of his strength. But he deceived her three times by false statements. He first of all said to her (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"If they bound me with strings that have not been dried, I should be weak and like one of the men\" (i.e., like any other man). יתר signifies a sinew or string, e.g., a bow-string, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in the different dialects either a bow-string or the string of a harp or guitar. As a distinction is made here between the יתרים and the עבתים in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the strings intended here are those of catgut or animal sinew. The number seven is that of a divine act, answering to the divine power which Samson possessed.",
        "children": []
      }
    ]
  }
]