[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:45-49 Judah and Jerusalem had been full of people, as a forest of trees, but empty of fruit. God's word prophesies against those who bring not forth the fruits of righteousness. When He will ruin a nation, who or what can save it? The plainest truths were as parables to the people. It is common for those who will not be wrought upon by the word, to blame it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Forest of the south - The land of Israel. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47. fire—every kind of judgment (Eze 19:12; 21:3, \"my sword\"; Jer 21:14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "green tree … dry—fit and unfit materials for fuel alike; \"the righteous and the wicked,\" as explained in Eze 21:3, 4; Lu 23:31. Unsparing universality of the judgment!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "flaming flame—one continued and unextinguished flame. \"The glowing flame\" [Fairbairn].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "faces—persons; here the metaphor is merged in the reality.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " That is, all the nations round about, near to them, shall clearly see, openly own it, as God’s own work, both kindling this fire, and continuing it till it hath consumed all which God would destroy by it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And all flesh shall see that I the Lord have kindled it,.... Not only the inhabitants of Jerusalem and Judea should see the hand of the Lord in their destruction; but even all the neighbouring nations, the case was so clear and plain, the matter so visible: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it shall not be quenched; no stop put to it by all the art and power of man; so that it was a clear point that it was the Lord's doing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "it shall not be quenched; no stop put to it by all the art and power of man; so that it was a clear point that it was the Lord's doing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And all flesh shall see that I the LORD have kindled it: it shall not be quenched.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Burning Forest",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 20:45. And the word of Jehovah came to me, saying, Ezekiel 20:46. Son of man, direct thy face toward the south, and trickle down towards the south, and prophesy concerning the forest of the field in the south land; Ezekiel 20:47. And say to the forest of the south land, Hear the word of Jehovah; Thus saith the Lord Jehovah, Behold, I kindle a fire in thee, which will consume in thee every green tree, and every dry tree: the blazing flame will not be extinguished, and all faces from the south to the north will be burned thereby. Ezekiel 20:48. And all flesh shall see that I, Jehovah, have kindled it: it shall not be extinguished. Ezekiel 20:49. And I said, Ah, Lord Jehovah! they say of me, Does he not speak in parables? - The prophet is to turn his face toward the south, and prophesy concerning the forest of the field there. הטּיף is used for prophesying, as in Amos 7:16 and Micah 2:6, Micah 2:11. The distinction between the three epithets applied to the south is the following: תּימן is literally that which lies on the right hand, hence the south is a particular quarter of the heavens; דּרום, which only occurs in Ezekiel and Ecclesiastes, with the exception of Deuteronomy 33:23 and Job 37:17, is derived from דּרר, to shine or emit streams of light, and probably signifies the brilliant quarter; נגב, the dry, parched land, is a standing epithet for the southern district of Palestine and the land of Judah (see the comm. on Joshua 15:21). - The forest of the field in the south is a figure denoting the kingdom of Judah (נגב is in apposition to השּׂדה, and is appended to it as a more precise definition). שׂדה is not used here for a field, as distinguished from a city or a garden; but for the fields in the sense of country or territory, as in Genesis 14:7 and Genesis 32:3. In Ezekiel 20:47, יער , forest of the south land, is the expression applied to the same object (הנגב, with the article, is a geographical term for the southern portion of Palestine). The forest is a figure signifying the population, or the mass of people. Individual men are trees. The green tree is a figurative representation of the righteous man, and the dry tree of the ungodly (Ezekiel 21:3, compare Luke 23:31). The fire which Jehovah kindles is the fire of war. The combination of the synonyms להבת שׁלהבת, flame of the flaming brightness, serves to strengthen the expression, and is equivalent to the strongest possible flame, the blazing fire. כּל־פּנים, all faces are not human faces or persons, in which case the prophet would have dropped the figure; but pânim denotes generally the outside of things, which is the first to feel the force of the flame. \"All the faces\" of the forest are every single thing in the forest, which is caught at once by the flame. In Ezekiel 21:4, kŏl-pânim (all faces) is interpreted by kŏl̇-bâsar (all flesh). From south to north, i.e., through the whole length of the land. From the terrible fierceness of the fire, which cannot be extinguished, every one will know that God has kindled it, that it has been sent in judgment. The words of the prophet himself, in Ezekiel 20:49, presuppose that he has uttered these parabolic words in the hearing of the people, and that they have ridiculed them as obscure (mâshâl is used here in the sense of obscure language, words difficult to understand, as παραβολή also is in Matthew 13:10). At the same time, it contains within itself request that they may be explained. This request is granted; and the simile is first of all interpreted in Ezekiel 21:1-7, and then still further expanded in Ezekiel 21:8. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And the word of Jehovah came to me, saying, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Son of man, direct thy face toward the south, and trickle down towards the south, and prophesy concerning the forest of the field in the south land; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And say to the forest of the south land, Hear the word of Jehovah; Thus saith the Lord Jehovah, Behold, I kindle a fire in thee, which will consume in thee every green tree, and every dry tree: the blazing flame will not be extinguished, and all faces from the south to the north will be burned thereby. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And all flesh shall see that I, Jehovah, have kindled it: it shall not be extinguished. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I said, Ah, Lord Jehovah! they say of me, Does he not speak in parables? - The prophet is to turn his face toward the south, and prophesy concerning the forest of the field there. הטּיף is used for prophesying, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The distinction between the three epithets applied to the south is the following: תּימן is literally that which lies on the right hand, hence the south is a particular quarter of the heavens; דּרום, which only occurs in Ezekiel and Ecclesiastes, with the exception of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 37:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is derived from דּרר, to shine or emit streams of light, and probably signifies the brilliant quarter; נגב, the dry, parched land, is a standing epithet for the southern district of Palestine and the land of Judah (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - The forest of the field in the south is a figure denoting the kingdom of Judah (נגב is in apposition to השּׂדה, and is appended to it as a more precise definition). שׂדה is not used here for a field, as distinguished from a city or a garden; but for the fields in the sense of country or territory, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", יער , forest of the south land, is the expression applied to the same object (הנגב, with the article, is a geographical term for the southern portion of Palestine). The forest is a figure signifying the population, or the mass of people. Individual men are trees. The green tree is a figurative representation of the righteous man, and the dry tree of the ungodly (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The fire which Jehovah kindles is the fire of war. The combination of the synonyms להבת שׁלהבת, flame of the flaming brightness, serves to strengthen the expression, and is equivalent to the strongest possible flame, the blazing fire. כּל־פּנים, all faces are not human faces or persons, in which case the prophet would have dropped the figure; but pânim denotes generally the outside of things, which is the first to feel the force of the flame. \"All the faces\" of the forest are every single thing in the forest, which is caught at once by the flame. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", kŏl-pânim (all faces) is interpreted by kŏl̇-bâsar (all flesh). From south to north, i.e., through the whole length of the land. From the terrible fierceness of the fire, which cannot be extinguished, every one will know that God has kindled it, that it has been sent in judgment. The words of the prophet himself, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", presuppose that he has uttered these parabolic words in the hearing of the people, and that they have ridiculed them as obscure (mâshâl is used here in the sense of obscure language, words difficult to understand, as παραβολή also is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). At the same time, it contains within itself request that they may be explained. This request is granted; and the simile is first of all interpreted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and then still further expanded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]