[{"num":14,"verse":"Joab knew that David couldn’t stop thinking about Absalom, "},{"num":2,"verse":"and he sent someone to bring in the wise woman who lived in Tekoa. Joab told her, “Put on funeral clothes and don’t use any makeup. Go to the king and pretend you have spent a long time mourning the death of a loved one.” Then he told her what to say."},{"num":4,"verse":"The woman from Tekoa went to David. She bowed very low and said, “Your Majesty, please help me!”"},{"num":5,"verse":"David asked, “What’s the matter?”"},{"num":8,"verse":"“Go on home,” David told her. “I’ll take care of this matter for you.”"},{"num":9,"verse":"The woman said, “I hope your decision doesn’t cause any problems for you. But if it does, you can blame me.”"},{"num":10,"verse":"He said, “If anyone gives you any trouble, bring them to me, and it won’t happen again!”"},{"num":11,"verse":"“Please,” she replied, “swear by the Lord your God that no one will be allowed to kill my son!”"},{"num":12,"verse":"Then she asked, “Your Majesty, may I say something?”"},{"num":13,"verse":"The woman said:"},{"num":18,"verse":"Then David said to the woman, “Now I’m going to ask you a question, and don’t try to hide the truth!”"},{"num":19,"verse":"David asked, “Did Joab put you up to this?”"},{"num":20,"verse":"but only to show you the other side of this problem. You must be as wise as the angel of God to know everything that goes on in this country.”"},{"num":21,"verse":"David turned to Joab and said, “It seems that I have already given my decision. Go and bring Absalom back.”"},{"num":22,"verse":"Joab bowed very low and said, “Your Majesty, I thank you for giving your permission. It shows that you approve of me.”"},{"num":23,"verse":"Joab went to Geshur to get Absalom. But when they came back to Jerusalem, "},{"num":24,"verse":"David told Joab, “I don’t want to see my son Absalom. Tell him to stay away from me.” So Absalom went to his own house without seeing his father."},{"header":"Absalom Was Handsome"},{"num":25,"verse":"No one in all Israel was as handsome and well-built as Absalom. "},{"num":26,"verse":"He got his hair cut once a year, and when the hair was weighed, it came to about five pounds."},{"num":27,"verse":"Absalom had three sons. He also had a daughter named Tamar, who grew up to be very beautiful."},{"header":"Absalom Finally Sees David"},{"num":28,"verse":"Absalom lived in Jerusalem for two years without seeing his father. "},{"num":29,"verse":"He wanted Joab to talk to David for him. So one day he sent a message asking Joab to come over, but Joab refused. Absalom sent another message, but Joab still refused. "},{"num":30,"verse":"Finally, Absalom told his servants, “Joab’s barley field is right next to mine. Go set it on fire!” And they did."},{"num":31,"verse":"Joab went to Absalom’s house and demanded, “Why did your servants set my field on fire?”"},{"num":32,"verse":"Absalom answered, “You didn’t pay any attention when I sent for you. I want you to ask my father why he told me to come back from Geshur. I was better off there. I want to see my father now! If I’m guilty, let him kill me.”"},{"num":33,"verse":"Joab went to David and told him what Absalom had said. David sent for Absalom, and Absalom came. He bowed very low, and David leaned over and kissed him."}]