[{"header":"Joab Arranges for Absalom’s Return"},{"num":14,"verse":"Joab realized how much the king longed to see Absalom."},{"num":2,"verse":"So he sent for a woman from Tekoa who had a reputation for great wisdom. He said to her, “Pretend you are in mourning; wear mourning clothes and don’t put on lotions. Act like a woman who has been mourning for the dead for a long time."},{"num":3,"verse":"Then go to the king and tell him the story I am about to tell you.” Then Joab told her what to say."},{"num":4,"verse":"When the woman from Tekoa approached the king, she bowed with her face to the ground in deep respect and cried out, “O king! Help me!”"},{"num":5,"verse":"“What’s the trouble?” the king asked."},{"num":6,"verse":"My two sons had a fight out in the field. And since no one was there to stop it, one of them was killed."},{"num":7,"verse":"Now the rest of the family is demanding, ‘Let us have your son. We will execute him for murdering his brother. He doesn’t deserve to inherit his family’s property.’ They want to extinguish the only coal I have left, and my husband’s name and family will disappear from the face of the earth.”"},{"num":8,"verse":"“Leave it to me,” the king told her. “Go home, and I’ll see to it that no one touches him.”"},{"num":9,"verse":"“Oh, thank you, my lord the king,” the woman from Tekoa replied. “If you are criticized for helping me, let the blame fall on me and on my father’s house, and let the king and his throne be innocent.”"},{"num":10,"verse":"“If anyone objects,” the king said, “bring him to me. I can assure you he will never harm you again!”"},{"num":11,"verse":"Then she said, “Please swear to me by the Lord your God that you won’t let anyone take vengeance against my son. I want no more bloodshed.”"},{"num":12,"verse":"“Please allow me to ask one more thing of my lord the king,” she said."},{"num":13,"verse":"She replied, “Why don’t you do as much for the people of God as you have promised to do for me? You have convicted yourself in making this decision, because you have refused to bring home your own banished son."},{"num":14,"verse":"All of us must die eventually. Our lives are like water spilled out on the ground, which cannot be gathered up again. But God does not just sweep life away; instead, he devises ways to bring us back when we have been separated from him."},{"num":15,"verse":"“I have come to plead with my lord the king because people have threatened me. I said to myself, ‘Perhaps the king will listen to me"},{"num":16,"verse":"and rescue us from those who would cut us off from the inheritance God has given us."},{"num":17,"verse":"Yes, my lord the king will give us peace of mind again.’ I know that you are like an angel of God in discerning good from evil. May the Lord your God be with you.”"},{"num":18,"verse":"“I must know one thing,” the king replied, “and tell me the truth.”"},{"num":19,"verse":"“Did Joab put you up to this?”"},{"num":20,"verse":"He did it to place the matter before you in a different light. But you are as wise as an angel of God, and you understand everything that happens among us!”"},{"num":21,"verse":"So the king sent for Joab and told him, “All right, go and bring back the young man Absalom.”"},{"num":22,"verse":"Joab bowed with his face to the ground in deep respect and said, “At last I know that I have gained your approval, my lord the king, for you have granted me this request!”"},{"num":23,"verse":"Then Joab went to Geshur and brought Absalom back to Jerusalem."},{"num":24,"verse":"But the king gave this order: “Absalom may go to his own house, but he must never come into my presence.” So Absalom did not see the king."},{"header":"Absalom Reconciled to David"},{"num":25,"verse":"Now Absalom was praised as the most handsome man in all Israel. He was flawless from head to foot."},{"num":26,"verse":"He cut his hair only once a year, and then only because it was so heavy. When he weighed it out, it came to five pounds!"},{"num":27,"verse":"He had three sons and one daughter. His daughter’s name was Tamar, and she was very beautiful."},{"num":28,"verse":"Absalom lived in Jerusalem for two years, but he never got to see the king."},{"num":29,"verse":"Then Absalom sent for Joab to ask him to intercede for him, but Joab refused to come. Absalom sent for him a second time, but again Joab refused to come."},{"num":30,"verse":"So Absalom said to his servants, “Go and set fire to Joab’s barley field, the field next to mine.” So they set his field on fire, as Absalom had commanded."},{"num":31,"verse":"Then Joab came to Absalom at his house and demanded, “Why did your servants set my field on fire?”"},{"num":32,"verse":"And Absalom replied, “Because I wanted you to ask the king why he brought me back from Geshur if he didn’t intend to see me. I might as well have stayed there. Let me see the king; if he finds me guilty of anything, then let him kill me.”"},{"num":33,"verse":"So Joab told the king what Absalom had said. Then at last David summoned Absalom, who came and bowed low before the king, and the king kissed him."}]