[[],[{"type":"prose","content":"The voice said to me, “Son of man, eat what I am giving you—eat this scroll! Then go and give its message to the people of Israel.”"}],[{"type":"prose","content":"So I opened my mouth, and he fed me the scroll."}],[{"type":"prose","content":"“Fill your stomach with this,” he said. And when I ate it, it tasted as sweet as honey in my mouth."}],[{"type":"prose","content":"Then he said, “Son of man, go to the people of Israel and give them my messages."}],[{"type":"prose","content":"I am not sending you to a foreign people whose language you cannot understand."}],[{"type":"prose","content":"No, I am not sending you to people with strange and difficult speech. If I did, they would listen!"}],[{"type":"prose","content":"But the people of Israel won’t listen to you any more than they listen to me! For the whole lot of them are hard-hearted and stubborn."}],[{"type":"prose","content":"But look, I have made you as obstinate and hard-hearted as they are."}],[{"type":"prose","content":"I have made your forehead as hard as the hardest rock! So don’t be afraid of them or fear their angry looks, even though they are rebels.”"}],[{"type":"prose","content":"Then he added, “Son of man, let all my words sink deep into your own heart first. Listen to them carefully for yourself."}],[{"type":"prose","content":"Then go to your people in exile and say to them, ‘This is what the Sovereign LORD says!’ Do this whether they listen to you or not.”"}],[{"type":"prose","content":"Then the Spirit lifted me up, and I heard a loud rumbling sound behind me. (May the glory of the LORD be praised in his place!)"}],[{"type":"prose","content":"It was the sound of the wings of the living beings as they brushed against each other and the rumbling of their wheels beneath them."}],[{"type":"prose","content":"The Spirit lifted me up and took me away. I went in bitterness and turmoil, but the LORD’s hold on me was strong."}],[{"type":"prose","content":"Then I came to the colony of Judean exiles in Tel-abib, beside the Kebar River. I was overwhelmed and sat among them for seven days."}],[{"type":"header","content":"A Watchman for Israel"},{"type":"prose","content":"After seven days the LORD gave me a message. He said,"}],[{"type":"prose","content":"“Son of man, I have appointed you as a watchman for Israel. Whenever you receive a message from me, warn people immediately."}],[{"type":"prose","content":"If I warn the wicked, saying, ‘You are under the penalty of death,’ but you fail to deliver the warning, they will die in their sins. And I will hold you responsible for their deaths."}],[{"type":"prose","content":"If you warn them and they refuse to repent and keep on sinning, they will die in their sins. But you will have saved yourself because you obeyed me."}],[{"type":"prose","content":"“If righteous people turn away from their righteous behavior and ignore the obstacles I put in their way, they will die. And if you do not warn them, they will die in their sins. None of their righteous acts will be remembered, and I will hold you responsible for their deaths."}],[{"type":"prose","content":"But if you warn righteous people not to sin and they listen to you and do not sin, they will live, and you will have saved yourself, too.”"}],[{"type":"prose","content":"Then the LORD took hold of me and said, “Get up and go out into the valley, and I will speak to you there.”"}],[{"type":"prose","content":"So I got up and went, and there I saw the glory of the LORD, just as I had seen in my first vision by the Kebar River. And I fell face down on the ground."}],[{"type":"prose","content":"Then the Spirit came into me and set me on my feet. He spoke to me and said, “Go to your house and shut yourself in."}],[{"type":"prose","content":"There, son of man, you will be tied with ropes so you cannot go out among the people."}],[{"type":"prose","content":"And I will make your tongue stick to the roof of your mouth so that you will be speechless and unable to rebuke them, for they are rebels."}],[{"type":"prose","content":"But when I give you a message, I will loosen your tongue and let you speak. Then you will say to them, ‘This is what the Sovereign LORD says!’ Those who choose to listen will listen, but those who refuse will refuse, for they are rebels."}]]