[{"num":3,"verse":"Then He said to me, “Son of man, eat what is in front of you. Eat this book, then go and speak to the people of Israel.” "},{"num":2,"verse":"So I opened my mouth, and He fed me this book. "},{"num":3,"verse":"And He said to me, “Son of man, eat this book that I give you and fill your stomach with it.” So I ate it, and it was as sweet as honey in my mouth."},{"num":4,"verse":"Then He said to me, “Son of man, go to the people of Israel, and speak My words to them. "},{"num":5,"verse":"For you are not being sent to people of strange speech and a hard language, but to the people of Israel. "},{"num":6,"verse":"You are not being sent to many people of strange speech and a hard language whom you cannot understand. If I had sent you to them, they would have listened to you. "},{"num":7,"verse":"But the people of Israel will not listen to you, for they are not willing to listen to Me. All the people of Israel are strong-willed and show no respect. "},{"num":8,"verse":"See, I have made you as strong-willed and as hard as they are. "},{"num":9,"verse":"I have made your forehead harder than the hardest stone. Do not be afraid of them. Do not be afraid of how they look, even if they do not obey Me.” "},{"num":10,"verse":"He said to me, “Son of man, take all My words that I say to you into your heart, and hear with your ears. "},{"num":11,"verse":"Then go to the Jews who have been taken away from their land. Go to the sons of your people. And if they listen or not, tell them, ‘This is what the Lord God says.’”"},{"num":12,"verse":"Then the Spirit lifted me up, and I heard a loud sounding voice behind me say, “Great is the shining-greatness of the Lord from His place.” "},{"num":13,"verse":"I heard the sound of the wings of the living beings touching one another, and the sound of the wheels beside them. It was a loud rushing sound. "},{"num":14,"verse":"The Spirit lifted me up and took me away. And I went with a bitter and angry spirit. The hand of the Lord was strong upon me. "},{"num":15,"verse":"Then I came to the Jews who had been taken from their land and who lived by the Chebar River at Tel-abib. I sat among them seven days where they were living, and I was filled with fear."},{"header":"Ezekiel to Watch Over Israel"},{"num":16,"verse":"At the end of seven days the Word of the Lord came to me, saying, "},{"num":17,"verse":"“Son of man, I have chosen you to be a watchman over the people of Israel. Whenever you hear a word from My mouth, tell them of the danger. "},{"num":18,"verse":"If I say to the sinful man, ‘You will die for sure,’ and you do not tell him of the danger, and try to turn him from his sinful way so that he may live, that sinful man will die in his sin. But you will be guilty for his blood. "},{"num":19,"verse":"But if you tell a sinful man of the danger he is in, and he does not turn from his sins or from his sinful way, then he will die in his sin. But you will have saved yourself. "},{"num":20,"verse":"Again, if a right and good man turns away from his right and good way and sins, and I put a cause of falling in his way, he will die. Because you have not told him of the danger, he will die in his sin, and the right and good things he has done will not be remembered. But you will be guilty for his blood. "},{"num":21,"verse":"Yet if you have told the right and good man of the danger of his sinning, and he does not sin, he will live for sure because he listened to you. And you will have saved yourself.”"},{"header":"Ezekiel Is Not Able to Speak"},{"num":22,"verse":"The hand of the Lord was upon me there, and He said to me, “Get up, go out to the plain, and I will speak to you there.” "},{"num":23,"verse":"So I got up and went out to the plain, and saw the shining-greatness of the Lord standing there. It was like the shining-greatness which I saw by the Chebar River, and I fell on my face. "},{"num":24,"verse":"Then the Spirit came into me and made me stand on my feet. And He spoke and said to me, “Go, shut yourself up in your house. "},{"num":25,"verse":"As for you, son of man, they will put ropes on you and tie you up with them, so that you cannot go out among the people. "},{"num":26,"verse":"And I will make your tongue stick to the roof of your mouth so that you cannot speak. You will not be able to speak sharp words to them, for they will not obey Me. "},{"num":27,"verse":"But when I speak to you, I will open your mouth, and you will tell them, ‘This is what the Lord God says.’ He who hears, let him hear. And he who is not willing to hear, let him not be willing. For they are a sinful people."}]