[{"header":"The Death of Ahab"},{"num":22,"verse":"For three years there was peace between Israel and Aram. "},{"num":2,"verse":"During the third year Jehoshaphat king of Judah went to visit Ahab king of Israel."},{"num":3,"verse":"At that time Ahab asked his officers, “Do you remember that the king of Aram took Ramoth in Gilead from us? Why have we done nothing to get it back?” "},{"num":4,"verse":"So Ahab asked King Jehoshaphat, “Will you go with me to fight at Ramoth in Gilead?”"},{"num":5,"verse":"Jehoshaphat also said to Ahab, “But first we should ask if this is the Lord’s will.”"},{"num":6,"verse":"Ahab called about four hundred prophets together and asked them, “Should I go to war against Ramoth in Gilead or not?”"},{"num":7,"verse":"But Jehoshaphat asked, “Isn’t there a prophet of the Lord here? Let’s ask him what we should do.”"},{"num":8,"verse":"Then King Ahab said to Jehoshaphat, “There is one other prophet. We could ask the Lord through him, but I hate him. He never prophesies anything good about me, but something bad. He is Micaiah son of Imlah.”"},{"num":9,"verse":"So Ahab king of Israel told one of his officers to bring Micaiah to him at once."},{"num":10,"verse":"Ahab king of Israel and Jehoshaphat king of Judah had on their royal robes and were sitting on their thrones at the threshing floor, near the entrance to the gate of Samaria. All the prophets were standing before them, speaking their messages. "},{"num":11,"verse":"Zedekiah son of Kenaanah had made some iron horns. He said to Ahab, “This is what the Lord says, ‘You will use these horns to fight the Arameans until they are destroyed.’”"},{"num":12,"verse":"All the other prophets said the same thing. “Attack Ramoth in Gilead and win, because the Lord will hand the Arameans over to you.”"},{"num":13,"verse":"The messenger who had gone to get Micaiah said to him, “All the other prophets are saying King Ahab will succeed. You should agree with them and give the king a good answer.”"},{"num":14,"verse":"But Micaiah answered, “As surely as the Lord lives, I can tell him only what the Lord tells me.”"},{"num":15,"verse":"When Micaiah came to Ahab, the king asked him, “Micaiah, should we attack Ramoth in Gilead or not?”"},{"num":16,"verse":"But Ahab said to Micaiah, “How many times do I have to tell you to speak only the truth to me in the name of the Lord?”"},{"num":17,"verse":"So Micaiah answered, “I saw the army of Israel scattered over the hills like sheep without a shepherd. The Lord said, ‘They have no leaders. They should go home and not fight.’”"},{"num":18,"verse":"Then Ahab king of Israel said to Jehoshaphat, “I told you! He never prophesies anything good about me, but only bad.”"},{"num":19,"verse":"But Micaiah said, “Hear the message from the Lord: I saw the Lord sitting on his throne with his heavenly army standing near him on his right and on his left. "},{"num":20,"verse":"The Lord said, ‘Who will trick Ahab into attacking Ramoth in Gilead where he will be killed?’"},{"num":21,"verse":"Then one spirit came and stood before the Lord and said, ‘I will trick him.’"},{"num":22,"verse":"“The Lord asked, ‘How will you do it?’"},{"num":23,"verse":"Micaiah said, “Ahab, the Lord has made your prophets lie to you, and the Lord has decided that disaster should come to you.”"},{"num":24,"verse":"Then Zedekiah son of Kenaanah went up to Micaiah and slapped him in the face. Zedekiah said, “Has the Lord’s spirit left me to speak through you?”"},{"num":25,"verse":"Micaiah answered, “You will find out on the day you go to hide in an inside room.”"},{"num":26,"verse":"Then Ahab king of Israel ordered, “Take Micaiah and send him to Amon, the governor of the city, and to Joash, the king’s son. "},{"num":27,"verse":"Tell them I said to put this man in prison and give him only bread and water until I return safely from the battle.”"},{"num":28,"verse":"Micaiah said, “Ahab, if you come back safely from battle, the Lord has not spoken through me. Remember my words, all you people!”"},{"num":29,"verse":"So Ahab king of Israel and Jehoshaphat king of Judah went to Ramoth in Gilead. "},{"num":30,"verse":"King Ahab said to Jehoshaphat, “I will go into battle, but I will wear other clothes so no one will recognize me. But you wear your royal clothes.” So Ahab wore other clothes and went into battle."},{"num":31,"verse":"The king of Aram had ordered his thirty-two chariot commanders, “Don’t fight with anyone—important or unimportant—except the king of Israel.” "},{"num":32,"verse":"When these commanders saw Jehoshaphat, they thought he was certainly the king of Israel, so they turned to attack him. But Jehoshaphat began shouting. "},{"num":33,"verse":"When they saw he was not King Ahab, they stopped chasing him."},{"num":34,"verse":"By chance, a soldier shot an arrow, but he hit Ahab king of Israel between the pieces of his armor. King Ahab said to his chariot driver, “Turn around and get me out of the battle, because I am hurt!” "},{"num":35,"verse":"The battle continued all day. King Ahab was held up in his chariot and faced the Arameans. His blood flowed down to the bottom of the chariot. That evening he died. "},{"num":36,"verse":"Near sunset a cry went out through the army of Israel: “Each man go back to his own city and land.”"},{"num":37,"verse":"In that way King Ahab died. His body was carried to Samaria and buried there. "},{"num":38,"verse":"The men cleaned Ahab’s chariot at a pool in Samaria where prostitutes bathed, and the dogs licked his blood from the chariot. These things happened as the Lord had said they would."},{"num":39,"verse":"Everything else Ahab did is written in the book of the history of the kings of Israel. It tells about the palace Ahab built and decorated with ivory and the cities he built. "},{"num":40,"verse":"So Ahab died, and his son Ahaziah became king in his place."},{"header":"Jehoshaphat King of Judah"},{"num":41,"verse":"Jehoshaphat son of Asa became king of Judah during Ahab’s fourth year as king of Israel. "},{"num":42,"verse":"Jehoshaphat was thirty-five years old when he became king, and he ruled in Jerusalem for twenty-five years. His mother’s name was Azubah daughter of Shilhi. "},{"num":43,"verse":"Jehoshaphat was good, like his father Asa, and he did what the Lord said was right. But Jehoshaphat did not destroy the places where gods were worshiped, so the people continued offering sacrifices and burning incense there. "},{"num":44,"verse":"Jehoshaphat was at peace with the king of Israel. "},{"num":45,"verse":"Jehoshaphat fought many wars, and these wars and his successes are written in the book of the history of the kings of Judah. "},{"num":46,"verse":"There were male prostitutes still in the places of worship from the days of his father, Asa. So Jehoshaphat forced them to leave."},{"num":47,"verse":"During this time the land of Edom had no king; it was ruled by a governor."},{"num":48,"verse":"King Jehoshaphat built trading ships to sail to Ophir for gold. But the ships were wrecked at Ezion Geber, so they never set sail. "},{"num":49,"verse":"Ahaziah son of Ahab went to help Jehoshaphat, offering to give Jehoshaphat some men to sail with his men, but Jehoshaphat refused."},{"num":50,"verse":"Jehoshaphat died and was buried with his ancestors in Jerusalem, the city of David, his ancestor. Then his son Jehoram became king in his place."},{"header":"Ahaziah King of Israel"},{"num":51,"verse":"Ahaziah son of Ahab became king of Israel in Samaria during Jehoshaphat’s seventeenth year as king over Judah. Ahaziah ruled Israel for two years, "},{"num":52,"verse":"and he did what the Lord said was wrong. He did the same evil his father Ahab, his mother Jezebel, and Jeroboam son of Nebat had done. All these rulers led the people of Israel into more sin. "},{"num":53,"verse":"Ahaziah worshiped and served the god Baal, and this made the Lord, the God of Israel, very angry. In these ways Ahaziah did what his father had done."}]