[{"num":22,"verse":"For three years there was no war between Syria and Israel. "},{"num":2,"verse":"But during the third year, while King Jehoshaphat of Judah was visiting King Ahab of Israel, "},{"num":3,"verse":"Ahab said to his officials, “Do you realize that the Syrians are still occupying our city of Ramoth-gilead? And we’re sitting here without doing a thing about it!”"},{"num":4,"verse":"Then he turned to Jehoshaphat and asked him, “Will you send your army with mine to recover Ramoth-gilead?”"},{"num":5,"verse":"But,” he added, “we should ask the Lord first, to be sure of what he wants us to do.”"},{"num":6,"verse":"So King Ahab summoned his 400 heathen prophets and asked them, “Shall I attack Ramoth-gilead, or not?”"},{"num":7,"verse":"But Jehoshaphat asked, “Isn’t there a prophet of the Lord here? I’d like to ask him too.”"},{"num":8,"verse":"“Well, there’s one,” King Ahab replied, “but I hate him, for he never prophesies anything good. He always has something gloomy to say. His name is Micaiah, the son of Imlah.”"},{"num":9,"verse":"So King Ahab called to one of his aides, “Go get Micaiah. Hurry!”"},{"num":10,"verse":"Meanwhile, all the prophets continued prophesying before the two kings, who were dressed in their royal robes and were sitting on thrones placed on the threshing floor near the city gate. "},{"num":11,"verse":"One of the prophets, Zedekiah (son of Chenaanah), made some iron horns and declared, “The Lord promises that you will push the Syrians around with these horns until they are destroyed.”"},{"num":12,"verse":"And all the others agreed. “Go ahead and attack Ramoth-gilead,” they said, “for the Lord will cause you to triumph!”"},{"num":13,"verse":"The messenger who went to get Micaiah told him what the other prophets were saying and urged him to say the same thing."},{"num":14,"verse":"But Micaiah told him, “This I vow, that I will say only what the Lord tells me to!”"},{"num":15,"verse":"When he arrived, the king asked him, “Micaiah, shall we attack Ramoth-gilead, or not?”"},{"num":16,"verse":"“How many times must I tell you to speak only what the Lord tells you to?” the king demanded."},{"num":17,"verse":"Then Micaiah told him, “I saw all Israel scattered upon the mountains as sheep without a shepherd. And the Lord said, ‘Their king is dead; send them to their homes.’”"},{"num":18,"verse":"Turning to Jehoshaphat, Ahab complained, “Didn’t I tell you this would happen? He never tells me anything good. It’s always bad.”"},{"num":19,"verse":"Then Micaiah said, “Listen to this further word from the Lord. I saw the Lord sitting on his throne, and the armies of heaven stood around him."},{"num":20,"verse":"“Then the Lord said, ‘Who will entice Ahab to go and die at Ramoth-gilead?’"},{"num":21,"verse":"until one angel approached the Lord and said, ‘I’ll do it!’"},{"num":22,"verse":"“‘How?’ the Lord asked."},{"num":23,"verse":"“Don’t you see? The Lord has put a lying spirit in the mouths of all these prophets, but the fact of the matter is that the Lord has decreed disaster upon you.”"},{"num":24,"verse":"Then Zedekiah (son of Chenaanah) walked over and slapped Micaiah on the face."},{"num":25,"verse":"And Micaiah replied, “You will have the answer to your question when you find yourself hiding in an inner room.”"},{"num":26,"verse":"Then King Ahab ordered Micaiah’s arrest."},{"num":27,"verse":"Tell them, ‘The king says to put this fellow in jail and feed him with bread and water—and only enough to keep him alive—until I return in peace.’”"},{"num":28,"verse":"“If you return in peace,” Micaiah replied, “it will prove that the Lord has not spoken through me.” Then he turned to the people standing nearby and said, “Take note of what I’ve said.”"},{"num":29,"verse":"So King Ahab of Israel and King Jehoshaphat of Judah led their armies to Ramoth-gilead."},{"num":30,"verse":"Ahab said to Jehoshaphat, “You wear your royal robes, but I’ll not wear mine!”"},{"num":31,"verse":"For the king of Syria had commanded his thirty-two chariot captains to fight no one except King Ahab himself. "},{"num":32,"verse":"When they saw King Jehoshaphat in his royal robes, they thought, “That’s the man we’re after.” So they wheeled around to attack him. But when Jehoshaphat shouted out to identify himself, they turned back! "},{"num":34,"verse":"However, someone shot an arrow at random and it struck King Ahab between the joints of his armor."},{"num":35,"verse":"The battle became more and more intense as the day wore on, and King Ahab went back in, propped up in his chariot with the blood from his wound running down onto the floorboards. Finally, toward evening, he died. "},{"num":36,"verse":"Just as the sun was going down the cry ran through his troops. “It’s all over—return home! The king is dead!”"},{"num":38,"verse":"When his chariot and armor were washed beside the pool of Samaria, where the prostitutes bathed, dogs came and licked the king’s blood just as the Lord had said would happen."},{"num":39,"verse":"The rest of Ahab’s history—including the story of the ivory palace and the cities he built—is written in The Annals of the Kings of Israel. "},{"num":40,"verse":"So Ahab was buried among his ancestors, and Ahaziah, his son, became the new king of Israel."},{"num":41,"verse":"Meanwhile, over in Judah, Jehoshaphat the son of Asa had become king during the fourth year of the reign of King Ahab of Israel. "},{"num":42,"verse":"Jehoshaphat was thirty-five years old when he ascended the throne, and he reigned in Jerusalem for twenty-five years. His mother was Azubah, the daughter of Shilhi. "},{"num":43,"verse":"He did as his father Asa had done, obeying the Lord in all but one thing: he did not destroy the shrines on the hills, so the people sacrificed and burned incense there. "},{"num":44,"verse":"He also made peace with Ahab, the king of Israel. "},{"num":45,"verse":"The rest of the deeds of Jehoshaphat and his heroic achievements and his wars are described in The Annals of the Kings of Judah."},{"num":46,"verse":"He also closed all the houses of male prostitution that still continued from the days of his father Asa. "},{"num":47,"verse":"(There was no king in Edom at that time, only a deputy.)"},{"num":48,"verse":"King Jehoshaphat built great freighters to sail to Ophir for gold; but they never arrived, for they were wrecked at Ezion-geber. "},{"num":49,"verse":"Ahaziah, King Ahab’s son and successor, had proposed to Jehoshaphat that his men go, too, but Jehoshaphat had refused the offer."},{"num":50,"verse":"When King Jehoshaphat died he was buried with his ancestors in Jerusalem, the city of his forefather David; and his son Jehoram took the throne. "},{"num":51,"verse":"It was during the seventeenth year of the reign of King Jehoshaphat of Judah that Ahaziah, Ahab’s son, began to reign over Israel in Samaria; and he reigned two years. "},{"num":52,"verse":"But he was not a good king, for he followed in the footsteps of his father and mother and of Jeroboam, who had led Israel into the sin of worshiping idols. So Ahaziah made the Lord God of Israel very angry."}]