[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31:36-42 If Jacob were willingly consumed with heat in the day, and frost by night, to become the son-in-law of Laban, what should we refuse to endure, to become the sons of God? Jacob speaks of God as the God of his father; he thought himself unworthy to be regarded, but was beloved for his father's sake. He calls him the God of Abraham, and the fear of Isaac; for Abraham was dead, and gone to that world where perfect love casts out fear; but Isaac was yet alive, sanctifying the Lord in his heart, as his fear and his dread.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After the search for the teraphim has proved vain, Jacob warmly upbraids Laban. \"The camel's saddle.\" This was a pack-saddle, in the recesses of which articles might be deposited, and on which was a seat or couch for the rider. Rachel pleads the custom of women as an excuse for keeping her seat; which is admitted by Laban, not perhaps from the fear of ceremonial defilement ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 15:19-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as this law was not yet in force, but from respect to his daughter and the conviction that in such circumstances she would not sit upon the teraphim. \"My brethren and thy brethren\" - their common kindred. Jacob recapitulates his services in feeling terms. \"By day the drought;\" caused by the heat, which is extreme during the day, while the cold is not less severe in Palestine during the night. \"The fear of Isaac\" - the God whom Isaac fears. Judged - requited by restraining thee from wrong-doing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "36, 37. Jacob was wroth—Recrimination on his part was natural in the circumstances, and, as usual, when passion is high, the charges took a wide range. He rapidly enumerated his grievances for twenty years and in a tone of unrestrained severity described the stubborn character and vexatious exactions of his uncle, together with the hardships of various kinds he had patiently endured.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whereas thou hast searched all my stuff,.... Or all my vessels (n), or utensils; whether household goods, or such as were used with regard to the cattle, or armour for defence: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what hast thou found of all thy household stuff? is there any vessel or utensil, or anything whatever thou canst claim as thine own? is there anything that has been taken away from thee either by me or mine? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "set it here before my brethren and thy brethren; publicly before them all, and let it be thoroughly inquired into whose property it was, and whether lawfully taken or not: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they may judge betwixt us both; Jacob was so conscious to himself of his own uprightness, that he could safely leave anything that might be disputed in arbitration with the very men that Laban had brought with him: it was so clear a case that he had not wronged him of anyone thing. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n)  \"omnia vasa mea\", Montanus, Munster, Vatablus, Drusius, Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n)  \"omnia vasa mea\", Montanus, Munster, Vatablus, Drusius, Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Whereas thou hast searched all my stuff, what hast thou found of all thy household stuff? set it here before my brethren and thy brethren, that they may judge betwixt us both.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As Laban found nothing, Jacob grew angry, and pointed out the injustice of his hot pursuit and his search among all his things, but more especially the harsh treatment he had received from him in return for the unselfish and self-denying services that he had rendered him for twenty years. Acute sensibility and elevated self-consciousness give to Jacob's words a rhythmical movement and a poetical form. Hence such expressions as אחרי דּלק \"hotly pursued,\" which is only met with in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; אחטּנּה for אחטּאנּה \"I had to atone for it,\" i.e., to bear the loss; \"the Fear of Isaac,\" used as a name for God, פּחד, σέβας  equals  σέβασμα, the object of Isaac's fear or sacred awe. ",
        "children": []
      }
    ]
  }
]