[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31:1-21 The affairs of these families are related very minutely, while (what are called) the great events of states and kingdoms at that period, are not mentioned. The Bible teaches people the common duties of life, how to serve God, how to enjoy the blessings he bestows, and to do good in the various stations and duties of life. Selfish men consider themselves robbed of all that goes past them, and covetousness will even swallow up natural affection. Men's overvaluing worldly wealth is that error which is the root of covetousness, envy, and all evil. The men of the world stand in each other's way, and every one seems to be taking away from the rest; hence discontent, envy, and discord. But there are possessions that will suffice for all; happy they who seek them in the first place. In all our removals we should have respect to the command and promise of God. If He be with us, we need not fear. The perils which surround us are so many, that nothing else can really encourage our hearts. To remember favoured seasons of communion with God, is very refreshing when in difficulties; and we should often recollect our vows, that we fail not to fulfil them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Circumstances at length induce Jacob to propose flight to his wives. His prosperity provokes the envy and slander of Laban's sons, and Laban himself becomes estranged. The Lord now commands Jacob to return, and promises him his presence to protect him. Jacob now opens his mind fully to Rachel and Leah. Rachel, we observe, is put first. Several new facts come out in his discourse to them. Ye know - Jacob appeals to his wives on this point - \"that with all my might I served your father.\" He means, of course, to the extent of his engagement. During the last six years he was to provide for his own house, as the Lord permitted him, with the full knowledge and concurrence of Laban. Beyond this, which is a fair and acknowledged exception, he has been faithful in keeping the cattle of Laban. \"Your father deceived me, and changed my wages ten times;\" that is, as often as he could.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If, at the end of the first year, he found that Jacob had gained considerably, though he began with nothing, he might change his wages every following half-year, and so actually change them ten times in five years. In this case, the preceding chapter only records his original expedients, and then states the final result. \"God suffered him not to hurt me.\" Jacob, we are to remember, left his hire to the providence of God. He thought himself bound at the same time to use all legitimate means for the attainment of the desired end. His expedients may have been perfectly legitimate in the circumstances, but they were evidently of no avail without the divine blessing. And they would become wholly ineffectual when his wages were changed. Hence, he says, God took the cattle and gave them to me. Jacob seems here to record two dreams, the former of which is dated at the rutting season. The dream indicates the result by a symbolic representation, which ascribes it rather to the God of nature than to the man of art. The second dream makes allusion to the former as a process still going on up to the present time. This appears to be an encouragement to Jacob now to commit himself to the Lord on his way home. The angel of the Lord, we observe, announces himself as the God of Bethel, and recalls to Jacob the pillar and the vow. The angel, then, is Yahweh manifesting himself to human apprehension.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If, at the end of the first year, he found that Jacob had gained considerably, though he began with nothing, he might change his wages every following half-year, and so actually change them ten times in five years. In this case, the preceding chapter only records his original expedients, and then states the final result. \"God suffered him not to hurt me.\" Jacob, we are to remember, left his hire to the providence of God. He thought himself bound at the same time to use all legitimate means for the attainment of the desired end. His expedients may have been perfectly legitimate in the circumstances, but they were evidently of no avail without the divine blessing. And they would become wholly ineffectual when his wages were changed. Hence, he says, God took the cattle and gave them to me. Jacob seems here to record two dreams, the former of which is dated at the rutting season. The dream indicates the result by a symbolic representation, which ascribes it rather to the God of nature than to the man of art. The second dream makes allusion to the former as a process still going on up to the present time. This appears to be an encouragement to Jacob now to commit himself to the Lord on his way home. The angel of the Lord, we observe, announces himself as the God of Bethel, and recalls to Jacob the pillar and the vow. The angel, then, is Yahweh manifesting himself to human apprehension.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. ye know that … I have served your father—Having stated his strong grounds of dissatisfaction with their father's conduct and the ill requital he had got for all his faithful services, he informed them of the blessing of God that had made him rich notwithstanding Laban's design to ruin him; and finally, of the command from God he had received to return to his own country, that they might not accuse him of caprice, or disaffection to their family; but be convinced, that in resolving to depart, he acted from a principle of religious obedience.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With all my power, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " both of my mind and body, as I would have done for myself, as became a faithful servant to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And ye know, that with all my power I have served your father. With all faithfulness and uprightness; with all diligence and industry; with all wisdom and prudence; with all my might and main, contriving the best methods, and sparing no pains by day or night to take care of his flocks, and increase his substance: of this his wives had been witnesses for twenty years past, and to them he appeals for the truth of it; so that there was no just reason for their father's behaviour towards him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And ye know that with all my power I have served your father.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And ye know that with all my power I have served your father.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The term Jacob here uses for power is derived from an unused onomatopoetic root, signifying to pant, and hence to exert one s strength. If, therefore, the assertion now made to his wives was not an unblushing falsehood, Jacob could not have been the monster of craft and deception depicted by some (Kalisch); while, if it was, it must have required considerable effrontery to appeal to his wives' knowledge for a confirmation of what they knew to be a deliberate untruth. The hypothesis that Jacob first acquired his great wealth by \"consummate cunning,\" and then piously \"abused the authority of God in covering or justifying them\" (Kalisch), presupposes on the part of Jacob a degree of wickedness inconceivable in one who had enjoyed the sublime theophany of Bethel. Genesis 31:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "אתּנה: the original form of the abbreviated אתּן, which is merely copied from the Pentateuch in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]