[{"num":45,"verse":"1 The deliverance of the people by Cyrus. 9 God is just in all his works. 20 The calling of the Gentiles."},{"num":1,"verse":"Thus saith the Lord unto Cyrus his anointed, whose right hand I have holden to subdue nations before him: therefore will I weaken the loins of kings, and open the doors before him, and the gates shall not be shut."},{"num":2,"verse":"I will go before thee, and make the crooked straight: I will break the brazen doors, and burst the iron bars."},{"num":3,"verse":"And I will give thee the treasures of darkness, and the things hid in secret places, that thou mayest know that I am the Lord which call thee by thy name, even the God of Israel."},{"num":4,"verse":"For Jacob my servant’s sake, and Israel mine elect, I will even call thee by thy name, and name thee, though thou hast not known me."},{"num":5,"verse":"I am the Lord, and there is none other; there is no God besides me: I girded thee, though thou hast not known me."},{"num":6,"verse":"That they may know from the rising of the sun, and from the West, that there is none besides me. I am the Lord, and there is none other."},{"num":7,"verse":"I form the light, and create darkness: I make peace, and create evil: I the Lord do all these things."},{"num":8,"verse":"Ye heavens send the dew from above, and let the clouds drop down righteousness: let the earth open, and let salvation and justice grow forth: let it bring them forth together: I the Lord have created him."},{"num":9,"verse":"Woe be unto him that striveth with his maker, the potsherd with the potsherds of the earth: shall the clay say to him that fashioneth it, What makest thou? or thy work, It hath none hands?"},{"num":10,"verse":"Woe unto him that saith to his father, What hast thou begotten? or to his mother, What hast thou brought forth?"},{"num":11,"verse":"Thus saith the Lord, the only one of Israel, and his maker, Ask me of things to come concerning my sons, and concerning the works of mine hands: commend you me."},{"num":12,"verse":"I have made the earth, and created man upon it: I, whose hands have spread out the heavens, I have even commanded all their army."},{"num":13,"verse":"I have raised him up in righteousness, and I will direct all his ways: he shall build my city, and he shall let go my captives, not for price nor reward, saith the Lord of hosts."},{"num":14,"verse":"Thus saith the Lord, The labor of Egypt, and the merchandise of Ethiopia, and of the Sabeans, men of stature shall come unto thee, and they shall be thine: they shall follow thee, and shall go in chains: they shall fall down before thee, and make supplication unto thee, saying, Surely God is in thee, and there is none other God besides."},{"num":15,"verse":"Verily, thou O God hidest thyself, O God, the Savior of Israel."},{"num":16,"verse":"All they shall be ashamed and also confounded: they shall go to confusion together, that are the makers of images."},{"num":17,"verse":"But Israel shall be saved in the Lord, with an everlasting salvation: ye shall not be ashamed nor confounded world without end."},{"num":18,"verse":"For this saith the Lord (that created heaven, God himself that formed the earth, and made it: he that prepared it, he created it not in vain: he formed it to be inhabited) I am the Lord, and there is none other."},{"num":19,"verse":"I have not spoken in secret, neither in a place of darkness in the earth: I said not in vain unto the seed of Jacob, Seek you me: I the Lord do speak righteousness, and declare righteous things."},{"num":20,"verse":"Assemble yourselves, and come: draw near together, ye abject of the Gentiles: they have no knowledge, that set up the wood of their idol, and pray unto a god, that cannot save them."},{"num":21,"verse":"Tell ye and bring them, and let them take counsel together, who hath declared this from the beginning, or hath told it of old? Have not I the Lord? and there is none other God beside me, a just God, and a Savior: there is none beside me."},{"num":22,"verse":"Look unto me, and ye shall be saved: all the ends of the earth shall be saved: for I am God, and there is none other."},{"num":23,"verse":"I have sworn by myself: the word is gone out of my mouth in righteousness, and shall not return, That every knee shall bow unto me, and every tongue shall swear by me."},{"num":24,"verse":"Surely he shall say, In the Lord have I righteousness and strength: he shall come unto him, and all that provoke him shall be ashamed."},{"num":25,"verse":"The whole seed of Israel shall be justified, and glory in the Lord."}]