[[],[{"type":"header","content":"Mordecai Promoted"},{"type":"prose","content":"On that day King Ahasuerus (Xerxes) gave the house of Haman, the enemy of the Jews, to Queen Esther; and Mordecai came before the king, because Esther had disclosed what [relation] he was to her. "}],[{"type":"prose","content":"The king took off his signet ring which he had taken away from Haman, and gave it to Mordecai. And Esther put Mordecai in charge of the house of Haman."}],[{"type":"prose","content":"Then Esther spoke again to the king and fell down at his feet and wept and implored him to avert the evil  of Haman the Agagite and his plan which he had devised against the Jews [because the decree to annihilate the Jews was still in effect]. "}],[{"type":"prose","content":"Then the king held out to Esther the golden scepter. So Esther arose and stood before the king. "}],[{"type":"prose","content":"Then she said, “If it pleases the king and if I have found favor before him and the matter is proper in the king’s view and I am pleasing in his sight, let it be written to revoke the letters devised by Haman the son of Hammedatha, the Agagite, which he wrote [in order] to destroy the Jews who are in all the king’s provinces. "}],[{"type":"prose","content":"For how can I endure to see the tragedy that will happen to my people? Or how can I endure to see the destruction of my kindred?” "}],[{"type":"prose","content":"Then King Ahasuerus said to Queen Esther and to Mordecai the Jew, “Behold, I have given Esther the house of Haman, and they have hanged him on the gallows because he stretched out his hand against the Jews."}],[{"type":"header","content":"The King’s Decree Avenges the Jews"},{"type":"prose","content":"Also, concerning the Jews, write as you see fit, in the king’s name, and seal it with the king’s signet ring—for a decree which is written in the king’s name and sealed with the king’s signet ring may not be revoked.”"}],[{"type":"prose","content":"So the king’s scribes were called at that time in the third month that is, the month of Sivan on the twenty-third day; and it was written in accordance with everything that Mordecai commanded, to the Jews, to the chief rulers (satraps), and the governors and officials of the provinces which  from India to Ethiopia (Cush), 127 provinces, to every province in its own script (writing), and to every people in their own language and to the Jews according to their script and their language. "}],[{"type":"prose","content":"He wrote [a decree] in the name of King Ahasuerus, and sealed it with the king’s ring, and sent letters by couriers on horseback, riding on the royal [mail] relay horses, the offspring of the racing mares. "}],[{"type":"prose","content":"In it the king granted the Jews who were in every city  to assemble and to defend their lives; to destroy, to kill, and to annihilate any armed force that might attack them, their little children, and women; and to take the enemies’ goods as plunder, "}],[{"type":"prose","content":"on one day in all the provinces of King Ahasuerus, the thirteenth [day] of the twelfth month that is, the month of Adar. "}],[{"type":"prose","content":"A copy of the edict was to be issued as a law in every province and as a proclamation to all peoples, so that the Jews would be ready on that day, to avenge themselves on their enemies. "}],[{"type":"prose","content":"So the couriers, who were mounted on the royal relay horses, left quickly, urged on by the king’s command; and the decree was issued at the citadel in Susa [the capital]."}],[{"type":"prose","content":"Then Mordecai departed from the presence of the king in royal apparel of blue and white, with a large crown of gold and with a robe of fine linen and purple wool; and the city of Susa shouted and rejoiced. "}],[{"type":"prose","content":"For [at this time] the Jews had light [a dawn of new hope] and gladness and joy and honor. "}],[{"type":"prose","content":"In each and every province and in each and every city, wherever the king’s command and his decree arrived, the Jews  gladness and joy, a feast and a holiday. And many among the peoples of the land became Jews, for the fear of the Jews [and their God] had fallen on them."}]]