[{"num":8,"verse":"On that day King Ahasuerus gave the house of Haman, the Jews’ enemy, to Queen Esther. And Mordecai came before the king, for Esther had told what he was to her."},{"num":2,"verse":"And the king took off his [signet] ring, which he had taken from Haman, and gave it to Mordecai. And Esther set Mordecai over the house of Haman."},{"num":3,"verse":"And Esther spoke yet again to the king and fell down at his feet and besought him with tears to avert the evil plot of Haman the Agagite and his scheme that he had devised against the Jews."},{"num":4,"verse":"Then the king held out to Esther the golden scepter. So Esther arose and stood before the king."},{"num":5,"verse":"And she said, If it pleases the king and if I have found favor in his sight and the thing seems right before the king and I am pleasing in his eyes, let it be written to reverse the letters devised by Haman son of Hammedatha, the Agagite, which he wrote to destroy the Jews who are in all the king’s provinces."},{"num":6,"verse":"For how can I endure to see the evil that shall come upon my people? Or how can I endure to see the destruction of my kindred?"},{"num":7,"verse":"Then the King Ahasuerus said to Queen Esther and to Mordecai the Jew, Behold, I have given Esther the house of Haman, and him they have hanged upon the gallows because he laid his hand upon the Jews."},{"num":8,"verse":"Write also concerning the Jews as it pleases you in the king’s name, and seal it with the king’s [signet] ring—for writing which is in the king’s name and sealed with the king’s ring no man can reverse."},{"num":9,"verse":"Then the king’s scribes were called, in the third month, the month of Sivan, on the twenty-third day, and it was written according to all that Mordecai commanded to the Jews, to the chief rulers, and the governors and princes of the provinces from India to Ethiopia, 127 provinces, to every province in its own script and to every people in their own language and to the Jews according to their writing and according to their language."},{"num":10,"verse":"He wrote in the name of King Ahasuerus and sealed it with the king’s ring and sent letters by messengers on horseback, riding on swift steeds, mules, and young dromedaries used in the king’s service, bred from the [royal] stud."},{"num":11,"verse":"In it the king granted the Jews who were in every city to gather and defend their lives; to destroy, to slay, and to wipe out any armed force that might attack them, their little ones, and women; and to take the enemies’ goods for spoil."},{"num":12,"verse":"On one day in all the provinces of King Ahasuerus, the thirteenth day of the twelfth month, the month of Adar,"},{"num":13,"verse":"A copy of the writing was to be issued as a decree in every province and as a proclamation to all peoples, and the Jews should be ready on that day to avenge themselves upon their enemies."},{"num":14,"verse":"So the couriers, who were mounted on swift beasts that were used in the king’s service, went out, being hurried and urged on by the king’s command; and the decree was released in Shushan, the capital."},{"num":15,"verse":"And Mordecai went forth from the presence of the king in royal apparel of blue and white, with a great crown of gold and with a robe of fine linen and purple; and the city of Shushan shouted and rejoiced."},{"num":16,"verse":"The Jews had light [a dawn of new hope] and gladness and joy and honor."},{"num":17,"verse":"And in every province and in every city, wherever the king’s command and his decree came, the Jews had gladness and joy, a feast and a holiday. And many from among the peoples of the land [submitted themselves to Jewish rite and] became Jews, for the fear of the Jews had fallen upon them."}]