[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When thou art departed from me to day, then . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Here follows Samuel’s careful description of the three signs which should meet the future king as he went from Ramah to his father’s home in Benjamin. Each of these tokens, which were to strengthen the young Saul’s faith, contained a solemn lesson, the deep meaning of which, as his life went on, the future sovereign would be able to ponder over. Each of the three signs from heaven met him at one of the sacred spots which were so plentifully dotted over these southern districts of Canaan, memorable for the life-stories, first of Abraham and the patriarchs, and then of the warrior-chieftains of the Israel of the conquest. The selection of localities famous as homes of prayer, or sacred as the resting-place of the illustrious dead, taught the eternal truth “that help comes from the holy place.” At the sepulchre of Rachel, the loved ancestress of the warlike tribe of Benjamin, to which the new king belonged, men should meet him on his homeward journey with the news that the lost asses which he had gone to seek were found again. This showed him that henceforth in his new life he was to dismiss all lower cares, and give himself up alone ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "higher and more important matters. A king must take counsel and thought for the weal of a whole people; he must put aside now and for ever all consideration for himself and his family, all anxiety for the mere ordinary prosperity of life. God, who had chosen him, would provide for these things, as He had now done in the case of the lost asses. Further on in his journey, when he reached the terebinth-tree of Tabor, three men on a pilgrimage to the great Beth-el sanctuary would meet him, and would offer him some of the loaves which they proposed offering at Beth-el. The signification of this peculiar gift was that some portion of the products of the soil, which had hitherto been appropriated exclusively to the service and support of the sanctuary, in future should be devoted to the maintenance of the anointed of the Lord. The third sign which he should perceive would meet him as he approached his home, which was situated near a famous holy place of prayer, known as the “Gibeah,” or “Hill of God.” A number of prophets belonging to one of the “schools” of the prophets founded by Samuel, coming from the altar on the “hill of God,” where sacrifice had just been offered, would meet him. They would be plunged in prophetic raptures, he would hear them chanting hymns to the Eternal, accompanied by the music of their instruments. A new and mighty influence, Samuel told the astonished Saul, would, as he met this company of singers, come upon him, and involuntarily he who evidently had never joined before in any of these solemn choruses would sing his part with the rest. The new influence, said the old seer, which would then come upon him would be the Spirit of the Lord, and from that moment he would be a changed man. Never in his after days of glory and might was the king to forget how, in a moment, the Divine power had swept down and given him—the ignorant shepherd, the humble vine-dresser, the heir to a few asses and sheep, to some fields of corn or vineyards—wisdom, power, and a mighty kingdom. He must remember that in a moment the same Divine power might wing away from him its solemn flight; that was the lesson of the third sign which was to meet him on his homeward journey.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The LXX. and Vulg. have a somewhat long addition to 1Samuel 10:1. It is, however, manifestly an explanatory gloss, and is made up from 1Samuel 10:16-17 of 1 Samuel 9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The LXX. and Vulg. have a somewhat long addition to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is, however, manifestly an explanatory gloss, and is made up from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 10:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of 1 Samuel 9.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) Thou shalt find two men by Rachel’s sepulchre.—This tomb of the loved wife of the patriarch does not thus appear to have been very far from Ramah, whence Saul started. The words of Jeremiah 31:15, which speak of the future massacre of the Bethlehem innocents by Herod, connects Ramah and Rachel’s tomb: “A voice was heard in Ramah, lamentation and bitter weeping: Rachel weeping for her children.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Thou shalt find two men by Rachel’s sepulchre.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This tomb of the loved wife of the patriarch does not thus appear to have been very far from Ramah, whence Saul started. The words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which speak of the future massacre of the Bethlehem innocents by Herod, connects Ramah and Rachel’s tomb: “A voice was heard in Ramah, lamentation ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "bitter weeping: Rachel weeping for her children.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "At Zelzah.—This locality has never been identified. Some have supposed it was the same as Zela in Benjamin. the place where the bodies of Saul and Jonathan were eventually buried. The LXX. curiously render it as though it were a verb, “dancing (lit. springing) vehemently,” or, as Ewald would translate the Greek words, “in great haste,” of course, with reference to the two men who brought Saul the news of the recovered asses.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "At Zelzah.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This locality has never been identified. Some have supposed it was the same as Zela in Benjamin. the place where the bodies of Saul and Jonathan were eventually buried. The LXX. curiously render it as though it were a verb, “dancing (lit. springing) vehemently,” or, as Ewald would translate the Greek words, “in great haste,” of course, with reference to the two men who brought Saul the news of the recovered asses.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 10:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By Rachel’s sepulchre — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the way to Beth-lehem, which city was in Judah; her sepulchre might be either in Judah, or in Benjamin; for the possessions of those two tribes were bordering one upon another. The first place he directs him to was a sepulchre, the sepulchre of one of his ancestors. There he must read a lecture of his own mortality, and, now he had a crown in his eye, must think of his grave, in which all his honour would be laid in the dust.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-8 The sacred anointing, then used, pointed at the great Messiah, or Anointed One, the King of the church, and High Priest of our profession, who was anointed with the oil of the Spirit, not by measure, but without measure, and above all the priests and princes of the Jewish church. For Saul's further satisfaction, Samuel gives him some signs which should come to pass the same day. The first place he directs him to, was the sepulchre of one of his ancestors; there he must be reminded of his own mortality, and now that he had a crown before him, must think of his grave, in which all his honour would be laid in the dust. From the time of Samuel there appears to have been schools, or places where pious young men were brought up in the knowledge of Divine things. Saul should find himself strongly moved to join with them, and should be turned into another man from what he had been. The Spirit of God changes men, wonderfully transforms them. Saul, by praising God in the communion of saints, became another man, but it may be questioned if he became a new man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How should Saul know that what Samuel said was the word of the Lord? Samuel gives him a sign, \"Thou shalt find two men,\" etc. (Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:36-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:11-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Zelzah - A place absolutely unknown. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Zelzah - A place absolutely unknown. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. When thou art departed from me to-day—The design of these specific predictions of what should be met with on the way, and the number and minuteness of which would arrest attention, was to confirm Saul's reliance on the prophetic character of Samuel, and lead him to give full credence to what had been revealed to him as the word of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rachel's sepulchre—near Beth-lehem (see on [241]Ge 35:16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Zelzah—or Zelah, now Bet-jalah, in the neighborhood of that town.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the borders of Benjamin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the way to Bethlehem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 35:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which city was in Judah; and her sepulchre might be either in Judah or in Benjamin; for the possessions of those two tribes were bordering upon one another, and oft intermixed together: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Joshua 18:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When thou art departed from me today,.... Not as soon as he was departed, for he had some few miles to go from Ramah to Rachel's grave near Bethlehem: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou shalt find two men by Rachel's sepulchre, in the border of Benjamin, at Zelzah; the Jews move a difficulty here, that Rachel's sepulchre should be said to be in the border of Benjamin, when it was by Bethlehemephrath, in the tribe of Judah, Genesis 35:19 and which they solve by observing, that these men were now, at the time Samuel was speaking, by the grave of Rachel, but as they were coming on he would meet them at Zelzah, in the border of Benjamin (z); but there is no need of this, Rachel's grave was not at Bethlehem, but in, the way to it; and besides, as these two tribes were contiguous, and this city being on the borders of both, it might be said at one time to be in the border of Benjamin, and at another in the border of Judah, or in Judah, without any contradiction. Of Zelzah we nowhere else read, but it is plain it was near the sepulchre of Rachel, and perhaps nearer than Bethlehem. The Arabic geographer (a) speaks of Rachel's grave as in the midway between Jerusalem and Bethlehem; and says there were twelve stones upon it, and a stone arched vault over it; and the same is affirmed by Benjamin of Tudela (b), who makes it to be but half a mile from Bethlehem. Jarchi would have Zelzah to be the same with Jerusalem, which is not probable: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou shalt find two men by Rachel's sepulchre, in the border of Benjamin, at Zelzah; the Jews move a difficulty here, that Rachel's sepulchre should be said to be in the border of Benjamin, when it was by Bethlehemephrath, in the tribe of Judah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and which they solve by observing, that these men were now, at the time Samuel was speaking, by the grave of Rachel, but as they were coming on he would meet them at Zelzah, in the border of Benjamin (z); but there is no need of this, Rachel's grave was not at Bethlehem, but in, the way to it; and besides, as these two tribes were contiguous, and this city being on the borders of both, it might be said at one time to be in the border of Benjamin, and at another in the border of Judah, or in Judah, without any contradiction. Of Zelzah we nowhere else read, but it is plain it was near the sepulchre of Rachel, and perhaps nearer than Bethlehem. The Arabic geographer (a) speaks of Rachel's grave as in the midway between Jerusalem and Bethlehem; and says there were twelve stones upon it, and a stone arched vault over it; and the same is affirmed by Benjamin of Tudela (b), who makes it to be but half a mile from Bethlehem. Jarchi would have Zelzah to be the same with Jerusalem, which is not probable: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and they will say unto thee, the asses which thou wentest to seek are found; as Samuel had before told Saul they were, 1 Samuel 9:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they will say unto thee, the asses which thou wentest to seek are found; as Samuel had before told Saul they were, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and, lo, thy father hath left the care of the asses; or had left all thoughts about them, and concern for them, not minding whether he heard of them or not, and this before they were found; or otherwise it would have been no strange thing to drop all thoughts about them, when they were found: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sorroweth for you; for Saul, and his servant; such was the anxiety and distress of his mind lest any evil should befall them, having been gone so long in quest of the asses, that he had as it were forgot them, and lost all care and concern about them, in comparison of his son and servant; but especially his sorrow rose high for his son, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, what shall I do for my son? though he was concerned for his servant, yet most for his son; he might have another servant, and not another son, and Saul seems to be his only one, which made his grief for him the greater, see 1 Chronicles 8:33. Now as these were contingent events here foretold, as meeting with two men at a certain place described, the words related expressly they should say to him when he met them, and these exactly coming to pass, would most clearly prove Samuel to be a true prophet, and confirm Saul in the belief of what he had said and done to him concerning the kingdom. Another sign follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying, what shall I do for my son? though he was concerned for his servant, yet most for his son; he might have another servant, and not another son, and Saul seems to be his only one, which made his grief for him the greater, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 8:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Now as these were contingent events here foretold, as meeting with two men at a certain place described, the words related expressly they should say to him when he met them, and these exactly coming to pass, would most clearly prove Samuel to be a true prophet, and confirm Saul in the belief of what he had said and done to him concerning the kingdom. Another sign follows. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Bereshit Rabba, sect. 82. fol. 71. 4. R. Isaiah, Jarchi, Kimchi, Abarbinel, & Abendana in loc. (a) Chinat. 3. par. 5. (b) ltinerar. p. 47. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Bereshit Rabba, sect. 82. fol. 71. 4. R. Isaiah, Jarchi, Kimchi, Abarbinel, & Abendana in loc. (a) Chinat. 3. par. 5. (b) ltinerar. p. 47. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When thou art departed from me to day, then thou shalt find two men by Rachel's sepulchre in the border of Benjamin at Zelzah; and they will say unto thee, The {b} asses which thou wentest to seek are found: and, lo, thy father hath left the care of the asses, and sorroweth for you, saying, What shall I do for my son?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When thou art departed from me to day, then thou shalt find two men by Rachel's sepulchre in the border of Benjamin at Zelzah; and they will say unto thee, The ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " asses which thou wentest to seek are found: and, lo, thy father hath left the care of the asses, and sorroweth for you, saying, What shall I do for my son?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Samuel confirms him by these signs, that God has appointed him king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rachel’s sepulchre in the border of Benjamin at Zelzah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:16-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Rachel’s grave is described as on the road from Bethel to Ephrath which is Bethlehem, a little way from Ephrath. This agrees with the site now marked by a tomb called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Kubbet Rahil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (dome of Rachel) a mile N. of Bethlehem. But if this is the true site of Rachel’s sepulchre, it is not easy to reconcile it with the notice here. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is at least 4 miles S. of the southern border of Benjamin. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Supposing “the city” to be Ramah (see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it is hard to see why Saul should be sent so far out of his way home. Various attempts have been made to explain the difficulty. (1) Thenius thinks that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephrath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned in Genesis was not Bethlehem, but a town in the neighbourhood of Ramah and Gibeah, so that Rachel’s sepulchre would be on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "northern",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " frontier of Benjamin. This involves rejecting (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the statement in Genesis that Ephrath was Bethlehem, as a mistaken gloss, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the modern site of the tomb. (2) Keil supposes that the city from which Saul started was not Ramah, but some unknown city in the neighbourhood of Bethlehem. But the general impression given by the whole chapter is that the city was the seer’s usual residence. (3) The most plausible explanation seems to be that Samuel purposely sent Saul out of his way in order that he might meet the two men; and that the expressions “",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "near",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rachel’s sepulchre” and “in the border of Benjamin” must be understood as applied to Zelzah, which lay between the two, with considerable latitude.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In our uncertainty as to the exact sites, the true solution must remain uncertain.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "at Zelzah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This place is mentioned nowhere else and cannot be identified. The Sept. does not regard it as a proper name, but translates it “two men ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "leaping vigorously",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” The Vulg. renders “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the south",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and sorroweth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And is anxious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the same word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The first sign - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou shalt find two men by Rachel's sepulchre.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Rachel's sepulchre is connected with Ramah, but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is placed near Bethlehem. The whole of the geography of Saul's wanderings is very obscure, but Wilson ('Lands of the Bible,' 1:401) places ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Zelzah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at Beit-jala, to the west of Bethlehem, in the neighbourhood of the Kabhet Rahil, or Tomb of Rachel, Though both are now in the tribe of Judah, yet by a slight rectification of the frontier, in conformity with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 18:11-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Zelzah would be on the border of Benjamin, and there may have been local reasons for Saul and his companion not taking the most direct route for Gibeah. The news given by these men, that the asses were found, would set Saul's mind at rest, and, freed from lower cares, he would be able to give his thoughts entirely to preparation for the higher duties that were before him. For an interesting note upon the journey of Saul home see Wilson, 2:36. 1 Samuel 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To confirm the consecration of Saul as king over Israel, which had been effected through the anointing, Samuel gave him three more signs which would occur on his journey home, and would be a pledge to him that Jehovah would accompany his undertakings with His divine help, and practically accredit him as His anointed. These signs, therefore, stand in the closest relation to the calling conveyed to Saul through his anointing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1 Samuel 10:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The first sign: \"When thou goest away from me to-day (i.e., now), thou wilst meet two men at Rachel's sepulchre, on the border of Benjamin at Zelzah; and they will say unto thee, The asses of thy father, which thou wentest to seek, are found. Behold, they father hath given up העתנות את־דּברי, the words (i.e., talking) about the asses, and troubleth himself about you, saying, What shall I do about my son?\" According to Genesis 35:16., Rachel's sepulchre was on the way from Bethel to Bethlehem, only a short distance from the latter place, and therefore undoubtedly on the spot which tradition has assigned to it since the time of Jerome, viz., on the site of the Kubbet Rahil, half an hour to the north-west of Bethlehem, on the left of the road to Jerusalem, about an hour and a half from the city (see at Genesis 35:20). This suits the passage before us very well, if we give up the groundless assumption that Saul came to Samuel at Ramah and was anointed by him there, and assume that the place of meeting, which is not more fully defined in 1 Samuel 9, was situated to the south-west of Bethlehem.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The first sign: \"When thou goest away from me to-day (i.e., now), thou wilst meet two men at Rachel's sepulchre, on the border of Benjamin at Zelzah; and they will say unto thee, The asses of thy father, which thou wentest to seek, are found. Behold, they father hath given up העתנות את־דּברי, the words (i.e., talking) about the asses, and troubleth himself about you, saying, What shall I do about my son?\" According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., Rachel's sepulchre was on the way from Bethel to Bethlehem, only a short distance from the latter place, and therefore undoubtedly on the spot which tradition has assigned to it since the time of Jerome, viz., on the site of the Kubbet Rahil, half an hour to the north-west of Bethlehem, on the left of the road to Jerusalem, about an hour and a half from the city (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This suits the passage before us very well, if we give up the groundless assumption that Saul came to Samuel at Ramah and was anointed by him there, and assume that the place of meeting, which is not more fully defined in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was situated to the south-west of Bethlehem.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: As the account of Saul's meeting with Samuel, in 1 Samuel 9, when properly understood, is not at variance with the tradition concerning the situation of Rachel's tomb, and the passage before us neither requires us on the one had to understand the Ephratah of Genesis 35:19 and Genesis 48:7 as a different place from Bethlehem, and erase \"that is Bethlehem\" from both passages as a gloss that has crept into the text, and then invent an Ephratah in the neighbourhood of Bethel between Benjamin and Ephraim, as Thenius does, nor warrants us on the other hand in transferring Rachel's tomb to the neighbourhood of Bethel, in opposition to the ordinary tradition, as Kurtz proposes; so the words of Jeremiah 31:15, \"A voice was heard in Ramah, lamentation and bitter weeping, Rachel weeping for her children,\" etc., furnish no evident that Rachel's tomb was at Ramah (i.e., er Rm). \"For here (in the cycle of prophecy concerning the restoration of all Israel, Jeremiah 30-33) Rachel's weeping is occasioned by the fact of the exiles of Benjamin having assembled together in Ramah (Jeremiah 40:1), without there being any reason why Rachel's tomb should be sought for in the neighbourhood of this Ramah\" (Delitzsch on Genesis 35:20).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: As the account of Saul's meeting with Samuel, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", when properly understood, is not at variance with the tradition concerning the situation of Rachel's tomb, and the passage before us neither requires us on the one had to understand the Ephratah of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a different place from Bethlehem, and erase \"that is Bethlehem\" from both passages as a gloss that has crept into the text, and then invent an Ephratah in the neighbourhood of Bethel between Benjamin and Ephraim, as Thenius does, nor warrants us on the other hand in transferring Rachel's tomb to the neighbourhood of Bethel, in opposition to the ordinary tradition, as Kurtz proposes; so the words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"A voice was heard in Ramah, lamentation and bitter weeping, Rachel weeping for her children,\" etc., furnish no evident that Rachel's tomb was at Ramah (i.e., er Rm). \"For here (in the cycle of prophecy concerning the restoration of all Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30-33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") Rachel's weeping is occasioned by the fact of the exiles of Benjamin having assembled together in Ramah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), without there being any reason why Rachel's tomb should be sought for in the neighbourhood of this Ramah\" (Delitzsch on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The expression \"in the border of Benjamin\" is not at variance with this. It is true that Kubbet Rahil is about an hour and a quarter from the southern boundary of Benjamin, which ran past the Rogel spring, through the valley of Ben-hinnom (Joshua 18:16); but the expression קבוּרה עם must not be so pressed as to be restricted to the actual site of the grave, since otherwise the further definition \"at Zelzah\" would be superfluous, as Rachel's tomb was unquestionably a well-known locality at that time. If we suppose the place called Zelzah, the situation of which has not yet been discovered,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The expression \"in the border of Benjamin\" is not at variance with this. It is true that Kubbet Rahil is about an hour and a quarter from the southern boundary of Benjamin, which ran past the Rogel spring, through the valley of Ben-hinnom (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but the expression קבוּרה עם must not be so pressed as to be restricted to the actual site of the grave, since otherwise the further definition \"at Zelzah\" would be superfluous, as Rachel's tomb was unquestionably a well-known locality at that time. If we suppose the place called Zelzah, the situation of which has not yet been discovered,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Ewald (Gesch. iii. p. 29) supposes Zelzah to be unsuitable to the context, if taken as the name of a place, and therefore follows the ἁλλομένους μεγάλα of the lxx, and renders the word \"in great haste;\" but he has neither given any reason why the name of a place is unsuitable here, nor considered that the Septuagint rendering is merely conjectural, and has nothing further to support it than the fact that the translators rendered צלח ἐφήλατο, \"he sprang upon him,\" in 1 Samuel 10:6 and 1 Samuel 11:6, and took צלצח to be an emphatic form of צלח.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Ewald (Gesch. iii. p. 29) supposes Zelzah to be unsuitable to the context, if taken as the name of a place, and therefore follows the ἁλλομένους μεγάλα of the lxx, and renders the word \"in great haste;\" but he has neither given any reason why the name of a place is unsuitable here, nor considered that the Septuagint rendering is merely conjectural, and has nothing further to support it than the fact that the translators rendered צלח ἐφήλατο, \"he sprang upon him,\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and took צלצח to be an emphatic form of צלח.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to have been about mid-way between Rachel's tomb and the Rogel spring, Samuel could very well describe the spot where Saul would meet the two men in the way that he has done. This sign, by confirming the information which Samuel had given to Saul with reference to the asses, was to furnish him with a practical proof that what Samuel had said to him with regard to the monarchy would quite as certainly come to pass, and therefore not only to deliver him from all anxiety as to the lost animals of his father, but also to direct his thoughts to the higher destiny to which God had called him through Samuel's anointing.",
        "children": []
      }
    ]
  }
]