[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:17-27 Samuel tells the people, Ye have this day rejected your God. So little fond was Saul now of that power, which soon after, when he possessed it, he could not think of parting with, that he hid himself. It is good to be conscious of our unworthiness and insufficiency for the services to which we are called; but men should not go into the contrary extreme, by refusing the employments to which the Lord and the church call them. The greater part of the people treated the matter with indifference. Saul modestly went home to his own house, but was attended by a band of men whose hearts God disposed to support his authority. If the heart bend at any time the right way, it is because He has touched it. One touch is enough when it is Divine. Others despised him. Thus differently are men affected to our exalted Redeemer. There is a remnant who submit to him, and follow him wherever he goes; they are those whose hearts God has touched, whom he has made willing. But there are others who despise him, who ask, How shall this man save us? They are offended in him, and they will be punished.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Among the stuff - Rather, \"the baggage.\" The assembly was like a camp, and the baggage (impedimenta) of the whole congregation was probably collected in one place, where the wagons were arranged for protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17-25. Samuel called the people together … at Mizpeh—a shaft-like hill near Hebron, five hundred feet in height. The national assemblies of the Israelites were held there. A day having been appointed for the election of a king, Samuel, after having charged the people with a rejection of God's institution and a superseding of it by one of their own, proceeded to the nomination of the new monarch. As it was of the utmost importance that the appointment should be under the divine direction and control, the determination was made by the miraculous lot, tribes, families, and individuals being successively passed until Saul was found. His concealment of himself must have been the result either of innate modesty, or a sudden nervous excitement under the circumstances. When dragged into view, he was seen to possess all those corporeal advantages which a rude people desiderate in their sovereigns; and the exhibition of which gained for the prince the favorable opinion of Samuel also. In the midst of the national enthusiasm, however, the prophet's deep piety and genuine patriotism took care to explain \"the manner of the kingdom,\" that is, the royal rights and privileges, together with the limitations to which they were to be subjected; and in order that the constitution might be ratified with all due solemnity, the charter of this constitutional monarchy was recorded and laid up \"before the Lord,\" that is, deposited in the custody of the priests, along with the most sacred archives of the nation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is none like him among all the people; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as to the height of his bodily stature, which was in itself commendable in a king, and some kind of indication of great endowments of mind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God save the king, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let the king live",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, long and prosperously; for an afflicted life is reputed a kind of death, and is oft so called. Hereby they accept and own him for their king, and promise subjection to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Samuel said to all the people, see ye him whom the Lord hath chosen,.... For the choice being made by lot, the disposal of which is of the Lord, it is properly attributed to him, and the people could not object to it, but must allow it was the Lord's doing. Eupolemus (k), an Heathen writer, says, that Saul was made king by Samuel by the counsel or will of God; and Samuel appeals to their eyes for the goodness of the choice, a better could not have been made: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that there is none like him among the people? so graceful, so stately, so prince like and majestic; they wanted to have a king like such the nations had; and Saul was such an one, had all the outward appearance of grandeur that could be wished for, and which in other nations recommended persons to the imperial dignity: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the people shouted; made a general ado: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, God save the king; or \"let the king live\" (l); they owned and saluted him as their king, and prayed he might live long to reign over them; the Targum is, \"let the king prosper\"; let his reign be prosperous and glorious, and let him enjoy all health and happiness, peace and prosperity. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Apud Euseb. Praepar. Evangel. l. 9. c. 30. p. 447. (l)  \"vivat rex\", Pagninus, Montanus, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) Apud Euseb. Praepar. Evangel. l. 9. c. 30. p. 447. (l)  \"vivat rex\", Pagninus, Montanus, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Samuel said to all the people, See ye him whom the LORD hath chosen, that there is none like him among all the people? And all the people shouted, and said, God save the king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that there is none like him among all the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Stress is again laid on Saul’s imposing stature as a natural qualification for his office. He was “a princely person and of a majestic aspect.” See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God save the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “Let the king live.” Vulg. “Vivat Rex:” and so the Fr. “Vive le Roi,” and so Wyclif: “Lyve the kyng.” Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The familiar phrase of the E. V. appears to occur first in the Genevan Bible (1560). Coverdale (1535) has “God save the new kynge.” It was probably adopted from the liturgical response, “O Lord save the king” (Domine salvum fac regem), which is taken from the Vulgate version of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 10:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He was speedily fetched, and brought into the midst of the (assembled) people; and when he came, he was a head taller than all the people (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And Samuel said to all the people, \"Behold ye whom the Lord hath chosen! for there is none like him in all the nation.\" Then all the people shouted aloud, and cried, \"Let the king live!\" Saul's bodily stature won the favour of the people (see the remarks on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Samuel then communicated to the people the right of the monarchy, and laid it down before Jehovah. \"The right of the monarchy\" (meluchah) is not to be identified with the right of the king (melech), which is described in 1 Samuel 8:11 and sets forth the right or prerogative which a despotic king would assume over the people; but it is the right which regulated the attitude of the earthly monarchy in the theocracy, and determined the duties and rights of the human king in relation to Jehovah the divine King on the one hand, and to the nation on the other. This right could only be laid down by a prophet like Samuel, to raise a wholesome barrier at the very outset against all excesses on the part of the king. Samuel therefore wrote it in a document which was laid down before Jehovah, i.e., in the sanctuary of Jehovah; though certainly not in the sanctuary at Bamah in Gibeah, as Thenius supposes, for nothing is known respecting any such sanctuary. It was no doubt placed in the tabernacle, where the law of Moses was also deposited, by the side of the fundamental law of the divine state in Israel. When the business was all completed, Samuel sent the people away to their own home.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Samuel then communicated to the people the right of the monarchy, and laid it down before Jehovah. \"The right of the monarchy\" (meluchah) is not to be identified with the right of the king (melech), which is described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and sets forth the right or prerogative which a despotic king would assume over the people; but it is the right which regulated the attitude of the earthly monarchy in the theocracy, and determined the duties and rights of the human king in relation to Jehovah the divine King on the one hand, and to the nation on the other. This right could only be laid down by a prophet like Samuel, to raise a wholesome barrier at the very outset against all excesses on the part of the king. Samuel therefore wrote it in a document which was laid down before Jehovah, i.e., in the sanctuary of Jehovah; though certainly not in the sanctuary at Bamah in Gibeah, as Thenius supposes, for nothing is known respecting any such sanctuary. It was no doubt placed in the tabernacle, where the law of Moses was also deposited, by the side of the fundamental law of the divine state in Israel. When the business was all completed, Samuel sent the people away to their own home.",
            "children": []
          }
        ]
      }
    ]
  }
]