[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shew thee what thou shalt do.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Considerable doubt exists among expositors as to the exact meaning and reference of these words of Samuel. In 1 Samuel 13., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and following, a well-known and most important event in Saul’s life and reign is related, in which the circumstances strangely fit in with the words of the warning of Samuel. Only between this first meeting of the seer and the future king and the Gilgal meeting, described in 1 Samuel 13., two years—perhaps even a much longer period—elapsed (the dates of this age are most uncertain); besides which, that famous meeting at Gilgal was not by any means the first meeting of Samuel and Saul at that place. Yet, in spite of these difficulties, it seems best to refer to this meeting between the prophet and king at Gilgal, related in 1 Samuel 13, as the trial of faith especially looked on to by Samuel here. The solemn warning here given was, doubtless, repeated in a much more detailed form by the prophet some time before the appointed Gilgal meeting. So much for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reference; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the signification of the warning is best explained in the following way:—Samuel had bidden the future king to advance along the paths of glory and difficulty which lay before him in all confidence and trust, acting in each emergency according to the dictates of his own heart—only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thing he must be ever on his guard. In his future great work for the regeneration and advancement of Israel, he must, for the sake of the faith of Israel, be on his guard against infringing the sacred privileges of the religion of the Eternal. In the plenitude of his kingly power, the day would come when the temptation would assault him to disregard the ancient sanctity of the sacrifice, and to assume as king, functions which belonged alone to men like Samuel set apart for the sacred office, and thus publicly to dishonour the commandments of God, and by his reckless example of unbelief in revelation to weaken the faith of the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Such a temptation presented itself to Saul, we believe, some two or more years from this time, when, as related in 1 Samuel 13, a solemn assembly of the people was summoned to Gilgal, before the commencement of the war of independence. This great enterprise for the people of the Lord must necessarily be begun with solemn religious rites and sacrifices. These the king was forbidden to officiate at without the presence of the Divinely appointed seer. We shall see how King Saul acted under the temptation to set himself and his royal power above the prophet of the Lord and the direct command of God. Whether or no King Saul with his own hand offered the Gilgal sacrifice is uncertain; at all events, the great sin he seemed to have been guilty of having committed, is to have declined to wait for the presence of the prophet of the Lord, although publicly required by the word of the Lord to do so. (See Notes on 1 Samuel 13)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The “heart” is mentioned as changed by God, because, according to the conception of the Divine writings, the heart is represented as the centre of the whole mental and physical life—of will, desire, thought, perception, and feeling. It was one thing for Samuel the seer to put before the young Benjamite the brilliant destiny which lay before him, but it was another and different thing to transform one like Saul, brought up to merely agricultural pursuits, into a fit and worthy recipient of such honours and powers. We know how utterly incapable are all such things as wealth and rank and power in themselves of inspiring the heart with any noble patriotic aspirations, or with any high religious longings, or lofty patriotic aims; a higher influence is needed to awaken the heart, or to rouse it from merely earthly and sordid contemplations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The “heart” is mentioned as changed by God, because, according to the conception of the Divine writings, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "heart ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is represented as the centre of the whole mental and physical life—of will, desire, thought, perception, and feeling. It was one thing for Samuel the seer to put before the young Benjamite the brilliant destiny which lay before him, but it was another and different thing to transform one like Saul, brought up to merely agricultural pursuits, into a fit and worthy recipient of such honours and powers. We know how utterly incapable are all such things as wealth and rank and power in themselves of inspiring the heart with any noble patriotic aspirations, or with any high religious longings, or lofty patriotic aims; a higher influence is needed to awaken the heart, or to rouse it from merely earthly and sordid contemplations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This is the work which God worked in the heart. of the young Saul as, in the early morning, he left “Ramah of the Watchers,” his ears tingling with the burning words of the great seer all through that day and many succeeding days. In quiet humility, and, no doubt, with many a silent prayer, he watched and waited; when he returned home there was no sign of exultation visible in the man, no mark of impatience. His lips were sealed; he seems to have whispered to no one what the prophet had told him; he made no sign even when events came crowding thick about him—such as the popular assembly for the choice of a king, presided over by the prophet-judge, whose mind Saul alone in Israel knew: the drawing of the lots: the narrowing of the fateful circle: the designation of his tribe, his family, then himself. We see, indeed, God had changed his heart. Was there not in these early days a promise of a noble king—a man after God’s own heart?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And all those signs came to pass that day.—Of the first two signs which were to meet him no further details are given; we are simply told that in the order predicted by Samuel Saul came across them. The third alone gives occasion for a special mention, because it had a great effect on the life of the future king.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And all those signs came to pass that day.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Of the first two signs which were to meet him no further details are given; we are simply told that in the order predicted by Samuel Saul came across them. The third alone gives occasion for a special mention, because it had a great effect on the life of the future king.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 10:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seven days shalt thou tarry till I come ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This, though now mentioned and commanded, was not immediately to be performed; as is evident, partly from the whole course of the story, (which shows that Saul and Samuel, and the people, first met at Mizpeh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., where Saul was chosen of God, and accepted by the people as king; and afterward went to Gilgal once before the time here spoken of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 11:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and partly by comparing this place with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., where we find Saul charged with the violation of this command, two years after the giving of it. It seems this was given as a standing rule for Saul to observe while Samuel and he lived; that in case of any great future difficulties, as the invasion of enemies, Saul should resort to Gilgal, and call the people thither, and tarry there seven days, which was but a necessary time for gathering the people, and for the coming of Samuel thither. And Gilgal was chosen for this purpose, because that place was famous for the solemn renewing of the covenant between God and Israel, (Joshua 4.,) and for other eminent instances of God’s favour to them, the remembrance whereof was a confirmation of their faith; and because it was a very convenient place for the tribes within and without Jordan to assemble in, and consult, and unite their forces together upon such occasions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-8 The sacred anointing, then used, pointed at the great Messiah, or Anointed One, the King of the church, and High Priest of our profession, who was anointed with the oil of the Spirit, not by measure, but without measure, and above all the priests and princes of the Jewish church. For Saul's further satisfaction, Samuel gives him some signs which should come to pass the same day. The first place he directs him to, was the sepulchre of one of his ancestors; there he must be reminded of his own mortality, and now that he had a crown before him, must think of his grave, in which all his honour would be laid in the dust. From the time of Samuel there appears to have been schools, or places where pious young men were brought up in the knowledge of Divine things. Saul should find himself strongly moved to join with them, and should be turned into another man from what he had been. The Spirit of God changes men, wonderfully transforms them. Saul, by praising God in the communion of saints, became another man, but it may be questioned if he became a new man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seven days shalt thou tarry ... - The appointment here made is not to be confounded with that mentioned in marginal reference. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. thou shalt go down before me to Gilgal—This, according to Josephus, was to be a standing rule for the observance of Saul while the prophet and he lived; that in every great crisis, such as a hostile incursion on the country, he should repair to Gilgal, where he was to remain seven days, to afford time for the tribes on both sides Jordan to assemble, and Samuel to reach it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Seven days shalt thou tarry till I come to thee:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this, though now mentioned and commanded, yet was not immediately to be performed; as is evident, partly from the whole course of the story, which shows that Saul, and Samuel, and the people first met at Mizpeh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 10:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., where Saul was chosen by God and accepted by the people as king; and afterwards went to Gilgal, once before the time here spoken of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 11:14,15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and partly by comparing this place with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 13:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., where we find Saul charged with the violation of this command two years after the giving of it, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 13:1,2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How then is this to be understood? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. This may be given as a standing rule for Saul to observe while Samuel and he lived; that in case of any great future difficulties, as the invasion of enemies, Saul should resort to Gilgal, and call the people thither, and tarry there seven days, which was but a reasonable and necessary time for the gathering of the people, and for the coming of Samuel thither. For though this be related as but once done, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 1Sa 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet Josephus affirms that it was to be constantly practised upon all such occasions. And Gilgal was chosen for this purpose as a very fit place; partly because that place was famous for the solemn renewing of the covenant between God and Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Jos 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and for other eminent instances of God’s favour to them, the remembrance whereof was a notable confirmation of their faith; and partly because it was a very convenient place for the tribes within and without Jordan to assemble, and consult, and unite their forces together upon such occasions. If you ask, Why then Saul did not practise this precept upon the first invasion of the Ammonites? it may be answered, that this was a rule for Saul when he and Samuel were asunder, whereas they were together in that expedition, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 11:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And further, that necessity did excuse the violation of this precept then, because Saul could not wait for Samuel, nor forbear his action for seven days, as is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 11:3,9,10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",9,10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. (which I propose with submission to the learned and judicious) This may be here added as another sign to confirm his faith, which having strengthened by three foregoing signs, he now fortifies it by another sign which was to follow afterwards; it being very usual for God to give men signs to confirm their faith from future events; as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 3:12 2 Kings 19:29 Isaiah 7:13,14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 19:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the meaning maybe this, Another sign will I add to strengthen thy faith: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in due time, and upon a great occasion which shall then happen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "go down before me to Gilgal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and there ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will come down unto thee to offer—sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. But when thou comest thither, be sure ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou tarry there seven days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and then ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as I have said, and give thee necessary instructions and assistance, as the matter shall require. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou shall go down before me to Gilgal,.... Not immediately; for the first summons of the people, and of Saul, and the first meeting of them by Samuel, were at Mizpeh, where Saul was chosen by lot; nor the first time of Saul's being at Gilgal, when the kingdom was renewed; for Saul had no need to wait seven days there, since he and Samuel went together, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather at the second time of his being there, where not staying the time quite up, was reproved for it, which was two years after this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though it may be this was a general rule to be observed by Saul, that whenever anything turned up of importance to the children of Israel, and was a difficulty with him, he should go to Gilgal, and there wait seven days for Samuel, from the time he gave him notice of it, who would come at the appointed time, and would give him what advice and instructions were necessary; and this place was the rather appointed, because it was the place where the Israelites first pitched their camp when they came over Jordan, and where the tabernacle first was; and where prayer and sacrifices were wont to be made; and where the kingdom of Saul was renewed; and which lay convenient for all the tribes, both on the one and the other side of Jordan: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, I will come down to thee to offer burnt offerings, and to sacrifice sacrifices of peace offerings; so he did when the kingdom was renewed, and Saul was confirmed in it, 1 Samuel 11:15 but two years after, Saul not staying the full time, he offered them himself by another, for which he was reproved, 1 Samuel 13:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and, behold, I will come down to thee to offer burnt offerings, and to sacrifice sacrifices of peace offerings; so he did when the kingdom was renewed, and Saul was confirmed in it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but two years after, Saul not staying the full time, he offered them himself by another, for which he was reproved, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "seven days shalt thou tarry till I come to thee; either from the time of the notice he should give to Samuel of his going thither, or from the time of his arrival there; for it can by no means be understood as from the time of his present departure from him, for the reasons before given: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and show thee what thou shalt do; in the then present emergency or difficulty on his hands; and this he said to encourage him under the weight and burden of government laid upon him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and show thee what thou shalt do; in the then present emergency or difficulty on his hands; and this he said to encourage him under the weight and burden of government laid upon him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And thou shalt go down before me to Gilgal; and, behold, I will come down unto thee, to offer burnt offerings, and to sacrifice sacrifices of peace offerings: seven days shalt thou tarry, till I come to thee, and show thee what thou shalt do.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt go down before me to Gilgal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and when thou goest down before me to Gilgal.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is not to be understood as a direction to meet Samuel at Gilgal at once. The injunction applies to some future occasion whenever it might be, of which they had been talking. Doubtless Samuel and Saul had been discussing the best means of shaking off the Philistine yoke, and had agreed upon a muster of the people at Gilgal, as the national centre furthest from the Philistine power. Samuel’s parting injunction to Saul is to take no step independently. The king must wait for the prophet’s sanction to strike the blow. The fitting opportunity for the muster did not come for several years, and when it came Saul disobeyed Samuel’s command. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou shalt go down before me to Gilgal.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We find in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:8-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a meeting at Gilgal so exactly parallel to what is arranged here that we cannot help looking upon this, again, as a sort of sign to be fulfilled at a later period. It is no argument against it that Gilgal was the place where in the mean while Saul was solemnly inaugurated king; for he was appointed in order that he might deliver Israel from the Philistines (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and we may feel sure that this grand purpose would form the subject of conversation between the prophet and the soldier, either on the house-top or the next morning. In this conversation Gilgal would be selected as the place where Saul would assemble Israel for the war of independence (so Rashi and other Jewish interpreters); and so great an enterprise must necessarily be begun with religious rites, and Saul was to wait a full week for the prophet's coming, both to try his faith, which ought to have been confirmed by the fulfilment of the three appointed signs, and in order that the war might be undertaken under the same holy auspices as his own election to the kingdom. The two years' interval, were it really so long, would give time for Saul's character to develop under the forcing influences of royalty, and it would then be proved, when he felt himself every inch a king, whether he was still as amenable to the Divine authority as when he was first summoned from obscurity to mount a kingly throne. But, really, the words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not justify this conclusion, and most probably the occurrences mentioned in that chapter followed immediately upon Saul's confirmation as king. 1 Samuel 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In conclusion, Samuel gave him an important hint with regard to his future attitude: \"And goest thou before me down to Gilgal; and, behold, I am coming down to thee, to offer burnt-offerings, and to sacrifice peace-offerings: thou shalt wait seven days, till I come to thee, that I may show thee what thou art to do.\" The infinitive clause וגו להעלות is undoubtedly dependent upon the main clause וירדתּ, and not upon the circumstantial clause which is introduced as a parenthesis. The thought therefore is the following: If Saul went down to Gilgal to offer sacrifice there, he was to wait till Samuel arrived. The construction of the main clause itself, however, is doubtful, since, grammatically considered, ירדתּ can either be a continuation of the imperative עשׂה (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or can be regarded as independent, and in fact conditional. The latter view, according to which ירדתּ supposes his going down as a possible thing that may take place at a future time, is the one required by the circumstantial clause which follows, and which is introduced by והנּה; for if וירדתּ were intended to be a continuation of the imperative which precedes it, so that Samuel commanded Saul to go down to Gilgal before him, he would have simply announced his coming, that is to say, he would either have said וירדתּי or ארד ואני. The circumstantial clause \"and behold I am coming down to thee\" evidently presupposes Saul's going down as a possible occurrence, in the event of which Samuel prescribes the course he is to pursue. But the conditional interpretation of וירדתּ is still more decidedly required by the context. For instance, when Samuel said to Saul that after the occurrence of the three signs he was to do what came to his hand, he could hardly command him immediately afterwards to go to Gilgal, since the performance of what came to his hand might prevent him from going to Gilgal. If, however, Samuel meant that after Saul had finished what came to his hand he was to go down to Gilgal, he would have said, \"And after thou hast done this, go down to Gilgal,\" etc. But as he does not express himself in this manner, he can only have referred to Saul's going to Gilgal as an occurrence which, as he foresaw, would take place at some time or other. And to Saul himself this must not only have presented itself as a possible occurrence, but under the existing circumstances as one that was sure to take place; so that the whole thing was not so obscure to him as it is to us, who are only able to form our conclusions from the brief account which lies before us. If we suppose that in the conversation which Samuel had with Saul upon the roof (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he also spoke about the manner in which the Philistines, who had pushed their outposts as far as Gibeah, could be successfully attacked, he might also have mentioned that Gilgal was the most suitable place for gathering an army together, and for making the necessary preparations for a successful engagement with their foes. If we just glance at the events narrated in the following chapters, for the purpose of getting a clear idea of the thing which Samuel had in view; we find that the three signs announced by Samuel took place on Saul's return to Gibeah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:9-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Samuel then summoned the people to Mizpeh, where Saul was elected king by lot (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:17-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but Saul returned to Gibeah to his own house even after this solemn election, and was engaged in ploughing the field, when messengers came from Jabesh with the account of the siege of that town by the Ammonites. On receiving this intelligence the Spirit of Jehovah came upon him, so that he summoned the whole nation with energy and without delay to come to battle, and proceeded to Jabesh with the assembled army, and smote the Ammonites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 11:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thereupon Samuel summoned the people to come to Gilgal and renew the monarchy there (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 11:12-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and at the same time he renewed his office of supreme judge (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that now for the first time Saul actually commenced his reign, and began the war against the Philistines (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in which, as soon as the latter advanced to Michmash with a powerful army after Jonathan's victorious engagement, he summoned the people to Gilgal to battle, and after waiting there seven days for Samuel in vain, had the sacrifices offered, on which account as soon as Samuel arrived he announced to him that his rule would not last (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now, it cannot have been the first of these two gatherings at Gilgal that Samuel had in his mind, but must have been the second. The first is precluded by the simple fact that Samuel summoned the people to go to Gilgal for the purpose of renewing the monarchy; and therefore, as the words \"come and let us go to Gilgal\" (1 Samuel 11:14) unquestionably imply, he must have gone thither himself along with the people and the king, so that Saul was never in a position to have to wait for Samuel's arrival. The second occurrence at Gilgal, on the other hand, is clearly indicated in the words of 1 Samuel 13:8, \"Saul tarried seven days, according to the set time that Samuel had appointed,\" in which there is almost an express allusion to the instructions given to Saul in the verse before us. But whilst we cannot but regard this as the only true explanation, we cannot agree with Seb. Schmidt, who looks upon the instructions given to Saul in this verse as \"a rule to be observed throughout the whole of Samuel's life,\" that is to say, who interprets ירדתּ in the sense of \"as often as thou goest down to Gilgal.\" For this view cannot be grammatically sustained, although it is founded upon the correct idea, that Samuel's instructions cannot have been intended as a solitary and arbitrary command, by which Saul was to be kept in a condition of dependence. According to our explanation, however, this is not the case; but there was an inward necessity for them, so far as the government of Saul was concerned. Placed as he was by Jehovah as king over His people, for the purpose of rescuing them out of the power of those who were at that time its most dangerous foes, Saul was not at liberty to enter upon the war against these foes simply by his own will, but was directed to wait till Samuel, the accredited prophet of Jehovah, had completed the consecration through the offering of a solemn sacrifice, and had communicated to him the requisite instructions from God, even though he should have to wait for seven days.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Now, it cannot have been the first of these two gatherings at Gilgal that Samuel had in his mind, but must have been the second. The first is precluded by the simple fact that Samuel summoned the people to go to Gilgal for the purpose of renewing the monarchy; and therefore, as the words \"come and let us go to Gilgal\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") unquestionably imply, he must have gone thither himself along with the people and the king, so that Saul was never in a position to have to wait for Samuel's arrival. The second occurrence at Gilgal, on the other hand, is clearly indicated in the words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Saul tarried seven days, according to the set time that Samuel had appointed,\" in which there is almost an express allusion to the instructions given to Saul in the verse before us. But whilst we cannot but regard this as the only true explanation, we cannot agree with Seb. Schmidt, who looks upon the instructions given to Saul in this verse as \"a rule to be observed throughout the whole of Samuel's life,\" that is to say, who interprets ירדתּ in the sense of \"as often as thou goest down to Gilgal.\" For this view cannot be grammatically sustained, although it is founded upon the correct idea, that Samuel's instructions cannot have been intended as a solitary and arbitrary command, by which Saul was to be kept in a condition of dependence. According to our explanation, however, this is not the case; but there was an inward necessity for them, so far as the government of Saul was concerned. Placed as he was by Jehovah as king over His people, for the purpose of rescuing them out of the power of those who were at that time its most dangerous foes, Saul was not at liberty to enter upon the war against these foes simply by his own will, but was directed to wait till Samuel, the accredited prophet of Jehovah, had completed the consecration through the offering of a solemn sacrifice, and had communicated to him the requisite instructions from God, even though he should have to wait for seven days.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The difficulty in question has been solved on the whole quite correctly by Brentius. \"It is not to be supposed,\" he says, \"that Samuel was directing Saul to go at once to Gilgal as soon as he should go away from him, and wait there for seven days; but that he was to do this after he had been chosen king by public lot, and having conquered the Ammonites and been confirmed in the kingdom, was about to prepare to make war upon the Philistines, on whose account chiefly it was that he had been called to the kingdom. For the Lord had already spoken thus to Samuel concerning Saul: 'He will save my people from the hands of the Philistines, because I have looked upon my people.' This is the meaning therefore of Samuel's command: Thou hast been called to the kingdom chiefly for this purpose, that thou mayest deliver Israel from the tyranny of the Philistines. When therefore thou shalt enter upon this work, go down into Gilgal and wait there seven days, until I shall come to thee: for thou shalt then offer a holocaust, though not before I come to thee, and I will show thee what must be done in order that our enemies the Philistines may be conquered. The account of this is given below in 1 Samuel 13, where we learn that Saul violated this command.\") ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The difficulty in question has been solved on the whole quite correctly by Brentius. \"It is not to be supposed,\" he says, \"that Samuel was directing Saul to go at once to Gilgal as soon as he should go away from him, and wait there for seven days; but that he was to do this after he had been chosen king by public lot, and having conquered the Ammonites and been confirmed in the kingdom, was about to prepare to make war upon the Philistines, on whose account chiefly it was that he had been called to the kingdom. For the Lord had already spoken thus to Samuel concerning Saul: 'He will save my people from the hands of the Philistines, because I have looked upon my people.' This is the meaning therefore of Samuel's command: Thou hast been called to the kingdom chiefly for this purpose, that thou mayest deliver Israel from the tyranny of the Philistines. When therefore thou shalt enter upon this work, go down into Gilgal and wait there seven days, until I shall come to thee: for thou shalt then offer a holocaust, though not before I come to thee, and I will show thee what must be done in order that our enemies the Philistines may be conquered. The account of this is given below in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where we learn that Saul violated this command.\") ",
            "children": []
          }
        ]
      }
    ]
  }
]