[{"header":"Psalm 17"},{"num":1,"verse":"Hear the right (my righteous cause), O Lord; listen to my shrill, piercing cry! Give ear to my prayer, that comes from unfeigned and guileless lips."},{"num":2,"verse":"Let my sentence of vindication come from You! May Your eyes behold the things that are just and upright."},{"num":3,"verse":"You have proved my heart; You have visited me in the night; You have tried me and find nothing [no evil purpose in me]; I have purposed that my mouth shall not transgress."},{"num":4,"verse":"Concerning the works of men, by the word of Your lips I have avoided the ways of the violent (the paths of the destroyer)."},{"num":5,"verse":"My steps have held closely to Your paths [to the tracks of the One Who has gone on before]; my feet have not slipped."},{"num":6,"verse":"I have called upon You, O God, for You will hear me; incline Your ear to me and hear my speech."},{"num":7,"verse":"Show Your marvelous loving-kindness, O You Who save by Your right hand those who trust and take refuge in You from those who rise up against them."},{"num":8,"verse":"Keep and guard me as the pupil of Your eye; hide me in the shadow of Your wings"},{"num":9,"verse":"From the wicked who despoil and oppress me, my deadly adversaries who surround me."},{"num":10,"verse":"They are enclosed in their own prosperity and have shut up their hearts to pity; with their mouths they make exorbitant claims and proudly and arrogantly speak."},{"num":11,"verse":"They track us down in each step we take; now they surround us; they set their eyes to cast us to the ground,"},{"num":12,"verse":"Like a lion greedy and eager to tear his prey, and as a young lion lurking in hidden places."},{"num":13,"verse":"Arise, O Lord! Confront and forestall them, cast them down! Deliver my life from the wicked by Your sword,"},{"num":14,"verse":"From men by Your hand, O Lord, from men of this world [these poor moths of the night] whose portion in life is idle and vain. Their bellies are filled with Your hidden treasure [what You have stored up]; their children are satiated, and they leave the rest [of their] wealth to their babes."},{"num":15,"verse":"As for me, I will continue beholding Your face in righteousness (rightness, justice, and right standing with You); I shall be fully satisfied, when I awake [to find myself] beholding Your form [and having sweet communion with You]."}]