[{"num":11,"verse":"Then answered Tzophar the Na’amati, and said,"},{"num":2,"verse":"Should not the multitude of dvarim be answered? And should an ish full of talk yitzdak (be justified)?"},{"num":3,"verse":"Should thy vain talk silence men, so that thou mockest, v’ein machlim (without anyone putting thee to shame)?"},{"num":4,"verse":"For thou hast said, My lekach (doctrine, teaching, belief) is pure, and I am clean in Thine eyes."},{"num":5,"verse":"But oh that Eloah would speak, and open His lips against thee,"},{"num":6,"verse":"And that He would show thee the secrets of chochmah, that tushiyyah (true wisdom) has two sides! Have da’as therefore that Eloah forgetteth much of thy avon."},{"num":7,"verse":"Canst thou search out the cheker Eloah (depths of G-d)? Canst thou probe to the tachlis Shaddai (the end, completeness of Almighty)?"},{"num":8,"verse":"It is like the heights of Shomayim; what canst thou do? Deeper than Sheol; of what canst thou have da’as?"},{"num":9,"verse":"The measure thereof is longer than ha’aretz, and broader than the yam (sea)."},{"num":10,"verse":"When Eloah passes by and arrests and convenes for judgment, who then can constrain Him?"},{"num":11,"verse":"For He has da’as of deceitful men; He seeth wickedness also; will He not then take note of it?"},{"num":12,"verse":"But before a witless ish can become wise, a colt of a pereh (wild donkey) would be born an adam!"},{"num":13,"verse":"If thou direct thine lev, and stretch out thine hands to Him,"},{"num":14,"verse":"If iniquity be in thine yad, put it far away, and let not wickedness dwell in thy ohalim."},{"num":15,"verse":"For then shalt thou lift up thy face without mum; yea, thou shalt be firm, and shalt not fear,"},{"num":16,"verse":"Because thou shalt forget thy amal (grief), and remember it as waters that flow by,"},{"num":17,"verse":"And thine cheled (duration of life) shall be brighter than the tzohorayim (noonday); thou shalt shine forth; thou shalt be as the boker."},{"num":18,"verse":"And thou shalt be secure, because now there is tikveh; yea, thou shalt search, and thou shalt take thy rest in safety."},{"num":19,"verse":"Also thou shalt lie down, and none shall make thee afraid; yea, rabbim (many) shall court thy favor."},{"num":20,"verse":"But the eyes of the resha’im faileth, and they shall not escape, and their tikveh shall be as the last gasp of the nefesh."}]