[{"num":11,"verse":"Then Zophar (the) Naamathite answered, and said,"},{"num":2,"verse":"Whether he, that speaketh many things, shall not also hear? either a man full of words shall be made just? (Shall he, who saith many things, not also listen? or is a man so full of words always right, or correct?)"},{"num":3,"verse":"Shall men be still to thee alone? and when thou hast scorned other men, shalt thou not be overcome of any man? (Shall people hold their peace for thee alone? and when thou hast scorned other people, shalt thou not be rebuked by anyone?)"},{"num":4,"verse":"For thou saidest, My word is clean, and I am clean in thy sight."},{"num":5,"verse":"And I would (And I wish), that God spake with thee, and opened his lips to thee;"},{"num":6,"verse":"to show to thee the privates of wisdom, and that his law is manyfold, and thou shouldest then understand, that thou art required of God to pay much less things, than thy wickedness deserveth. (to show thee the secrets of wisdom, and that his Law is manifold, and then thou wouldest understand, that thou art required by God to pay much less, than thy wickedness deserveth.)"},{"num":7,"verse":"In hap thou shalt comprehend the steps of God, and thou shalt find Almighty God unto perfection. (Perhaps thou shalt be able to comprehend the steps of God, and thou shalt discover the perfection of Almighty God!)"},{"num":8,"verse":"He is higher than heaven, and what shalt thou do? he is deeper than hell, and whereof shalt thou know? (It is higher than heaven, so what shalt thou do? it is deeper than Sheol, or hell, so what shalt thou know?)"},{"num":9,"verse":"His measure is longer than the earth (Its measurement is wider than the earth), and broader than the sea."},{"num":10,"verse":"If he destroyeth all things, either driveth them straitly into one, who shall against-say him? (who shall say against him?) Either who may say to him, Why doest thou so?"},{"num":11,"verse":"For he knoweth the vanity of men; and whether he seeing, beholdeth not wickedness? (For he knoweth the emptiness, and futility, of some people’s lives; and when he seeth wickedness, shall he not assay it?/and when he looketh, shall he not see their wickedness?)"},{"num":12,"verse":"A vain man is raised (up) into pride; and he guesseth himself born free, as the colt of a wild ass (like the colt of a wild donkey)."},{"num":13,"verse":"But thou hast made steadfast thine heart, and hast spread abroad thine hands to him."},{"num":14,"verse":"If thou doest away from thee the wickedness, that is in thine hand, and if unrightwiseness dwelleth not in thy tabernacle (and if unrighteousness dwelleth not in thy home),"},{"num":15,"verse":"then thou shalt raise up thy face without wem, and thou shalt be steadfast, and thou shalt not dread. (then thou shalt raise up thy face without blemish, or without fault, and thou shalt be strong, and thou shalt not have fear.)"},{"num":16,"verse":"And thou shalt forget (thy) wretchedness, and thou shalt not think of it, as of waters that have passed. (And thou shalt forget thy wretchedness, and thou shalt not think of it any more, like water that hath passed by, and is forgotten.)"},{"num":17,"verse":"And as midday shining, it shall raise (up) to thee at eventide; and when thou guessest thee (to be) wasted, thou shalt rise up as the day star. (And thy life shall shine forth, like the noonday sun; and when thou thinkest thyself to be destroyed, thou shalt rise up like the day star.)"},{"num":18,"verse":"And thou shalt have trust, while hope shall be set forth to thee; and thou buried shalt sleep securely (and thou shalt lie down in safety and security)."},{"num":19,"verse":"Thou shalt rest, and none shall be that shall make thee afeared; and full many men shall beseech thy face."},{"num":20,"verse":"But the eyes of wicked men shall fail; and succor shall perish from them, and the hope of them shall be abomination of soul. (But the eyes of the wicked shall fail; and succor shall perish from them, and their only hope shall be their despair.)"}]