[{"header":"Judgment on Gentile Nations—Ammon"},{"num":25,"verse":"The word of the Lord came to me again, saying, "},{"num":2,"verse":"“Son of man, set your face toward the Ammonites and prophesy against them. "},{"num":3,"verse":"And say to the Ammonites, ‘Hear the word of the Lord God, for thus says the Lord God, “Because you said, ‘Aha!’ against My sanctuary when it was profaned and against the land of Israel when it was made desolate and against the house of Judah when they went into exile, "},{"num":4,"verse":"therefore, behold, I am going to give you to the people of the East as a possession, and they will set their encampments among you and make their dwellings among you; they will eat your fruit and drink your milk. "},{"num":5,"verse":"I will make Rabbah [your chief city] a pasture for camels and [the cities of] the Ammonites a resting place for flocks [of sheep]. And you will know [without any doubt] that I am the Lord.” "},{"num":6,"verse":"For thus says the Lord God, “Because you have clapped your hands and stamped your feet and rejoiced with all the contempt, and malice, and spite of your soul against the land of Israel, "},{"num":7,"verse":"therefore, behold, I have stretched out My hand against you and will hand you over as prey and spoil to the nations. And I will cut you off from the peoples and will cause you to perish from the countries; I will destroy you. Then you shall know [without any doubt] that I am the Lord.”"},{"header":"Moab"},{"num":8,"verse":"‘Thus says the Lord God, “Because Moab and Seir (Edom) say, ‘Behold, the house of Judah is like all the [pagan] nations,’ "},{"num":9,"verse":"therefore, behold, I will deprive the flank of Moab of its cities which are on its frontiers, the glory of the land, Beth-jeshimoth, Baal-meon and Kiriathaim. "},{"num":10,"verse":"I will give it, along with the children of Ammon, to the people of the East as a possession, so that the children of Ammon will not be remembered among the nations [any longer]. "},{"num":11,"verse":"Thus I will execute judgment and punishment on Moab, and they will know [without any doubt] that I am the Lord.”"},{"header":"Edom"},{"num":12,"verse":"‘Thus says the Lord God, “Because Edom has acted against the house of Judah by taking vengeance, and has greatly offended and has incurred grievous guilt by taking revenge on them,” "},{"num":13,"verse":"therefore thus says the Lord God, “I will also stretch out My hand against Edom and I will cut off and destroy man and beast. I will make it desolate; from Teman even to Dedan they will fall by the sword. "},{"num":14,"verse":"I will take My vengeance on Edom by the hand of My people Israel. Therefore, they will act in Edom in accordance with My anger and My wrath, and they will know and experience My vengeance,” says the Lord God."},{"header":"Philistia"},{"num":15,"verse":"‘Thus says the Lord God, “Because the Philistines have acted revengefully and have taken vengeance [contemptuously] with malice in their hearts to destroy with everlasting hostility and hatred,” "},{"num":16,"verse":"therefore thus says the Lord God, “Behold, I will stretch out My hand against the Philistines, and I will cut off the Cherethites and destroy the remnant of the seacoast. "},{"num":17,"verse":"I will execute great vengeance on them with wrathful rebukes and chastisements and they will know [without any doubt] that I am the Lord when I lay My vengeance on them.”’”"}]