[{"header":"Judgment on Gentile Nations—Ammon"},{"num":25,"verse":"And the word of the Lord came to me, saying,"},{"num":2,"verse":"“Son of man, set your face against the sons of Ammon and prophesy against them,"},{"num":3,"verse":"and say to the sons of Ammon, ‘Hear the word of the Lord God! This is what the Lord God says: “Because you said, ‘Aha!’ against My sanctuary when it was profaned, and against the land of Israel when it was made desolate, and against the house of Judah when they went into exile,"},{"num":4,"verse":"therefore, behold, I am going to give you to the people of the east as a possession, and they will set up their encampments among you and make their dwellings among you; they will eat your fruit and drink your milk."},{"num":5,"verse":"I will make Rabbah a pasture for camels, and the sons of Ammon a resting place for flocks. Then you will know that I am the Lord.”"},{"num":6,"verse":"For this is what the Lord God says: “Because you have clapped your hands and stamped your feet, and have rejoiced with all the malice in your soul against the land of Israel,"},{"num":7,"verse":"therefore, behold, I have reached out with My hand against you and I will give you as plunder to the nations. And I will cut you off from the peoples and eliminate you from the lands. I will exterminate you. So you will know that I am the Lord.”"},{"header":"Moab"},{"num":8,"verse":"‘The Lord God says this: “Because Moab and Seir say, ‘Behold, the house of Judah is like all the nations,’"},{"num":9,"verse":"therefore, behold, I am going to deprive the flank of Moab of its cities, of its cities which are on its frontiers, the glory of the land, Beth-jeshimoth, Baal-meon, and Kiriathaim;"},{"num":10,"verse":"and I will give it as a possession along with the sons of Ammon to the people of the east, so that the sons of Ammon will not be remembered among the nations."},{"num":11,"verse":"So I will execute judgments on Moab, and they will know that I am the Lord.”"},{"header":"Edom"},{"num":12,"verse":"‘The Lord God says this: “Because Edom has acted against the house of Judah by taking vengeance, and has incurred great guilt, and avenged themselves upon them,”"},{"num":13,"verse":"therefore this is what the Lord God says: “I will also reach out with My hand against Edom and eliminate human and animal life from it. And I will turn it into ruins; from Teman even to Dedan they will fall by the sword."},{"num":14,"verse":"And I will inflict My vengeance on Edom by the hand of My people Israel. Therefore, they will act in Edom in accordance with My anger and My wrath; so they will know My vengeance,” declares the Lord God."},{"header":"Philistia"},{"num":15,"verse":"‘This is what the Lord God says: “Because the Philistines have acted in revenge, and have taken vengeance with malice in their souls to destroy with everlasting hostility,”"},{"num":16,"verse":"therefore this is what the Lord God says: “Behold, I am going to reach out with My hand against the Philistines and eliminate the Cherethites; and I will destroy the remnant of the seacoast."},{"num":17,"verse":"I will execute great vengeance on them with wrathful rebukes; and they will know that I am the Lord, when I inflict My vengeance on them.”’”"}]