[[],[{"type":"header","content":"A Message for Ammon"},{"type":"prose","content":"Then this message came to me from the :"}],[{"type":"prose","content":"“Son of man, turn and face the land of Ammon and prophesy against its people."}],[{"type":"prose","content":"Give the Ammonites this message from the Sovereign : Hear the word of the Sovereign ! Because you cheered when my Temple was defiled, mocked Israel in her desolation, and laughed at Judah as she went away into exile,"}],[{"type":"prose","content":"I will allow nomads from the eastern deserts to overrun your country. They will set up their camps among you and pitch their tents on your land. They will harvest all your fruit and drink the milk from your livestock."}],[{"type":"prose","content":"And I will turn the city of Rabbah into a pasture for camels, and all the land of the Ammonites into a resting place for sheep and goats. Then you will know that I am the ."}],[{"type":"prose","content":"“This is what the Sovereign  says: Because you clapped and danced and cheered with glee at the destruction of my people,"}],[{"type":"prose","content":"I will raise my fist of judgment against you. I will give you as plunder to many nations. I will cut you off from being a nation and destroy you completely. Then you will know that I am the ."},{"type":"header","content":"A Message for Moab"}],[{"type":"prose","content":"“This is what the Sovereign  says: Because the people of Moab have said that Judah is just like all the other nations,"}],[{"type":"prose","content":"I will open up their eastern flank and wipe out their glorious frontier towns—Beth-jeshimoth, Baal-meon, and Kiriathaim."}],[{"type":"prose","content":"And I will hand Moab over to nomads from the eastern deserts, just as I handed over Ammon. Yes, the Ammonites will no longer be counted among the nations."}],[{"type":"prose","content":"In the same way, I will bring my judgment down on the Moabites. Then they will know that I am the ."},{"type":"header","content":"A Message for Edom"}],[{"type":"prose","content":"“This is what the Sovereign  says: The people of Edom have sinned greatly by avenging themselves against the people of Judah."}],[{"type":"prose","content":"Therefore, says the Sovereign , I will raise my fist of judgment against Edom. I will wipe out its people and animals with the sword. I will make a wasteland of everything from Teman to Dedan."}],[{"type":"prose","content":"I will accomplish this by the hand of my people of Israel. They will carry out my vengeance with anger, and Edom will know that this vengeance is from me. I, the Sovereign , have spoken!"},{"type":"header","content":"A Message for Philistia"}],[{"type":"prose","content":"“This is what the Sovereign  says: The people of Philistia have acted against Judah out of bitter revenge and long-standing contempt."}],[{"type":"prose","content":"Therefore, this is what the Sovereign  says: I will raise my fist of judgment against the land of the Philistines. I will wipe out the Kerethites and utterly destroy the people who live by the sea."}],[{"type":"prose","content":"I will execute terrible vengeance against them to punish them for what they have done. And when I have inflicted my revenge, they will know that I am the .”"}]]