[{"header":"Proclamation against Ammon"},{"num":25,"verse":"The word of the Lord came to me: "},{"num":2,"verse":"Mortal, set your face towards the Ammonites and prophesy against them. "},{"num":3,"verse":"Say to the Ammonites, Hear the word of the Lord God: Thus says the Lord God, Because you said, ‘Aha!’ over my sanctuary when it was profaned, and over the land of Israel when it was made desolate, and over the house of Judah when it went into exile; "},{"num":4,"verse":"therefore I am handing you over to the people of the east for a possession. They shall set their encampments among you and pitch their tents in your midst; they shall eat your fruit, and they shall drink your milk. "},{"num":5,"verse":"I will make Rabbah a pasture for camels and Ammon a fold for flocks. Then you shall know that I am the Lord. "},{"num":6,"verse":"For thus says the Lord God: Because you have clapped your hands and stamped your feet and rejoiced with all the malice within you against the land of Israel, "},{"num":7,"verse":"therefore I have stretched out my hand against you, and will hand you over as plunder to the nations. I will cut you off from the peoples and will make you perish out of the countries; I will destroy you. Then you shall know that I am the Lord."},{"header":"Proclamation against Moab"},{"num":8,"verse":"Thus says the Lord God: Because Moab said, The house of Judah is like all the other nations, "},{"num":9,"verse":"therefore I will lay open the flank of Moab from the towns on its frontier, the glory of the country, Beth-jeshimoth, Baal-meon, and Kiriathaim. "},{"num":10,"verse":"I will give it along with Ammon to the people of the east as a possession. Thus Ammon shall be remembered no more among the nations, "},{"num":11,"verse":"and I will execute judgements upon Moab. Then they shall know that I am the Lord."},{"header":"Proclamation against Edom"},{"num":12,"verse":"Thus says the Lord God: Because Edom acted vengefully against the house of Judah and has grievously offended in taking vengeance upon them, "},{"num":13,"verse":"therefore thus says the Lord God, I will stretch out my hand against Edom, and cut off from it humans and animals, and I will make it desolate; from Teman even to Dedan they shall fall by the sword. "},{"num":14,"verse":"I will lay my vengeance upon Edom by the hand of my people Israel; and they shall act in Edom according to my anger and according to my wrath; and they shall know my vengeance, says the Lord God."},{"header":"Proclamation against Philistia"},{"num":15,"verse":"Thus says the Lord God: Because with unending hostilities the Philistines acted in vengeance, and with malice of heart took revenge in destruction; "},{"num":16,"verse":"therefore thus says the Lord God, I will stretch out my hand against the Philistines, cut off the Cherethites, and destroy the rest of the sea coast. "},{"num":17,"verse":"I will execute great vengeance on them with wrathful punishments. Then they shall know that I am the Lord, when I lay my vengeance on them."}]