[{"header":"Shemaiah's Prophecy(A)"},{"num":11,"verse":"When King Rehoboam arrived in Jerusalem, he called together 180,000 of the best soldiers from the tribes of Benjamin and Judah. He intended to go to war and restore his control over the northern tribes of Israel. "},{"num":2,"verse":"But the Lord told the prophet Shemaiah "},{"num":3,"verse":"to give this message to King Rehoboam and to all the people of the tribes of Judah and Benjamin: "},{"num":4,"verse":"“Do not attack your own relatives. Go home, all of you. What has happened is my will.” They obeyed the Lord's command and did not go to fight Jeroboam."},{"header":"Rehoboam Fortifies the Cities"},{"num":5,"verse":"Rehoboam remained in Jerusalem and had fortifications built for the following cities of Judah and Benjamin: "},{"num":6,"verse":"Bethlehem, Etam, Tekoa, "},{"num":7,"verse":"Bethzur, Soco, Adullam, "},{"num":8,"verse":"Gath, Mareshah, Ziph, "},{"num":9,"verse":"Adoraim, Lachish, Azekah, "},{"num":10,"verse":"Zorah, Aijalon, and Hebron. "},{"num":11,"verse":"He had them strongly fortified and appointed a commander for each of them, and in each one he placed supplies of food, olive oil, and wine, "},{"num":12,"verse":"and also shields and spears. In this way he kept Judah and Benjamin under his control."},{"header":"Priests and Levites Come to Judah"},{"num":13,"verse":"From all the territory of Israel priests and Levites came south to Judah. "},{"num":14,"verse":"The Levites abandoned their pastures and other land and moved to Judah and Jerusalem, because King Jeroboam of Israel and his successors would not let them serve as priests of the Lord. "},{"num":15,"verse":"Jeroboam appointed priests of his own to serve at the pagan places of worship and to worship demons and the idols he made in the form of bull-calves. "},{"num":16,"verse":"From all the tribes of Israel people who sincerely wanted to worship the Lord, the God of Israel, followed the Levites to Jerusalem, so that they could offer sacrifices to the Lord, the God of their ancestors. "},{"num":17,"verse":"This strengthened the kingdom of Judah, and for three years they supported Rehoboam son of Solomon and lived as they had under the rule of King David and King Solomon."},{"header":"Rehoboam's Family"},{"num":18,"verse":"Rehoboam married Mahalath, whose father was Jerimoth son of David and whose mother was Abihail, the daughter of Eliab and granddaughter of Jesse. "},{"num":19,"verse":"They had three sons, Jeush, Shemariah, and Zaham. "},{"num":20,"verse":"Later he married Maacah, the daughter of Absalom, and they had four sons: Abijah, Attai, Ziza, and Shelomith. "},{"num":21,"verse":"In all, Rehoboam had eighteen wives and sixty concubines, and he fathered twenty-eight sons and sixty daughters. Of all his wives and concubines he loved Maacah best, "},{"num":22,"verse":"and he favored her son Abijah over all his other children, choosing him as the one to succeed him as king. "},{"num":23,"verse":"Rehoboam wisely assigned responsibilities to his sons and stationed them throughout Judah and Benjamin in the fortified cities. He provided generously for them and also secured many wives for them."}]