[[],[{"type":"header","content":"Rehoboam Reigns over Judah and Builds Cities"},{"type":"prose","content":"Now when Rehoboam had come to Jerusalem, he assembled the house of Judah and Benjamin, 180,000 chosen warriors, to fight against Israel to restore the kingdom to Rehoboam."}],[{"type":"prose","content":"But the word of the LORD came to Shemaiah the man of God, saying,"}],[{"type":"prose","content":"“Tell Rehoboam the son of Solomon, king of Judah, and all Israel in Judah and Benjamin, saying,"}],[{"type":"prose","content":"‘This is what the LORD says: “You shall not go up nor fight against your relatives; return, every man, to his house, for this event is from Me.”’” So they listened to the words of the LORD and returned from going against Jeroboam."}],[{"type":"prose","content":"Rehoboam lived in Jerusalem and built cities for defense in Judah."}],[{"type":"prose","content":"He built Bethlehem, Etam, Tekoa,"}],[{"type":"prose","content":"Beth-zur, Soco, Adullam,"}],[{"type":"prose","content":"Gath, Mareshah, Ziph,"}],[{"type":"prose","content":"Adoraim, Lachish, Azekah,"}],[{"type":"prose","content":"Zorah, Aijalon, and Hebron, which are fortified cities in Judah and Benjamin."}],[{"type":"prose","content":"He also strengthened the fortresses and put officers in them and supplies of food, oil, and wine."}],[{"type":"prose","content":" shields and spears in every city and strengthened them greatly. So he held Judah and Benjamin."}],[{"type":"prose","content":"Moreover, the priests and the Levites who were in all Israel also stood with him from all their districts."}],[{"type":"header","content":"Jeroboam Appoints False Priests"},{"type":"prose","content":"For the Levites left their pasture lands and their property and went to Judah and Jerusalem, because Jeroboam and his sons had excluded them from serving as priests to the LORD."}],[{"type":"prose","content":"He set up priests of his own for the high places, for the satyrs and the calves which he had made."}],[{"type":"prose","content":"Those from all the tribes of Israel who set their hearts on seeking the LORD God of Israel followed them to Jerusalem, to sacrifice to the LORD God of their fathers."}],[{"type":"prose","content":"They strengthened the kingdom of Judah and supported Rehoboam the son of Solomon for three years, for they walked in the way of David and Solomon for three years."}],[{"type":"header","content":"Rehoboam’s Family"},{"type":"prose","content":"Then Rehoboam married Mahalath the daughter of Jerimoth the son of David  Abihail the daughter of Eliab the son of Jesse,"}],[{"type":"prose","content":"and she bore to him sons: Jeush, Shemariah, and Zaham."}],[{"type":"prose","content":"After her he married Maacah the daughter of Absalom, and she bore to him Abijah, Attai, Ziza, and Shelomith."}],[{"type":"prose","content":"Rehoboam loved Maacah the daughter of Absalom more than all his  wives and concubines. For he had taken eighteen wives and sixty concubines, and fathered twenty-eight sons and sixty daughters."}],[{"type":"prose","content":"Rehoboam appointed Abijah the son of Maacah as head and leader among his brothers, for he  to make him king."}],[{"type":"prose","content":"He acted wisely and distributed some of his sons through all the territories of Judah and Benjamin to all the fortified cities, and he gave them plenty of provisions. And he sought many wives ."}]]