[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:16-24 Christ reflects on the scribes and Pharisees, who had a proud conceit of themselves. He likens their behaviour to children's play, who being out of temper without reason, quarrel with all the attempts of their fellows to please them, or to get them to join in the plays for which they used to assemble. The cavils of worldly men are often very trifling and show great malice. Something they have to urge against every one, however excellent and holy. Christ, who was undefiled, and separate from sinners, is here represented as in league with them, and polluted by them. The most unspotted innocence will not always be a defence against reproach. Christ knew that the hearts of the Jews were more bitter and hardened against his miracles and doctrines, than those of Tyre and Sidon would have been; therefore their condemnation would be the greater. The Lord exercises his almighty power, yet he punishes none more than they deserve, and never withholds the knowledge of the truth from those who long after it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But whereunto shall I liken ... - Christ proceeds to reprove the inconsistency and fickleness of that age of people. He says they were like children - nothing pleased them. He refers here to the \"plays\" or \"sports\" of children. Instrumental music, or piping and dancing, were used in marriages and festivals as a sign of joy. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 21:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 11:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Children imitate their parents and others, and act over in play what they see done by others. Among their childish sports, therefore, was probably an imitation of a wedding or festal occasion. We have seen also (the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that funerals were attended with mournful music, and lamentation, and howling. It is not improbable that children also, in play: imitated a mournful funeral procession. One part are represented as sullen and dissatisfied. They would not enter into the play: nothing pleased them. The others complained of it. We have, said they, taken all pains to please you. We have piped to you, have played lively tunes, and have engaged in cheerful sports, but you would not join with us; and then we have played different games, and imitated the mourning at funerals, and you are equally sullen; \"you have not lamented;\" you have not joked with us. Nothing pleases you. So, said Christ, is this generation of people. \"John\" came one way, \"neither eating nor drinking,\" abstaining as a Nazarite, and you were not pleased with him. I, the Son of man, have come in a different manner, \"eating and drinking;\" not practicing any austerity, but living like other people, and you are equally dissatisfied - nay, you are less pleased. You calumniate him, and abuse me for not doing the very thing which displeased you in John. Nothing pleases you. You are fickle, changeable, inconstant, and abusive.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Markets - Places to sell provisions; places of concourse, where also children flocked together for play.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have piped - We have played on musical instruments. A \"pipe\" was a wind instrument of music often used by shepherds.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither eating nor drinking - That is, abstaining from some kinds of food and wine, as a Nazarite. It does not mean that he did not eat at all, but that he was remarkable for abstinence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hath a devil - He is actuated by a bad spirit. He is irregular, strange, and cannot be a good man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Son of man came eating and drinking - That is, living as others do; not practicing austerity; and they accuse him of being fond of excess, and seeking the society of the wicked.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gluttonous - One given to excessive eating.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wine-bibber - One who drinks much wine. Jesus undoubtedly lived according to the general customs of the people of his time. He did not affect singularity; he did not separate himself as a Nazarite; he did not practice severe austerities. He ate that which was common and drank that which was common. As wine was a common article of beverage among the people, he drank it. It was the pure juice of the grape, and for anything that can be proved, it was without fermentation. In regard to the kind of wine which was used, see the notes at John 2:10. No one should plead the example, at any rate, in favor of making use of the wines that are commonly used in this country - wines, many of which are manufactured here, and without a particle of the pure juice of the grape, and most of which are mixed with noxious drugs to give them color and flavor.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wine-bibber - One who drinks much wine. Jesus undoubtedly lived according to the general customs of the people of his time. He did not affect singularity; he did not separate himself as a Nazarite; he did not practice severe austerities. He ate that which was common and drank that which was common. As wine was a common article of beverage among the people, he drank it. It was the pure juice of the grape, and for anything that can be proved, it was without fermentation. In regard to the kind of wine which was used, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". No one should plead the example, at any rate, in favor of making use of the wines that are commonly used in this country - wines, many of which are manufactured here, and without a particle of the pure juice of the grape, and most of which are mixed with noxious drugs to give them color and flavor.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Wisdom is justified of her children - The children of wisdom are the wise - those who understand. The Saviour means that though that generation of Pharisees and fault-finders did not appreciate the conduct of John and himself, yet the \"wise,\" the candid - those who understood the reasons of their conduct - would approve of and do justice to it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wisdom is justified of her children - The children of wisdom are the wise - those who understand. The Saviour means that though that generation of Pharisees and fault-finders did not appreciate the conduct of John and himself, yet the \"wise,\" the candid - those who understood the reasons of their conduct - would approve of and do justice to it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. Now when John had heard in the prison—For the account of this imprisonment, see on [1261]Mr 6:17-20.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the works of Christ, he sent, &c.—On the whole passage, see on [1262]Lu 7:18-35.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 16,17. Luke, telling to us the same history, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 7:31-35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:31-35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", prefaces it thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 7:29,30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all the people that heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him, and the publicans, justified God, being baptized with the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "baptism of John. But the Pharisees and the lawyers rejected the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "counsel of God against themselves, being not baptized of him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Which letteth us know that our Saviour by the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this generation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here doth not mean all the people of that generation; but the Pharisees and the lawyers, whom nothing could allure or persuade to the receiving of Jesus Christ, neither the ministry and example of John, nor yet his own preaching and example. For the people and the publicans justified the words of Christ, which he had spoken in commendation of John, and were baptized of him; but the Pharisees and lawyers did not believe, nor would be baptized of him. These our Saviour likens to a company of sullen children, whom their fellows could not persuade any way to a compliance with them: if they piped they would not dance; if they sang to them some mournful songs, neither would they be affected with them; so as no tune would please them. It is thought that our Saviour doth here allude to some sport used then amongst children, which we are not so well acquainted with, wherein children were wont to sing, sometimes more merry and pleasant, sometimes more sad and mournful songs one to another; and that he here likens the Pharisees and lawyers to a sullen set of children, that, let their companions sing what they would, would not answer them. Our Saviour’s meaning is expounded plainly enough by the next words (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 11:18,19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And saying, we have piped unto you, and ye have not danced,.... The allusion is to Jewish children, who having seen their parents and friends at their festivals and weddings, some play upon the pipe, and others dance to them, mimicked the same in their diversions; and also having observed, at funerals, the mourning women, making their doleful ditties, and others answering to them, acted the part of these persons, expecting their fellows would make their responses, but did not: hence the complaint, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "we have mourned unto you, and ye have not lamented. The different characters of John and Christ, are here set forth, by \"piping\" and \"mourning\". The character and ministry of Christ and his disciples, by \"piping\"; by which is meant, the clear, comfortable, and joyful ministry of the Gospel; which is delightful music to a sensible sinner; and may be compared to it, for distinction of sounds, harmony, and agreement, being charming and delightful; its notes are all grace, mercy, love, liberty, peace, pardon, righteousness, and free salvation; and it is very powerful and engaging, it quickens and animates, attracts, allures and charms. The character and ministry of John, is signified by \"mourning\": his life was a very austere one; he and his disciples fasted oft; he appeared in a very coarse habit; his speech was rough, his voice thundering: his doctrine was the doctrine of repentance, and he used very severe threatenings, in case of impenitence: on the other hand, by the \"fellows\" to whom they piped, or ministered, in their different ministrations, are meant, the Scribes and Pharisees; who were neither affected to, nor with, either of them: as for John, he was too austere for them; they did not like his garb, nor his diet; nor did his doctrine, or baptism please them; nor were they wrought upon, or brought to repentance by his ministry; they did not lament, weep, or shed one tear, but sat unmoved, like stocks and stones, under those awful striking discourses, on mournful subjects, delivered by him: nor were they pleased with the free conduct, and pleasant conversation of Christ; nor did they dance, or rejoice, at the good news and glad tidings of grace, and salvation, which were brought by him: of such froward, peevish spirits they were, that neither John, nor Christ, could please them: they were a true picture and emblem of many persons, who like neither law nor Gospel, but are morose, sullen, and quarrelsome, let them hear what they will; as Solomon says, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"If a wise man contendeth with a foolish man, whether he rage or laugh, there is no rest\", Proverbs 29:9. Upon which the Talmudists (i) comment, and illustrate it in this manner, and produce a proverbial saying, much like this in the text. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"If a wise man contendeth with a foolish man, whether he rage or laugh, there is no rest\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Upon which the Talmudists (i) comment, and illustrate it in this manner, and produce a proverbial saying, much like this in the text. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Says God, I was angry with Ahaz, and I delivered him into the hands of the kings of Damascus; he sacrificed and burnt incense to their gods, 2 Chronicles 28:22. I played with Amaziah, and I gave the king of Edom into his hands; he brought their gods and worshipped them, 2 Chronicles 25:14. Says R. Papa, this is what men say, or it is a common proverb,         , \"they weep to a man who takes no notice of it, they laugh to a man who does not observe it\"; woe to that man, who knows not the difference between good and evil.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Says God, I was angry with Ahaz, and I delivered him into the hands of the kings of Damascus; he sacrificed and burnt incense to their gods, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". I played with Amaziah, and I gave the king of Edom into his hands; he brought their gods and worshipped them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 25:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Says R. Papa, this is what men say, or it is a common proverb,         , \"they weep to a man who takes no notice of it, they laugh to a man who does not observe it\"; woe to that man, who knows not the difference between good and evil.'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) T. Bab. Sanhedrim, fol. 103. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) T. Bab. Sanhedrim, fol. 103. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And saying, We have piped unto you, and ye have not danced; we have mourned unto you, and ye have not lamented.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ηὐλήσαμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we have piped",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., played on the pipe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐθρηνήσαμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we have mourned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". An instance of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Chiasmus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[530]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[530] See Explanation of Technical Terms in Appendix.—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Matthew 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mourn (ἐκόψασθε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., beat or strike (the breast), as in oriental funeral lamentations. ",
        "children": []
      }
    ]
  }
]