[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:16-24 Christ reflects on the scribes and Pharisees, who had a proud conceit of themselves. He likens their behaviour to children's play, who being out of temper without reason, quarrel with all the attempts of their fellows to please them, or to get them to join in the plays for which they used to assemble. The cavils of worldly men are often very trifling and show great malice. Something they have to urge against every one, however excellent and holy. Christ, who was undefiled, and separate from sinners, is here represented as in league with them, and polluted by them. The most unspotted innocence will not always be a defence against reproach. Christ knew that the hearts of the Jews were more bitter and hardened against his miracles and doctrines, than those of Tyre and Sidon would have been; therefore their condemnation would be the greater. The Lord exercises his almighty power, yet he punishes none more than they deserve, and never withholds the knowledge of the truth from those who long after it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou, Capernaum - See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which art exalted to heaven - This is an expression used to denote great privileges. He meant that they were especially favored with instruction. The city was prosperous. It was signally favored by its wealth. Most of all, it was signally favored by the presence, the preaching, and the miracles of the Lord Jesus Christ. Here he spent a large portion of his time in the early part of his ministry, and in Capernaum and its neighborhood he performed his chief miracles.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shalt be brought down to hell - This does not mean that all the people would go to hell, but that the city which had flourished so prosperously would lose its prosperity, and occupy the \"lowest place\" among cities. The word \"hell\" is used here, not to denote a place of punishment in the future world, but a state of \"desolation and destructions.\" It stands in contrast with the word \"heaven.\" As their being exalted to heaven did not mean that the \"people\" would all be saved or dwell in heaven, so their being brought down to \"hell\" refers to the desolation of the \"city.\" Their privileges, honors, wealth, etc., would be taken away, and they would sink as low among cities as they had been before exalted. This has been strictly fulfilled. In the wars between the Jews and the Romans, Chorazin, Bethsaida, Capernaum, etc., were so completely desolated that it is difficult to determine their former situation. See the notes at Matthew 4:13. It is not to be denied, also, that he threatened future punishment on those who rejected him. The truth inculcated is, that those who are especially favored will be punished accordingly if they abuse their privileges.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shalt be brought down to hell - This does not mean that all the people would go to hell, but that the city which had flourished so prosperously would lose its prosperity, and occupy the \"lowest place\" among cities. The word \"hell\" is used here, not to denote a place of punishment in the future world, but a state of \"desolation and destructions.\" It stands in contrast with the word \"heaven.\" As their being exalted to heaven did not mean that the \"people\" would all be saved or dwell in heaven, so their being brought down to \"hell\" refers to the desolation of the \"city.\" Their privileges, honors, wealth, etc., would be taken away, and they would sink as low among cities as they had been before exalted. This has been strictly fulfilled. In the wars between the Jews and the Romans, Chorazin, Bethsaida, Capernaum, etc., were so completely desolated that it is difficult to determine their former situation. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is not to be denied, also, that he threatened future punishment on those who rejected him. The truth inculcated is, that those who are especially favored will be punished accordingly if they abuse their privileges.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If the mighty works ...had been done in Sodom - See the notes at Matthew 10:15. Sodom was destroyed on account of its great wickedness. Christ says if his miracles had been performed there, they would have repented, and consequently the city would not have been destroyed. As it was, it would be better for Sodom in the day of judgment than for Capernaum, for its inhabitants would not be called to answer for the abuse of so great privileges. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If the mighty works ...had been done in Sodom - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Sodom was destroyed on account of its great wickedness. Christ says if his miracles had been performed there, they would have repented, and consequently the city would not have been destroyed. As it was, it would be better for Sodom in the day of judgment than for Capernaum, for its inhabitants would not be called to answer for the abuse of so great privileges. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. But I say unto you, That it shall be more tolerable for the land of Sodom in the day of judgment, than for thee—\"It has been indeed,\" says Dr. Stanley, \"more tolerable, in one sense, in the day of its earthly judgment, for the land of Sodom than for Capernaum; for the name, and perhaps even the remains of Sodom are still to be found on the shores of the Dead Sea; while that of Capernaum has, on the Lake of Gennesareth, been utterly lost.\" But the judgment of which our Lord here speaks is still future; a judgment not on material cities, but their responsible inhabitants—a judgment final and irretrievable.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 23,24. This speech of our Saviour is much of the same import with the other. The scope and sense of it is the same, to let the Capernaites know that the hardness of their heart was greater in contempt of the gospel, confirmed by so many miraculous operations, and their guilt greater, than the guilt of Sodom, long since destroyed by fire and brimstone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 19:1-38",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:1-38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", for though they were guilty of prodigious sinning, yet they had not such means to convince, reclaim, and reform them. God had not sent his Son amongst them, nor given them such testimonies of that act of grace as he had given these, by vouchsafing to confirm the doctrine of his Son by miracles; and therefore they must expect that God, in the day of judgment, should deal more severely with them than with the filthy and impure Sodomites. Our Saviour here speaketh not as an all knowing God, but as the Son of man to the sons of men, who speak upon probabilities and rational conjectures. If we should say that Christ spake this as an all knowing God, all that can be inferred is this, that an external reformation may be a lengthening out of persons’ tranquillity. In the mean time God was just to both in not giving them such means, they sinning notoriously against the light of nature, which they had, and the light of Lot’s holy example, whose righteous soul they vexed with their filthy conversation and unrighteous deeds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Peter 2:7,8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and he was also just in destroying of them. Capernaum is here said to have been ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "exalted to heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either with respect to their trading and outward prosperity, or with respect to the means of grace they enjoyed in hearing Christ’s sermons and seeing his miracles. The casting down to hell, seems to be meant of a temporal destruction, the word adhv not signifying the place of the damned, but the state of the dead; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 11:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " must be understood of eternal condemnation, which shall be ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in the day of judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But I say unto you,.... Capernaum, and the inhabitants thereof, as before, to Chorazin and Bethsaida. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It shall be more tolerable for the land of Sodom, in the day of judgment, than for thee: though the punishment of the men of Sodom will be very great, their iniquities being horribly dreadful and enormous, yet more easy to be borne than the vengeance, which, in the last and general judgment, will fall upon such, who have had the means of grace, and have despised them; especially such as had the personal presence, ministry, and miracles of Christ among them, as the Capernaites had. Such a way of expressing and setting forth the severer punishment of others, by that of Sodom, is not unusual in the Old Testament; see Lamentations 4:6 nor in Jewish writers, who say (r), that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It shall be more tolerable for the land of Sodom, in the day of judgment, than for thee: though the punishment of the men of Sodom will be very great, their iniquities being horribly dreadful and enormous, yet more easy to be borne than the vengeance, which, in the last and general judgment, will fall upon such, who have had the means of grace, and have despised them; especially such as had the personal presence, ministry, and miracles of Christ among them, as the Capernaites had. Such a way of expressing and setting forth the severer punishment of others, by that of Sodom, is not unusual in the Old Testament; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nor in Jewish writers, who say (r), that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the Israelites were fit for, or deserved,   , \"a far more heavy punishment than the punishment of Sodom\": because they abounded with prophets, rising early, and sending them, but they did not hearken; whereas Sodom had no hands stayed on her, or prophets to warn them.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Tzeror Hammor, fol. 82. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Tzeror Hammor, fol. 82. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But I say unto you, That it shall be more tolerable for the land of Sodom in the day of judgment, than for thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see notes ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vers. 20-24 and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Matthew 11:24",
        "children": []
      }
    ]
  }
]