[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(33) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unless she had turned from me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There may be an aposiopesis in this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Perhaps she turned aside from ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " me ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(otherwise) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "now I had killed thee, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "According to this view the angel does not assign a reason why the ass turned aside, but leaves this to be inferred by Balaam. (Comp. Keil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 22:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I had slain thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thee alone, and not the ass; therefore her turning aside and falling down was wholly for thy benefit, not for her own, and thy anger against her was unjust and unreasonable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:22-35 We must not think, that because God does not always by his providence restrain men from sin, therefore he approves of it, or that it is not hateful to him. The holy angels oppose sin, and perhaps are employed in preventing it more than we are aware. This angel was an adversary to Balaam, because Balaam counted him his adversary; those are really our best friends, and we ought so to reckon them, who stop our progress in sinful ways. Balaam has notice of God's displeasure by the ass. It is common for those whose hearts are fully set in them to do evil, to push on violently, through the difficulties Providence lays in their way. The Lord opened the mouth of the ass. This was a great miracle wrought by the power of God. He who made man speak, could, when he pleased, make the ass to speak with man's voice. The ass complained of Balaam's cruelty. The righteous God does not allow the meanest or weakest to be abused; but they shall be able to speak in their own defence, or he will some way or other speak for them. Balaam at length has his eyes opened. God has many ways to bring down the hard and unhumbled heart. When our eyes are opened, we shall see the danger of sinful ways, and how much it was for our advantage to be crossed. Balaam seemed to relent; I have sinned; but it does not appear that he was sensible of this wickedness of his heart, or willing to own it. If he finds he cannot go forward, he will be content, since there is no remedy, to go back. Thus many leave their sins, only because their sins have left them. The angel declared that he should not only be unable to curse Israel, but should be forced to bless them: this would be more for the glory of God, and to his own confusion, than if he had turned back.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is perverse - Rather, is headlong. Compare Peter's words ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the madness of the prophet.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. the Lord opened the mouth of the ass—to utter, like a parrot, articulate sounds, without understanding them. That this was a visionary scene is a notion which seems inadmissible, because of the improbability of a vision being described as an actual occurrence in the middle of a plain history. Besides, the opening of the ass's mouth must have been an external act, and that, with the manifest tenor of Peter's language, strongly favors the literal view [2Pe 2:15, 16]. The absence of any surprise at such a phenomenon on the part of Balaam may be accounted for by his mind being wholly engrossed with the prospect of gain, which produced \"the madness of the prophet\" [2Pe 2:16]. \"It was a miracle, wrought to humble his proud heart, which had to be first subjected in the school of an ass before he was brought to attend to the voice of God speaking by the angel\" [Calvin].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I had slain thee alone, and left her; and therefore her turning aside and falling down was wholly for thy sake and benefit, not for her own, and thy anger against her was unjust and unreasonable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the ass saw me, and turned from me these three times,.... The ass saw the angel when Balaam did not, and that was the reason of its turning aside; and it was well for him it did, and therefore he should not have smote it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unless she had turned from me; if she had pushed on, endeavouring to make her way: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "surely now also I had slain thee, and saved her alive; had certainly and only slain him, and not the ass; and from hence the Jewish writers (t) gather, that the ass was now slain, lest it should be said, this is the ass that spoke, and so be made an idol of. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Bemidbar Rabba, sect. 20. fol. 227. 4. Aben Ezra in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Bemidbar Rabba, sect. 20. fol. 227. 4. Aben Ezra in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the ass saw me, and turned from me these three times: unless she had turned from me, surely now also I had slain thee, and saved her alive.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 33.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Unless ... surely.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אוּלַיאּאּ־כִּי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is somewhat doubtful whether this phrase can be translated as in the Septuagint (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰ μὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "νῦν οῦν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")and in all the versions; but even if the construction of the sentence be broken, this is no doubt the meaning of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And saved her alive.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Compare the case of the ass of the disobedient prophet in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is plainly a righteous thing with God that obedience and faithfulness should be respected, and in some sense rewarded, even in an ass. Numbers 22:33",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The angel of the Lord sought to preserve Balaam from the destruction which threatened him, by standing in his way; but he did not see him, though his ass did. וגו נטתה אוּלי, \"perhaps it turned out before me; for otherwise I should surely have killed thee, and let her live.\" The first clause is to be regarded, as Hengstenberg supposes, as an aposiopesis. The angel does not state positively what was the reason why perhaps the ass had turned out of the way: he merely hints at it lightly, and leaves it to Balaam to gather from the hint, that the faithful animal had turned away from affection to its master, with a dim foreboding of the danger which threatened him, and yet for that very reason, as it were as a reward for its service of love, had been ill-treated by him. The traditional rendering, \"if the ass had not turned aside, surely,\" etc., cannot be defended according to the rules of the language; and there is not sufficient ground for any such alteration of the text as Knobel suggests, viz., into לוּלי. These words made an impression, and Balaam made this acknowledgment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"I have sinned, for I knew not that thou stoodest in the way against me; and now, if it displease thee, I will get me back again.\" The angel of the Lord replied, however (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"Go with the men; but only the word that I shall speak unto thee, that shalt you speak.\" This was sufficient to show him, that it was not the journey in itself that was displeasing to God, but the feelings and intentions with which he had entered upon it. The whole procedure was intended to sharpen his conscience and sober his mind, that he might pay attention to the word which the Lord would speak to him. At the same time the impression which the appearance and words of the angel of the Lord made upon his heart, enveloped in mist as it was by the thirst for gold and honour, was not a deep one, nor one that led him to a thorough knowledge of his own heart; otherwise, after such a warning, he would never have continued his journey. ",
        "children": []
      }
    ]
  }
]