[{"num":21,"verse":"¶ But Job answered and said,"},{"num":2,"verse":"Hear diligently my speech, and let this be instead of your consolations."},{"num":3,"verse":"Suffer me that I may speak; and after I have spoken, mock on."},{"num":4,"verse":"As for me, is my complaint to man? And if so, why should not my spirit be troubled?"},{"num":5,"verse":"Look upon me and be astonished and lay your hand upon your mouth."},{"num":6,"verse":"Even I myself, when I remember, I am afraid, and trembling takes hold on my flesh."},{"num":7,"verse":"¶ Why do the wicked live and become old and even increase in riches?"},{"num":8,"verse":"Their seed is with them, established in their sight, and their offspring before their eyes."},{"num":9,"verse":"Their houses are safe from fear; neither is the rod of God upon them."},{"num":10,"verse":"Their cows conceive, and do not abort; their cows calve and do not cast forth their young."},{"num":11,"verse":"They send forth their little ones like a flock of sheep, and their children dance."},{"num":12,"verse":"They jump at the sound of the timbrel and harp and rejoice at the sound of the organ."},{"num":13,"verse":"They spend their days in pleasure and in a moment go down to Sheol."},{"num":14,"verse":"Therefore, they say unto God, Depart from us; for we do not desire the knowledge of thy ways."},{"num":15,"verse":"Who is the Almighty that we should serve him? And what profit should we have if we pray unto him?"},{"num":16,"verse":"Behold that their good is not in their hands; the counsel of the wicked is far from me."},{"num":17,"verse":"¶ How often is the lamp of the wicked put out and their destruction comes upon them, and God distributes sorrows upon them in his anger."},{"num":18,"verse":"They shall be as stubble before the wind and as chaff taken up by the whirlwind."},{"num":19,"verse":"God shall lay up his violence for their sons; and he will reward him so that he shall know it."},{"num":20,"verse":"His eyes shall see his destruction, and he shall drink of the wrath of the Almighty."},{"num":21,"verse":"For what delight shall he have in his house after him, being cut off in the number of his months?"},{"num":22,"verse":"Shall he teach God knowledge, seeing he judges those that are high?"},{"num":23,"verse":"This one shall die in the full strength of his beauty, being completely at ease and quiet."},{"num":24,"verse":"His breasts are full of milk, and his bones are moistened with marrow."},{"num":25,"verse":"And another dies in the bitterness of his soul, never having eaten with pleasure."},{"num":26,"verse":"They shall lie down alike in the dust, and the worms shall cover them."},{"num":27,"verse":"¶ Behold, I know your thoughts and the imaginations which ye devise against me."},{"num":28,"verse":"For ye say, What is of the house of the prince, and what of the tent of the habitation of the wicked?"},{"num":29,"verse":"Have ye not asked those that go by the way, and do ye not know their tokens?"},{"num":30,"verse":"That the wicked is reserved for the day of destruction, they shall be brought forth to the day of wrath."},{"num":31,"verse":"Who shall declare his way to his face? And who shall repay him what he has done?"},{"num":32,"verse":"He shall yet be brought to the grave and shall remain in the tomb."},{"num":33,"verse":"The clods of the river valley shall be sweet unto him, and every man shall be drawn after him, as there were innumerable before him."},{"num":34,"verse":"How then do ye comfort me in vain, given that your answers remain as falsehood?"}]