[{"num":24,"verse":"1 David hid in a cave spareth Saul. 10 He showeth to Saul his innocency. 18 Saul acknowledgeth his fault. 22 He causeth David to swear unto him to be favorable to his."},{"num":1,"verse":"And David went thence, and dwelt in holds at En Gedi."},{"num":2,"verse":"When Saul was turned from the Philistines, they told him, saying, Behold, David is in the wilderness of En Gedi."},{"num":3,"verse":"Then Saul took three thousand chosen men out of all Israel, and went to seek David and his men upon the rocks among the wild goats."},{"num":4,"verse":"And he came to the sheepcotes by the way where there was a cave, and Saul went in to do his easement: and David and his men sat in the inward parts of the cave."},{"num":5,"verse":"And the men of David said unto him, See, the day is come, whereof the Lord said unto thee, Behold, I will deliver thine enemy into thine hand, and thou shalt do to him as it shall seem good to thee. Then David arose and cut off the lap of Saul’s garment privily."},{"num":6,"verse":"And afterward David was touched in his heart, because he had cut off the lap which was on Saul’s garment."},{"num":7,"verse":"And he said unto his men, The Lord keep me from doing that thing unto my master the Lord’s anointed, to lay mine hand upon him: for he is the Anointed of the Lord."},{"num":8,"verse":"So David overcame his servants with these words, and suffered them not to arise against Saul: for Saul rose up out of the cave and went away."},{"num":9,"verse":"¶ David also arose afterward, and went out of the cave, and cried after Saul, saying, O my lord the King. And when Saul looked behind him, David inclined his face to the earth, and bowed himself."},{"num":10,"verse":"And David said to Saul, Wherefore givest thou an ear to men’s words, that say, Behold, David seeketh evil against thee?"},{"num":11,"verse":"Behold, this day thine eyes have seen, that the Lord had delivered thee this day into mine hand in the cave, and some bade me kill thee, but I had compassion on thee, and said, I will not lay mine hand on my master: for he is the Lord’s Anointed."},{"num":12,"verse":"Moreover my father, behold: behold, I say, the lap of thy garment in mine hand: for when I cut off the lap of thy garment, I killed thee not. Understand and see, that there is neither evil nor wickedness in me, neither have I sinned against thee, yet thou huntest after my soul, to take it."},{"num":13,"verse":"The Lord be judge between thee and me, and the Lord avenge me of thee, and let not mine hand be upon thee."},{"num":14,"verse":"According as the old proverb saith, Wickedness proceedeth from the wicked, but mine hand be not upon thee."},{"num":15,"verse":"After whom is the king of Israel come out? after whom dost thou pursue? after a dead dog, and after a flea?"},{"num":16,"verse":"The Lord therefore be judge, and judge between thee and me, and see, and plead my cause, and deliver me out of thine hand."},{"num":17,"verse":"When David had made an end of speaking these words to Saul, Saul said, Is this thy voice, my son David? and Saul lift up his voice, and wept,"},{"num":18,"verse":"And said to David, Thou art more righteous than I: for thou hast rendered me good, and I have rendered thee evil."},{"num":19,"verse":"And thou hast showed this day, that thou hast dealt well with me: forasmuch as when the Lord had closed me in thine hands, thou killedst me not."},{"num":20,"verse":"For who shall find his enemy, and let him depart free? wherefore the Lord render thee good for that thou hast done unto me this day."},{"num":21,"verse":"For now behold, I know that thou shalt be king, and that the kingdom of Israel shall be stablished in thine hand."},{"num":22,"verse":"Swear now therefore unto me by the Lord, that thou wilt not destroy my seed after me, and that thou wilt not abolish my name out of my father’s house."},{"num":23,"verse":"So David swore unto Saul, and Saul went home: but David and his men went up unto the hold."}]