[{"header":"David Spares Saul’s Life"},{"num":24,"verse":"When Saul returned from pursuing the Philistines, he was told, “Look, David is in the wilderness of En-gedi.” "},{"num":2,"verse":"Saul took 3,000 of his best troops from all over Israel, and he went to look for David and his men in the direction of the Rocks of the Wild Goats. "},{"num":3,"verse":"He came to the sheepfolds beside the road. There was a cave there, and Saul went in to relieve himself. Now David and his men were sitting in the inner recesses of the cave."},{"num":4,"verse":"David’s men told him, “Look, today is the day about which the Lord spoke to you when he said, ‘I’ll give your enemy into your hand.’ Do to him whatever you want!”"},{"num":5,"verse":"Afterwards, David’s conscience bothered him because he had cut off the corner of Saul’s robe. "},{"num":6,"verse":"He told his men, “God forbid that I should do this thing to your majesty, the Lord’s anointed, by stretching out my hand against him, since he’s the Lord’s anointed.” "},{"num":7,"verse":"David restrained his men with his words and did not allow them to rebel against Saul. Saul got up from the cave and started off."},{"header":"David Rebukes Saul"},{"num":8,"verse":"Then David got up, went out of the cave, and called out to Saul: “Your majesty!” Saul looked behind him, and David bowed down with his face to the ground and prostrated himself. "},{"num":9,"verse":"Then David told Saul, “Why do you listen to the words of those who say, ‘Look, David is trying to harm you?’ "},{"num":10,"verse":"Look, this very day you saw with your own eyes that the Lord gave you into my control in the cave, and one of my men told me to kill you, but I had pity on you and responded, ‘I won’t lift my hand against his majesty because he’s the Lord’s anointed.’ "},{"num":11,"verse":"Look, my father, look! The corner of your robe is in my hand. Indeed, by my cutting off the corner of your robe and not killing you, you may know and understand that I have no evil intent or transgression—I haven’t wronged you, even though you are hunting me to take my life. "},{"num":12,"verse":"May the Lord judge between me and you, and may he take vengeance on you for me, but I won’t be attacking you. "},{"num":13,"verse":"Just like the ancient proverb says, ‘From wicked people comes wickedness,’ but I’m not against you. "},{"num":14,"verse":"After whom is the king of Israel going out? Whom are you pursuing? A dead dog or a single flea? "},{"num":15,"verse":"May the Lord act as judge, and may he decide between me and you. May he see, may he plead my case, and may he vindicate me in this dispute against you.”"},{"header":"Saul’s Apparent Repentance"},{"num":16,"verse":"When David had finished saying these things to Saul, Saul asked, “Is this your voice, my son David?” Then Saul cried loudly "},{"num":17,"verse":"to David, “You are more righteous than I am, because you have treated me well even though I’ve treated you poorly. "},{"num":18,"verse":"You have explained how you treated me well, in that the Lord delivered me into your hand but you didn’t kill me. "},{"num":19,"verse":"For who would find his enemy and then send him away safely? May the Lord repay you for what you have done for me today. "},{"num":20,"verse":"Now I know for certain that you will be king, and that the kingdom will be established under your authority. "},{"num":21,"verse":"Now swear to me by the Lord that you will never eliminate my descendants after me, and that you won’t erase my name from my father’s family.” "},{"num":22,"verse":"David made this vow to Saul, and then Saul went home, while David and his men went up to the stronghold."}]