[{"header":"Goliath Challenges the Israelites"},{"num":17,"verse":"The Philistines now mustered their army for battle and camped between Socoh in Judah and Azekah at Ephes-dammim."},{"num":2,"verse":"Saul countered by gathering his Israelite troops near the valley of Elah."},{"num":3,"verse":"So the Philistines and Israelites faced each other on opposite hills, with the valley between them."},{"num":4,"verse":"Then Goliath, a Philistine champion from Gath, came out of the Philistine ranks to face the forces of Israel. He was over nine feet tall!"},{"num":5,"verse":"He wore a bronze helmet, and his bronze coat of mail weighed 125 pounds."},{"num":6,"verse":"He also wore bronze leg armor, and he carried a bronze javelin on his shoulder."},{"num":7,"verse":"The shaft of his spear was as heavy and thick as a weaver’s beam, tipped with an iron spearhead that weighed 15 pounds. His armor bearer walked ahead of him carrying a shield."},{"num":8,"verse":"Goliath stood and shouted a taunt across to the Israelites. “Why are you all coming out to fight?” he called. “I am the Philistine champion, but you are only the servants of Saul. Choose one man to come down here and fight me!"},{"num":9,"verse":"If he kills me, then we will be your slaves. But if I kill him, you will be our slaves!"},{"num":10,"verse":"I defy the armies of Israel today! Send me a man who will fight me!”"},{"num":11,"verse":"When Saul and the Israelites heard this, they were terrified and deeply shaken."},{"header":"Jesse Sends David to Saul’s Camp"},{"num":12,"verse":"Now David was the son of a man named Jesse, an Ephrathite from Bethlehem in the land of Judah. Jesse was an old man at that time, and he had eight sons."},{"num":13,"verse":"Jesse’s three oldest sons—Eliab, Abinadab, and Shimea—had already joined Saul’s army to fight the Philistines."},{"num":14,"verse":"David was the youngest son. David’s three oldest brothers stayed with Saul’s army,"},{"num":15,"verse":"but David went back and forth so he could help his father with the sheep in Bethlehem."},{"num":16,"verse":"For forty days, every morning and evening, the Philistine champion strutted in front of the Israelite army."},{"num":17,"verse":"One day Jesse said to David, “Take this basket of roasted grain and these ten loaves of bread, and carry them quickly to your brothers."},{"num":18,"verse":"And give these ten cuts of cheese to their captain. See how your brothers are getting along, and bring back a report on how they are doing.”"},{"num":19,"verse":"David’s brothers were with Saul and the Israelite army at the valley of Elah, fighting against the Philistines."},{"num":20,"verse":"So David left the sheep with another shepherd and set out early the next morning with the gifts, as Jesse had directed him. He arrived at the camp just as the Israelite army was leaving for the battlefield with shouts and battle cries."},{"num":21,"verse":"Soon the Israelite and Philistine forces stood facing each other, army against army."},{"num":22,"verse":"David left his things with the keeper of supplies and hurried out to the ranks to greet his brothers."},{"num":23,"verse":"As he was talking with them, Goliath, the Philistine champion from Gath, came out from the Philistine ranks. Then David heard him shout his usual taunt to the army of Israel."},{"num":24,"verse":"As soon as the Israelite army saw him, they began to run away in fright."},{"num":25,"verse":"“Have you seen the giant?” the men asked. “He comes out each day to defy Israel. The king has offered a huge reward to anyone who kills him. He will give that man one of his daughters for a wife, and the man’s entire family will be exempted from paying taxes!”"},{"num":26,"verse":"David asked the soldiers standing nearby, “What will a man get for killing this Philistine and ending his defiance of Israel? Who is this pagan Philistine anyway, that he is allowed to defy the armies of the living God?”"},{"num":27,"verse":"And these men gave David the same reply. They said, “Yes, that is the reward for killing him.”"},{"num":28,"verse":"But when David’s oldest brother, Eliab, heard David talking to the men, he was angry. “What are you doing around here anyway?” he demanded. “What about those few sheep you’re supposed to be taking care of? I know about your pride and deceit. You just want to see the battle!”"},{"num":29,"verse":"“What have I done now?” David replied. “I was only asking a question!”"},{"num":30,"verse":"He walked over to some others and asked them the same thing and received the same answer."},{"num":31,"verse":"Then David’s question was reported to King Saul, and the king sent for him."},{"header":"David Kills Goliath"},{"num":32,"verse":"“Don’t worry about this Philistine,” David told Saul. “I’ll go fight him!”"},{"num":33,"verse":"“Don’t be ridiculous!” Saul replied. “There’s no way you can fight this Philistine and possibly win! You’re only a boy, and he’s been a man of war since his youth.”"},{"num":34,"verse":"But David persisted. “I have been taking care of my father’s sheep and goats,” he said. “When a lion or a bear comes to steal a lamb from the flock,"},{"num":35,"verse":"I go after it with a club and rescue the lamb from its mouth. If the animal turns on me, I catch it by the jaw and club it to death."},{"num":36,"verse":"I have done this to both lions and bears, and I’ll do it to this pagan Philistine, too, for he has defied the armies of the living God!"},{"num":37,"verse":"The Lord who rescued me from the claws of the lion and the bear will rescue me from this Philistine!”"},{"num":38,"verse":"Then Saul gave David his own armor—a bronze helmet and a coat of mail."},{"num":39,"verse":"David put it on, strapped the sword over it, and took a step or two to see what it was like, for he had never worn such things before."},{"num":40,"verse":"He picked up five smooth stones from a stream and put them into his shepherd’s bag. Then, armed only with his shepherd’s staff and sling, he started across the valley to fight the Philistine."},{"num":41,"verse":"Goliath walked out toward David with his shield bearer ahead of him,"},{"num":42,"verse":"sneering in contempt at this ruddy-faced boy."},{"num":43,"verse":"“Am I a dog,” he roared at David, “that you come at me with a stick?” And he cursed David by the names of his gods."},{"num":44,"verse":"“Come over here, and I’ll give your flesh to the birds and wild animals!” Goliath yelled."},{"num":45,"verse":"David replied to the Philistine, “You come to me with sword, spear, and javelin, but I come to you in the name of the Lord of Heaven’s Armies—the God of the armies of Israel, whom you have defied."},{"num":46,"verse":"Today the Lord will conquer you, and I will kill you and cut off your head. And then I will give the dead bodies of your men to the birds and wild animals, and the whole world will know that there is a God in Israel!"},{"num":47,"verse":"And everyone assembled here will know that the Lord rescues his people, but not with sword and spear. This is the Lord’s battle, and he will give you to us!”"},{"num":48,"verse":"As Goliath moved closer to attack, David quickly ran out to meet him."},{"num":49,"verse":"Reaching into his shepherd’s bag and taking out a stone, he hurled it with his sling and hit the Philistine in the forehead. The stone sank in, and Goliath stumbled and fell face down on the ground."},{"num":50,"verse":"So David triumphed over the Philistine with only a sling and a stone, for he had no sword."},{"num":51,"verse":"Then David ran over and pulled Goliath’s sword from its sheath. David used it to kill him and cut off his head."},{"header":"Israel Routs the Philistines"},{"num":52,"verse":"Then the men of Israel and Judah gave a great shout of triumph and rushed after the Philistines, chasing them as far as Gath and the gates of Ekron. The bodies of the dead and wounded Philistines were strewn all along the road from Shaaraim, as far as Gath and Ekron."},{"num":53,"verse":"Then the Israelite army returned and plundered the deserted Philistine camp."},{"num":54,"verse":"(David took the Philistine’s head to Jerusalem, but he stored the man’s armor in his own tent.)"},{"num":55,"verse":"As Saul watched David go out to fight the Philistine, he asked Abner, the commander of his army, “Abner, whose son is this young man?”"},{"num":56,"verse":"“Well, find out who he is!” the king told him."},{"num":57,"verse":"As soon as David returned from killing Goliath, Abner brought him to Saul with the Philistine’s head still in his hand."},{"num":58,"verse":"“Tell me about your father, young man,” Saul said."}]