[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Cords of a man.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In contrast with the cords with which unmanageable beasts are held in check. Israel is led with “bands of love,” not of compulsion. Render the last clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And gently towards them gave I food to eat,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expressing the tenderness, delicacy, and condescension of his personal regard.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1-7 When Israel were weak and helpless as children, foolish and froward as children, then God loved them; he bore them as the nurse does the sucking child, nourished them, and suffered their manners. All who are grown up, ought often to reflect upon the goodness of God to them in their childhood. He took care of them, took pains with them, not only as a father, or a tutor, but as a mother, or nurse. When they were in the wilderness, God showed them the way in which they should go, and bore them up, taking them by the arms. He taught them the way of his commandments by the ceremonial law given by Moses. He took them by the arms, to guide them, that they might not stray, and to hold them up, that they might not stumble and fall. God's spiritual Israel are all thus supported. It is God's work to draw poor souls to himself; and none can come to him except he draw them. With bands of love; this word signifies stronger cords than the former. He eased them of the burdens they had long groaned under. Israel is very ungrateful to God. God's counsels would have saved them, but their own counsels ruined them. They backslide; there is no hold of them, no stedfastness in them. They backslide from me, from God, the chief good. They are bent to backslide; they are ready to sin; they are forward to close with every temptation. Their hearts are fully set in them to do evil. Those only are truly happy, whom the Lord teaches by his Spirit, upholds by his power, and causes to walk in his ways. By his grace he takes away the love and dominion of sin, and creates a desire for the blessed feast of the gospel, that they may feed thereon, and live for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I drew them with the cords of a man - o: \"Wanton heifers such as was Israel, are drawn with ropes; but although Ephraim struggled against Me, I would not draw him as a beast, but I drew him as a man, (not a servant, but a son) with cords of love.\" \"Love is the magnet of love.\" : \"The first and chief commandment of the law, is not of fear, but of love, because He willeth those whom He commandeth, to be sons rather than servants.\" : \"Our Lord saith, 'No man cometh unto Me, except the father who hath sent me, draw him.' He did not say, lead 'him,' but 'draw him.' This violence is done to the heart, not to the body. Why marvel? Believe and thou comest; love and thou art drawn. Think it not a rough and uneasy violence: it is sweet, alluring; the sweetness draws thee. Is not a hungry sheep drawn, when the grass is shewn it? It is not, I ween, driven on in body, but is bound tight by longing. So do thou too come to Christ. Do not conceive of long journeyings. When thou believest, then thou comest. For to Him who is everywhere, people come by loving, not by traveling.\" So the Bride saith, \"draw me and I will run after Thee\" Sol 1:4. \"How sweet,\" says Augustine, when converted, \"did it at once become to me, to want the sweetnesses of those toys; and what I feared to be parted from, was now a joy to part with. For Thou didst cast them forth from me, Thou true and highest Sweetness. Thou castedst them forth, and for them enteredst in Thyself, sweeter than all pleasure, though not to flesh and blood; brighter than all light, but more hidden than all depths; higher than all honor, but not to the high in their own conceits\" .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": ": \"Christ \"drew\" us also \"with the cords of a man,\" when for us He became Man, our flesh, our Brother, in order that by teaching, suffering, dying for us, He might in a wondrous way bind and draw us to Himself and to God; that He might redeem the earthly Adam, might transform and make him heavenly;\" : \"giving us ineffable tokens of His love. For He giveth Himself to us for our Food; He giveth us sacraments; by Baptism and repentance He conformeth us anew to original righteousness. Hence, He saith, \"I, if I be lifted up from the earth, shall draw all men unto me\" John 12:32; and Paul, \"I live by the faith of the Son of God, who loved me and gave Himself for me\" Galatians 2:20. This most loving drawing, our dullness and weakness needoth, who ever, without grace, grovel amidst vile and earthly things.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ": \"Christ \"drew\" us also \"with the cords of a man,\" when for us He became Man, our flesh, our Brother, in order that by teaching, suffering, dying for us, He might in a wondrous way bind and draw us to Himself and to God; that He might redeem the earthly Adam, might transform and make him heavenly;\" : \"giving us ineffable tokens of His love. For He giveth Himself to us for our Food; He giveth us sacraments; by Baptism and repentance He conformeth us anew to original righteousness. Hence, He saith, \"I, if I be lifted up from the earth, shall draw all men unto me\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Paul, \"I live by the faith of the Son of God, who loved me and gave Himself for me\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This most loving drawing, our dullness and weakness needoth, who ever, without grace, grovel amidst vile and earthly things.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"All the methods and parts of God's government are twined together, as so many twisted cords of love from Him, so ordered, that they ought to draw man with all his heart to love Him again.\" : \"Man, the image of the Mind of God, is impelled to zeal for the service of God, not by fear, but by love. No band is mightier, nor constrains more firmly all the feelings of the mind. For it holdeth not the body enchained, while the mind revolteth and longeth to break away, but it so bindeth to itself the mind and will, that it should will, long for, compass, nought beside, save how, even amid threats of death, to obey the commands of God. Bands they are, but bands so gentle and so passing sweet, that we must account them perfect freedom and the highest dignity.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I was to them as they that take off - (literally, \"that lift up\") the yoke on their jaws, and I laid meat unto them Thus explained, the words carry on the description of God's goodness, that He allowed not the yoke of slavery to weigh heavy upon them, as He saith, \"I am the Lord your God, Which brought you out of the land of Egypt, that ye should not be their bondmen, and I have broken the bands of your yoke, and made you go upright\" Leviticus 26:13; and God appealeth to them, \"Wherein have I wearied thee? testify against Me\" Micah 6:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I was to them as they that take off - (literally, \"that lift up\") the yoke on their jaws, and I laid meat unto them Thus explained, the words carry on the description of God's goodness, that He allowed not the yoke of slavery to weigh heavy upon them, as He saith, \"I am the Lord your God, Which brought you out of the land of Egypt, that ye should not be their bondmen, and I have broken the bands of your yoke, and made you go upright\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and God appealeth to them, \"Wherein have I wearied thee? testify against Me\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But the words seem more naturally to mean, \"I was to them,\" in their sight, I was regarded by them, \"as they that lift up the yoke on their jaws,\" i. e., that raise the yoke, (not being already upon them) to place it \"over their jaws.\" \"For plainly the yoke never rests on the jaws, but only passed over them, either when put on the neck, or taken off.\" This, God seemed to them to be doing, ever placing some new yoke or constraint upon them. \"And I, God\" adds, all the while \"was placing meat before them;\" i. e., while God was taking all manner of care of them, and providing for them \"all things richly to enjoy,\" He was regarded by them as one who, instead of \"laying food before them, was lifting the yoke over their jaws.\" God did them all good, and they thought it all hardship. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the words seem more naturally to mean, \"I was to them,\" in their sight, I was regarded by them, \"as they that lift up the yoke on their jaws,\" i. e., that raise the yoke, (not being already upon them) to place it \"over their jaws.\" \"For plainly the yoke never rests on the jaws, but only passed over them, either when put on the neck, or taken off.\" This, God seemed to them to be doing, ever placing some new yoke or constraint upon them. \"And I, God\" adds, all the while \"was placing meat before them;\" i. e., while God was taking all manner of care of them, and providing for them \"all things richly to enjoy,\" He was regarded by them as one who, instead of \"laying food before them, was lifting the yoke over their jaws.\" God did them all good, and they thought it all hardship. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. cords of a man—parallel to \"bands of love\"; not such cords as oxen are led by, but humane methods, such as men employ when inducing others, as for instance, a father drawing his child, by leading-strings, teaching him to go (Ho 11:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I was … as they that take off the yoke on their jaws … I laid meat—as the humane husbandman occasionally loosens the straps under the jaws by which the yoke is bound on the neck of oxen and lays food before them to eat. An appropriate image of God's deliverance of Israel from the Egyptian yoke, and of His feeding them in the wilderness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I drew them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I found them backward and unapt to lead, I therefore in my pity laid my hand on them, and, as a father or friend, drew them gently to me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With cords of a man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. with such obliging kindness as best fits and most prevails with a man, with reason. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With bands of love; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those arguments of love, which might, as strong bands, hold them fast to my law and worship for their good. I used all manner of kindnesses towards them to fix them in good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I was to them as they that take off the yoke on their jaws; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a careful husbandman doth in due season take the yoke from his labouring oxen, and takes off the muzzle with which they were kept from eating when at work, gives them time of rest and feeding: so did God with Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I laid meat unto them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " brought them provision in their wants, as the careful husbandman brings fodder and provender for his wearied labouring oxen, by which plain simile God doth inform Israel in Hosea’s time what ancient, tender, constant, and vigilant love he had showed to Israel, to their predecessors, and to them also, and hereby discovers their unheard-of ingratitude and wickedness, which began in their fathers, and hath continued with increase to the days of their final ruin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I drew them with cords of a man, with bands of love,.... As Ephraim is compared to a heifer in the preceding chapter, here he is said to be drawn; but not with such cords and bands as cattle are, but with such as men are; in a rational and gentle way, in a kind, loving, tender, humane, friendly, and fatherly way and manner; so the Lord drew Israel on in the wilderness, till he was brought to Canaan's land, by bestowing kind favours upon them, and by making precious promises to them. So the Lord deals with his spiritual Israel; he draws them out of the present state and circumstances, in which they are by nature, to himself, and to his Son, and to follow after him, and run in the ways of his commandments; and which he does not by force and compulsion against their wills, nor by mere moral persuasion, but by the invincible power of his grace, sweetly working upon them, and attracting them; he does it by revealing Christ in them, in the glories of his person and in the riches of his grace, and by letting in his love into their hearts; and by kind invitations, precious promises, and divine teachings, attended with his powerful and efficacious grace; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I was to them as they that take off the yoke on their jaws; as one that is merciful to his beast; as a kind and humane husbandman, when his cattle have been hard at work, takes off their bridles or muzzles, or the yokes on them, fastened with a halter about their jaws, that they may have liberty to feed on food set before them, as the next clause shows. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"my word was to them as a good husbandman, who lightens the shoulder of oxen, and looses \"the bridles\" on their jaws.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This may refer to Israel's deliverance from their bondage in Egypt; and be spiritually applied to Christ, the essential Word of God, breaking and taking the yoke of sin, Satan, and the law from off his people, and bringing them into the liberty of the children of God. Schmidt reads and interprets the words quite otherwise, \"and I was to them as they that lift up the yoke upon their jaws\"; not remove it from them but put it on them; expressing their ignorance and ingratitude, who, when the Lord drew them in the kind and loving manner he did, reckoned it as if he put a yoke upon them, and treated them rather as beasts than men; but this seems not to agree with what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I laid meat unto them: or declined, or brought it down to them, to their very mouths; referring to the manna and quails he rained about their tents. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and, even when they were in the wilderness, I multiplied to them good things to eat.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thus in a spiritual sense the Lord gives meat to them that fear him, while in the wilderness of this world; he brings it near, and sets it before them, in the ministry of the word and ordinances; even that meat which endures to everlasting life, the flesh of Christ, which is meat indeed; and the doctrines of the Gospel, which are milk for babes, and strong meat for more experienced saints. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And thus in a spiritual sense the Lord gives meat to them that fear him, while in the wilderness of this world; he brings it near, and sets it before them, in the ministry of the word and ordinances; even that meat which endures to everlasting life, the flesh of Christ, which is meat indeed; and the doctrines of the Gospel, which are milk for babes, and strong meat for more experienced saints. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I drew them with cords {c} of a man, with bands of love: and I was to them as they that take off the yoke on their jaws, and I laid meat unto them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I drew them with cords ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of a man, with bands of love: and I was to them as they that take off the yoke on their jaws, and I laid meat unto them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) That is, friendly, and not as beasts or slaves.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I drew them with cords of a man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] A new image suggested by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and descriptive of the fatherly love of God. Not with the violence suited to an unruly heifer, but with the ‘cords of men’ (i. e. such as men can bear), did Jehovah win his people’s obedience. But the expression is strange.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that take off the yoke on their jaws",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that lift up the yoke over their cheeks.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jehovah compares himself to a considerate master, who raises the yoke from the neck and cheeks of the animal, that it may eat its food more conveniently.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and I laid meat unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This version however is impossible. As the text stands, we can only render, either (altering one vowel-point), ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and I bent towards him and gave him food",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and (dealing) gently with him I gave him food.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not of course to be interpreted literally; the figure beautifully describes the tender indulgence of Jehovah to his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I drew them with cords of a man, with bands of love.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This verse contains a further representation of Jehovah's fatherly guidance of Israel. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "cords of a man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are such as parents use in leading weak or young children. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Bands of lore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " qualify more closely the preceding expression, \"cords of a man,\" and are the opposite of those which men employ in taming or breaking wild and unmanageable animals. The explanation of Rashi is similar: \"I have always led them with tender cords such as these with which a man leads his child, as if he said with loving guidance.\" Aben Ezra and Kimchi, in their explanations, carry out more fully the same idea. The former says, \"The bands of love are not like the bands which are fastened on the neck of a plowing heifer;\" the latter, \"Because he compared Ephraim to a heifer, and people lead a heifer with cords, he says, 'I have led Israel by the cords of a man, and not the cords of a heifer which one drags along with resistance, but as a man draws his fellow-man without compelling him to go with resistance: even so I have led them after a gentle method;' and therefore he afterward calls them (cords of a man) bands of love.\" The LXX., taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "חֶבֶל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "חָבַל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the sense of\" injure,\" \"destroy,\" have the mistaken rendering ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν διαφθορᾶ ἀνθρώτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "... ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐξέτεινα αὐτοὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"When men were destroyed I drew them.\" The other Greek versions have the correct rendering. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I was to them as they that take off the yoke.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "herim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not mean \"to lift up on\" and so \"impose a yoke,\" as some think, nor \"to take away the yoke,\" but \"to lift it up.\" The figure is that of a humane and compassionate husbandman raising upwards or pushing backwards the yoke over the cheeks or dewlaps of the ox, that it may not press too heavily upon him or hinder him while eating. The reference is, according to Kimchi, to \"taking the yoke off the neck, and letting it hang on the jaw, that it may not pull but rest from labor one or more hours of the day.\" The fact thus figuratively expressed is, not the deliverance from the bondage of Egypt, but the loving-kindness of Jehovah in lightening the fulfillment of the Law to Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The LXX. omit the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עֹל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", yoke, and strangely translates the clause, \"I will be to them as a man smiting (another) on the cheeks.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I laid meat unto them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The older and many modern interpreters, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "וְאַט",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the first person future apoc., Hiph., from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נטח",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", translate, \"And I reached them food to eat,\" namely, the manna in the wilderness. This would require ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "וָאַט",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which some substitute for the present reading. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ewald, Keil, and others take ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אט",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as an adverb in the sense of\" gradually,\" \"gently,\" translating, \"And gently towards him did I give him feral,\" or \"I gently fed him.\" Some, again, as Kimchi, take ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אוכיל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a noun, after the form of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אופיר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and others ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " take it to be an anomalous form for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אַאַכִיל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the first person future Hiph., like ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אובִיר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אַאֲבִיד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 46:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In this clause also the Septuagint, probably reading as follows: ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "וֵאַט אֵלָיו אוּכַל לו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", translates, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἐπιβλέψομαι πρὸς αὐτὸν δυνήσομαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"I will have respect to him; I will prevail with him.\" Continuing the several clauses of this verse, we may express the meaning of the whole as follows: \"Cords of a man\" denote humane methods which Jehovah employed in dealing with and drawing his people - not such cords as oxen or other animals are drawn by; while \"bands of love\" is a kindred expression, explaining and emphasizing the former, and signifying such leading-strings as those with which a parent lovingly guides his child. The means employed by God for the help, encouragement, and support of his people were kind as they were bountiful. His benevolent and beneficent modes of procedure are further exhibited by another figure of like origin; for just as a considerate and compassionate man, a humane husbandman, gives respite and relief to the oxen at work by loosening the yoke and lifting it up off the neck upon the cheeks; and thus affords not only temporary rest and ease, but also allows an occasional mouthful or more of food, or even abundant provender, to the animal which toils in the yoke while plowing or at other work; so Jehovah extended to Israel, notwithstanding their frequent acts of unfaithfulness, his sparing mercy and tender compassions, supplying them in abundant measure with all that they needed for the sustenance and even comforts of life. Thus their sin in turning aside to other gods, which were no gods, in quest of larger benefits and more liberal support and succor, was all the more inexcusable. The next three verses (5-7) describe the severe chastisement Israel incurred by ingratitude for, and contempt of, the Divine love. Hosea 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nevertheless the Lord continued to show love to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And I, I have taught Ephraim to walk: He took them in His arms, and they did not know that I healed them. I drew them with bands of a man, with cords of love, and became to them like a lifter up of the yoke upon their jaws, and gently towards him did I give (him) food.\" תּרגּלתּי, a hiphil, formed after the Aramaean fashion (cf. Ges. 55, 5), by hardening the ה into ת, and construed with ל, as the hiphil frequently is (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a denom. of רגל, to teach to walk, to guide in leading-strings, like a child that is being trained to walk. It is a figurative representation of paternal care foz a child's prosperity. קחם, per aphaeresin, for לקחם, like קח for לקח in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sudden change from the first person to the third seems very strange to our ears; but it is not uncommon in Hebrew, and is to be accounted for here from the fact, that the prophet could very easily pass from speaking in the name of God to speaking of God Himself. קח cannot be either an infinitive or a participle, on account of the following word זרועתיו, his arms. The two clauses refer chiefly to the care and help afforded by the Lord to His people in the Arabian desert; and the prophet had ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " floating before his mind: \"in the wilderness the Lord thy God bare thee, as a man doth bear his son.\" The last clause also refers to this, רפאתים pointing back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Lord showed Himself as the physician of Israel, by making the bitter water at Marah drinkable, and at the same time as their helper out of every trouble. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", again, there is a still further reference to the manifestation of the love of God to Israel on the journey through the wilderness. חבלי אדם, cords with which men are led, more especially children that are weak upon their feet, in contrast with ropes, with which men control wild, unmanageable beasts (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), are a figurative representation of the paternal, human guidance of Israel, as explained in the next figure, \"cords of love.\" This figure leads on to the kindred figure of the yoke laid upon beasts, to harness them for work. As merciful masters lift up the yoke upon the cheeks of their oxen, i.e., push it so far back that the animals can eat their food in comfort, so has the Lord made the yoke of the law, which has been laid upon His people, both soft and light. As הרים על על does not mean to take the yoke away from (מעל) the cheeks, but to lift it above the cheeks, i.e., to make it easier, by pushing it back, we cannot refer the words to the liberation of Israel from the bondage of Egypt, but can only think of what the Lord did, to make it easy for the people to observe the commandments imposed upon them, when they were received into His covenant (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), including not only the many manifestations of mercy which might and ought to have allured them to reciprocate His love, and yield a willing obedience to His commandments, but also the means of grace provided in their worship, partly in the institution of sacrifice, by which a way of approach was opened to divine grace to obtain forgiveness of sin, and partly in the institution of feasts, at which they could rejoice in the gracious gifts of their God. ואט is not the first pers. imperf. hiphil of נטה (\"I inclined myself to him;\" Symm., Syr., and others), in which case we should expect ואט, but an adverb, softly, comfortably; and אליו belongs to it, after the analogy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". אוכיל is an anomalous formation for אאכיל, like אוביד for אאביד in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 46:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Ewald, 192, d; Ges. 68, 2, Anm. 1). Jerome has given the meaning quite correctly: \"and I gave them manna for food in the desert, which they enjoyed.\" ",
        "children": []
      }
    ]
  }
]