[{"header":"Resurrection Morning"},{"num":28,"verse":"After the Sabbath, as the first day of the week was dawning, Mary Magdalene and the other Mary went to view the tomb. "},{"num":2,"verse":"There was a violent earthquake, because an angel of the Lord descended from heaven and approached the tomb. He rolled back the stone and was sitting on it. "},{"num":3,"verse":"His appearance was like lightning, and his clothing was as white as snow. "},{"num":4,"verse":"The guards were so shaken by fear of him that they became like dead men."},{"num":5,"verse":"The angel told the women, “Don’t be afraid, because I know you are looking for Jesus who was crucified. "},{"num":6,"verse":"He is not here. For he has risen, just as he said. Come and see the place where he lay. "},{"num":7,"verse":"Then go quickly and tell his disciples, ‘He has risen from the dead and indeed he is going ahead of you to Galilee; you will see him there.’ Listen, I have told you.”"},{"num":8,"verse":"So, departing quickly from the tomb with fear and great joy, they ran to tell his disciples the news. "},{"num":9,"verse":"Just then Jesus met them and said, “Greetings!” They came up, took hold of his feet, and worshiped him. "},{"num":10,"verse":"Then Jesus told them, “Do not be afraid. Go and tell my brothers to leave for Galilee, and they will see me there.”"},{"header":"The Soldiers Bribed to Lie"},{"num":11,"verse":"As they were on their way, some of the guards came into the city and reported to the chief priests everything that had happened. "},{"num":12,"verse":"After the priests had assembled with the elders and agreed on a plan, they gave the soldiers a large sum of money "},{"num":13,"verse":"and told them, “Say this, ‘His disciples came during the night and stole him while we were sleeping.’ "},{"num":14,"verse":"If this reaches the governor’s ears, we will deal with him and keep you out of trouble.” "},{"num":15,"verse":"They took the money and did as they were instructed, and this story has been spread among Jewish people to this day."},{"header":"The Great Commission"},{"num":16,"verse":"The eleven disciples traveled to Galilee, to the mountain where Jesus had directed them. "},{"num":17,"verse":"When they saw him, they worshiped, but some doubted. "},{"num":18,"verse":"Jesus came near and said to them, “All authority has been given to me in heaven and on earth. "},{"num":19,"verse":"Go, therefore, and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, "},{"num":20,"verse":"teaching them to observe everything I have commanded you. And remember, I am with you always, to the end of the age.”"}]