[{"num":28,"verse":"1 The women go to the sepulcher. 2 The Angel. 9 The women see Christ. 18 He sendeth his Apostles to preach."},{"num":1,"verse":"Now in the end of the Sabbath, when the first day of the week began to dawn, Mary Magdalene, and the other Mary, came to see the sepulcher."},{"num":2,"verse":"And behold, there was a great earthquake: for the Angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it."},{"num":3,"verse":"And his countenance was like lightning, and his raiment white as snow."},{"num":4,"verse":"And for fear of him, the keepers were astonied, and became as dead men."},{"num":5,"verse":"But the Angel answered, and said to the women, Fear ye not: for I know that ye seek Jesus which was crucified:"},{"num":6,"verse":"He is not here, for he is risen, as he said: come, see the place where the Lord was laid,"},{"num":7,"verse":"And go quickly, and tell his disciples that he is risen from the dead: and behold, he goeth before you into Galilee: there ye shall see him: lo, I have told you."},{"num":8,"verse":"So they departed quickly from the sepulcher, with fear and great joy, and did run to bring his disciples word."},{"num":9,"verse":"And as they went to tell his disciples, behold, Jesus also met them, saying, God save you. And they came, and took him by the feet, and worshipped him."},{"num":10,"verse":"Then said Jesus unto them, Be not afraid. Go, and tell my brethren, that they go into Galilee, and there shall they see me. "},{"num":11,"verse":"¶ Now when they were gone, behold, some of the watch came into the city, and showed unto the high Priests all the things that were done."},{"num":12,"verse":"And they gathered them together with the Elders, and took counsel, and gave large money unto the soldiers,"},{"num":13,"verse":"Saying, Say, His disciples came by night, and stole him away while we slept."},{"num":14,"verse":"And if this matter come before the governor to be heard, we will persuade him, and so use the matter that you shall not need to care,"},{"num":15,"verse":"So they took the money, and did as they were taught: and this saying is noised among the Jews unto this day."},{"num":16,"verse":"¶ Then the eleven disciples went into Galilee, into a mountain, where Jesus had appointed them."},{"num":17,"verse":"And when they saw him, they worshipped him: but some doubted."},{"num":18,"verse":"And Jesus came, and spake unto them, saying, All power is given unto me, in heaven, and in earth. "},{"num":19,"verse":"Go therefore, and teach all nations, baptizing them in the Name of the Father, and the Son, and the holy Ghost, "},{"num":20,"verse":"Teaching them to observe all things, whatsoever I have commanded you: and lo, I am with you alway, until the end of the world, Amen."}]