[{"header":"Jesus Rises From the Dead"},{"num":28,"verse":"The Sabbath day was now over. It was dawn on the first day of the week. Mary Magdalene and the other Mary went to look at the tomb."},{"num":2,"verse":"There was a powerful earthquake. An angel of the Lord came down from heaven. The angel went to the tomb. He rolled back the stone and sat on it. "},{"num":3,"verse":"His body shone like lightning. His clothes were as white as snow. "},{"num":4,"verse":"The guards were so afraid of him that they shook and became like dead men."},{"num":5,"verse":"The angel said to the women, “Don’t be afraid. I know that you are looking for Jesus, who was crucified. "},{"num":6,"verse":"He is not here! He has risen, just as he said he would! Come and see the place where he was lying. "},{"num":7,"verse":"Go quickly! Tell his disciples, ‘He has risen from the dead. He is going ahead of you into Galilee. There you will see him.’ Now I have told you.”"},{"num":8,"verse":"So the women hurried away from the tomb. They were afraid, but they were filled with joy. They ran to tell the disciples. "},{"num":9,"verse":"Suddenly Jesus met them. “Greetings!” he said. They came to him, took hold of his feet and worshiped him. "},{"num":10,"verse":"Then Jesus said to them, “Don’t be afraid. Go and tell my brothers to go to Galilee. There they will see me.”"},{"header":"The Guards Report to the Chief Priests"},{"num":11,"verse":"While the women were on their way, some of the guards went into the city. They reported to the chief priests all that had happened. "},{"num":12,"verse":"When the chief priests met with the elders, they came up with a plan. They gave the soldiers a large amount of money. "},{"num":13,"verse":"They told the soldiers, “We want you to say, ‘His disciples came during the night. They stole his body while we were sleeping.’ "},{"num":14,"verse":"If the governor hears this report, we will pay him off. That will keep you out of trouble.” "},{"num":15,"verse":"So the soldiers took the money and did as they were told. This story has spread all around among the Jews to this day."},{"header":"Jesus’ Final Orders to His Disciples"},{"num":16,"verse":"Then the 11 disciples went to Galilee. They went to the mountain where Jesus had told them to go. "},{"num":17,"verse":"When they saw him, they worshiped him. But some still had their doubts. "},{"num":18,"verse":"Then Jesus came to them. He said, “All authority in heaven and on earth has been given to me. "},{"num":19,"verse":"So you must go and make disciples of all nations. Baptize them in the name of the Father and of the Son and of the Holy Spirit. "},{"num":20,"verse":"Teach them to obey everything I have commanded you. And you can be sure that I am always with you, to the very end.”"}]