[{"header":"The Resurrection"},{"num":28,"verse":"Early on Sunday morning, as the new day was dawning, Mary Magdalene and the other Mary went out to visit the tomb."},{"num":2,"verse":"Suddenly there was a great earthquake! For an angel of the Lord came down from heaven, rolled aside the stone, and sat on it."},{"num":3,"verse":"His face shone like lightning, and his clothing was as white as snow."},{"num":4,"verse":"The guards shook with fear when they saw him, and they fell into a dead faint."},{"num":5,"verse":"Then the angel spoke to the women. “Don’t be afraid!” he said. “I know you are looking for Jesus, who was crucified."},{"num":6,"verse":"He isn’t here! He is risen from the dead, just as he said would happen. Come, see where his body was lying."},{"num":7,"verse":"And now, go quickly and tell his disciples that he has risen from the dead, and he is going ahead of you to Galilee. You will see him there. Remember what I have told you.”"},{"num":8,"verse":"The women ran quickly from the tomb. They were very frightened but also filled with great joy, and they rushed to give the disciples the angel’s message."},{"num":9,"verse":"And as they went, Jesus met them and greeted them. And they ran to him, grasped his feet, and worshiped him."},{"num":10,"verse":"Then Jesus said to them, “Don’t be afraid! Go tell my brothers to leave for Galilee, and they will see me there.”"},{"header":"The Report of the Guard"},{"num":11,"verse":"As the women were on their way, some of the guards went into the city and told the leading priests what had happened."},{"num":12,"verse":"A meeting with the elders was called, and they decided to give the soldiers a large bribe."},{"num":13,"verse":"They told the soldiers, “You must say, ‘Jesus’ disciples came during the night while we were sleeping, and they stole his body.’"},{"num":14,"verse":"If the governor hears about it, we’ll stand up for you so you won’t get in trouble.”"},{"num":15,"verse":"So the guards accepted the bribe and said what they were told to say. Their story spread widely among the Jews, and they still tell it today."},{"header":"The Great Commission"},{"num":16,"verse":"Then the eleven disciples left for Galilee, going to the mountain where Jesus had told them to go."},{"num":17,"verse":"When they saw him, they worshiped him—but some of them doubted!"},{"num":18,"verse":"Jesus came and told his disciples, “I have been given all authority in heaven and on earth."},{"num":19,"verse":"Therefore, go and make disciples of all the nations, baptizing them in the name of the Father and the Son and the Holy Spirit."},{"num":20,"verse":"Teach these new disciples to obey all the commands I have given you. And be sure of this: I am with you always, even to the end of the age.”"}]