[{"num":28,"verse":"Now after Shabbos, at the time of Shacharis on Yom Rishon (the first day of the week), Miryam of Magdala and the other Miryam came to look at the kever."},{"num":2,"verse":"And hinei! a great earthquake had occurred, for a malach Adonoi (an angel of Hashem) descended from Shomayim and came and rolled away the stone and sat upon it."},{"num":3,"verse":"And his appearance was like lightning and his garment as white as snow."},{"num":4,"verse":"And the shomrim (guards) shook for fear of him and became like dead men."},{"num":5,"verse":"And the malach, in reply, said to the nashim, Do not be afraid, for I know that you are seeking Yehoshua, who has been hanged on HaEtz."},{"num":6,"verse":"He is not here. To him has come the Techiyas HaMesim, just as he said. Come, see the place where HaAdon was lying."},{"num":7,"verse":"And go quickly, tell his talmidim about the Techiyas HaMoshiach from HaMesim. And, hinei! He is going ahead of you into the Galil. There you will see him. Hinei! I have told you!"},{"num":8,"verse":"And they departed quickly from the kever with fear and great simcha and ran to report everything to Moshiach’s talmidim."},{"num":9,"verse":"And hinei! Moshiach met them, saying Shalom Aleichem. And they came up and took hold of his feet and fell prostrate before him."},{"num":10,"verse":"Then he said to them, Do not be afraid; go and take word to my Achim that they may go away to the Galil, and there they shall see me."},{"num":11,"verse":"Now while they were on their way, hinei! Some of the shomrim came into the city and reported to the Rashei Hakohanim all the things that had happened."},{"num":12,"verse":"And when they had assembled with the Zekenim and counseled together, they gave a large sum of money to the soldiers,"},{"num":13,"verse":"And said, You are to say, His talmidim came by night and stole him away while we were asleep."},{"num":14,"verse":"And if this should come to the Governor’s ears, we will win him over and keep you out of trouble."},{"num":15,"verse":"And the ones who took the kesef did as they had been instructed and this story was widely spread among the Yehudim to this day."},{"num":16,"verse":"But the Achad Asar Talmidim proceeded to the Galil, to the mountain which Rebbe, Melech HaMoshiach had designated."},{"num":17,"verse":"And when they saw him, they prostrated themselves before him, but some were doubtful."},{"num":18,"verse":"And he came up and spoke to them, saying, All samchut (authority) has been given to me in Shomayim and on HaAretz."},{"num":19,"verse":"Go, therefore, make talmidim for Rebbe, Melech HaMoshiach of all the nations, giving them a tevilah in a mikveh mayim in Hashem, in the Name of HaAv, and HaBen, and HaRuach Hakodesh,"},{"num":20,"verse":"Teaching them to observe all that I have commanded you. And hinei! I [Moshiach] am with you always, even unto the Ketz HaOlam Hazeh."}]