[{"num":28,"verse":"After the Sabbath, as the light of the next day, the first day of the week, crept over Palestine, Mary Magdalene and the other Mary came to the tomb to keep vigil. "},{"num":2,"verse":"Earlier there had been an earthquake. A messenger of the Lord had come down from heaven and had gone to the grave. He rolled away the stone and sat down on top of it. "},{"num":3,"verse":"He veritably glowed. He was vibrating with light. His clothes were light, white like transfiguration, like fresh snow. "},{"num":4,"verse":"The soldiers guarding the tomb were terrified. They froze like stone."},{"num":5,"verse":"The messenger spoke to the women, to Mary Magdalene and the other Mary."},{"num":8,"verse":"The women were both terrified and thrilled, and they quickly left the tomb and went to find the disciples and give them this outstandingly good news. "},{"num":9,"verse":"But while they were on their way, they saw Jesus Himself."},{"num":11,"verse":"As the women were making their way to the disciples, some of the soldiers who had been standing guard by Jesus’ tomb recovered themselves, went to the city, and told the chief priests everything that had happened—the earthquake just after dawn, the heavenly messenger, and his commission to the Marys. "},{"num":12,"verse":"The chief priests gathered together all the elders, an emergency conference of sorts. They needed a plan. They decided the simplest course was bribery: they would pay off the guards "},{"num":13,"verse":"and order them to say that the disciples had come in the middle of the night and had stolen Jesus’ corpse while they slept. "},{"num":14,"verse":"The chief priests promised the soldiers they would run interference with the governor so that the soldiers wouldn’t be punished for falling asleep when they were supposed to be keeping watch. "},{"num":15,"verse":"The guards took the bribe and spread the story around town—and indeed, you can still find people today who will tell you that Jesus did not really rise from the dead, that it was a trick, some sort of sleight of hand."},{"num":16,"verse":"The eleven disciples, having spoken to the Marys, headed to Galilee, to the mountain where they were to meet Jesus. "},{"num":17,"verse":"When the disciples saw Jesus there, many of them fell down and worshiped, as Mary and the other Mary had done. But a few hung back. They were not sure (and who can blame them?). "},{"num":18,"verse":"Jesus came forward and addressed His beloved disciples."}]