[{"header":"Egypt Will Be Punished"},{"num":30,"verse":"The Lord spoke his word to me. He said, "},{"num":2,"verse":"“Human being, prophesy and say, ‘This is what the Lord God says:"},{"num":5,"verse":"Cush, Put, Lydia, Arabia, Libya and my people will die. All these who made an agreement with Egypt will fall dead in war."},{"num":6,"verse":"“‘This is what the Lord God says:"},{"num":9,"verse":"“‘At that time I will send messengers in ships. They will frighten Cush which now feels safe. The people of Cush will tremble with fear when Egypt is punished. And that time is sure to come."},{"num":10,"verse":"“‘This is what the Lord God says:"},{"header":"Egypt’s Idols Are Destroyed"},{"num":13,"verse":"“‘This is what the Lord God says:"},{"header":"Egypt Becomes Weak"},{"num":20,"verse":"It happened in the eleventh year of our captivity, in the first month. It was on the seventh day of the month. The Lord spoke his word to me. He said: "},{"num":21,"verse":"“Human being, I have broken the powerful arm of the king of Egypt. It has not been tied up so it will not get well. It has not been wrapped with a bandage. So his arm will not be strong enough to hold a sword in war. "},{"num":22,"verse":"So this is what the Lord God says: I am against the king of Egypt. I will break his arms. I will break both the strong arm and the broken arm. I will make the sword fall from his hand. "},{"num":23,"verse":"I will scatter the Egyptians among the nations. And I will spread them among the countries. "},{"num":24,"verse":"I will make the arms of the king of Babylon strong. I will put my sword in his hand. But I will break the arms of the king of Egypt. Then he will cry out in pain as a wounded man cries out. "},{"num":25,"verse":"So I will make the arms of the king of Babylon strong. But the arms of the king of Egypt will fall. Then they will know that I am the Lord. I will put my sword into the hand of the king of Babylon. And he will use the sword in war against Egypt. "},{"num":26,"verse":"Then I will scatter the Egyptians among the nations. And I will spread them among the countries. And they will know that I am the Lord.”"}]