[{"num":30,"verse":"Another message from the Lord!"},{"num":2,"verse":"“Son of dust, prophesy and say: The Lord God says, ‘Weep, for the terrible day is almost here; the day of the Lord; a day of clouds and gloom; a day of despair for the nations! "},{"num":4,"verse":"A sword shall fall on Egypt; the slain shall cover the ground. Her wealth is taken away, her foundations destroyed. The land of Cush has been ravished. "},{"num":5,"verse":"For Cush, Put, Lud, Arabia, and Libya, and all the countries leagued with them shall perish in that war.’”"},{"num":6,"verse":"For the Lord says: “All Egypt’s allies shall fall, and the pride of her power shall end. From Migdol to Syene they shall perish by the sword. "},{"num":7,"verse":"She shall be desolate, surrounded by desolate nations, and her cities shall be in ruins, surrounded by other ruined cities. "},{"num":8,"verse":"And they will know I am the Lord when I have set Egypt on fire and destroyed her allies. "},{"num":9,"verse":"At that time I will send swift messengers to bring panic to the Ethiopians; great terror shall befall them at that time of Egypt’s doom. This will all come true.”"},{"num":10,"verse":"For the Lord God says: “Nebuchadnezzar, king of Babylon, will destroy the multitudes of Egypt. "},{"num":11,"verse":"He and his armies—the terror of the nations—are sent to demolish the land. They shall war against Egypt and cover the ground with the slain. "},{"num":12,"verse":"I will dry up the Nile and sell the whole land to wicked men. I will destroy Egypt and everything in it, using foreigners to do it. I, the Lord, have spoken it."},{"num":13,"verse":"“And I will smash the idols of Egypt and the images at Memphis, and there will be no king in Egypt; anarchy shall reign!"},{"num":14,"verse":"“The cities of Pathros along the upper Nile, Zoan, and Thebes shall lie in ruins by my hand. "},{"num":15,"verse":"And I will pour out my fury upon Pelusium, the strongest fortress of Egypt, and I will stamp out the people of Thebes. "},{"num":16,"verse":"Yes, I will set fire to Egypt; Pelusium will be racked with pain. Thebes will be torn apart; Memphis will be in daily terror. "},{"num":17,"verse":"The young men of Heliopolis and Bubastis shall die by the sword, and the women will be taken away as slaves. "},{"num":18,"verse":"When I come to break the power of Egypt, it will be a dark day for Tahpanhes too; a dark cloud will cover her, and her daughters will be taken away as captives. "},{"num":19,"verse":"And so I will greatly punish Egypt and they shall know I am the Lord.”"},{"num":20,"verse":"A year later, around the middle of March of the eleventh year of King Jehoiachin’s captivity,* this message came to me:"},{"num":21,"verse":"“Son of dust, I have broken the arm of Pharaoh, king of Egypt, and it has not been set nor put into a cast to make it strong enough to hold a sword again. "},{"num":22,"verse":"For the Lord God says, I am against Pharaoh, king of Egypt, and I will break both his arms—the strong one and the one that was broken before, and I will make his sword clatter to the ground. "},{"num":23,"verse":"And I will banish the Egyptians to many lands. "},{"num":24,"verse":"And I will strengthen the arms of the king of Babylon and place my sword in his hand. But I will break the arms of Pharaoh, king of Egypt, and he shall groan before the king of Babylon as one who has been wounded unto death. "},{"num":25,"verse":"I will strengthen the hands of the king of Babylon, while the arms of Pharaoh fall useless to his sides. Yes, when I place my sword into the hand of the king of Babylon, and he swings it over the land of Egypt, Egypt shall know I am the Lord. "},{"num":26,"verse":"I will scatter the Egyptians among the nations; then they shall know I am the Lord.”"}]