[{"header":"Doom of Egypt"},{"num":30,"verse":"The word of Adonai came to me saying: "},{"num":2,"verse":"“Son of man, prophesy, and say, thus says Adonai Elohim:"},{"num":5,"verse":"Ethiopia, Put and Lud, all the mixed people, Libya, and children of the covenant land will fall with them by the sword.’”"},{"num":9,"verse":"“On that day, messengers will go out from before Me in ships to frighten Ethiopians out of complacency. Anguish will come on them as on the day of Egypt—for, behold, it is coming!”"},{"num":10,"verse":"Thus says Adonai Elohim: “I will put away the pomp of Egypt by the hand of Nebuchadrezzar king of Babylon. "},{"num":11,"verse":"He and his people with him, the ruthless of the nations, will be brought in to destroy the land. They will draw their swords against Egypt and fill the land with the slain. "},{"num":12,"verse":"I will make the rivers dry. I will sell the land into the hand of evildoers. I will make the land desolate, and all that is in it, by the hand of strangers. I, Adonai, have spoken it.”"},{"num":20,"verse":"On the seventh day of the first month of the eleventh year, the word of Adonai came to me saying: "},{"num":21,"verse":"“Son of man, I have broken the arm of Pharaoh king of Egypt. Behold, it has not been bound up to be healed or put in a splint, so that it is wrapped up with a bandage, to grow strong to wield the sword.”"},{"num":22,"verse":"Therefore thus says Adonai Elohim: “I am against Pharaoh king of Egypt. I will break his arms, the strong one and the one that was broken. I will cause the sword to fall out of his hand. "},{"num":23,"verse":"I will scatter the Egyptians among the nations and disperse them throughout the countries. "},{"num":24,"verse":"I will strengthen the arms of the king of Babylon and put My sword into his hand. I will break the arms of Pharaoh, so he will groan before him like a fatally wounded man. "},{"num":25,"verse":"I will strengthen the arms of the king of Babylon, but Pharaoh’s arms will fall. So they will know that I am Adonai when I put My sword into the hand of the king of Babylon and he stretches it out against the land of Egypt. "},{"num":26,"verse":"I will scatter the Egyptians among the nations and disperse them through the countries. Then they will know that I am Adonai.”"}]