[[],[],[{"type":"prose","content":"“These are the instructions for the Compensation-Offering. It is most holy. Slaughter the Compensation-Offering in the same place that the Whole-Burnt-Offering is slaughtered. Splash its blood against all sides of the Altar. Offer up all the fat: the fat tail, the fat covering the entrails, the two kidneys and the fat encasing them at the loins, and the lobe of the liver that is removed with the kidneys. The priest burns them on the Altar as a gift to . It is a Compensation-Offering. Any male from among the priests’ families may eat it. But it must be eaten in a holy place; it is most holy."}],[{"type":"prose","content":"“The Compensation-Offering is the same as the Absolution-Offering—the same rules apply to both. The offering belongs to the priest who makes atonement with it. The priest who presents a Whole-Burnt-Offering for someone gets the hide for himself. Every Grain-Offering baked in an oven or prepared in a pan or on a griddle belongs to the priest who presents it. It’s his. Every Grain-Offering, whether dry or mixed with oil, belongs equally to all the sons of Aaron.* * *"}],[{"type":"prose","content":"“These are the instructions for the Peace-Offering which is presented to . If you bring it to offer thanksgiving, then along with the Thanksgiving-Offering present unraised loaves of bread mixed with oil, unraised wafers spread with oil, and cakes of fine flour, well-kneaded and mixed with oil. Along with the Peace-Offering of thanksgiving, present loaves of yeast bread as an offering. Bring one of each kind as an offering, a Contribution-Offering to ; it goes to the priest who throws the blood of the Peace-Offering. Eat the meat from the Peace-Offering of thanksgiving the same day it is offered. Don’t leave any of it overnight."}],[{"type":"prose","content":"“If the offering is a Votive-Offering or a Freewill-Offering, it may be eaten the same day it is sacrificed and whatever is left over on the next day may also be eaten. But any meat from the sacrifice that is left to the third day must be burned up. If any of the meat from the Peace-Offering is eaten on the third day, the person who has brought it will not be accepted. It won’t benefit him a bit—it has become defiled meat. And whoever eats it must take responsibility for his iniquity. Don’t eat meat that has touched anything ritually unclean; burn it up. Any other meat can be eaten by those who are ritually clean. But if you’re not ritually clean and eat meat from the Peace-Offering for , you will be excluded from the congregation. And if you touch anything ritually unclean, whether human or animal uncleanness or an obscene object, and go ahead and eat from a Peace-Offering for , you’ll be excluded from the congregation.”* * *"}],[{"type":"prose","content":" spoke to Moses: “Speak to the People of Israel. Tell them, Don’t eat any fat of cattle or sheep or goats. The fat of an animal found dead or torn by wild animals can be put to some other purpose, but you may not eat it. If you eat fat from an animal from which a gift has been presented to , you’ll be excluded from the congregation. And don’t eat blood, whether of birds or animals, no matter where you end up living. If you eat blood you’ll be excluded from the congregation.”* * *"}],[{"type":"prose","content":" spoke to Moses: “Speak to the People of Israel. Tell them, When you present a Peace-Offering to , bring some of your Peace-Offering as a special sacrifice to , a gift to  in your own hands. Bring the fat with the breast and then wave the breast before  as a Wave-Offering. The priest will burn the fat on the Altar; Aaron and his sons get the breast. Give the right thigh from your Peace-Offerings as a Contribution-Offering to the priest. Give a portion of the right thigh to the son of Aaron who offers the blood and fat of the Peace-Offering as his portion. From the Peace-Offerings of Israel, I’m giving the breast of the Wave-Offering and the thigh of the Contribution-Offering to Aaron the priest and his sons. This is their fixed compensation from the People of Israel.”"}],[{"type":"prose","content":"From the day they are presented to serve as priests to , Aaron and his sons can expect to receive these allotments from the gifts of . This is what  commanded the People of Israel to give the priests from the day of their anointing. This is the fixed rule down through the generations."}],[{"type":"prose","content":"These are the instructions for the Whole-Burnt-Offering, the Grain-Offering, the Absolution-Offering, the Compensation-Offering, the Ordination-Offering, and the Peace-Offering which  gave Moses at Mount Sinai on the day he commanded the People of Israel to present their offerings to  in the wilderness of Sinai."}]]