[{"header":"Chapter 7"},{"num":1,"verse":"Reparation Offerings. This is the ritual for the reparation offering. It is most holy. "},{"num":2,"verse":"At the place where the burnt offering is slaughtered, the reparation offering shall also be slaughtered. Its blood shall be splashed on all the sides of the altar. "},{"num":3,"verse":"All of its fat shall be offered: the fatty tail, the fat that covers the inner organs, and all the fat that adheres to them, "},{"num":4,"verse":"as well as the two kidneys with the fat on them near the loins, and the lobe of the liver, which is removed with the kidneys. "},{"num":5,"verse":"The priest shall burn these on the altar as an oblation to the Lord. It is a reparation offering. "},{"num":6,"verse":"Every male of the priestly line may eat of it; but it must be eaten in a sacred place. It is most holy."},{"num":7,"verse":"Because the purification offering and the reparation offering are alike, both have the same ritual. The reparation offering belongs to the priest who makes atonement with it. "},{"num":8,"verse":"As for the priest who offers someone’s burnt offering, to him belongs the hide of the burnt offering that is offered. "},{"num":9,"verse":"Also, every grain offering that is baked in an oven or made in a pan or on a griddle shall belong to the priest who offers it, "},{"num":10,"verse":"whereas all grain offerings that are mixed with oil or are dry shall belong to all of Aaron’s sons without distinction."},{"num":11,"verse":"This is the ritual for the communion sacrifice that is offered to the Lord. "},{"num":12,"verse":"If someone offers it for thanksgiving, that person shall offer it with unleavened cakes mixed with oil, unleavened wafers spread with oil, and cakes made of bran flour mixed with oil and well kneaded. "},{"num":13,"verse":"One shall present this offering together with loaves of leavened bread along with the thanksgiving communion sacrifice. "},{"num":14,"verse":"From this the individual shall offer one bread of each type of offering as a contribution to the Lord; this shall belong to the priest who splashes the blood of the communion offering."},{"num":15,"verse":"The meat of the thanksgiving communion sacrifice shall be eaten on the day it is offered; none of it may be kept till the next morning. "},{"num":16,"verse":"However, if the sacrifice offered is a votive or a voluntary offering, it shall be eaten on the day the sacrifice is offered, and on the next day what is left over may be eaten. "},{"num":17,"verse":"But what is left over of the meat of the sacrifice on the third day must be burned in the fire. "},{"num":18,"verse":"If indeed any of the flesh of the communion sacrifice is eaten on the third day, it shall not be accepted; it will not be reckoned to the credit of the one offering it. Rather it becomes a desecrated meat. Anyone who eats of it shall bear the penalty."},{"num":19,"verse":"Should the meat touch anything unclean, it may not be eaten, but shall be burned in the fire. As for other meat, all who are clean may eat of it. "},{"num":20,"verse":"If, however, someone in a state of uncleanness eats the meat of a communion sacrifice belonging to the Lord, that person shall be cut off from the people. "},{"num":21,"verse":"Likewise, if someone touches anything unclean, whether it be human uncleanness or an unclean animal or an unclean loathsome creature, and then eats the meat of the communion sacrifice belonging to the Lord, that person, too, shall be cut off from the people."},{"num":22,"verse":"Prohibition Against Blood and Fat. The Lord said to Moses: "},{"num":23,"verse":"Tell the Israelites: You shall not eat the fat of any ox or sheep or goat. "},{"num":24,"verse":"Although the fat of an animal that has died a natural death or has been killed by wild beasts may be put to any other use, you may not eat it. "},{"num":25,"verse":"If anyone eats the fat of an animal from which an oblation is made to the Lord, that person shall be cut off from the people. "},{"num":26,"verse":"Wherever you dwell, you shall not eat any blood, whether of bird or of animal. "},{"num":27,"verse":"Every person who eats any blood shall be cut off from the people."},{"num":28,"verse":"Portions from the Communion Sacrifice for Priests. The Lord said to Moses: "},{"num":29,"verse":"Tell the Israelites: The person who offers a communion sacrifice to the Lord shall be the one to bring from it the offering to the Lord. "},{"num":30,"verse":"The offerer’s own hands shall carry the oblations for the Lord: the person shall bring the fat together with the brisket, which is to be raised as an elevated offering before the Lord. "},{"num":31,"verse":"The priest shall burn the fat on the altar, but the brisket belongs to Aaron and his sons. "},{"num":32,"verse":"Moreover, from your communion sacrifices you shall give to the priest the right leg as a contribution. "},{"num":33,"verse":"The one among Aaron’s sons who offers the blood and the fat of the communion offering shall have the right leg as his portion, "},{"num":34,"verse":"for from the communion sacrifices of the Israelites I have taken the brisket that is elevated and the leg that is a contribution, and I have given them to Aaron, the priest, and to his sons as their due from the Israelites forever."},{"num":35,"verse":"This is the priestly share from the oblations for the Lord, allotted to Aaron and his sons on the day they were brought forth to be the priests of the Lord, "},{"num":36,"verse":"which the Lord ordered to be given them from the Israelites on the day they were anointed, as their due throughout their generations forever."},{"num":37,"verse":"Summary. This is the ritual for the burnt offering, the grain offering, the purification offering, the reparation offering, the ordination offering, and the communion sacrifice, "},{"num":38,"verse":"which the Lord enjoined on Moses at Mount Sinai at the time when he commanded the Israelites in the wilderness of Sinai to bring their offerings to the Lord."}]