[{"header":"Why the Lord Will Help Israel"},{"num":9,"verse":"Israel, listen to me! You will soon cross the Jordan River and go into the land to force out the nations that live there. They are more powerful than you are, and the walls around their cities reach to the sky. "},{"num":2,"verse":"Some of these nations are descendants of the Anakim. You know how tall and strong they are, and you’ve heard that no one can defeat them in battle. "},{"num":3,"verse":"But the Lord your God has promised to go ahead of you, like a raging fire burning everything in its path. So when you attack your enemies, it will be easy for you to destroy them and take their land."},{"num":4,"verse":"After the Lord helps you wipe out these nations and conquer their land, don’t think he did it because you are such good people. You aren’t good—you are stubborn! No, the Lord is going to help you, because the nations that live there are evil, and because he wants to keep the promise he made to your ancestors Abraham, Isaac, and Jacob."},{"header":"When Israel Made an Idol"},{"num":7,"verse":"Don’t ever forget how you kept rebelling and making the Lord angry the whole time you were in the desert. You rebelled from the day you left Egypt until the day you arrived here."},{"num":8,"verse":"At Mount Sinai you made the Lord so angry that he was going to destroy you. "},{"num":9,"verse":"It happened during those forty days and nights that I was on the mountain, without anything to eat or drink. He had told me to come up there so he could give me the agreement he made with us. And this agreement was actually the same Ten Commandments he had announced to you when he spoke from the fire on the mountain. The Lord had written them on two flat stones with his own hand. But after giving me the two stones, "},{"num":12,"verse":"he said:"},{"num":15,"verse":"Fire was raging on the mountaintop as I went back down, carrying the two stones with the commandments on them. "},{"num":16,"verse":"I saw how quickly you had sinned and disobeyed the Lord your God. There you were, worshiping the metal idol you had made in the shape of a calf. "},{"num":17,"verse":"So I threw down the two stones and smashed them before your very eyes."},{"num":18,"verse":"I bowed down at the place of worship and prayed to the Lord, without eating or drinking for forty days and nights. You had committed a terrible sin by making that idol, and the Lord hated what you had done. He was angry enough to destroy all of you and Aaron as well. So I prayed for you and Aaron as I had done before, and this time the Lord answered my prayers."},{"num":21,"verse":"It was a sin for you to make that idol, so I threw it into the fire to melt it down. Then I took the lump of gold, ground it into powder, and threw the powder into the stream flowing down the mountain."},{"num":22,"verse":"You also made the Lord angry when you were staying at Taberah, at Massah, and at Kibroth-Hattaavah. "},{"num":23,"verse":"Then at Kadesh-Barnea the Lord said, “I am giving you the land, so go ahead and take it!” But since you didn’t trust the Lord, you rebelled and disobeyed his command. "},{"num":24,"verse":"In fact, you’ve rebelled against the Lord for as long as he has known you."},{"num":25,"verse":"After you had made the idol in the shape of a calf, the Lord said he was going to destroy you. So I bowed down in front of the sacred tent for forty days and nights, "},{"num":26,"verse":"and I prayed:"}]