[{"header":"Everyone Born of God Believes Jesus Is His Son, Loves His People, Keeps His Commands"},{"num":5,"verse":"Everyone believing that Jesus is the Christ has been born from God. And everyone loving the One having fathered is loving also the one having been born from Him. "},{"num":2,"verse":"By this we know that we are loving the children of God: when we are loving God and doing His commandments. "},{"num":3,"verse":"For this is the love of God: that we be keeping His commandments. And His commandments are not burdensome."},{"header":"Because The One Born of God Is Victorious Over The World By Faith In Jesus"},{"num":4,"verse":"Because everything having been born from God is being-victorious-over the world. And this is the victory having been-victorious-over the world: our faith!"},{"header":"Who Indeed Is Victorious If Not The One Believing Jesus Is The Son of God!"},{"num":5,"verse":"And who is the one being-victorious-over the world if not the one believing that Jesus is the Son of God!"},{"header":"Because Jesus Christ Has The Three-Fold Witness of God"},{"num":6,"verse":"This One is the One having come by water and blood: Jesus Christ (not in the water only, but in the water and in the blood). And the Spirit is the One testifying, because the Spirit is the truth. "},{"num":7,"verse":"Because the ones testifying are three: "},{"num":8,"verse":"the Spirit and the water and the blood. And the three are for the one thing. "},{"num":9,"verse":"If we receive the testimony of humans, the testimony of God is greater!"},{"header":"Because God Himself Has Testified That He Has Given Us Eternal Life In His Son"},{"num":10,"verse":"The one believing in the Son of God has the testimony in himself. The one not believing God has made Him a liar, because he has not believed in the testimony which God has testified about His Son. "},{"num":11,"verse":"And this is the testimony: that God gave us eternal life, and this life is in His Son. "},{"num":12,"verse":"The one having the Son has the life. The one not having the Son of God does not have the life."},{"header":"I Wrote These Things That You May Know You Have Eternal Life"},{"num":13,"verse":"I wrote these things to you, the ones believing in the name of the Son of God, in order that you may know that you have eternal life."},{"header":"And This We Know With Confidence:"},{"num":14,"verse":"And this is the confidence which we have before Him:"},{"header":"That God Hears Our Prayers"},{"num":15,"verse":"And if we know that He hears us— whatever we request— we know that we have the requests which we have requested from Him."},{"header":"But I Am Not Implying You Should Pray About a Sin Leading To Death"},{"num":16,"verse":"If anyone sees his brother sinning a sin not leading to death, he shall request, and He will give him life— for the ones sinning a sin not leading to death. There is a sin leading to death. I am not saying that he should pray about that. "},{"num":17,"verse":"All unrighteousness is sin, and there is sin not leading to death."},{"header":"That God’s Children Are Not Sinning, And Are Protected From Satan"},{"num":18,"verse":"We know that everyone having been born from God is not sinning. But the One having been fathered from God is keeping him. And the evil one is not touching him."},{"header":"That We Are Born From God"},{"num":19,"verse":"We know that we are from God, and the whole world lies in the evil one."},{"header":"That We Know The True God And Have Eternal Life In Him"},{"num":20,"verse":"And we know that the Son of God has come, and has given us understanding in order that we might know the true One. And we are in the true One, in His Son Jesus Christ. This One is the true God and eternal life. "},{"num":21,"verse":"Little-children, guard yourselves from idols!"}]