[{"header":"Overcoming the World"},{"num":5,"verse":"Whoever believes that Jesus is the Christ is born of God, and everyone who loves the Father loves the one born of the Father. "},{"num":2,"verse":"By this we know that we love the children of God: when we love God and keep His commandments. "},{"num":3,"verse":"For this is the love of God, that we keep His commandments. And His commandments are not burdensome, "},{"num":4,"verse":"for whoever is born of God overcomes the world, and the victory that overcomes the world is our faith. "},{"num":5,"verse":"Who is it that overcomes the world, but the one who believes that Jesus is the Son of God?"},{"header":"The Witness Concerning the Son"},{"num":6,"verse":"This is He who came by water and blood—Jesus Christ. He did not come by water only, but by water and blood. It is the Spirit who bears witness, because the Spirit is the truth. "},{"num":7,"verse":"There are three who testify in heaven: the Father, the Word, and the Holy Spirit, and the three are one. "},{"num":8,"verse":"There are three that testify on earth: the Spirit, the water, and the blood, and the three are toward the one. "},{"num":9,"verse":"If we receive the testimony of men, the testimony of God is greater; for this is the testimony of God which He has given concerning His Son. "},{"num":10,"verse":"Whoever believes in the Son of God has this witness in himself. Whoever does not believe God has made Him out to be a liar, because he does not believe the testimony that God gave about His Son. "},{"num":11,"verse":"And this is the testimony: that God has given us eternal life, and this life is in His Son. "},{"num":12,"verse":"Whoever has the Son has life, and whoever does not have the Son of God does not have life."},{"header":"Purpose of Writing"},{"num":13,"verse":"I have written these things to you who believe in the name of the Son of God, that you may know that you have eternal life, and that you may continue to believe in the name of the Son of God. "},{"num":14,"verse":"This is the confidence that we have in Him, that if we ask anything according to His will, He hears us. "},{"num":15,"verse":"So if we know that He hears whatever we ask, we know that we have whatever we asked of Him."},{"num":16,"verse":"If anyone sees his brother commit a sin which does not lead to death, he shall ask, and He shall give him life. This is for those whose sin does not lead to death. There is a sin that leads to death. I do not say that he should pray for it. "},{"num":17,"verse":"All wrongdoing is sin, but there is a sin that does not lead to death."},{"num":18,"verse":"We know that whoever is born of God does not keep on sinning. But whoever has been born of God guards himself, and the wicked one cannot touch him. "},{"num":19,"verse":"We know that we are of God, and the whole world lies in wickedness. "},{"num":20,"verse":"And we know that the Son of God has come and has given us understanding, so that we may know Him who is true, and we are in Him who is true—His Son Jesus Christ. He is the true God and eternal life."},{"num":21,"verse":"Little children, keep yourselves from idols. Amen."}]