[{"header":"Faith in God’s Son Who Became a Human Being"},{"num":5,"verse":"Everyone who believes that Jesus is the Christ is a child of God. And everyone who loves the Father loves his children as well. "},{"num":2,"verse":"Here is how we know that we love God’s children. We know it when we love God and obey his commands. "},{"num":3,"verse":"In fact, here is what it means to love God. We love him by obeying his commands. And his commands are not hard to obey. "},{"num":4,"verse":"That’s because everyone who is a child of God has won the battle over the world. Our faith has won the battle for us. "},{"num":5,"verse":"Who is it that has won the battle over the world? Only the person who believes that Jesus is the Son of God."},{"num":6,"verse":"Jesus Christ was born as we are, and he died on the cross. He wasn’t just born as we are. He also died on the cross. The Holy Spirit is a truthful witness about him. That’s because the Spirit is the truth. "},{"num":7,"verse":"There are three that are witnesses about Jesus. "},{"num":8,"verse":"They are the Holy Spirit, the birth of Jesus, and the death of Jesus. And the three of them agree. "},{"num":9,"verse":"We accept what people say when they are witnesses. But it’s more important when God is a witness. That’s because it is what God says about his Son. "},{"num":10,"verse":"Whoever believes in the Son of God accepts what God says about him. Whoever does not believe God is calling him a liar. That’s because they have not believed what God said about his Son. "},{"num":11,"verse":"Here is what God says about the Son. God has given us eternal life. And this life is found in his Son. "},{"num":12,"verse":"Whoever belongs to the Son has life. Whoever doesn’t belong to the Son of God doesn’t have life."},{"header":"Final Words"},{"num":13,"verse":"I’m writing these things to you who believe in the name of the Son of God. I’m writing so you will know that you have eternal life. "},{"num":14,"verse":"Here is what we can be sure of when we come to God in prayer. If we ask anything in keeping with what he wants, he hears us. "},{"num":15,"verse":"If we know that God hears what we ask for, we know that we have it."},{"num":16,"verse":"Suppose you see any brother or sister commit a sin. But this sin is not the kind that leads to death. Then you should pray, and God will give them life. I’m talking about someone whose sin does not lead to death. But there is a sin that does lead to death. I’m not saying you should pray about that sin. "},{"num":17,"verse":"Every wrong thing we do is sin. But there are sins that do not lead to death."},{"num":18,"verse":"We know that those who are children of God do not keep on sinning. The Son of God keeps them safe. The evil one can’t harm them. "},{"num":19,"verse":"We know that we are children of God. We know that the whole world is under the control of the evil one. "},{"num":20,"verse":"We also know that the Son of God has come. He has given us understanding. So we can know the God who is true. And we belong to the true God by belonging to his Son, Jesus Christ. He is the true God and eternal life."},{"num":21,"verse":"Dear children, keep away from statues of gods."}]