[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Zimran.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The home of Keturah’s descendants is placed by Josephus and Jerome in Arabia-Felix; but the supposed traces of their names are untrustworthy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Midian is the one son of Keturah who had a great future before him, for his race became famous traders (Genesis 37:28); and as they are called Me· danites there in the Hebrew, in Genesis 37:36, it is probable that Medan and Midian coalesced into one tribe. Jethro, the father-in-law of Moses, belonged to them (Exodus 2:15-16), and, enriched by commerce, they became so powerful as to be dangerous neighbours to the Israelites. (Judges 6, 7, 8)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Midian",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is the one son of Keturah who had a great future before him, for his race became famous traders (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and as they are called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Me· danites ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "there in the Hebrew, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is probable that Medan and Midian coalesced into one tribe. Jethro, the father-in-law of Moses, belonged to them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:15-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and, enriched by commerce, they became so powerful as to be dangerous neighbours to the Israelites. (Judges 6, 7, 8)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shuah.—From him perhaps descended Bildad the Shuhite, Job’s friend (Job 2:11). The name in the Hebrew is different from that also rendered “Shuah” in Genesis 38:2.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shuah.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—From him perhaps descended Bildad the Shuhite, Job’s friend (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The name in the Hebrew is different from that also rendered “Shuah” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:1-10 All the days, even of the best and greatest saints, are not remarkable days; some slide on silently; such were these last days of Abraham. Here is an account of Abraham's children by Keturah, and the disposition which he made of his estate. After the birth of these sons, he set his house in order, with prudence and justice. He did this while he yet lived. It is wisdom for men to do what they find to do while they live, as far as they can. Abraham lived 175 years; just one hundred years after he came to Canaan; so long he was a sojourner in a strange country. Whether our stay in this life be long or short, it matters but little, provided we leave behind us a testimony to the faithfulness and goodness of the Lord, and a good example to our families. We are told that his sons Isaac and Ishmael buried him. It seems that Abraham had himself brought them together while he lived. Let us not close the history of the life of Abraham without blessing God for such a testimony of the triumph of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The endeavors to ascertain the tribes that descended from these six sons of Keturah have not been very successful. Zimran has been compared with Ζαβράμ  Zabram (Ptol. vi. 7, 5), situated west of Mecca on the Red Sea. Jokshan with the Κασσανῖται  Kassanitai (Ptol. vi. 7, 6), and with the tribe Jakish among the Himyarites in South Arabia. Medan with Μοδιάνα  Modiana on the east coast of the Aelanitic Gulf. Midian is found in two localities west of the Aelanitic Gulf and east of the Salt Sea. Among the former, Moses afterward found refuge. The latter are probably east of Abraham's residence. Ishbak is compared with Shobek, a place in Idumaea. Shuah probably belongs to the same region. He may be the ancestor of Bildad the Shuhite ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of these, Midian alone appears to be ascertained. The others may have been absorbed in that congeries of tribes, the Arabs.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 25",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ge 25:1-6. Sons of Abraham.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Abraham took a wife—rather, \"had taken\"; for Keturah is called Abraham's concubine, or secondary wife (1Ch 1:32); and as, from her bearing six sons to him, it is improbable that he married after Sarah's death; and also as he sent them all out to seek their own independence, during his lifetime, it is clear that this marriage is related here out of its chronological order, merely to form a proper winding up of the patriarch's history.Quest. How could Abraham, being now about one hundred and forty years old, have so many children, when his body was dead in his hundredth year? Answ. Because that renewed strength which was miraculously conferred upon him, did still in a great measure remain in him, being not a temporary action, but a durable habit or power. These persons were the heads of several people dwelling in Arabia and Syria, where we shall find evident footsteps of their names amongst ancient geographers, only a little changed, which could not be avoided in their translation into another language. Midian,  the father of those Midianites, of whom we read  Genesis 36:35 Judges 6:2 Isaiah 10:26. From Shuah Bildad seems to be descended,  Job 2:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. Abraham took a wife—rather, \"had taken\"; for Keturah is called Abraham's concubine, or secondary wife (1Ch 1:32); and as, from her bearing six sons to him, it is improbable that he married after Sarah's death; and also as he sent them all out to seek their own independence, during his lifetime, it is clear that this marriage is related here out of its chronological order, merely to form a proper winding up of the patriarch's history.",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Quest.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " How could Abraham, being now about one hundred and forty years old, have so many children, when his body was dead in his hundredth year? ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Answ.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Because that renewed strength which was miraculously conferred upon him, did still in a great measure remain in him, being not a temporary action, but a durable habit or power. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "These persons were the heads of several people dwelling in Arabia and Syria, where we shall find evident footsteps of their names amongst ancient geographers, only a little changed, which could not be avoided in their translation into another language. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Midian, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the father of those Midianites, of whom we read ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 36:35 Judges 6:2 Isaiah 10:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". From ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Shuah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Bildad seems to be descended, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Job 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And she bare him Zimran,.... That Keturah should bear children who probably, was a young woman, is not strange; but that Abraham, whose body forty years before this was dead should now have any bore to him, may seem difficult to account for, and only can be attributed to the fresh vigour his body was endued with at the generation of Isaac; and which still continued for the fulfilment of the promise to him of the multiplication of his seed. But if the notion of a late learned bishop (e) is right, there will be no need to have recourse to any thing extraordinary; which is, that Abraham took Keturah for his concubine, about twenty years after his marriage with Sarah, she being barren, and long before he took Hagar; though not mentioned till after the death of Sarah, that the thread of the history might not be broken in upon; and there are various things which make it probable, as that she is called his concubine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which one would think she should not be, if married to him after the death of Sarah, and when he had no other wife, and seeing before he died he had great grandchildren by her, and the children of her are reckoned down to the third generation; whereas there are only mention of two generations of Hagar, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and therefore seems to have been taken by him before Hagar, and even when he was in Haran, and the children by her are thought to be the souls gotten there; nor does it seem very probable that he should take a wife after the death of Sarah, when he was one hundred and forty years of age, and was reckoned an old man forty years before this; and Dr. Lightfoot (f) is of opinion, that Abraham married her long before Isaac's marriage, or Sarah's death; and if this was the case, the difficulty of accounting for Abraham's fitness for generation vanishes. The first son of Keturah, born to him, was called Zimran, from whence came the Zamareni, a people in Arabia Felix mentioned by Pliny (g); and hereabout the sons of Keturah settled, being sent by Abraham into the east country, even into Arabia, which lay east of the place where he then was; and very probably Zabram; or it may be rather Zamram, a royal city in the country of the Cinaedocolpites, a part of Arabia Felix, as placed by Ptolemy (h), may have its name from this man: five more of Abraham's sons by Keturah follow: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Jokshan, and Medan, and Midian, and Ishbak, and Shuah: some think that the first of these is the same with Cahtan, whom the Arabs call the father of their nation; but that Cahtan rather seems to be Joktan the son of Eber, see Genesis 10:25. Philostorgius (i) speaks of a nation in his time, called Homerites, who were a people that sprung from Keturah, and inhabited Arabia Felix, and who used circumcision on the eighth day: and Bishop Patrick observes from Theophanes, a chronologer of the ninth century, that the Homerites, who lived in the interior parts of Arabia, descended from Jectan, which he conjectures should be read Jocshan, though perhaps he is no other than the Joktan before mentioned. From Medan and Midian sprung the Midianites, so often mentioned in Scripture; their posterity seem to be confounded together, for the same people are called Medanites and Midianites, Genesis 37:28; from these men the towns in Arabia might have their names, as the Modiana and Madiana of Ptolemy (k): as for Ishbak, there is no tracing of his name anywhere, unless, as Bishop Patrick observes, some footsteps of it are to be found in Bacascami, a town of the Zamareni, who descended from his brother Zimran, and in the people Backliltae, both mentioned by Pliny (l); though Junius think that Scabiosa Laodicea, in Laodicene of Syria, has its name from him; which seems not likely. The name of Shuah or Shuach may be traced in Socacia, Soaca, and Socheher, cities placed by Ptolemy (m) in Arabia Felix: though some think the posterity of this man are those whom the geographers call Sauchites, Sauchaeans, and Saccaeans, who settled in Arabia Deserta, and from whom Bildad the Shuhite, Job 2:11, descended; which is not improbable. But others have been of opinion, that the town of Suez, which Pliny calls Suaza, had its name from this Shuah, situate at the extremity of the Red sea (n). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Jokshan, and Medan, and Midian, and Ishbak, and Shuah: some think that the first of these is the same with Cahtan, whom the Arabs call the father of their nation; but that Cahtan rather seems to be Joktan the son of Eber, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Philostorgius (i) speaks of a nation in his time, called Homerites, who were a people that sprung from Keturah, and inhabited Arabia Felix, and who used circumcision on the eighth day: and Bishop Patrick observes from Theophanes, a chronologer of the ninth century, that the Homerites, who lived in the interior parts of Arabia, descended from Jectan, which he conjectures should be read Jocshan, though perhaps he is no other than the Joktan before mentioned. From Medan and Midian sprung the Midianites, so often mentioned in Scripture; their posterity seem to be confounded together, for the same people are called Medanites and Midianites, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; from these men the towns in Arabia might have their names, as the Modiana and Madiana of Ptolemy (k): as for Ishbak, there is no tracing of his name anywhere, unless, as Bishop Patrick observes, some footsteps of it are to be found in Bacascami, a town of the Zamareni, who descended from his brother Zimran, and in the people Backliltae, both mentioned by Pliny (l); though Junius think that Scabiosa Laodicea, in Laodicene of Syria, has its name from him; which seems not likely. The name of Shuah or Shuach may be traced in Socacia, Soaca, and Socheher, cities placed by Ptolemy (m) in Arabia Felix: though some think the posterity of this man are those whom the geographers call Sauchites, Sauchaeans, and Saccaeans, who settled in Arabia Deserta, and from whom Bildad the Shuhite, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", descended; which is not improbable. But others have been of opinion, that the town of Suez, which Pliny calls Suaza, had its name from this Shuah, situate at the extremity of the Red sea (n). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Dr. Clayton's Chronology of the Hebrew Bible, p. 83, &c. (f) Observations on the Book of Genesis in his Works, vol. 1. p. 695. (g) Nat. Hist. l. 6. c. 28. (h) Geograph. l. 6. c. 7. (i) Eccl. Hist. l. 3. sect. 4. p. 477. (k) Ut supra. (h)) (l) Ut supra. (g)) (m) Ut supra. (h)) (n) See Egmont and Heyman's Travels, vol. 2. p. 184. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Dr. Clayton's Chronology of the Hebrew Bible, p. 83, &c. (f) Observations on the Book of Genesis in his Works, vol. 1. p. 695. (g) Nat. Hist. l. 6. c. 28. (h) Geograph. l. 6. c. 7. (i) Eccl. Hist. l. 3. sect. 4. p. 477. (k) Ut supra. (h)) (l) Ut supra. (g)) (m) Ut supra. (h)) (n) See Egmont and Heyman's Travels, vol. 2. p. 184. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And she bare him Zimran, and Jokshan, and Medan, and Midian, and Ishbak, and Shuah.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And she bare him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The genealogy of Keturah is found again in a shortened form in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That we have to do with a tradition relating to tribes and places rather than to individuals, is clearly shewn by such names as Midian, Shuah, Sheba, and Dedan. In this verse six names are given. In view of other groups of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), this number is hardly accidental; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 25:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zimran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Probably from a word meaning “wild goat”: cf. Zimri, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Midian",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The territory with which the Midianites are usually found associated is N.W. Arabia, the east side of the Gulf of Akaba. Groups of Midianites appear in the Sinaitic Peninsula (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Extending their influence along the eastern side of the Dead Sea, Midianites appear as the enemies of Israel on the eastern side of the Jordan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 31:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in Judges 6 bands of Midianites overrun Palestine. On Midianite trade with Egypt, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shuah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] = ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Bildad, the Shuhite.” It has been identified somewhat precariously with the Assyrian ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Suhu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the Euphrates, S. of Carchemish.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And she bare him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (since the patriarch's body at 100 years was practically dead, it is almost certain that his marriage with Keturah took place after the renewal of his powers; and it is easier to suppose that his physical vigor remained for some years after Sarah's death than that, with his former experience of concubinage, and his parental joy in the birth of Isaac, he should add a second wife while Sarah lived) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Zimran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - identified with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Zabram",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", west of Mecca, on the Red Sea (Knobel, Keil); or the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Zimareni",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the interior of Arabia (Delitzsch, Kalisch) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and Jokshan,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Kassamitae",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the Red Sea (Knobel); or the Himarytish tribe Jakish, in Southern Arabia (Keil) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and Medan, and Midian",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- Modiana",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the east of the Elamitic Gulf, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Madiana",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", north of this (Rosenmüller, Keil, Knobel) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and Ishbak",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - perhaps preserved in Schobeck, in the land of the Edomites (Knobel, Keil) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and Shuah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - for which the epithet Shuhite (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may point to Northern Idumaea (Keil, Knobel, Kalisch). Genesis 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abraham's Marriage to Keturah is generally supposed to have taken place after Sarah's death, and his power to beget six sons at so advanced an age is attributed to the fact, that the Almighty had endowed him with new vital and reproductive energy for begetting the son of the promise. But there is no firm ground for this assumption; as it is not stated anywhere, that Abraham did not take Keturah as his wife till after Sarah's death. It is merely an inference drawn from the fact, that it is not mentioned till afterwards; and it is taken for granted that the history is written in strictly chronological order. But this supposition is precarious, and is not in harmony with the statement, that Abraham sent away the sons of the concubines with gifts during his own lifetime; for in the case supposed, the youngest of Keturah's sons would not have been more than twenty-five or thirty years old at Abraham's death; and in those days, when marriages were not generally contracted before the fortieth year, this seems too young for them to have been sent away from their father's house. This difficulty, however, is not decisive. Nor does the fact that Keturah is called a concubine in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", necessarily show that she was contemporary with Sarah, but may be explained on the ground that Abraham did not place her on the same footing as Sarah, his sole wife, the mother of the promised seed. Of the sons and grandsons of Keturah, who are mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as well as here, a few of the names may still be found among the Arabian tribes, but in most instances the attempt to trace them is very questionable. This remark applies to the identification of Zimran with Ζαββάμ (Ptol. vi. 7, 5), the royal city of the Κιναιδοκολπῖται to the west of Mecca, on the Red Sea; of Jokshan with the Κασσανῖται, on the Red Sea (Ptol. vi. 7, 6), or with the Himyaritish tribe of Jakish in Southern Arabia; of Ishbak with the name Shobek, a place in the Edomitish country first mentioned by Abulfeda; of Shuah with the tribe Syayhe to the east of Aila, or with Szyhhan in Northern Edom (Burckhardt, Syr. 692, 693, and 945), although the epithet the Shuhite, applied to Bildad, points to a place in Northern Idumaea. There is more plausibility in the comparison of Medan and Midian with Μοδιάνα on the eastern coast of the Elanitic Gulf, and Μαδιάνα, a tract to the north of this (Ptol. vi. 7, 2, 27; called by Arabian geographers Madyan, a city five days' journey to the south of Aila). The relationship of these two tribes will explain the fact, that the Midianim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are called Medanim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]