[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(63) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the Lord rejoiced over you.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 28:63",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:63",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord will rejoice over you, to destroy you — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His just indignation against you will be so great, that it will be a pleasure to him to take vengeance on you. For though he doth not delight in the death of a sinner in itself, yet he doth delight in glorifying his justice upon incorrigible transgressors, seeing the exercise of all his attributes must needs please him, else he were not perfectly happy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And ye shall be plucked from off the land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This was fulfilled when the king of Assyria carried the ten tribes into captivity, and planted other nations in their stead; and when the king of Babylon carried away the other two tribes; and especially when the Romans took away their place and nation, not to mention other captivities and transportations of them. “Afterward, when the Emperor Adrian had subdued the rebellious Jews, he published an edict, forbidding them, upon pain of death, to set foot in Jerusalem, or even to approach the country round about. Tertullian and Jerome say, they were prohibited from entering Judea. From that time to this their country hath been in the possession of foreign lords and masters, few of the Jews dwelling in it, and those only of a low, servile condition.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:45-68 If God inflicts vengeance, what miseries his curse can bring upon mankind, even in this present world! Yet these are but the beginning of sorrows to those under the curse of God. What then will be the misery of that world where their worm dieth not, and their fire is not quenched! Observe what is here said of the wrath of God, which should come and remain upon the Israelites for their sins. It is amazing to think that a people so long the favourites of Heaven, should be so cast off; and yet that a people so scattered in all nations should be kept distinct, and not mixed with others. If they would not serve God with cheerfulness, they should be compelled to serve their enemies. We may justly expect from God, that if we do not fear his fearful name, we shall feel his fearful plagues; for one way or other God will be feared. The destruction threatened is described. They have, indeed, been plucked from off the land, ver. 63. Not only by the Babylonish captivity, and when Jerusalem was destroyed by the Romans; but afterwards, when they were forbidden to set foot in Jerusalem. They should have no rest; no rest of body, ver. 65, but be continually on the remove, either in hope of gain, or fear of persecution. No rest of the mind, which is much worse. They have been banished from city to city, from country to country; recalled, and banished again. These events, compared with the favour shown to Israel in ancient times, and with the prophecies about them, should not only excite astonishment, but turn unto us for a testimony, assuring us of the truth of Scripture. And when the other prophecies of their conversion to Christ shall come to pass, the whole will be a sign and a wonder to all the nations of the earth, and the forerunner of a general spread of true christianity. The fulfilling of these prophecies upon the Jewish nation, delivered more than three thousand years ago, shows that Moses spake by the Spirit of God; who not only foresees the ruin of sinners, but warns of it, that they may prevent it by a true and timely repentance, or else be left without excuse. And let us be thankful that Christ hath redeemed us from the curse of the law, by being made a curse for us, and bearing in his own person all that punishment which our sins merit, and which we must otherwise have endured for ever. To this Refuge and salvation let sinners flee; therein let believers rejoice, and serve their reconciled God with gladness of heart, for the abundance of his spiritual blessings.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Fifth series of judgments. The uprooting of Israel from the promised land, and its dispersion among other nations. Examine the marginal references.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Deuteronomy 28:58",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:58",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In this book - i. e. in the book of the Law, or the Pentateuch in so far as it contains commands of God to Israel. Deuteronomy is included, but not exclusively intended. So Deuteronomy 28:61; compare Deuteronomy 27:3 and note, Deuteronomy 31:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In this book - i. e. in the book of the Law, or the Pentateuch in so far as it contains commands of God to Israel. Deuteronomy is included, but not exclusively intended. So ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:61",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and note, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 31:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "63. ye shall be plucked from off the land—Hadrian issued a proclamation, forbidding any Jews to reside in Judea, or even to approach its confines.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Rejoice over you to destroy you; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his just indignation against you will be so great, that it will be a pleasure to him to take vengeance on you. For though he doth not delight in the death of a sinner in itself, yet he doth doubtless delight in the glorifying of his justice upon incorrigible sinners, seeing the exercise of all his attributes must needs please him, else he were not perfectly happy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The land whither thou goest to possess it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was no ordinary land, but a most pleasant land, a land of promise, a token of God’s favour, and a pledge of their eternal inheritance, which was a great aggravation of their loss of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it shall come to pass, that as the Lord rejoiced over you to do you good,.... The Word of the Lord, as the Targum of Jonathan; who with great delight and pleasure in them brought them out of Egypt, conducted them through the wilderness, protecting them and providing all good things for them; and brought them into the land of Canaan, a land flowing with milk and honey, and settled them there; and gave them judges and kings, priests and prophets, for a long series of time, with other innumerable blessings he bestowed upon them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to multiply you; so that they became as the stars of heaven, and the sand of the sea, as before observed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so the Lord will rejoice over you to destroy you and to bring you to nought; take as much pleasure in their ruin and destruction, whereby his justice would be glorified, and the honour of his laws preserved, as before in bestowing good things on them, in which mercy and kindness were displayed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and ye shall be plucked from off the land whither thou goest to possess it; in a violent manner, by their enemies, and against their wills, they being loath to leave it. The Emperor Adrian, to prevent their insurrections and rebellions, which had given him a great deal of trouble, ordered by an edict that no Jew should come into Jerusalem, nor into the land of Judea, or be seen in it, which is observed by several writers (m); by which means the country was cleared of them. In later times some of them did get thither again, but they were but few. Benjamin of Tudela, a Jew of the twelfth century, travelled into several parts of the world in quest of his countrymen, and particularly into Judea, and his view was to magnify his people; and yet owns he found at Jerusalem only two hundred persons, whose employment was dyeing wool, and dwelt in a corner of the town under the tower of David; and but twelve at Bethlehem, three at Maresha, at Shunem indeed three hundred, none at Gilead, two at Nob, who were dyers, three at Ramah, one at Joppa, none at Jafne, where had been a famous academy, none at Ashdod, and at Tiberias about fifty (n). And our countryman Sandys (o), who travelled into Judea in the seventeenth century, says,\"here be some Jews, yet inherit they no part of the land, but in their own country do live as aliens.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Justin Martyr, Tertullian, Eusebius. See Dr. Newton ut supra. (Prophesies, vol. 1. Dissert. 7. sect. 6. p. 186.) (n) Itinerar. p. 41-53. (o) Travels, sect. 3. p. 114. Ed. 5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Justin Martyr, Tertullian, Eusebius. See Dr. Newton ut supra. (Prophesies, vol. 1. Dissert. 7. sect. 6. p. 186.) (n) Itinerar. p. 41-53. (o) Travels, sect. 3. p. 114. Ed. 5. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it shall come to pass, that as the LORD rejoiced over you to do you good, and to multiply you; so the LORD will rejoice over you to destroy you, and to bring you to nought; and ye shall be plucked from off the land whither thou goest to possess it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rejoiced over you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exult",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", found only in exilic or post-exilic passages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to multiply you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rejoice … to destroy you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This rhetorical figure is characteristic of the deuteronomic style. Contrast ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 63.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - (Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) He, whose joy it had been to do them good, should rejoice over their destruction (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Deuteronomy 28:63",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yea, the Lord would find His pleasure in the destruction and annihilation of Israel, as He had previously rejoiced in blessing and multiplying it. With this bold anthropomorphic expression Moses seeks to remove from the nation the last prop of false confidence in the mercy of God. Greatly as the sin of man troubles God, and little as the pleasure may be which He has in the death of the wicked, yet the holiness of His love demands the punishment and destruction of those who despise the riches of His goodness and long-suffering; so that He displays His glory in the judgment and destruction of the wicked no less than in blessing and prospering the righteous.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Deuteronomy 28:63-64",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:63-64",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Those who had not succumbed to the plagues and strokes of God, would be torn from the land of their inheritance, and scattered among all nations to the end of the earth, and there be compelled to serve other gods, which are wood and stone, which have no life and no sensation, and therefore can hear no prayer, and cannot deliver out of any distress (cf. Deuteronomy 4:27.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Those who had not succumbed to the plagues and strokes of God, would be torn from the land of their inheritance, and scattered among all nations to the end of the earth, and there be compelled to serve other gods, which are wood and stone, which have no life and no sensation, and therefore can hear no prayer, and cannot deliver out of any distress (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".).",
            "children": []
          }
        ]
      }
    ]
  }
]