[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord hath spoken.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The promise here quoted is not contained in so many words in the records which have come down to us. It may have been either an unrecorded utterance of one of the prophets (Samuel, Gad, or Nathan), or simply a reasonable inference from what had been promised, and from the Divine support of David in his career hitherto.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 3:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 3:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord hath spoken — By the hand of my servant David, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — We nowhere find these words recorded; but it is probable Samuel had often spoken them; at least the sense of them is implied in the words of God to Samuel, when he commanded him to anoint David king over Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the intention of giving them a king was, that he might fight their battles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:7-21 Many, like Abner, are not above committing base crimes, who are too proud to bear reproof, or even the suspicion of being guilty. While men go on in sin, and apparently without concern, they are often conscious that they are fighting against God. Many mean to serve their own purposes; and will betray those who trust them, when they can get any advantage. Yet the Lord serves his own designs, even by those who are thus actuated by revenge, ambition, or lust; but as they intend not to honour him, in the end they will be thrown aside with contempt. There was real generosity both to Michal and to the memory of Saul, in David's receiving the former, remembering probably how once he owed his life to her affection, and knowing that she was separated from him partly by her father's authority. Let no man set his heart on that which he is not entitled to. If any disagreement has separated husband and wife, as they expect the blessing of God, let them be reconciled, and live together in love.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye sought for David ... - Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was only by Abner's great influence that the elders of Israel had been restrained hitherto from declaring for David, and this accounts for Ish-bosheth's helpless submission to his uncle's dictation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17-21. Abner had communication with the elders of Israel—He spoke the truth in impressing their minds with the well-known fact of David's divine designation to the kingdom. But he acted a base and hypocritical part in pretending that his present movement was prompted by religious motives, when it sprang entirely from malice and revenge against Ish-bosheth. The particular appeal of the Benjamites was a necessary policy; their tribe enjoyed the honor of giving birth to the royal dynasty of Saul; they would naturally be disinclined to lose that prestige. They were, besides, a determined people, whose contiguity to Judah might render them troublesome and dangerous. The enlistment of their interest, therefore, in the scheme, would smooth the way for the adhesion of the other tribes; and Abner enjoyed the most convenient opportunity of using his great influence in gaining over that tribe while escorting Michal to David with a suitable equipage. The mission enabled him to cover his treacherous designs against his master—to draw the attention of the elders and people to David as uniting in himself the double recommendation of being the nominee of Jehovah, no less than a connection of the royal house of Saul, and, without suspicion of any dishonorable motives, to advocate policy of terminating the civil discord, by bestowing the sovereignty on the husband of Michal. In the same character of public ambassador, he was received and feted by David; and while, ostensibly, the restoration of Michal was the sole object of his visit, he busily employed himself in making private overtures to David for bringing over to his cause those tribes which he had artfully seduced. Abner pursued a course unworthy of an honorable man and though his offer was accepted by David, the guilt and infamy of the transaction were exclusively his.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Now then do it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " you shall have my free consent and utmost assistance in procuring it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord hath spoken of David; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he wickedly pretends religion, when he intended nothing but the satisfaction of his own pride, and malice, and fury against Ish-bosheth. It is very probable God spake these words, but undoubtedly he spake the same sense by Samuel, though it be not expressed before. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now then do it,.... Make him your king, and I shall no longer oppose it as I have done: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord hath spoken of David; concerning his being king, and the saviour of his people Israel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, by the hand of my servant David I will save my people Israel out of the hand of the Philistines, and out of the hand of all their enemies; and which, though where recorded in so many words, yet was the sense of the promise of making him king, and the design of his unction; and besides they might have been spoken to Samuel, though not written; and which he might report, and so might pass from one to another to be generally known. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying, by the hand of my servant David I will save my people Israel out of the hand of the Philistines, and out of the hand of all their enemies; and which, though where recorded in so many words, yet was the sense of the promise of making him king, and the design of his unction; and besides they might have been spoken to Samuel, though not written; and which he might report, and so might pass from one to another to be generally known. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now then do it: for the LORD hath spoken of David, saying, By the hand of my servant David I will save my people Israel out of the hand of the Philistines, and out of the hand of all their enemies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will save my people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The commission which had been given to Saul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was transferred to David. Again we have an intimation that prophetic utterances respecting David’s divine appointment to the throne were commonly known.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord hath spoken.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here again Abner's statements go far beyond the text of anything recorded in Holy Scripture, but probably they give the popular interpretation of the prophecies respecting David. It will be noticed also that Abner endeavours to meet the general prejudice against David by asserting that he was Israel's destined deliverer from Philistine oppression. As Abner's speech is virtually an acknowledgment of failure, we may also be sure that he had found himself unable any longer to make head against the Philistines on the western side of the Jordan, and that Judah was the only tribe there that enjoyed tranquillity. Everywhere else they had once again established their supremacy. Though a brave soldier, Abner was inferior, not only to David, but also to Joab, both as statesman and general; and the weak Ishbosheth was no help to him, but the contrary. 2 Samuel 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But before Abner set out to go to David, he had spoken to the elders of Israel (the tribes generally, with the exception of Benjamin see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Judah): \"Both yesterday and the day before yesterday (i.e., a long time ago), ye desired to have David as king over you. Now carry out your wish: for Jehovah hath spoken concerning David, Through my servant David will I save my people Israel out of the power of the Philistines and all their enemies.\" הושׁיע is an evident mistake in writing for אושׁיע, which is found in many MSS, and rendered in all the ancient versions.",
        "children": []
      }
    ]
  }
]