[{"num":23,"verse":"He who is wounded in the testicles, or has been made a eunuch, shall not enter into the congregation of the Lord."},{"num":2,"verse":"A person begotten out of wedlock shall not enter into the assembly of the Lord; even to his tenth generation shall his descendants not enter into the congregation of the Lord."},{"num":3,"verse":"An Ammonite or Moabite shall not enter into the congregation of the Lord; even to their tenth generation their descendants shall not enter into the assembly of the Lord forever,"},{"num":4,"verse":"Because they did not meet you with food and water on the way when you came forth out of Egypt, and because they hired Balaam son of Beor of Pethor of Mesopotamia against you to curse you."},{"num":5,"verse":"Nevertheless, the Lord your God would not listen to Balaam, but the Lord your God turned the curse into a blessing to you, because the Lord your God loves you."},{"num":6,"verse":"You shall not seek their peace or their prosperity all your days forever."},{"num":7,"verse":"You shall not abhor an Edomite, for he is your brother [Esau’s descendant]. You shall not abhor an Egyptian, because you were a stranger and temporary resident in his land."},{"num":8,"verse":"Their children may enter into the congregation of the Lord in their third generation."},{"num":9,"verse":"When you go forth against your enemies and are in camp, you shall keep yourselves from every evil thing."},{"num":10,"verse":"If there is among you any man who is not clean by reason of what happens to him at night, then he shall go outside the camp; he shall not come within the camp;"},{"num":11,"verse":"But when evening comes he shall bathe himself in water, and when the sun is down he may return to the camp."},{"num":12,"verse":"You shall have a place also outside the camp to which you shall go [as a comfort station];"},{"num":13,"verse":"And you shall have a paddle or shovel among your weapons, and when you sit down outside [to relieve yourself], you shall dig a hole with it and turn back and cover up what has come from you."},{"num":14,"verse":"For the Lord your God walks in the midst of your camp to deliver you and to give up your enemies before you. Therefore shall your camp be holy, that He may see nothing indecent among you and turn away from you."},{"num":15,"verse":"You shall not give up to his master a servant who has escaped from his master to you."},{"num":16,"verse":"He shall dwell with you in your midst wherever he chooses in one of your towns where it pleases him best. You shall not defraud or oppress him."},{"num":17,"verse":"There shall be no cult prostitute among the daughters of Israel, neither shall there be a cult prostitute (a sodomite) among the sons of Israel."},{"num":18,"verse":"You shall not bring the hire of a harlot or the price of a dog (a sodomite) into the house of the Lord your God as payment of a vow, for both of these [the gift and the giver] are an abomination to the Lord your God."},{"num":19,"verse":"You shall not lend on interest to your brother—interest on money, on victuals, on anything that is lent for interest."},{"num":20,"verse":"You may lend on interest to a foreigner, but to your brother you shall not lend on interest, that the Lord your God may bless you in all that you undertake in the land to which you go to possess it."},{"num":21,"verse":"When you make a vow to the Lord your God, you shall not be slack in paying it, for the Lord your God will surely require it of you, and slackness would be sin in you."},{"num":22,"verse":"But if you refrain from vowing, it will not be sin in you."},{"num":23,"verse":"The vow which has passed your lips you shall be watchful to perform, a voluntary offering which you have made to the Lord your God, which you have promised with your mouth."},{"num":24,"verse":"When you come into your neighbor’s vineyard, you may eat your fill of grapes, as many as you please, but you shall not put any in your vessel."},{"num":25,"verse":"When you come into the standing grain of your neighbor, you may pluck the ears with your hand, but you shall not put a sickle to your neighbor’s standing grain."}]