[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sacrifices of righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:18-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The context in both places directs to the translation “right” or “due” sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "sacrifices duly and religiously performed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 4:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Offer — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Unto God, that he may be reconciled to you; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sacrifice of righteousness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Righteous sacrifices; which requires that the persons offering them be righteous and do righteous things, and offer them with an honest mind, with faith and true repentance. Without which he intimates that all their sacrifices were of no esteem with God, and would be wholly unprofitable to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And put your trust in the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, that is, so doing, you may rely upon God, and confidently expect his assistance and blessing, for which otherwise it is in vain for you to hope. Dr. Horne, who thinks this Psalm looks forward to gospel days, interprets this verse in the following manner: “The Jews are no longer to offer the shadowy sacrifices of their law, since He who is the substance of them all is come into the world. The Gentiles are no more to offer their idolatrous sacrifices, since their idols have fallen before the cross. But returning sinners, whether Jews or Gentiles, are to offer the same sacrifices of evangelical righteousness; not putting their trust in them, but in the Lord Jesus, through whose Spirit they are enabled to offer, and through whose blood their offerings are acceptable unto God.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-5 Hear me for thy mercy-sake, is our best plea. He who will not ask such blessings as pardon, and justifying righteousness, and eternal life, must perish for the want of them. Alas! that so many should make so fearful a choice. The psalmist warns against sin. Keep up holy reverence of the glory and majesty of God. You have a great deal to say to your hearts, they may be spoken with, let it not be unsaid. Examine them by serious self-reflection; let your thoughts fasten upon that which is good, and keep close to it. Consider your ways, and before you turn to sleep at night, examine your consciences with respect to what you have done in the day; particularly what you have done amiss, that you may repent of it. when you awake in the night, meditate upon God, and the things that belong to your peace. Upon a sick-bed, particularly, we should consider our ways. Be still. when you have asked conscience a question, be serious, be silent, wait for an answer. Open not the mouth to excuse sin. All confidence must be pan answer. Open not the mouth to excuse sin. All confidence only: therefore, after commanding the sacrifices of righteousness, the psalmist says, Put your trust in the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Offer the sacrifices of righteousness - Offer righteous sacrifices; that is, sacrifices prompted by right motives, and in accordance with the prescriptions in the law of God. This appears to be addressed also to those who in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are called \"sons of men;\" that is, those who were arrayed against the psalmist. According to the common opinion this psalm was composed by David on occasion of his being driven from his throne and kingdom; and, of course, Zion, the ark, and the tabernacle, were in the hands of his enemies. The exhortation here may be, either that, as his enemies were now in possession of the usual seat of public worship, they would conduct the worship of God by keeping up the regular daily sacrifice; or, more probably, it means that in view of their sins, particularly in this rebellion, and as the result of the calm reflection to which he had exhorted them in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", they should now manifest their repentance, and their purpose to turn to God, by presenting to him an appropriate sacrifice. They were sinners. They were engaged in an unholy cause. He exhorts them to pause, to reflect, to turn to God, and to bring a sacrifice for their sins, that their guilt might be blotted out.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And put your trust in the Lord - That is, turn from your evil ways, and confide in God in all his arrangements, and submit to him. Compare Psalm 2:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And put your trust in the Lord - That is, turn from your evil ways, and confide in God in all his arrangements, and submit to him. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Not only repent, but manifest penitence by sacrifices or righteousness or righteous sacrifices, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5 Offer the sacrifices of righteousness, and put your trust in the Lord.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Provided that the rebels had obeyed the voice of the last verse, they would now be crying, - \"What shall we do to be saved?\" And in the present verse, they are pointed to the sacrifice, and exhorted to trust in the Lord. When the Jew offered sacrifice righteously, that is, in a spiritual manner, he thereby set forth the Redeemer, the great sin-atoning Lamb; there is, therefore, the full gospel in this exhortation of the Psalmist. O sinners, flee ye to the sacrifices of Calvary, and there put your whole confidence and trust, for he who died for men is the Lord Jehovah. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Offer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, unto God, that he may be reconciled to you, and may pardon all your murmurings and insurrections against him and against me. For it seems plain that this, as well as the former verse, is spoken not to David’s friends and favourers, as some think, but to his enemies, even to those ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sons of men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 4:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", to whom he directeth his speech, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 4:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 4:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stand in awe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and here ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offer: The sacrifices of righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. righteous sacrifices; which requires that the persons offering them be righteous, and do righteous things, and offer them with an honest mind, and with faith (as it follows) and true repentance; without which he intimates that all their sacrifices were of no esteem with God, and would be wholly unprofitable to them. And withal, it is probable that he reflects upon the followers of Saul or of Absalom, who had the only place of sacrifice in their possession, whilst David was debarred of the opportunity of sacrificing, as he complains, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 26:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and accordingly they gloried in their sacrifices, and upon that account promised themselves success against David, who was by God’s providence deprived of the opportunities of reconciling and engaging God by sacrifices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And put your trust in the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and then, i.e. so doing, you may rely upon God, and confidently expect his assistance, which otherwise it is in vain for you to hope for. Withal, he seems to reflect upon his enemies, who trusted to an arm of flesh, to their own great numbers and power, and to intimate what his course was, to wit, to trust in the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Offer the sacrifices of righteousness,.... Offer for sacrifice things righteously gotten, for the Lord hates robbery for burnt offering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some respect may be had to the unrighteous acquisitions of Absalom and his men, and who were now in possession of Jerusalem, and of the altars of the Lord, and were sacrificing on them; in which they gloried; and to which this may be opposed. Likewise sacrifices of righteousness are such as were according to the law, and were offered in a right manner; which were not maimed, nor had any blemish in them; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and particularly such as were offered up in the faith of the great sacrifice, Christ; for, without faith, it is impossible to please God by any sacrifice. And this sense is confirmed by the following clause, which requires trust in the Lord. Moreover, righteousness, with the Jews, signifies alms, beneficence, showing mercy to the indigent; and acts of liberality are sacrifices, with which God is well pleased; and which are preferred by him to the sacrifices of the ceremonial law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sacrifices also of a broken heart, and of a contrite spirit, are such as God esteems of; he looks to those that have them, and dwells with them. And to this sense the Chaldee paraphrase inclines, in which the words are thus paraphrased; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"subdue your corruptions, and it shall be reckoned to you as a sacrifice of righteousness?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and why may not the sacrifice of praise for mercies received, especially for the righteousness of Christ, be at least included, if not principally designed; since these are sacrifices which, under the ceremonial law, were more pleasing to God than others; and are always acceptable to him through Jesus Christ our Lord? Agreeably to this, Aben Ezra thinks the peace offerings are intended, which were in a way of thanksgiving; and are opposed to sin offerings, and trespass offerings, and burnt offerings; from the last of which sacrifices of righteousness are distinguished in Psalm 51:19; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and why may not the sacrifice of praise for mercies received, especially for the righteousness of Christ, be at least included, if not principally designed; since these are sacrifices which, under the ceremonial law, were more pleasing to God than others; and are always acceptable to him through Jesus Christ our Lord? Agreeably to this, Aben Ezra thinks the peace offerings are intended, which were in a way of thanksgiving; and are opposed to sin offerings, and trespass offerings, and burnt offerings; from the last of which sacrifices of righteousness are distinguished in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and put your trust in the Lord: not in your strength, in horses and chariots, and numbers of men; nor in wise counsels, nor in riches, nor in fleshly privileges, nor in works of righteousness, or sacrifices of righteousness: for though they are to be performed, they are not to be trusted in; nor in your own hearts. And while the psalmist is striking at the false confidence of the sons of men he is addressing, he may at the same time be thought to be encouraging those that were with him to trust in the Lord, Jehovah, the Son of God, before spoken of by him as the object of trust, Psalm 2:12; to trust in his person for the acceptance of their persons and sacrifices of righteousness; and in his righteousness for justification; in his blood for pardon; in his sacrifice for expiation of sin; in his fulness for daily supplies; and in his power for protection and safety. And it is right to trust in him at all times; in times of affliction, temptation, and desertion: he is always the same; in him is everlasting strength; he has an heart as well as an ability to help and succour, and none ever trusted in him and were confounded. Such have peace and safety, and can want no good thing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and put your trust in the Lord: not in your strength, in horses and chariots, and numbers of men; nor in wise counsels, nor in riches, nor in fleshly privileges, nor in works of righteousness, or sacrifices of righteousness: for though they are to be performed, they are not to be trusted in; nor in your own hearts. And while the psalmist is striking at the false confidence of the sons of men he is addressing, he may at the same time be thought to be encouraging those that were with him to trust in the Lord, Jehovah, the Son of God, before spoken of by him as the object of trust, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to trust in his person for the acceptance of their persons and sacrifices of righteousness; and in his righteousness for justification; in his blood for pardon; in his sacrifice for expiation of sin; in his fulness for daily supplies; and in his power for protection and safety. And it is right to trust in him at all times; in times of affliction, temptation, and desertion: he is always the same; in him is everlasting strength; he has an heart as well as an ability to help and succour, and none ever trusted in him and were confounded. Such have peace and safety, and can want no good thing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{i} Offer the sacrifices of righteousness, and put your trust in the LORD.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Offer the sacrifices of righteousness, and put your trust in the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Serve God purely, and not with outward ceremonies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacrifices of righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Sacrifices offered in a right spirit, cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rebels are still addressed. The sacrifices with which they pretended to hallow their cause (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") were a wretched hypocrisy, inasmuch as they were acting in opposition to the will of God. Let them approach Him in a right spirit, and instead of impatiently trying to remedy evils by revolution, rely entirely upon His guidance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After an interval for reflection indicated by the interlude (Selah) David points the malcontents among the people to the true source of prosperity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Offer the sacrifices of righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Sacrifices of victims are scarcely meant; certainly not, if the time of the composition is that of David's exile, since victims could be offered nowhere but at Jerusalem. We may suppose a reference to those sacrifices which are most truly \"sacrifices of righteousness,\" vie. \"a broken spirit, a broken and a contrite heart,\" which God \"will not despise\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:17",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "). And put your trust in the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Sacrifice without faith is vain. Even \"sacrifices of righteousness,\" to be of any service, must be accompanied by trust in the Lord. Psalm 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 4:5-6) The address is continued: they are to repent and cleave to Jahve instead of allowing themselves to be carried away by arrogance and discontent. The lxx has rendered it correctly: ὀργίζεσθε καὶ μὴ ἁμαρτάνετε (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): if ye will be angry beware of sinning, viz., backbiting and rebellion (cf. the similar paratactic combinations ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In connection with the rendering contremiscite we feel to miss any expression of that before which they are to tremble (viz., the sure punishment which God decrees). He warns his adversaries against blind passion, and counsels them to quiet converse with their own hearts, and solitary meditation, in order that they may not imperil their own salvation. To commune with one's own heart, without the addition of the object, is equivalent to to think alone by one's self, and the bed or resting-place, without requiring to be understood literally, points to a condition of mind that is favourable to quiet contemplation. The heart is the seat of the conscience, and the Spirit of God (as Hamann, Werke i. 98, observes on this subject) disguises itself as our own voice that we may see His exhortation, His counsel, and His wisdom well up out of our own stony heart. The second imper. continues the first: and cease, prop. be still (דּמם from the sound of the closed mouth checking the discourse), i.e., come to your right mind by self-examination, cease your tumult-a warning coming with the semblance of command by reason of the consciousness of innocence on his part; and this impression has to be rendered here by the striking in of the music. The dehortation passes over into exhortation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of course the sacrifices were continued in the sanctuary while David, with his faithful followers, was a fugitive from Jerusalem. Referring to this, David cries out to the Absolomites: offer זבחי־צדק. Here at least these are not offerings consisting of actions which are in accordance with the will of God, instead of slaughtered animals, but sacrifices offered with a right mind, conformed to the will of God, instead of the hypocritical mind with which they consecrate their evil doings and think to flatter God. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also, \"the sacrifices of righteousness\" are real sacrifices, not merely symbols of moral acts. Not less full of meaning is the exhortation וּבטחוּ אל־ה. The verb בּטח is construed with אל as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", combining with the notion of trusting that of drawing near to, hanging on, attaching one's self to any one. The Arabic word bṭḥ, expandere, has preserved the primary notion of the word, a notion which, as in the synon. Arab. bsṭ, when referred to the effect which is produced on the heart, countenance and whole nature of the man by a joyous cheerful state of mind, passes over to the notion of this state of mind itself, so that בּטח (like the Arab. inbasaṭa to be cheerful, fearless, bold, lit., expanded [cf. רהב ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]  equals  unstraitened) consequently signifies to be courageous, confident. They are to renounce the self-trust which blinds them in their opposition to the king who is deprived of all human assistance. If they will trustingly submit themselves to God, then at the same time the murmuring and rancorous discontent, from which the rebellion has sprung, will be stilled. Thus far the address to the rebellious magnates goes. ",
        "children": []
      }
    ]
  }
]