[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who will . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "how can this ancient Divine oracle be fulfilled now in present circumstances? This is the poet’s question. He may be a king himself eager for triumph, or more probably Israel personified. (See the plural in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 60:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Edom is the particular foe in view, and as the difficulties of the undertaking present themselves, misgivings arise and the assurance gained from the triumphs of olden time turns into prayer, half plaintive, half confident, that the Divine favour and power may be once more on the side of the chosen people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The strong city.—As in the Hebrew the article is wanting, any strongly fortified city might be intended, were it not for the parallelism. Here it must stand for Selah or Petra, the capital of Edom. For its impregnable position (see Note Obadiah 1:3). The question, “Who will lead me into Petra?” is explained by the fact that there are only two possible approaches to the city, each a long narrow tortuous defile, and that the place itself is so buried in its ravines that it cannot be seen from any spot in its neighbourhood far or near.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The strong city.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As in the Hebrew the article is wanting, any strongly fortified city might be intended, were it not for the parallelism. Here it must stand for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Selah ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Petra, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the capital of Edom. For its impregnable position (see Note ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The question, “Who will lead me into Petra?” is explained by the fact that there are only two possible approaches to the city, each a long narrow tortuous defile, and that the place itself is so buried in its ravines that it cannot be seen from any spot in its neighbourhood far or near.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 60:9-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:9-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who will bring me into the strong city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As if he had said, These are difficult things indeed; and I may well ask, when I consider how potent these nations are, By what power shall I enter that strongly fenced city? (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cities ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "rather, the singular number being put for the plural.) Who is it that will conduct me into Idumea, and make me master of it? None can do it but God. Having beaten his enemies out of the field, he desires God’s assistance to take their strong holds, and so secure himself from further attempts. Edom was a high and rocky country, Obadiah ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 60:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", fortified by nature, as well as by art, and therefore not to be subdued without a divine hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wilt not thou, &c., who didst not go out with our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "armies — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Namely, in former times; but now hast graciously returned to us. He brings to his own mind, and to the minds of the people, their former calamities, that they might be more thankful for present mercies and deliverances.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "60:6-12 If Christ be ours, all things, one way or another, shall be for our eternal good. The man who is a new creature in Christ, may rejoice in all the precious promises God has spoken in his holiness. His present privileges, and the sanctifying influences of the Spirit, are sure earnests of heavenly glory. David rejoices in conquering the neighbouring nations, which had been enemies to Israel. The Israel of God are through Christ more than conquerors. Though sometimes they think that the Lord has cast them off, yet he will bring them into the strong city at last. Faith in the promise will assure us that it is our Father's good pleasure to give us the kingdom: But we are not yet made complete conquerors, and no true believer will abuse these truths to indulge sloth, or vain confidence. Hope in God is the best principle of true courage, for what need those fear who have God on their side? All our victories are from him, and while those who willingly submit to our anointed King shall share his glories, all his foes shall be put under his feet.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who will bring me into the strong city? - The strong city - the fenced, the fortified city - referred to here is doubtless the capital of Idumea. This was the celebrated city Petra, situated in the rocks, and so difficult to be taken by an enemy. For a description of it, see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was this city, as the capital of the land of Edom, which David was now so anxious to secure; and he asks, therefore, with interest, who among his captains, his mighty men, would undertake the task of conducting his armies there.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who will lead me into Edom? - Into the capital, and thence into the whole land to subdue it. This was done under the combined command of Joab and Abishai his brother. See the notes at the title to the psalm. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who will lead me into Edom? - Into the capital, and thence into the whole land to subdue it. This was done under the combined command of Joab and Abishai his brother. See the notes at the title to the psalm. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9, 10. He feels assured that, though once angry, God is now ready to favor His people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who will lead me—or, who has led me, as if the work were now begun.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who will lead me—or, who has led me, as if the work were now begun.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9 Who will bring me into the strong city? who will lead me into Edom?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 Wilt not thou, O God, which hadst cast us off? and thou, O God, which didst not go out with our armies?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 60:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As yet the interior fortresses of Edom had not been subdued. Their invading bands had been slain in the valley of salt, and David intended to push his conquests even to Petra the city of the rock, deemed to be impregnable. \"Who will bring me into the strong city?,\" It was all but inaccessible, and hence the question of David. When we have achieved great success it must be a stimulus to greater efforts, but it must not become a reason for self, confidence. We must look to the strong for strength as much at the close of a campaign as at its beginning. \"Who will lead me into Edom?\" High up among the stars stood the city of stone, but God could lead his servant up to it. No heights of grace are too elevated for us, the Lord being our leader, but we must beware of high things attempted in self-reliance. Excelsior is well enough as a cry, but we must look to the highest of all for guidance. Joab could not bring David into Edom. The veterans of the valley of salt could not force the passage, yet was it to be attempted, and David looked to the Lord for help. Heathen nations are yet to be subdued. The-city of the seven hills must yet hear the gospel. Who will give the church the power to accomplish this? The answer is not far to seek.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 60:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Wilt not thou, O God, which hadst cast us off?\" Yes, the chastising God is our only hope. He loves us still. For a small moment does he forsake, but with great mercy does he gather his people. Strong to smite, he is also strong to save. He who proved to us our need of him by showing us what poor creatures we are without him, will now reveal the glory of his help by conducting great enterprises to a noble issue. \"And thou, O God, which didst not go out with out armies?\" The self-same God art thou, and to thee faith cleaves. Though thou slay us, we trust in thee, and look for thy merciful help. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who will bring me?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " None can do it but God, as he declareth in the following verses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Into the strong city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the cities; the singular number for the plural, which is usual. Having beaten his enemies out of the field, and into their strong cities, from whence they hoped to renew the war, he desires God’s assistance, whereby he may take their strong holds, and so secure himself from further attempts against him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Into Edom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was a high and rocky country, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Obadiah 1:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", fortified by nature as well as by art, and therefore not to be invaded and subdued without a Divine hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who will bring me into the strong city?.... Which some understand of Rabbah of the Ammonites, which Joab besieged, and sent to David to come and take it in person, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Targum interprets it of Tyre, which was a strong fortified city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It rather seems to be the same with Edom, or the metropolis of the Edomites; since it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who will lead me into Edom? which was situated in the clefts of the rock, and on the height of the hill, Jeremiah 49:16; but is mystically to be understood of the city of Rome, the great and mighty city, as it is often called in the book of the Revelation, Revelation 11:8; whose destruction is certain, being predicted; and after which there have been desires raised in the hearts of God's people in all ages; and particularly just before the time God will put it into the hearts of the kings of the earth to burn it with fire; who are here represented by David, as desirous of entering into it in triumph to destroy it, Revelation 17:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who will lead me into Edom? which was situated in the clefts of the rock, and on the height of the hill, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but is mystically to be understood of the city of Rome, the great and mighty city, as it is often called in the book of the Revelation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; whose destruction is certain, being predicted; and after which there have been desires raised in the hearts of God's people in all ages; and particularly just before the time God will put it into the hearts of the kings of the earth to burn it with fire; who are here represented by David, as desirous of entering into it in triumph to destroy it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 17:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who will bring me into the {m} strong city? who will lead me into Edom?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who will bring me ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "into",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " strong city? who will lead me into Edom?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) He was assured that God would give him the strong cities of his enemies, in which they thought themselves sure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the strong city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Probably Sela or Petra, the capital of Edom, famous for its inaccessibility (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). See Stanley’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sinai and Pal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., p. 89, for a description of the wonderful defile, which in ancient times was the only usual approach to Petra.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who will lead me into Edom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The verb is in the perfect tense, which is sometimes used in questions to express a sense of difficulty or hopelessness. Who could lead me, or, who could have led me, right into (the preposition is emphatic) Edom? The difficulties are almost insuperable. But possibly the text is faulty. The restoration of one letter with a change in the vocalisation would give the future tense. In any case the rendering of R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who hath led me unto Edom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? as a reference to some previous successful invasion, does not suit the context.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9–12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". None but God can give help, and though for the moment He has abandoned His people, He will surely once more lead them to victory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9-12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Rehearsal of God's promises has raised the psalmist out of despondency, and he can now confidently call God to his assistance. Edom is to be conquered, for so God has premised (ver. 8). But how? Who will lead out Israel's armies? Will God, who has lately \"cast Israel off\"? If not, it must he man. But \"vain is the help of man\" (ver. 11). So the call is made that God will give help in the trouble - and with the call comes full confidence - and the triumphant cry goes forth, \"Through God we shall do valiantly; for  he it is that shall tread down our enemies\" (ver. 12). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who will bring me into the strong city?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"strong city\" of Edom was Sela, \"The Cliff\" - now Petra. And it was a city of enormous strength, rock hewn in the main, and guarded by frightful precipices. Who will conduct me through its strong natural and artificial defences, and give me possession of the place? ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who will lead me into Edom?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Who will even bring me into the country? The Edomites, flushed with their recent victory, will, of course, dispute my entrance. Who will enable me to overcome their resistance? Psalm 60:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The third strophe reverts to prayer; but the prayer now breathes more freely with a self-conscious courage for the strife. The fortified city (עיר מצור) is not Rabbath Ammon; but, as becomes evident from the parallel member of the verse and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Idumaean chief city of Sela' (סלע) or Petra (vid., Knobel on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 36:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " together with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The wish: who will conduct me  equals  Oh that one would conduct me (Ges. 136, 1)! expresses a martial desire, joyful at the prospect of victory; concerning מי נחני, quis perduxerit me, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What follows is not now to be rendered: Not Thou (who but Thou), Elohim, who...(Hitzig) - for in order to have been understood thus and not as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 60:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the poet could not have omitted אשׁר - on the contrary, the interrogatory הלא is the foundation on which the supplicatory הבה is raised. The king of Israel is hard pressed in the battle, but he knows that victory comes from above, from the God who has hitherto in anger refused it to His people, inasmuch as He has given power to Edom to break through the defensive forces of Israel (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). עזרת (not עזרת  equals  עזרה) is, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 108:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to עזרתה. The view that it is equal to עזרתי, the suffix being cast away, is not confirmed in this instance, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". How vain is human succour, has been seen only very recently in the case of the kings of Zobah and Ammon, who have succumbed in spite of their confederates. Israel prays for its victorious power from above, and also obtains it thence, as is most confidently expressed in v. 14. עשׂה חיל, to do valiantly, to show valour, is equivalent to: to be victorious, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In God does Israel conquer, and God, who is in Israel, will by means of Israel tread down Edom in accordance with its deserts. ",
        "children": []
      }
    ]
  }
]