[{"num":16,"verse":"Now Korah son of Izhar, the son of Kohath, the son of Levi, with Dathan and Abiram sons of Eliab, and On son of Peleth, sons of Reuben, took men,"},{"num":2,"verse":"And they rose up before Moses, with certain of the Israelites, 250 princes or leaders of the congregation called to the assembly, men well known and of distinction."},{"num":3,"verse":"And they gathered together against Moses and Aaron, and said to them, [Enough of you!] You take too much upon yourselves, seeing that all the congregation is holy, every one of them, and the Lord is among them. Why then do you lift yourselves up above the assembly of the Lord?"},{"num":4,"verse":"And when Moses heard it, he fell upon his face."},{"num":5,"verse":"And he said to Korah and all his company, In the morning the Lord will show who are His and who is holy, and will cause him to come near to Him; him whom He has chosen will He cause to come near to Him."},{"num":6,"verse":"Do this: Take censers, Korah and all your company,"},{"num":7,"verse":"And put fire in them and put incense upon them before the Lord tomorrow; and the man whom the Lord chooses shall be holy. You take too much upon yourselves, you sons of Levi."},{"num":8,"verse":"And Moses said to Korah, Hear, I pray you, you sons of Levi:"},{"num":9,"verse":"Does it seem but a small thing to you that the God of Israel has separated you from the congregation of Israel, to bring you near to Himself to do the service of the tabernacle of the Lord and to stand before the congregation to minister to them,"},{"num":10,"verse":"And that He has brought you near to Him, and all your brethren the sons of Levi with you? Would you seek the priesthood also?"},{"num":11,"verse":"Therefore you and all your company are gathered together against the Lord. And Aaron, what is he that you murmur against him?"},{"num":12,"verse":"And Moses sent to call Dathan and Abiram, the sons of Eliab, and they said, We will not come up."},{"num":13,"verse":"Is it a small thing that you have brought us up out of a land flowing with milk and honey to kill us in the wilderness, but you must also make yourself a prince over us?"},{"num":14,"verse":"Moreover, you have not brought us into a land that flows with milk and honey or given us an inheritance of fields and vineyards. Will you bore out the eyes of these men? We will not come up!"},{"num":15,"verse":"And Moses was very angry and said to the Lord, Do not respect their offering! I have not taken one donkey from them, nor have I hurt one of them."},{"num":16,"verse":"And Moses said to Korah, You and all your company be before the Lord tomorrow, you and they and Aaron."},{"num":17,"verse":"And let every man take his censer and put incense upon it and bring before the Lord every man his censer, 250 censers; you also and Aaron, each his censer."},{"num":18,"verse":"So they took every man his censer, and they put fire in them and laid incense upon it, and they stood at the entrance of the Tent of Meeting with Moses and Aaron."},{"num":19,"verse":"Then Korah assembled all the congregation against Moses and Aaron before the entrance of the Tent of Meeting, and the glory of the Lord appeared to all the congregation."},{"num":20,"verse":"And the Lord said to Moses and Aaron,"},{"num":21,"verse":"Separate yourselves from among this congregation, that I may consume them in a moment."},{"num":22,"verse":"And they fell upon their faces, and said, O God, the God of the spirits of all flesh, shall one man sin and will You be angry with all the congregation?"},{"num":23,"verse":"And the Lord said to Moses,"},{"num":24,"verse":"Say to the congregation, Get away from around the tents of Korah, Dathan, and Abiram."},{"num":25,"verse":"Then Moses rose up and went to Dathan and Abiram, and the elders of Israel followed him."},{"num":26,"verse":"And he said to the congregation, Depart, I pray you, from the tents of these wicked men, and touch nothing of theirs, lest you be consumed in all their sins."},{"num":27,"verse":"So they got away from around the tents of Korah, Dathan, and Abiram. And Dathan and Abiram came out and stood in the door of their tents with their wives, and their sons, and their little ones."},{"num":28,"verse":"And Moses said, By this you shall know that the Lord has sent me to do all these works, for I do not act of my own accord:"},{"num":29,"verse":"If these men die the common death of all men or if [only] what happens to everyone happens to them, then the Lord has not sent me."},{"num":30,"verse":"But if the Lord causes a new thing [to happen], and the earth opens its mouth and swallows them up, with all that belongs to them, and they go down alive into Sheol (the place of the dead), then you shall understand that these men have provoked (spurned, despised) the Lord!"},{"num":31,"verse":"As soon as he stopped speaking, the ground under the offenders split apart"},{"num":32,"verse":"And the earth opened its mouth and swallowed them and their households and [Korah and] all [his] men and all their possessions."},{"num":33,"verse":"They and all that belonged to them went down alive into Sheol (the place of the dead); and the earth closed upon them, and they perished from among the assembly."},{"num":34,"verse":"And all Israel who were round about them fled at their cry, for they said, Lest the earth swallow us up also."},{"num":35,"verse":"And fire came forth from the Lord and devoured the 250 men who offered the incense."},{"num":36,"verse":"And the Lord said to Moses,"},{"num":37,"verse":"Speak to Eleazar son of Aaron, the priest, that he take up the censers out of the burning and scatter the fire at a distance. For the censers are hallowed—"},{"num":38,"verse":"The censers of these men who have sinned against themselves and at the cost of their own lives. Let the censers be made into hammered plates for a covering of the altar [of burnt offering], for they were used in offering before the Lord and therefore they are sacred. They shall be a sign [of warning] to the Israelites."},{"num":39,"verse":"Eleazar the priest took the bronze censers with which the Levites who were burned had offered incense, and they were hammered into broad sheets for a covering of the [brazen] altar [of burnt offering],"},{"num":40,"verse":"To be a memorial [a warning forever] to the Israelites, so that no outsider, that is, no one not of the descendants of Aaron, should come near to offer incense before the Lord, lest he become as Korah and as his company, as the Lord said to Eleazar through Moses."},{"num":41,"verse":"But on the morrow all the congregation of the Israelites murmured against Moses and Aaron, saying, You have killed the people of the Lord."},{"num":42,"verse":"When the congregation was gathered against Moses and Aaron, they looked at the Tent of Meeting, and behold, the cloud covered it and they saw the Lord’s glory."},{"num":43,"verse":"And Moses and Aaron came to the front of the Tent of Meeting."},{"num":44,"verse":"And the Lord said to Moses,"},{"num":45,"verse":"Get away from among this congregation, that I may consume them in a moment. And Moses and Aaron fell on their faces."},{"num":46,"verse":"And Moses said to Aaron, Take a censer and put fire in it from off the altar and lay incense on it, and carry it quickly to the congregation and make atonement for them. For there is wrath gone out from the Lord; the plague has begun!"},{"num":47,"verse":"So Aaron took the burning censer as Moses commanded, and ran into the midst of the congregation; and behold, the plague was begun among the people; and he put on the incense and made atonement for the people."},{"num":48,"verse":"And he stood between the dead and the living, and the plague was stayed."},{"num":49,"verse":"Now those who died in the plague were 14,700, besides those who died in the matter of Korah."},{"num":50,"verse":"And Aaron returned to Moses to the door of the Tent of Meeting, since the plague was stayed."}]