[{"header":"Korah, Dathan and Abiram"},{"num":16,"verse":"Korah was the son of Izhar, the son of Kohath. Kohath was the son of Levi. Korah and certain men from the tribe of Reuben turned against Moses. The men from Reuben were Dathan, Abiram and On. Dathan and Abiram were the sons of Eliab. On was the son of Peleth. "},{"num":2,"verse":"All those men rose up against Moses. And 250 men of Israel joined them. All of them were known as leaders in the community. They had been appointed as members of the ruling body. "},{"num":3,"verse":"They came as a group to oppose Moses and Aaron. They said to Moses and Aaron, “You have gone too far! The whole community is holy. Every one in it is holy. And the Lord is with them. So why do you put yourselves above the Lord’s people?”"},{"num":4,"verse":"When Moses heard what they said, he fell with his face to the ground. "},{"num":5,"verse":"Then he spoke to Korah and all his followers. He said, “In the morning the Lord will show who belongs to him. He will show who is holy. He’ll bring that person near him. He’ll bring the man he chooses near him. "},{"num":6,"verse":"Korah, here’s what you and all your followers must do. Get some shallow cups for burning incense. "},{"num":7,"verse":"Tomorrow put burning coals and incense in them. Offer it to the Lord. The man the Lord chooses will be the one who is holy. You Levites have gone too far!”"},{"num":8,"verse":"Moses also said to Korah, “Listen, you Levites! "},{"num":9,"verse":"The God of Israel has separated you from the rest of the community of Israel. He has brought you near him to work at the Lord’s holy tent. He has given you to the people so that you can serve them. Isn’t all that enough for you? "},{"num":10,"verse":"He has already brought you and all the other Levites near him. But now you want to be priests too. "},{"num":11,"verse":"You and all your followers have joined together against the Lord. Why are you telling Aaron you aren’t happy with him?”"},{"num":12,"verse":"Then Moses sent for Dathan and Abiram, the sons of Eliab. But they said, “We won’t come! "},{"num":13,"verse":"You have brought us up out of a land that has plenty of milk and honey. You have brought us here to kill us in this desert. Isn’t that enough? Now do you also want to act as if you were ruling over us? "},{"num":14,"verse":"Besides, you haven’t brought us into a land that has plenty of milk and honey. You haven’t given us fields and vineyards of our own. Do you want to treat these men like slaves? No! We won’t come!”"},{"num":15,"verse":"Then Moses became very angry. He said to the Lord, “Don’t accept their offering. I haven’t taken even a donkey from them. In fact, I haven’t done anything wrong to any of them.”"},{"num":16,"verse":"Moses said to Korah, “You and all your followers must stand in front of the Lord tomorrow. You must appear there along with Aaron. "},{"num":17,"verse":"Each man must get his shallow cup. He must put incense in it. There will be a total of 250 incense cups. Each man must bring his cup to the Lord. You and Aaron must also bring your cups.” "},{"num":18,"verse":"So each of them got his cup. He put burning coals and incense in it. All the men came with Moses and Aaron. They stood at the entrance to the tent of meeting. "},{"num":19,"verse":"Korah gathered all his followers together at the entrance to the tent. They opposed Moses and Aaron. Then the glory of the Lord appeared to the whole community. "},{"num":20,"verse":"The Lord said to Moses and Aaron, "},{"num":21,"verse":"“Separate yourselves from these people. Then I can put an end to all of them at once.”"},{"num":22,"verse":"But Moses and Aaron fell with their faces to the ground. They cried out, “God, you are the God who gives life and breath to all living things. Will you be angry with the whole community when only one man sins?”"},{"num":23,"verse":"Then the Lord spoke to Moses. He said, "},{"num":24,"verse":"“Tell the community, ‘Move away from the tents of Korah, Dathan and Abiram.’ ”"},{"num":25,"verse":"Moses got up. He went to Dathan and Abiram. The elders of Israel followed him. "},{"num":26,"verse":"Moses warned the community. He said, “Move away from the tents of these evil men! Don’t touch anything that belongs to them. If you do, the Lord will sweep you away because of all their sins.” "},{"num":27,"verse":"So they moved away from the tents of Korah, Dathan and Abiram. Dathan and Abiram had already come out. They were standing at the entrances to their tents. Their wives, children and little ones were standing there with them."},{"num":28,"verse":"Then Moses said, “What is about to happen wasn’t my idea. The Lord has sent me to do everything I’m doing. Here is how you will know I’m telling you the truth. "},{"num":29,"verse":"These men won’t die a natural death. Something will happen to them that doesn’t usually happen to people. If what I’m telling you doesn’t happen, then you will know that the Lord hasn’t sent me. "},{"num":30,"verse":"But the Lord will make something totally new happen. The ground will open its mouth and swallow them up. It will swallow up everything that belongs to them. They will be buried alive. When that happens, you will know that these men have disrespected the Lord.”"},{"num":31,"verse":"As soon as Moses finished saying all these words, what he had said came true. The ground under them broke open. "},{"num":32,"verse":"It opened its mouth. It swallowed up those men. In fact, it swallowed up everyone who lived in their houses. It swallowed all Korah’s men. And it swallowed up everything they owned. "},{"num":33,"verse":"They went down into the grave alive. Everything they owned went down with them. The ground closed over them and they died. And so they disappeared from the community. "},{"num":34,"verse":"All the Israelites around them heard their cries. They ran away from them. They shouted, “The ground is going to swallow us up too!”"},{"num":35,"verse":"Then the Lord sent down fire. It burned up the 250 men offering the incense."},{"num":36,"verse":"The Lord said to Moses, "},{"num":37,"verse":"“Speak to Eleazar the priest. He is the son of Aaron. Remind him that the shallow cups are holy. He must take them out of the ashes. He must scatter the burning coals away from there. "},{"num":38,"verse":"The men who sinned used those cups. And it cost them their lives. Hammer the cups into bronze sheets that will cover the altar. The cups were offered to the Lord. They have become holy. Let them serve as a warning to the Israelites.”"},{"num":39,"verse":"So the priest Eleazar collected the bronze incense cups. They had been brought by the men who had been burned to death. He had them hammered out to cover the altar. "},{"num":40,"verse":"He did just as the Lord had directed Moses to tell him to do. The covering would be a reminder to the Israelites. It would remind them that no one except a son of Aaron should come and burn incense to the Lord. If people other than priests did that, they would become like Korah and his followers."},{"num":41,"verse":"The next day the whole community of Israel told Moses and Aaron they weren’t happy with them. “You have killed the Lord’s people,” they said."},{"num":42,"verse":"The community gathered together to oppose Moses and Aaron. The people walked toward the tent of meeting. Suddenly the cloud covered it. The glory of the Lord appeared. "},{"num":43,"verse":"Then Moses and Aaron went to the front of the tent of meeting. "},{"num":44,"verse":"The Lord said to Moses, "},{"num":45,"verse":"“Get away from these people. Then I can put an end to all of them at once.” And Moses and Aaron fell with their faces to the ground."},{"num":46,"verse":"Moses said to Aaron, “Take your incense cup. Put incense in it. And put burning coals from the altar in it. Then hurry to the people and pay for their sin. The Lord has begun to show his anger. The plague has started.” "},{"num":47,"verse":"So Aaron did as Moses said. He ran in among the people. The plague had already started among them. But Aaron offered the incense and paid for their sin. "},{"num":48,"verse":"He stood between those alive and those dead. And the plague stopped. "},{"num":49,"verse":"But 14,700 people died from the plague. That doesn’t include those who had died because of what Korah did. "},{"num":50,"verse":"Then Aaron returned to Moses at the entrance to the tent of meeting. The plague had stopped."}]