[{"header":"Pharaoh Pursues Israel"},{"num":14,"verse":"Then the Lord said to Moses, "},{"num":2,"verse":"“Tell the Israelites to go back and set up their camp facing Pi Hahiroth, between Migdol and the sea. Set up your camp facing north—by the sea. "},{"num":3,"verse":"Pharaoh will think, ‘The Israelites are ⌞just⌟ wandering around. The desert is blocking their escape.’ "},{"num":4,"verse":"I will make Pharaoh so stubborn that he will pursue them. Then, because of what I do to Pharaoh and his entire army, I will receive honor, and the Egyptians will know that I am the Lord.” So that is what the Israelites did."},{"num":5,"verse":"When Pharaoh (the king of Egypt) was told that the people had fled, he and his officials changed their minds about them. They said, “What have we done? We’ve lost our slaves because we’ve let Israel go.” "},{"num":6,"verse":"So Pharaoh prepared his chariot and took his army with him. "},{"num":7,"verse":"He took 600 of his best chariots as well as all the other chariots in Egypt, placing an officer in each of them. "},{"num":8,"verse":"The Lord made Pharaoh (the king of Egypt) so stubborn that he pursued the Israelites, who were boldly leaving Egypt. "},{"num":9,"verse":"The Egyptians pursued the Israelites. Pharaoh’s army, including all his horse-drawn chariots and cavalry, caught up with them as they were setting up their camp by the sea at Pi Hahiroth facing north."},{"num":10,"verse":"As Pharaoh approached, the Israelites looked up and saw that the Egyptians were coming after them. Terrified, the Israelites cried out to the Lord. "},{"num":11,"verse":"They said to Moses, “Did you bring us out into the desert to die because there were no graves in Egypt? Look what you’ve done by bringing us out of Egypt! "},{"num":12,"verse":"Didn’t we tell you in Egypt, ‘Leave us alone! Let us go on serving the Egyptians’? It would have been better for us to serve the Egyptians than to die in the desert!”"},{"header":"The Lord Divides the Red Sea"},{"num":13,"verse":"Moses answered the people, “Don’t be afraid! Stand still, and see what the Lord will do to save you today. You will never see these Egyptians again. "},{"num":14,"verse":"The Lord is fighting for you! So be still!”"},{"num":15,"verse":"Then the Lord said to Moses, “Why are you crying out to me? Tell the Israelites to start moving. "},{"num":16,"verse":"Raise your staff, stretch out your hand over the sea, and divide the water. Then the Israelites will go through the sea on dry ground. "},{"num":17,"verse":"I am making the Egyptians so stubborn that they will follow the Israelites. I will receive honor because of what I will do to Pharaoh, his entire army, his chariots, and cavalry. "},{"num":18,"verse":"The Egyptians will know that I am the Lord when I am honored for what I did to Pharaoh, his chariots, and his cavalry.”"},{"num":19,"verse":"The Messenger of God, who had been in front of the Israelites, moved behind them. So the column of smoke moved from in front of the Israelites and stood behind them "},{"num":20,"verse":"between the Egyptian camp and the Israelite camp. The ⌞column of⌟ smoke was there when darkness came, and it lit up the night. Neither side came near the other all night long."},{"num":21,"verse":"Then Moses stretched out his hand over the sea. All that night the Lord pushed back the sea with a strong east wind and turned the sea into dry ground. The water divided, "},{"num":22,"verse":"and the Israelites went through the middle of the sea on dry ground. The water stood like a wall on their right and on their left."},{"num":23,"verse":"The Egyptians pursued them, and all Pharaoh’s horses, chariots, and cavalry followed them into the sea. "},{"num":24,"verse":"Just before dawn, the Lord looked down from the column of fire and smoke and threw the Egyptian camp into a panic. "},{"num":25,"verse":"He made the wheels of their chariots come off so that they could hardly move. Then the Egyptians shouted, “Let’s get out of here! The Lord is fighting for Israel! He’s against us!”"},{"num":26,"verse":"Then the Lord said to Moses, “Stretch out your hand over the sea so that the water will flow back over the Egyptians, their chariots, and their cavalry.”"},{"num":27,"verse":"Moses stretched his hand over the sea, and at daybreak the water returned to its usual place. The Egyptians tried to escape, but the Lord swept them into the sea. "},{"num":28,"verse":"The water flowed back and covered Pharaoh’s entire army, as well as the chariots and the cavalry that had followed Israel into the sea. Not one of them survived."},{"num":29,"verse":"Meanwhile, the Israelites had gone through the sea on dry ground while the water stood like a wall on their right and on their left. "},{"num":30,"verse":"That day the Lord saved Israel from the Egyptians, and Israel saw the Egyptians lying dead on the seashore. "},{"num":31,"verse":"When the Israelites saw the great power the Lord had used against the Egyptians, they feared the Lord and believed in him and in his servant Moses."}]