[{"num":14,"verse":"Then the Lord said to Moses, "},{"num":2,"verse":"“Tell the Israelites to turn back to Pi Hahiroth and to camp between Migdol and the Red Sea. Camp across from Baal Zephon, on the shore of the sea. "},{"num":3,"verse":"The king will think, ‘The Israelites are lost, trapped by the desert.’ "},{"num":4,"verse":"I will make the king stubborn again so he will chase after them, but I will defeat the king and his army. This will bring honor to me, and the Egyptians will know that I am the Lord.” The Israelites did just as they were told."},{"header":"The King Chases the Israelites"},{"num":5,"verse":"When the king of Egypt was told that the Israelites had left, he and his officers changed their minds about them. They said, “What have we done? We have let the Israelites leave. We have lost our slaves!” "},{"num":6,"verse":"So the king prepared his war chariot and took his army with him. "},{"num":7,"verse":"He took six hundred of his best chariots, together with all the other chariots of Egypt, each with an officer in it. "},{"num":8,"verse":"The Lord made the king of Egypt stubborn, so he chased the Israelites, who were leaving victoriously. "},{"num":9,"verse":"The Egyptians—with all the king’s horses, chariot drivers, and army—chased the Israelites. They caught up with them while they were camped by the Red Sea, near Pi Hahiroth and Baal Zephon."},{"num":10,"verse":"When the Israelites saw the king and his army coming after them, they were very frightened and cried to the Lord for help. "},{"num":11,"verse":"They said to Moses, “What have you done to us? Why did you bring us out of Egypt to die in the desert? There were plenty of graves for us in Egypt. "},{"num":12,"verse":"We told you in Egypt, ‘Let us alone; we will stay and serve the Egyptians.’ Now we will die in the desert.”"},{"num":13,"verse":"But Moses answered, “Don’t be afraid! Stand still and you will see the Lord save you today. You will never see these Egyptians again after today. "},{"num":14,"verse":"You only need to remain calm; the Lord will fight for you.”"},{"num":15,"verse":"Then the Lord said to Moses, “Why are you crying out to me? Command the Israelites to start moving. "},{"num":16,"verse":"Raise your walking stick and hold it over the sea so that the sea will split and the people can cross it on dry land. "},{"num":17,"verse":"I will make the Egyptians stubborn so they will chase the Israelites, but I will be honored when I defeat the king and all of his chariot drivers and chariots. "},{"num":18,"verse":"When I defeat the king, his chariot drivers, and chariots, the Egyptians will know that I am the Lord.”"},{"num":19,"verse":"Now the angel of God that usually traveled in front of Israel’s army moved behind them. Also, the pillar of cloud moved from in front of the people and stood behind them. "},{"num":20,"verse":"So the cloud came between the Egyptians and the Israelites. This made it dark for the Egyptians but gave light to the Israelites. So the cloud kept the two armies apart all night."},{"num":21,"verse":"Then Moses held his hand over the sea. All that night the Lord drove back the sea with a strong east wind, making the sea become dry ground. The water was split, "},{"num":22,"verse":"and the Israelites went through the sea on dry land, with a wall of water on their right and on their left."},{"num":23,"verse":"Then all the king’s horses, chariots, and chariot drivers followed them into the sea. "},{"num":24,"verse":"When morning came, the Lord looked down from the pillar of cloud and fire at the Egyptian army and made them panic. "},{"num":25,"verse":"He kept the wheels of the chariots from turning, making it hard to drive the chariots. The Egyptians shouted, “Let’s get away from the Israelites! The Lord is fighting for them and against Egypt.”"},{"num":26,"verse":"Then the Lord told Moses, “Hold your hand over the sea so that the water will come back over the Egyptians, their chariots, and chariot drivers.” "},{"num":27,"verse":"So Moses raised his hand over the sea, and at dawn the sea returned to its place. The Egyptians tried to run from it, but the Lord swept them away into the sea. "},{"num":28,"verse":"The water returned, covering the chariots, chariot drivers, and all the king’s army that had followed the Israelites into the sea. Not one of them survived."},{"num":29,"verse":"But the Israelites crossed the sea on dry land, with a wall of water on their right and on their left. "},{"num":30,"verse":"So that day the Lord saved the Israelites from the Egyptians, and the Israelites saw the Egyptians lying dead on the seashore. "},{"num":31,"verse":"When the Israelites saw the great power the Lord had used against the Egyptians, they feared the Lord, and they trusted him and his servant Moses."}]