[{"header":"Paul in Ephesus"},{"num":19,"verse":"While Apollos was in the city of Corinth, Paul was visiting some places on his way to Ephesus. In Ephesus he found some other followers of the Lord."},{"num":2,"verse":"He asked them, “Did you receive the Holy Spirit when you believed?”"},{"num":3,"verse":"Paul asked them, “So what kind of baptism did you have?”"},{"num":4,"verse":"Paul said, “John told people to be baptized to show they wanted to change their lives. He told people to believe in the one who would come after him, and that one is Jesus.”"},{"num":5,"verse":"When these followers heard this, they were baptized in the name of the Lord Jesus."},{"num":6,"verse":"Then Paul laid his hands on them, and the Holy Spirit came on them. They began speaking different languages and prophesying."},{"num":7,"verse":"There were about twelve men in this group."},{"num":8,"verse":"Paul went into the synagogue and spoke very boldly. He continued doing this for three months. He talked with the Jews, trying to persuade them to accept what he was telling them about God’s kingdom."},{"num":9,"verse":"But some of them became stubborn and refused to believe. In front of everyone, they said bad things about the Way. So Paul left these Jews and took the Lord’s followers with him. He went to a place where a man named Tyrannus had a school. There Paul talked with people every day."},{"num":10,"verse":"He did this for two years. Because of this work, everyone in Asia, Jews and Greeks, heard the word of the Lord."},{"header":"The Sons of Sceva"},{"num":11,"verse":"God used Paul to do some very special miracles."},{"num":12,"verse":"Some people carried away handkerchiefs and clothes that Paul had used and put them on those who were sick. The sick people were healed, and evil spirits left them."},{"num":13,"verse":"Some Jews also were traveling around forcing evil spirits out of people. The seven sons of Sceva, one of the leading priests, were doing this. These Jews tried to use the name of the Lord Jesus to make the evil spirits go out of people. They all said, “By the same Jesus that Paul talks about, I order you to come out!”"},{"num":15,"verse":"But one time an evil spirit said to these Jews, “I know Jesus, and I know about Paul, but who are you?”"},{"num":16,"verse":"Then the man who had the evil spirit inside him jumped on these Jews. He was much stronger than all of them. He beat them up and tore their clothes off. They all ran away from that house."},{"num":17,"verse":"All the people in Ephesus, Jews and Greeks, learned about this. They were all filled with fear and gave great honor to the Lord Jesus."},{"num":18,"verse":"Many of the believers began to confess, telling about all the evil things they had done."},{"num":19,"verse":"Some of them had used magic. These believers brought their magic books and burned them before everyone. These books were worth about 50,000 silver coins."},{"num":20,"verse":"This is how the word of the Lord was spreading in a powerful way, causing more and more people to believe."},{"header":"Paul Plans a Trip"},{"num":21,"verse":"After this, Paul made plans to go to Jerusalem. He planned to go through the regions of Macedonia and Achaia, and then go to Jerusalem. He thought, “After I visit Jerusalem, I must also visit Rome.”"},{"num":22,"verse":"Timothy and Erastus were two of his helpers. Paul sent them ahead to Macedonia. But he stayed in Asia for a while."},{"header":"Trouble in Ephesus"},{"num":23,"verse":"But during that time there was some trouble in Ephesus about the Way. This is how it all happened:"},{"num":24,"verse":"There was a man named Demetrius. He worked with silver. He made little silver models that looked like the temple of the goddess Artemis. The men who did this work made a lot of money."},{"num":25,"verse":"Demetrius had a meeting with these men and some others who did the same kind of work. He told them, “Men, you know that we make a lot of money from our business."},{"num":26,"verse":"But look at what this man Paul is doing. Listen to what he is saying. He has convinced many people in Ephesus and all over Asia to change their religion. He says the gods that people make by hand are not real."},{"num":27,"verse":"I’m afraid this is going to turn people against our business. But there is also another problem. People will begin to think that the temple of the great goddess Artemis is not important. Her greatness will be destroyed. And Artemis is the goddess that everyone in Asia and the whole world worships.”"},{"num":28,"verse":"When the men heard this, they became very angry. They shouted, “Great is Artemis, the goddess of Ephesus!”"},{"num":29,"verse":"The whole city was thrown into confusion. The people grabbed Gaius and Aristarchus, men from Macedonia who were traveling with Paul, and rushed all together into the stadium."},{"num":30,"verse":"Paul wanted to go in and talk to the people, but the Lord’s followers did not let him go."},{"num":31,"verse":"Also, some leaders of the country who were friends of Paul sent him a message telling him not to go into the stadium."},{"num":32,"verse":"Some people were shouting one thing and others were shouting something else. The meeting was very confused. Most of the people did not know why they had come there."},{"num":33,"verse":"Some Jews made a man named Alexander stand before the crowd, and they told him what to say. Alexander waved his hand, trying to explain things to the people."},{"num":34,"verse":"But when the people saw that Alexander was a Jew, they all began shouting the same thing. For two hours they continued shouting, “Great is Artemis of Ephesus! Great is Artemis of Ephesus! Great is Artemis …!”"},{"num":35,"verse":"Then the city clerk persuaded the people to be quiet. He said, “Men of Ephesus, everyone knows that Ephesus is the city that keeps the temple of the great goddess Artemis. Everyone knows that we also keep her holy rock."},{"num":36,"verse":"No one can deny this, so you should be quiet. You must stop and think before you do anything else."},{"num":37,"verse":"“You brought these men here, but they have not said anything bad against our goddess. They have not stolen anything from her temple."},{"num":38,"verse":"We have courts of law and there are judges. Do Demetrius and those men who work with him have a charge against anyone? They should go to the courts. Let them argue with each other there."},{"num":39,"verse":"“Is there something else you want to talk about? Then come to the regular town meeting of the people. It can be decided there."},{"num":40,"verse":"I say this because someone might see this trouble today and say we are rioting. We could not explain all this trouble, because there is no real reason for this meeting.”"},{"num":41,"verse":"After the city clerk said this, he told the people to go home."}]