[[],[{"type":"header","content":"Ish-bosheth Murdered"},{"type":"prose","content":"When Saul’s son Ish-bosheth [king of Israel], heard that Abner had died in Hebron, he lost courage, and all Israel was horrified. "}],[{"type":"prose","content":"Saul’s son had two men who were commanders of [raiding] bands [of soldiers]. One was named Baanah and the other Rechab, the sons of Rimmon the Beerothite of the sons (tribe) of Benjamin for Beeroth is also considered part of [the tribe of] Benjamin, "}],[{"type":"prose","content":"and the Beerothites fled to Gittaim, and have been resident aliens there to this day."}],[{"type":"prose","content":"Jonathan, Saul’s son, had a son whose feet were crippled. He was five years old when the news [of the deaths] of Saul and Jonathan came from Jezreel. And the boy’s nurse picked him up and fled; but it happened that while she was hurrying to flee, he fell and became lame. His name was Mephibosheth."}],[{"type":"prose","content":"So the sons of Rimmon the Beerothite, Rechab and Baanah, left and came to the house of Ish-bosheth in the heat of the day while he was taking his midday rest. "}],[{"type":"prose","content":"They came into the interior of the house as if to get wheat [for the soldiers], and they struck him in the stomach. Then Rechab and Baanah his brother escaped [unnoticed]. "}],[{"type":"prose","content":"Now when they entered the house he was lying on his bed in his bedroom. They [not only] struck and killed him, [but] they also beheaded him. Then they took his head and traveled all night by way of the Arabah. "}],[{"type":"prose","content":"They brought the head of Ish-bosheth to David at Hebron, and said to the king, “Look, the head of Ish-bosheth the son of Saul, your enemy, who sought your life; thus the  has granted my lord the king vengeance this day on Saul and on his descendants.”"}],[{"type":"prose","content":"David replied to Rechab and Baanah his brother, the sons of Rimmon the Beerothite, and said to them, “As the  lives, who has redeemed my life from every adversity, "}],[{"type":"prose","content":"when a man told me, ‘Behold, Saul is dead,’ thinking that he was bringing good news, I seized and killed him in Ziklag, to reward him for his news. "}],[{"type":"prose","content":"How much more, when wicked men have killed a righteous  just man in his own house on his bed, shall I not require his blood from your hand and remove you from the earth?” "}],[{"type":"prose","content":"So David commanded his young men, and they killed them and cut off their hands and feet and hung them beside the pool in Hebron. But they took Ish-bosheth’s head and buried it in Hebron in the tomb of Abner [his relative]."}]]