[{"num":4,"verse":"When Ish-bosheth, Saul’s son [king over Israel], heard that Abner was dead in Hebron, his courage failed, and all the Israelites were troubled and dismayed."},{"num":2,"verse":"Saul’s son had two men who were captains of raiding bands. One was named Baanah and the other Rechab, sons of Rimmon the Beerothite of Benjamin—for Beeroth also was reckoned to Benjamin,"},{"num":3,"verse":"And the Beerothites fled to Gittaim and have been sojourners there to this day."},{"num":4,"verse":"Jonathan, Saul’s son, had a son who was a cripple in his feet. He was five years old when the news came out of Jezreel [of the deaths] of Saul and Jonathan. And the boy’s nurse took him up and fled; and in her haste, he fell and became lame. His name was Mephibosheth."},{"num":5,"verse":"Now the sons of Rimmon the Beerothite, Rechab and Baanah, went about in the heat of the day to the house of Ish-bosheth, who lay resting on his bed at noon."},{"num":6,"verse":"And they came into the interior of the house as though they were delivering wheat, and they smote him in the body; and Rechab and Baanah his brother escaped."},{"num":7,"verse":"Now when they had come into the house and he lay on his bed in his bedroom, they [not only] smote and slew him, [but] beheaded him and took his head and went by the way of the plain all night."},{"num":8,"verse":"And they brought the head of Ish-bosheth to David at Hebron and said to the king, Behold, the head of Ish-bosheth son of Saul, your enemy, who sought your life; and the Lord has avenged my lord the king this day on Saul and on his offspring."},{"num":9,"verse":"And David answered Rechab and Baanah his brother, sons of Rimmon the Beerothite, As the Lord lives, Who redeemed my life out of all adversity,"},{"num":10,"verse":"When one told me, Behold, Saul is dead, thinking he was bringing good news, I seized and slew him in Ziklag who expected me to give him a reward for his news."},{"num":11,"verse":"How much more—when wicked men have slain a just man in his own house on his bed—shall I not now require his blood of your hand and remove you from the earth!"},{"num":12,"verse":"David commanded his young men, and they slew them and cut off their hands and feet and hanged them over the pool in Hebron. But they took Ish-bosheth’s head and buried it in Hebron in the tomb of Abner [his relative and once chief supporter]."}]