[{"header":"Ishbosheth murdered"},{"num":4,"verse":"When Ishbosheth, Saul’s son, heard that Abner had died in Hebron, he lost his courage, and all Israel was alarmed."},{"num":2,"verse":"Saul’s son had two men who led the raiding parties—one was named Baanah and the other Rechab. Both were sons of Rimmon, a Benjaminite from Beeroth. (Beeroth was considered part of Benjamin."},{"num":3,"verse":"The people of Beeroth had fled to Gittaim and even now live there as immigrants.)"},{"num":4,"verse":"Now Saul’s son Jonathan had a boy whose feet were crippled. He was only 5 years old when the news about Saul and Jonathan came from Jezreel, and so his nurse snatched him up and fled. But as she hurried to get away, he fell and was injured. His name was Mephibosheth."},{"num":5,"verse":"Rechab and Baanah, the sons of Rimmon from Beeroth, set out and reached Ishbosheth’s house at the heat of the day, right when he was lying down, taking an afternoon rest."},{"num":6,"verse":"They went straight into his house, as if getting wheat, and they stabbed him in the stomach. Then Rechab and his brother Baanah escaped."},{"num":7,"verse":"They had entered the house while Ishbosheth was lying on the bed in his bedroom. After they stabbed him and killed him, they cut off his head, took it, and traveled all night through the wilderness."},{"num":8,"verse":"They brought Ishbosheth’s head to David at Hebron. “Here is the head of Ishbosheth,” they told the king, “the son of Saul your enemy, who wanted you dead. Today the Lord has avenged our master the king on Saul and his descendants.”"},{"num":9,"verse":"David answered Rechab and his brother Baanah, the sons of Rimmon from Beeroth, “As surely as the Lord lives, who has rescued me from all kinds of trouble,” he told them,"},{"num":10,"verse":"“when someone told me Saul was dead back in Ziklag, thinking he was bringing good news, I grabbed him and killed him. That was the reward I gave him for his news!"},{"num":11,"verse":"What do you think I’ll do when evil people kill a righteous person in his own house on his own bed? Why shouldn’t I demand his blood from your hands and rid the earth of you both?”"},{"num":12,"verse":"So David gave the order to his servants, and they killed Rechab and Baanah, cutting off their hands and feet and hanging them up by the pool at Hebron. But they took Ishbosheth’s head and buried it in the grave of Abner at Hebron."}]