[{"header":"Ish-Bosheth’s Death"},{"num":4,"verse":"Ish-Bosheth son of Saul heard that Abner had died at Hebron. Then Ish-Bosheth and all Israel became very frightened. "},{"num":2,"verse":"Two men who were captains in Saul’s army came to Ish-Bosheth. One man was named Baanah, and the other was named Recab. They were the sons of Rimmon of Beeroth, who was a Benjaminite. (The town Beeroth belonged to the tribe of Benjamin.) "},{"num":3,"verse":"The people of Beeroth ran away to Gittaim. And they still live there today."},{"num":4,"verse":"(Now Jonathan son of Saul had a son who was crippled in both feet. His name was Mephibosheth. He was five years old when the news came from Jezreel that Saul and Jonathan were dead. Mephibosheth’s nurse picked him up and ran away. But as she hurried to leave, he fell and became crippled.)"},{"num":5,"verse":"Recab and Baanah, sons of Rimmon, were from Beeroth. They went to Ish-Bosheth’s house at noon. "},{"num":6,"verse":"They came into the middle of the house. Recab and Baanah came as if they were going to get some wheat. Ish-Bosheth was lying on his bed in his bedroom. Recab and Baanah stabbed him in the stomach. Then they cut off his head and took it with them. They traveled all night through the Jordan Valley. "},{"num":8,"verse":"When they arrived at Hebron, they gave his head to David. They said to the king, “Here is the head of Ish-Bosheth son of Saul. He was your enemy. He tried to kill you! Today the Lord has paid back Saul and his family for what they did to you!”"},{"num":9,"verse":"David answered Recab and his brother Baanah sons of Rimmon of Beeroth. David said, “As surely as the Lord lives, he has saved me from all trouble! "},{"num":10,"verse":"Once a man thought he was bringing me good news. He told me, ‘Look! Saul is dead!’ But I took hold of him and killed him at Ziklag. That was the reward I gave him for his news! "},{"num":11,"verse":"So even more I must require your death. This is because evil men have killed an innocent man. And he was on his own bed in his own house!”"},{"num":12,"verse":"So David commanded his men to kill Recab and Baanah. Then they cut off the hands and feet of Recab and Baanah. They hung their hands and feet over the pool of Hebron. Then they took Ish-Bosheth’s head and buried it in Abner’s tomb at Hebron."}]