[[],[{"type":"header","content":"Ish-bosheth Murdered"},{"type":"prose","content":"Now when Ish-bosheth, Saul’s son, heard that Abner had died in Hebron, his courage failed, and all Israel was horrified."}],[{"type":"prose","content":"And Saul’s son had two men  commanders of troops: the name of the one was Baanah, and the name of the other Rechab, sons of Rimmon the Beerothite, of the sons of Benjamin (for Beeroth is also considered  of Benjamin,"}],[{"type":"prose","content":"and the Beerothites fled to Gittaim and have lived there  strangers until this day)."}],[{"type":"prose","content":"Now Jonathan, Saul’s son, had a son who was disabled in both feet. He was five years old when the news of Saul and Jonathan came from Jezreel, and his nurse picked him up and fled. But it happened that in her hurry to flee, he fell and could no longer walk. And his name was Mephibosheth."}],[{"type":"prose","content":"So the sons of Rimmon the Beerothite, Rechab and Baanah, departed and came to the house of Ish-bosheth in the heat of the day, while he was taking his midday rest."}],[{"type":"prose","content":"And they came to the interior of the house  to get wheat, and they struck him in the belly; and Rechab and his brother Baanah escaped."}],[{"type":"prose","content":"Now when they had come into the house, as he was lying on his bed in his bedroom, they struck him and killed him, and they beheaded him. And they took his head and traveled by way of the Arabah all night."}],[{"type":"prose","content":"Then they brought the head of Ish-bosheth to David at Hebron, and said to the king, “Behold, the head of Ish-bosheth the son of Saul, your enemy, who sought your life; so the  has given my lord the king vengeance this day on Saul and his descendants.”"}],[{"type":"prose","content":"But David replied to Rechab and his brother Baanah, sons of Rimmon the Beerothite, and said to them, “As the  lives, who has redeemed my life from all distress,"}],[{"type":"prose","content":"when the one who informed me, saying, ‘Behold, Saul is dead,’ also viewed himself as the bearer of good news, I seized him and killed him in Ziklag, which was the reward I gave him for  news."}],[{"type":"prose","content":"How much more, when wicked men have killed a righteous man in his  house on his bed, shall I not now require his blood from your hands and eliminate you  from the earth?”"}],[{"type":"prose","content":"Then David commanded the young men, and they killed them and cut off their hands and feet, and hung them up beside the pool in Hebron. But they took the head of Ish-bosheth and buried it in the grave of Abner in Hebron."}]]