[[],[{"type":"header","content":"Ishbaal Assassinated"},{"type":"prose","content":"When Saul’s son Ishbaal heard that Abner had died at Hebron, his courage failed, and all Israel was dismayed. "}],[{"type":"prose","content":"Saul’s son had two captains of raiding bands; the name of the one was Baanah, and the name of the other Rechab. They were sons of Rimmon a Benjaminite from Beeroth—for Beeroth is considered to belong to Benjamin. "}],[{"type":"prose","content":"(Now the people of Beeroth had fled to Gittaim and are there as resident aliens to this day)."}],[{"type":"prose","content":"Saul’s son Jonathan had a son who was crippled in his feet. He was five years old when the news about Saul and Jonathan came from Jezreel. His nurse picked him up and fled; and, in her haste to flee, it happened that he fell and became lame. His name was Mephibosheth."}],[{"type":"prose","content":"Now the sons of Rimmon the Beerothite, Rechab and Baanah, set out, and about the heat of the day they came to the house of Ishbaal, while he was taking his noonday rest. "}],[{"type":"prose","content":"They came inside the house as though to take wheat, and they struck him in the stomach; then Rechab and his brother Baanah escaped. "}],[{"type":"prose","content":"Now they had come into the house while he was lying on his couch in his bedchamber; they attacked him, killed him, and beheaded him. Then they took his head and traveled by way of the Arabah all night long. "}],[{"type":"prose","content":"They brought the head of Ishbaal to David at Hebron and said to the king, “Here is the head of Ishbaal, son of Saul, your enemy, who sought your life; the  has avenged my lord the king this day on Saul and on his offspring.”"}],[{"type":"prose","content":"David answered Rechab and his brother Baanah, the sons of Rimmon the Beerothite, “As the  lives, who has redeemed my life out of every adversity, "}],[{"type":"prose","content":"when the one who told me, ‘See, Saul is dead,’ thought he was bringing good news, I seized him and killed him at Ziklag—this was the reward I gave him for his news. "}],[{"type":"prose","content":"How much more then, when wicked men have killed a righteous man on his bed in his own house! And now shall I not require his blood at your hand, and destroy you from the earth?” "}],[{"type":"prose","content":"So David commanded the young men, and they killed them; they cut off their hands and feet, and hung their bodies beside the pool at Hebron. But the head of Ishbaal they took and buried in the tomb of Abner at Hebron."}]]