[{"header":"Jerusalem and Samaria take Lovers"},{"num":23,"verse":"The word of Adonai came to me saying: "},{"num":2,"verse":"“Son of man, there were two women, the daughters of one mother. "},{"num":3,"verse":"They were harlots in Egypt; they were harlots in their youth; their bosoms were caressed there and their virgin breasts were fondled. "},{"num":4,"verse":"Their names were Oholah, the older one, and Oholibah, her sister. They became Mine, and they gave birth to sons and daughters. As for their names, Oholah is Samaria, and Oholibah is Jerusalem."},{"num":5,"verse":"“Oholah prostituted herself, though she was Mine. She lusted after her lovers, the Assyrians, warriors, "},{"num":6,"verse":"dressed in blue, governors and rulers, all of them handsome young men, horsemen riding on horses. "},{"num":7,"verse":"She prostituted herself with them, all of the choice men of Assyria. She defiled herself with all the idols of everyone she lusted after. "},{"num":8,"verse":"She did not give up her harlotry in Egypt; for in her youth they had lain with her. They fondled her virgin breasts and poured out their lust on her. "},{"num":9,"verse":"Therefore I gave her into the hand of her lovers, into the hand of the Assyrians, whom she lusted after. "},{"num":10,"verse":"They stripped her naked, they took her sons and her daughters and slaughtered her with the sword. She became notorious among women. Judgments were executed upon her."},{"num":11,"verse":"“Now her sister Oholibah saw this, yet she was more depraved in her lust than her sister and her promiscuous acts worse. "},{"num":12,"verse":"She lusted after the Assyrians, governors and rulers, warriors splendidly clad, horsemen riding on horses, all of them handsome young men. "},{"num":13,"verse":"I saw that she defiled herself; they both went the same way. "},{"num":14,"verse":"But she kept increasing her harlotry. She saw men carved on the wall, the images of the Chaldeans carved in red, "},{"num":15,"verse":"girded with sashes on their loins, with flowing turbans on their heads, all of them had the appearance of officers, the likeness of Babylonians of Chaldea, the land of their birth. "},{"num":16,"verse":"As soon as she saw them she lusted after them. She sent messengers to them in Chaldea. "},{"num":17,"verse":"The Babylonians came to her, to the bed of love, and defiled her with their lust. Yet when she was defiled by them, she turned away from them in disgust. "},{"num":18,"verse":"When she exposed her harlotry and uncovered her nakedness, My soul was disgusted by her, just as My soul was disgusted by her sister. "},{"num":19,"verse":"Yet she multiplied her harlotry—remembering the days of her youth, when she was a harlot in the land of Egypt. "},{"num":20,"verse":"She lusted after their paramours, whose flesh is like the flesh of donkeys, and whose issue is like that of horses. "},{"num":21,"verse":"So you revisited the promiscuity of your youth, when the Egyptians used to fondle your bosom and youthful breasts."},{"num":22,"verse":"“Therefore Oholibah, thus says Adonai Elohim, behold, I will stir up your lovers against you, from whom you turned in disgust. I will bring them against you on every side: "},{"num":23,"verse":"the Babylonians and all the Chaldeans, Pekod, Shoa and Koa and all the Assyrians with them, handsome young men, governors and rulers all of them, commanders and officers, all of them riding on horses. "},{"num":24,"verse":"They will come against you with armed chariots, whirling wheels and an assembly of people. They will set themselves against you on every side with armor, shield and helmet. I will delegate judgment to them, so they will judge you according to their standards of justice. "},{"num":25,"verse":"I will vent My jealousy against you, letting them deal with you in fury. They will cut off your nose and your ears, and your survivors will fall by the sword. They will take your sons and your daughters, and your survivors will be devoured by fire. "},{"num":26,"verse":"They will strip your clothes and take your beautiful jewelry. "},{"num":27,"verse":"I will put an end to you and your immorality brought from the land of Egypt. You will no longer lift your eyes toward them or remember Egypt anymore.”"},{"num":28,"verse":"For thus says Adonai Elohim: “Behold, I will give you into the hand of those you hate, into the hand of those you turned away from in disgust. "},{"num":29,"verse":"They will treat you with hatred, take all your property and leave you naked and exposed. The vulgarity of your prostitutions will be uncovered—your debauchery and your promiscuity. "},{"num":30,"verse":"These things will be done to you, for you have gone as a harlot after the nations, so you are defiled with their idols. "},{"num":31,"verse":"You have walked in the way of your sister, so I will give her cup into your hand.”"},{"num":35,"verse":"Therefore thus says Adonai Elohim: “Because you have forgotten Me and thrust Me behind your back, you will also bear your obscenity and your harlotry.”"},{"num":36,"verse":"Then Adonai said to me, “Son of man, will you pass judgment on Oholah and Oholibah? Confront them with their disgusting practices. "},{"num":37,"verse":"For they have committed adultery and blood is on their hands. They have committed adultery with their idols and even offered their children, whom they bore for Me, to be devoured. "},{"num":38,"verse":"Again, this they have done to Me—they defiled My Sanctuary on the same day and profaned My Shabbatot. "},{"num":39,"verse":"On the same day that they slaughtered their children to their idols, they came into My Sanctuary to profane it. See, that is what they have done within My House!"},{"num":40,"verse":"“Furthermore, they sent for men who come from far away. A messenger was sent to them, and look, they came! For them you bathed, painted your eyes and decked yourself with jewelry."},{"num":41,"verse":"You sat on a glorious bed, with a table arranged before it, on which you set out My incense and My oil. "},{"num":42,"verse":"The sound of a carefree crowd was with her. Many of the men who came from the desert were drunkards. They put bracelets on their hands and beautiful crowns on their heads.”"},{"num":43,"verse":"Then I said about her, worn out from harlotry: “Still they commit immorality with her—even her? "},{"num":44,"verse":"They keep going to her, as they go to a prostitute. So they went to Oholah and to Oholibah—the obscene women. "},{"num":45,"verse":"Righteous men would judge them as adulteresses are judged and as those who shed blood are judged. For they are adulteresses, and blood is on their hands.”"},{"num":46,"verse":"For thus says Adonai Elohim: “Bring up an assembly against them. Give them over to terror and plunder. "},{"num":47,"verse":"The assembly will stone them to death and dispatch them with their swords. They will slaughter their sons and daughters. They will burn down their houses. "},{"num":48,"verse":"So I will make obscenity cease from the land, that all women may be taught not to imitate your obscenity. "},{"num":49,"verse":"They will repay you both for wickedness and you will bear the sins of your idols. So you will know that I am Adonai.”"}]