[{"num":23,"verse":"And the word of the Lord was made to me, and he said,"},{"num":2,"verse":"Thou, son of man, two women were the daughters of one mother,"},{"num":3,"verse":"and did fornication in Egypt; in their young waxing age they did fornication; there the breasts of them were made low, and the teats of the time of marriage of them were broken."},{"num":4,"verse":"Forsooth the names of them be, Oholah, the more sister, and Oholibah, the less sister of her. And I had them, and they childed sons and daughters; certainly the names of them be Samaria Oholah, and Jerusalem Oholibah. (And their names be, Oholah, the elder sister, and Oholibah, her younger sister. And I had them, and they gave birth to sons and daughters; yea, their names be Samaria Oholah, and Jerusalem Oholibah.)"},{"num":5,"verse":"Therefore Oholah did fornication on me, and was wild on her lovers, on Assyrians nighing, (And then Oholah did fornication against me, and was mad for her lovers, yea, for the Assyrians, who were nearby,)"},{"num":6,"verse":"(who were) clothed with jacinth, princes, and magistrates, young men of covetousness, all knights (all of them horsemen), (yea,) riders of horses."},{"num":7,"verse":"And she gave her fornications on them, on all the chosen sons of Assyrians; and in all on which she was wild, she was defouled in the uncleanness of them. (And she did her fornications with them, with all the chosen sons of the Assyrians; and with all whom she was mad for, she was defiled in their uncleanness.)"},{"num":8,"verse":"Furthermore and she left not her fornications, which she had in Egypt (And furthermore, she left not her fornications, which she had learned in Egypt); for why and they slept with her in the youth of her, and they brake the teats of the time of marriage of her, and they shed out their fornication [up]on her."},{"num":9,"verse":"Therefore I gave her into the hands of her lovers, into the hands of the sons of Assur, on whose lechery she was wild. (And so I gave her into the hands of her lovers, into the hands of the sons of the Assyrians, whose lechery she was mad for.)"},{"num":10,"verse":"They discovered the shame of her; they took away the sons and the daughters of her, and killed her with sword; and the women were made (in)famous, that is, made a scandal, and they did dooms in her. (They uncovered her shame, or her nakedness; they took away her sons and her daughters, and killed her with the sword; and she was made infamous, that is, was made a scandal, among women, and they brought in judgements against her.)"},{"num":11,"verse":"And when her sister Oholibah had seen this, she was wild in lechery more than that sister, and gave unshamefastly her fornication, on the fornication of her sister, (And when her sister Oholibah had seen this, she was mad with lechery more than her elder sister was, and unshamefastly, or unabashedly, she did her fornication, more than her sister’s fornication,)"},{"num":12,"verse":"to the sons of Assyrians, to dukes and magistrates coming to her, that were clothed with diverse cloth(ing), to knights that were borne on horses, and to young men with noble shape, to all men. (with the sons of the Assyrians, with princes, or leaders, and magistrates coming to her, who were clothed with diverse clothing, with horsemen who were carried by horses, and with young men of noble form, yea, with all their men.)"},{"num":13,"verse":"And I saw that one way of both sisters was defouled, (And I saw that in one way both sisters were defiled,)"},{"num":14,"verse":"and she increased her fornications. And when she had seen men painted in the wall, the images of Chaldees expressed with colours, (but she increased her fornications. And when she had seen men painted on the wall, the images of the Chaldeans expressed with colours,)"},{"num":15,"verse":"and girded on the reins with knights’ girdles, and caps painted on the heads of them, the forms of all dukes, the likeness of the sons of Babylon, and of the land of Chaldees (of the land of Chaldea), in which they were born;"},{"num":16,"verse":"she was wild on them by covetousness of her eyes (she was mad for them with the covetousness of her eyes), and she sent messengers to them into Chaldea."},{"num":17,"verse":"And when the sons of Babylon were come to her, to the bed of teats, they defouled her in their lecheries of virgins; and she was defouled of them, and the soul of her was filled (with revulsion) of them. (And when the sons of Babylon had come to her, to her bed of love, they defiled her with their lecheries for virgins; and she was defiled by them, until her soul was filled with revulsion for them.)"},{"num":18,"verse":"Also she made naked her fornications, and discovered her shame; and my soul went away from her, as my soul had gone away from her sister. (And she made known her fornications, and uncovered her shame, or her nakedness; and my soul went away from her, like my soul had gone away from her sister.)"},{"num":19,"verse":"For she multiplied her fornications, and had mind on the days of her youth (and remembered the days of her youth), in which she did fornication in the land of Egypt."},{"num":20,"verse":"And she was wild in lechery on the lying-by of them, whose fleshes be as the fleshes of asses, and as the members of horses be the members of them. (And she was mad with lechery in their lyings-by, whose flesh be like donkeys’ flesh, and their members be like horses’ members.)"},{"num":21,"verse":"And thou (re)visitedest the great trespass of thy youth, when thy breasts were made low in Egypt, and the teats of the time of thy marriage were broken."},{"num":22,"verse":"Therefore, thou Oholibah, the Lord God saith these things, Lo! I shall raise (up) all thy lovers against thee, of which thy soul was filled (with revulsion), and I shall gather them against thee in compass (and I shall gather them against thee all around thee, or on every side);"},{"num":23,"verse":"the sons of Babylon, and all Chaldees, noble and mighty men and princes, [and] all the sons of Assyrians, and young men of noble form, dukes, and magistrates, all princes of princes, and [the] named riders of horses. (the sons of Babylon, and all the Chaldeans, Pekod, and Shoa, and Koa, and all the Assyrians, yea, young men of noble form, leaders, and magistrates, all the princes of princes, and the named, or the famous, riders of horses.)"},{"num":24,"verse":"And they arrayed with chariot and wheel shall come on thee, the multitude of peoples shall be armed with habergeon, and shield, and basinet, against thee on each side; and I shall give doom before them, and (then) they shall deem thee by their dooms. (And they arrayed with chariot and wheel shall come against thee, the multitude of peoples shall be armed with breastplates, and shields, and helmets, against thee on every side; and I shall give judgement to them, and then they shall judge thee by their own laws/and then they shall judge thee according to their own judgements.)"},{"num":25,"verse":"And I shall set my fervour in thee, which they shall use with thee in strong vengeance (And I shall set my jealous anger against thee, and they shall take out their strong vengeance upon thee); they shall cut away thy nose and thine ears, and they shall slay with sword those things that were left; they shall take thy sons and thy daughters, and thy last thing shall be devoured by fire."},{"num":26,"verse":"And they shall make thee naked of thy clothes, and they shall take away the vessels of thy glory (and they shall take away thy beautiful vessels, or thy jewelry)."},{"num":27,"verse":"And I shall make thy great trespass to rest from thee, and thy fornication from the land of Egypt; and thou shalt not raise (up) thine eyes to them, and thou shalt no more have mind on Egypt (and no more shalt thou remember Egypt)."},{"num":28,"verse":"For the Lord God saith these things, Lo! I shall give thee into the hands of them which thou hatest, into the hands of them of which thy soul was filled (with revulsion), (For the Lord God saith these things, Lo! I shall give thee into the hands of those whom thou hatest, into the hands of those for whom thy soul was filled with revulsion,)"},{"num":29,"verse":"and they shall do with thee in hatred (and they shall deal with thee in hatred/and they shall make thee feel their hatred). And they shall take away all thy travails, and they shall leave thee naked, and full of shame; and the shame of thy fornications shall be showed."},{"num":30,"verse":"Thy great trespass and thy fornications have done these things to thee; for thou didest fornication after heathen men, among which thou were defouled in the idols of them (for thou didest fornication with the heathen, and thou were defiled with their idols)."},{"num":31,"verse":"Thou wentest in the way of thy sister, and I shall give the cup of her in(to) thine hand."},{"num":32,"verse":"The Lord God saith these things, Thou shalt drink the cup of thy sister, the depth, and the broadness; thou that art most able to take, shalt be into scorning, and into mocking (thou shalt be into scorning, and into mocking, more than the cup can hold)."},{"num":33,"verse":"Thou shalt be filled with drunkenness and sorrow, with the cup of mourning and of heaviness, with the cup of thy sister Samaria."},{"num":34,"verse":"And thou shalt drink it, and thou shalt drink of (it) till to the dregs, (or unto the lees,) and thou shalt devour the remnants thereof (and thou shalt devour its remnants), and thou shalt rend thy breasts, for I the Lord spake, saith the Lord God."},{"num":35,"verse":"Therefore the Lord God saith these things, For thou hast forgotten me, and hast cast forth me behind thy body (and hast thrown me away behind thy back), bear thou also thy great trespass and thy fornications."},{"num":36,"verse":"And the Lord God said to me, and spake, Son of man, whether thou deemest Oholibah and Oholah, and tellest to them the great trespasses of them? (And the Lord God spoke to me, and said, Son of man, judgest thou Oholibah and Oholah, and tellest them their great trespasses?)"},{"num":37,"verse":"For they did adultery, and blood was in the hands of them, and they did fornication with their idols; furthermore and they offered to those (idols) the sons which they engendered to me, for to be devoured. (For they did adultery, and blood was upon their hands, and they did fornication, or idolatry, with their idols; and furthermore they offered the children whom they begat for me, to those idols to be devoured.)"},{"num":38,"verse":"But also they did this to me, they defouled my saintuary in that day, and made unholy my sabbaths. (But they also did this to me, they defiled my sanctuary on that day, and made my sabbaths unholy.)"},{"num":39,"verse":"And when they sacrificed their sons to their idols, and entered into my saintuary in that day, that they should defoul it, they did also these things in the midst of mine house. (And when they sacrificed their sons and daughters to their idols, and entered into my sanctuary on that day, so that they could defile it, they also did these things in the midst of my House.)"},{"num":40,"verse":"They sent to men coming from (a)far, to which they had sent messengers. Therefore lo! they came, to which thou washedest thee, and anointedest thine eyes with ointment of women, and thou were adorned with women’s attire. (They sent for men coming from afar, to whom they had sent messengers. And so lo! they came, for whom thou hast washed thyself, and hast anointed thine eyes with women’s ointment, and thou were adorned with women’s attire.)"},{"num":41,"verse":"Thou satest in a full fair bed, and a board was adorned before thee; thou settedest mine incense and mine ointment on it. (And thou satest on a very beautiful bed, and a table was adorned before thee; thou hast set my incense and my ointment upon it.)"},{"num":42,"verse":"And a voice of multitude making full out joy was therein; and in men that were brought of the multitude of men, and came from desert, they setted bands in the hands of them, and fair crowns on the heads of them. (And the sound of a multitude making great joy was there; and with the multitude of people were the Sabeans, brought in from the wilderness, and they put bands upon their wrists, and beautiful crowns upon their heads.)"},{"num":43,"verse":"And I said to her, that was defouled in adulteries, Now also this shall do fornication in her fornication. (And I said to myself about her, who was defiled in her adulteries, that is, by her idolatries, Now they shall also do fornication with her, with her of all women!)"},{"num":44,"verse":"And (so) they entered to her; as to a woman, an whore (like to a whorewoman), so they entered to Oholah and to Oholibah, (the) cursed women."},{"num":45,"verse":"Therefore these men (that) be just, these shall deem those women by the doom of adulteresses, and by the doom of them that shed out blood; for they be adulteresses, and blood is in the hands of them, and they did fornication with their idols. (And so these men who be upright, they shall judge those women by the law of adulteresses, and by the judgement of those who shed out blood; for they be adulteresses, and blood is upon their hands, and they did fornication, or idolatry, with their idols.)"},{"num":46,"verse":"For the Lord God saith these things, Bring thou multitudes to them, and give thou them into noise, and into raven (and give thou them unto terror, and robbery);"},{"num":47,"verse":"and be they stoned with the stones of (the) peoples, and be they sticked together with the swords of them. They shall slay the sons and the daughters of them, and they shall burn with fire the houses of them (They shall kill their sons and their daughters, and they shall burn down their houses)."},{"num":48,"verse":"And I shall do away great trespass from the land; and all women shall learn, that they do not after the great trespass of them. (And so I shall do away great trespass from the land; and all women shall learn, that they should not do, or should not follow, after their great trespasses.)"},{"num":49,"verse":"And they shall give your great trespass on you; and ye shall bear the sins of your idols, and ye shall know, that I am the Lord God. (And ye shall be punished for your great trespass, and for your sin of worshipping idols, and ye shall know, that I am the Lord God.)"}]