[{"header":"Instructions about Jericho"},{"num":6,"verse":"Now Jericho was closed up tightly because of the Israelites. No one went out or came in."},{"num":2,"verse":"The Lord said to Joshua, “Look. I have given Jericho and its king into your power, along with its mighty warriors."},{"num":3,"verse":"Circle the city with all the soldiers, going around the city one time. Do this for six days."},{"num":4,"verse":"Have seven priests carry seven trumpets made from rams’ horns in front of the chest. On the seventh day, circle the city seven times, with the priests blowing the trumpets."},{"num":5,"verse":"“Have them blow a long blast on the ram’s horn. As soon as you hear that trumpet blast, have all the people shout out a loud war cry. Then the city wall will collapse, and the people will rise up, attacking straight ahead.”"},{"header":"Israel destroys Jericho"},{"num":6,"verse":"So Joshua, Nun’s son, called the priests. He said to them, “Lift up the covenant chest. Let seven priests carry seven trumpets made from rams’ horns in front of the Lord’s chest.”"},{"num":7,"verse":"He said to the people, “Go forward. Circle the city. Let the armed soldiers go in front of the Lord’s chest.”"},{"num":8,"verse":"As soon as Joshua had spoken to the people, the seven priests carrying seven ram’s horn trumpets moved forward in front of the Lord. They blew the trumpets. The Lord’s covenant chest followed."},{"num":9,"verse":"The initial group of soldiers was going in front of the priests who were blowing the trumpets. The rear guard was coming behind the chest, with trumpets blowing continuously."},{"num":10,"verse":"Joshua ordered the people, “Don’t shout. Don’t let your voice be heard. Don’t let a word come out of your mouth until the day I tell you, ‘Shout!’ Then shout!”"},{"num":11,"verse":"He made the Lord’s chest circle the city, going around one time. They went back to the camp and stayed there overnight."},{"num":12,"verse":"Joshua got up early in the morning. The priests lifted up the Lord’s chest."},{"num":13,"verse":"The seven priests carrying the seven trumpets made from rams’ horns were going in front of the Lord’s chest, blowing trumpets continuously. The armed soldiers were going in front of them. The rear guard was coming after the Lord’s chest, blowing trumpets continuously."},{"num":14,"verse":"They circled the city one time on the second day. Then they went back to the camp. They did this for six days."},{"num":15,"verse":"On the seventh day, they got up at dawn. They circled the city in this way seven times. It was only on that day that they circled the city seven times."},{"num":16,"verse":"The seventh time, the priests blew the trumpets. Then Joshua said to the people, “Shout, because the Lord has given you the city!"},{"num":17,"verse":"The city and everything in it is to be utterly wiped out as something reserved for the Lord. Only Rahab the prostitute is to stay alive, along with everyone with her in her house. This is because she hid the messengers we sent."},{"num":18,"verse":"But you, keep away from the things set aside for God so that you don’t desire and take some of the things reserved. That would turn the camp of Israel into a thing doomed to be utterly wiped out and bring calamity on it."},{"num":19,"verse":"All silver and gold, along with bronze and iron equipment, are holy to the Lord. They must go into the Lord’s treasury.”"},{"num":20,"verse":"Then the people shouted. They blew the trumpets. As soon as the people heard the trumpet blast, they shouted a loud war cry. Then the wall collapsed. The people went up against the city, attacking straight ahead. They captured the city."},{"num":21,"verse":"Without mercy, they wiped out everything in the city as something reserved for God—man and woman, young and old, cattle, sheep, and donkeys."},{"header":"Consequences"},{"num":22,"verse":"Joshua spoke to the two men who had scouted out the land. “Go to the prostitute’s house. Bring out the woman from there, along with everyone related to her, exactly as you pledged to her.”"},{"num":23,"verse":"So the young men who had been spies went and brought Rahab out, along with her father, her mother, her brothers, and everyone related to her. They brought her whole clan out and let them stay outside Israel’s camp."},{"num":24,"verse":"They burned the city and everything in it. But they put the silver and gold, along with the bronze and iron equipment, into the treasury of the Lord’s house."},{"num":25,"verse":"Joshua let Rahab the prostitute live, her family, and everyone related to her. So her family still lives among Israel today, because she hid the spies whom Joshua had sent to scout out Jericho."},{"num":26,"verse":"At that time Joshua made this decree:"},{"num":27,"verse":"The Lord was with Joshua. News about him spread throughout the land."}]