[[],[{"type":"header","content":"The Fall of Jericho"},{"type":"prose","content":"Now the gates of Jericho were tightly shut because the people were afraid of the Israelites. No one was allowed to go out or in."}],[{"type":"prose","content":"But the LORD said to Joshua, “I have given you Jericho, its king, and all its strong warriors."}],[{"type":"prose","content":"You and your fighting men should march around the town once a day for six days."}],[{"type":"prose","content":"Seven priests will walk ahead of the Ark, each carrying a ram’s horn. On the seventh day you are to march around the town seven times, with the priests blowing the horns."}],[{"type":"prose","content":"When you hear the priests give one long blast on the rams’ horns, have all the people shout as loud as they can. Then the walls of the town will collapse, and the people can charge straight into the town.”"}],[{"type":"prose","content":"So Joshua called together the priests and said, “Take up the Ark of the LORD’s Covenant, and assign seven priests to walk in front of it, each carrying a ram’s horn.”"}],[{"type":"prose","content":"Then he gave orders to the people: “March around the town, and the armed men will lead the way in front of the Ark of the LORD.”"}],[{"type":"prose","content":"After Joshua spoke to the people, the seven priests with the rams’ horns started marching in the presence of the LORD, blowing the horns as they marched. And the Ark of the LORD’s Covenant followed behind them."}],[{"type":"prose","content":"Some of the armed men marched in front of the priests with the horns and some behind the Ark, with the priests continually blowing the horns."}],[{"type":"prose","content":"“Do not shout; do not even talk,” Joshua commanded. “Not a single word from any of you until I tell you to shout. Then shout!”"}],[{"type":"prose","content":"So the Ark of the LORD was carried around the town once that day, and then everyone returned to spend the night in the camp."}],[{"type":"prose","content":"Joshua got up early the next morning, and the priests again carried the Ark of the LORD."}],[{"type":"prose","content":"The seven priests with the rams’ horns marched in front of the Ark of the LORD, blowing their horns. Again the armed men marched both in front of the priests with the horns and behind the Ark of the LORD. All this time the priests were blowing their horns."}],[{"type":"prose","content":"On the second day they again marched around the town once and returned to the camp. They followed this pattern for six days."}],[{"type":"prose","content":"On the seventh day the Israelites got up at dawn and marched around the town as they had done before. But this time they went around the town seven times."}],[{"type":"prose","content":"The seventh time around, as the priests sounded the long blast on their horns, Joshua commanded the people, “Shout! For the LORD has given you the town!"}],[{"type":"prose","content":"Jericho and everything in it must be completely destroyed as an offering to the LORD. Only Rahab the prostitute and the others in her house will be spared, for she protected our spies."}],[{"type":"prose","content":"“Do not take any of the things set apart for destruction, or you yourselves will be completely destroyed, and you will bring trouble on the camp of Israel."}],[{"type":"prose","content":"Everything made from silver, gold, bronze, or iron is sacred to the LORD and must be brought into his treasury.”"}],[{"type":"prose","content":"When the people heard the sound of the rams’ horns, they shouted as loud as they could. Suddenly, the walls of Jericho collapsed, and the Israelites charged straight into the town and captured it."}],[{"type":"prose","content":"They completely destroyed everything in it with their swords—men and women, young and old, cattle, sheep, goats, and donkeys."}],[{"type":"prose","content":"Meanwhile, Joshua said to the two spies, “Keep your promise. Go to the prostitute’s house and bring her out, along with all her family.”"}],[{"type":"prose","content":"The men who had been spies went in and brought out Rahab, her father, mother, brothers, and all the other relatives who were with her. They moved her whole family to a safe place near the camp of Israel."}],[{"type":"prose","content":"Then the Israelites burned the town and everything in it. Only the things made from silver, gold, bronze, or iron were kept for the treasury of the LORD’s house."}],[{"type":"prose","content":"So Joshua spared Rahab the prostitute and her relatives who were with her in the house, because she had hidden the spies Joshua sent to Jericho. And she lives among the Israelites to this day."}],[{"type":"prose","content":"At that time Joshua invoked this curse:"}],[{"type":"prose","content":"So the LORD was with Joshua, and his reputation spread throughout the land."}]]