[{"header":"Devastation of Surrounding Lands"},{"header":"Two Staffs"},{"num":4,"verse":"Thus said Adonai my God: “Shepherd the flock marked for slaughter! "},{"num":5,"verse":"Their buyers slay them and go unpunished. Those who sell them say, ‘Blessed be Adonai, for I am rich!’ Their own shepherds do not spare them. "},{"num":6,"verse":"I will no longer have compassion on the inhabitants of the land”—it is a declaration of Adonai. “Behold, I will hand everyone over to his neighbor and his king. They will devastate the land, and I will not deliver them from their hand.”"},{"num":7,"verse":"So I pastured the flock for the slaughter, especially the afflicted of the flock. Then I took two staffs—one I called Favor and the other I called Union—and I pastured the flock. "},{"num":8,"verse":"Next I disposed of the three shepherds in one month—for my soul was impatient with them and their soul also detested me. "},{"num":9,"verse":"Then I said, “I will not shepherd you! Let the dying die, let the perishing perish, and let those who are left eat one another’s flesh!” "},{"num":10,"verse":"So I took my staff called Favor and broke it to pieces, in order to break my covenant that I made with all people. "},{"num":11,"verse":"It was broken on that day. The afflicted of the flock that were watching me knew that this was the word of Adonai.”"},{"num":12,"verse":"Then I said to them, “If it seems good to you, pay me my wages, but if not, don’t bother!” So they weighed out my wages—30 pieces of silver."},{"num":13,"verse":"Then Adonai said to me, “Throw it to the potter—that exorbitant price at which they valued Me!” So I took the 30 pieces of silver and threw them into the House of Adonai, to the potter."},{"num":14,"verse":"Then I broke my second staff called Union, in order to break the brotherhood between Judah and Israel. "},{"num":15,"verse":"Again Adonai said to me, “Once more take up the equipment of a foolish shepherd! "},{"num":16,"verse":"For behold, I am going to raise up a shepherd in the land who will not care for the dying, seek out the young or heal the injured or nourish the healthy. Instead he will eat the meat of the choice sheep, even tearing off their hoofs.”"}]