[{"num":11,"verse":"Thou Lebanon, open thy gates, and (then the) fire shall eat thy cedars."},{"num":2,"verse":"Yell, thou fir tree, for the cedar fell down, for great men be destroyed; yell, ye oaks of Bashan, for the strong forest is cut down."},{"num":3,"verse":"The voice of yelling of shepherds, for the great worship of them is destroyed; the voice of roaring of lions, for the pride of Jordan is wasted. (The sound of the yelling of the shepherds, or of the leaders, for their great glory is destroyed; the sound of the roaring of the lions, for the thickets of Jordan be destroyed.)"},{"num":4,"verse":"My Lord God saith these things, Feed thou beasts of slaughter, (The Lord my God saith these things, Feed thou the beasts for slaughter,)"},{"num":5,"verse":"which they that wielded slew; and sorrowed not, and sold them, and they said, Blessed be the Lord, we be made rich. And the shepherds of them spared not them, (which they who possessed them killed; and they did not have any sorrow, or any regret, and they sold them, and they said, Blessed be the Lord, for we be made rich. And their shepherds did not spare them,)"},{"num":6,"verse":"and I shall no more spare on them that inhabit the earth, saith the Lord. Lo! I shall betake men, each into the hand of his neighbour, and in(to) the hand of his king, and they shall rend together the land; and I shall not deliver from the hand of them, (and so no more shall I spare any who inhabit the earth, saith the Lord. Lo! I shall deliver all of the people, each one into the hands of his neighbour, and into the hands of his king, and they shall altogether, or shall completely, tear down the land; and I shall not rescue them from their hands,)"},{"num":7,"verse":"and I shall feed the beast of slaying. For this thing, ye poor men of the flock, hear (and I shall feed the beasts for slaughter. And so for this, ye poor of the flock, listen). And I took to me two staffs; one I called Fairness, and the tother I called Little Cord; and I fed the flock."},{"num":8,"verse":"And I cutted down three shepherds in one month, and my soul was drawn (al)together in them; for also the soul of them varied in me. (And I cut down three shepherds in one month, for I lost patience with them; and their souls loathed me.)"},{"num":9,"verse":"And I said, I shall not feed you; that that dieth, die; and that that is cut down, be cut down; and the residues devour, each man the flesh of his neighbour. (And I said, I shall not feed you; he who shall die, die; and he who shall be cut down, be cut down; and the rest devour each other, yea, each person the flesh of his neighbour.)"},{"num":10,"verse":"And I took my staff, that was called Fairness, and I cutted down it, that I should make void my covenant, which I smote with all peoples. (And I took my staff, that was called Fairness, or Favour, and I cut it down, or I broke it in two, so that I would make void my covenant, which I struck with all the peoples, or all the nations.)"},{"num":11,"verse":"And it was made void in that day; and the poor men of the flock that kept to me, knew thus, for it is the word of the Lord. (And it was made void, or annulled, on that day; and the poor of the flock who were watching me, knew this, for it was the word of the Lord.)"},{"num":12,"verse":"And I said to them, If it is good in your eyes, bring ye my meed (bring ye my reward, or my wages); and if nay, rest ye. And they weighed my meed, thirty pieces of silver."},{"num":13,"verse":"And the Lord said to me, Cast away it to the maker of images, the fair price, by which I am appraised of them. And I took [the] thirty pieces of silver, and casted forth them in the house of the Lord, to the maker of images. (And the Lord said to me, Throw it forth to the maker of figures, the fair price, by which I was appraised by them. And I took the thirty pieces of silver, and threw them into the House of the Lord, to the maker of figures./And the Lord said to me, Throw it forth into the Temple treasury, the fair price, by which I was appraised by them. And I took the thirty pieces of silver, and threw them into the House of the Lord, into the Temple treasury.)"},{"num":14,"verse":"And I cutted down my second staff, that was called Little Cord, that I should part, or unbind, the brotherhood betwixt Judah and Israel. (And I broke in half my second staff, that was called Little Cord, or Union, so that I would part, or unbind, the brotherhood between Judah and Israel.)"},{"num":15,"verse":"And the Lord said to me, Yet take to thee the vessels of a fond shepherd; (And the Lord said to me, Now get thee for thyself the instruments of a foolish shepherd;)"},{"num":16,"verse":"for lo! I shall raise a shepherd in earth, which shall not visit forsaken things, and shall not seek scattered things, and he shall not heal a thing all-broken, and shall not nourish forth that that standeth. And he shall eat fleshes of the fat, and shall unbind the claws of them. (for lo! I shall raise up a shepherd in the land, who shall not visit the forsaken, or seek out the scattered, and he shall not heal anyone who is broken, or who is ill, and shall not feed anyone who standeth up straight, or who is healthy. But he shall eat the flesh of the fat beasts, and he shall cut off their hoofs.)"},{"num":17,"verse":"A! the shepherd, and idol, forsaking the flock; sword on his arm, and on his right eye; the arm of him shall be dried with dryness, and his right eye waxing dark shall be made dark. (O! the idle shepherd, deserting his flock; the sword shall fall upon his arm, and upon his right eye; and his arm shall be dried up with dryness, and his right eye growing dark shall be made dark, or shall go blind.)"}]