[{"header":"Jehu Rebukes Baasha"},{"num":16,"verse":"Later, a message came from the Lord to Hanani’s son Jehu. It was directed to rebuke Baasha, and this is what it said:"},{"num":5,"verse":"Now the rest of Baasha’s accomplishments, including everything that he undertook, as well as his strengths, are recorded in the Book of the Chronicles of the Kings of Israel, are they not? "},{"num":6,"verse":"Eventually, Baasha died, as had his ancestors, and he was buried in Tirzah. His son Elah was installed as king in his place."},{"num":7,"verse":"In addition, a message from the Lord came through Hanani’s son Jehu the prophet against Baasha and his household, not only because of all of the things that Baasha did that the Lord considered to be evil, including provoking the Lord to anger by what he did and by being like the household of Jeroboam, but also because Baasha had destroyed Jeroboam’s household."},{"header":"Elah Reigns over Israel"},{"num":8,"verse":"During the twenty-sixth year of the reign of King Asa of Judah, Baasha’s son Elah became king over Israel and reigned at Tirzah for two years. "},{"num":9,"verse":"But his servant Zimri, who commanded half of his chariot forces, conspired against Elah while he was drinking himself drunk in the home of Arza, who managed the household at Tirzah. "},{"num":10,"verse":"Zimri went inside, attacked him, and killed him in the twenty-seventh year of the reign of King Asa of Judah, and then became king in Elah’s place. "},{"num":11,"verse":"As soon as he had consolidated his reign, he executed the entire household of Baasha. He did not leave a single male alive, including any of Baasha’s relatives or friends. "},{"num":12,"verse":"In doing so, Zimri destroyed the entire household of Baasha, in keeping with the message from the Lord that he had spoken against Baasha through Jehu the prophet "},{"num":13,"verse":"because of all the sins that Baasha and his son Elah had committed and because of what they did to lead Israel into sin, thus provoking the Lord God of Israel to anger with their idolatry. "},{"num":14,"verse":"Now the rest of Elah’s accomplishments, including everything he undertook, are written in the Book of the Chronicles of the Kings of Israel, are they not?"},{"header":"Zimri Reigns over Israel"},{"num":15,"verse":"Zimri reigned for seven days at Tirzah during the twenty-seventh year of the reign of King Asa of Judah. At that time, the army was encamped in a siege against Gibbethon of Philistia. "},{"num":16,"verse":"The army at the encampment heard this report: “Zimri has conspired against the king and killed him.” So the entire army of Israel made Omri, their commander, king over Israel. "},{"num":17,"verse":"Then Omri and the entire army of Israel left from Gibbethon and attacked Tirzah. "},{"num":18,"verse":"When Zimri observed that the city had been captured, he retreated into the king’s palace, set fire to the citadel, and died when the palace burned down around him "},{"num":19,"verse":"because of the sins that he committed by doing what the Lord considered to be evil, living like Jeroboam did, and sinning so as to lead Israel into sin. "},{"num":20,"verse":"The rest of Zimri’s accomplishments, including his conspiracy that he carried out, are written in the Book of the Chronicles of the Kings of Israel, are they not?"},{"header":"Omri Reigns over Israel and Builds Samaria"},{"num":21,"verse":"The army of Israel was divided into two parties: half of the army were loyal to Ginath’s son Tibni and wanted to make him king, and half were loyal to Omri. "},{"num":22,"verse":"But the army that was loyal to Omri was victorious over Ginath’s son Tibni. Tibni later died and Omri became king. "},{"num":23,"verse":"During the thirty-first year of the reign of King Asa of Judah, Omri became king over Israel. He reigned for twelve years, six of them at Tirzah. "},{"num":24,"verse":"He bought the hill of Samaria from Shemer for two talents of silver, fortified the hill, and named the city Samaria after Shemer, the former owner of the hill. "},{"num":25,"verse":"Omri practiced what the Lord considered to be evil, doing far more evil than anyone who had reigned before him. "},{"num":26,"verse":"He lived just like Nebat’s son Jeroboam, and by his sin he led Israel into sin, provoking the Lord God of Israel with their idolatry. "},{"num":27,"verse":"Now the rest of Omri’s accomplishments, including the power that he demonstrated, are recorded in the Book of the Chronicles of the Kings of Israel, are they not? "},{"num":28,"verse":"So Omri died, as had his ancestors, and he was buried in Samaria. His son Ahab became king in his place."},{"header":"Ahab Reigns over Israel and Marries Jezebel"},{"num":29,"verse":"Omri’s son Ahab became king over Israel in the thirty-eighth year of King Asa of Judah. He reigned over Israel in Samaria for 22 years. "},{"num":30,"verse":"Omri’s son Ahab practiced more of what the Lord considered to be evil than anyone who had lived before him. "},{"num":31,"verse":"In fact, as if it were nothing for him to live like Nebat’s son Jeroboam, Ahab married Jezebel, the daughter of King Ethbaal of Sidon. Then he went out to serve Baal and worship him. "},{"num":32,"verse":"He built an altar for Baal in a temple for Baal that he constructed in Samaria. "},{"num":33,"verse":"Ahab also erected an Asherah, doing more to provoke the Lord God of Israel than all of the kings of Israel who had reigned before him. "},{"num":34,"verse":"It was during Ahab’s reign that Hiel the Bethelite rebuilt Jericho. He laid its foundations just as his firstborn son Abiram was dying, and he erected its gates while his youngest son Segub was dying, thus fulfilling the message that the Lord delivered through Nun’s son Joshua."}]