[[],[{"type":"prose","content":"This message from the LORD was delivered to King Baasha by the prophet Jehu son of Hanani:"}],[{"type":"prose","content":"“I lifted you out of the dust to make you ruler of my people Israel, but you have followed the evil example of Jeroboam. You have provoked my anger by causing my people Israel to sin."}],[{"type":"prose","content":"So now I will destroy you and your family, just as I destroyed the descendants of Jeroboam son of Nebat."}],[{"type":"prose","content":"The members of Baasha’s family who die in the city will be eaten by dogs, and those who die in the field will be eaten by vultures.”"}],[{"type":"prose","content":"The rest of the events in Baasha’s reign and the extent of his power are recorded in "}],[{"type":"prose","content":"When Baasha died, he was buried in Tirzah. Then his son Elah became the next king."}],[{"type":"prose","content":"The message from the LORD against Baasha and his family came through the prophet Jehu son of Hanani. It was delivered because Baasha had done what was evil in the LORD’s sight (just as the family of Jeroboam had done), and also because Baasha had destroyed the family of Jeroboam. The LORD’s anger was provoked by Baasha’s sins."}],[{"type":"header","content":"Elah Rules in Israel"},{"type":"prose","content":"Elah son of Baasha began to rule over Israel in the twenty-sixth year of King Asa’s reign in Judah. He reigned in the city of Tirzah for two years."}],[{"type":"prose","content":"Then Zimri, who commanded half of the royal chariots, made plans to kill him. One day in Tirzah, Elah was getting drunk at the home of Arza, the supervisor of the palace."}],[{"type":"prose","content":"Zimri walked in and struck him down and killed him. This happened in the twenty-seventh year of King Asa’s reign in Judah. Then Zimri became the next king."}],[{"type":"prose","content":"Zimri immediately killed the entire royal family of Baasha, leaving him not even a single male child. He even destroyed distant relatives and friends."}],[{"type":"prose","content":"So Zimri destroyed the dynasty of Baasha as the LORD had promised through the prophet Jehu."}],[{"type":"prose","content":"This happened because of all the sins Baasha and his son Elah had committed, and because of the sins they led Israel to commit. They provoked the anger of the LORD, the God of Israel, with their worthless idols."}],[{"type":"prose","content":"The rest of the events in Elah’s reign and everything he did are recorded in "}],[{"type":"header","content":"Zimri Rules in Israel"},{"type":"prose","content":"Zimri began to rule over Israel in the twenty-seventh year of King Asa’s reign in Judah, but his reign in Tirzah lasted only seven days. The army of Israel was then attacking the Philistine town of Gibbethon."}],[{"type":"prose","content":"When they heard that Zimri had committed treason and had assassinated the king, that very day they chose Omri, commander of the army, as the new king of Israel."}],[{"type":"prose","content":"So Omri led the entire army of Israel up from Gibbethon to attack Tirzah, Israel’s capital."}],[{"type":"prose","content":"When Zimri saw that the city had been taken, he went into the citadel of the palace and burned it down over himself and died in the flames."}],[{"type":"prose","content":"For he, too, had done what was evil in the LORD’s sight. He followed the example of Jeroboam in all the sins he had committed and led Israel to commit."}],[{"type":"prose","content":"The rest of the events in Zimri’s reign and his conspiracy are recorded in "}],[{"type":"header","content":"Omri Rules in Israel"},{"type":"prose","content":"But now the people of Israel were split into two factions. Half the people tried to make Tibni son of Ginath their king, while the other half supported Omri."}],[{"type":"prose","content":"But Omri’s supporters defeated the supporters of Tibni. So Tibni was killed, and Omri became the next king."}],[{"type":"prose","content":"Omri began to rule over Israel in the thirty-first year of King Asa’s reign in Judah. He reigned twelve years in all, six of them in Tirzah."}],[{"type":"prose","content":"Then Omri bought the hill now known as Samaria from its owner, Shemer, for 150 pounds of silver. He built a city on it and called the city Samaria in honor of Shemer."}],[{"type":"prose","content":"But Omri did what was evil in the LORD’s sight, even more than any of the kings before him."}],[{"type":"prose","content":"He followed the example of Jeroboam son of Nebat in all the sins he had committed and led Israel to commit. The people provoked the anger of the LORD, the God of Israel, with their worthless idols."}],[{"type":"prose","content":"The rest of the events in Omri’s reign, the extent of his power, and everything he did are recorded in "}],[{"type":"prose","content":"When Omri died, he was buried in Samaria. Then his son Ahab became the next king."}],[{"type":"header","content":"Ahab Rules in Israel"},{"type":"prose","content":"Ahab son of Omri began to rule over Israel in the thirty-eighth year of King Asa’s reign in Judah. He reigned in Samaria twenty-two years."}],[{"type":"prose","content":"But Ahab son of Omri did what was evil in the LORD’s sight, even more than any of the kings before him."}],[{"type":"prose","content":"And as though it were not enough to follow the sinful example of Jeroboam, he married Jezebel, the daughter of King Ethbaal of the Sidonians, and he began to bow down in worship of Baal."}],[{"type":"prose","content":"First Ahab built a temple and an altar for Baal in Samaria."}],[{"type":"prose","content":"Then he set up an Asherah pole. He did more to provoke the anger of the LORD, the God of Israel, than any of the other kings of Israel before him."}],[{"type":"prose","content":"It was during his reign that Hiel, a man from Bethel, rebuilt Jericho. When he laid its foundations, it cost him the life of his oldest son, Abiram. And when he completed it and set up its gates, it cost him the life of his youngest son, Segub. This all happened according to the message from the LORD concerning Jericho spoken by Joshua son of Nun."}]]