[{"num":16,"verse":"Forsooth the word of the Lord was made to Jehu, the son of Hanani, against Baasha, and said,"},{"num":2,"verse":"For that that I raised thee from dust, and setted thee duke on Israel, my people; soothly thou wentest in the way of Jeroboam, and thou hast made my people Israel to do sin, that thou shouldest stir me to ire, in the sins of them; (For though I raised thee up out of the dust, and made thee the leader of my people Israel; yet thou wentest in the way of Jeroboam, and thou hast made my people Israel to do sin, so that thou stirrest me to anger with their sins;)"},{"num":3,"verse":"lo! I shall cut away the hinder things of Baasha, and the hinder things of his house, and I shall make thine house as the house of Jeroboam, the son of Nebat. (lo! I shall cut away the posterity, or the descendants, of Baasha, and of his household, or of his family, and I shall make thy house like the house of Jeroboam, the son of Nebat.)"},{"num":4,"verse":"Dogs shall eat that man of Baasha, that shall be dead in the city, and [the] birds of the air shall eat that man of Baasha, that shall die in the field. (The dogs shall eat those of Baasha’s family, who shall die in the city, and the birds of the air shall eat those of Baasha’s family, who shall die in the field.)"},{"num":5,"verse":"Soothly the residue of the words of Baasha, and whatever things he did, and his battles, whether these be not written in the book of [the] words of [the] days of the kings of Israel?"},{"num":6,"verse":"And so Baasha slept with his fathers, and he was buried in Tirzah; and Elah, his son, reigned for him."},{"num":7,"verse":"Forsooth when the word of the Lord was made in the hand of Jehu, the son of Hanani, against Baasha, and against his house, and against all the evil which he did before the Lord, to stir him to ire in the works of his hands, that he should be as the house of Jeroboam, for this cause he killed him. (And the word of the Lord was made to Jehu, the son of Hanani, against Baasha, and against his house, and against all the evil which he did before the Lord, to stir him to anger with the works of his hands, because he sinned like the house of Jeroboam, and also because he killed them.)"},{"num":8,"verse":"In the six and twentieth year of Asa, king of Judah, Elah, the son of Baasha, reigned upon Israel, in Tirzah, two years. (In the twenty-sixth year of Asa, the king of Judah, Elah, the son of Baasha, began to reign upon Israel in Tirzah, and he reigned for two years.)"},{"num":9,"verse":"And Zimri, his servant, duke of the half part of his knights, rebelled against him; soothly Elah was in Tirzah, and drank and was drunken in the house of Arza, prefect of Tirzah. (And Zimri, his officer, the leader of half of his horsemen, rebelled against him; and Elah was in Tirzah, and drank until he was drunk in the house of Arza, the prefect of Tirzah.)"},{"num":10,"verse":"Therefore Zimri felled in, and smote Elah, and killed him, in the seven and twentieth year of Asa, king of Judah; and [he] reigned for him."},{"num":11,"verse":"And when he had reigned, and sat upon his throne, he smote all the house of Baasha, and he left not thereof a pisser to the wall, and his kinsmen, and friends. (And once he began to reign, and sat on his throne, he struck down all the house of Baasha, and he left not of it a pisser on the wall, nor any of his kinsmen, nor any of his friends.)"},{"num":12,"verse":"And Zimri did away all the house of Baasha, by the word of the Lord, which he spake to Baasha, in the hand of Jehu, the prophet (which he spoke to Baasha, by the prophet Jehu),"},{"num":13,"verse":"for all the sins of Baasha, and for the sins of Elah, his son, which sinned, and made Israel to do sin, and wrathed the Lord God of Israel in their vanities. (for all the sins of Baasha, and the sins of his son Elah, both of whom sinned, and made Israel to do sin, and stirred the Lord God of Israel to anger with their worthless idols.)"},{"num":14,"verse":"Soothly the residue of the words of Elah, and all things which he did, whether these be not written in the book of [the] words of [the] days of the kings of Israel?"},{"num":15,"verse":"In the seven and twentieth year of Asa, king of Judah, Zimri reigned (for) seven days in Tirzah (In the twenty-seventh year of Asa, the king of Judah, Zimri reigned in Tirzah for seven days); forsooth the host of Israel besieged Gibbethon, the city of (the) Philistines."},{"num":16,"verse":"And when it had heard, that Zimri had rebelled, and had slain the king, all Israel made Omri king to them, that was prince of the chivalry, on Israel, in that day, in their tents. (And when they had heard that Zimri had rebelled, and had killed the king, all Israel made Omri, who was the leader of the cavalry, or of the army, king upon Israel, that very day, in the camp.)"},{"num":17,"verse":"Therefore Omri went up, and all Israel with him, from Gibbethon, and besieged Tirzah. (And then Omri, and all Israel with him, went up from Gibbethon, and besieged Tirzah.)"},{"num":18,"verse":"And Zimri saw, that the city should be overcome, and he entered into the palace, and burnt himself with the king’s house; and he was dead (And Zimri saw that the city would be overcome, and so he entered into the palace, and burned himself up, along with the palace; and so he died)"},{"num":19,"verse":"in his sins which he sinned, doing evil before the Lord, and going in the way of Jeroboam, and in his sins, by which he made Israel to do sin."},{"num":20,"verse":"Soothly the residue of the words of Zimri, and of his treasons, and tyranny, whether these be not written in the book of [the] words of [the] days of the kings of Israel?"},{"num":21,"verse":"Then the people of Israel was parted into two parts; the half part of the people followed Tibni, the son of Ginath, to make him king, and the other half part followed Omri."},{"num":22,"verse":"And the people that was with Omri, had the mastery over the people that followed Tibni, the son of Ginath; and Tibni was dead, and Omri reigned. (And the people who were with Omri, had the mastery over the people who followed Tibni, the son of Ginath; and so Tibni was killed, and Omri reigned.)"},{"num":23,"verse":"In the one and thirtieth year of Asa, king of Judah, Omri reigned upon Israel, twelve years; in Tirzah, he reigned six years. (In the one and thirtieth year of Asa, the king of Judah, Omri began to reign upon Israel, and he reigned for twelve years; the first six years he reigned in Tirzah.)"},{"num":24,"verse":"And he bought of Shemer, for two talents of silver, the hill of Samaria, and builded (on) that hill; and he called the name of the city, which he had builded, by the name of Shemer, [the] lord of the hill of Samaria. (And he bought the hill of Samaria from Shemer, for two talents of silver, and built a city on that hill; and he called the name of the city, which he built, Samaria, after the name of Shemer, the former lord of that hill.)"},{"num":25,"verse":"Forsooth Omri did evil in the sight of the Lord, and wrought waywardly, or wickedly, over all men that were before him. (But Omri did evil before the Lord, and acted more wickedly than all the kings who were before him.)"},{"num":26,"verse":"And he went in all the way of Jeroboam, the son of Nebat, and in his sins, by which he made Israel to do sin, that he should stir to ire, in his vanities, the Lord God of Israel. (And he went in all the ways of Jeroboam, the son of Nebat, and in his sins, by which he made Israel to do sin, so that they stirred the Lord God of Israel to anger with their worthless idols.)"},{"num":27,"verse":"Forsooth the residue of the words of Omri, and his battles, which he did, whether these be not written in the book of [the] words of [the] days of the kings of Israel?"},{"num":28,"verse":"And Omri slept with his fathers, and was buried in Samaria; and Ahab, his son, reigned for him."},{"num":29,"verse":"Forsooth Ahab, the son of Omri, reigned upon Israel, in the eight and thirtieth year of Asa, king of Judah; and Ahab, the son of Omri, reigned upon Israel, in Samaria, two and twenty years. (Then Ahab, the son of Omri, began to reign upon Israel in the thirty-eighth year of Asa, the king of Judah; and Ahab, the son of Omri, reigned upon Israel, in Samaria, for twenty-two years.)"},{"num":30,"verse":"And Ahab, the son of Omri, did evil in the sight of the Lord, over all men that were before him; (And Ahab, the son of Omri, did evil before the Lord, more than all the kings who were before him;)"},{"num":31,"verse":"and it sufficed not to him that he went in the sins of Jeroboam, the son of Nebat, furthermore and he wedded a wife, Jezebel, the daughter of Ethbaal, king of Sidonians; and he went and served Baal, and worshipped him. (and it was not sufficient for him that he merely went in the sins of Jeroboam, the son of Nebat, but moreover he wedded Jezebel for a wife, Ethbaal’s daughter, the king of the Sidonians; and he went and served Baal, and worshipped him.)"},{"num":32,"verse":"And he set up an altar to Baal in the temple of Baal, which he had builded in Samaria,"},{"num":33,"verse":"and he planted a maumet wood; and Ahab added to (that) in his work, and stirred to ire the Lord God of Israel, more than all [the] kings of Israel that were before him. (and he planted an idol grove/and he put up a sacred pole; and Ahab did more with his deeds, to stir the Lord God of Israel to anger, than all the kings of Israel who were before him.)"},{"num":34,"verse":"Forsooth in his days Hiel of Bethel builded Jericho; in Abiram, his first son, he founded it, and in Segub, his last son, he setted the gates thereof, by the word of the Lord, which he had spoken in the hand of Joshua, the son of Nun. (And in his days Hiel of Bethel rebuilt Jericho; he lost Abiram, his first son, at the time that he founded it, and he lost Segub, his last son, when he put up its gates, by the word of the Lord, which he had spoken by Joshua, the son of Nun.)"}]