[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Evil thoughts, . . . blasphemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The plural form points to the manifold variety of the forms of guilt under each several head. The order is in some measure an ascending one, beginning with the “thoughts,” or rather trains of thought, which are the first suggestions of evil, and ending in the “blasphemies” or revilings which, directly or indirectly, have God and not man for their object. In this beginning and end we may trace a reference to those “evil surmises” which had led the Pharisees, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to words which were blasphemy against the Son of Man, and came perilously near to the blasphemy against the Holy Spirit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:10-20 Christ shows that the defilement they ought to fear, was not from what entered their mouths as food, but from what came out of their mouths, which showed the wickedness of their hearts. Nothing will last in the soul but the regenerating graces of the Holy Spirit; and nothing should be admitted into the church but what is from above; therefore, whoever is offended by a plain, seasonable declaration of the truth, we should not be troubled at it. The disciples ask to be better taught as to this matter. Where a weak head doubts concerning any word of Christ, an upright heart and a willing mind seek for instruction. It is the heart that is desperately wicked, Jer 17:9, for there is no sin in word or deed, which was not first in the heart. They all come out of the man, and are fruits of that wickedness which is in the heart, and is wrought there. When Christ teaches, he will show men the deceitfulness and wickedness of their own hearts; he will teach them to humble themselves, and to seek to be cleansed in the Fountain opened for sin and uncleanness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Christ proceeds to state what does defile the man, or render him a sinner:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. \"Evil thoughts\" These are the first things - these are the fountains of all others. Thought precedes action. Thought, or purpose, or motive, gives its character to conduct. All evil thoughts are here intended. Though we labor to suppress them, yet they defile us. They leave pollution behind them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. \"Murders.\" Taking the life of others with malice. The malice has its seat in the heart, and the murder therefore proceeds from the heart, 1 John 3:15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "2. \"Murders.\" Taking the life of others with malice. The malice has its seat in the heart, and the murder therefore proceeds from the heart, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "3. \"Adulteries, fornication.\" See Matthew 5:28.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "3. \"Adulteries, fornication.\" See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "4. \"Thefts.\" Theft is the taking and carrying away the goods of others without their knowledge or consent. Thefts are caused by coveting the property of others. They proceed, therefore, from the heart, and violate at the same time two commandments - the tenth commandment in thought and the eighth commandment in act.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. \"False witness.\" Giving wrong testimony. Concealing the truth, or stating what we know to be false - a violation of the ninth commandment. It proceeds from a desire to injure others, to take away their character or property, or to do them injustice. It proceeds thus from the heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6. \"Blasphemies.\" See the notes at Matthew 9:3. Blasphemy proceeds from opposition to God, hatred of his character Romans 8:7, and from a desire that there should be no God. It proceeds from the heart. See Psalm 14:1. Mark adds several things to those enumerated by Matthew:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "6. \"Blasphemies.\" See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Blasphemy proceeds from opposition to God, hatred of his character ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and from a desire that there should be no God. It proceeds from the heart. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Mark adds several things to those enumerated by Matthew:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) \"Covetousness.\" The unlawful desire of what others possess, this always proceeds from the heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) \"Wickedness.\" The original here means malice, or a desire of injuring others, Romans 1:29.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) \"Wickedness.\" The original here means malice, or a desire of injuring others, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) \"Deceit,\" i. e., fraud, concealment, cheating in trade. This proceeds from a desire to benefit ourselves by doing injustice to others, and this proceeds from the heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Lasciviousness. Lust, obscenity, unbridled passion - a strong, evil desire of the heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) \"An evil eye.\" That is, an eye that is sour, malignant, proud; or an eye of lust and passion. See Matthew 5:28; Matthew 20:15; 2 Peter 2:14, \"Having eyes full of adultery, that cannot cease from sin.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) \"An evil eye.\" That is, an eye that is sour, malignant, proud; or an eye of lust and passion. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Having eyes full of adultery, that cannot cease from sin.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"Pride.\" An improper estimate of our own importance; thinking that we are of much more consequence than we really are. This is always the work of an evil heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) \"Foolishness.\" Not a lack of intellect - man is not to blame for that - but a moral folly, consisting in choosing evil ends and the bad means of gaining them; or, in other words, sin and wickedness. All sin is folly. It is foolish for a man to disobey God, and foolish for anyone to go to hell.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g) \"Foolishness.\" Not a lack of intellect - man is not to blame for that - but a moral folly, consisting in choosing evil ends and the bad means of gaining them; or, in other words, sin and wickedness. All sin is folly. It is foolish for a man to disobey God, and foolish for anyone to go to hell.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. For out of the heart proceed evil thoughts—\"evil reasonings\"; referring here more immediately to those corrupt reasonings which had stealthily introduced and gradually reared up that hideous fabric of tradition which at length practically nullified the unchangeable principles of the moral law. But the statement is far broader than this; namely that the first shape which the evil that is in the heart takes, when it begins actively to stir, is that of \"considerations\" or \"reasonings\" on certain suggested actions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "murders, adulteries, fornications, thefts, false witness, blasphemies—detractions, whether directed against God or man; here the reference seems to be to the latter. Mark (Mr 7:22) adds, \"covetousnesses\"—or desires after more; \"wickednesses\"—here meaning, perhaps, malignities of various forms; \"deceit, lasciviousness\"—meaning, excess or enormity of any kind, though by later writers restricted to lewdness; \"an evil eye\"—meaning, all looks or glances of envy, jealousy, or ill will towards a neighbor; \"pride, foolishness\"—in the Old Testament sense of \"folly\"; that is, criminal senselessness, the folly of the heart. How appalling is this black catalogue!",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 15:20\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For out of the heart proceed evil thoughts,.... Of God, of Christ, of the Spirit, of fellow creatures, and of all sorts of wickedness. The thoughts of sin are evil, are to be hated, forsaken, and for which men are accountable to God. All wicked imaginations, carnal reasonings, lustful desires, and malicious contrivances, are here included; which take their rise from, and are devised, and forged, in the corrupt heart of man. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Murders; inveterate hatred of men's persons, malice prepense, schemes to take away life, all angry and wrathful words, and actual effusion of man's blood. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Adulteries; uncleanness committed between married persons, both in thought, and deed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fornications; unlawful copulations of persons in a single state: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thefts; taking away from others by force or fraud, what is their right and property: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "false witness: swearing falsely, or exhibiting a false testimony to the hurt of his neighbour, either his name, person, or estate: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "blasphemies; evil speakings of God or men. To which Mark adds \"covetousness\"; a greedy and insatiable desire after the things of the world, or the neighbour's goods: \"wickedness\"; doing hurt and mischief to fellow creatures: \"deceit\"; in words and actions, in trade and conversation: \"lasciviousness\"; all manner of uncleanness, and unnatural lusts: \"an evil eye\"; of envy and covetousness: the vitiosity, or corruption of nature, is, by the Jews (h), called  \"the evil eye\": \"pride\"; in heart and life, in dress and gesture; and \"foolishness\"; expressed in talk and conduct. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Tzeror Hammor, fol. 141. 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Tzeror Hammor, fol. 141. 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For out of the heart proceed evil thoughts, murders, adulteries, fornications, thefts, false witness, blasphemies:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φόνοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: breaches of Sixth, Seventh, Eighth, and Ninth Commandments in succession.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For out of the heart proceed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The enumeration follows the order of the Commandments. Evil thoughts—harmful reasonings—form a class under which the rest fall, indicating, too, that the transgression of the Commandments is often in thought, by Christ’s law, not in deed only. For “blasphemies,” which may be thought to sum up the first table, St Mark, whose order differs slightly, has “covetousness,” thus completing the decalogue, and adds to the list in the text “wickedness, deceit, lasciviousness, an evil eye, pride, foolishness.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The plurals “murders, adulteries,” &c., as Meyer points out, denote the different instances and kinds of murder and adultery. Murder includes far more than the act of bloodshed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Διαλογισμοὶ πονηροὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil thoughts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") such as the Pharisees entertained. The article is added in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φόνοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μοιχεῖαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "murders, adulteries",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) Sin against the sixth and following commandments. The plural number increases the force.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βλασφημίαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "curses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. against our neighbour, combined with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "false witness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In such enumerations, the absence of the copulative conjunction has often the force of etc., as if he who speaks wished to add more, or to leave more to the imagination.—Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[692]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[692] The filth of the draught is not so great as is that of a human heart not yet cleansed. Who is there that thoroughly weighs this consideration? who strives earnestly after true purity? But, as concerns the man who leaves this life destitute of such purity, whither is he rushing? Into the gulf of fire and brimstone. Alas! what a mass of filth that shall be, which is made up of so many impure beings! Be not offended, Reader. Offensiveness of language is profitable to be used in this case. See that thou dost conceive a loathing of the thing itself, and be moved to flee from impurity of heart.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Out of the heart proceed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The shameful catalogue which follows is less full than that in St. Mark, which contains thirteen items, while this consists of seven only. These are produced or created by the human will, of which the heart is the symbol. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Evil thoughts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διαλογισμοὶ πονηροί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Some would translate the words, \"evil machinations.\" But there is no need to change the usual rendering, which is very appropriate here. Evil thoughts are the preparation of all other sins, and have a pernicious influence on the character. We are very much what we think. That on which our minds are fixed, that which is the chief object presented to our inward sight, shapes our disposition and life. High and noble thoughts elevate and purify; low and mean thoughts debase and pollute. The wickedness in a man springs from within; he is guilty of it. If he admits the tempter, succumbs to his seductions, it is his own will that is in fault, encouraging the evil imagination, and not at once resisting, abhorring, and repelling it. Well may we pray, \"Create in me a clean heart, O God; and renew a right spirit within me\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and remember the wise man's injunction, \"Keep thy heart with all diligence; for out of it are the issues of life\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The enumeration follows more or less closely the second table of the Decalogue. Matthew 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Out of the heart",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare Plato. \"For all good and evil, whether in the body or in human nature, originates, as he declared, in the soul, and overflows from thence, as from the head into the eyes; and therefore, if the head and body are to be well, you must begin by curing the soul. That is the first thing\" (\"Charmides,\" 157).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thoughts (διαλογισμοὶ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., reasonings (compare Mark 9:33, Rev.), or disputings (Philippians 2:14), like the captious questioning of the Pharisees about washing hands. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lit., reasonings (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Rev.), or disputings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), like the captious questioning of the Pharisees about washing hands. ",
            "children": []
          }
        ]
      }
    ]
  }
]