[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall be free.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " italics show, are not in the Greek, and if we follow the better reading, are not wanted to complete the sense. “Whosoever shall say to his father or his mother, It is a gift, by whatsoever thou mightest be profited by me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall not honour ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., shall not support",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " his father or his mother.”",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The “honour” which the commandment enjoined was identified with the duty which was its first and most natural expression.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By your tradition.—As before, for the sake of. They had inverted the right relation of the two, and made the tradition an end, and not a means. St. Mark (Mark 7:9) gives what we cannot describe otherwise than as a touch of grave and earnest irony, in the truest and best sense of that word, “Full well ye reject the commandment of God, that ye may keep your own traditions.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "By your tradition.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As before, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "for the sake of.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " They had inverted the right relation of the two, and made the tradition an end, and not a means. St. Mark (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") gives what we cannot describe otherwise than as a touch of grave and earnest irony, in the truest and best sense of that word, “Full well ye reject the commandment of God, that ye may keep your own traditions.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:1-9 Additions to God's laws reflect upon his wisdom, as if he had left out something which was needed, and which man could supply; in one way or other they always lead men to disobey God. How thankful ought we to be for the written word of God! Never let us think that the religion of the Bible can be improved by any human addition, either in doctrine or practice. Our blessed Lord spoke of their traditions as inventions of their own, and pointed out one instance in which this was very clear, that of their transgressing the fifth commandment. When a parent's wants called for assistance, they pleaded, that they had devoted to the temple all they could spare, even though they did not part with it, and therefore their parents must expect nothing from them. This was making the command of God of no effect. The doom of hypocrites is put in a little compass; In vain do they worship me. It will neither please God, nor profit themselves; they trust in vanity, and vanity will be their recompence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is a gift - In Mark it is \"corban.\" The word \"corban\" is a Hebrew word denoting a gift.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Here it means a thing dedicated to the service of God, and therefore not to be appropriated to any other use. The Jews were in the habit of making such dedications. They devoted their property to God for sacred uses, as they pleased. In doing this they used the word קרבן  qaarbaan or κορβᾶν  korban, or some similar word, saying, this thing is \"corban,\" i. e., it is a gift to God, or is sacred to him. The law required that when a dedication of this kind was made it should be fulfilled. \"Vow and pay unto the Lord your God,\" Psalm 76:11. See Deuteronomy 23:21. The law of God required that a son should honor his parent; i. e., among other things, that he should provide for his needs when he was old and in distress. Yet the Jewish teachers said that it was more important for a man to dedicate his property to God than to provide for the needs of his parent.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here it means a thing dedicated to the service of God, and therefore not to be appropriated to any other use. The Jews were in the habit of making such dedications. They devoted their property to God for sacred uses, as they pleased. In doing this they used the word קרבן  qaarbaan or κορβᾶν  korban, or some similar word, saying, this thing is \"corban,\" i. e., it is a gift to God, or is sacred to him. The law required that when a dedication of this kind was made it should be fulfilled. \"Vow and pay unto the Lord your God,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 76:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The law of God required that a son should honor his parent; i. e., among other things, that he should provide for his needs when he was old and in distress. Yet the Jewish teachers said that it was more important for a man to dedicate his property to God than to provide for the needs of his parent.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If he had once devoted his property once said it was \"corban,\" or a gift to God - it could not be appropriated even to the support of a parent. If a parent was needy and poor, and if he should apply to a son for assistance, and the son should reply, though in anger, \"It is devoted to God; this property which you need, and by which you might be profited by me, is \"corban\" - I have given it to God;\" the Jews said the property could not be recalled, and the son was not under obligation to aid a parent with it. He had done a more important thing in giving it to God. The son was free. He could not be required to do anything for his father after that. Thus, he might, in a moment, free himself from the obligation to obey his father or mother. In a sense somewhat similar to this, the chiefs and priests of the Sandwich Islands had the power of devoting anything to the service of the gods by saying that it was \"taboo,\" or \"tabooed;\" that is, it became consecrated to the service of religion; and, no matter who had been the owner, it could then be appropriated for no other use. In this way they had complete power over all the possessions of the people, and could appropriate them for their own use under the pretence of devoting them to religion. Thus, they deprived the people of their property under the plea that it was consecrated to the gods. The Jewish son deprived his parents of a support under the plea that the property was devoted to the service of religion. The principle was the same, and both systems were equally a violation of the rights of others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Besides, the law said that a man should die who cursed his father, i. e., that refused to obey him, or to provide for him, or spoke in anger to him. Yet the Jews said that, though in anger, and in real spite and hatred, a son said to his father, \"All that I have which could profit you I have given to God,\" he should be free from blame. Thus, the whole law was made void, or of no use, by what appeared to have the appearance of piety. \"No man, according to their views, was bound to obey the fifth commandment and support an aged and needy parent, if, either from superstition or spite, he chose to give his property to God, that is, to devote it to some religious use.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Our Saviour did not mean to condemn the practice of giving to God, or to religious and charitable objects. The law and the gospel equally required this. Jesus commended even a poor widow that gave all her living, Mark 12:44, but he condemned the practice of giving to God where it interfered with our duty to parents and relations; where it was done to get rid of the duty of aiding them; and where it was done out of a malignant and rebellious spirit, with the semblance of piety, to get clear of doing to earthly parents what God required.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Our Saviour did not mean to condemn the practice of giving to God, or to religious and charitable objects. The law and the gospel equally required this. Jesus commended even a poor widow that gave all her living, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 12:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but he condemned the practice of giving to God where it interfered with our duty to parents and relations; where it was done to get rid of the duty of aiding them; and where it was done out of a malignant and rebellious spirit, with the semblance of piety, to get clear of doing to earthly parents what God required.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. And honour not his father or his mother, he shall be free—that is, It is true, father—mother—that by giving to thee this, which I now present, thou mightest be profited by me; but I have gifted it to pious uses, and therefore, at whatever cost to thee, I am not now at liberty to alienate any portion of it. \"And,\" it is added in Mark (Mr 7:12), \"ye suffer him no more to do aught for his father or his mother.\" To dedicate property to God is indeed lawful and laudable, but not at the expense of filial duty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus have ye made the commandment of God of none effect—cancelled or nullified it \"by your tradition.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 4-6. Mark hath much the same, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 7:10-13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:10-13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mark saith ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is the same with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God commanded:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God commanded by Moses. Mark saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is Corban, that is to say, a gift.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Mark addeth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 7:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And ye suffer him no more to do aught for his father or mother; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which more fully shows their crime, and expounds what Matthew had said more shortly. Mark adds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and many such like things do ye.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is an instance by which our Saviour justifieth his charge upon them, that they had made void the law of God by their traditions. The law he instances in is the fifth commandment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 20:12 Deu 5:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 5:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which the apostle calleth ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the first commandment with promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ephesians 6:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 6:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which God had fortified with a judicial law, wherein he had commanded, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he who cursed his father and mother should be put to death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 21:17 Leviticus 20:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 21:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " he had also further threatened the violaters of this law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 20:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 20:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". By the way, our Saviour here also lets us know, that the fifth commandment obliges children to relieve their parents in their necessity, and this is the sense of the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "honour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in other texts of Scripture: a law of God which hath approved itself to the wisdom almost of all nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Liberi parentes alant aut vinciantur, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Let children relieve their parents or be put into prison, was an old Roman law. Nor did the Pharisees deny this in terms, but they had made an exception from it, which in effect made it of no use, at least such as wicked children easily might, and commonly did, elude it by: they had taught the people to say to their parents, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is Corban, that is to say, a gift, by whatsoever thou mightest be profited by me:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in that case, though they did not give their poor parents any thing wherewith they might relieve their necessities, yet they should be guiltless as to the fifth commandment. There is a strange variety of interpreters as to this text. Some making the sense this, That which I should relieve you with I have dedicated unto God, and therefore I cannot relieve you. Others thus, I have dedicated my estate to God, and that will be as much good and benefit to you, as if I had given it unto you. Others think that Corban was the form of an oath, from whence they form other senses. But the most free and unconstrained sense seemeth to be this: The Pharisees were a very courteous generation, and had a share in the gifts that were brought unto God for the use of the temple or otherwise; thence they were very zealous and diligent in persuading people to make such oblations. When any pretended the need that their parents stood in of their help, they told them, that if they told their parents it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a gift, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they had vowed such a portion of their estate to a sacred use, that would before God excuse them for not relieving their parents; so as the precept of honouring their parents, and relieving them in their necessities, obliged them not, if they had first given to God the things by which their parents might or ought to have been relieved. Thus he tells them, that by their traditions, under pretence of a more religion, and expounding the Divine law, they had indeed destroyed it, and made it of no effect at all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But ye say, whosoever shall say to his father or mother,.... That is, it was a tradition of their's, that if a man should say to his father and mother, when poor and in distress, and made application to him for sustenance, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it is a gift, by whatsoever thou mightest be profited by me, and honour not his father, or his mother, he shall be free: or, as Mark expresses it, \"it is Corban, that is to say, a gift, by whatsoever thou mightest be profited by me, he shall be free, and ye suffer him no more to do ought for his father or mother\". For the understanding of this tradition, let it be observed, that the word \"Corban\" signifies a gift, or offering, which was devoted to sacred use; and was unalienable, and could not be converted to any other use; and that this word was used among the Jews, from hence, as the form of an oath, or vow; and therefore, when anyone said \"Corban\", it was all one, as if he swore by \"Corban\"; or as if he had said, let it be as \"Corban\", as unalienable as \"Corban\": by which oath, or vow, the use of that which was spoken of, whether it respected a man's self, or others, was restrained and prohibited: the rule was (r) this    , \"if a man said Corban, it was as if he said as Corban, and it was forbidden\": and if he used the words \"Conem\", \"Conach\", and \"Conas\", which they call (s) the surnames of Corban, and were no other than corruptions of it, it was all one as if he had said \"Corban\" itself. There are many instances of this kind of vows, and the form of them in their oral law (t), or book of traditions; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"If anyone should say,  , \"Conem (or \"Corban\") whatsoever I might be profited by the\" sons of Noah, it is free of an Israelite, and forbidden of a Gentile; if he should say, \"whatsoever I might be profited\" by the seed of Abraham, it is forbidden of an Israelite, and is free of a Gentile--if anyone should say,   , \"Conem (or \"Corban\") whatsoever I might be profited by the uncircumcised\", it is free of the uncircumcised of Israel, and forbidden of the circumcised of the Gentiles; if he says \"Conem (or \"Corban\") whatsoever I might be profited by the circumcised\", it is forbidden of the circumcised of Israel, and free of the circumcised, of the Gentiles.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Again (u), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if anyone says to his friend,   , \"Conem (or \"Corban\") whatsoever thou mightest be profited by me\", &c.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which is exactly the same form as here, unless it should be rather rendered, \"whatsoever I might be profited by thee\": once more (w), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if a married woman should say to her husband,    \"Conem (or Corban) whatsoever I might be profited by my father, or thy father, &c\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let these instances suffice: the plain and evident sense of the tradition before us, is this; that when, upon application being made to a man by his parents, for support and sustenance, he makes a vow in such form as this, \"Corban, whatsoever thou mightest be profited by me\"; that is, whatsoever profit or advantage thou mightest have, or expect to have from me, let it be as \"Corban\", as a gift devoted to God, that can never be revoked and converted to another use; or, in other words, I vow and protest thou shalt never have any profit from me, not a penny, nor a pennyworth of mine. Now, when a man had made such an impious vow as this, according to this tradition, it was to stand firm and good, and he was not to honour his father or mother, or do anything for them, by way of relief: so that our Lord might justly observe upon it as he does; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thus have ye made the commandment of God of none effect, by your tradition: for if such a vow was valid, and a man was obliged to abide by it, according to the tradition of the elders, and not honour his father and mother, as the law of God requires; it is a plain case, that the command of God was made void by this tradition: nay they expressly say (x) that    , \"vows fall upon things of a (divine) commandment\", as well as upon things in a man's power, and that he is bound by them; so that without sin he cannot do what the law commands; insomuch, that if a man vows a vow, and that it may be ratified, a command must be made void, his vow must stand, and the command be abrogated. So truly and justly does Christ charge them with making the command of God of none effect, by their tradition. It is indeed disputed by the doctors, and at last allowed, that such a vow might be dissolved by a wise man, for the honour of parents (y). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"R. Eliezer says, they open to a man, (i.e. the door of repentance, and dissolve his vow,) for the honour of his father and his mother, but the wise men forbid \"it\". Says R. Tzadok, if they open to him for the honour of his father and mother, they will open to him for the honour of God, and if so, there will be no vows: however, the wise men agreed with R. Eliezer in the affair between a man and his parents, that they should open to him for the honour of them.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And this could be done only by a wise man; and very probably this last decree was made on account of this just reproof of Christ's, being ashamed any longer to countenance so vile a practice; and even, according to this determination, the vow stood firm till dissolved by of their doctors: so that notwithstanding, Christ's argument is good, and the instance full to prove that for which he brought it: for the above reason it may be, it is, that this tradition Christ refers to is not now extant; but that there was such an one in Christ's time, is certain; he would never have asserted it else; and had it not been true, the Pharisees would have been able to have retired him, and forward enough to have done it: and that such vows were sometimes made, and which were not to be rescinded, is clear from the following fact (z). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"It happened to one in Bethhoron,     \"whose father was excluded, by a vow, from receiving any profit from him\": and he married his son, and said to his friend, a court and a dinner are given to thee by gift; but they are not to be made use of by thee, but with this condition, that my father may come and eat with us at dinner;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which was a device to have his father at dinner, and yet secure his vow. Upon the whole, the sense of this passage is, not that a man excused himself to his parents, according to this tradition, by saying, that his substance, either in whole, or in part, was \"Corban\", or devoted to the service of God, and therefore they could expect no profit, or relief, from him; but that he vowed that what he had should be as \"Corban\", and they should be never the better for it: so that a man so vowing might give nothing to the service of God, but keep his whole substance to himself; which he might make use of for his own benefit, and for the benefit of others, but not for his father and mother; who, after such a vow made, were to receive no benefit by it, unless rescinded by a wise man; and which seems to be an explanation of it, made after the times of Christ. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) T. Hieros. Nedarim, fol. 37. 1. Misn. Nedarim, c. 1. sect. 4. Maimon. Hilch. Nedarim, c. 1. sect. 7. (s) Misn. Nedarim, c. 1. sect. 1, 2. Maimon. Hilch. Nedarim, c. 1. sect. 16. (t) Misn. Nedarim, c. 3. sect. 11. (u) lb. c. 8. sect. 7. Vid. c. 11. sect 3, 4. (w) lb. c. 11. sect. 11. (x) Maimon. Hilch. Nedarim, c. 3. sect. 1. 6, 7. 9. (y) Misn. Nedarim, c. 9. sect. 1.((z) lb. c. 5. sect. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) T. Hieros. Nedarim, fol. 37. 1. Misn. Nedarim, c. 1. sect. 4. Maimon. Hilch. Nedarim, c. 1. sect. 7. (s) Misn. Nedarim, c. 1. sect. 1, 2. Maimon. Hilch. Nedarim, c. 1. sect. 16. (t) Misn. Nedarim, c. 3. sect. 11. (u) lb. c. 8. sect. 7. Vid. c. 11. sect 3, 4. (w) lb. c. 11. sect. 11. (x) Maimon. Hilch. Nedarim, c. 3. sect. 1. 6, 7. 9. (y) Misn. Nedarim, c. 9. sect. 1.((z) lb. c. 5. sect. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And honour not his father or his mother, he shall be free. Thus have ye made the commandment of God of none {d} effect by your tradition.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And honour not his father or his mother, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "he shall be free",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus have ye made the commandment of God of none ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " effect by your tradition.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) As much as you could, you destroyed the power and authority of the commandment: for otherwise the commandments of God stand fast in the Church of God, in spite of the world and Satan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἠκυρώσατε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ye invalidated, by making such a rule, the aorist pointing to the time when the rule was made. Or it may be a gnomic aorist: so ye are wont to, etc. The verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀκυρόω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " belongs to later Greek, though Elsner calls the phrase “bene Graeca”.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑμῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": an account of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tradition, again to mark it as their idol, and as theirs alone, God having no part in it, though the Rabbis taught that it was given orally by God to Moses.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall be free",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These words do not occur in the original, either here or in the parallel passage in Mark. It is as if the indignation of Jesus did not allow him to utter the words of acquittal. The silence is more eloquent than the utterance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and thus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on account of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The heart which is occupied with traditions, has no room for the commandments of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And honour not his father or his mother,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he shall be free. The last clause is not in the Greek; it is supplied by our translators, as it was in Coverdale's version, to complete the apodosis. There are various methods of translating the passage. Retaining ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at the beginning of the sentence, some make these words the continuation of the gloss, \"Whosoever shall say,\" etc., the apodosis being found in the sentence following. Others conceive an aposiopesis after \"be profited by me,\" as if Christ refrained from pronouncing the hypocritical and indeed blasphemous words which completed the gloss. In this case the apodosis follows  in ver. 6, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "then such a one will not honour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τιμήα ει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τιμήσῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), etc. The words are best taken as put into the Pharisees' mouth in the sense, \"The man under those circumstances shall not honour,\" etc.; he is free from the obligation of helping his parents. The form of the sentence (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οὐ μὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the future verb) is prohibitory rather than predictive, and implies, \"he is forbidden to honour.\" Christ thus sharply emphasizes the contradiction between God's Law and man's perversion thereof. St. Mark has, \"Ye no longer suffer him to do aught for his father.\" Thus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the apodosis, removing the full stop before it in the Authorized Version. This is our Lord's own saying. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Made...of none effect.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Evacuated its real force and spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "By",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; owing to, for the sake of, as St. Mark says, \"that ye may keep your tradition.\" Our translators often mistake the meaning of the preposition ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the accusative, which never signifies \"by means of.\" Matthew 15:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Have made of none effect (ἠκυρώσατε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rev., made void; ἀ, not, κῦρος, authority. Ye have deprived it of its authority. ",
        "children": []
      }
    ]
  }
]