[{"header":"Nehemiah Helps the Poor"},{"num":5,"verse":"Many of the poor people began to complain against their fellow Jews."},{"num":2,"verse":"Some of them were saying, “We have many children. We must get some grain if we are going to eat and stay alive.”"},{"num":3,"verse":"Other people were saying, “This is a time of famine. We have to use our fields, vineyards, and homes to pay for grain.”"},{"num":4,"verse":"And still other people were saying, “We have to pay the king’s tax on our fields and vineyards. But we cannot afford to pay, so we are borrowing money to pay the tax."},{"num":5,"verse":"We are as good as the others. Our sons are as good as their sons. But we will have to sell our sons and daughters as slaves. Some of us have already had to sell our daughters as slaves. There is nothing we can do. We have already lost our fields and vineyards. Other people own them now.”"},{"num":6,"verse":"When I heard their complaints, I was very angry."},{"num":7,"verse":"I calmed myself down, and then I went to the rich families and the officials. I told them, “You are forcing your own people to pay interest on the money you loan them. You must stop doing that!” Then I called for all the people to meet together"},{"num":8,"verse":"and said to them, “Our fellow Jews were sold as slaves to people in other countries. We did our best to buy them back and make them free. And now, you are selling them like slaves again!”"},{"num":9,"verse":"So I continued speaking. I said, “What you people are doing is not right! You know that you should fear and respect our God. You should not do the shameful things other people do!"},{"num":10,"verse":"My men, my brothers, and I are also lending money and grain to the people. But let’s stop forcing them to pay interest on these loans."},{"num":11,"verse":"You must give their fields, vineyards, olive fields, and houses back to them, right now! And you must give back the interest you charged them. You charged them one percent for the money, grain, new wine, and oil that you loaned them.”"},{"num":12,"verse":"Then the rich people and the officials said, “We will give it back and not demand anything more from them. Nehemiah, we will do as you say.”"},{"num":13,"verse":"Then I shook out the folds of my clothes. I said, “God will do the same thing to everyone who does not keep their promise. God will shake them out of their houses and they will lose everything they worked for. They will lose everything!”"},{"num":14,"verse":"And also, during the whole time that I was appointed to be governor in the land of Judah, neither my brothers nor I ate the food that was allowed for the governor. I never forced the people to pay taxes to buy my food. I was governor from the 20th year until the 32nd year that Artaxerxes was king. I was governor of Judah for twelve years."},{"num":15,"verse":"But the governors who ruled before me made life hard for the people. The governors forced everyone to pay 1 pound of silver. They also made the people give them food and wine. The leaders under these governors also ruled over the people and made life even harder. But I respected and feared God, so I didn’t do things like that."},{"num":16,"verse":"I worked hard at building the wall of Jerusalem. All my men gathered there to work on the wall. We didn’t take any land from anyone."},{"num":17,"verse":"Also, I regularly fed 150 Jews who were always welcome at my table, and I fed those who came to us from the nations around us."},{"num":18,"verse":"Every day I prepared this much food for the people who ate at my table: one ox, six good sheep, and different kinds of birds. Every ten days all kinds of wine were brought to my table. But I never demanded that they give me the food that was allowed for the governor. I knew that the work the people were doing was very hard."},{"num":19,"verse":"My God, remember all the good I have done for these people."}]