[{"header":"Nehemiah Stops Oppression"},{"num":5,"verse":"Now there was a great outcry of the people and their wives against their fellow Jews. "},{"num":2,"verse":"Some were saying, “We and our sons and our daughters are many. Therefore, let us acquire grain so that we may eat and live.”"},{"num":3,"verse":"Others were saying, “We have mortgaged our fields, vineyards, and houses so that we might acquire grain because of hunger.”"},{"num":4,"verse":"Still others were saying, “We have borrowed money for the king’s tribute against the value of our fields and vineyards. "},{"num":5,"verse":"Now our flesh is the same as the flesh of our countrymen. Our children are like their children, but we are subjugating our sons and our daughters as servants. Indeed, some of our daughters are in bondage already, and we are powerless to do anything because our fields and vineyards belong to others.”"},{"num":6,"verse":"I was very angry when I heard their outcry and these words. "},{"num":7,"verse":"So I contemplated about this for myself and, as a result, I rebuked the nobles and officials and said to them, “Based on the claim of each against his brother, you are exacting usury.” Then I convened a great assembly against them, "},{"num":8,"verse":"and I said to them, “By whatever means we had, we purchased our Jewish countrymen who were being sold to the nations. So, will you once more sell your countrymen so that they might again be sold to us?” Then they kept silent, because they found nothing to answer."},{"num":9,"verse":"Also I said, “What you are doing is not good! Should not you walk in the fear of our God because of the reproach of the nations, our enemies? "},{"num":10,"verse":"Moreover, I, my relatives, and my servants are loaning them money and grain. So, I urge you, cease from this practice of usury. "},{"num":11,"verse":"Please restore to them, even this day, their fields, their vineyards, their olive groves, and their houses, along with a hundredth part of the money, the grain, the wine, and the oil that you had exacted from them.”"},{"num":12,"verse":"Then they said, “We will restore it and will require nothing of them. We will do what you have said.”"},{"num":13,"verse":"Also I shook out the front of my garment and said, “Like this, may God shake out every man from his house and from his labor who does not carry out this promise. Exactly like this, may he be shaken out and emptied.”"},{"header":"Nehemiah’s Generosity"},{"num":14,"verse":"Moreover from the time that I was appointed to be their governor in the land of Judah (from the twentieth year even until the thirty-second year of King Artaxerxes) twelve years had passed. And my companions and I had not eaten the governor’s food allotment. "},{"num":15,"verse":"The former governors preceding me had extracted a heavy burden on the people, because they took from them food and wine, besides forty shekels of silver. Moreover, even their servants domineered over the people. But I myself never did so, because of the fear of God. "},{"num":16,"verse":"Furthermore, I stayed determined in the work on this wall. We bought no field, and all my servants were gathered there for the sake of the work."},{"num":17,"verse":"Moreover there were regularly at my table one hundred and fifty Jews and officials, besides those who came to us from the nations around us. "},{"num":18,"verse":"Daily there were one ox and six choice sheep prepared for me. Fowls were also prepared for me. Once in ten days all sorts of wine were supplied in abundance. Yet for all this, I never required the governor’s food allotment because it was a heavy burden on this people."},{"num":19,"verse":"Remember me, O my God, for good, according to all that I have done for this people."}]