[{"header":"Nehemiah Helps Some Poor People"},{"num":5,"verse":"Some men and their wives cried out against their Jewish brothers and sisters. "},{"num":2,"verse":"Some of them were saying, “There are now many of us. We have many sons and daughters. We have to get some grain so we can eat and stay alive.”"},{"num":3,"verse":"Others were saying, “We’re being forced to sell our fields, vineyards and homes. We have to do it to buy grain. There isn’t enough food for everyone.”"},{"num":4,"verse":"Still others were saying, “We’ve had to borrow money. We needed it to pay the king’s tax on our fields and vineyards. "},{"num":5,"verse":"We belong to the same family lines as the rest of our people. Our children are as good as theirs. But we’ve had to sell them off as slaves. Some of our daughters have already been made slaves. But we can’t do anything about it. That’s because our fields and vineyards now belong to others.”"},{"num":6,"verse":"I heard them when they cried out. And I was very angry when I heard what they were saying. "},{"num":7,"verse":"I thought it over for a while. Then I accused the nobles and officials of breaking the law. I told them, “You are charging your own people interest!” So I called together a large group of people to handle the matter. "},{"num":8,"verse":"I said, “Our Jewish brothers and sisters were sold to other nations. We’ve done everything we could to buy them back and bring them home. But look at what you are doing! You are actually selling your own people! Now we’ll have to buy them back too!” The people kept quiet. They couldn’t think of anything to say."},{"num":9,"verse":"So I continued, “What you are doing isn’t right. Shouldn’t you show respect for our God? Shouldn’t you live in a way that will keep our enemies from saying bad things about us? "},{"num":10,"verse":"I’m lending the people money and grain. So are my relatives and my men. But we must stop charging interest! "},{"num":11,"verse":"Give the people’s fields back to them. Give them back their vineyards, olive groves and houses. Do it right away. Give everything back to them. Also give them back the one percent on the money, grain, fresh wine and olive oil you have charged them.”"},{"num":12,"verse":"“We’ll give it back,” they said. “And we won’t require anything more from them. We’ll do exactly as you say.”"},{"num":13,"verse":"I also shook out my pockets and emptied them. I said, “Someone might decide not to keep this promise they have made. If that happens, may God shake them out of their house! May he empty them of everything they own!”"},{"num":14,"verse":"And that’s not all. I was appointed as governor of Judah in the 20th year that Artaxerxes was king of Persia. I remained in that position until his 32nd year. During those 12 years, I and my relatives didn’t eat the food that was provided for my table. "},{"num":15,"verse":"But there had been governors before me. They had put a heavy load on the people. They had taken a pound of silver from each of them. They had also taken food and wine from them. Their officials had acted like high and mighty rulers over them. But because of my great respect for God, I didn’t act like that. "},{"num":16,"verse":"Instead, I spent all my time working on this wall. All my men were gathered there to work on it too. We didn’t receive any land for ourselves."},{"num":17,"verse":"Many people ate at my table. They included 150 Jews and officials. They also included leaders who came to us from the nations that were around us. "},{"num":18,"verse":"Each day one ox, six of the best sheep and some birds were prepared for me. Every ten days plenty of wine of all kinds was brought in as well. In spite of all that, I never asked for the food that was provided for my table. That’s because the people were already paying too many taxes."},{"num":19,"verse":"You are my God. Please remember me and help me. Keep in mind everything I’ve done for these people."}]