[{"header":"Against the neighboring nations"},{"num":25,"verse":"The Lord’s word came to me:"},{"num":2,"verse":"Human one, face the Ammonites and prophesy against them."},{"num":3,"verse":"Say to the Ammonites: Hear the Lord God’s word! The Lord God proclaims: You laughed when my sanctuary was degraded, when Israel’s fertile land was laid waste, and when the house of Judah went into exile;"},{"num":4,"verse":"therefore, I’m handing you over to people in the east for them to take possession. They will set up their encampments against you, establish residence, devour your fruit, and drink your milk."},{"num":5,"verse":"I’ll make Rabbah into pastureland for camels and Ammon a resting place for flocks. Then you will know that I am the Lord."},{"num":6,"verse":"The Lord God proclaims: Because you clapped your hands and stamped your feet when you rejoiced with utter contempt for Israel’s fertile land,"},{"num":7,"verse":"I’m about to overpower you. Nations will plunder you. I will cut you off from the peoples, remove you from the lands, and utterly destroy you. Then you will know that I am the Lord."},{"num":8,"verse":"The Lord God proclaims: Because Moab and Seir say, “Aha! The house of Judah has become like all the nations,”"},{"num":9,"verse":"I’ll open up the flank of Moab from the cities at its border, the land’s splendid cities, Beth-jeshimoth, Baal-meon, and Kiriathaim."},{"num":10,"verse":"I’ll hand it over, along with the Ammonites, to people in the east for them to take possession. And so Ammon will no longer be remembered among the nations."},{"num":11,"verse":"I’ll execute judgments in Moab, and they will know that I am the Lord."},{"num":12,"verse":"The Lord God proclaims: Edom acted with excessive force against the house of Judah. The Judeans were guilty, but Edom’s vengeance was excessive."},{"num":13,"verse":"So the Lord God now proclaims: I’ll overpower Edom, eliminate all living creatures, and make it a wasteland from Teman to Dedan. They will fall by the sword."},{"num":14,"verse":"I will execute my vengeance in Edom through my people Israel’s power. They will act in Edom according to my anger and fury, and they will know my vengeance. This is what the Lord God says."},{"num":15,"verse":"The Lord God proclaims: When the Philistines set out to right the wrongs done to them, they enacted revenge with utter contempt and old hatreds."},{"num":16,"verse":"So now the Lord God proclaims: I will overpower the Philistines, eliminate the Cherethites, and obliterate all who are left along the coastline."},{"num":17,"verse":"I will act against them with great vengeance and with wrathful punishments. When I execute my vengeance against them, they will know that I am the Lord."}]