[{"num":25,"verse":"¶ The word of the LORD came again unto me, saying,"},{"num":2,"verse":"Son of man, set thy face against the sons of Ammon and prophesy against them"},{"num":3,"verse":"and say unto the sons of Ammon, Hear the word of the Lord GOD, Thus hath the Lord GOD said: Because thou didst say, Aha, it is well! upon my sanctuary, which was profaned; and upon the land of Israel, which it was made desolate; and upon the house of Judah, because they went into captivity;"},{"num":4,"verse":"behold, therefore I will deliver thee to the men of the east for a possession, and they shall set their palaces in thee and pitch their tents in thee; they shall eat thy plantings, and they shall drink thy milk."},{"num":5,"verse":"And I will make Rabbah a habitation for camels and the sons of Ammon a resting place for sheep: and ye shall know that I am the LORD."},{"num":6,"verse":"For thus hath the Lord GOD said; Because thou hast clapped thine hands and stamped with the feet and rejoiced in thy soul with all thy despite upon the land of Israel,"},{"num":7,"verse":"behold, therefore I will stretch out my hand upon thee and will deliver thee unto the Gentiles as a spoil, and I will cut thee off from among the peoples, and I will destroy thee from among the countries; I will pluck thee out; and thou shalt know that I am the LORD."},{"num":8,"verse":"¶ Thus hath the Lord GOD said: Because Moab and Seir said, Behold, the house of the LORD is like unto all the Gentiles submitted to Babylon,"},{"num":9,"verse":"therefore, behold, I will open the side of Moab from the cities, from his cities which are on his frontiers, the desirable lands of Bethjeshimoth and Baalmeon and Kiriathaim,"},{"num":10,"verse":"unto the sons of the east against the sons of Ammon and will give them in possession that the sons of Ammon may not be remembered any more among the Gentiles."},{"num":11,"verse":"I will also execute judgments in Moab; and they shall know that I am the LORD."},{"num":12,"verse":"Thus hath the Lord GOD spoken; Because of what Edom did when he took vengeance against the house of Judah, (for they are condemned as guilty) and revenged themselves upon them;"},{"num":13,"verse":"therefore thus hath the Lord GOD said: I will also stretch out my hand upon Edom and will cut off man and beast from her; and I will make her desolate from Teman; and those of Dedan shall fall by the sword."},{"num":14,"verse":"And I will place my vengeance in Edom by the hand of my people Israel: and they shall do in Edom according to my anger and according to my fury; and they shall know my vengeance, said the Lord GOD."},{"num":15,"verse":"Thus hath the Lord GOD said: Because the Palestinians have dealt by revenge and have taken vengeance with a despiteful heart to destroying because of perpetual enmity,"},{"num":16,"verse":"therefore thus hath the Lord GOD said; Behold, I stretch out my hand upon the Palestinians, and I will cut off the Cherethims and destroy the remnant of the sea coast."},{"num":17,"verse":"And I will execute great vengeance in them with furious rebukes; and they shall know that I am the LORD when I shall give my vengeance in them."}]