[{"header":"Chapter 25"},{"num":1,"verse":"Against Ammon. The following word of the Lord was addressed to me:"},{"num":2,"verse":"Son of man, turn toward the Ammonites and prophesy against them."},{"num":3,"verse":"Say to the Ammonites: Hear the word of the Lord God. Thus says the Lord God: Because you raised shouts of joy over my sanctuary when it was profaned, and over the land of Israel when it suffered devastation, and over the house of Judah when it went into exile,"},{"num":4,"verse":"therefore I am handing you over to the people of the East to be their possession. They will establish their camps among you and pitch their tents in your midst. They will eat your fruit and drink your milk."},{"num":5,"verse":"I will turn Rabbah into a pasture for camels and the towns of Ammon into a resting place for sheep. Then you will know that I am the Lord."},{"num":6,"verse":"For thus says the Lord: Because you have clapped your hands and stamped your feet and taken malicious delight in the fall of the land of Israel,"},{"num":7,"verse":"I therefore have stretched out my hand against you, and I will hand you over as plunder to the nations. I will cut you off from other peoples and obliterate you as a country. I intend to completely destroy you. Then you shall know that I am the Lord."},{"num":8,"verse":"Against Moab. Thus says the Lord God: Because Moab said that the house of Judah is like all other nations,"},{"num":9,"verse":"therefore, I will lay open the flank of Moab, beginning with the towns on its frontier—Beth-jesimoth, Baal-meon, and Kiriathaim—the jewels of the country."},{"num":10,"verse":"I will give both Moab and Ammon to the people of the East as their possession. As a result, Ammon will not be remembered among the nations."},{"num":11,"verse":"Moreover, I will render judgment upon Moab, so that they will know that I am the Lord."},{"num":12,"verse":"Against Edom. Thus says the Lord God: Since Edom has acted with vengeance against the house of Judah and has committed a grievous offense in taking vengeance upon them,"},{"num":13,"verse":"the Lord God has made this decision: I will stretch forth my hand against Edom and remove from it both people and animals. I will lay it waste from Teman as far as Dedan, and they will all fall by the sword."},{"num":14,"verse":"I will wreak my vengeance on Edom by the hand of my people Israel, and they will treat Edom according to my anger and my fury. Thus they will know my vengeance, declares the Lord God."},{"num":15,"verse":"Against Philistia. Thus says the Lord God: Inasmuch as the Philistines have engaged in endless hostilities with vengeance, and with malice in their hearts took revenge in destruction,"},{"num":16,"verse":"therefore, thus says the Lord God: I will stretch forth my hand against the Philistines, cut off the Cherethites, and destroy those remaining along the seacoast."},{"num":17,"verse":"I will execute great vengeance on them and punish them in my wrath. Therefore, they will know that I am the Lord when I exact my vengeance on them."}]