[{"header":"Prophecy Against Ammon"},{"num":25,"verse":"The Lord spoke his word to me, saying: "},{"num":2,"verse":"“Human, look toward the people of Ammon and prophesy against them. "},{"num":3,"verse":"Say to them, ‘Hear the word of the Lord God. This is what the Lord God says: You were glad when my Temple was dishonored, when the land of Israel was ruined, and when the people of Judah were taken away as captives. "},{"num":4,"verse":"So I am going to give you to the people of the East to be theirs. They will set up their camps among you and make their homes among you. They will eat your fruit and drink your milk. "},{"num":5,"verse":"I will make the city of Rabbah a pasture for camels and the land of Ammon a resting place for sheep. Then you will know that I am the Lord. "},{"num":6,"verse":"This is what the Lord God says: You have clapped your hands and stamped your feet; you have laughed about all the insults you made against the land of Israel. "},{"num":7,"verse":"So I will use my power against you. I will give you to the nations as if you were treasures taken in war. I will wipe you out of the lands so you will no longer be a nation, and I will destroy you. Then you will know that I am the Lord.’"},{"header":"Prophecy Against Moab and Edom"},{"num":8,"verse":"“This is what the Lord God says: ‘Moab and Edom say, “The people of Judah are like all the other nations.” "},{"num":9,"verse":"So I am going to take away the cities that protect Moab’s borders, the best cities in that land: Beth Jeshimoth, Baal Meon, and Kiriathaim. "},{"num":10,"verse":"Then I will give Moab, along with the Ammonites, to the people of the East as their possession. Then, along with the Ammonites, Moab will not be a nation anymore. "},{"num":11,"verse":"So I will punish the people of Moab, and they will know that I am the Lord.’"},{"header":"Prophecy Against Edom"},{"num":12,"verse":"“This is what the Lord God says: ‘Edom took revenge on the people of Judah, and the Edomites became guilty because of it. "},{"num":13,"verse":"So this is what the Lord God says: I will use my power against Edom, killing every human and animal in it. And I will destroy Edom all the way from Teman to Dedan as they die in battle. "},{"num":14,"verse":"I will use my people Israel to take revenge on Edom. So the Israelites will do to Edom what my hot anger demands. Then the Edomites will know what my revenge feels like, says the Lord God.’"},{"header":"Prophecy Against Philistia"},{"num":15,"verse":"“This is what the Lord God says: ‘The Philistines have taken revenge with hateful hearts. Because of their strong hatred, they have tried to destroy Judah. "},{"num":16,"verse":"So this is what the Lord God says: I will use my power against the Philistines. I will kill the Kerethites, and I will destroy those people still alive on the coast of the Mediterranean Sea. "},{"num":17,"verse":"I will punish them in my anger and do great acts of revenge to them. They will know that I am the Lord when I take revenge on them.’”"}]