[{"num":3,"verse":"You have been raised to life with Christ. Now set your heart on what is in heaven, where Christ rules at God’s right side. "},{"num":2,"verse":"Think about what is up there, not about what is here on earth. "},{"num":3,"verse":"You died, which means that your life is hidden with Christ, who sits beside God. "},{"num":4,"verse":"Christ gives meaning to your life, and when he appears, you will also appear with him in glory."},{"num":5,"verse":"Don’t be controlled by your body. Kill every desire for the wrong kind of sex. Don’t be immoral or indecent or have evil thoughts. Don’t be greedy, which is the same as worshiping idols. "},{"num":6,"verse":"God is angry with people who disobey him by doing these things. "},{"num":7,"verse":"And that is exactly what you did, when you lived among people who behaved in this way. "},{"num":8,"verse":"But now you must stop doing such things. You must quit being angry, hateful, and evil. You must no longer say insulting or cruel things about others. "},{"num":9,"verse":"And stop lying to each other. You have given up your old way of life with its habits."},{"num":10,"verse":"Each of you is now a new person. You are becoming more and more like your Creator, and you will understand him better. "},{"num":11,"verse":"It doesn’t matter if you are a Greek or a Jew, or if you are circumcised or not. You may even be a barbarian or a Scythian, and you may be a slave or a free person. Yet Christ is all that matters, and he lives in all of us."},{"num":12,"verse":"God loves you and has chosen you as his own special people. So be gentle, kind, humble, meek, and patient. "},{"num":13,"verse":"Put up with each other, and forgive anyone who does you wrong, just as Christ has forgiven you. "},{"num":14,"verse":"Love is more important than anything else. It is what ties everything completely together."},{"num":15,"verse":"Each one of you is part of the body of Christ, and you were chosen to live together in peace. So let the peace that comes from Christ control your thoughts. And be grateful. "},{"num":16,"verse":"Let the message about Christ completely fill your lives, while you use all your wisdom to teach and instruct each other. With thankful hearts, sing psalms, hymns, and spiritual songs to God. "},{"num":17,"verse":"Whatever you say or do should be done in the name of the Lord Jesus, as you give thanks to God the Father because of him."},{"header":"Some Rules for Christian Living"},{"num":18,"verse":"A wife must put her husband first. This is her duty as a follower of the Lord."},{"num":19,"verse":"A husband must love his wife and not abuse her."},{"num":20,"verse":"Children must always obey their parents. This pleases the Lord."},{"num":21,"verse":"Parents, don’t be hard on your children. If you are, they might give up."},{"num":22,"verse":"Slaves, you must always obey your earthly masters. Try to please them at all times, and not just when you think they are watching. Honor the Lord and serve your masters with your whole heart. "},{"num":23,"verse":"Do your work willingly, as though you were serving the Lord himself, and not just your earthly master. "},{"num":24,"verse":"In fact, the Lord Christ is the one you are really serving, and you know that he will reward you. "},{"num":25,"verse":"But Christ has no favorites! He will punish evil people, just as they deserve."}]