[{"header":"Trouble in Thessalonica"},{"num":17,"verse":"After Paul and his friends had traveled through Amphipolis and Apollonia, they went on to Thessalonica. A Jewish meeting place was in that city. "},{"num":2,"verse":"So as usual, Paul went there to worship, and on three Sabbaths he spoke to the people. He used the Scriptures "},{"num":3,"verse":"to show them that the Messiah had to suffer, but that he would rise from death. Paul also told them that Jesus is the Messiah he was preaching about. "},{"num":4,"verse":"Some of them believed what Paul had said, and they became followers with Paul and Silas. Some Gentiles and many important women also believed the message."},{"num":5,"verse":"The Jewish leaders were jealous and got some worthless bums who hung around the marketplace to start a riot in the city. They wanted to drag Paul and Silas out to the mob, and so they went straight to Jason’s home. "},{"num":6,"verse":"But when they did not find them there, they dragged out Jason and some of the Lord’s followers. They took them to the city authorities and shouted, “Paul and Silas have been upsetting things everywhere. Now they have come here, "},{"num":7,"verse":"and Jason has welcomed them into his home. All of them break the laws of the Roman Emperor by claiming that someone named Jesus is king.”"},{"num":8,"verse":"The officials and the people were upset when they heard this. "},{"num":9,"verse":"So they made Jason and the other followers pay bail before letting them go."},{"header":"People in Berea Welcome the Message"},{"num":10,"verse":"That same night the Lord’s followers sent Paul and Silas on to Berea, and after they arrived, they went to the Jewish meeting place. "},{"num":11,"verse":"The people in Berea were much nicer than those in Thessalonica, and they gladly accepted the message. Day after day they studied the Scriptures to see if these things were true. "},{"num":12,"verse":"Many of them put their faith in the Lord, including some important Greek women and several men."},{"num":13,"verse":"When the Jewish leaders in Thessalonica heard that Paul had been preaching God’s message in Berea, they went there and caused trouble by turning the crowds against Paul."},{"num":14,"verse":"Right away the followers sent Paul down to the coast, but Silas and Timothy stayed in Berea. "},{"num":15,"verse":"Some men went with Paul as far as Athens, and then returned with instructions for Silas and Timothy to join him as soon as possible."},{"header":"Paul in Athens"},{"num":16,"verse":"While Paul was waiting in Athens, he was upset to see all the idols in the city. "},{"num":17,"verse":"He went to the Jewish meeting place to speak to the Jews and to anyone who worshiped with them. Day after day he also spoke to everyone he met in the market. "},{"num":18,"verse":"Some of them were Epicureans and some were Stoics, and they started arguing with him."},{"num":19,"verse":"They brought Paul before a council called the Areopagus, and said, “Tell us what your new teaching is all about. "},{"num":20,"verse":"We have heard you say some strange things, and we want to know what you mean.”"},{"num":21,"verse":"More than anything else the people of Athens and the foreigners living there loved to hear and to talk about anything new. "},{"num":22,"verse":"So Paul stood up in front of the council and said:"},{"num":32,"verse":"As soon as the people heard Paul say that a man had been raised from death, some of them started laughing. Others said, “We will hear you talk about this some other time.” "},{"num":33,"verse":"When Paul left the council meeting, "},{"num":34,"verse":"some of the men put their faith in the Lord and went with Paul. One of them was a council member named Dionysius. A woman named Damaris and several others also put their faith in the Lord."}]