[{"num":17,"verse":"And when they had passed through Amphipolis and Apollonia, they came to Thessalonica, where there was a synagogue of the Jews."},{"num":2,"verse":"And Paul, according to his custom, went in unto them; and for three sabbath days he reasoned with them out of the scriptures:"},{"num":3,"verse":"Declaring and insinuating that the Christ was to suffer, and to rise again from the dead; and that this is Jesus Christ, whom I preach to you."},{"num":4,"verse":"And some of them believed, and were associated to Paul and Silas; and of those that served God, and of the Gentiles a great multitude, and of noble women not a few."},{"num":5,"verse":"But the Jews, moved with envy, and taking unto them some wicked men of the vulgar sort, and making a tumult, set the city in an uproar; and besetting Jason's house, sought to bring them out unto the people."},{"num":6,"verse":"And not finding them, they drew Jason and certain brethren to the rulers of the city, crying: They that set the city in an uproar, are come hither also;"},{"num":7,"verse":"Whom Jason hath received; and these all do contrary to the decrees of Caesar, saying that there is another king, Jesus."},{"num":8,"verse":"And they stirred up the people, and the rulers of the city hearing these things,"},{"num":9,"verse":"And having taken satisfaction of Jason and of the rest, they let them go."},{"num":10,"verse":"But the brethren immediately sent away Paul and Silas by night unto Berea. Who, when they were come thither, went into the synagogue of the Jews."},{"num":11,"verse":"Now these were more noble than those in Thessalonica, who received the word with all eagerness, daily searching the scriptures, whether these things were so."},{"num":12,"verse":"And many indeed of them believed, and of honourable women that were Gentiles, and of men not a few."},{"num":13,"verse":"And when the Jews of Thessalonica had knowledge that the word of God was also preached by Paul at Berea, they came thither also, stirring up and troubling the multitude."},{"num":14,"verse":"And then immediately the brethren sent away Paul, to go unto the sea; but Silas and Timothy remained there."},{"num":15,"verse":"And they that conducted Paul, brought him as far as Athens; and receiving a commandment from him to Silas and Timothy, that they should come to him with all speed, they departed."},{"num":16,"verse":"Now whilst Paul waited for them at Athens, his spirit was stirred within him, seeing the city wholly given to idolatry."},{"num":17,"verse":"He disputed, therefore, in the synagogue with the Jews, and with them that served God, and in the marketplace, every day with them that were there."},{"num":18,"verse":"And certain philosophers of the Epicureans and of the Stoics disputed with him; and some said: What is it, that this word sower would say? But others: He seemeth to be a setter forth of new gods; because he preached to them Jesus and the resurrection."},{"num":19,"verse":"And taking him, they brought him to the Areopagus, saying: May we know what this new doctrine is, which thou speakest of?"},{"num":20,"verse":"For thou bringest in certain new things to our ears. We would know therefore what these things mean."},{"num":21,"verse":"(Now all the Athenians, and strangers that were there, employed themselves in nothing else, but either in telling or in hearing some new thing.)"},{"num":22,"verse":"But Paul standing in the midst of the Areopagus, said: Ye men of Athens, I perceive that in all things you are too superstitious."},{"num":23,"verse":"For passing by, and seeing your idols, I found an altar also, on which was written: To the unknown God. What therefore you worship, without knowing it, that I preach to you:"},{"num":24,"verse":"God, who made the world, and all things therein; he, being Lord of heaven and earth, dwelleth not in temples made with hands;"},{"num":25,"verse":"Neither is he served with men's hands, as though he needed any thing; seeing it is he who giveth to all life, and breath, and all things:"},{"num":26,"verse":"And hath made of one, all mankind, to dwell upon the whole face of the earth, determining appointed times, and the limits of their habitation."},{"num":27,"verse":"That they should seek God, if happily they may feel after him or find him, although he be not far from every one of us:"},{"num":28,"verse":"For in him we live, and move, and are; as some also of your own poets said: For we are also his offspring."},{"num":29,"verse":"Being therefore the offspring of God, we must not suppose the divinity to be like unto gold, or silver, or stone, the graving of art, and device of man."},{"num":30,"verse":"And God indeed having winked at the times of this ignorance, now declareth unto men, that all should everywhere do penance."},{"num":31,"verse":"Because he hath appointed a day wherein he will judge the world in equity, by the man whom he hath appointed; giving faith to all, by raising him up from the dead."},{"num":32,"verse":"And when they had heard of the resurrection of the dead, some indeed mocked, but others said: We will hear thee again concerning this matter."},{"num":33,"verse":"So Paul went out from among them."},{"num":34,"verse":"But certain men adhering to him, did believe; among whom was also Dionysius, the Areopagite, and a woman named Damaris, and others with them."}]