[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But that we write unto them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The grounds on which the measure thus defined was proposed are not far to seek. (1) It was of the nature of a compromise. The Gentiles could not complain that the burden imposed on them was anything very grievous. The Pharisee section of the Church could not refuse admission to those who fulfilled these conditions, when they had admitted the proselytes of the gate on like conditions to their synagogues, and had so treated them as no longer unclean. (2) The rules on which stress was now laid found a place among the seven precepts traditionally ascribed to Noah, and based upon the commands recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These were held to be binding upon all mankind; while the Law, as such, was binding on Israel only. These, therefore, had been thought sufficient for the proselytes of the gate before, and were urged now as sufficient for the Gentile converts by the teacher who represented the most rigid type of Judaism. (See, once more, the history of Ananias and Izates in the Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Special reasons attached, as will be seen, to each precept.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From pollutions of idols.—The Greek of the first noun is found only in the LXX. and the New Testament; and perhaps its primary idea is that of “wallowing” in blood and mire, and so incurring pollution. As distinguished from the acts that follow, it indicates any participation, publicly or privately, in idolatrous rites. One who acted on the rule would have to refrain from entering a temple, and to dislodge busts or statues of the gods from his house and gardens. The presence of such things, when they presented themselves on entering a house, was a great stumbling-block to devout Jews, and the Gentile convert who, left to himself, might have been disposed to keep them, though no longer as objects of worship, but as works of art, was required to renounce them. The statues of Zeus and Artemis and Hermes were to be to him henceforth as abominations. In the decree itself, however, we find “things sacrificed to idols” instead of the more general term, and we may accordingly deal here with that question also. So interpreted, the rule brings before us a new phase of the life of the early Christian converts. Under the religion of Greece and Rome, sacrifices were so common that it might fairly be taken for granted that the flesh at any festive meal had been so offered. But a small portion of the flesh was burnt upon the altar, and the rest was cooked for the household meal, or sent to the market for sale. Such meat was, in the eyes of the strict Jews, polluted, and the history of Daniel and his companions (Daniel 1:8) was regarded as a precedent to avoiding it. Partly on this ground, partly on that referred to in the next Note but one, the Jew never bought meat in the market, nor of other than a Jewish butcher. He travelled with his cophinus, or basket, on his back, and carried his provisions with him. So Juvenal (Sat. iii. 14) speaks of—",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "From pollutions of idols.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Greek of the first noun is found only in the LXX. and the New Testament; and perhaps its primary idea is that of “wallowing” in blood and mire, and so incurring pollution. As distinguished from the acts that follow, it indicates any participation, publicly or privately, in idolatrous rites. One who acted on the rule would have to refrain from entering a temple, and to dislodge busts or statues of the gods from his house and gardens. The presence of such things, when they presented themselves on entering a house, was a great stumbling-block to devout Jews, and the Gentile convert who, left to himself, might have been disposed to keep them, though no longer as objects of worship, but as works of art, was required to renounce them. The statues of Zeus and Artemis and Hermes were to be to him henceforth as abominations. In the decree itself, however, we find “things sacrificed to idols” instead of the more general term, and we may accordingly deal here with that question also. So interpreted, the rule brings before us a new phase of the life of the early Christian converts. Under the religion of Greece and Rome, sacrifices were so common that it might fairly be taken for granted that the flesh at any festive meal had been so offered. But a small portion of the flesh was burnt upon the altar, and the rest was cooked for the household meal, or sent to the market for sale. Such meat was, in the eyes of the strict Jews, polluted, and the history of Daniel and his companions (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") was regarded as a precedent to avoiding it. Partly on this ground, partly on that referred to in the next Note but one, the Jew never bought meat in the market, nor of other than a Jewish butcher. He travelled with his ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "cophinus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or basket, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "on",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " his back, and carried his provisions with him. So Juvenal (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Sat. iii.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 14) speaks of—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Judæis, quorum cophinus fœnumque supellex.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "[“Basket, and wisp of straw to serve as pillow,—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That’s the Jew’s luggage.”]",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Here, therefore, was a new stumbling-block, and the Gentile was required to avoid this also. It involved many sacrifices, and what would seem privations. The convert had to refuse invitations to birthday, and marriage, and funeral feasts; or, if present, to refuse to eat at them. A man with a sensitive conscience would refuse to partake of what was set before him in a private house or offered for sale in the market, unless he had satisfied himself that it had not so been offered. It was natural that this restriction, which did not rest directly on a moral ground, should give rise to some resistance, and the controversy connected with it assumed many different phases. At Corinth men claimed the right to eat what they chose, and St. Paul conceded the right in the abstract, but urged abstinence on the ground of charity (1 Corinthians 8-10.). At Pergamos and Thyatira, somewhat later in the apostolic age (Revelation 2:14; Revelation 2:20), the lawfulness of eating things sacrificed to idols was openly maintained in contravention alike of the teaching of St. Paul and of the apostolic decree, and was joined with a like claim to be exempted from the law which forbade illicit sexual intercourse. At Corinth, it would seem from 1Corinthians 8:10, the assertion of freedom had led men so far as not only to eat of the flesh that had been sacrificed, but actually to sit down to a feast in the idol’s temple. (Comp. Romans 2:22, as expressing the Jewish feeling.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here, therefore, was a new stumbling-block, and the Gentile was required to avoid this also. It involved many sacrifices, and what would seem privations. The convert had to refuse invitations to birthday, and marriage, and funeral feasts; or, if present, to refuse to eat at them. A man with a sensitive conscience would refuse to partake of what was set before him in a private house or offered for sale in the market, unless he had satisfied himself that it had not so been offered. It was natural that this restriction, which did not rest directly on a moral ground, should give rise to some resistance, and the controversy connected with it assumed many different phases. At Corinth men claimed the right to eat what they chose, and St. Paul conceded the right in the abstract, but urged abstinence on the ground of charity (1 Corinthians 8-10.). At Pergamos and Thyatira, somewhat later in the apostolic age (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the lawfulness of eating things sacrificed to idols was openly maintained in contravention alike of the teaching of St. Paul and of the apostolic decree, and was joined with a like claim to be exempted from the law which forbade illicit sexual intercourse. At Corinth, it would seem from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 8:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the assertion of freedom had led men so far as not only to eat of the flesh that had been sacrificed, but actually to sit down to a feast in the idol’s temple. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as expressing the Jewish feeling.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And from fornication.—We are surprised at first to find, what seems to us, a moral law placed in juxtaposition with two rules which, like those that follow, seem purely positive and ceremonial. We have to remember, however, (1) that the first command was moral also, and that we may fairly recognise something like a practical, though not a formal distinction, by thinking of the first two precepts as grouped together; (2) that the sin named, involving, as it did, the absence of any true sense of self-respecting purity or reverence for womanhood, was the wide-spread evil of the ancient world, against which Israel had from the first been called to bear its witness (Genesis 34:31; Leviticus 19:29; Deuteronomy 23:17; Proverbs 7:6-27). The increasing laxity of morals throughout the Roman empire, showing itself in the well-known line of Terence—",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And from fornication.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—We are surprised at first to find, what seems to us, a moral law placed in juxtaposition with two rules which, like those that follow, seem purely positive and ceremonial. We have to remember, however, (1) that the first command was moral also, and that we may fairly recognise something like a practical, though not a formal distinction, by thinking of the first two precepts as grouped together; (2) that the sin named, involving, as it did, the absence of any true sense of self-respecting purity or reverence for womanhood, was the wide-spread evil of the ancient world, against which Israel had from the first been called to bear its witness (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:6-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The increasing laxity of morals throughout the Roman empire, showing itself in the well-known line of Terence—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Nihil peccati est adolescentulum scortari, “",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "had led men to think of it as natural and permissible, bringing with it no sense of wrong or shame (comp. Horace, Sat. i. 2, 119), and it might well be that the ethical standard of the Gentile converts was not all at once raised to a true ideal of purity. The old license may have seemed venial, and the disciples may have thought, as Christians have too often thought since, that it did not call for any deep repentance, or exclude them from fellowship with Christ. And yet it was clear that to the Jewish Christian, trained from his childhood to condemn the sin severely, this, too, would legitimately be a very grave stumbling-block in the admission of Gentile converts. How could he feel any assurance that they might not have come from the embraces of a harlot to the Feast of Charity or to the very Supper of the Lord? (Comp. 1Corinthians 6:15; Revelation 2:14.) Such a state of things required to be dealt with by a special enactment. The moral command had to be re-enacted, and brought into a new prominence. The Church had to take its first step in purifying the morals of mankind, not only by its general teaching, but by canons and rules of discipline. Stress has often been laid on the fact that in many cases, as in those of the Hetæræ?, or harlot-priestesses, of Aphrodite at Corinth and Paphos, prostitution was in closest alliance with idolatry, as a reason for the prohibition, and it is, of course, true that in such cases the sin assumed, in the eyes of Jews, an aggravated character. The man identified himself, by his sinful indulgence, with the coltus of the woman who was its avowed devotee. We can scarcely think, however, that the sin was forbidden, not on account of its own intrinsic evil, but only or chiefly, with a view to this ulterior and incidental consequence.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "had led men to think of it as natural and permissible, bringing with it no sense of wrong or shame (comp. Horace, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Sat. i.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2, 119), and it might well be that the ethical standard of the Gentile converts was not all at once raised to a true ideal of purity. The old license may have seemed venial, and the disciples may have thought, as Christians have too often thought since, that it did not call for any deep repentance, or exclude them from fellowship with Christ. And yet it was clear that to the Jewish Christian, trained from his childhood to condemn the sin severely, this, too, would legitimately be a very grave stumbling-block in the admission of Gentile converts. How could he feel any assurance that they might not have come from the embraces of a harlot to the Feast of Charity or to the very Supper of the Lord? (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 6:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Such a state of things required to be dealt with by a special enactment. The moral command had to be re-enacted, and brought into a new prominence. The Church had to take its first step in purifying the morals of mankind, not only by its general teaching, but by canons and rules of discipline. Stress has often been laid on the fact that in many cases, as in those of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Hetæræ?, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or harlot-priestesses, of Aphrodite at Corinth and Paphos, prostitution was in closest alliance with idolatry, as a reason for the prohibition, and it is, of course, true that in such cases the sin assumed, in the eyes of Jews, an aggravated character. The man identified himself, by his sinful indulgence, with the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "coltus",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the woman who was its avowed devotee. We can scarcely think, however, that the sin was forbidden, not on account of its own intrinsic evil, but only or chiefly, with a view to this ulterior and incidental consequence.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Things strangled.—Literally, of that which has been strangled. The prohibition rested on Genesis 9:4, and was connected with the symbolic meaning of the blood as representing life, and therefore consecrated to Jehovah. It was repeated in the Law (Leviticus 3:17; Leviticus 7:26; Deuteronomy 12:16; 1Samuel 14:33), and has been maintained with a wonderful tenacity. For this reason, long after sacrifices have ceased, the Jew will still, if possible, only eat what has been killed by a butcher of his own persuasion. Meat so killed, which may be eaten without defilement, is known technically as Kosher. Here the moral element falls entirely into the background, and the prohibition has simply the character of a concordat to avoid offence. St. Paul and St. Peter were alike persuaded that “there is nothing unclean of itself” (Acts 10:15; Romans 14:14). Practically, the effect of the rule would have been to compel Christians to buy their meat, poultry, &c., from a Jewish butcher or a Christian who followed the Jewish mode of killing, and in some places this must have entailed considerable inconvenience.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Things strangled.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of that which has been strangled.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The prohibition rested on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and was connected with the symbolic meaning of the blood as representing life, and therefore consecrated to Jehovah. It was repeated in the Law (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 14:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and has been maintained with a wonderful tenacity. For this reason, long after sacrifices have ceased, the Jew will still, if possible, only eat what has been killed by a butcher of his own persuasion. Meat so killed, which may be eaten without defilement, is known technically as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Kosher.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Here the moral element falls entirely into the background, and the prohibition has simply the character of a ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "concordat",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to avoid offence. St. Paul and St. Peter were alike persuaded that “there is nothing unclean of itself” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 14:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Practically, the effect of the rule would have been to compel Christians to buy their meat, poultry, &c., from a Jewish butcher or a Christian who followed the Jewish mode of killing, and in some places this must have entailed considerable inconvenience.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From blood.—As distinguished from the preceding rule, this forbade the separate use of blood, as with flour and vegetables, or in the black-puddings of modern cookery, as an article of food. Dishes so prepared were common in the cuisine both of Greeks and Romans, and here also, therefore, the restriction would have involved a frequent withdrawal from social life, or a conspicuous singularity. On the history of the observance, see Note on Acts 15:28.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "From blood.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As distinguished from the preceding rule, this forbade the separate use of blood, as with flour and vegetables, or in the black-puddings of modern cookery, as an article of food. Dishes so prepared were common in the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "cuisine",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " both of Greeks and Romans, and here also, therefore, the restriction would have involved a frequent withdrawal from social life, or a conspicuous singularity. On the history of the observance, see Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:7-21 We see from the words purifying their hearts by faith, and the address of St. Peter, that justification by faith, and sanctification by the Holy Ghost, cannot be separated; and that both are the gift of God. We have great cause to bless God that we have heard the gospel. May we have that faith which the great Searcher of hearts approves, and attests by the seal of the Holy Spirit. Then our hearts and consciences will be purified from the guilt of sin, and we shall be freed from the burdens some try to lay upon the disciples of Christ. Paul and Barnabas showed by plain matters of fact, that God owned the preaching of the pure gospel to the Gentiles without the law of Moses; therefore to press that law upon them, was to undo what God had done. The opinion of James was, that the Gentile converts ought not to be troubled about Jewish rites, but that they should abstain from meats offered to idols, so that they might show their hatred of idolatry. Also, that they should be cautioned against fornication, which was not abhorred by the Gentiles as it should be, and even formed a part of some of their rites. They were counselled to abstain from things strangled, and from eating blood; this was forbidden by the law of Moses, and also here, from reverence to the blood of the sacrifices, which being then still offered, it would needlessly grieve the Jewish converts, and further prejudice the unconverted Jews. But as the reason has long ceased, we are left free in this, as in the like matters. Let converts be warned to avoid all appearances of the evils which they formerly practised, or are likely to be tempted to; and caution them to use Christian liberty with moderation and prudence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That we write unto them - Expressing our judgment, or our views of the case.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That they abstain - That they refrain from these things, or wholly avoid them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Pollutions of idols - The word rendered \"pollutions\" means any kind of \"defilement.\" But here it is evidently used to denote the flesh of those animals that were offered in sacrifice to idols. See Acts 15:29. That flesh, after being offered in sacrifice, was often exposed for sale in the markets, or was served up at feasts, 1 Corinthians 10:25-29. It became a very important question whether it was right for Christians to partake of it. The Jews would contend that it was, in fact, partaking of idolatry. The Gentile converts would allege that they did not eat it as a sacrifice to idols, or lend their countenance in any way to the idolatrous Worship where it had been offered. See this subject discussed at length in 1 Corinthians 8:4-13. As idolatry was forbidden to the Jews in every form, and as partaking even of the sacrifices of idols in their feasts might seem to countenance idolatry, the Jews would be utterly opposed to it; and for the sake of peace, James advised that the Christians at Antioch be recommended to abstain from this. To partake of that food might not be morally wrong 1 Corinthians 8:4, but it would give occasion for scandal and offence; and, therefore, as a matter of expediency, it was advised that they should abstain from it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Pollutions of idols - The word rendered \"pollutions\" means any kind of \"defilement.\" But here it is evidently used to denote the flesh of those animals that were offered in sacrifice to idols. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That flesh, after being offered in sacrifice, was often exposed for sale in the markets, or was served up at feasts, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:25-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It became a very important question whether it was right for Christians to partake of it. The Jews would contend that it was, in fact, partaking of idolatry. The Gentile converts would allege that they did not eat it as a sacrifice to idols, or lend their countenance in any way to the idolatrous Worship where it had been offered. See this subject discussed at length in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 8:4-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As idolatry was forbidden to the Jews in every form, and as partaking even of the sacrifices of idols in their feasts might seem to countenance idolatry, the Jews would be utterly opposed to it; and for the sake of peace, James advised that the Christians at Antioch be recommended to abstain from this. To partake of that food might not be morally wrong ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but it would give occasion for scandal and offence; and, therefore, as a matter of expediency, it was advised that they should abstain from it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And from fornication - The word used here πορνεία  porneia is applicable to \"all illicit sexual intercourse,\" and may refer to adultery, incest, or licentiousness in any form. There has been much diversity of opinion in regard to this expression. Interpreters have been greatly perplexed to understand why this violation of the moral law has been introduced amidst the violations of the ceremonial law, and the question is naturally asked whether this was a sin about which there could be any debate between the Jewish and Gentile converts? Were there any who would practice it, or plead that it was lawful? If not, why is it prohibited here? Various explanations of this have been proposed. Some have supposed that James refers here to the offerings which harlots would make of their gains to the service of religion, and that James would prohibit the reception of it. Beza, Selden, and Schleusner suppose the word is taken for idolatry, as it is often represented in the Scriptures as consisting in unfaithfulness to God, and as it is often called adultery. Heringius supposes that marriage between idolaters and Christians is here intended. But, after all, the usual interpretation of the word, as referring to illicit sexual intercourse of the sexes of any kind, is undoubtedly here to be retained. If it be asked, then, why this was particularly forbidden, and was introduced in this connection, we may reply:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That this vice prevailed everywhere among the Gentiles, and was that to which all were particularly exposed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that it was not deemed by the Gentiles disgraceful. It was practiced without shame and without remorse. (Terence, Adelphi, 1, 2, 21. See Grotius.) It was important, therefore, that the pure laws of Christianity on this subject should be known, and that special pains should be taken to instruct the early converts from paganism in those laws. The same thing is necessary still in pagan lands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) this crime was connected with religion. It was the practice not only to introduce indecent pictures and emblems into their worship, but also for females to devote themselves to the service of particular temples, and to devote the avails of indiscriminate prostitution to the service of the god, or the goddess. The vice was connected with no small part of the pagan worship; and the images, the emblems, and the customs of idolatry everywhere tended to sanction and promote it. A mass of evidence on this subject which sickens the heart, and which would be too long and too indelicate to introduce here, may be seen in Tholuck's Nature and Moral Influence of Paganism, in the Biblical Repository for July, 1832, p. 441-464. As this vice was almost universal; as it was practiced without shame or disgrace; as there were no laws among the pagan to prevent it; as it was connected with all their views of idol worship and of religion, it was important for the early Christians to frown upon and to oppose it, and to set a special guard against it in all the churches. It was the sin to which, of all others, they were the most exposed, and which was most likely to bring scandal on the Christian religion. It is for this cause that it is so often and so pointedly forbidden in the New Testament Romans 1:29; 1 Corinthians 6:13, 1 Corinthians 6:18; Galatians 5:19; Ephesians 5:3; 1 Thessalonians 4:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) this crime was connected with religion. It was the practice not only to introduce indecent pictures and emblems into their worship, but also for females to devote themselves to the service of particular temples, and to devote the avails of indiscriminate prostitution to the service of the god, or the goddess. The vice was connected with no small part of the pagan worship; and the images, the emblems, and the customs of idolatry everywhere tended to sanction and promote it. A mass of evidence on this subject which sickens the heart, and which would be too long and too indelicate to introduce here, may be seen in Tholuck's Nature and Moral Influence of Paganism, in the Biblical Repository for July, 1832, p. 441-464. As this vice was almost universal; as it was practiced without shame or disgrace; as there were no laws among the pagan to prevent it; as it was connected with all their views of idol worship and of religion, it was important for the early Christians to frown upon and to oppose it, and to set a special guard against it in all the churches. It was the sin to which, of all others, they were the most exposed, and which was most likely to bring scandal on the Christian religion. It is for this cause that it is so often and so pointedly forbidden in the New Testament ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 5:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Thessalonians 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And from things strangled - That is, from animals or birds that were killed without shedding their blood. The reason why these were considered by the Jews unlawful to. be eaten was, that thus they would be under a necessity of eating blood, which was positively forbidden by the Law. Hence, it was commanded in the Law that when any beast or fowl was taken in a snare, the blood should be poured out before it was lawful to be eaten, Leviticus 17:13.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And from things strangled - That is, from animals or birds that were killed without shedding their blood. The reason why these were considered by the Jews unlawful to. be eaten was, that thus they would be under a necessity of eating blood, which was positively forbidden by the Law. Hence, it was commanded in the Law that when any beast or fowl was taken in a snare, the blood should be poured out before it was lawful to be eaten, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And from blood - The eating of blood was strictly forbidden to the Jews. The reason of this was that it contained the life, Leviticus 17:11, Leviticus 17:14. See notes on Romans 3:25. The use of blood was common among the Gentiles. They drank it often at their sacrifices, and in making covenants or compacts. To separate the Jews from them in this respect was one design of the prohibition. See Spencer, De Ley Hebrae., p. 144, 145, 169, 235, 377, 381, 594, edit. 1732. See also this whole passage examined at length in Spencer, p. 588-626. The primary reason of the prohibition was, that it was thus used in the feasts and compacts of idolaters. That blood was thus drank by the pagans, particularly by the Sabians, in their sacrifices, is fully proved by Spencer, De Leg., p. 377-380 But the prohibition specifies a higher reason, that the life is in the blood, and that therefore it should not be eaten. On this opinion see the notes on Romans 3:25. This reason existed before any ceremonial law; it is founded in the nature of things; it has no particular reference to any custom of the Jews; and it is as forcible in any other circumstances as in theirs. It was proper, therefore, to forbid it to the early Christian converts; and for the same reason, its use should be abstained from everywhere. It adds to the force of these remarks when we remember that the same principle was settled before the laws of Moses were given, and that God regarded the fact that the life was in the blood as of so much importance as to make the shedding of it worthy of death, Genesis 9:4-6. It is supposed, therefore, that this law is still obligatory. Perhaps, also, there is no food more unwholesome than blood; and it is a further circumstance of some moment that all people naturally revolt from it as an article of food. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And from blood - The eating of blood was strictly forbidden to the Jews. The reason of this was that it contained the life, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The use of blood was common among the Gentiles. They drank it often at their sacrifices, and in making covenants or compacts. To separate the Jews from them in this respect was one design of the prohibition. See Spencer, De Ley Hebrae., p. 144, 145, 169, 235, 377, 381, 594, edit. 1732. See also this whole passage examined at length in Spencer, p. 588-626. The primary reason of the prohibition was, that it was thus used in the feasts and compacts of idolaters. That blood was thus drank by the pagans, particularly by the Sabians, in their sacrifices, is fully proved by Spencer, De Leg., p. 377-380 But the prohibition specifies a higher reason, that the life is in the blood, and that therefore it should not be eaten. On this opinion see the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This reason existed before any ceremonial law; it is founded in the nature of things; it has no particular reference to any custom of the Jews; and it is as forcible in any other circumstances as in theirs. It was proper, therefore, to forbid it to the early Christian converts; and for the same reason, its use should be abstained from everywhere. It adds to the force of these remarks when we remember that the same principle was settled before the laws of Moses were given, and that God regarded the fact that the life was in the blood as of so much importance as to make the shedding of it worthy of death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is supposed, therefore, that this law is still obligatory. Perhaps, also, there is no food more unwholesome than blood; and it is a further circumstance of some moment that all people naturally revolt from it as an article of food. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. But … that they abstain from pollutions of idols—that is, things polluted by having been offered in sacrifice to idols. The heathen were accustomed to give away or sell portions of such animals. From such food James would enjoin the Gentile converts to abstain, lest it should seem to the Jews that they were not entirely weaned from idolatry.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and from fornication—The characteristic sin of heathendom, unblushingly practiced by all ranks and classes, and the indulgence of which on the part of the Gentile converts would to Jews, whose Scriptures branded it as an abomination of the heathen, proclaim them to be yet joined to their old idols.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and from things strangled—which had the blood in them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and from blood—in every form, as peremptorily forbidden to the Jews, and the eating of which, therefore, on the part of the Gentile converts, would shock their prejudices. See on [2023]Ac 15:28.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That they abstain from pollutions of idols; eating of meat that was offered to idols, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 15:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " in a case of scandal, and for the present state of the church, was forbid, though afterwards in other cases indulged, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 10:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Fornication",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here mentioned amongst indiferent things; not that it ever was so, but because it was amongst the Gentiles reputed to be so, even by them who punished adultery severely. By these two, some think all sins against both the tables of the law to be forbidden, because by one sin against each table all the sins against any command may synecdochically be understood. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From things strangled; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such creatures as had not their blood let out, and therefore were not to be fed upon, by the law of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 9:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", given as soon as the use of flesh was allowed for food. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And from blood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they were also much more to abstain from blood, when shed out of the body of any slain creature, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 3:17 Deu 12:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 12:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". That blood was forbidden might be to teach them meekness, and to abstain from revenge. It is certain, that such nations as feed on blood are most barbarous and cruel. It is also probable, that these being included in the precepts which they called, The precepts of Adam, or Noah, and to which all the proselytes of the gate were obliged to yield obedience, the apostle would have the observance of them to be continued upon them that came from amongst them over unto Christianity. For though all these ceremonies were dead, (with Christ), yet they were not then deadly, and did wait a time for their more decent burial. If any wonder that the council did not treat of and write about greater matters; as of worshipping God the Father, through the Son; of denying of ourselves, and taking up the cross; he ought to consider, that the question they met upon was about other matters, and that those great things were never in question amongst such as feared God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But that we write unto them,.... Or send an epistle to them, to this effect, concerning the following things: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they abstain from pollutions of idols; that is, from eating things offered to idols; see Acts 15:29 for not idolatry, or the worshipping of idols itself, is here spoken of; for that was no indifferent thing; and besides, these converted Gentiles were turned from that, and there was no danger of their returning to it; but eating things sacrificed to idols was an indifferent thing; but yet inasmuch as it had a tendency to lead to idolatry, and gave offence to the Jewish believers in the churches, and was a stumbling block to weak minds, who by the example of stronger Christians, were led to eat them as sacrificed to an idol, and so their weak consciences were defiled, therefore it was very proper to abstain from them; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that they abstain from pollutions of idols; that is, from eating things offered to idols; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for not idolatry, or the worshipping of idols itself, is here spoken of; for that was no indifferent thing; and besides, these converted Gentiles were turned from that, and there was no danger of their returning to it; but eating things sacrificed to idols was an indifferent thing; but yet inasmuch as it had a tendency to lead to idolatry, and gave offence to the Jewish believers in the churches, and was a stumbling block to weak minds, who by the example of stronger Christians, were led to eat them as sacrificed to an idol, and so their weak consciences were defiled, therefore it was very proper to abstain from them; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and from fornication; not spiritual fornication or idolatry, but fornication taken in a literal sense, for the carnal copulation of one single person with another, and which is commonly called simple fornication: the reason why this is put among, things indifferent is, not that it was so in itself, but because it was not thought to be criminal by the Gentiles, and was commonly used by them, and which must be offensive to the believing Jews, who were better acquainted with the will of God; this is omitted in the Ethiopic version: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and from things strangled; that is; from eating them, and design such as die of themselves, or are torn with beasts, or are not killed in a proper way, by letting out their blood; but their blood is stagnated or congealed in the veins: the Jews might not kill with a reaper's sickle, nor with a saw, nor with the teeth, or nail; because these  \"strangled\" (a): and what was not slain as it should be, was reckoned all one as what dies of itself; and whoever ate of either of these was to be beaten (b); the law respecting these things was of the ceremonial kind, and peculiar to the Jews, and was not binding upon the Gentiles; for that which died of itself might be given to a stranger, and he might eat it, or it might be sold to an alien, Deuteronomy 14:21 this has been wanting in many copies, and it was not read by several of the ancient fathers: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and from things strangled; that is; from eating them, and design such as die of themselves, or are torn with beasts, or are not killed in a proper way, by letting out their blood; but their blood is stagnated or congealed in the veins: the Jews might not kill with a reaper's sickle, nor with a saw, nor with the teeth, or nail; because these  \"strangled\" (a): and what was not slain as it should be, was reckoned all one as what dies of itself; and whoever ate of either of these was to be beaten (b); the law respecting these things was of the ceremonial kind, and peculiar to the Jews, and was not binding upon the Gentiles; for that which died of itself might be given to a stranger, and he might eat it, or it might be sold to an alien, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this has been wanting in many copies, and it was not read by several of the ancient fathers: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and from blood: which is not to be understood of the blood of men and shedding of that, which is of a moral nature; but of the blood of beasts, and of eating of that. There were several laws about eating of blood, and which are different, and ought to be carefully distinguished. The first is in Genesis 9:4 \"but flesh with the life thereof, which is the blood there of, shall you not eat\"; which forbids the eating of flesh with the blood; but not the eating of flesh separately, nor the eating of blood separately, provided they were properly prepared and dressed, but the eating of them together without any preparation. As this was the first hint to man that we know of, that he might eat flesh, it was proper that the manner in which he should eat it, should be suggested to him; that he should not take the creature alive and eat it, or tear off any of its members and eat it whilst alive, or eat raw flesh; but should prepare it by roasting or boiling, or some way, in which it might become proper food: and it is the constant sense of the Jewish synagogue (c), that this law is to be understood of the member of a living creature, torn from it, and eaten whilst alive; six commands, the Jews say, were given to the first man Adam, the first five forbid idolatry, blasphemy, shedding of blood, uncleanness, and theft, or robbery, and the sixth required judgment against offenders; to these were added, for the sons of Noah, a seventh, which forbid the eating of the member of a living creature, as it is said, Genesis 9:4 (d). So that this law has nothing to do with eating of blood, simply considered, and no more forbids eating of it separately, than it does eating of flesh separately: in like manner is the law in Deuteronomy 12:23 to be understood, and is so interpreted by the Jewish writers (e): another law is in Leviticus 19:26 \"ye shall not eat anything with the blood\"; which according to our version, seems to be the same law with the former, but is not; for it is not said here, as before,  \"in\", or \"with\", but  \"upon\", \"over\", or \"by\" the blood. This is differently understood: some think the sense is, that no one should eat of the sacrifices, before the sprinkling of the blood upon the altar (f); or until it stands or is congealed in the basons (g); others, that it is a caution to judges, that they do not eat until they have finished judgment; for whoever judges or passes sentence after he has eat and drank, is as if he was guilty of blood (h): another observes (i), that next to this clause, it is said, \"neither shall ye use enchantment\"; meaning that they should not use enchantment by eating, in the way that murderers do, who eat bread over the slain, that the avengers of the slain may not take vengeance on them; this author smells something superstitious or diabolical in this matter; and indeed this is the case; the truth of the matter is, it refers to a practice among the Heathens, who fancied that blood was the food of the demons, to whom they sacrificed; and therefore when they sacrificed to them, they took the blood of the beast and put it into a vessel, and sat down by it, and round about it, and ate the flesh; imagining that whilst they ate the flesh, the demons eat the blood, and by this means friendship and familiarity were contracted between them; so that they hoped to receive some advantage from them, and be informed of things to come (k). Hence, this law is placed with others against enchantments and observing times, to which may be added, Ezekiel 33:25 \"ye eat with the blood\", or \"over it\", or \"by\" it; \"and lift up your eyes to your idols\": which is to be understood in the same light, and with these compare 1 Samuel 14:32. But besides these, there was a third law, which is frequently repeated, Leviticus 3:17 which absolutely forbids the eating of blood, as well as fat; the Jews except the blood of fishes, and locusts, and creeping things, and the blood of men, and the blood that is in eggs, and that which is squeezed out of flesh, or drops from it, which a man may eat and not be guilty of the breach of this law (l) the reason of this law was, because the blood, which is the life, was given in sacrifice for the life of men, to be an atonement for them; wherefore, to keep up a just reverence of the sacrifice, and to direct to the blood of the great sacrifice of the Messiah, blood was forbidden to be eaten, till that sacrifice was offered up; and then that blood itself was to be spiritually eaten by faith: and now if eating of blood in general was morally evil in itself, it would be a monstrous shocking thing in the Christian religion, that the blood of Christ is to be drank; though it be to be understood in a spiritual sense: the law against eating blood was very strictly enjoined the Jews, and severely punished; whoever ate of blood, but the quantity of an olive, if he ate it wilfully, was guilty of cutting off; if ignorantly, he was to bring a sin offering (m): James knew that the breach of this law would give great offence to the Jews, and therefore for the peace of the church he moves that the Gentiles might be wrote to, to abstain from blood; and which was agreed to and done: and this was attended to with much strictness by the primitive Christians, who seemed to have observed this advice in the form of a law, and thought it criminal to eat blood; but in process of time it was neglected; and in Austin's time abstinence from blood was derided, as a ridiculous notion; and it is at least now high time that this, and everything else of a ceremonial kind, was dropped by Christians; though where the peace of the brethren is in danger, this, and everything of an indifferent nature should be abstained from: Beza's ancient copy adds, \"and whatsoever they would not have done to themselves, do not unto others\"; and so two of Stephens's: the Ethiopic version is, \"whatsoever they hate should be done to themselves, let them not do to their brethren\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and from blood: which is not to be understood of the blood of men and shedding of that, which is of a moral nature; but of the blood of beasts, and of eating of that. There were several laws about eating of blood, and which are different, and ought to be carefully distinguished. The first is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"but flesh with the life thereof, which is the blood there of, shall you not eat\"; which forbids the eating of flesh with the blood; but not the eating of flesh separately, nor the eating of blood separately, provided they were properly prepared and dressed, but the eating of them together without any preparation. As this was the first hint to man that we know of, that he might eat flesh, it was proper that the manner in which he should eat it, should be suggested to him; that he should not take the creature alive and eat it, or tear off any of its members and eat it whilst alive, or eat raw flesh; but should prepare it by roasting or boiling, or some way, in which it might become proper food: and it is the constant sense of the Jewish synagogue (c), that this law is to be understood of the member of a living creature, torn from it, and eaten whilst alive; six commands, the Jews say, were given to the first man Adam, the first five forbid idolatry, blasphemy, shedding of blood, uncleanness, and theft, or robbery, and the sixth required judgment against offenders; to these were added, for the sons of Noah, a seventh, which forbid the eating of the member of a living creature, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (d). So that this law has nothing to do with eating of blood, simply considered, and no more forbids eating of it separately, than it does eating of flesh separately: in like manner is the law in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to be understood, and is so interpreted by the Jewish writers (e): another law is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"ye shall not eat anything with the blood\"; which according to our version, seems to be the same law with the former, but is not; for it is not said here, as before,  \"in\", or \"with\", but  \"upon\", \"over\", or \"by\" the blood. This is differently understood: some think the sense is, that no one should eat of the sacrifices, before the sprinkling of the blood upon the altar (f); or until it stands or is congealed in the basons (g); others, that it is a caution to judges, that they do not eat until they have finished judgment; for whoever judges or passes sentence after he has eat and drank, is as if he was guilty of blood (h): another observes (i), that next to this clause, it is said, \"neither shall ye use enchantment\"; meaning that they should not use enchantment by eating, in the way that murderers do, who eat bread over the slain, that the avengers of the slain may not take vengeance on them; this author smells something superstitious or diabolical in this matter; and indeed this is the case; the truth of the matter is, it refers to a practice among the Heathens, who fancied that blood was the food of the demons, to whom they sacrificed; and therefore when they sacrificed to them, they took the blood of the beast and put it into a vessel, and sat down by it, and round about it, and ate the flesh; imagining that whilst they ate the flesh, the demons eat the blood, and by this means friendship and familiarity were contracted between them; so that they hoped to receive some advantage from them, and be informed of things to come (k). Hence, this law is placed with others against enchantments and observing times, to which may be added, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"ye eat with the blood\", or \"over it\", or \"by\" it; \"and lift up your eyes to your idols\": which is to be understood in the same light, and with these compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But besides these, there was a third law, which is frequently repeated, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which absolutely forbids the eating of blood, as well as fat; the Jews except the blood of fishes, and locusts, and creeping things, and the blood of men, and the blood that is in eggs, and that which is squeezed out of flesh, or drops from it, which a man may eat and not be guilty of the breach of this law (l) the reason of this law was, because the blood, which is the life, was given in sacrifice for the life of men, to be an atonement for them; wherefore, to keep up a just reverence of the sacrifice, and to direct to the blood of the great sacrifice of the Messiah, blood was forbidden to be eaten, till that sacrifice was offered up; and then that blood itself was to be spiritually eaten by faith: and now if eating of blood in general was morally evil in itself, it would be a monstrous shocking thing in the Christian religion, that the blood of Christ is to be drank; though it be to be understood in a spiritual sense: the law against eating blood was very strictly enjoined the Jews, and severely punished; whoever ate of blood, but the quantity of an olive, if he ate it wilfully, was guilty of cutting off; if ignorantly, he was to bring a sin offering (m): James knew that the breach of this law would give great offence to the Jews, and therefore for the peace of the church he moves that the Gentiles might be wrote to, to abstain from blood; and which was agreed to and done: and this was attended to with much strictness by the primitive Christians, who seemed to have observed this advice in the form of a law, and thought it criminal to eat blood; but in process of time it was neglected; and in Austin's time abstinence from blood was derided, as a ridiculous notion; and it is at least now high time that this, and everything else of a ceremonial kind, was dropped by Christians; though where the peace of the brethren is in danger, this, and everything of an indifferent nature should be abstained from: Beza's ancient copy adds, \"and whatsoever they would not have done to themselves, do not unto others\"; and so two of Stephens's: the Ethiopic version is, \"whatsoever they hate should be done to themselves, let them not do to their brethren\". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(God forbids his people from eating the blood of any animal. Blood carries both infections and toxins that might circulate in the animal's body. Therefore, by eating an animal's blood, one exposes himself needlessly to potential toxins and infections. The harmful effects of eating blood can be illustrated by tribes in Africa who consume large amounts of blood in their pagan culture. These people have developed the chronic diseases seen in our elderly while still teenagers. Their life span is approximately 30 years. Rex D. Russel, M.D. p. 229, \"Proceedings of the 1992 Twin-Cities Creation Conference\". Editor's note.) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Misn. Cholin, c. 1. sect. 2.((b) Maimon. Hilchot Maacolot Assurot, c. 4. sect. 1.((c) Targum Jon Jarchi, Aben Ezra & Abendanae not. in Sol. ben Melec in loc. (d) Maimon. Hilchot Melacim, c. 9. sect. 1.((e) Jarchi and Baal Hatturim in loc. T. Bab. Sanhedrin, fol. 56. 2. & 59. 1. & Cholin, fol 102. 2. Tzeror Hammor, fol. 95, 4. (f) Jarchi & Aben Ezra in loc. (g) Targum Jon. in loc. (h) Zohar in Exod. fol. 50. 3. Vid. Maimon. Hilchot Sanhedrin, c. 13. sect. 4. (i) Baal Hatturim in Leviticus 19.26. (k) Maimon. Morch Nevochim, par. 3. c. 46. Kimchi in 1 Samuel 14.32. & in Ezekiel 33.25. (l) Misn. Ceritot, c. 5. sect. 1. Maimon. Maacolot Asurot, c. 6, sect. 1. Jarchi in Leviticus 17.10. Moses Kotsensis Mitzvot Tora, pr. pag. 137. (m) Maimon. Maacolot Asurot, c. 6. sect.7 ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Misn. Cholin, c. 1. sect. 2.((b) Maimon. Hilchot Maacolot Assurot, c. 4. sect. 1.((c) Targum Jon Jarchi, Aben Ezra & Abendanae not. in Sol. ben Melec in loc. (d) Maimon. Hilchot Melacim, c. 9. sect. 1.((e) Jarchi and Baal Hatturim in loc. T. Bab. Sanhedrin, fol. 56. 2. & 59. 1. & Cholin, fol 102. 2. Tzeror Hammor, fol. 95, 4. (f) Jarchi & Aben Ezra in loc. (g) Targum Jon. in loc. (h) Zohar in Exod. fol. 50. 3. Vid. Maimon. Hilchot Sanhedrin, c. 13. sect. 4. (i) Baal Hatturim in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".26. (k) Maimon. Morch Nevochim, par. 3. c. 46. Kimchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".32. & in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".25. (l) Misn. Ceritot, c. 5. sect. 1. Maimon. Maacolot Asurot, c. 6, sect. 1. Jarchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".10. Moses Kotsensis Mitzvot Tora, pr. pag. 137. (m) Maimon. Maacolot Asurot, c. 6. sect.7 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But that we write unto them, that they abstain from {i} pollutions of idols, and from fornication, and from things strangled, and from blood.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But that we write unto them, that they abstain from ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " pollutions of idols, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "from",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fornication, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "from",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " things strangled, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "from",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " blood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) From sacrifices, or from feasts which were kept in idol's temples.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπιστεῖλαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the verb is used of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "written",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " injunction, Westcott, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "l. c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so Wendt here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so Klostermann), and so often in ecclesiastical writers; here it may mean to write or enjoin, or may well include both, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hort, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ecclesia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 70, Westcott, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "u. s.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Weiss, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loco;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in classical Greek it is used in both senses. In LXX it is not used, except in a few passages in which the reading is doubtful, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., see Hatch and Redpath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sub v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ ἀπέχεσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": Burton, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "N. T. Moods and Tenses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 159, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; generally without ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῶν ἀλισγμάτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": from Hellenistic verb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀλισγεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 40:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); may mean the pollution from the flesh used in heathen offerings = ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰδωλοθύτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff, but see further Klostermann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Probleme im Aposteltexte",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 144 ff., and Wendt, 1888 and 1899, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loco.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The phrase stands by itself, and the three following genitives are not dependent upon it. If St. James’s words are interpreted more widely than as = ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰδωλοθύτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", they would involve the prohibition for a Christian not only not to eat anything offered to idols, or to share in the idolatrous feasts, but even to accept an invitation to a domestic feast of the Gentiles or at least to a participation in the food on such an occasion. That it was easy for Christians to run these risks is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when St. Paul refers to the case of those who had not only eaten of the flesh offered to idols, but had also sat down to a feast in the idol’s temple.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς πορνείας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the moral explanation of this close allocation of idolatry and uncleanness is that the former so often involved the latter. But Dr. Hort whilst pointing out that such an association is not fanciful or accidental, reminds us that we ought not to lay too much stress on the connection, since many forms of idolatry might fairly be regarded as free from that particular stain. The language, however, of St. James in his Epistle shows us how imperative it was in the moral atmosphere of the Syria of the first century to guard the Christian life from sexual defilement, and the burning language of St. Paul in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., shows us the terrible risks to which Christian morality was exposed, risks enhanced by the fact that the heathen view of impurity was so lax throughout the Roman empire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Horace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sat.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i., 2, 31; Terence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Adelphi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i., 2, 21; Cicero, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Proverbs Cælio",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", xx.; and on the intimate and almost universal connection between the heathen religious guilds and societies and the observance of nameless breaches of the Christian law of purity, see Loening, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Die Gemeindeverfassung des Urchristenthums",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and his references to Foucart, p. 12 ff. Without some special prohibition it was conceivable that a man might pass from some scene of licentious indulgence to the participation in the Supper of the Lord (Plumptre, Felten). An attempt has been made to refer the word here to the sin of incest, or to marriage within the forbidden degrees, rather than to the sin of fornication, so Holtzmann, Ritschl, Zöckler, Wendt, Ramsay; but on the other hand Meyer, Ewald, Godet, Weiss, and others take the word in its general sense as it is employed elsewhere in the N.T. From what has been said above, and from the way in which women might be called upon to serve impurely in a heathen temple (to which religious obligation, as Zöckler reminds us, some have seen a reference in the word here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also Wendt, p. 332 (1888)), we see the need and the likelihood of such a specific enjoinder against the sin of fornication. Bentley conjectured ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χοιρείας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πορκείας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ πνικτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “from that which has been strangled,” lit[286], such beasts as had been killed through strangling, and whose blood had not been let out when they were killed. For this prohibition reference is usually made to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so Weiss, Wendt, Zöckler, Plumptre, Felten, Hackett. But on the other hand Dr. Hort contends that all attempts to find the prohibition in the Pentateuch quite fail, although he considers it perfectly conceivable that the flesh of animals strangled in such a way as not to allow of the letting out of blood would be counted as unlawful food by the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Origen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c. Cels.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viii., 30; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judaistic Christianity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 73, and Appendix, p. 209. But his further remark, that if such a prohibition had been actually prescribed (as in his view it is not) we should have a separate fourth precept referring only to a particular case of the third precept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "viz.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", abstinence from blood, is probably the reason why in , ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Irenæus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hær.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", iii., 12, 14; Cyprian, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Testim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", iii., 119; Tertullian, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "De Pudicitia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", xii., the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ τοῦ πνικτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are omitted here and in the decree, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although it is also possible that the laxer views on the subject in the West may have contributed to the omission (see Zöckler and Wendt). Dr. Hort leaves the difficulty unsolved, merely referring to the “Western” text without adopting it. But in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the words are again found in a reference to, and in a summary of, the decree, although here too [287] consistently omits them (see critical notes).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ ἅματος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": specially forbidden by the Jewish law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 15:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and we may refer the prohibition, with Dr. Hort, to the feeling of mystery entertained by various nations of antiquity with regard to blood, so that the feeling is not exclusively Jewish, although the Jewish law had given it such express and divine sanction. “The blood is the life,” and abstinence from it was a manifestation of reverence for the life given by and dedicated to God. This was the ground upon which the Jews based, and still base, the prohibition. Nothing could override the command first given to Noah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", together with the permission to eat animal food, and renewed in the law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἵμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". cannot refer (so Cyprian and Tertullian) to homicide, as the collocation with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πνικτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (if retained) is against any such interpretation. See additional note (2) at end of chapter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[286] literal, literally.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[287] Codex Claromontanus (sæc. vi.), a Græco-Latin MS. at Paris, edited by Tischendorf in 1852.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But that we write unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word is used primarily of a charge sent by a messenger, but also, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is often used of what is sent by letter (and hence comes the English word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "epistle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and there can be little doubt that this is the sense in the present case, for though messengers were sent, they carried with them the decision of the synod of Jerusalem in a formal manner committed to writing (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Acts 15:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that they abstain from pollutions of idols",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Acts 15:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " by “meats offered (i.e. sacrificed) to idols.” Of the necessity for such an injunction in the early church, where congregations were to be now composed of both Jews and Gentiles, we can judge from St Paul’s argument to the Corinthians (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and we can also see how he would have the Gentile converts deal tenderly with the scruples of their Jewish fellow-worshippers, however needless they themselves might deem such scruples.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pollutions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is unknown to classical Greek and of very rare occurrence. So far as the construction of the original is concerned, it might refer to the other forbidden things that follow “pollutions of idols and of fornication, &c.” But as in the other places where the cognate is found (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 40:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") it has always reference to defilement caused by food, it is better to confine the connexion in the same way here, and as in A. V. supply a preposition before the second noun, “and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fornication.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As the ordinance of the synod is for the settling of Jewish minds, we may understand the sort of offence which they were likely to feel from Daniel’s refusal to eat of the food supplied by King Nebuchadnezzar. Meat was often sold in the markets from beasts that had been offered in sacrifice to idols, and this food and those who ate it the Jew would abhor. The Gentile converts might not be careful, when they had once come to think of the idol as nothing, and might join still in banquets with their non-Christian friends, and St Paul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") supposes an extreme case, that such men might even sit down to meat in an idol-temple. If Jew and Gentile were to become one in Christ, much respect must be paid to the feelings which had been sunk deep into the minds of Israel by long years of suffering for their own idolatry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and from fornication",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This injunction must not be understood as a simple repetition of a moral law binding upon all men at all times, but must be taken in connexion with the rest of the decree, and as forbidding a sin into which converts from heathenism were most prone to fall back, and which their previous lives had taught them to regard in a very different light from that in which a Jew would see it. The Levitical law against every form of unchastity was extremely strict (Leviticus 18, 20), and it is probably to the observance of these ordinances that we may ascribe the persistence of the Jewish type, and the purity of their race at this day. Whereas among the heathen unchastity was a portion of many of their temple rites, and persons who gave themselves up to such impurities were even called by the names of the heathen divinities. To men educated in the constant contemplation of such a system, sins of unchastity would have far less guilt than in the eyes of those to whom the law of Moses was read every sabbath-day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and from things strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from what is strangled), and from blood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The prohibition of blood was made as soon as animal food was given to men (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it was frequently enforced in the Mosaic law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To eat blood was counted a sin against the Lord in the days of Saul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 14:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and with strict Jews it is an abomination to this day. Things strangled are not specially mentioned in the law of Moses, but that they should not be eaten follows from the larger prohibition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does, however, make mention of the blood of fowls, and it would be in the use of them that the eating of blood began first to be practised. And in breaking the neck of an animal the Jew held that the blood was caused to flow into the limbs in such wise that it could not be brought out even by salt. See T. B. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Chullin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 113a.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐπιστεῖλαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that we send) an epistle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This forms the beginning of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Scriptures",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the New Testament.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῶν ἀλισγημάτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἵματος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "contaminations—blood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") These were things which might have especially offended the partisans of Moses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀλίσγημα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is properly said of unclean meats (articles of food).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῶν εἰδώλων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of idols) images",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": 1 Corinthians 8—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς πορνείας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from fornication",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which was esteemed no disgrace among the Gentiles. Wherefore also Paul, in writing to the Corinthians, conjointly both exhorts against eating things sacrificed to idols, and forbids fornication; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Fornication in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is put in the last place, so as not to make a break in the words which refer to the subject of food: but here it is joined with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "things sacrificed to idols",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because it was frequently an accompaniment of the worship of idols. Observe also, that the article in this place is very often employed, in order that the language may be the more express: in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the other hand, it is never employed, in order that the language may be the milder. In chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is twice employed (according to Rec. Text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ εἰδωλόθυτον καὶ τὸ αἷμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ πνικτοῦ καὶ τοῦ αἵματος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from what is strangled and from blood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") These are interdicted, not because they were forbidden by Noah, but inasmuch as they were forbidden by Moses: see foll. ver. [And in their ordinary diet it was a great scandal in the eyes of the Jews to partake of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what was strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of which many feel even a natural horror.—V. g.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πνικτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what is strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is an expression applied to whatever has been sacrificed or killed, without the blood having been duly let out.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- The pollutions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pollutions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "what is strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "things strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The pollutions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the decree itself (ver. 29) this is explained by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰδωλοθύτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", things offered to idols, though some apply the \"pollutions\" to all the things here mentioned, not the idols only. Later St. Paul somewhat enlarged the liberty of Gentile converts in respect to meats offered to idols (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:4-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:25-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What is strangled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The things forbidden are all practices not looked upon as sins by Gentiles, but now enjoined upon them as portions of the Law of Moses which were to be binding upon them, at least for a time, with a view to their living in communion and fellowship with their Jewish brethren. The necessity for some of the prohibitions would cease when the condition of the Church as regards Jews and Gentiles was altered; others were of eternal obligation. Acts 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Write (ἐπιστεῖλαι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Originally, to send to, as a message; hence, by letter. The kindred noun ἐπιστολή, whence our epistle, means, originally, anything sent by a messenger. Letter is a secondary meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Pollutions (ἀλισγημάτων)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A word not found in classical Greek, and only here in the New Testament. The kindred verb ἀλισγεῖν, to pollute, occurs in the Septuagint, Daniel 1:8; Malachi 1:7, and both times in the sense of defiling by food. Here the word is defined by things sacrificed to idols (Acts 15:29); the flesh of idol sacrifices, of which whatever was not eaten by the worshippers at the feasts in the temples, or given to the priests, was sold in the markets and eaten at home. See 1 Corinthians 10:25-28; and Exodus 34:15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A word not found in classical Greek, and only here in the New Testament. The kindred verb ἀλισγεῖν, to pollute, occurs in the Septuagint, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and both times in the sense of defiling by food. Here the word is defined by things sacrificed to idols (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the flesh of idol sacrifices, of which whatever was not eaten by the worshippers at the feasts in the temples, or given to the priests, was sold in the markets and eaten at home. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:25-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Fornication",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In its literal sense. \"The association of fornication with three things in themselves indifferent is to be explained from the then moral corruption of heathenism, by which fornication, regarded from of old with indulgence, and even with favor, nay, practised without shame even by philosophers, and surrounded by poets with all the tinsel of lasciviousness, had become in public opinion a thing really indifferent\" (Meyer). See Dllinger, \"The Gentile and the Jew,\" ii., 237 sq.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Strangled",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The flesh of animals killed in snares, and whose blood was not poured forth, was forbidden to the Israelites. ",
        "children": []
      }
    ]
  }
]