[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:1-49 A history of the apostacy of God's people from him, and the aggravation thereof. - In this parable, Samaria and Israel bear the name Aholah, her own tabernacle; because the places of worship those kingdoms had, were of their own devising. Jerusalem and Judah bear the name of Aholibah, my tabernacle is in her, because their temple was the place which God himself had chosen, to put his name there. The language and figures are according to those times. Will not such humbling representations of nature keep open perpetual repentance and sorrow in the soul, hiding pride from our eyes, and taking us from self-righteousness? Will it not also prompt the soul to look to God continually for grace, that by his Holy Spirit we may mortify the deeds of the body, and live in holy conversation and godliness?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The army of the Assyrians is described. War-horses formed an important part in the armies of Assyria and Egypt; Israel was deficient in this respect ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 36:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. whoredoms brought from Egypt—the calves set up in Dan and Beth-el by Jeroboam, answering to the Egyptian bull-formed idol Apis. Her alliances with Egypt politically are also meant (Isa 30:2, 3; 31:1). The ten tribes probably resumed the Egyptian rites, in order to enlist the Egyptians against Judah (2Ch 12:2-4).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither left she her whoredoms brought from Egypt; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though she took in so many gods of the Assyrians, yet she did not renounce or cast off the gods of Egypt, but kept them too. It is plain the Israelites learnt idolatry in Egypt, carried it with them out of Egypt, and retained it to the last. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In her youth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 23:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither left she her idols brought from Egypt,.... Though the Israelites took in the gods of the Assyrians into their worship, they did not relinquish the golden calves set up at Dan and Bethel, in imitation of the Egyptian deities; the idolatrous worship of which they learned in Egypt, and brought from thence: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for in her youth they lay with her; the Egyptians enticed the Israelites to idolatry when among them, as soon as they began to be a people; See Gill on Ezekiel 23:3, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for in her youth they lay with her; the Egyptians enticed the Israelites to idolatry when among them, as soon as they began to be a people; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and they bruised the breasts of her virginity; who before retained the pure worship of God, and was like a chaste virgin: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and poured their whoredom upon her; expressive of the numerous acts of idolatry committed together by them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and poured their whoredom upon her; expressive of the numerous acts of idolatry committed together by them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Neither left she her harlotries brought from Egypt: for in her youth they {e} lay with her, and they bruised the breasts of her virginity, and poured their immorality upon her.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither left she her harlotries ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "brought",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from Egypt: for in her youth they ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lay with her, and they bruised the breasts of her virginity, and poured their immorality upon her.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) The Holy Spirit uses these terms which seem strange to chaste ears, to cause this wicked vice of idolatry to be so abhorred that no one could stand to hear the name of it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Samaria intrigued with Assyria and Egypt alternately, or different parties simultaneously. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Ephraim is like a silly dove, without understanding; they call unto Egypt, they go unto Assyria.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel 23:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Samaria's Whoredom and Punishment",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 23:5. And Oholibah played the harlot under me, and burned towards her lovers, even as far as Assyria, standing near; Ezekiel 23:6. Clothed in purple, governors and officers, all of them choice men of good deportment, horsemen riding upon horses. Ezekiel 23:7. And she directed her whoredom toward them, to the choice of the sons of Assyria all of them, and with all towards whom she burned, with all their idols she defiled herself. Ezekiel 23:8. Also her whoredom from Egypt she did not give up; for they had lain with her in her youth, and they had handled her virgin bosom, and had poured out their lust upon her. Ezekiel 23:9. Therefore I have given her into the hand of her lovers, into the hand of the sons of Assyria, towards whom she was inflamed. Ezekiel 23:10. They uncovered her nakedness, took away her sons and her daughters, and slew her with the sword, so that she became a legend among the women, and executed judgments upon her. - Coquetting and whoring with Assyria and Egypt denote religious and political leaning towards and connection with these nations and kingdoms, including idolatry and the formation of alliances with them, as in Ezekiel 16. תּחתּי is to be interpreted in accordance with תּחת אישׁהּ (Ezekiel 16:32). עגּב, which only occurs in Ezekiel and once in Jeremiah, denotes the eager desire kindled by passionate love towards any one. By the words אל־אשּׁוּר the lovers are more precisely defined. קרובים without an article is not an adjective, belonging to מאהביה, but in apposition, which is continued in the next verse. In these appositions the particular features, which excited the ardent passion towards the lovers, are pointed out. קרוב is not to be taken in an outward or local sense, but as signifying inward or spiritual nearness: standing near, equivalent to inwardly related, as in Psalm 38:12; Job 19:14. The description given of the Assyrians in Ezekiel 23:6 contains the thought that Israel, dazzled by Assyria's splendour, and overpowered by the might of that kingdom, had been drawn into intercourse with the Assyrians, which led her astray into idolatry. The predicate, clothed in purple, points to the splendour and glory of this imperial power; the other predicates, to the magnitude of its military force. פחות וּסגנים are rulers of higher and lower grades (cf. Jeremiah 51:57). \"Here the expression is a general one, signifying the different classes of office-bearers in the kingdom\" (Hvernick). With regard to פּחה, see my comm. on Haggai 1:1; and for סגן, see Delitzsch on Isaiah 41:25. \"Riding upon horses\" is added to פּרשׁים to denote the noblest horsemen, in contrast to riders upon asses and camels (cf. Isaiah 21:7). In Ezekiel 23:7 בּכּל־גּלּוּליהםhem is in apposition to בּכל אשׁר־עגבה, and defines more precisely the instigation to pollution: with all towards whom she burned in love, namely, with all their (the lovers') idols. The thought is as follows: it was not merely through her intercourse with the Assyrians that Israel defiled herself, but also through their idols. At the same time, Samaria did not give up the idolatry which it had derived from Egypt. It was from Egypt that the worship of God under the image of the golden calves had been imported. The words are much too strong for us to understand them as relating simply to political intercourse, as Hitzig has done. We have already observed at Ezekiel 20:7, that even in Egypt itself the Israelites had defiled themselves with Egyptian idolatry, as is also stated in Ezekiel 23:8. - Ezekiel 23:9, Ezekiel 23:10. As a punishment for this, God gave Samaria into the power of the Assyrians, so that they executed judgment upon the harlot. In Ezekiel 23:10 the prophecy passes from the figure to the fact. The uncovering of the nakedness consisted in the transportation of the sons and daughters, i.e., the population of Samaria, into exile by the Assyrians, who slew the woman herself with the sword; in other words, destroyed the kingdom of Samaria. Thus did Samaria become a name for women; that is to say, her name was circulated among the nations, her fate became an object of conversation and ridicule to the nations, not \"a nickname for the nations,\" as Hvernick supposes (vid., Ezekiel 36:3). שׁפוּטים, a later form for שׁפטים (cf. Ezekiel 16:41). ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And Oholibah played the harlot under me, and burned towards her lovers, even as far as Assyria, standing near; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Clothed in purple, governors and officers, all of them choice men of good deportment, horsemen riding upon horses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And she directed her whoredom toward them, to the choice of the sons of Assyria all of them, and with all towards whom she burned, with all their idols she defiled herself. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Also her whoredom from Egypt she did not give up; for they had lain with her in her youth, and they had handled her virgin bosom, and had poured out their lust upon her. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Therefore I have given her into the hand of her lovers, into the hand of the sons of Assyria, towards whom she was inflamed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They uncovered her nakedness, took away her sons and her daughters, and slew her with the sword, so that she became a legend among the women, and executed judgments upon her. - Coquetting and whoring with Assyria and Egypt denote religious and political leaning towards and connection with these nations and kingdoms, including idolatry and the formation of alliances with them, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". תּחתּי is to be interpreted in accordance with תּחת אישׁהּ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). עגּב, which only occurs in Ezekiel and once in Jeremiah, denotes the eager desire kindled by passionate love towards any one. By the words אל־אשּׁוּר the lovers are more precisely defined. קרובים without an article is not an adjective, belonging to מאהביה, but in apposition, which is continued in the next verse. In these appositions the particular features, which excited the ardent passion towards the lovers, are pointed out. קרוב is not to be taken in an outward or local sense, but as signifying inward or spiritual nearness: standing near, equivalent to inwardly related, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 38:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The description given of the Assyrians in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contains the thought that Israel, dazzled by Assyria's splendour, and overpowered by the might of that kingdom, had been drawn into intercourse with the Assyrians, which led her astray into idolatry. The predicate, clothed in purple, points to the splendour and glory of this imperial power; the other predicates, to the magnitude of its military force. פחות וּסגנים are rulers of higher and lower grades (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:57",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"Here the expression is a general one, signifying the different classes of office-bearers in the kingdom\" (Hvernick). With regard to פּחה, see my comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and for סגן, see Delitzsch on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Riding upon horses\" is added to פּרשׁים to denote the noblest horsemen, in contrast to riders upon asses and camels (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 21:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " בּכּל־גּלּוּליהםhem is in apposition to בּכל אשׁר־עגבה, and defines more precisely the instigation to pollution: with all towards whom she burned in love, namely, with all their (the lovers') idols. The thought is as follows: it was not merely through her intercourse with the Assyrians that Israel defiled herself, but also through their idols. At the same time, Samaria did not give up the idolatry which it had derived from Egypt. It was from Egypt that the worship of God under the image of the golden calves had been imported. The words are much too strong for us to understand them as relating simply to political intercourse, as Hitzig has done. We have already observed at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that even in Egypt itself the Israelites had defiled themselves with Egyptian idolatry, as is also stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As a punishment for this, God gave Samaria into the power of the Assyrians, so that they executed judgment upon the harlot. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the prophecy passes from the figure to the fact. The uncovering of the nakedness consisted in the transportation of the sons and daughters, i.e., the population of Samaria, into exile by the Assyrians, who slew the woman herself with the sword; in other words, destroyed the kingdom of Samaria. Thus did Samaria become a name for women; that is to say, her name was circulated among the nations, her fate became an object of conversation and ridicule to the nations, not \"a nickname for the nations,\" as Hvernick supposes (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 36:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). שׁפוּטים, a later form for שׁפטים (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]