[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(39) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaac his father answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Unwillingly, and only after repeated entreaty and earnest expostulation, and even tears, upon Esau’s side, does Isaac bring himself to the effort to lessen in any way the painful consequences to his favourite son of his brother having robbed him of the blessing. Plainly, he felt that he had endeavoured to do what was wrong, and was afraid lest he should still be found resisting God’s will.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy dwelling shall be the fatness.—Heb., thy dwelling shall be of the fat places of the earth. (See Note on Genesis 27:28.) But most modern expositors consider that the preposition should not be translated “of,” but from, that is:—",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Thy dwelling shall be the fatness.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "thy dwelling shall be of the fat places of the earth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(See Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) But most modern expositors consider that the preposition should not be translated “of,” but ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "from, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that is:—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Behold thy dwelling shall be away from the fat places of the earth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And away from the dew of heaven from above,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And by (Heb., upon—depending upon) thy sword thou shalt live,” &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By this rendering the parts of the blessing agree together. Those who have fertile lands live by agriculture, but the inhabitants of sterile regions must look to more adventurous enterprises for a living. So the Swiss, like the Greeks of old, long served as mercenaries in the armies of other states. Idumæa, though not destitute of fruitful tracts, and even famous for its orchards, was, as a whole, sterile and unproductive, and the people were restless and unquiet. Moreover, Isaac had already given the corn-land and vineyards to Jacob (Genesis 27:37), and had no second gift of them in his power. It is no answer to this to say that as the same preposition is used in Genesis 27:28, it cannot have a contrary sense in the two blessings. It there follows a verb of giving, and necessarily has a partitive signification. Here there is nothing absolutely to settle its meaning, and we are left to the general sense. Possibly, Isaac may have purposely used an ambiguous word; but the meaning as a whole is clear. Esau was to inhabit a land which by its barrenness would force him to a life of adventure, military service, and freebooting.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By this rendering the parts of the blessing agree together. Those who have fertile lands live by agriculture, but the inhabitants of sterile regions must look to more adventurous enterprises for a living. So the Swiss, like the Greeks of old, long served as mercenaries in the armies of other states. Idumæa, though not destitute of fruitful tracts, and even famous for its orchards, was, as a whole, sterile and unproductive, and the people were restless and unquiet. Moreover, Isaac had already given the corn-land and vineyards to Jacob (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and had no second gift of them in his power. It is no answer to this to say that as the same preposition is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it cannot have a contrary sense in the two blessings. It there follows a verb of giving, and necessarily has a partitive signification. Here there is nothing absolutely to settle its meaning, and we are left to the general sense. Possibly, Isaac may have purposely used an ambiguous word; but the meaning as a whole is clear. Esau was to inhabit a land which by its barrenness would force him to a life of adventure, military service, and freebooting.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 27:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The fatness of the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Mount Seir, the heritage of Esau, was a fertile place, refreshed with dews and showers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By thy sword shalt thou live — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, thou shalt be warlike, and live upon spoil. This was remarkably fulfilled both in Esau himself, and his posterity. He was a cunning hunter, a man of the field, and his descendants got possession of mount Seir by force and violence, expelling thence the Horites, the former inhabitants, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They were almost continually at war with the Jews, both before and after the Babylonish captivity. Josephus says, they were so fond of broils, that they went to war as others would do to a banquet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt serve thy brother — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God never permitted the Edomites to lord it over the Israelites, although he made use of almost all the other neighbouring nations successively to oppress them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When thou shalt have dominion — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Shalt gain strength, become powerful, and appoint a king of thy own. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt break his yoke from off thy neck — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“When the sons of Jacob,” says the Jerusalem Targum here, “attend to the law, and observe the precepts, they shall impose a yoke of servitude upon thy neck; but when they shall turn away themselves from studying the law, and neglect the precepts, behold, then thou shalt shake off the yoke of servitude.” This is no bad exposition of the passage: for it was David who brought the Edomites under the yoke, and in his time the Jews in a great degree observed the law. But in the reign of Jehoram, when they were very corrupt, “the Edomites revolted from under the dominion of Judah, making themselves a king,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We may observe here, although Esau obtained a blessing, it was far short of Jacob’s. There is nothing in it that points at Christ, nothing that brings either Esau or his posterity into the Church of God, and without that, “the fatness of the earth” and the plunder of the field will stand him in little stead. Thus Isaac, by faith, blessed them both according as their lot should be. And surely the exact accomplishment of these prophetic declarations, which were fulfilled many hundreds of years after the death of Moses who recorded them, must, if properly considered, give us a high idea of the Holy Scriptures, and convince us that they are truly the words of that BEING who knoweth the end from the beginning.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:30-40 When Esau understood that Jacob had got the blessing, he cried with a great and exceeding bitter cry. The day is coming, when those that now make light of the blessings of the covenant, and sell their title to spiritual blessings for that which is of no value, will, in vain, ask urgently for them. Isaac, when made sensible of the deceit practised on him, trembled exceedingly. Those who follow the choice of their own affections, rather than the Divine will, get themselves into perplexity. But he soon recovers, and confirms the blessing he had given to Jacob, saying, I have blessed him, and he shall be blessed. Those who part with their wisdom and grace, their faith and a good conscience, for the honours, wealth, or pleasures of this world, however they feign a zeal for the blessing, have judged themselves unworthy of it, and their doom shall be accordingly. A common blessing was bestowed upon Esau. This he desired. Faint desires of happiness, without right choice of the end, and right use of the means, deceive many unto their own ruin. Multitudes go to hell with their mouths full of good wishes. The great difference is, that there is nothing in Esau's blessing which points at Christ; and without that, the fatness of the earth, and the plunder of the field, will stand in little stead. Thus Isaac, by faith, blessed both his sons, according as their lot should be.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At length, in reply to the weeping suppliant, he bestows upon him a characteristic blessing. \"Away from the fatness.\" The preposition (מי  mı̂y) is the same as in the blessing of Jacob. But there, after a verb of giving, it had a partitive sense; here, after a noun of place, it denotes distance or separation; for example, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 20:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The pastoral life has been distasteful to Esau, and so it shall be with his race. The land of Edom was accordingly a comparative wilderness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"On thy sword.\" By preying upon others. \"And thy brother shalt thou serve.\" Edom was long independent; but at length Saul was victorious over them ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 14:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and David conquered them ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then followed a long struggle, until John Hyrcanus, 129 b.c., compelled them to be circumcised and incorporated into Judaism. \"Break his yoke.\" The history of Edom was a perpetual struggle against the supremacy of Israel. Conquered by Saul, subdued by David, repressed by Solomon, restrained after a revolt by Amaziah, they recovered their independence in the time of Ahab. They were incorporated into the Jewish state, and furnished it with the dynasty of princes beginning with Antipater. Esau was now exasperated against his brother, and could only compose his mind by resolving to slay him during the days of mourning after his father's death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39, 40. Behold, thy dwelling shall be the fatness of the earth—The first part is a promise of temporal prosperity, made in the same terms as Jacob's [Ge 27:28]—the second part refers to the roving life of hunting freebooters, which he and his descendants should lead. Though Esau was not personally subject to his brother, his posterity were tributary to the Israelites, till the reign of Joram when they revolted and established a kingdom of their own (2Ki 8:20; 2Ch 21:8-10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In a country competently fruitful and refreshed with convenient dews and showers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Object.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus Esau seems to have the same blessing which was before given to Jacob. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. Though it may seem to be the same as to the fertility of the soil, in which divers other parts of the world did and do equal the land of Canaan; yet there is an observable difference in the manner of Isaac’s expression. When he speaks of Esau, he only saith: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy dwelling shall be the fatness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. But when he speaks to Jacob, he saith: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God give thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall give thee of the fatness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.; which words being, as it may seem, purposely omitted concerning Esau, and so emphatically expressed concerning Jacob, seem to intimate, especially if compared with many other scriptures where that phrase is applied to good men, that Esau’s fat soil was rather taken by himself than given by God; or if given by God to him, it was only by his general providence, by which he giveth food to all creatures; whereas Jacob’s fat and fruitful soil was derived to him and his by God’s special gift, as a token of his singular kindness, and pledge of greater blessings: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. This is but one branch of the blessing; the other part, which concerns dignity and superiority, is expressly given to Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 27:29",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and denied to Esau, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 27:40",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:40",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Isaac his father answered and said unto him,.... Being willing to bestow what he could upon him, without lessening or breaking in upon the grant made to Jacob: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above: this agrees with part of the blessing of Jacob, only the clauses are inverted, and no mention made of corn and wine; the land of Edom not being so fat and fruitful as the land of Canaan. Castalio renders the words very differently, \"thy habitation shall be from the fatness of the earth, or without the fatness of the earth, and without the dew of heaven from above\" (c); or otherwise he thinks Esau would have the same blessing with Jacob, and so would have no occasion of complaint or grief, or to have hated his brother and sought his life; to which may be added, that the land of Edom, which Esau and his posterity inhabited, was a very desert country, see Malachi 1:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above: this agrees with part of the blessing of Jacob, only the clauses are inverted, and no mention made of corn and wine; the land of Edom not being so fat and fruitful as the land of Canaan. Castalio renders the words very differently, \"thy habitation shall be from the fatness of the earth, or without the fatness of the earth, and without the dew of heaven from above\" (c); or otherwise he thinks Esau would have the same blessing with Jacob, and so would have no occasion of complaint or grief, or to have hated his brother and sought his life; to which may be added, that the land of Edom, which Esau and his posterity inhabited, was a very desert country, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) See the Bishop of Clogher's Chronology of the Hebrew Bible, p. 142. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) See the Bishop of Clogher's Chronology of the Hebrew Bible, p. 142. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Isaac his father answered and said unto him, Behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Isaac’s utterance again takes the form of poetry. His prediction as to Esau’s future is contained in 6 strophes; 1 and 2 refer to the physical conditions of the nation’s existence; 3 to its manner of life; 4 to its temporary subjection to Israel; 5 to its revolt; 6 to its ultimate independence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "away from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Heb. preposition ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "min",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “from,” admits of both renderings. The oracle is intentionally ambiguous. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 27:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (“",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the dew … ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the fatness”) there can be no doubt the preposition is used in its partitive sense, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The English versions in this verse translate ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "min",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by “of,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 27:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It might be expected that a preposition used by the same person, with the same nouns, and in a similar context in the same passage, would be identical in meaning. According to this rendering, Isaac promises to Esau a country blessed with rich soil and favourable physical conditions: but he cannot promise a settled or happy government; only a struggle for existence, a temporary servitude, and final freedom. This interpretation, however, seems to miss the point of Isaac’s prediction as to the future material conditions of Esau’s lot. The land of Edom was rugged and mountainous; Esau will live by the sword, not by the fertility of the soil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is better to follow the margin, “away from”; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Isaac has really only one blessing; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 27:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Esau’s future will not be as Jacob’s. His country in Mount Seir will not be rich and fertile, like the land of Canaan. His people will not be peaceful cultivators of the soil; they will dwell in the mountains, and get their livelihood as robbers. Edom will serve Israel; but only for a time. This is the climax of the prediction. In spite of hardships, in spite of social inferiority, and in spite of subjugation, Edom shall at last win freedom. According to this interpretation, Isaac’s words contain no soft blessing; but a stern, truthful, continuous prediction, describing (1) the barrenness and aridity of the soil of Edom, (2) the warlike temper of the people, (3) their subjugation to Israel, (4) their ultimate revolt and freedom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The blessing of Jacob excludes the blessing of Esau; but does not shut out the hope of successful rebellion against the favoured brother. The play of words, produced by the different use of the same preposition, is what might be expected in the language of an ancient oracle; and is quite congenial to the genius of Heb. literature. For the oracular and different use of the same words, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fatness … dew of heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 27:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 39.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Isaac his father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (moved by the tearful earnestness of Esau) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "answered and said unto him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - still speaking under inspiration, though it is doubtful whether what he spoke was a real, or only an apparent, blessing - (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "infra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- Behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "- ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Behold, thy dwelling shall be the fatness of the earth, and of the dew of heaven from above",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מִן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the fatnesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or fat places) ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and from the dew of area",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; a substantial repetition of the temporal blessing bestowed on Jacob (ver. 28), with certain important variations, such as the omission of plenty of corn and wine at the close, and of the name of Elohim at the commencement, of the benediction (Vulgate, Luther, Calvin, Ainsworth, Rosenmüller, 'Speaker's Commentary'); though, by assigning to the preposition a privative rather than a partitive sense, it is readily transformed into \"a modified curse\" - behold, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "away from the fatnesses o/the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall thy dwelling be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", meaning that, in contrast to the land of Canaan, the descendants of Esau should be located in a sterile region (Tuch, Knobel, Kurtz, Delitzseh, Keil, Kalisch, Murphy). In support of this latter rendering it is urged ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that it is grammatically admissible; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that it corresponds with the present aspect of Idumaea, which is \"on the whole a dreary and unproductive land;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that it agrees with the preceding statement that every blessing had already been bestowed upon Jacob; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that it explains the play upon the words \"fatness\" and \"dew,\" which are here chosen to describe a state of matter exactly the opposite to that which was declared to be the lot of Jacob. On the other hand, it is felt to be somewhat arbitrary to assign to the preposition a partitive sense in ver. 28 and a privative in ver. 39. Though called in later times (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a waste and desolate region, it may not have been originally so, or only in comparison with Canaan; while according to modern travelers the glens and mountain terraces of Edom, covered with rich soil, only want an industrious population to convert the entire region into \"one of the wealthiest, as it is one of the most picturesque, countries in the world.\" Genesis 27:39",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob had hardly left his father, after receiving the blessing (יצא אך, was only gone out), when Esau returned and came to Isaac, with the game prepared, to receive the blessing. The shock was inconceivable which Isaac received, when he found that he had blessed another, and not Esau-that, in fact, he had blessed Jacob. At the same time he neither could nor would, either curse him on account of the deception which he had practised, or withdraw the blessing imparted. For he could not help confessing to himself that he had sinned and brought the deception upon himself by his carnal preference for Esau. Moreover, the blessing was not a matter of subjective human affection, but a right entrusted by the grace of God to paternal supremacy and authority, in the exercise of which the person blessing, being impelled and guided by a higher authority, imparted to the person to be blest spiritual possessions and powers, which the will of man could not capriciously withdraw. Regarding this as the meaning of the blessing, Isaac necessarily saw in what had taken place the will of God, which had directed to Jacob the blessing that he had intended for Esau. He therefore said, \"I have blessed him; yea, he will be (remain) blessed\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Even the great and bitter lamentation into which Esau broke out could not change his father's mind. To his entreaty in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Bless me, even me also, O my father!\" he replied, \"Thy brother came with subtilty, and hath taken away thy blessing.\" Esau answered, \"Is it that (הכי) they have named him Jacob (overreacher), and he has overreached me twice?\" i.e., has he received the name Jacob from the fact that he has twice outwitted me? הכי is used \"when the cause is not rightly known\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To his further entreaty, \"Hast thou not reserved a blessing for me?\" (אצל, lit., to lay aside), Isaac repeated the substance of the blessing given to Jacob, and added, \"and to thee (לכה for לך as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), now, what can I do, my son?\" When Esau again repeated, with tears, the entreaty that Isaac would bless him also, the father gave him a blessing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but one which, when compared with the blessing of Jacob, was to be regarded rather as \"a modified curse,\" and which is not even described as a blessing, but \"introduced a disturbing element into Jacob's blessing, a retribution for the impure means by which he had obtained it.\" \"Behold,\" it states, \"from the fat fields of the earth will thy dwelling be, and from the dew of heaven from above.\" By a play upon the words Isaac uses the same expression as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"from the fat fields of the earth, and from the dew,\" but in the opposite sense, מן being partitive there, and privative here, \"from  equals  away from.\" The context requires that the words should be taken thus, and not in the sense of \"thy dwelling shall partake of the fat of the earth and the dew of heaven\" (Vulg., Luth., etc.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: I cannot discover, however, in Malachi 1:3 an authentic proof of the privative meaning, as Kurtz and Delitzsch do, since the prophet's words, \"I have hated Esau, and laid his mountains and his heritage waste,\" are not descriptive of the natural condition of Idumaea, but of the desolation to which the land was given up.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: I cannot discover, however, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an authentic proof of the privative meaning, as Kurtz and Delitzsch do, since the prophet's words, \"I have hated Esau, and laid his mountains and his heritage waste,\" are not descriptive of the natural condition of Idumaea, but of the desolation to which the land was given up.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Since Isaac said (Genesis 27:37) he had given Jacob the blessing of the super-abundance of corn and wine, he could not possibly promise Esau also fat fields and the dew of heaven. Nor would this agree with the words which follows, \"By thy sword wilt thou live.\" Moreover, the privative sense of מן is thoroughly poetical (cf. 2 Samuel 1:22; Job 11:15, etc.). The idea expressed in the words, therefore, was that the dwelling-place of Esau would be the very opposite of the land of Canaan, viz., an unfruitful land. This is generally the condition of the mountainous country of Edom, which, although not without its fertile slopes and valleys, especially in the eastern portion (cf. Robinson, Pal. ii. p. 552), is thoroughly waste and barren in the western; so that Seetzen says it consists of \"the most desolate and barren mountains probably in the world.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Since Isaac said (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") he had given Jacob the blessing of the super-abundance of corn and wine, he could not possibly promise Esau also fat fields and the dew of heaven. Nor would this agree with the words which follows, \"By thy sword wilt thou live.\" Moreover, the privative sense of מן is thoroughly poetical (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.). The idea expressed in the words, therefore, was that the dwelling-place of Esau would be the very opposite of the land of Canaan, viz., an unfruitful land. This is generally the condition of the mountainous country of Edom, which, although not without its fertile slopes and valleys, especially in the eastern portion (cf. Robinson, Pal. ii. p. 552), is thoroughly waste and barren in the western; so that Seetzen says it consists of \"the most desolate and barren mountains probably in the world.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The mode of life and occupation of the inhabitants were adapted to the country. \"By (lit., on) thy sword thou wilt live;\" i.e., thy maintenance will depend on the sword (על as in Deuteronomy 8:3 cf. Isaiah 28:16), \"live by war, rapine, and freebooting\" (Knobel). \"And thy brother thou wilt serve; yet it will come to pass, as (כּאשׁר, lit., in proportion as, cf. Numbers 27:14) thou shakest (tossest), thou wilt break his yoke from thy neck.\" רוּד, \"to rove about\" (Jeremiah 2:31; Hosea 12:1), Hiphil \"to cause (the thoughts) to rove about\" (Psalm 55:3); but Hengstenberg's rendering is the best here, viz., \"to shake, sc., the yoke.\" In the wild, sport-loving Esau there was aptly prefigured the character of his posterity. Josephus describes the Idumaean people as \"a tumultuous and disorderly nation, always on the watch on every motion, delighting in mutations\" (Whiston's tr.: de bell Judges 4; Judges 1:1-21:25; 1). The mental eye of the patriarch discerned in the son his whole future family in its attitude to its brother-nation, and he promised Edom, not freedom from the dominion of Israel (for Esau was to serve his brother, as Jehovah had predicted before their birth), but only a repeated and not unsuccessful struggle for freedom. And so it was; the historical relation of Edom to Israel assumed the form of a constant reiteration of servitude, revolt, and reconquest. After a long period of independence at the first, the Edomites were defeated by Saul (1 Samuel 14:47) and subjugated by David (2 Samuel 8:14); and, in spite of an attempt at revolt under Solomon (1 Kings 11:14.), they remained subject to the kingdom of Judah until the time of Joram, when they rebelled. They were subdued again by Amaziah (2 Kings 14:7; 2 Chronicles 25:11.), and remained in subjection under Uzziah and Jotham (2 Kings 14:22; 2 Chronicles 26:2). It was not till the reign of Ahaz that they shook the yoke of Judah entirely off (2 Kings 16:6; 2 Chronicles 28:17), without Judah being ever able to reduce them again. At length, however, they were completely conquered by John Hyrcanus about b.c. 129, compelled to submit to circumcision, and incorporated in the Jewish state (Josephus, Ant. xiii. 9, 1, xv. 7, 9). At a still later period, through Antipater and Herod, they established an Idumaean dynasty over Judea, which lasted till the complete dissolution of the Jewish state. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The mode of life and occupation of the inhabitants were adapted to the country. \"By (lit., on) thy sword thou wilt live;\" i.e., thy maintenance will depend on the sword (על as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), \"live by war, rapine, and freebooting\" (Knobel). \"And thy brother thou wilt serve; yet it will come to pass, as (כּאשׁר, lit., in proportion as, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 27:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") thou shakest (tossest), thou wilt break his yoke from thy neck.\" רוּד, \"to rove about\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), Hiphil \"to cause (the thoughts) to rove about\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but Hengstenberg's rendering is the best here, viz., \"to shake, sc., the yoke.\" In the wild, sport-loving Esau there was aptly prefigured the character of his posterity. Josephus describes the Idumaean people as \"a tumultuous and disorderly nation, always on the watch on every motion, delighting in mutations\" (Whiston's tr.: de bell ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 1:1-21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; 1). The mental eye of the patriarch discerned in the son his whole future family in its attitude to its brother-nation, and he promised Edom, not freedom from the dominion of Israel (for Esau was to serve his brother, as Jehovah had predicted before their birth), but only a repeated and not unsuccessful struggle for freedom. And so it was; the historical relation of Edom to Israel assumed the form of a constant reiteration of servitude, revolt, and reconquest. After a long period of independence at the first, the Edomites were defeated by Saul (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and subjugated by David (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and, in spite of an attempt at revolt under Solomon (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), they remained subject to the kingdom of Judah until the time of Joram, when they rebelled. They were subdued again by Amaziah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 25:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), and remained in subjection under Uzziah and Jotham (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It was not till the reign of Ahaz that they shook the yoke of Judah entirely off (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), without Judah being ever able to reduce them again. At length, however, they were completely conquered by John Hyrcanus about b.c. 129, compelled to submit to circumcision, and incorporated in the Jewish state (Josephus, Ant. xiii. 9, 1, xv. 7, 9). At a still later period, through Antipater and Herod, they established an Idumaean dynasty over Judea, which lasted till the complete dissolution of the Jewish state. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus the words of Isaac to his two sons were fulfilled-words which are justly said to have been spoken \"in faith concerning things to come\" (Hebrews 11:20). For the blessing was a prophecy, and that not merely in the case of Esau, but in that of Jacob also; although Isaac was deceived with regard to the person of the latter. Jacob remained blessed, therefore, because, according to the predetermination of God, the elder was to serve the younger; but the deceit by which his mother prompted him to secure the blessing was never approved. On the contrary, the sin was followed by immediate punishment. Rebekah was obliged to send her pet son into a foreign land, away from his father's house, and in an utterly destitute condition. She did not see him for twenty years, even if she lived till his return, and possibly never saw again. Jacob had to atone for his sin against both brother and father by a long and painful exile, in the midst of privation, anxiety, fraud, and want. Isaac was punished for retaining his preference for Esau, in opposition to the revealed will of Jehovah, by the success of Jacob's stratagem; and Esau for his contempt of the birthright, by the loss of the blessing of the first-born. In this way a higher hand prevailed above the acts of sinful men, bringing the counsel and will of Jehovah to eventual triumph, in opposition to human thought and will. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus the words of Isaac to his two sons were fulfilled-words which are justly said to have been spoken \"in faith concerning things to come\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For the blessing was a prophecy, and that not merely in the case of Esau, but in that of Jacob also; although Isaac was deceived with regard to the person of the latter. Jacob remained blessed, therefore, because, according to the predetermination of God, the elder was to serve the younger; but the deceit by which his mother prompted him to secure the blessing was never approved. On the contrary, the sin was followed by immediate punishment. Rebekah was obliged to send her pet son into a foreign land, away from his father's house, and in an utterly destitute condition. She did not see him for twenty years, even if she lived till his return, and possibly never saw again. Jacob had to atone for his sin against both brother and father by a long and painful exile, in the midst of privation, anxiety, fraud, and want. Isaac was punished for retaining his preference for Esau, in opposition to the revealed will of Jehovah, by the success of Jacob's stratagem; and Esau for his contempt of the birthright, by the loss of the blessing of the first-born. In this way a higher hand prevailed above the acts of sinful men, bringing the counsel and will of Jehovah to eventual triumph, in opposition to human thought and will. ",
            "children": []
          }
        ]
      }
    ]
  }
]