[{"header":"God’s Agreement with Abram"},{"num":15,"verse":"After these things happened, the Lord spoke his word to Abram in a vision: “Abram, don’t be afraid. I will defend you, and I will give you a great reward.”"},{"num":2,"verse":"But Abram said, “Lord God, what can you give me? I have no son, so my slave Eliezer from Damascus will get everything I own after I die.” "},{"num":3,"verse":"Abram said, “Look, you have given me no son, so a slave born in my house will inherit everything I have.”"},{"num":4,"verse":"Then the Lord spoke his word to Abram: “He will not be the one to inherit what you have. You will have a son of your own who will inherit what you have.”"},{"num":5,"verse":"Then God led Abram outside and said, “Look at the sky. There are so many stars you cannot count them. Your descendants also will be too many to count.”"},{"num":6,"verse":"Abram believed the Lord. And the Lord accepted Abram’s faith, and that faith made him right with God."},{"num":7,"verse":"God said to Abram, “I am the Lord who led you out of Ur of Babylonia so that I could give you this land to own.”"},{"num":8,"verse":"But Abram said, “Lord God, how can I be sure that I will own this land?”"},{"num":9,"verse":"The Lord said to Abram, “Bring me a three-year-old cow, a three-year-old goat, a three-year-old male sheep, a dove, and a young pigeon.”"},{"num":10,"verse":"Abram brought them all to God. Then Abram killed the animals and cut each of them into two pieces, laying each half opposite the other half. But he did not cut the birds in half. "},{"num":11,"verse":"Later, large birds flew down to eat the animals, but Abram chased them away."},{"num":12,"verse":"As the sun was going down, Abram fell into a deep sleep. While he was asleep, a very terrible darkness came. "},{"num":13,"verse":"Then the Lord said to Abram, “You can be sure that your descendants will be strangers and travel in a land they don’t own. The people there will make them slaves and be cruel to them for four hundred years. "},{"num":14,"verse":"But I will punish the nation where they are slaves. Then your descendants will leave that land, taking great wealth with them. "},{"num":15,"verse":"And you, Abram, will die in peace and will be buried at an old age. "},{"num":16,"verse":"After your great-great-grandchildren are born, your people will come to this land again. It will take that long, because I am not yet going to punish the Amorites for their evil behavior.”"},{"num":17,"verse":"After the sun went down, it was very dark. Suddenly a smoking firepot and a blazing torch passed between the halves of the dead animals. "},{"num":18,"verse":"So on that day the Lord made an agreement with Abram and said, “I will give to your descendants the land between the river of Egypt and the great river Euphrates. "},{"num":19,"verse":"This is the land of the Kenites, Kenizzites, Kadmonites, "},{"num":20,"verse":"Hittites, Perizzites, Rephaites, "},{"num":21,"verse":"Amorites, Canaanites, Girgashites, and Jebusites.”"}]