[{"header":"The third heading: The new covenant at Moab"},{"num":29,"verse":" These are the words of the covenant the Lord commanded Moses to make with the Israelites in the land of Moab in addition to the covenant he had made with them at Horeb."},{"num":2,"verse":" Moses summoned all Israel, saying to them:"},{"num":3,"verse":"the great trials your eyes witnessed, those awesome signs and wonders!"},{"num":4,"verse":"But until this very moment, the Lord hasn’t given you insight to understand, eyes to see, or ears to hear."},{"num":5,"verse":"I’ve led you in the wilderness forty years now; neither the clothes on your back nor the sandals on your feet have worn out."},{"num":6,"verse":"Neither have you eaten bread nor drunk wine or beer during this time—so that you would know that I am the Lord your God."},{"num":7,"verse":"When you arrived here, Sihon, Heshbon’s king, and Og, Bashan’s king, marched out to fight against us, but we defeated them."},{"num":8,"verse":"We took possession of their land and gave it as an inheritance to the Reubenites, Gadites, and half of Manasseh’s tribe."},{"num":9,"verse":"So then keep the words of this covenant and do them so you can succeed in all you do."},{"num":10,"verse":"Right now, all of you are in the presence of the Lord your God—the leaders of your tribes, your elders, and your officials, all the Israelite males,"},{"num":11,"verse":"your children, your wives, and the immigrants who live with you in your camp, the ones who chop your wood and those who draw your water—"},{"num":12,"verse":"ready to enter into the Lord your God’s covenant and into the agreement that the Lord your God is making with you right now."},{"num":13,"verse":"That means the Lord will make you his own people right now—he will be your God just as he promised you and just as he swore to our ancestors: to Abraham, Isaac, and Jacob."},{"num":14,"verse":"But I’m not making this covenant and this agreement with you alone"},{"num":15,"verse":"but also with those standing here with us right now before the Lord our God, and also with those who aren’t here with us right now."},{"num":16,"verse":"You know firsthand how we used to live in Egypt and how we passed right through the nations that you passed through."},{"num":17,"verse":"You saw the horrific things, the filthy idols of wood and stone, silver and gold, that they had with them."},{"num":18,"verse":"Make sure there isn’t any one among you right now—male or female, clan or tribe—whose mind is turning from being with the Lord our God in favor of going to serve these nations’ gods. Make sure there isn’t any root among you that is sprouting poison and bitterness."},{"num":19,"verse":"When that kind of person hears the words of this agreement, they congratulate themselves, thinking: I’ll be fine even though I insist on being stubborn. This would cause something wet to dry up and become like something parched."},{"num":20,"verse":"The Lord won’t be willing to forgive that kind of person; instead, the Lord’s anger and passion will smolder against that person. Every curse written in this scroll will stretch out over them, and the Lord will wipe out their name from under the heavens."},{"num":21,"verse":"Out of all Israel’s tribes, the Lord will single them out for disaster in compliance with all the covenant curses that are written in this Instruction scroll."},{"num":22,"verse":"Future generations, your children after you, or foreigners from distant lands will say: Look at all that land’s plagues and the sicknesses that the Lord laid on it!"},{"num":23,"verse":"Look at all its land burned by sulfur and salt, unsuitable for planting, unable to grow or produce any vegetation, as devastated as Sodom and Gomorrah, Admah and Zeboiim, which the Lord devastated in anger and wrath!"},{"num":24,"verse":"Indeed, all nations will ask: Why did the Lord do this to this land? What led to this terrible display of anger?"},{"num":25,"verse":"They will deduce: It was because those people abandoned the covenant of the Lord, their ancestors’ God, which he made with them when he brought them out of Egypt."},{"num":26,"verse":"They followed other gods, serving them and worshipping them—other gods that they hadn’t experienced before and that the Lord hadn’t designated for them."},{"num":27,"verse":"Then the Lord’s anger burned against that land, and he brought against it every curse written in this scroll."},{"num":28,"verse":"The Lord ripped them off their land in anger, wrath, and great fury. He threw them into other lands, and that’s how things still stand today."},{"num":29,"verse":"The secret things belong to the Lord our God. The revealed things belong to us and to our children forever: to keep all the words of this covenant."}]