[{"num":29,"verse":" These are the words of the covenant that the Lord commanded Moses to make with the Israelites in the land of Moab, in addition to the covenant that he had made with them at Horeb."},{"header":"The Covenant Renewed in Moab"},{"num":2,"verse":" Moses summoned all Israel and said to them: You have seen all that the Lord did before your eyes in the land of Egypt, to Pharaoh and to all his servants and to all his land, "},{"num":3,"verse":"the great trials that your eyes saw, the signs, and those great wonders. "},{"num":4,"verse":"But to this day the Lord has not given you a mind to understand, or eyes to see, or ears to hear. "},{"num":5,"verse":"I have led you for forty years in the wilderness. The clothes on your back have not worn out, and the sandals on your feet have not worn out; "},{"num":6,"verse":"you have not eaten bread, and you have not drunk wine or strong drink—so that you may know that I am the Lord your God. "},{"num":7,"verse":"When you came to this place, King Sihon of Heshbon and King Og of Bashan came out against us for battle, but we defeated them. "},{"num":8,"verse":"We took their land and gave it as an inheritance to the Reubenites, the Gadites, and the half-tribe of Manasseh. "},{"num":9,"verse":"Therefore diligently observe the words of this covenant, in order that you may succeed in everything that you do."},{"num":10,"verse":"You stand assembled today, all of you, before the Lord your God—the leaders of your tribes, your elders, and your officials, all the men of Israel, "},{"num":11,"verse":"your children, your women, and the aliens who are in your camp, both those who cut your wood and those who draw your water— "},{"num":12,"verse":"to enter into the covenant of the Lord your God, sworn by an oath, which the Lord your God is making with you today; "},{"num":13,"verse":"in order that he may establish you today as his people, and that he may be your God, as he promised you and as he swore to your ancestors, to Abraham, to Isaac, and to Jacob. "},{"num":14,"verse":"I am making this covenant, sworn by an oath, not only with you who stand here with us today before the Lord our God, "},{"num":15,"verse":"but also with those who are not here with us today. "},{"num":16,"verse":"You know how we lived in the land of Egypt, and how we came through the midst of the nations through which you passed. "},{"num":17,"verse":"You have seen their detestable things, the filthy idols of wood and stone, of silver and gold, that were among them. "},{"num":18,"verse":"It may be that there is among you a man or woman, or a family or tribe, whose heart is already turning away from the Lord our God to serve the gods of those nations. It may be that there is among you a root sprouting poisonous and bitter growth. "},{"num":19,"verse":"All who hear the words of this oath and bless themselves, thinking in their hearts, ‘We are safe even though we go our own stubborn ways’ (thus bringing disaster on moist and dry alike)— "},{"num":20,"verse":"the Lord will be unwilling to pardon them, for the Lord’s anger and passion will smoke against them. All the curses written in this book will descend on them, and the Lord will blot out their names from under heaven. "},{"num":21,"verse":"The Lord will single them out from all the tribes of Israel for calamity, in accordance with all the curses of the covenant written in this book of the law. "},{"num":22,"verse":"The next generation, your children who rise up after you, as well as the foreigner who comes from a distant country, will see the devastation of that land and the afflictions with which the Lord has afflicted it— "},{"num":23,"verse":"all its soil burned out by sulphur and salt, nothing planted, nothing sprouting, unable to support any vegetation, like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the Lord destroyed in his fierce anger— "},{"num":24,"verse":"they and indeed all the nations will wonder, ‘Why has the Lord done thus to this land? What caused this great display of anger?’ "},{"num":25,"verse":"They will conclude, ‘It is because they abandoned the covenant of the Lord, the God of their ancestors, which he made with them when he brought them out of the land of Egypt. "},{"num":26,"verse":"They turned and served other gods, worshipping them, gods whom they had not known and whom he had not allotted to them; "},{"num":27,"verse":"so the anger of the Lord was kindled against that land, bringing on it every curse written in this book. "},{"num":28,"verse":"The Lord uprooted them from their land in anger, fury, and great wrath, and cast them into another land, as is now the case.’ "},{"num":29,"verse":"The secret things belong to the Lord our God, but the revealed things belong to us and to our children for ever, to observe all the words of this law."}]