[{"header":"Chapter 14"},{"num":1,"verse":"To Live and Die for Christ. Welcome anyone who is weak in faith, but not for disputes over opinions. "},{"num":2,"verse":"One person believes that one may eat anything, while the weak person eats only vegetables. "},{"num":3,"verse":"The one who eats must not despise the one who abstains, and the one who abstains must not pass judgment on the one who eats; for God has welcomed him. "},{"num":4,"verse":"Who are you to pass judgment on someone else’s servant? Before his own master he stands or falls. And he will be upheld, for the Lord is able to make him stand. "},{"num":5,"verse":"[For] one person considers one day more important than another, while another person considers all days alike. Let everyone be fully persuaded in his own mind. "},{"num":6,"verse":"Whoever observes the day, observes it for the Lord. Also whoever eats, eats for the Lord, since he gives thanks to God; while whoever abstains, abstains for the Lord and gives thanks to God. "},{"num":7,"verse":"None of us lives for oneself, and no one dies for oneself. "},{"num":8,"verse":"For if we live, we live for the Lord, and if we die, we die for the Lord; so then, whether we live or die, we are the Lord’s. "},{"num":9,"verse":"For this is why Christ died and came to life, that he might be Lord of both the dead and the living. "},{"num":10,"verse":"Why then do you judge your brother? Or you, why do you look down on your brother? For we shall all stand before the judgment seat of God; "},{"num":11,"verse":"for it is written:"},{"num":12,"verse":"So [then] each of us shall give an account of himself [to God]."},{"num":13,"verse":"Consideration for the Weak Conscience. Then let us no longer judge one another, but rather resolve never to put a stumbling block or hindrance in the way of a brother. "},{"num":14,"verse":"I know and am convinced in the Lord Jesus that nothing is unclean in itself; still, it is unclean for someone who thinks it unclean. "},{"num":15,"verse":"If your brother is being hurt by what you eat, your conduct is no longer in accord with love. Do not because of your food destroy him for whom Christ died. "},{"num":16,"verse":"So do not let your good be reviled. "},{"num":17,"verse":"For the kingdom of God is not a matter of food and drink, but of righteousness, peace, and joy in the holy Spirit; "},{"num":18,"verse":"whoever serves Christ in this way is pleasing to God and approved by others. "},{"num":19,"verse":"Let us then pursue what leads to peace and to building up one another. "},{"num":20,"verse":"For the sake of food, do not destroy the work of God. Everything is indeed clean, but it is wrong for anyone to become a stumbling block by eating; "},{"num":21,"verse":"it is good not to eat meat or drink wine or do anything that causes your brother to stumble. "},{"num":22,"verse":"Keep the faith [that] you have to yourself in the presence of God; blessed is the one who does not condemn himself for what he approves. "},{"num":23,"verse":"But whoever has doubts is condemned if he eats, because this is not from faith; for whatever is not from faith is sin."}]