[{"num":14,"verse":"But welcome the one who is weak in emunah (faith). But not for the purpose of setting him straight in arguments."},{"num":2,"verse":"For example, one person has emunah (faith) to eat every potential food; but the weak practice vegetarianism."},{"num":3,"verse":"Let the one who eats not hold in contempt or despise the one who does not eat, and let not the one who does not eat pass judgment on the one who eats, for Hashem treats him as an oreach ratzuy (welcome guest)."},{"num":4,"verse":"Who are you to condemn the eved (house slave) of someone else? In relation to Ribbono (shel Olam) he stands or falls. And he shall stand, for Ribbono (shel Olam) is able to make him stand."},{"num":5,"verse":"One person judges one day to be more important than another; another person judges every day to be alike. Let each be fully convinced in his own mind."},{"num":6,"verse":"The one who holds an opinion on the day does so to Hashem. And the one who eats does so to Hashem, for he does the bentshen (custom of saying grace after meals) of the Birkat Hamazon to Hashem. And the one who does not eat does so to Hashem and gives the hodayah (thanksgiving) to Hashem."},{"num":7,"verse":"For no one of us lives for himself and no one dies for himself."},{"num":8,"verse":"For if we live, we live for Hashem; and if we die, we die for Hashem. So whether we live or we die, we belong to Hashem."},{"num":9,"verse":"For it was for this tachlis (purpose) that Moshiach had his histalkus and came to live again, in order that he might have charge as Moshiach Adoneinu over both the Mesim (dead ones) and the Chayyim (living ones)."},{"num":10,"verse":"So you, why do you judge your Ach b’Moshiach? Or you, why do you despise your Ach b’Moshiach? For we shall all stand in the Bet Din (Court of Law) of Hashem (see 2C 5:10) before his Kisse Din (judgment seat), his Kisse Mishpat,"},{"num":11,"verse":"For it is written, \"As I live, says Hashem, before Me KOL BERECH (every knee) will bow and KOL LASHON (every tongue) shall give praise to Hashem\" [Isa 49:18]."},{"num":12,"verse":"So then each of us will give account of himself to Hashem."},{"num":13,"verse":"Let us therefore no longer pass judgment on one another, but decide this rather: not to put an occasion for michshol (stumbling, offense, downfall 9:32-33) in the way of the Ach b’Moshiach."},{"num":14,"verse":"I have da’as and am convinced in Adoneinu Yehoshua that nothing is tamei beetzem (intrinsically), except that to the one who reckons something profane, to that person it is profane."},{"num":15,"verse":"For if your Ach B’Moshiach is deeply upset on account of [your] okhel (food), you are no longer conducting yourself in a halakhah of ahavah. Do not by your okhel destroy that one for whom Moshiach died."},{"num":16,"verse":"Therefore, do not let HaTov of you be brought into contempt."},{"num":17,"verse":"For the Malchut Hashem is not a matter of eating and drinking, but of tzedek (righteousness, DANIEL 9:24), shalom (peace) and simcha b’Ruach Hakodesh."},{"num":18,"verse":"For he who serves Moshiach in this is pleasing to Hashem and approved by people in general."},{"num":19,"verse":"So then we pursue what makes for shalom and for the building up of one another."},{"num":20,"verse":"Do not for the sake of okhel bring churban to the work of Hashem."},{"num":21,"verse":"It is a fine thing not to eat meat nor drink wine nor anything by which your Ach b’Moshiach stumbles."},{"num":22,"verse":"The emunah that you have, keep beshita (as a matter of conviction or principle) to yourself before G-d. Ashrey is the man who does not condemn himself by the things he approves."},{"num":23,"verse":"But in the man who doubts, there is found in him a dvar ashmah (a thing of guilt, condemnation) if he eats, because it is not of emunah. And whatever is not of emunah is averah (sin)."}]