[{"num":14,"verse":"It’s high time that you welcome all people weak in the faith without debating and disputing their opinions."},{"num":2,"verse":"Here’s the issue: One person believes that nothing’s off the menu; he’ll eat any food put before him. But there’s another believer—we’ll call him the weaker—who eats only vegetables because the meat is tainted through contact with an idol. "},{"num":3,"verse":"If you are an eater of all things, do not be condescending to your vegetarian brother or sister. In turn, those who abstain from certain foods on religious principles should not judge your brothers and sisters who eat meat—if God has accepted them, you have no reason to reject them. "},{"num":4,"verse":"How could you think for a moment that you have the right to judge another person’s servant? Each servant answers to his own Master, and he will either stand or fall in His presence. The good news is that he will stand because the Master is able to make it so."},{"num":5,"verse":"There may be a believer who regards one day as more sacred than any other, while another views every day as sacred as the next. In these matters, all must reach their own conclusions and satisfy their own minds. "},{"num":6,"verse":"If someone observes a day as holy, he observes it in honor of the Lord. If another eats a particular diet, he eats in honor of the Lord since he begins by giving thanks! If yet another abstains from that same food, he abstains out of respect for the Lord and begins his meal by thanking God too. "},{"num":7,"verse":"The truth is that none of us live for ourselves, and none die for ourselves. "},{"num":8,"verse":"For if we live, we live for the Lord. If we die, we die for the Lord. So in both life and death, we belong to the Lord. "},{"num":9,"verse":"The Anointed One, the Liberating King, died and returned to life to make this a reality: through His death and resurrection, He became Lord of the living and the dead."},{"num":10,"verse":"So how is it that you continue to judge your brother? How is it possible for you to look down on a sister? We will all stand before the judgment seat of God. "},{"num":11,"verse":"For it is written,"},{"num":12,"verse":"So every one of us, regardless of our eating habits, should expect to give an account for our own lives to God."},{"num":13,"verse":"In light of this, we must resolve never to judge others and never to place an obstacle or impediment in their paths that could cause them to trip and fall. "},{"num":14,"verse":"Personally I have been completely convinced that in Jesus, our Lord, no object in and of itself is unclean; but if my fellow believers are convinced that something is unclean, then it is unclean to them. "},{"num":15,"verse":"If the food you eat harms your brother, then you have failed to love him. Do not let what you eat tear down your brother; after all, the Anointed laid down His life for him. "},{"num":16,"verse":"Do not allow people to slander something you find to be good "},{"num":17,"verse":"because the kingdom of God is not about eating and drinking. When God reigns, the order of the day is redeeming justice, true peace, and joy made possible by the Holy Spirit. "},{"num":18,"verse":"You see, those who serve the Anointed in this way will be welcomed into the whole acceptance of God and valued by all men. "},{"num":19,"verse":"Join us, and pursue a life that creates peace and builds up our brothers and sisters."},{"num":20,"verse":"Do not sacrifice God’s work for the sake of certain foods. It is true that all things are clean, but it’s wrong to eat if you know that eating something will cause offense. "},{"num":21,"verse":"It is right for you to abstain from certain meats and wine (or anything else for that matter) if it prevents your brother from falling in his faith. "},{"num":22,"verse":"Hold on to what you believe about these issues, but keep them between you and God. A happy man does not judge himself by the lifestyle he endorses. "},{"num":23,"verse":"But a man who decides for himself what to eat is condemned because he is not living by his faith. Any action not consistent with faith is sin."}]