[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will make a new covenant . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Both in itself, and as the germ of the future of the spiritual history of mankind, the words are of immense significance. It was to this that the Lord Jesus directed the thoughts of His disciples, as the prophecy which, above all other prophecies, He had come to fulfil by the sacrifice of Himself. In that “New Covenant” in His blood, which He solemnly proclaimed at the Last Supper (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and which was commemorated whenever men met to partake of the Supper of the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there was latent the whole argument of the writer of the Epistle to the Hebrews (Hebrews 8-10), the whole Gospel of justification by faith as proclaimed by St. Paul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:15-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From it the Church took the title of the New Covenant, the New Testament, which it gave to the collected writings of the Apostolic age. This title in its turn gave the name of the Old Testament to the collected writings which recorded how “in sundry times and divers manners” God had spoken in time past to Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The promise is too commonly dealt with as standing by itself, without reference to the sequence of thought in which we find it placed. That sequence, however, is not hard to trace. The common proverb about the sour grapes had set the prophet thinking on the laws of God’s dealings with men. He felt that something more was needed to restrain men from evil than the thought that they might be transmitting evil to their children’s children—something more even than the thought of direct personal responsibility, and of a perfectly righteous retribution. And that something was to be found in the idea of a law—not written on tablets of stone, not threatening and condemning from without, and denouncing punishment on the transgressors and their descendants, but written on heart and spirit (2Corinthians 3:3-6). It is noticeable, as showing how like thoughts were working in the minds of the two prophets, that in Ezekiel also the promise of a “new heart and new spirit” comes in close sequence upon the protest against the adage about the “children’s teeth being set on edge” (Ezekiel 18:31). In the words for “saith the Lord” we have the more solemn word which carries with it the announcement as of an oracle from God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The promise is too commonly dealt with as standing by itself, without reference to the sequence of thought in which we find it placed. That sequence, however, is not hard to trace. The common proverb about the sour grapes had set the prophet thinking on the laws of God’s dealings with men. He felt that something more was needed to restrain men from evil than the thought that they might be transmitting evil to their children’s children—something more even than the thought of direct personal responsibility, and of a perfectly righteous retribution. And that something was to be found in the idea of a law—not written on tablets of stone, not threatening and condemning from without, and denouncing punishment on the transgressors and their descendants, but written on heart and spirit (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 3:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is noticeable, as showing how like thoughts were working in the minds of the two prophets, that in Ezekiel also the promise of a “new heart and new spirit” comes in close sequence upon the protest against the adage about the “children’s teeth being set on edge” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the words for “saith the Lord” we have the more solemn word which carries with it the announcement as of an oracle from God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 31:31-32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:31-32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, the days come, saith the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The latter days, or the times of the gospel, are here intended, as is evident from the apostle’s applying the following promises to those times, and quoting this whole passage as a summary of the covenant of grace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:8-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make a new covenant with the house of Israel and the house of Judah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The benefits of this covenant were first offered to the Jews, as being the completion of that covenant which God had made with their fathers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but those benefits were actually conferred only on the spiritual seed of Abraham, or the imitators of Abraham’s faith, the true ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "on whom ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "peace is ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with whom only this new covenant is made. In other words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "stand here for the true people or church of God, especially the gospel church: and the covenant here promised to be made with them is said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "new, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "not because it was so as to the substance of it, for it was made with Abraham, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with the Israelites, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but, upon many other accounts, especially the following: — 1st, It was new, considered as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a testament, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "confirmed by the actual death of the testator, which did not take place till gospel times. 2d, It was revealed after a new manner, more fully and particularly, plainly and clearly. 3d, It contained no such mixture of temporal promises as when first made with the Jews. 4th, The ceremonial law was no part of it, as it was to the Jews, who were obliged to approve themselves God’s people, by a strict observance thereof. 5th, The publication of it was extended to the Gentiles as well as the Jews, which was not the case with the Mosaic covenant. 6th, The influences of the Divine Spirit, attending the publication of it, are conferred more largely under this than under the old covenant, distributing to believers a greater measure and variety of gifts and graces, to enable them to comply with the terms, and fulfil the demands of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Not according to the covenant made with their fathers ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Differing from it in the circumstances above mentioned, and in others declared afterward: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the day when I took them by the hand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The covenant which God made with the Jews, when they came out of the land of Egypt, was on his part the law which he gave them from Sinai, with the promises annexed; on their part, (which made it a formal covenant,) their promise of obedience to it. This covenant God says he made with them when they were a weak and ignorant people, the care of whom he took upon himself, and led them as a parent leads his feeble child by the hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which my covenant they brake ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This covenant they are said to have broken, not because of every defect, or failure in their obedience, for in that sense, through the general depravity and weakness of human nature, they could not but break it; (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";) but because of their gross and wilful sins often repeated and continued in without repentance, and more especially by their idolatry, compared to whoredom, which broke the marriage covenant between God and them, and caused him to divorce them, and to say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo Ammi, You are not my people: Although I was a husband to them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This their covenant-breaking was aggravated by God’s kindness to them and care of them, who, as he stood, related to them in the character of a husband, so he had always manifested to them such love as is but faintly shadowed forth by that of the most affectionate husband to his wife, and had given them no temptation to go a whoring from him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31:27-34 The people of God shall become numerous and prosperous. In Heb 8:8,9, this place is quoted as the sum of the covenant of grace made with believers in Jesus Christ. Not, I will give them a new law; for Christ came not to destroy the law, but to fulfil it; but the law shall be written in their hearts by the finger of the Spirit, as formerly written in the tables of stone. The Lord will, by his grace, make his people willing people in the day of his power. All shall know the Lord; all shall be welcome to the knowledge of God, and shall have the means of that knowledge. There shall be an outpouring of the Holy Spirit, at the time the gospel is published. No man shall finally perish, but for his own sins; none, who is willing to accept of Christ's salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A time is foretold which shall be to the nation as marked an epoch as was the Exodus. God at Sinai made a covenant with His people, of which the sanctions were material, or (where spiritual) materially understood. Necessarily therefore the Mosaic Church was temporary, but the sanctions of Jeremiah's Church are spiritual - written in the heart - and therefore it must take the place of the former covenant ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and must last forever. The prophecy was fulfilled when those Jews who accepted Jesus of Nazareth as the Messiah, expanded the Jewish into the Christian Church.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. the days … new covenant with … Israel … Judah—The new covenant is made with literal Israel and Judah, not with the spiritual Israel, that is, believers, except secondarily, and as grafted on the stock of Israel (Ro 11:16-27). For the whole subject of the thirtieth and thirty-first chapters is the restoration of the Hebrews (Jer 30:4, 7, 10, 18; 31:7, 10, 11, 23, 24, 27, 36). With the \"remnant according to the election of grace\" in Israel, the new covenant has already taken effect. But with regard to the whole nation, its realization is reserved for the last days, to which Paul refers this prophecy in an abridged form (Ro 11:27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The apostle’s application of this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 8:8-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:8-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", puts us out of doubt that this promise referred to the gospel times. It was not only made with the Jews, but all those who should be ingrafted into that olive; but it is said to be made with them, either as those two terms signify the whole church, with whom that covenant was made (they being the whole church which God had upon the earth at that time); or because they were the only people that had broken the first covenant, the Gentiles being strangers at that time to the covenant of promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", covenants being usually renewed upon one party’s violation of them; or because it was at first made with the Jews, though it concerned also ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those that were afar off, even as many as the Lord should call",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 2:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Neither is it called the new covenant because it was as to the substance new, for it was made with Abraham, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 17:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 26:17,18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 26:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it was then confirmed by the blood of Christ, though not actually shed, yet as he was ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the Lamb slain from the beginning of the world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whose blood was typified by the blood of the paschal lamb, and of all those living creatures killed for sacrifice, but upon many other accounts, thus enumerated by divines. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Because it was new in the notion of a testament, not confirmed by the actual death of Christ till gospel times. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Because it was revealed and preached after a new manner, more fully and particularly, plainly and clearly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. Because it had no such mixture of promises of temporal blessings as it had when first made with the laws. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. Nor was the ceremonial law any part of it, as it was to the Jews, who were obliged to approve themselves God’s people by a strict observance of that. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "5. It was in the publication extended both to Jews and Gentiles, which the former was not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "6. In regard of the efficacy of the Spirit attending the publication of it, in a much fuller and larger manner, with the distribution of its gifts and graces, enabling souls to fulfil it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "See more in the English Annotations upon this subject. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, the days come, saith the Lord,.... This refers to Gospel times, as is clear from the quotation and application by the apostle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and it is owned by a modern Jew (l) to belong to the times of the Messiah. It is introduced with a \"behold\", as a note of attention, pointing to something of moment, and very agreeable and desirable, as the covenant of grace, its blessings and promises, are; and as a note of admiration, it being justly to be wondered at that God should make a covenant with such sinful and unworthy creatures as he has; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I will make a new covenant with the house of Israel, and with the house Judah; by this \"covenant\" is meant the covenant of called new, not because newly made, for it was with the elect in Christ from everlasting; so early was Christ set up as the Mediator of it; and so early were promises made, and blessings given, to them in him: nor because newly revealed; for it was made known to all the saints, more or less, under the former dispensation, particularly to David, to Abraham, yea, to our first parents immediately after the fall, though more clearly manifested under the Gospel dispensation; but because of its new mode of exhibition; not by types, and shadows, and sacrifices, as formerly; but by the ministry of the word, and the administration of Gospel ordinances; and in distinction from the former covenant, which is done away, as to the mode of it; and because it is a famous covenant, an excellent one, a better covenant, best of all; better than the covenant of works, and even better than the covenant of grace, under the former administration; in the clear manifestation and extensive application of it; and in the ratification of it by the blood of Christ; besides, it provides and promises new things, as a new heart, and a new spirit; to which may be added, that it may be called new, because it is always new; it continues, it stands firm, as Kimchi observes, and shall not be made void; it will never be succeeded nor antiquated by any other covenant, or any other mode of administration of it. The persons with whom this covenant is said to be made are \"the house of Israel and of Judah\"; which was literally true of them in the first times of the Gospel, to whom the Gospel was first preached, and many of them were called by grace, and had an application of covenant blessings made to them; and is mystically to be understood of God's elect, whether Jews or Gentiles; the Israel after the spirit; Israelites indeed, Jews inwardly, even all that are fellow citizens of the saints, and of the household of God, the middle wall of partition being broken down: and this \"making\" of a covenant with them intends no other than a making it known unto them; showing it to them, and their interest in it; in God, as their covenant God; and in Christ, as the Mediator of it; and an application of the blessings and promises of it to them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Abendana, not. in Miclol Yophi in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) Abendana, not. in Miclol Yophi in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Behold, the days come, saith the LORD, that I will make a {h} new covenant with the house of Israel, and with the house of Judah:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Behold, the days come, saith the LORD, that I will make a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " new covenant with the house of Israel, and with the house of Judah:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Though the covenant of redemption made to the fathers and this which was given later seemed varied, yet they are all one and grounded on Jesus Christ, save that this is called new, because of the manifestation of Christ and the abundant graces of the Holy Spirit given to his Church under the gospel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a new covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] which in contrast to that ratified at Sinai, and forfeited by the people’s repeated disobedience, shall have the essential element of stability and permanence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and with the house of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the light of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 31:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where no such clause occurs, this is probably a gloss by a scribe who desired that his own tribe should not be omitted from mention. The omission moreover restores the Ḳinah measure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "31–34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See introd. summary to the section. These ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vv",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". are quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:9-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:23-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We have here the announcement of a new covenant which should supersede that made at the time of the Exodus from Egypt, differing from it (i) in permanence, (ii) in the principle by which it should be maintained unbroken. The Law consisted of duties imposed upon the people from without; the spring of action which should produce willing conformity to the new covenant was to be wholly within. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " speaks of the people’s hearts being circumcised to love the Lord with all their heart and soul, but here the motive power that belongs to the new dispensation is for the first time made plain. The sense of forgiveness (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 31:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") through God’s grace shall call out such a spirit of gratitude as shall ensure a willing service, depending on inward not outward motives, based on love, not fear. The new covenant therefore is at once to replace the old (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:8-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but, though new in springs of action, it is to be still the same in substance. Thus the passage forms the climax of Jeremiah’s teaching. The religious failure hitherto consisted in gross and repeated acts of disobedience to the outward ordinances imposed on Israel as a national unit. It was necessary in future to get behind ordinances to the source itself of the evil so as to reach the individual heart. If that heart was attuned to the recognition of its relationship to God, all would thenceforth be right. When the inward hostility to the externally imposed law has been changed to a ready conformity, because that law is recognised as no longer an outside matter, but has become part of the individual’s own personality, then the Divine and human wills become identified. Religion will now have acquired a title, no longer superficial, to the name national; for each individual will be renewed in heart. Thus “while other prophets did much to interpret religion and to enforce its demands, [Jeremiah] transformed the very conception of religion itself” (Peake, I. 46).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The genuineness of the passage has been doubted or denied by various commentators from Movers onwards, and it is rejected, though very reluctantly, by Du., but on grounds which are shewn by Co. to be quite inconclusive. Du. considers it to be the production of an author of late date, zealous for the faithful observance of legal ordinances, and he denies the spiritual character of the conceptions which the words seem plainly to indicate. But the contrast is a marked one between the external nature of the Sinaitic legislation, and the internal change in the individual’s personality, involved in the New Covenant which is to take its place. What was that Sinaitic legislation in Jeremiah’s view? Ch. 7 tells us that it was, in a word, the Decalogue (see specially ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 31:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), written with the finger of God. These precepts are now to be written in men’s hearts, and so to ensure an intuitive obedience, “the living pulse-beat of an automatic morality” (Co.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The very brevity of the utterance (even if we admit the possibility of a slight amount of modification by Baruch or others) supports the acceptance of it as genuine. Its date will naturally be the period of the overthrow of the old ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "régime",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the destruction of Jerusalem (b.c. 586). Under circumstances such as these the prophet gives utterance to what is surely a sublime triumph of faith, as he raises on the ruins of the old a new and more spiritual structure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 31-34.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The new covenant. A prophecy which stands out from the rest of Jeremiah by its evangelical character, in which it strongly reminds us of parts of the second half of Isaiah. The doctrine of the covenant is \"the thread which binds together the hopes and the fears of the prophet, his certainty of coming woe, his certainty of ultimate blessing.\" A covenant was granted of old, but that covenant had on man's side been broken. Still \"the gifts and calling of God are not to be retracted\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and Jeremiah felt that the very nature of God guaranteed the renewal of the covenant on a new basis. \"Covenant\" is, no doubt, an unfortunate rendering. The Hebrew word so rendered means, primarily, a decision or appointment, and there is a whole group of passages in the Old Testament which requires this meaning (see the present writer's note, in 'The Prophecies of Isaiah,' on Isaiah 42:6). We retain it, however, as that with which the reader is familiar, and only remind him that God is everything, and man nothing, in fixing the terms of the transaction. The characteristics of the new covenant are three: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The relation between God and his people is protected from all risk by God himself making the people what he would have them be. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Whereas, in the case of the old, the law of duty was written on ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tables of stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the case of the new the law is to be written on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereas, under the old, owing to the ritual character of the worship, the knowledge of God and his will was a complicated affair, in which men generally were helplessly dependent on a professional class, under the new, the worship of God would be reduced to the simplest spiritual elements, and it would be in every man's power to know God at first hand, the sole requisite for such knowledge as would then be required being a pure heart.\" And ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"whereas, under the old, the provisions for the cancelling of sin were very unsatisfactory, and utterly unfit to perfect the worshipper as to conscience, by dealing thoroughly with the problem of guilt, under the new God would grant to his people a real, absolute, and perennial forgiveness, so that the abiding relation between him and them should be as if sin had never existed\" (Dr. A.B. Bruce, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The Expositor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", January, 1880, pp. 70, 71). Comp. the abolition of the ark indicated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - The inspired author of Hebrews tells us (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:6-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), speaking generally, that this promise delivered through Jeremiah was fulfilled in the gospel. But it must be remembered that the gospel has not yet taken form outwardly, except in a comparatively meagre sense. If the Jews as a nation (that is, the better part or kernel of Israel) should embrace the gospel, not necessarily in the logical expression familiar to the West, but in its essential facts and truths, we should see quite another embodiment of the promise, and feel the spiritual impulse in ourselves as we have not yet done. It seems appropriate, in conclusion, to quote a finely expressed passage from De Quincey's exposition of the New Testament term ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μετάνοια",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Without pledging ourselves to the absolute correctness of his explanation of that word, his language may be well applied to Jeremiah's prophecy. \"What would have been thought of any prophet, if he should have promised to transfigurate the celestial mechanics; if he had said, 'I will create a new pole star, a new zodiac, and new laws of gravitation;' briefly, 'I will make new earth and new heavens'? And yet a thousand times more awful it was to undertake the writing Of new laws upon the spiritual conscience of man.\" Jeremiah 31:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The new covenant. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Behold, days are coming, saith Jahveh, when I will make with the house of Israel and with the house of Judah a new covenant; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not like the covenant that I made with their fathers on the day when I laid hold of their hand to bring them out of the land of Egypt, which covenant of mine they broke, though I had married them to myself, saith Jahveh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But this is the covenant which I will make with the house of Israel after those days, saith Jahveh: I will put my law within them, and on their heart will I write it; and I will become to them a God, and they shall be to me a people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And they shall no more teach every man his neighbour and every man his brother, saying, Know ye Jahveh, for all of them shall know me, from the least of them to the greatest of them, saith Jahveh; for I will pardon their iniquity, and their sins will I remember no more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith Jahveh, [who] gives the sun for light by day, and the ordinances of the moon and stars for light by night, who rouses the sea so that its waves roar, Jahveh of hosts is His name: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If these ordinances move away from before me, saith Jahveh, then also will the seed of Israel cease to be a people before me for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith Jahveh: If the heavens above can be measured, and the foundations of the earth below can be searched out, then will I also reject all the seed of Israel because of all that they have done, saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Behold, days come, saith Jahveh, when the city shall be built for Jahveh, from the tower of Hananeel unto the gate of the corner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the measuring-line shall once more go out straight over the hill of Gareb, and turn round towards Goah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And all the valley of the corpses and of the ashes, and all the fields unto the valley of Kidron, unto the corner of the gate of the horses towards the east, [shall be] holiness to Jahveh; it shall not be plucked up nor pulled down again for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The re-establishment of Israel reaches its completion in the making of a new covenant, according to which the law of God is written in the hearts of the people; thereby Israel becomes in truth the people of the Lord, and the knowledge of God founded on the experience of the forgiveness of sins is such that there is no further need of any external means like mutual teaching about God (Jeremiah 31:31-34). This covenant is to endure for ever, like the unchangeable ordinances of nature (Jeremiah 31:35-37); and in consequence of this, Jerusalem shall be guilt as the holy city of God, which shall never be destroyed again (Jeremiah 31:38-40).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The re-establishment of Israel reaches its completion in the making of a new covenant, according to which the law of God is written in the hearts of the people; thereby Israel becomes in truth the people of the Lord, and the knowledge of God founded on the experience of the forgiveness of sins is such that there is no further need of any external means like mutual teaching about God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:31-34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This covenant is to endure for ever, like the unchangeable ordinances of nature (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:35-37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and in consequence of this, Jerusalem shall be guilt as the holy city of God, which shall never be destroyed again (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:38-40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jeremiah 31:31-32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:31-32",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "כּרת בּרית does not mean \"to make an appointment,\" but \"to conclude a covenant,\" to establish a relation of mutual duties and obligations. Every covenant which God concludes with men consists, on the side of God, in assurance of His favours and actual bestowal of them; these bind men to the keeping of the commands laid on them. The covenant which the Lord will make with all Israel in the future is called \"a new covenant,\" as compared with that made with the fathers at Sinai, when the people were led out of Egypt; this latter is thus implicitly called the \"old covenant.\" The words, \"on the day when I took them by the hand,\" etc., must not be restricted, on the one side, to the day of the exodus from Egypt, nor, on the other, to the day when the covenant was solemnly made at Sinai; they rather refer to the whole time of the exodus, which did not reach its termination till the entrance into Canaan, though it culminated in the solemn admission of Israel, at Sinai, as the people of Jahveh; see on Jeremiah 7:22. (On the punctuation of החזיקי, cf. Ewald, 238, d, Olshaus. Gramm. 191,f.) אשׁר is not a conjunction, \"quod, because,\" but a relative pronoun, and must be combined with את־בּריתי, \"which my covenant,\" i.e., which covenant of mine. \"They\" stands emphatically in contrast with \"though I\" in the following circumstantial clause, which literally means, \"but I have married them to myself,\" or, \"I was their husband.\" As to בּעלתּי, see on Jeremiah 3:14. Hengstenberg wrongly takes the words as a promise, \"but I will marry them to myself;\" this view, however, is incompatible with the perfect, and the position of the words as a contrast with \"they broke.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "כּרת בּרית does not mean \"to make an appointment,\" but \"to conclude a covenant,\" to establish a relation of mutual duties and obligations. Every covenant which God concludes with men consists, on the side of God, in assurance of His favours and actual bestowal of them; these bind men to the keeping of the commands laid on them. The covenant which the Lord will make with all Israel in the future is called \"a new covenant,\" as compared with that made with the fathers at Sinai, when the people were led out of Egypt; this latter is thus implicitly called the \"old covenant.\" The words, \"on the day when I took them by the hand,\" etc., must not be restricted, on the one side, to the day of the exodus from Egypt, nor, on the other, to the day when the covenant was solemnly made at Sinai; they rather refer to the whole time of the exodus, which did not reach its termination till the entrance into Canaan, though it culminated in the solemn admission of Israel, at Sinai, as the people of Jahveh; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (On the punctuation of החזיקי, cf. Ewald, 238, d, Olshaus. Gramm. 191,f.) אשׁר is not a conjunction, \"quod, because,\" but a relative pronoun, and must be combined with את־בּריתי, \"which my covenant,\" i.e., which covenant of mine. \"They\" stands emphatically in contrast with \"though I\" in the following circumstantial clause, which literally means, \"but I have married them to myself,\" or, \"I was their husband.\" As to בּעלתּי, see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hengstenberg wrongly takes the words as a promise, \"but I will marry them to myself;\" this view, however, is incompatible with the perfect, and the position of the words as a contrast with \"they broke.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In the citation of this passage in Hebrews 8:8., the words are quoted according to the lxx version, κᾀγὼ ἠμέλησα αὐτῶν, although this translation is incorrect, because the apostle does not use these words in proving any point. These same words, moreover, have been rendered by the lxx, in Jeremiah 3:14, ἐγὼ κατακυριεύσω ὑμῶν.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: In the citation of this passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., the words are quoted according to the lxx version, κᾀγὼ ἠμέλησα αὐτῶν, although this translation is incorrect, because the apostle does not use these words in proving any point. These same words, moreover, have been rendered by the lxx, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ἐγὼ κατακυριεύσω ὑμῶν.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The two closely connected expressions indicate why a new covenant was necessary; there is no formal statement, however, of the reason, which is merely given in a subordinate and appended clause. For the proper reason why a new covenant is made is not that the people have broken the old one, but that, though Jahveh had united Israel to Himself, they have broken the covenant and thereby rendered it necessary to make a new one. God the Lord, in virtue of His unchangeable faithfulness, would not alter the relation He had Himself established in His love, but simply found it anew in a way which obviated the breaking of the covenant by Israel. For it was a defect connected with the covenant made with Israel at Sinai, that it could be broken on their part. This defect is not to exist in the new covenant which God will make in after times. The expression \"after those (not these) days\" is remarkable; ההם is not the same as האלּה, and yet the days meant can only be the \"coming days;\" accordingly, it is \"those days\" (as in Jeremiah 31:29) that are to be expected. The expression \"after these days\" is inexact, and probably owes its origin to the idea contained in the phrase \"in the end of the days\" (בּאחרית, cf. Jeremiah 23:20).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The two closely connected expressions indicate why a new covenant was necessary; there is no formal statement, however, of the reason, which is merely given in a subordinate and appended clause. For the proper reason why a new covenant is made is not that the people have broken the old one, but that, though Jahveh had united Israel to Himself, they have broken the covenant and thereby rendered it necessary to make a new one. God the Lord, in virtue of His unchangeable faithfulness, would not alter the relation He had Himself established in His love, but simply found it anew in a way which obviated the breaking of the covenant by Israel. For it was a defect connected with the covenant made with Israel at Sinai, that it could be broken on their part. This defect is not to exist in the new covenant which God will make in after times. The expression \"after those (not these) days\" is remarkable; ההם is not the same as האלּה, and yet the days meant can only be the \"coming days;\" accordingly, it is \"those days\" (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that are to be expected. The expression \"after these days\" is inexact, and probably owes its origin to the idea contained in the phrase \"in the end of the days\" (בּאחרית, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      }
    ]
  }
]