[[],[{"type":"header","content":"The Broken Jar"},{"type":"prose","content":"Thus says the , “Go and buy a potter’s earthenware jar, and take some of the elders of the people and some of the senior priests "}],[{"type":"prose","content":"and go out to the Valley of Ben-hinnom (son of Hinnom), which is near the entrance of the Potsherd Gate; and proclaim there the words that I tell you, "}],[{"type":"prose","content":"and say, ‘Hear the word of the , O kings of Judah and inhabitants of Jerusalem. Thus says the Lord of hosts, the God of Israel, “Behold (listen carefully), I am going to bring such disaster on this place that the ears of everyone who hears about it will tingle [in shock]. "}],[{"type":"prose","content":"Because the people [of Jerusalem] have abandoned (rejected) Me and have made this an alien  profaned place by burning sacrifices  incense in it to other gods, that neither they nor their fathers nor the kings of Judah ever knew, and because they have filled this place with the blood of the innocent "}],[{"type":"prose","content":"and have built the high places of Baal to burn their sons in the fire as burnt offerings to Baal, which I never commanded or spoke of, nor did it ever enter My mind (heart); "}],[{"type":"prose","content":"therefore, listen very closely, the days are coming,” says the , “when this place shall no longer be called Topheth or the Valley of Ben-hinnom, but the Valley of Slaughter. "}],[{"type":"prose","content":"I will pour out  nullify the counsel (plans) of [the men of] Judah and Jerusalem in this place, and I will make their people fall by the sword before their enemies and by the hand of those who seek their lives; and I will give their dead bodies as food for the birds of the air and for the beasts of the earth. "}],[{"type":"prose","content":"I will make this city a desolation and an  hissing; everyone who passes by it will be amazed and will hiss [in scorn] because of all its plagues  disasters. "}],[{"type":"prose","content":"And I will make them eat the flesh of their sons and their daughters, and each one will eat one another’s flesh during the siege and distress brought by their enemies and those who seek their lives.”’"}],[{"type":"prose","content":"“Then you are to break the jar in the sight of the men who accompany you, "}],[{"type":"prose","content":"and say to them, ‘Thus says the  of hosts, “This is the way I will break this people and this city as one breaks a potter’s vessel, so that it cannot be mended. They will bury [corpses] in Topheth until there is no more room left [in that place] to bury [the dead]. "}],[{"type":"prose","content":"This I will do to this place,” says the , “and to its inhabitants; and I will even make this city like Topheth. "}],[{"type":"prose","content":"The houses of Jerusalem and the houses of the kings of Judah will be defiled like this place, Topheth, all the houses on whose rooftops incense has been burned to all the host of heaven (sun, moon, stars), and where drink offerings have been poured out to other gods.”’”"}],[{"type":"prose","content":"Then Jeremiah came from Topheth, where the  had sent him to prophesy; and he stood in the court of the  house and said to all the people: "}],[{"type":"prose","content":"“Thus says the  of hosts, the God of Israel, ‘Behold, I am going to bring on this city and on all its towns, all the devastation that I have declared against it, because they have become stiff-necked and refused to hear  obey My words.’”Cross references\n\n\n\n"}]]