[{"num":19,"verse":"Adonai then said, “Go; buy a clay jar from the potter; take some of the people’s leaders and some of the leading cohanim; "},{"num":2,"verse":"and go out into the Ben-Hinnom Valley, by the entry to the Potsherd Gate. There you are to proclaim the words I am about to tell you. "},{"num":3,"verse":"Say: ‘Hear the word of Adonai, kings of Y’hudah and inhabitants of Yerushalayim! This is what Adonai-Tzva’ot, the God of Isra’el, says: “I am about to bring disaster on this place that will make the ears of whoever hears about it ring. "},{"num":4,"verse":"This is because they have abandoned me and alienated this place. In it they have offered to other gods that neither they nor their ancestors have known, nor the kings of Y’hudah. They have filled this place with the blood of innocent people. "},{"num":5,"verse":"They have built the high places of Ba‘al, in order to burn up their children in the fire as burnt offerings to Ba‘al — something I never ordered or said; it never even entered my mind."},{"num":6,"verse":"“‘“Therefore the time is coming,” says Adonai, “when this place will no longer be called either Tofet or the Ben-Hinnom Valley, but the Valley of Slaughter. "},{"num":7,"verse":"I will nullify the plans of Y’hudah and Yerushalayim in this place. I will have them fall by the sword before their enemies and at the hand of those seeking their lives, and I will give their corpses as food for the birds in the air and the wild animals. "},{"num":8,"verse":"I will make this city an object of horror and ridicule; everyone passing by will be horrified and will ridicule it because of all its wounds. "},{"num":9,"verse":"I will cause them to eat the flesh of their own sons and daughters; everyone will be eating the flesh of his friends during the siege, because of the shortage imposed on them by their enemies and those set on killing them.”’"},{"num":10,"verse":"“Then you are to smash the jar in front of the people who went with you, "},{"num":11,"verse":"and say to them, ‘Adonai-Tzva’ot says that this is how I will break this people and this city, just as one smashes a potter’s vessel beyond the possibility of repair. The dead will be buried in Tofet, because there will be no space left for burial [anywhere else]. "},{"num":12,"verse":"That is what I will do to this place,’ says Adonai ‘and to its inhabitants; I will make it like Tofet. "},{"num":13,"verse":"The houses of Yerushalayim and those of the kings of Y’hudah will be defiled like this place Tofet — yes, all the houses on whose roofs they have offered to all the stars in heaven and poured out drink offerings to other gods.’”"},{"num":14,"verse":"Then Yirmeyahu returned from Tofet, where Adonai had sent him to prophesy, stood in the courtyard of Adonai’s house and said to all the people, "},{"num":15,"verse":"“This is what Adonai-Tzva’ot, the God of Isra’el, says: ‘I am bringing on this city and all its surrounding villages all the disaster I have pronounced against it; because they have stiffened their necks and refused to pay attention to my words.’”"}]