[{"header":"The Lesson of the Broken Jug"},{"num":19,"verse":"This is what the Lord says: “Go and buy a potter’s clay jug. Take along some of the elders of the people and some of the elders of the priests. "},{"num":2,"verse":"Go out to the Valley of Hinnom at the entrance to the Potsherd Gate, and there proclaim the words that I’m telling you."},{"num":3,"verse":"“You are to say, ‘Hear this message from the Lord, you kings of Judah and residents of Jerusalem!"},{"num":4,"verse":"For they have forsaken me and have treated this place as foreign. In it they have burned incense to other gods that neither they, their ancestors, nor the kings of Judah knew. They have also filled this place with the blood of innocent people. "},{"num":5,"verse":"They built the high places for Baal to burn their children in the fire as a burnt offering to Baal—something I didn’t command, didn’t say, nor did it ever enter my mind!"},{"num":6,"verse":"“‘“Therefore, days are coming,” declares the Lord, “when this place will no longer be called Topheth, or the Valley of Hinnom, but rather the Valley of Slaughter. "},{"num":7,"verse":"I’ll shatter the counsel of Judah and Jerusalem in this place, and I’ll make them fall by the sword before their enemies and at the hands of those seeking their lives. I’ll give their dead bodies as food to the birds of the sky and to the animals of the land. "},{"num":8,"verse":"I’ll make this city into a desolate place and an object of scorn. All who pass by it will be astonished and will scoff because of all its wounds. "},{"num":9,"verse":"I’ll cause them to eat the flesh of their sons and daughters, and people will eat the flesh of their neighbors in the siege and in the distress to which their enemies and those seeking their lives will subject them.”’”"},{"num":10,"verse":"“Then you are to break the jug in front of the men who have come with you, "},{"num":11,"verse":"and say to them, ‘This is what the Lord of the Heavenly Armies says: “In this same way I’ll break this people and this city, just as someone breaks a potter’s vessel which he then cannot put back together again. They’ll bury corpses in Topheth until there is no more room to bury anyone. "},{"num":12,"verse":"This is what I’ll do to this place and its residents,” declares the Lord, “making this city like Topheth. "},{"num":13,"verse":"The houses of Jerusalem and the houses of the kings of Judah will be polluted like Topheth, as will be all the houses on whose roofs people burned incense to all the host of heaven and poured out liquid offerings to other gods.”’”"},{"num":14,"verse":"Then Jeremiah went from Topheth where the Lord had sent him to prophesy. He stood in the courtyard of the Lord’s Temple, saying to all the people, "},{"num":15,"verse":"“This is what the Lord of the Heavenly Armies, the God of Israel, says: ‘I’m about to bring on this city and all its towns all the disaster that I declared against it because they were determined not to obey my message.’”"}]