[{"header":"Chapter 19"},{"num":1,"verse":"Symbol of the Potter’s Flask. Thus said the Lord: Go, buy a potter’s earthenware flask. Take along some of the elders of the people and some of the priests, "},{"num":2,"verse":"and go out toward the Valley of Ben-hinnom, at the entrance of the Potsherd Gate; there proclaim the words which I will speak to you: "},{"num":3,"verse":"You shall say, Listen to the word of the Lord, kings of Judah and inhabitants of Jerusalem: Thus says the Lord of hosts, the God of Israel: I am going to bring such evil upon this place that the ears of all who hear of it will ring. "},{"num":4,"verse":"All because they have forsaken me and profaned this place by burning incense to other gods which neither they nor their ancestors knew; and because the kings of Judah have filled this place with innocent blood, "},{"num":5,"verse":"building high places for Baal to burn their children in fire as offerings to Baal—something I never considered or said or commanded. "},{"num":6,"verse":"Therefore, days are coming—oracle of the Lord—when this place will no longer be called Topheth, or the Valley of Ben-hinnom, but rather, the Valley of Slaughter. "},{"num":7,"verse":"In this place I will foil the plan of Judah and Jerusalem; I will make them fall by the sword before their enemies, at the hand of those who seek their lives. Their corpses I will give as food to the birds of the sky and the beasts of the earth. "},{"num":8,"verse":"I will make this city a waste and an object of hissing. Because of all its wounds, every passerby will be horrified and hiss. "},{"num":9,"verse":"I will have them eat the flesh of their sons and daughters; they shall eat one another’s flesh during the harsh siege under which their enemies and those who seek their lives will confine them."},{"num":10,"verse":"And you shall break the flask in the sight of the men who went with you, "},{"num":11,"verse":"and say to them: Thus says the Lord of hosts: Thus will I smash this people and this city, as one smashes a clay pot so that it cannot be repaired. And Topheth shall be its burial place, for there will be no other place for burial. "},{"num":12,"verse":"Thus I will do to this place and to its inhabitants—oracle of the Lord; I will make this city like Topheth. "},{"num":13,"verse":"And the houses of Jerusalem and the houses of the kings of Judah shall be defiled like the place of Topheth, all the houses upon whose roofs they burnt incense to the whole host of heaven and poured out libations to other gods."},{"num":14,"verse":"When Jeremiah returned from Topheth, where the Lord had sent him to prophesy, he stood in the court of the house of the Lord and said to all the people: "},{"num":15,"verse":"Thus says the Lord of hosts, the God of Israel: I will bring upon this city all the evil I have spoken against it, because they have become stubborn and have not obeyed my words."}]