[{"num":31,"verse":"The words of king Lamuel. The vision wherewith his mother instructed him."},{"num":2,"verse":"What, O my beloved, what, O the beloved of my womb, what, O the beloved of my vows?"},{"num":3,"verse":"Give not thy substance to women, and thy riches to destroy kings."},{"num":4,"verse":"Give not to kings, O Lamuel, give not wine to kings: because there is no secret where drunkenness reigneth:"},{"num":5,"verse":"And lest they drink and forget judgments, and pervert the cause of the children of the poor."},{"num":6,"verse":"Give strong drink to them that are sad: and wine to them that are grieved in mind:"},{"num":7,"verse":"Let them drink, and forget their want, and remember their sorrow no more."},{"num":8,"verse":"Open thy mouth for the dumb, and for the causes of all the children that pass."},{"num":9,"verse":"Open thy mouth, decree that which is just, and do justice to the needy and poor."},{"num":10,"verse":"Who shall find a valiant woman? far and from the uttermost coasts is the price of her."},{"num":11,"verse":"The heart of her husband trusteth in her, and he shall have no need of spoils."},{"num":12,"verse":"She will render him good, and not evil, all the days of her life."},{"num":13,"verse":"She hath sought wool and flax, and hath wrought by the counsel of her hands."},{"num":14,"verse":"She is like the merchant's ship, she bringeth her bread from afar."},{"num":15,"verse":"And she hath risen in the night, and given a prey to her household, and victuals to her maidens."},{"num":16,"verse":"She hath considered a field, and bought it: with the fruit of her hands she hath planted a vineyard."},{"num":17,"verse":"She hath girded her loins with strength, and hath strengthened her arm."},{"num":18,"verse":"She hath tasted and seen that her traffic is good: her lamp shall not be put out in the night."},{"num":19,"verse":"She hath put out her hand to strong things, and her fingers have taken hold of the spindle."},{"num":20,"verse":"She hath opened her hand to the needy, and stretched out her hands to the poor."},{"num":21,"verse":"She shall not fear for her house in the cold of snow: for all her domestics are clothed with double garments."},{"num":22,"verse":"She hath made for herself clothing of tapestry: fine linen, and purple is her covering."},{"num":23,"verse":"Her husband is honourable in the gates, when he sitteth among the senators of the land."},{"num":24,"verse":"She made fine linen, and sold it, and delivered a girdle to the Chanaanite."},{"num":25,"verse":"Strength and beauty are her clothing, and she shall laugh in the latter day."},{"num":26,"verse":"She hath opened her mouth to wisdom, and the law of clemency is on her tongue."},{"num":27,"verse":"She hath looked well to the paths of her house, and hath not eaten her bread idle."},{"num":28,"verse":"Her children rose up, and called her blessed: her husband, and he praised her."},{"num":29,"verse":"Many daughters have gathered together riches: thou hast surpassed them all."},{"num":30,"verse":"Favour is deceitful, and beauty is vain: the woman that feareth the Lord, she shall be praised."},{"num":31,"verse":"Give her of the fruit of her hands: and let her works praise her in the gates."}]