[{"num":65,"verse":"They sought me, that asked not (for me) before; they that sought not me, found me. I said, Lo! I, lo! I, to heathen men that knew not me, and that called not my name to help. (The Lord said, I was there to be sought, but the people did not ask for me; I was there to be found, but they did not seek me. I said, Lo! I, lo! I, to a nation who did not know me, and who did not call on my name for help.)"},{"num":2,"verse":"I stretched forth mine hands all day to a people unbelieveful, that goeth in a way not good, after their thoughts. (I have stretched forth my hands all day long to an unbelieving people, who goeth on a way not good, after their own thoughts.)"},{"num":3,"verse":"It is a people that stirreth me to wrathfulness, ever before my face; which offer in gardens, and make sacrifice on tilestones; (They be a people who stirreth me to anger, ever before my face; who offer in gardens dedicated to idols, and make sacrifice on clay, or brick, altars;)"},{"num":4,"verse":"which dwell in sepulchres, and sleep in the temples of idols; which eat swine’s flesh, and unholy juice, either broth, is in the vessels of them; (who live in tombs, and sleep in the temples of idols; who eat swine’s flesh, and unholy juice, or defiled broth, is in their cups and bowls;)"},{"num":5,"verse":"which say to an heathen man, Go thou away from me, nigh thou not to me, for thou art unclean; these shall be smoke in my strong vengeance, fire burning all day (yet who say to the heathen, Go thou away from me, come thou not near to me, for thou art unclean; they be but smoke in my nose, a fire burning all day long!)"},{"num":6,"verse":"Lo! it is written before me; I shall not be still, but I shall yield, and I shall requite into the bosom of them (Lo! it is all written down before me; and I shall not keep silent, but I shall reward, and I shall repay into your bosom)"},{"num":7,"verse":"your wickednesses, and the wickednesses of your fathers together, saith the Lord, which made sacrifice on mountains, and did shame to me on little hills; and I shall mete again the first work of them in their bosom. (your wickednesses, and your forefathers’ wickednesses together, saith the Lord, who made sacrifice on mountains, and did shamefully before me on little hills; yea, I shall measure out their reward, and I shall make payment into their bosom.)"},{"num":8,"verse":"The Lord saith these things, As if a grape be found in a cluster, and it is said, Destroy thou not it, for it is blessing; so I shall do for my servants, that I lose not all. (The Lord saith these things, Like when grapes be found in a cluster, and it is said, Destroy thou it not, for it is a blessing; so I shall do for my servants, and I shall not destroy all of them.)"},{"num":9,"verse":"And I shall lead out of Jacob (a) seed, and (out) of Judah a man having in possession mine holy hills; and my chosen men shall inherit it, and my servants shall dwell there. (And I shall bring out of Jacob children, or descendants, and out of Judah those who shall possess my holy hills; and my chosen shall inherit it, and my servants shall live there.)"},{"num":10,"verse":"And the field places shall be into folds of flocks, and the valley of Achor into a resting place of droves of neat, to my people that sought me. (And Sharon shall be for folds of flocks, and the Valley of Achor for a place of rest for herds of wethers, or of rams, for my people who have sought me.)"},{"num":11,"verse":"And I shall number you in sword, that forsook the Lord, that forgot mine holy hill, which set a board to fortune, and make sacrifice thereon, (But with the sword I shall number your days, ye who desert the Lord, and forget my holy hill, who set a table for the god of fortune, and make sacrifice on it,)"},{"num":12,"verse":"and all ye shall fall by slaying; for that that I called, and ye answered not; I spake, and ye heard not; and ye did evil before mine eyes, and ye choosed those things which I would not. (and ye shall all be killed; because I called, and ye did not answer; I spoke, and ye did not listen; and ye did evil before my eyes, and ye chose those things, which I would not chose/which I did not desire.)"},{"num":13,"verse":"For these things, the Lord God saith these things, Lo! my servants shall eat, and ye shall have hunger; lo! my servants shall drink, and ye shall be thirsty; lo! my servants shall be glad, and ye shall be ashamed; (Because of this, the Lord God saith these things, Lo! my servants shall eat, but ye shall have hunger; lo! my servants shall drink, but ye shall be thirsty; lo! my servants shall be happy, but ye shall be ashamed;)"},{"num":14,"verse":"lo! my servants shall praise, for the full joy of heart, and ye shall cry, for the sorrow of heart, and ye shall yell, for [the] desolation of spirit. (lo! my servants shall praise, because of the great joy in their hearts, but ye shall cry, because of the sorrow in your hearts, and ye shall yell, or shall wail, because of the desolation, or the anguish, in your spirits.)"},{"num":15,"verse":"And ye shall leave your name into an oath to my chosen men (And your name shall be used as a curse by my chosen ones); and the Lord God shall slay thee, and he shall call his servants by another name."},{"num":16,"verse":"In which he that is blessed on earth, shall be blessed in God, amen; and he that sweareth in (the) earth, shall swear in God faithfully (In which he who is blessed in the land, shall be blessed by God, amen; and he who sweareth in the land, shall swear faithfully by God); for the former anguishes be given to forgetting, and for those be hid from your eyes."},{"num":17,"verse":"For lo! I make new heavens and a new earth, and the former things shall not be in mind (and the former things shall not be remembered), and shall not ascend on the heart."},{"num":18,"verse":"But ye shall have joy, and make full out joying till into without end, in these things which I make; for lo! I make Jerusalem (to be) full out joying, and the people thereof (to be a) joy. (But ye shall have joy, and shall rejoice until forever, over these things which I make; for lo! I shall make the new Jerusalem to be full of joy, and its people to have joy.)"},{"num":19,"verse":"And I shall make full out joying in Jerusalem, and I shall have joy in my people (Yea, I shall rejoice over Jerusalem, and I shall have joy over my people); and the voice of weeping and the voice of cry shall no more be heard therein."},{"num":20,"verse":"A young child of days shall no more be there, and an eld man, that filleth not his days; for why a child of an hundred years shall die, and a sinner of an hundred years shall be cursed. (And there shall not be a young child there, who liveth only for a few days, nor an old man who filleth not all of his days, for why should any child die before a hundred years of age; but a sinner shall die there before living a hundred years, for he shall be cursed.)"},{"num":21,"verse":"And they shall build houses, and shall inhabit them, and they shall plant vines, and shall eat the fruits of those."},{"num":22,"verse":"They shall not build houses, and another shall inhabit, they shall not plant, and another shall eat; for why the days of my people shall be after the days of the tree, and the works of their hands shall be eld to my chosen men. (They shall not build houses, which another shall inhabit, and they shall not plant, what another shall eat; for the days of my people shall be like the many days of a tree, and the works of their hands shall be long lasting for my chosen ones.)"},{"num":23,"verse":"They shall not travail in vain, neither they shall engender in(to) troubling; for it is the seed of them that be blessed of the Lord, and the cousins of them be with them. (They shall not labour in vain, nor shall they bring forth their children into trouble, or misfortune; for they be the children, or the descendants, of the blessed of the Lord, and their offspring after them.)"},{"num":24,"verse":"And it shall be, before that they cry, I shall hear; yet while they speak, I shall hear. (And it shall be, that before they even cry to me, I shall answer them; and while they speak, I shall listen to them.)"},{"num":25,"verse":"The wolf and the lamb shall be fed together, and a lion and an ox shall eat straw, and to a serpent (the) dust shall be his bread; they shall not harm, neither shall slay, in all mine holy hill, saith the Lord (they shall not do any harm, nor shall they kill, on all my holy hill, saith the Lord)."}]