[[],[{"type":"header","content":"The Lord Will Turn Mourning to Joy"},{"type":"prose","content":"“At that time, declares the , I will be the God of all the clans of Israel, and they shall be my people.”"}],[{"type":"prose","content":"Thus says the  of hosts, the God of Israel: “Once more they shall use these words in the land of Judah and in its cities, when I restore their fortunes:"}],[{"type":"prose","content":"And Judah and all its cities shall dwell there together, and the farmers and those who wander with their flocks."}],[{"type":"prose","content":"For I will satisfy the weary soul, and every languishing soul I will replenish.”"}],[{"type":"prose","content":"At this I awoke and looked, and my sleep was pleasant to me."}],[{"type":"prose","content":"“Behold, the days are coming, declares the , when I will sow the house of Israel and the house of Judah with the seed of man and the seed of beast."}],[{"type":"prose","content":"And it shall come to pass that as I have watched over them to pluck up and break down, to overthrow, destroy, and bring harm, so I will watch over them to build and to plant, declares the ."}],[{"type":"prose","content":"In those days they shall no longer say:"}],[{"type":"prose","content":"But everyone shall die for his own iniquity. Each man who eats sour grapes, his teeth shall be set on edge."},{"type":"header","content":"The New Covenant"}],[{"type":"prose","content":"“Behold, the days are coming, declares the , when I will make a new covenant with the house of Israel and the house of Judah,"}],[{"type":"prose","content":"not like the covenant that I made with their fathers on the day when I took them by the hand to bring them out of the land of Egypt, my covenant that they broke, though I was their husband, declares the ."}],[{"type":"prose","content":"For this is the covenant that I will make with the house of Israel after those days, declares the : I will put my law within them, and I will write it on their hearts. And I will be their God, and they shall be my people."}],[{"type":"prose","content":"And no longer shall each one teach his neighbor and each his brother, saying, ‘Know the ,’ for they shall all know me, from the least of them to the greatest, declares the . For I will forgive their iniquity, and I will remember their sin no more.”"}],[{"type":"prose","content":"“Behold, the days are coming, declares the , when the city shall be rebuilt for the  from the Tower of Hananel to the Corner Gate."}],[{"type":"prose","content":"And the measuring line shall go out farther, straight to the hill Gareb, and shall then turn to Goah."}],[{"type":"prose","content":"The whole valley of the dead bodies and the ashes, and all the fields as far as the brook Kidron, to the corner of the Horse Gate toward the east, shall be sacred to the . It shall not be plucked up or overthrown anymore forever.”"}]]