[{"header":"God’s Relationship with His People"},{"num":31,"verse":"“At that time”—this is the Lord’s declaration—“I will be the God of all the families of Israel, and they will be My people.”"},{"num":2,"verse":"This is what the Lord says:"},{"header":"God’s People Brought Home"},{"num":7,"verse":"For this is what the Lord says:"},{"header":"Lament Turned to Joy"},{"num":15,"verse":"This is what the Lord says:"},{"num":16,"verse":"This is what the Lord says:"},{"header":"Repentance and Restoration"},{"num":23,"verse":"This is what the Lord of Hosts, the God of Israel, says: “When I restore their fortunes, they will once again speak this word in the land of Judah and in its cities, ‘May the Lord bless you, righteous settlement, holy mountain.’ "},{"num":24,"verse":"Judah and all its cities will live in it together—also farmers and those who move with the flocks— "},{"num":25,"verse":"for I satisfy the thirsty person and feed all those who are weak.”"},{"num":26,"verse":"At this I awoke and looked around. My sleep had been most pleasant to me."},{"num":27,"verse":"“The days are coming”—this is the Lord’s declaration—“when I will sow the house of Israel and the house of Judah with the seed of man and the seed of beast. "},{"num":28,"verse":"Just as I watched over them to uproot and to tear them down, to demolish and to destroy, and to cause disaster, so will I be attentive to build and to plant them,” says the Lord. "},{"num":29,"verse":"“In those days, it will never again be said:"},{"num":30,"verse":"Rather, each will die for his own wrongdoing. Anyone who eats sour grapes—his own teeth will be set on edge."},{"header":"The New Covenant"},{"num":31,"verse":"“Look, the days are coming”—this is the Lord’s declaration—“when I will make a new covenant with the house of Israel and with the house of Judah. "},{"num":32,"verse":"This one will not be like the covenant I made with their ancestors when I took them by the hand to bring them out of the land of Egypt—a covenant they broke even though I had married them”—the Lord’s declaration. "},{"num":33,"verse":"“Instead, this is the covenant I will make with the house of Israel after those days”—the Lord’s declaration. “I will put My teaching within them and write it on their hearts. I will be their God, and they will be My people. "},{"num":34,"verse":"No longer will one teach his neighbor or his brother, saying, ‘Know the Lord,’ for they will all know Me, from the least to the greatest of them”—this is the Lord’s declaration. “For I will forgive their wrongdoing and never again remember their sin.”"},{"num":35,"verse":"This is what the Lord says:"},{"num":37,"verse":"This is what the Lord says:"},{"num":38,"verse":"“Look, the days are coming”—the Lord’s declaration—“when the city from the Tower of Hananel to the Corner Gate will be rebuilt for the Lord. "},{"num":39,"verse":"A measuring line will once again stretch out straight to the hill of Gareb and then turn toward Goah. "},{"num":40,"verse":"The whole valley—the corpses, the ashes, and all the fields as far as the Kidron Valley to the corner of the Horse Gate to the east—will be holy to the Lord. It will never be uprooted or demolished again.”"}]