[{"header":"The New Israel"},{"num":31,"verse":"The Lord says, “At that time I will be God of all Israel’s family groups, and they will be my people.”"},{"num":2,"verse":"This is what the Lord says:"},{"num":3,"verse":"And from far away the Lord appeared to his people and said,"},{"num":7,"verse":"This is what the Lord says:"},{"num":15,"verse":"This is what the Lord says:"},{"num":16,"verse":"But this is what the Lord says:"},{"num":23,"verse":"The Lord All-Powerful, the God of Israel, says: “I will again do good things for the people of Judah. At that time the people in the land of Judah and its towns will again use these words: ‘May the Lord bless you, home of what is good, holy mountain.’ "},{"num":24,"verse":"People in all the towns of Judah will live together in peace. Farmers and those who move around with their flocks will live together in peace. "},{"num":25,"verse":"I will give rest and strength to those who are weak and tired.”"},{"num":26,"verse":"After hearing that, I, Jeremiah, woke up and looked around. My sleep had been very pleasant."},{"num":27,"verse":"The Lord says, “The time is coming when I will help the families of Israel and Judah and their children and animals to grow. "},{"num":28,"verse":"In the past I watched over Israel and Judah, to pull them up and tear them down, to destroy them and bring them disaster. But now I will watch over them to build them up and make them strong,” says the Lord."},{"num":29,"verse":"“At that time people will no longer say:"},{"num":30,"verse":"Instead, each person will die for his own sin; the person who eats sour grapes will grind his own teeth."},{"header":"The New Agreement"},{"header":"The Lord Will Never Leave Israel"},{"num":37,"verse":"This is what the Lord says:"},{"header":"The New Jerusalem"},{"num":38,"verse":"The Lord says, “The time is coming when Jerusalem will be rebuilt for me—everything from the Tower of Hananel to the Corner Gate. "},{"num":39,"verse":"The measuring line will stretch from the Corner Gate straight to the hill of Gareb. Then it will turn to the place named Goah. "},{"num":40,"verse":"The whole valley where dead bodies and ashes are thrown, and all the terraces out to the Kidron Valley on the east as far as the corner of the Horse Gate—all that area will be holy to the Lord. The city of Jerusalem will never again be torn down or destroyed.”"}]