[{"num":31,"verse":"“At that time I will be the God of all the families of Israel,” announces the Lord. “And they will be my people.”"},{"num":2,"verse":"The Lord says,"},{"num":3,"verse":"The Lord appeared to us in the past. He said,"},{"num":7,"verse":"The Lord says,"},{"num":15,"verse":"The Lord says,"},{"num":16,"verse":"The Lord says,"},{"num":23,"verse":"The Lord who rules over all is the God of Israel. He says, “I will bring them back from the place where they were taken. Here is what the people in Judah and its towns will say once again. ‘May the Lord bless you, you successful city. Sacred mountain, may he bless you.’ "},{"num":24,"verse":"People will live together in Judah and all its towns. Farmers and shepherds will live there. "},{"num":25,"verse":"I will give rest to those who are tired. I will satisfy those who are weak.”"},{"num":26,"verse":"When I heard this, I woke up and looked around. My sleep had been pleasant to me."},{"num":27,"verse":"Here is what the Lord announces. “The days are coming when I will plant the kingdoms of Israel and Judah again. I will plant them with children and young animals. "},{"num":28,"verse":"I watched over Israel and Judah to pull them up by the roots. I tore them down. I crushed them. I destroyed them. I brought horrible trouble on them. But now I will watch over them to build them up and plant them,” announces the Lord. "},{"num":29,"verse":"“In those days people will no longer say,"},{"num":30,"verse":"Instead, everyone will die for their own sin. The one who eats sour grapes will taste how bitter they are."},{"num":35,"verse":"The Lord speaks."},{"num":37,"verse":"The Lord says,"},{"num":38,"verse":"“The days are coming,” announces the Lord. “At that time Jerusalem will be rebuilt for me. It will be rebuilt from the Tower of Hananel to the Corner Gate. "},{"num":39,"verse":"The measuring line will reach out from there. It will go straight to the hill of Gareb. Then it will turn and reach as far as Goah. "},{"num":40,"verse":"There is a valley where dead bodies and ashes are thrown. That whole valley will be holy to me. The side of the Kidron Valley east of the city will be holy to me. It will be holy all the way to the corner of the Horse Gate. The city will never again be pulled up by the roots. It will never be destroyed.”"}]