[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Woe unto them that call evil good.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The moral state described was the natural outcome of the sins condemned in the preceding verses. So Thucydides (iii. 82-84) describes the effects of the spirit of party in the Peloponnesian war. Rashness was called courage, and prudence timidity, and treachery cleverness, and honesty stupidity. That deliberate perversion is in all ages the ultimate outcome of the spirit that knows not God, and therefore neither fears nor loves Him, whether it shows itself in the licence of profligacy, or the diplomacy of Machiavellian statesmen, or the speculations of the worshippers of Mammon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 5:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wo unto them that call evil good, and good evil ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That endeavour to confound both the names and the natures of virtue and vice, of piety and impiety; commend and applaud what is evil, and disparage and discountenance what is good; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that put darkness for light, and light for darkness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Ignorance and error, for knowledge and truth: in other words, who subvert, or pervert, all the great principles of truth, wisdom, and of righteousness. A most corrupt condition of a church and state is that indeed, “in which men, accustomed to vices, begin, with the things themselves, to lose also the names of them, and to draw a veil, as it were, over their impieties, by sanctifying their crimes with the names of virtues.” This reproof of the prophet supposes, that the difference between good and evil, sin and holiness, is as self-evident as that between the most contrary qualities which we are informed of by the report of our senses: and that the advantage which light hath above darkness does not shine out with a brighter evidence than the pre-eminence which virtue hath above vice, righteousness above unrighteousness. See Lowth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:8-23 Here is a woe to those who set their hearts on the wealth of the world. Not that it is sinful for those who have a house and a field to purchase another; but the fault is, that they never know when they have enough. Covetousness is idolatry; and while many envy the prosperous, wretched man, the Lord denounces awful woes upon him. How applicable to many among us! God has many ways to empty the most populous cities. Those who set their hearts upon the world, will justly be disappointed. Here is woe to those who dote upon the pleasures and the delights of sense. The use of music is lawful; but when it draws away the heart from God, then it becomes a sin to us. God's judgments have seized them, but they will not disturb themselves in their pleasures. The judgments are declared. Let a man be ever so high, death will bring him low; ever so mean, death will bring him lower. The fruit of these judgments shall be, that God will be glorified as a God of power. Also, as a God that is holy; he shall be owned and declared to be so, in the righteous punishment of proud men. Those are in a woful condition who set up sin, and who exert themselves to gratify their base lusts. They are daring in sin, and walk after their own lusts; it is in scorn that they call God the Holy One of Israel. They confound and overthrow distinctions between good and evil. They prefer their own reasonings to Divine revelations; their own devices to the counsels and commands of God. They deem it prudent and politic to continue profitable sins, and to neglect self-denying duties. Also, how light soever men make of drunkenness, it is a sin which lays open to the wrath and curse of God. Their judges perverted justice. Every sin needs some other to conceal it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wo unto them that call evil good ... - This is the fourth class of sins denounced. The sin which is reprobated here is that of \"perverting and confounding\" things, especially the distinctions of morality and religion. They prefer erroneous and fake doctrines to the true; they prefer an evil to an upright course of conduct. The Chaldee renders this, 'Wo to those who say to the impious, who are prospered in this age, You are good; and who say to the meek, Ye are impious.' Jarchi thinks that the prophet here refers to those who worship idols, but he evidently has a more general reference to those who confound all the distinctions of right and wrong, and who prefer the wrong.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That put darkness for light - \"Darkness,\" in the Scriptures, is the emblem of ignorance, error, false doctrine, crime. Light denotes truth, knowledge, piety. This clause, therefore, expresses in a figurative, but more emphatic manner, what was said in the previous member of the verse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That put bitter - \"Bitter and bitterness\" are often used to denote \"sin;\" see the note at Acts 8:23; also Romans 3:14; Ephesians 4:31; Hebrews 12:15; Jeremiah 2:19; Jeremiah 4:18. The meaning here does not differ from that expressed in the other parts of the verse, except that there is \"implied\" the additional idea that sin \"is\" bitter; and that virtue, or holiness, is sweet: that is, that the one is attended with painful consequences, and the other with pleasure. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That put bitter - \"Bitter and bitterness\" are often used to denote \"sin;\" see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 8:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 4:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning here does not differ from that expressed in the other parts of the verse, except that there is \"implied\" the additional idea that sin \"is\" bitter; and that virtue, or holiness, is sweet: that is, that the one is attended with painful consequences, and the other with pleasure. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. Fourth Woe—against those who confound the distinctions of right and wrong (compare Ro 1:28), \"reprobate,\" Greek, \"undiscriminating: the moral perception darkened.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bitter … sweet—sin is bitter (Jer 2:19; 4:18; Ac 8:23; Heb 12:15); though it seem sweet for a time (Pr 9:17, 18). Religion is sweet (Ps 119:103).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That call evil good, and good evil; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that take away the difference between good and evil; that justify and approve wicked men and things, and condemn piety, or virtue; or righteous persons. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 17:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 17:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus many call serious godliness, humorous singularity; and justice, morosity; and meekness, stupidity, &c.; as, on the contrary, they call pride, magnanimity; and covetousness, good husbandry. And men are very apt to follow the course of the world in their false judgments of things; which therefore the prophet so severely forbids. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Woe unto them that call evil good, and good evil,.... That call evil actions good, and good actions evil; that excuse the one, and reproach the other; or that call evil men good, and good men evil; to which the Targum agrees. Some understand this of false prophets rejecting the true worship of God, and recommending false worship; others of wicked judges, pronouncing the causes of bad men good, and of good men evil; others of sensualists, that speak in praise of drunkenness, gluttony, and all carnal pleasures, and fleshly lusts, and treat with contempt fear, worship, and service of God. It may very well be applied to the Scribes and Pharisees in Christ's time, who preferred the evil traditions of their elders, both to the law of God, that is holy, just, and good, and to the Gospel, the good word of God, preached by John the Baptist, Christ and his apostles, and to the ordinances of the Gospel dispensation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter; for calling good evil, and evil good, is all one as putting these things one for another; there being as great a difference between good and evil, as between light and darkness, sweet and bitter; and it suggests, as if the perversion of these things was not merely through ignorance and mistake, but purposely and wilfully against light and knowledge; so the Jews acted when they preferred the darkness of their rites and ceremonies, and human traditions, before the light of the glorious Gospel of Christ; which showed they loved darkness rather than light, John 3:19 and chose that which would be bitter to them in the end, than the sweet doctrines of the grace of God; the bitter root of error, rather than the words of Christ's mouth, which are sweeter than the honey, or the honeycomb. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter; for calling good evil, and evil good, is all one as putting these things one for another; there being as great a difference between good and evil, as between light and darkness, sweet and bitter; and it suggests, as if the perversion of these things was not merely through ignorance and mistake, but purposely and wilfully against light and knowledge; so the Jews acted when they preferred the darkness of their rites and ceremonies, and human traditions, before the light of the glorious Gospel of Christ; which showed they loved darkness rather than light, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and chose that which would be bitter to them in the end, than the sweet doctrines of the grace of God; the bitter root of error, rather than the words of Christ's mouth, which are sweeter than the honey, or the honeycomb. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"woe to them that say to the wicked who prosper in this world, ye are good; and say to the meek, ye are wicked: when light cometh to the righteous, shall it not be dark with the wicked? and sweet shall be the words of the law to them that do them; but bitterness (some read \"rebellion\") shall come to the wicked; and they shall know, that in the end sin is bitter to them that commit it.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Abarbinel interprets this of the ten tribes preferring the worship at Dan and Bethel, before that at Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Abarbinel interprets this of the ten tribes preferring the worship at Dan and Bethel, before that at Jerusalem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Woe to them that call evil good, {a} and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Woe to them that call evil good, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Who are not ashamed of sin, nor care for honesty but are grown to a desperate impiety.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fourth woe, against those who confuse moral distinctions. Amongst the “wise men” of the time (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 25:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") there may have been a class of sophists, who employed their subtlety in making out a case for abuses condemned by the unsophisticated moral sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Woe unto them that call evil good.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is the fourth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " woe. There are persons who gloss over evil deeds and evil habits by fair-sounding names, who call cowardice caution, and rashness courage,  stubbornness thrift, and wasteful profusion generosity. The same men are apt also to call good evil; they brand prudence with the name of cunning, call meekness want of proper spirit, sincerity rudeness, and firmness obstinacy. This deadness to moral distinctions is the sign of deep moral corruption, and fully deserves to have a special \"woe\" pronounced against it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That put darkness for light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Light\" and \"darkness\" symbolize good and evil throughout Scripture (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 22:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 112:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). They are sometimes mere synonyms, as here; but sometimes they express rather the intellectual side of morality. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Bitter for sweet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". More symbolism, but of a rarer kind. Jeremiah calls wickedness \"bitter\" (Jeremiah 2:9; 4:18), and the psalmist calls the judgments of God\" sweet\" (Psalm 109:103). But the terms are not often used with any moral bearing. Isaiah 5:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fourth woe: \"Woe to those who call evil good, and good evil; who give out darkness for light, and light for darkness; who give out bitter for sweet, and sweet for bitter.\" The previous woe had reference to those who made the facts of sacred history the butt of their naturalistic doubt and ridicule, especially so far as they were the subject of prophecy. This fourth woe relates to those who adopted a code of morals that completely overturned the first principles of ethics, and was utterly opposed to the law of God; for evil, darkness, and bitter, with their respective antitheses, represent moral principles that are essentially related (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Evil, as hostile to God, is dark in its nature, and therefore loves darkness, and is exposed to the punitive power of darkness. And although it may be sweet to the material taste, it is nevertheless bitter, inasmuch as it produces abhorrence and disgust in the godlike nature of man, and, after a brief period of self-deception, is turned into the bitter woe of fatal results. Darkness and light, bitter and sweet, therefore, are not tautological metaphors for evil and good; but epithets applied to evil and good according to their essential principles, and their necessary and internal effects. ",
        "children": []
      }
    ]
  }
]