[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE RAY AND THE REFLECTION",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Very simple words! but they go down into the depths of God, lifting burdens off the heart of humanity, turning duty into delight, and changing the aspect of all things. He who knows that God loves him needs little more for blessedness; he who loves God back again offers more than all burnt offering and sacrifices. But it is to be observed that the correct reading of my text, as you will find in the Revised Version, omits ‘Him’ in the first clause, and simply says ‘we love,’ without specifying the object. That is to say, for the moment John’s thought is fixed rather on the inward transformation effected, from self-regard to love--than on considering the object on which the love is expended. When the heart is melted, the streams flow wherever there is a channel. The river, as he goes on to show us, parts into two heads, and love to God and love to man are, in their essence and root-principle, one thing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So my text is the summary of all revelation about God, the ultimate word about all our relations to Him, and the all-inclusive directory as to our conduct to one another. To know that God loves, and to love again--there is a little pocket encyclopædia in two volumes, which contains the smelted-down essence of all theology and of all morality. Let us look at these three points.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The ultimate word about God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He first loved us.’ Properly and strictly speaking, that ‘first’ only declares the priority of the divine love towards us over ours towards Him. But we may fairly give it a wider meaning, and say--first of all, ere Creation and Time, away back in the abysmal depths of an everlasting and changeless heart, changeless in the sense that its love was eternal, but not changeless in the sense that love could have no place within it--first of all things was God’s love; last to be discovered because most ancient of all. The foundation is disclosed last when you come to dig, and the essence is grasped last in the process of analysis.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So one of the old psalms, with wondrous depth of truth, traces up everything to this, ‘For His mercy endureth for ever.’ Therefore, there was time; therefore, there were creatures--’He made great lights, for His mercy endureth for ever.’ Therefore, there were judgments--’He slew famous kings ... for His mercy endureth for ever.’ And so we may pass through all the works of the divine energy, and say, ‘He first loved us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is no accident that there are but foregleams of this great thought brightening the words and the thoughts of psalmist and prophet, saint and sage, from the beginning onwards, while the articulate utterance of the simple sentence was first heard from the lips of Him who declared the Father, and stands in that part of the Book which, both in its position there, and in its date of composition is the last of the Apostolic utterances. ‘God is love’;--that is in one aspect the foundation of His being, and in another aspect the shining ruby set on the very sky-piercing summit of the completed process of the revelation of that Being to man. ‘He first loved us’; and thence, from that centre and germinal point, streams out the whole train of consequences in the divine activity, and in the divine self-revelation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I need not ask you to contrast with this infinitely simple and infinitely deep utterance all other thoughts of a divine Being--the cold abstractions of Theism, the dim dreads of popular apprehension, the vague utterances of any mythology, the clouds that men’s thoughts have covered over the face of this great truth--and then, to set by the side of all these groping, these peradventures, these fears, these narrow, unworthy ideas, the clear simplicity, the infinite depth of ‘He first loved us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But I may ask you to consider, but for a moment, the relation which all the other perfection of the divine nature have to this central and foundation one. There are all those pompous names, ‘Omnipresence’ and ‘Omniscience’ and the like, which are but the negations of the limitations of humanity or of finite creatures. There are the more spiritual and moral thoughts of Wisdom and Righteousness and the like. These are but the fringes of the glory: I was going to venture to say that the divinest thing in God is love. There is the central blaze; the rest is but the brilliant periphery that encloses it. And that infinite love stands to all these other attributes in the relation of being their master and motive spring. They are Love’s instrument, and in the divine nature Love is Lord of all. They give it majesty; it gives them tenderness. We may reverently say, in regard to the divine nature, what the Apostle says about our humanity, that love is the ‘bond of perfectness’--the girdle which, braced round all the garments, keeps them in their place. For round these infinite, innumerable, unnameable, and named divine perfections, is that which brings them all into symmetry and keeps them all in harmonious action--Love. He has wisdom, and power, and eternal being, but He is Love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But do not let us forget that whilst thus my text proclaims the ultimate truth, these other attributes, as they are called, are all smelted down, as it were, into, and present in, the love which is their crown. The same Apostle, who has thus the honour of ringing out to the world the good news that God is Love, declares that ‘this is the message’ which he has to tell, that ‘God is light, and in Him is no darkness at all.’ So the light of righteousness, as well as the lambent flame of love, burn together on that central fire of the universe. We must not so conceive of the love of God, as to darken the radiance of His righteousness, or to obscure the brilliancy of that pure light which tolerates no admixture of darkness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "May I venture a step further, and ask whether we are not warranted in believing that in that which we call the love of God there do abide the same elements as characterise the thing that bears the same name in our human experience? The spectrum has told us that the constituents of the mighty sun in the heavens are the same as the constituents of this little darkened earth. And there are the same lines in the divine spectrum that there are in ours. So if we can venture to say of Him, He is Love, do not let us shrink from saying that then, like us, He delights in the companionship of His beloved; that, like us, He rejoices in giving Himself to His beloved; that, like us, but infinitely, He desires the good of His beloved; and that, like us, He seeks only for the requital of an answering love. All these things, the joy of the Lord in man, the yielding of the Lord to man, the beneficent desire of the Lord for the good of man, and the hunger of the Lord for the response of love from man--all these things are affirmed when we affirm that God is Love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Our Apostle would concur heartily in the great text which was the theme of a recent sermon. Paul said, ‘God establishes His love towards us, in that while we were yet sinners, Christ died for us.’ John says, ‘Herein is love, not that we loved God, but that He loved us, and sent His Son to be the propitiation for our sins.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So the Cross of Christ is the one demonstration that God loved us. Looking to it we can say, with a great modern teacher:--",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘So the All-great were the All-loving too,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So through the thunder comes a human voice,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Saying \"Oh! heart I made; a heart beats here,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Face, My hands fashioned, see it in Myself;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thou hast no power, nor mayest conceive of Mine;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But love I gave thee, with Myself to love,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And thou must love Me, who have died for thee.\"‘",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Here we have the ultimate word as to our religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘We love Him, because He first loved us.’ There is a bridge wanted between these two, and the bridge is supplied abundantly in this letter, in entire harmony with the teaching of the rest of the New Testament. Much has been said, and profitably said, with reference to the modification of the general type of Christian teaching in the writings respectively of Paul, Peter, James, and John. I thankfully recognise the diversities. They are not divergencies; they are perfectly complementary, and may all be made to harmonise. This Apostle of love has also declared to us how it comes that the love which burns at the centre of things, where there is a heart, kindles a responding love away out on the circumference of things, where there are men with hearts; and the bridge is--’We have known and believed the love that God hath to us.’ So says John. And Paul, the Apostle of faith, who sometimes seems as if his only conception of the link of union between God and man was, on the part of man, faith, responds when he speaks of a faith which worketh, comes to energetic operation, through the love which it has kindled.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So we come to this, that a simple trust in the love of God, as manifested in Jesus Christ, our Lord, is the only thing which will so deal with man’s natural self-regard and desire to make himself his own object and centre, as to substitute for that the victorious love to God. You cannot love God, unless you believe that He loves you. You will never be absolutely sure of that, unless you have learned it from the Cross of Christ. You will not respond with the love that He desires, but there will be a film between your ice and the fire that could melt it, until that is swept away by the simple act of confidence in God manifested to you in Jesus Christ. This is Christianity; this, nothing less, is religion--to love God, because I believe that in Jesus Christ God has loved me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And that is the only thing that He desires or accepts. The Religion of Fear; what is it? ‘Thou wert an austere man ... and I was afraid.’ Yes! and what did you do when you were afraid? ‘I hid my talent in the ground,’ and was utterly idle. Here rise, on either side of the valley, two mountains--Ebal and Gerazim. From the one were thundered the curses, from the other broke the benediction of the blessings; the one is barren, the other is verdant--’which thing is an allegory.’ The Religion of Fear does nothing, the Religion of Love does all. The Religion of Self-interest is narrow, poor, mostly inoperative of any lofty enthusiasm or high nobleness of character. The Religion of Duty; ‘I ought to worship, I am bidden to do this, that, or the other thing, which I do not a bit like to do. I am forbidden to do this, that, and the other thing which I should very much like to do, if I durst’--that religion is the religion of a slave; and there are hosts of us that know nothing better. And so our Christianity is a feeble and an uncomfortable thing; and there are little joy, and little subjugation of the will, and little leaping up of the heart in glad obedience in it. I was talking to a good, aged man, not long ago, whose religion was of a very gloomy type. He said to me, ‘As to love, I know next to nothing about it.’ Ah! brethren, I am afraid that is true about a good many of us who call ourselves Christians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then let me say, too, that if we love Him, it will be the motive power and spring of all manner of obediences and glad services. Love is the mother-tincture, so to speak, which you can colour, and to which you can add in various ways, and produce variously tinted and tasted and perfumed commixtures. Love lies at the foundation of all Christian goodness. It will lead to the subjugation of the will; and that is the thing that is most of all needed to make a man righteous and pure. So St. Augustine’s paradox, rightly understood, is a magnificent truth, ‘Love! and do what you will.’ For then you will be sure to will what God wills, and you ought.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If this be the summing-up of all religion, a practical conclusion follows. When we feel ourselves defective in the glow and operative driving power of love to God, what is the right thing to do? When a man is cold, he will not warm himself by putting a clinical thermometer into his mouth, and taking his temperature, will he? Let him go into the sunshine and he will be warmed up. You can pound ice in a mortar, and except for the little heat generated by the impact of the pestle, it will keep ice still. But float the iceberg south into the tropics, and what has become of it? It has all run down into sweet, warm water, and mingled with the warm ocean that has dissolved it. So do not think about yourselves and your own loveless hearts so much, but think about God, and the infinite welling up of love in His heart to you, a great deal more. ‘We love Him, because He first loved us’; therefore, to love Him more, we must feel more that He does love us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, here is the ultimate word about our conduct to men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I said that John, by leaving out any specification of the object of love, as well as by the verses that immediately follow, shows that he regards the emotion as one, though its direction is two-fold. That just comes to the plain truth, that the only victorious antagonist to the self-regarding temperament of average men, and the only power which will change philanthropy from a sentiment into a self-denying and active principle of conduct, is to be found in the belief of the love of God in Jesus Christ, and in answering love to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is a lesson for many sorts of people to-day. What they call altruism is no discovery of Christianity, but its practice is. I freely admit that there is much honest and self-sacrificing beneficence and benevolence which are not connected, in the men who practice them, with faith in Jesus Christ. But I question very much whether these would have existed if the story of the Cross had been unknown. And sure I am that the history of non-Christian attempts to promote the brotherhood of man, and to diffuse a wide and operative love of mankind, teaches us, on the one side, that the emotion is not strong enough to last, and to work, unless it is based on God’s love in Jesus Christ. And the history of Christianity, on the other side, though with many defects and things to be ashamed of, teaches us, conversely, that wherever there is a genuine love of God, its exterior form, so to say, the outside of it which is presented to the world, will be true love to man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christian people, lay this to heart; you are to be mirrors of the love to which you turn for all blessedness and peace. It is of no use to say, ‘My religion is the love of God’ unless the love of God is manifested in the love of man. If you love God, you will love those that God loves, those for whom Christ died, those who are just like what you were when you learned that God loved you. The service of God is the service of man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "One last word, ‘We love Him, because He first loved us.’ Do you? Or is it rather true of you: ‘I do not love God, though He has loved me’? I saw not long since, up on the flank of a mountain, an obstinate patch of snow, that had fronted, in unmelted cold, months of the summer sun. There are some of us who lift a broad shield of thick-ribbed ice between ourselves and the radiance of the warm heart of God. Oh! brother; do not shut that love out of your heart; for if you do, you shut out peace and goodness, and shut in all manner of poisonous creatures and doleful shapes, whose companionship will be misery and death.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:14-21 The Father sent the Son, he willed his coming into this world. The apostle attests this. And whosoever shall confess that Jesus is the Son of God, God dwelleth in him, and he in God. This confession includes faith in the heart as the foundation; makes acknowledgment with the mouth to the glory of God and Christ, and profession in the life and conduct, against the flatteries and frowns of the world. There must be a day of universal judgment. Happy those who shall have holy boldness before the Judge at that day; knowing he is their Friend and Advocate! Happy those who have holy boldness in the prospect of that day, who look and wait for it, and for the Judge's appearance! True love to God assures believers of God's love to them. Love teaches us to suffer for him and with him; therefore we may trust that we shall also be glorified with him, 2Ti 2:12. We must distinguish between the fear of God and being afraid of him; the fear of God imports high regard and veneration for God. Obedience and good works, done from the principle of love, are not like the servile toil of one who unwillingly labours from dread of a master's anger. They are like that of a dutiful child, who does services to a beloved father, which benefit his brethren, and are done willingly. It is a sign that our love is far from perfect, when our doubts, fears, and apprehensions of God, are many. Let heaven and earth stand amazed at his love. He sent his word to invite sinners to partake of this great salvation. Let them take the comfort of the happy change wrought in them, while they give him the glory. The love of God in Christ, in the hearts of Christians from the Spirit of adoption, is the great proof of conversion. This must be tried by its effects on their temper, and their conduct to their brethren. If a man professes to love God, and yet indulges anger or revenge, or shows a selfish disposition, he gives his profession the lie. But if it is plain that our natural enmity is changed into affection and gratitude, let us bless the name of our God for this seal and earnest of eternal happiness. Then we differ from the false professors, who pretend to love God, whom they have not seen, yet hate their brethren, whom they have seen.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We love him, because he first loved us - This passage is susceptible of two explanations; either.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) that the fact that he first loved us is the \"ground\" or \"reason\" why we love him, or.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that as a matter of fact we have been brought to love him in consequence of the love which he has manifested toward us, though the real ground of our love may be the excellency of his own character.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If the former be the meaning, and if that were the only ground of love, then it would be mere selfishness, (compare Matthew 5:46-47); and it cannot be believed that John meant to teach that that is the \"only\" reason of our love to God. It is true, indeed, that that is a proper ground of love, or that we are bound to love God in proportion to the benefits which we have received from his Hand; but still genuine love to God is something which cannot be explained by the mere fact that we have received favors from Him. The true, the original ground of love to God, is the \"excellence of His own character,\" apart from the question whether we are to be benefited or not. There is that in the divine nature which a holy being will love, apart from the benefits which he is to receive, and from any thought even of his own destiny. It seems to me, therefore, that John must have meant here, in accordance with the second interpretation suggested above, that the fact that we love God is to be traced to the means which he has used to bring us to himself, but without saying that this is the sole or even the main reason why we love him. It was His love manifested to us by sending His Son to redeem us which will explain the fact that we now love Him; but still the real ground or reason why we love Him is the infinite excellence of His own character. It should be added here, that many suppose that the Greek words rendered \"we love\" (ἡμεῖς ἀγαπῶμεν  hēmeis agapōmen are not in the indicative, but in the subjunctive; and that this is an exhortation - \"let us love him, because he first loved us.\" So the Syriac, the Arabic, and the Vulgate read it; and so it is understood by Benson, Grotius, and Bloomfield. The main idea would not be essentially different; and it is a proper ground of exhortation to love God because He has loved us, though the highest ground is, because His character is infinitely worthy of love. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If the former be the meaning, and if that were the only ground of love, then it would be mere selfishness, (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:46-47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and it cannot be believed that John meant to teach that that is the \"only\" reason of our love to God. It is true, indeed, that that is a proper ground of love, or that we are bound to love God in proportion to the benefits which we have received from his Hand; but still genuine love to God is something which cannot be explained by the mere fact that we have received favors from Him. The true, the original ground of love to God, is the \"excellence of His own character,\" apart from the question whether we are to be benefited or not. There is that in the divine nature which a holy being will love, apart from the benefits which he is to receive, and from any thought even of his own destiny. It seems to me, therefore, that John must have meant here, in accordance with the second interpretation suggested above, that the fact that we love God is to be traced to the means which he has used to bring us to himself, but without saying that this is the sole or even the main reason why we love him. It was His love manifested to us by sending His Son to redeem us which will explain the fact that we now love Him; but still the real ground or reason why we love Him is the infinite excellence of His own character. It should be added here, that many suppose that the Greek words rendered \"we love\" (ἡμεῖς ἀγαπῶμεν  hēmeis agapōmen are not in the indicative, but in the subjunctive; and that this is an exhortation - \"let us love him, because he first loved us.\" So the Syriac, the Arabic, and the Vulgate read it; and so it is understood by Benson, Grotius, and Bloomfield. The main idea would not be essentially different; and it is a proper ground of exhortation to love God because He has loved us, though the highest ground is, because His character is infinitely worthy of love. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. him—omitted in the oldest manuscripts. Translate, We (emphatical: WE on our part) love (in general: love alike Him, and the brethren, and our fellow men), because He (emphatical: answering to \"we\"; because it was He who) first loved us in sending His Son (Greek aorist of a definite act at a point of time). He was the first to love us: this thought ought to create in us love casting out fear (1Jo 4:18).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " His is the fountain love, ours but the stream: his love the inducement, the pattern, and the effective cause of ours. He that is first in love, loves freely; the other therefore loves under obligation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We love him, because he first loved us. Lest love to God, and so to one another, should be thought to be of ourselves, and too much be ascribed unto it, the apostle observes, that God's love to us is prior to our love to him; his love is from everlasting, as well as to everlasting; for he loves his people as he does his Son, and he loved him before the foundation of the world; his choosing them in Christ as early, and blessing them then with all spiritual blessings, the covenant of grace made with Christ from all eternity, the gift of grace to them in him before the world began, and the promise of eternal life to them so soon, show the antiquity and priority of his love: his love shown in the mission and gift of his Son was before theirs, and when they had none to him; and his love in regeneration and conversion is previous to theirs, and is the cause of it; his grace in regeneration brings faith and love with it, and produces them in the heart; and his love shed abroad there is the moving cause of it, or what draws it first into act and exercise; and the larger the discoveries and applications of the love of God be, the more does love to him increase and abound; and nothing more animates and inflames our love to God, than the consideration of the earliness of his love to us, of its being before ours; which shows that it is free, sovereign, distinguishing, and unmerited. Some read the words as an exhortation, \"let us love him\"; and others as in the subjunctive mood, \"we should love him\", because, &c. some copies read, \"we love God\", and so the Vulgate Latin, Syriac, and Ethiopic versions, and the Alexandrian copy, read, \"because God first loved us\": and so some others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{14} We love him, because he first loved us.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{14}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " We love him, because he first loved us.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(14) Lest any man should think that that peace of conscience proceeds from our love as the cause, he goes back to the fountain, that is, to the free love with which God loves us although we deserved and do deserve his wrath. From this springs another double charity, which both are tokens and witnesses of that first, that is, that we love God who loved us first, and then for his sake our neighbours also.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμεῖς ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] According to this reading (omit ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπᾷν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here to be taken in the same comprehensive way as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγάπη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Düsterdieck, Myrberg,[284] Ebrard), and must not be restricted to “brotherly love” (Lücke).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in analogy with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὀφείλομεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is taken by Hornejus, Grotius, Lorinus, Lange, Lücke, de Wette-Brückner, Baumgarten-Crusius, Sander, Besser, Düsterdieck, Myrberg, etc., as imperative subjunctive; but it might be more correct to regard this verse, just as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as an expression of the actual character of true Christians, with whom, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐάν τις εἴπῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the false Christian is contrasted, and therefore to take ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Beza, Socinus, Spener, Bengel, Rickli, Neander, Ebrard, Hofmann (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Schriftbew.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " II. 2, p. 338), Braune, etc., as indicative, in favour of which is also the prefixed ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The reason of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμεῖς ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι αὐτὸς πρῶτος ἠγάπησεν ἡμᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the chief emphasis rests on ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρῶτος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[284] Myrberg remarks: totum genus amoris hic proponitur; sed ubi totum genus amoris nuncupatur, ibi mens ante omnia fertur ad considerationem amoris erga Deum.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has no accus. The thought is that the amazing love of God in Christ is the inspiration of all the love that stirs in our hearts. It awakens within us an answering love—a grateful love for Him manifesting itself in love for our brethren (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The insertion of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a clumsy and unnecessary gloss. Neither should ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be inserted and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " taken as hortat. subjunctive. Vulg.: “Nos ergo diligamus Deum, quoniam Deus prior dilexit nos”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We love him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Omit ‘Him’, which is a later addition to the true text: some authorities for ‘Him’ add ‘God’, and some have ‘God’ for ‘He’ in the next clause. No accusative is expressed, and none, whether ‘God’ or ‘one another’, is to be understood: Christian love of every kind is meant. Authorities are much divided between ‘we love’ and ‘let us love’; for the Greek (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may be either indicative or hortative subjunctive. The former is better. The Peschito and Vulgate render ‘let us love’ and with Codex A insert ‘therefore’: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nos ergo diligamus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because he first loved us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] We shall narrow the Apostle’s meaning if we limit this to the idea of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gratitude",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evoking love. The ‘first’, which is the important word, means much more than that. 1. Our love owes its very origin to God’s love, from which it is an effluence (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 John 4:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 4:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). 2. Love is checked by fear when it is doubtful whether it is returned. Our love has no such check; for it knows that God’s love has been beforehand with it. Bede compares ‘Ye did not choose Me, but I chose you’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[14]) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", driving away fear.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρῶτος ἠγάπησεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He was the first to embrace us with love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") How much the more hereafter? Therefore fear is cast out.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[14] The omission of the pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although expressed in the Germ. Vers., is reckoned among the more established readings by the margin of both Editions.—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "AB omit ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Vulg. in some MSS. has “Deum.” Amiat. MS. has “invicem.” Vulg. makes ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let us love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", diligamus: not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Rec. Text has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with inferior authorities.—E.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We love.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "αὐτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is spurious, and is not to be understood: the love is again quite general. \"We have this principle of love.\" To take ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀγαπῶμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as subjunctive in the sense \"let us love\" is less forcible. St. John states as a fact what ought to be a fact. \"We Christians do not fear, but love. Yet this is no credit to us. After God's love in giving his Son for us it would be monstrous not to love.\" 1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We love Him (ἡμεῖς ἀγαπῶμεν αὐτὸν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The best texts omit Him. Some render let us love, as 1 John 4:7. The statement is general, relating to the entire operation of the principle of love. All human love is preceded and generated by the love of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The best texts omit Him. Some render let us love, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The statement is general, relating to the entire operation of the principle of love. All human love is preceded and generated by the love of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]