[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:7-13 The Spirit of God is the Spirit of love. He that does not love the image of God in his people, has no saving knowledge of God. For it is God's nature to be kind, and to give happiness. The law of God is love; and all would have been perfectly happy, had all obeyed it. The provision of the gospel, for the forgiveness of sin, and the salvation of sinners, consistently with God's glory and justice, shows that God is love. Mystery and darkness rest upon many things yet. God has so shown himself to be love, that we cannot come short of eternal happiness, unless through unbelief and impenitence, although strict justice would condemn us to hopeless misery, because we break our Creator's laws. None of our words or thoughts can do justice to the free, astonishing love of a holy God towards sinners, who could not profit or harm him, whom he might justly crush in a moment, and whose deserving of his vengeance was shown in the method by which they were saved, though he could by his almighty Word have created other worlds, with more perfect beings, if he had seen fit. Search we the whole universe for love in its most glorious displays? It is to be found in the person and the cross of Christ. Does love exist between God and sinners? Here was the origin, not that we loved God, but that he freely loved us. His love could not be designed to be fruitless upon us, and when its proper end and issue are gained and produced, it may be said to be perfected. So faith is perfected by its works. Thus it will appear that God dwells in us by his new-creating Spirit. A loving Christian is a perfect Christian; set him to any good duty, and he is perfect to it, he is expert at it. Love oils the wheels of his affections, and sets him on that which is helpful to his brethren. A man that goes about a business with ill will, always does it badly. That God dwells in us and we in him, were words too high for mortals to use, had not God put them before us. But how may it be known whether the testimony to this does proceed from the Holy Ghost? Those who are truly persuaded that they are the sons of God, cannot but call him Abba, Father. From love to him, they hate sin, and whatever disagrees with his will, and they have a sound and hearty desire to do his will. Such testimony is the testimony of the Holy Ghost.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that loveth not, knoweth not God - Has no true acquaintance with God; has no just views of him, and no right feelings toward him. The reason for this is implied in what is immediately stated, that \"God is love,\" and of course if they have no love reigning in their hearts, they cannot pretend to be like him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For God is love - He is not merely benevolent, he is benevolence itself. Compare the notes at 2 Corinthians 13:11. Never was a more important declaration made than this; never was more meaning crowded into a few words than in this short sentence - \"God is love.\" In the darkness of this world of sin - in all the sorrows that come now upon the race, and that will come upon the wicked hereafter - we have the assurance that a God of infinite benevolence rules over all; and though we may not be able to reconcile all that occurs with this declaration, or see how the things which he has permitted to take place are consistent with it, yet in the exercise of faith on his own declarations we may find consolation in \"believing\" that it is so, and may look forward to a period when all his universe shall see it to be so. In the midst of all that occurs on the earth of sadness, sin, and sorrow, there are abundant evidences that God is love.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For God is love - He is not merely benevolent, he is benevolence itself. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 13:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Never was a more important declaration made than this; never was more meaning crowded into a few words than in this short sentence - \"God is love.\" In the darkness of this world of sin - in all the sorrows that come now upon the race, and that will come upon the wicked hereafter - we have the assurance that a God of infinite benevolence rules over all; and though we may not be able to reconcile all that occurs with this declaration, or see how the things which he has permitted to take place are consistent with it, yet in the exercise of faith on his own declarations we may find consolation in \"believing\" that it is so, and may look forward to a period when all his universe shall see it to be so. In the midst of all that occurs on the earth of sadness, sin, and sorrow, there are abundant evidences that God is love.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the original structure of things before sin entered, when all was pronounced \"good;\" in the things designed to promote happiness, where the only thing contemplated is happiness, and where it would have been as easy to have caused pain; in the preservation of a guilty race, and in granting that race the opportunity of another trial; in the ceaseless provision which God is making in his providence for the wants of unnumbered millions of his creatures; in the arrangements made to alleviate sorrow, and to put an end to it; in the gift of a Saviour more than all, and in the offer of eternal life on terms simple and easy to be complied with - in all these things, which are the mere expressions of love, not one of which would have been found under the government of a malignant being, we see illustrations of the sublime and glorious sentiment before us, that \"God is love.\" Even in this world of confusion, disorder, and darkness, we have evidence sufficient to prove that he is benevolent, but the full glory and meaning of that truth will be seen only in heaven. Meantime, let us hold on to the truth that he is love. Let us believe that he sincerely desires our good, and that what seems dark to us may be designed for our welfare; and amidst all the sorrows and disappointments of the present life, let us feel that our interests and our destiny are in the hands of the God of love. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the original structure of things before sin entered, when all was pronounced \"good;\" in the things designed to promote happiness, where the only thing contemplated is happiness, and where it would have been as easy to have caused pain; in the preservation of a guilty race, and in granting that race the opportunity of another trial; in the ceaseless provision which God is making in his providence for the wants of unnumbered millions of his creatures; in the arrangements made to alleviate sorrow, and to put an end to it; in the gift of a Saviour more than all, and in the offer of eternal life on terms simple and easy to be complied with - in all these things, which are the mere expressions of love, not one of which would have been found under the government of a malignant being, we see illustrations of the sublime and glorious sentiment before us, that \"God is love.\" Even in this world of confusion, disorder, and darkness, we have evidence sufficient to prove that he is benevolent, but the full glory and meaning of that truth will be seen only in heaven. Meantime, let us hold on to the truth that he is love. Let us believe that he sincerely desires our good, and that what seems dark to us may be designed for our welfare; and amidst all the sorrows and disappointments of the present life, let us feel that our interests and our destiny are in the hands of the God of love. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. knoweth not—Greek aorist: not only knoweth not now, but never knew, has not once for all known God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God is love—There is no Greek article to love, but to God; therefore we cannot translate, Love is God. God is fundamentally and essentially LOVE: not merely is loving, for then John's argument would not stand; for the conclusion from the premises then would be this, This man is not loving: God is loving; therefore he knoweth not God IN SO FAR AS God is loving; still he might know Him in His other attributes. But when we take love as God's essence, the argument is sound: This man doth not love, and therefore knows not love: God is essentially love, therefore he knows not God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Yea, since love is his very nature, and that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is love, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those that love (upon the account and in the way above expressed) are born of him, partake from him that excellent and most delectable nature, know him by a transformative knowledge: but they that love not, they are mere strangers to him, and never had to do with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that loveth not, knoweth not God,.... If a man loves not the children of God, those that are born of him, he does not know, so as to love God, the Father of them; for to pretend love to God, the begetter of them, whom he sees not, and not love those who are begotten by him, and are visible objects of respect, is a contradiction, and cannot be reconciled: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This clause is left out in the Ethiopic version, and is transposed in the Syriac version, which reads the text thus, \"for God, is love, and whoever loveth not, knoweth not God\". By which reading, the following reason stands in close connection with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For God is love; he loves himself; there is an entire love between the three divine Persons, who are in the strictest, and in the most inconceivable and inexpressible manner affected to each other; their love is natural and essential: God loves all his creatures as such, nor does he hate any of them, as so considered; and he bears an everlasting, unchangeable, and invariable love to his elect in Christ Jesus; of which an instance is given in the following verses, and is a reason why the saints should love one another; that they might be like their heavenly Father, by whom they are begotten, and of whom they are born, and whose children they are; seeing he is love itself, and in his breast is nothing else but love. So the Shekinah is, by the Cabalistic Jews (t), called  \"love\". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Shirhashirim Rabba, fol. 15. 1. & Lex. Cabal. p. 43, 44. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Shirhashirim Rabba, fol. 15. 1. & Lex. Cabal. p. 43, 44. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He that loveth not knoweth not God; {8} for God is love.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He that loveth not knoweth not God; ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{8}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for God is love.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(8) A confirmation: for it is the nature of God to love men, of which we have a most manifest proof above all other, in that of his only free and infinite good will towards us his enemies, he delivered to death, not a common man, but his own Son, indeed his only begotten Son, to the end that we being reconciled through his blood might be partakers in his everlasting glory.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Conversely, a stranger to love is a stranger to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ ἔγνω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “did not get to know,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at the initial crisis of conversion. On ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knoweth not God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knew not God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. never attained to a knowledge of Him. This is a remarkable instance of S. John’s habit of not making the second part of an antithesis the exact counterpart of the first, but an advance beyond it. Instead of saying ‘is not born of God’ he says ‘never knew God’, which is much stronger. Not to have known love is not, to have known God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is the third of S. John’s great statements respecting the Nature of God: ‘God is Spirit’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ‘God is light’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and ‘God is love’. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, as in the other cases, the predicate has no article, and expresses not a quality which He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "possesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but one which embraces all that He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is clear from S. John’s argument. It does not follow, because God is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " love, that one who does not love cannot have known God: all that follows from this is that his knowledge of God is very incomplete. Only if God is love, i.e. if love is Himself, is the statement true, that to have no personal knowledge of love is to have no personal knowledge of God. And here we may remark that to attain by experience to a knowledge of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γινώσκειν τὸν Θεόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a very different thing from knowing something ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "about",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰδέναι τι περὶ αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Gnostics knew a good deal about God, but they did not know Him, for instead of loving those brethren who did not share their intellectual attainments, they had an arrogant contempt for them. They had recognised that ‘God is spirit’, and to some extent that ‘God is light’; for they knew Him to be an immaterial Being and the highest Intelligence: but they had wholly failed to appreciate that ‘God is love’. And yet of the three great truths this is the chief. The other two are incomplete without it. The first, ‘God is spirit’, is almost more negative than positive: God is not material; He ‘dwelleth not in temples made with hands’. The second might seem in making our idea of Him more definite to remove Him further away from us: God is perfect intelligence, perfect purity, perfect holiness. The third not only makes His Nature far more clearly known, but brings Him very close to us. The spirit is shewn to be personal, the light to have warmth and life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If no previous religion, not even the Jewish, had attained to the truth that ‘God is light’, still less had any attained to the truth that ‘God is love’. To the heathen world God is a powerful, a terrible, and often a cruel being; one whose fierce wrath needs to be deprecated and whose ill-will needs to be propitiated, rather than one on whose love men may rely. To the Jews He was a just and a jealous, if also a merciful God, of whose inmost being all that was known was I AM THAT I AM. To the Christian alone He is known as LOVE.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As already stated, this truth, God is love, dominates the second main division of the Epistle. In no ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in N. T. does the substantive ‘love’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγάπη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") occur so often as in these two and a half ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chapters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in no Book in N. T., excepting the Fourth Gospel, does the verb ‘to love’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγαπᾷν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") occur ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "half",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so many times as here. No wonder that the writer of this Epistle has been known in the Church as ‘the Apostle of Love’. “If nothing were said in praise of love throughout the pages of this Epistle, if nothing whatever throughout the other pages of the Scriptures, and this one thing only were all we were told by the voice of the Spirit of God, For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is Love;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nothing more ought we to require” (S. Augustine).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Οὐκ ἔγνω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knoweth not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Is not born of God, and knoweth not God.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ Θεὸς ἀγάπη ἐστὶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγάπη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without the article, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This brief sentence imparted to John, even during the mere time which he took in writing it, more delight than the whole world can impart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - In giving the opposite, St. John again varies the thought, this time very remarkably. Instead of \"love is of God\" (verse 7), we have \"God is Love\" - a far deeper thought; and instead of \"knoweth not God,\" we have \"knew not God,\" or, as we should say in English, \"hath not known\" or \"never knew God.\" The man's not loving his brother shows that in no real sense has he ever in the past known God: he is of the world (chapter 3:1), not of God. We must beware of watering down \"God is Love\" into \"God is loving,\" or even \"God of all beings is the most loving.\" Love is not a mere ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "attribute",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God; like light, it is his very ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As \"God is Light\" sums up the Being of God intellectually considered, so \"God is Love\" sums up the same on the moral side. Only when this strong meaning is given to the statement does St. John's argument hold, that \"he that loveth not knoweth not God.\" A man who has no idea of any one of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "attributes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God, as order, or beauty, or power, or justice, has an ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "imperfect",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " knowledge of God. But he who has no idea of love has no knowledge of God, for love is himself. God alone loves in the fullest and highest sense of the word; for he alone loves with perfect disinterestedness. It is love which alone can explain creation. Why should a Being perfectly blessed in himself create other beings, but to bestow a blessing upon them? 1 John 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Knoweth not (οὐκ ἔγνω)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The aroist tense: did not know, from the beginning. He never knew.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Is love (ἀγάπη ἐστίν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on God is light (1 John 1:5), and the truth (1 John 1:6); also God is spirit (John 4:24). Spirit and light are expressions of God's essential nature. Love is the expression of His personality corresponding to His nature. See on love of God (1 John 2:5). Truth and love stand related to each other. Loving is the condition of knowing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on God is light (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the truth (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); also God is spirit (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Spirit and light are expressions of God's essential nature. Love is the expression of His personality corresponding to His nature. See on love of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Truth and love stand related to each other. Loving is the condition of knowing. ",
            "children": []
          }
        ]
      }
    ]
  }
]