[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jesus saith unto him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There is no formal demand, or formal statement of faith as preceding the healing. (Comp., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Men have often wondered at this. If faith is an expression in words or anything outside man, then there is room for wonder; but if it be a living principle, the “seeing Him who is invisible” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), then surely we may seek in vain for a more striking instance of its power than in this man; who in all, and through all, and in spite of all, trusted in, and looked for, the mercy of God, and had faith to be healed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jesus sees in him this receptive power, which in his very helplessness is strength, and calls it forth. He who could barely move is told to rise! he who had for eight-and-thirty years lain on his bed is to carry that bed and walk!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE THIRD MIRACLE IN JOHN’S GOSPELJohn 5:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE THIRD MIRACLE IN JOHN’S GOSPEL",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This third of the miracles recorded in John’s Gospel finds a place there, as it would appear, for two reasons: first, because it marks the beginning of the angry unbelief on the part of the Jewish rulers, the development of which it is one part of the purpose of this Gospel to trace; second, because it is the occasion for that great utterance of our Lord about His Sonship and His divine working as the Father also works, which occupies the whole of the rest of the chapter, and is the foundation of much which follows in the Gospel. It is for these reasons, and not for the mere sake of adding another story of a miraculous cure to the many which the other Evangelists have given us, that John narrates for us this history.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If, then, we consider the reason for the introduction of the miracle into the Gospel, we may be saved from the necessity of dwelling, except very lightly, upon some of the preliminary details which preceded the actual cure. It does not matter much to us for our present purpose which Feast it was on which Jesus went up to Jerusalem, nor whether the pool was by the sheep-market or by the sheep-gate, nor whereabouts in Jerusalem Bethesda might happen to be. It may be of importance for us to notice that the mention of the angel who appears in the fourth verse is not a part of the original narrative. The true text only tells us of an intermittent pool which possessed, or was supposed to possess, curative energy; and round which the kindness of some forgotten benefactor had built five rude porches. There lay a crowd of wasted forms, and pale, sorrowful faces, with all varieties of pain and emaciation and impotence marked upon them, who yet were gathered in Bethesda, which being interpreted means ‘a house of mercy.’ It is the type of a world full of men suffering various sicknesses, but all sick; the type of a world that gathers with an eagerness, not far removed from despair, round anything that seems to promise, however vaguely, to help and to heal; the type of a world, blessed be God, which, amidst all its sad variety of woe and weariness, yet sits in the porches of ‘a house of mercy,’ and has in the midst a ‘fountain opened for sin and for uncleanness,’ whose energy is as mighty for the last comer of all the generations as for the first that stepped into its cleansing flood.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This poor man, sick and impotent for eight and thirty years-many of which he had spent, as it would appear, day by day, wearily dragging his paralysed limbs to the fountain with daily diminishing hope-this poor man attracts the regard of Christ when He enters, and He puts to him the strange question, ‘Wilt thou be made whole?’ Surely there was no need to ask that; but no doubt the many disappointments and the long years of waiting and of suffering had stamped apathy upon the sufferer’s face, and Christ saw that the first thing that was needed, in order that His healing power might have a point of contact in the man’s nature, was to kindle some little flicker of hope in him once more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, no doubt, with a smile on His face, which converted the question into an offer, He says: ‘Wilt thou be made whole?’ meaning thereby to say, ‘I will heal thee if thou wilt.’ And there comes the weary answer, as if the man had said: ‘Will I be made whole? What have I been lying here all these years for? I have nobody to put me into the pool.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Yes, it is a hopeful prospect to hold out to a man whose disease is inability to walk, that if he will walk to the water he will get cured, and be able to walk afterwards. Why, he could not even roll himself into the pond, and so there he had lain, a type of the hopeless efforts at self-healing which we sick men put forth, a type of the tantalising gospels which the world preaches to its subjects when it says to a paralysed man: ‘Walk that you may be healed; keep the commandments that you may enter into life.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so we have come at last to the main point of the narrative before us, and I fix upon these words, the actual words in which the cure was conveyed, as communicating to us some very important lessons and thoughts about Christ and our relation to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, I see in them Christ manifesting Himself as the Giver of power to the powerless who trust Him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, I see in them Christ manifesting Himself as the Giver of power to the powerless who trust Him.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "His words may seem at first hearing to partake of the very same almost cruel irony as the condition of cure which had already proved hopelessly impracticable. He, too, says, ‘Walk that you may be cured’; and He says it to a paralysed and impotent man. But the two things are very different, for before this cripple could attempt to drag his impotent limbs into an upright position, and take up the little light couch and sling it over his shoulders, he must have had some kind of trust in the person that told him to do so. A very ignorant trust, no doubt, it was; but all that was set before him about Jesus Christ he grasped and rested upon. He only knew Him as a Healer, and he trusted Him as such. The contents of a man’s faith have nothing to do with the reality of his faith; and he that, having only had the healing power of Christ revealed to him, lays hold of that Healer, cleaves to Him with as genuine a faith as the man who has the whole fulness and sublimity of Christ’s divine and human character and redeeming work laid out before him, and who cleaves to these. The hand that grasps is one, whatsoever be the thing that it grasps.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So it is no spiritualising of this story, or reading into it a deeper and more religious meaning than belongs to it, to say that what passed in that man’s heart and mind before he caught up his little bed and walked away with it, was essentially the same action of mind and heart by which a sinful man, who knows that Christ is his Redeemer, grasps His Cross and trusts his soul to Him. In the one case, as in the other, there is confidence in the person; only in the one case the person was only known as a Healer, and in the other the person is known as a Saviour. But the faith is the same whatever it apprehends.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ comes and says to him, ‘Rise, take up thy bed and walk.’ There is a movement of confidence in the man’s heart; he tries to obey, and in the act of obedience the power comes to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brother! it is always so. All Christ’s commandments are gifts. When He says to you, ‘Do this!’ He pledges Himself to give you power to do it. Whatsoever He enjoins He strengthens for. He binds Himself, by His commandments, and every word of His lips which says to us ‘Thou shalt!’ contains as its kernel a word of His which says ‘I will.’ So when He commands, He bestows; and we get the power to keep His commandments when in humble faith we make the effort to do His will. It is only when we try to obey for the love’s sake of Him that has healed us that we are able to obey. And be sure of this, whensoever we attempt to do what we know to be the Master’s will, because He has given Himself for us, our power will be equal to our desire, and enough for our duty. As St. Augustine says: ‘Give what Thou commandest, and command what Thou wilt.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Rise, take up thy bed and walk,’ or as in another case, ‘Stretch forth thy hand.’ ‘And he stretched it forth, and his hand was restored whole as the other.’ Christ gives power to keep His commandments to the impotent who try to obey, because they have been healed by Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. In the next place, we have in this miracle our Lord set forth as the absolute Master, because He is the Healer. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. In the next place, we have in this miracle our Lord set forth as the absolute Master, because He is the Healer.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Pharisees and their friends had no eyes for the miracle; but if they found a man carrying his light couch on the Sabbath day, that was a thing that excited their interest, and must be seen to immediately.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, paying no attention to the fact that it was a paralysed man who was doing this, with the true narrow instinct of the formalist, they lay hold only of the fact of the broken Rabbinical restrictions, and try to stop him with these. ‘It is the Sabbath day! It is not lawful for thee to carry thy bed.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And they get an answer which goes a great deal deeper than the speaker knew, and puts the whole subject of Christian obedience on its right footing. ‘He answered them, He that made me whole, the same said unto me, Take up thy bed and walk.’ As if he had said: ‘He gave me the power, had He not a right to tell me what to do with it? It was His gift that I could lift my bed; was I not bound to walk when and where He that had made me able to walk at all chose to bid me?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if you generalise that it just comes to this: the only person that has a right to command you is the Christ who saves you. He has the absolute authority to do as He will with your restored spiritual powers, because He has bestowed them all upon you. His dominion is built upon His benefits. He is the King because He is the Saviour. He rules because He has redeemed. He begins with giving, and it is only afterwards that He commands; and He turns to each of us with that smile upon His lips, and with tenderness in His voice which will bind any man, who is not an ingrate, to Him for ever. ‘If ye love Me, keep My commandments.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is always something hard and distasteful to the individual will in the tone of authority assumed by any man whatsoever. We always more or less rebel and shrink from that; and there is only one thing that makes commandment sweet, and that is when it drops like honey from the honeycomb, from lips that we love. So does it in the case of Christ’s commands to us. It is joy to know and to do the will of One to whom the whole heart turns with gratitude and affection. And Christ blesses and privileges us by the communication to us of His pleasure concerning us, that we may have the gladness of yielding to His desires, and so meeting the love which commands with the happy love which obeys. ‘He that made me whole, the same said unto me . . . ‘ and what He says it must be joy to do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, ‘My yoke is easy and My burden is light,’ not because Christ diminishes the requirements of law; not because the standard of Christian obedience is lowered beneath any other standard of conduct and character. It is far higher. The things which make Christian duty are often very painful in themselves. There is always self-sacrifice in Christian virtue, and self-sacrifice has always a sting in it; but the ‘yoke is easy and the burden is light,’ because, if I may so say, the yoke is padded with the softest velvet of love, and lies upon our necks lightly because He has laid it there. All the rigid harshness of precept is done away when the precept comes from Christ’s lips, and His commandment ‘makes the crooked things straight and the rough places plain’; and turns duty, distasteful duty, into joyful service. The blessed basis of Christian obedience, and of Christ’s authority, is Christ’s redemption.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And then, still further, we have here our Lord setting Himself forth as the divine Son, whose working needs and knows no rest. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And then, still further, we have here our Lord setting Himself forth as the divine Son, whose working needs and knows no rest.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We find, in the subsequent part of the chapter, that ‘the Jews,’ as they are called, by which is meant the antagonistic portion of the nation, sought to slay Christ ‘because He had done these things on the Sabbath day.’ But Jesus answered them, ‘My Father worketh hitherto, and I work.’ Unquestionably the form which the healing took was intended by our Lord to bring into prominence the very point which these pedantic casuists laid hold of. He meant to draw attention to His sweeping aside of the Rabbinical casuistries of the law of the Sabbath. And He meant to do it in order that He might have the occasion of making this mighty claim, which is lodged in these solemn and profound words, to possess a Sonship, which, like the divine working, wrought, needing and knowing no repose.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘My Father worketh hitherto, and I work.’ The rest, which the old story in Genesis attributed to the Creator after the Creation, was not to be construed as if it meant the rest of inactivity; but it was the rest of continuous action. God’s rest and God’s work are one. Throughout all the ages preservation is a continuous creation. The divine energy is streaming out for evermore, as the bush that burns unconsumed, as the sun that flames undiminished for ever, pouring out from the depth of that divine nature, and for ever sustaining a universe. So that there is no Sabbath, in the sense of a cessation from action, proper to the divine nature; because all His action is repose, and ‘e’en in His very motion there is rest.’ And this divine coincidence of activity and of repose belongs to the divine Son in His divine-human nature. With that arrogance which is the very audacity of blasphemy, if it be not the simplicity of a divine consciousness, He puts His own work side by side with the Father’s work, as the same in principle, the same in method, the same in purpose, the same in its majestic coincidence of repose and of energy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘My Father worketh hitherto, and I work. Therefore for Me, as for Him, there is no need of a Sabbath of repose.’ Human activity is dissipated by toil, human energy is exhausted by expenditure. Man works and is weary; man works and is distracted. For the recovery of the serenity of his spirit, and for the renewal of his physical strength, repose of body and gathering in of mind, such as the Sabbath brought, were needed; but neither is needed for Him who toils unwearied in the heavens; and neither is needed for the divine nature of Him who labours in labours parallel with the Father’s here upon the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now remember that this is no abolition of the Sabbatic rest for Christ’s followers. Rather the ground on which He here asserts His superiority over, and His non-dependence upon, such a repose shows, or at all events implies, that all mere human workers need such rest, and should thankfully accept it. But it is a claim on His part to a divine equality. It is a claim on His part to do works which are other than human works. It is a claim on His part to be the Lord of a divine institution, living above the need of it, and able to mould it at His will.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so it opens up depths, into which we cannot go now, of the relations of that divine Father and that divine Son; and makes us feel that the little incident in which He turned to a paralysed man and said: ‘Rise, take up thy bed and walk,’ on the Sabbath day, like some small floating leaf of sea-weed upon the surface, has great deep tendrils that go down and down into the very abyss of things, and lays hold upon that central truth of Christianity, the divinity of the Son of God, who is One with the ever-working Father.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. Lastly, we have in this incident yet another lesson. We have the Healer who is also the Judge, warning the healed of the possibilities of a relapse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. Lastly, we have in this incident yet another lesson. We have the Healer who is also the Judge, warning the healed of the possibilities of a relapse.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Jesus findeth him in the Temple, and said unto him, Behold, thou art made whole: sin no more, lest a worse thing come unto thee.’ The man’s eight-and-thirty years of illness had apparently been brought on by dissipation. It was a sin of flesh, avenged in the flesh, that had given him that miserable life. One would have thought he had got warning enough, but we all know the old proverb about what happened when the devil was ill, and what befell his resolutions when he got better. And so Christ comes to him again with this solemn warning: ‘There is a worse thing than eight-and-thirty years of paralysis. You fell once, and sore was your punishment. If you fall twice, your punishment will be sorer.’ Why? Because the first one had done him no good. So here are lessons for us. There is always danger that we shall fall back into old sins, even if we think we have overcome them. The mystic influence of habit, enfeebled will, the familiar temptation, the imagination rebelling, the memory tempting, sometimes even, as in the case of a man that has been a drunkard, the physical effect of the odour of his temptation upon his nostrils-all these things make it extremely unlikely that a man who has once been under the condemnation of any evil shall never be tempted to fall under its sway again.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And such a fall is not only more criminal than the former, it is more deadly than the former. ‘It were better for them not to have known the way of righteousness, than after they have known it to turn aside.’ ‘The last state of that man is worse than the first.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My brother, there is no blacker condemnation; and if I may use a strong word, there is no hotter hell, than that which belongs to an apostate Christian. ‘It has happened unto them according to the true proverb. The dog is turned to his vomit again.’ Very unpolite, a very coarse metaphor? Yes; to express a far worse reality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christian men and women! you have been made whole. ‘Sin no more, lest a worse thing come unto you.’ And turn to that Lord and say, ‘Hold Thou me up and I shall be saved.’ Then the enemies will not be able to recapture you, and the chains which have dropped from your wrists will never enclose them any more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 5:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus saith, Rise, take up thy bed, and walk ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— A strange command to be given to an impotent man, that had been long disabled; but this divine word was to be the vehicle of a divine power; it was a command to the disease to be gone, to nature to be strong. But it is expressed as a command to him to exert himself. He must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rise and walk, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, attempt to do so, and, in the essay, he shall receive strength. Thus the conversion of a sinner is the cure of a chronical disease, and is ordinarily effected by the word, a word of command; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arise and walk; turn and live; make ye a new heart: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but this no more supposes a power in us to obey such commands, without the grace of God, than these words of Christ supposed such a power in the impotent man. But if he had not attempted to help himself, he would not have been cured, but must have borne the blame of his continuing to be weak and helpless. Christ commanded him to take up his bed, 1st, That it might be evident a perfect cure was wrought, and that miraculously; for the man did not recover strength by degrees, but from the extremity of weakness, he suddenly stepped into the highest degree of bodily strength; so that he was able to carry as great a load as any porter, who had been as long used to carry burdens as he had been unaccustomed to any thing of the kind. 2d, Christ intended hereby to proclaim the cure, and make it public: for as it was the sabbath day, by carrying a burden through the streets he made himself very remarkable, and every one would inquire why he did it, by which means the notice of the miracle would spread, to the honour of God. 3d, Christ intended thus to witness against the traditions of the elders, who had stretched the law of the sabbath beyond its intention; and likewise to show, that he was Lord of the sabbath, and had power to make what alterations he pleased respecting it, and to overrule the law. The case may be such, that it may become a work of necessity, or mercy, to carry a bed on the sabbath day; but here it was more; it was a work of piety, being designed purely for the glory of God. 4th, He meant hereby to try the faith and obedience of his patient, who, by carrying his bed, would publicly expose himself to the censure of the ecclesiastical court, and become liable, at least, to be scourged in the synagogue. Now will he venture to subject himself to this reproach and suffering in obedience to Christ? Yes, he will. Those that have been healed by Christ’s word, ought to be ruled by his word, whatever it may cost them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-9 We are all by nature impotent folk in spiritual things, blind, halt, and withered; but full provision is made for our cure, if we attend to it. An angel went down, and troubled the water; and what disease soever it was, this water cured it, but only he that first stepped in had benefit. This teaches us to be careful, that we let not a season slip which may never return. The man had lost the use of his limbs thirty-eight years. Shall we, who perhaps for many years have scarcely known what it has been to be a day sick, complain of one wearisome night, when many others, better than we, have scarcely known what it has been to be a day well? Christ singled this one out from the rest. Those long in affliction, may comfort themselves that God keeps account how long. Observe, this man speaks of the unkindness of those about him, without any peevish reflections. As we should be thankful, so we should be patient. Our Lord Jesus cures him, though he neither asked nor thought of it. Arise, and walk. God's command, Turn and live; Make ye a new heart; no more supposes power in us without the grace of God, his distinguishing grace, than this command supposed such power in the impotent man: it was by the power of Christ, and he must have all the glory. What a joyful surprise to the poor cripple, to find himself of a sudden so easy, so strong, so able to help himself! The proof of spiritual cure, is our rising and walking. Has Christ healed our spiritual diseases, let us go wherever he sends us, and take up whatever he lays upon us; and walk before him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rise, take up ... - Jesus not only restored him to health, but he gave evidence to those around him that this was a real miracle. and that he was really healed. For almost 40 years he had been afflicted. He was not even able to walk. Jesus commanded him not only to \"walk,\" but to take up his \"bed\" also, and carry that as proof that he was truly made whole. In regard to this we may observe,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That it was a remarkable command. The poor man had been sick for a long time, and it does not appear that he expected to be healed except by being put into the waters. Yet Jesus, when he gives a commandment, can give strength to obey it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. It is our business to obey the commands of Jesus, however feeble we feel ourselves to be. His grace will be sufficient for us, and his burden will be light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. The weak and helpless sinner should put forth his efforts in obedience to the command of Jesus. Never was a sinner more helpless than was this man. If God gave him strength to do his will, so he can all others; and the plea that we can do nothing could have been urged with far more propriety by this man than it can be by any impenitent sinner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. This narrative should not be abused. It should not be supposed as intended to teach that a sinner should delay repentance, as if \"waiting for God.\" The narrative neither teaches nor implies \"any such thing.\" It is a simple record of a fact in regard to a man who had no power to heal himself, and who was under no obligation to heal himself. There is no reference in the narrative to the difficulties of a sinner - no intimation that it was intended to refer to his condition; and to make this example an excuse for delay, or an argument for waiting, is to abuse and pervert the Bible. Seldom is more mischief done than by attempting to draw from the Bible what it was not intended to teach, and by an effort to make that convey spiritual instruction which God has not declared designed for that purpose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy bed - Thy couch; or the mattress or clothes on which he lay. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thy bed - Thy couch; or the mattress or clothes on which he lay. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. Rise, take up thy bed, &c.—\"Immediately\" he did so. \"He spake and it was done.\" The slinging of his portable couch over his shoulders was designed to show the perfection of the cure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Our Lord will let this poor man know, that the waters and the angel derived their power from him; and that he with a word could do as much for him, as the waters troubled by the angel could effect: he therefore bids him arise, and take up his bed and walk, that others might see and be assured that he was perfectly cured. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jesus saith to him, rise,.... From thy bed, or couch, on which he lay in one of the porches: and ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "take up thy bed and walk; these words were spoken by the same power, as those to Lazarus, which called him out of his grave; as appears from the effect they had upon the man, who was in himself impotent, weak, and helpless. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "take up thy bed and walk; these words were spoken by the same power, as those to Lazarus, which called him out of his grave; as appears from the effect they had upon the man, who was in himself impotent, weak, and helpless. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Jesus saith unto him, Rise, take up thy bed, and walk.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "περιπάτει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "walk, go;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hitherto he had lain down there, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The command implies the man’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which had been recognised by Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ᾖρε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] simply and emphatically told in the very words which Jesus had spoken.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Some (Strauss) quite arbitrarily regard this story as a legendary exaggeration of the healing of the paralytic in the Synoptics (Matthew 9; Mark 2); time, place, circumstances, and what ensues, especially its essential connection with the healing on the Sabbath-day, are all original and independent, as is also the whole account, so full of life and psychologically true, and very different from that in the Synoptics. Notwithstanding, Baur again (p. 243 ff.) would make the story in John a composition out of synoptical materials, appealing especially to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Hilgenfeld, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Evang",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 269 f., adopts the same course, finding the “inner peculiarity” of the narrative in the idea that the omnipotence of the Logos cannot be controlled by any earthly law or human custom; whilst Weisse (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Evangelienfr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 268) sees in the man’s lameness the helplessness of one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "morally",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sick, and attributes the origin of the entire narrative to what was originally a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "parable",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "themselves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " complete the fiction, and then pass it on off the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evangelist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", while the simplest as well as the most distinctive and characteristic historical features are now interwoven into his supposed plans. See, on the contrary, Brückner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The impotent man having declared his helplessness, Jesus says to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἔγειρε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a command to be obeyed on the moment by faith in Him who gave it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Augustine’s “Da quod jubes, et jube quod vis”. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἆρον τὸν κράββατόν σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “take up your pallet”. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κράββατος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the Latin ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grabatus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and is late Greek; see Rutherford’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "New Phryn.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 137; and McLellan’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Greek Test.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 106, for references and anecdote. He was commanded to take up his bed that he might recognise that the cure was permanent. No doubt many of the cures at the pool were merely temporary. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "περιπάτει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “walk,” ability was given not merely to rise, but to walk. The cures wrought by Christ are perfect, and do not only give some relief.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rise, take up thy bed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As in the case of the paralytic (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Christ makes no enquiry as to the man’s faith. Christ knew that he had faith; and the man’s attempting to rise and carry his bed after 38 years of impotency was an open confession of faith. His bed would probably be only a mat or rug, still common in the East.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is scarcely necessary to discuss whether this miracle can be identical with the healing of the paralytic let down through the roof (Matthew 9; Mark 2; Luke 5). Time, place, details and context are all different, especially the important point that this miracle was wrought on the Sabbath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἔγειραι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Jesus heals the sick man, without entering the pool. He was therefore greater than the angel.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ᾆρον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "take up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This work, which was the more conspicuous on the Sabbath day, tended to the greater glory of God in Jesus Christ; [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "also it tended to remove the error of the Jews, especially of their doctors, concerning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Sabbath.—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Harm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 182.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus smith to him, Rise, take up thy bed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κράββατόν σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - thy mattress or pallet; the word is said to be of Macedonian origin, it is Latinized in the Vulgate into ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "grabbatus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and is not unfrequently found in the New Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:4, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the ordinary Greek word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σκίμπους σκιμπόδον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and walk.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These are in part the identical words which Jesus addressed to the paralytic (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He did not touch him or use any other means than his own life-giving word to confer the cure. He put forth, in royal might and spontaneous unsolicited exertion, the miraculous force.  The energy of the Lord's will mastered the palsied will of the sick man, and infused into him the lacking energy. Archdeacon Watkins supposes that the man did possess incipient and recipient faith, moved by the generous tenderness and sympathetic interest of the Stranger in his ease. The very striking fact mentioned in the synoptic cure of the paralytic, viz. that he was borne into the presence of Jesus by four friends, ought to have prevented Thoma's caricature of criticism, which makes this narrative a mere idealization of that. John 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bed (κράββατον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Used by both Mark and Luke. See on Mark 2:4, and compare Acts 5:15; Acts 9:33. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Used by both Mark and Luke. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 5:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]