[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Faithfulness . . . righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The first word recalls the covenant promise, the second the faith, expressed so frequently, on which the covenant rested, that the Judge of all the world must do right. St. John founds the appeal for forgiveness on the same pair of Divine qualities (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1John 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 143:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In thy faithfulness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "According to thy true and faithful promises, made to the penitent who apply to thee for pardon and aid; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answer me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Grant my earnest request; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and in thy righteousness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whereby thou art inclined and engaged by promise to favour righteous persons and just causes. Or, the word, here rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may signify ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it often does; for “God’s promises are only conditional, and our sins and frailties are so many, that we have always need of God’s mercy to make us capable of being reputed of the number of those who have complied with the conditions annexed to the promises.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And enter not into judgment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As if he had said, When I appeal to thy righteousness, I do not do it under an idea that I can justify myself upon a strict trial at the tribunal of thy justice; for I know, if thou shouldst rigorously examine all the tempers and affections of my heart, and actions of my life, I should certainly be condemned by thee to wrath and punishment; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for in thy sight shall no man living be justified — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, according to thy holy and righteous law, and upon the terms of strict justice, without thy indulgence and infinite mercy. Observe well, reader, no man, in order to his justification before God, can plead innocence or his own righteousness; either that he has not sinned, or that he does not deserve to die for his sins; nor must he suppose that he has any satisfaction of his own to offer. Whoever expects to be justified, must look for that inestimable blessing, followed by peace with God, adoption into his family, and a title to life eternal, as an act of pure grace, a free and undeserved gift from the divine mercy, to be conferred upon the penitent and believing, through the redemption which is in Christ Jesus: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 3:9-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "143:1-6 We have no righteousness of our own to plead, therefore must plead God's righteousness, and the word of promise which he has freely given us, and caused us to hope in. David, before he prays for the removal of his trouble, prays for the pardon of his sin, and depends upon mercy alone for it. He bemoans the weight upon his mind from outward troubles. But he looks back, and remembers God's former appearance for his afflicted people, and for him in particular. He looks round, and notices the works of God. The more we consider the power of God, the less we shall fear the face or force of man. He looks up with earnest desires towards God and his favour. This is the best course we can take, when our spirits are overwhelmed. The believer will not forget, that in his best actions he is a sinner. Meditation and prayer will recover us from distresses; and then the mourning soul strives to return to the Lord as the infant stretches out its hands to the indulgent mother, and thirsts for his consolations as the parched ground for refreshing rain.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear my prayer, O Lord, give ear ... - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In thy faithfulness answer me - That is, Show thy faithfulness to thy promises. God had made gracious promises to David (compare Psalm 89:19-37), and he now pleads that he would remember those promises, and accomplish in his behalf what he had said he would. God has also made gracious promises to his people, and they may always plead those promises as a reason why they should be heard, and why their prayers should be answered.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In thy faithfulness answer me - That is, Show thy faithfulness to thy promises. God had made gracious promises to David (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:19-37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and he now pleads that he would remember those promises, and accomplish in his behalf what he had said he would. God has also made gracious promises to his people, and they may always plead those promises as a reason why they should be heard, and why their prayers should be answered.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And in thy righteousness - Compare Psalm 31:1. In thy disposition to do right; to vindicate a righteous cause; to interpose when wrong is done. We, though sinners before God, may feel that our cause is a just one as toward our fellowmen, and, when wronged, we may ask God to interpose, as a righteous God, in our behalf. We cannot, however, ask him to save us on the ground of our righteousness toward him, for we have no such righteousness. See Psalm 143:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And in thy righteousness - Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In thy disposition to do right; to vindicate a righteous cause; to interpose when wrong is done. We, though sinners before God, may feel that our cause is a just one as toward our fellowmen, and, when wronged, we may ask God to interpose, as a righteous God, in our behalf. We cannot, however, ask him to save us on the ground of our righteousness toward him, for we have no such righteousness. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 143",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 143:1-12. In structure and style, like the preceding (Psalms 104-142), this Psalm is clearly evinced to be David's. It is a prayer for pardon, and for relief from enemies; afflictions, as usual, producing confession and penitence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. in thy faithfulness … and … righteousness—or, God's regard to the claims which He has permitted His people to make in His covenant.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. in thy faithfulness … and … righteousness—or, God's regard to the claims which He has permitted His people to make in His covenant.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Hear my prayer, O Lord, give ear to my supplications; in thy faithfulness answer me, and in thy righteousness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 And enter not into judgment with thy servant, for in thy sight shall no man living be justified.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 For the enemy hath persecuted my soul; he hath smitten my life down to the ground; he hath made me to dwell in darkness, as those that have been long dead.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Therefore is my spirit overwhelmed within me; my heart within me is desolate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 I remember the days of old; I meditate on all thy works; I muse on the work of thy hands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 I stretch forth my hands unto thee - my soul thirsteth after thee, as a thirsty land. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 143:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Hear my prayer, O Lord, give ear to my supplication.\" In the preceding Psalm he began by declaring that he had cried unto the Lord; here he begs to be favourably regarded by Jehovah the living God, whose memorial is that he heareth prayer. He knew that Jehovah did hear prayer, and therefore he entreated him to hear his supplication, however feeble and broken it might be. In two forms - he implores the one blessing of gracious audience, \"hear and give ear.\" Gracious men are so eager to be heard in prayer that they double their entreaties for that boon. The Psalmist desires to be heard and to be considered; hence he cries, \"hear,\" and then \"give ear.\" Our case is difficult, and we plead for special attention. Here it is probable that David wished his suit against his adversaries to be heard by the righteous Judge; confident that if he had a hearing in the matter whereof he was slanderously accused, he would be triumphantly acquitted. Yet while somewhat inclined thus to lay his case before the Court of King's Bench, he prefers rather to turn it all into a petition, and present it before the Court of Requests, hence he cries rather \"hear my prayer\" than \"hear my suit.\" Indeed David is specially earnest that he himself, and the whole of his life, may not become the subject of trial, for in that event he could not hope for acquittal. Observe that he offered so much pleading that his life became one continual prayer; but that petitioning was so varied in form that it-roke out in many supplications.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"In thy faithfulness answer me, and in thy righteousness.\" Saints desire to be answered as well as heard: they long to find the Lord faithful to his promise and righteous in defending the cause of justice. It is a happy thing when we dare appeal even to righteousness for our deliverance; and this we can do upon gospel principles, for \"if we confess our sins he is faithful and just to forgive us our sins.\" Even the sterner attributes of God are upon the side of the man who humbly trusts, and turns his trust into prayer. It is a sign of our safety when our interests and those of righteousness are blended. With God's faithfulness and righteousness upon our side we are guarded on the right hand and on the left. These are active attributes, and fully equal to the answering of any prayer which it would be right to answer. Requests which do not appeal to either of these attributes it would not be for he glory of God to hear, for they must contain desires for things unpromised, and unrighteous.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 143:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And enter not into judgment with thy servant.\" He had entreated for audience at the mercy-seat, but he has no wish to appear before the judgment-seat. Though clear before men, he could not claim innocence before God. Even though he knew himself to be the Lord's servant, yet he did not claim perfection, or plead merit; for even as a servant he was unprofitable. If such be the humble cry of a servant, what ought to be the pleading of a sinner? \"For in thy sight shall no man living be justified.\" None can stand before God upon the footing of the law. God's sight is piercing and discriminating; the slightest flaw is seen and judged; and therefore pretence and profession cannot avail where that glance reads all the secrets of the soul. In this verse David told out the doctrine of universal condemnation by the law long before Paul had taken his pen to write the same truth. To this day it stands true even to the same extent as in David's day, no man living even at this moment may dare to present himself for trial before the throne of the Great King on the footing of the law. This foolish age has produced specimens of a pride so rank that men have dared to claim perfection in the flesh; but these vain-glorious boasters are no exception to the rule here laid down: they are but men, and poor specimens of men. When their lives are examined they are frequently found to be more faulty than the humble penitents before whom they vaunt their superiority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 143:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For the enemy hath persecuted my soul.\" He has followed me up with perseverance, and has worried me as often as I have been within his reach. The attack was upon the soul or life of the Psalmist: our adversaries mean us the worst possible evil, their attacks are no child's play, they hunt for the precious life. \"He hath smitten my life down to the ground.\" The existence of David was made bitter by the cruelty of his enemy; he was as one who was hurled down and made to lie upon the ground, where he could be trampled on by his assailant. Slander has a very depressing effect upon the spirits; it is a blow which overthrows the mind as though it were knocked down with the fist. \"He hath made me to dwell in darkness, as those that have been long dead.\" The enemy was not content with felling his life to the ground - he would lay him lower still, even in the grave; and lower than that if possible, for the enemy would shut up the saint in the darkness of hell if he could. David was driven by Saul's animosity to haunt caverns and holes, like an unquiet ghost; he wandered out by night, and lay hid by day like an uneasy spirit which had long been denied the repose of the grave. Good men began to forget him, as though he had been long dead; and bad men made ridicule of his rueful visage, as though it belonged not to a living man, but was dark with the shadow of the sepulchre. Poor David! He was qualified to bless the house of the living, but he was driven to consort with the dead! Such may be our case, and yet we may be very dear to the Lord. One thing is certain, the Lord who permits us to dwell in darkness among the dead, will surely bring us into light, and cause us to dwell with those who enjoy life eternal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 143:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT This Psalm is much of the same nature with the former, and seems to have been composed much about the same time, and upon the like occasion. This is the last of those which are called penitential Psalms, the former being Psalm 6 Psa 32 Psa 38 Psa 51 Psa 102 Psa 130. The psalmist prayeth that God in faithfulness would hear him, and not enter into Judgment with him, Psalm 143:1,2; complaineth of his persecuting enemies, Psalm 143:3,4; praying also for speedy deliverance; instruction in God’s ways, and the destruction of his enemies, Psalm 143:5-12.  Whereby thou art inclined and engaged to favour righteous persons and just causes. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm is much of the same nature with the former, and seems to have been composed much about the same time, and upon the like occasion. This is the last of those which are called penitential Psalms, the former being ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 6 Psa 32 Psa 38 Psa 51 Psa 102 Psa 130",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The psalmist prayeth that God in faithfulness would hear him, and not enter into Judgment with him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 143:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; complaineth of his persecuting enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 143:3,4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; praying also for speedy deliverance; instruction in God’s ways, and the destruction of his enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 143:5-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Whereby thou art inclined and engaged to favour righteous persons and just causes. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear my prayer, O Lord, give ear to my supplications,.... With these requests David begins the psalm; for it was to no purpose to pray and were heard; and for which he always appears to be concerned, as every good man will, and not to be heard only, but to be answered, as follows; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in thy faithfulness answer me, and in thy righteousness; he does not plead his own faith, with which he believed in God, as rama interprets it; though the prayer of faith is very effectual; but the faithfulness of God to his promises; he had promised to hear, answer, and deliver such as called on him in a time of trouble; and he is faithful that has promised, nor will he suffer his faithfulness to fail; he cannot deny himself; and on this the psalmist relied for an answer, as well as desired and expected it; not on account of his own righteousness, but either on account of the goodness and grace of God, sometimes designed by righteousness, or because of the righteousness of Christ, or for the sake of Christ, the Lord our righteousness; on whose account God is just and faithful to forgive sin, the blessing the psalmist wanted, as appears from Psalm 143:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in thy faithfulness answer me, and in thy righteousness; he does not plead his own faith, with which he believed in God, as rama interprets it; though the prayer of faith is very effectual; but the faithfulness of God to his promises; he had promised to hear, answer, and deliver such as called on him in a time of trouble; and he is faithful that has promised, nor will he suffer his faithfulness to fail; he cannot deny himself; and on this the psalmist relied for an answer, as well as desired and expected it; not on account of his own righteousness, but either on account of the goodness and grace of God, sometimes designed by righteousness, or because of the righteousness of Christ, or for the sake of Christ, the Lord our righteousness; on whose account God is just and faithful to forgive sin, the blessing the psalmist wanted, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<> Hear my prayer, O LORD, give ear to my supplications: {a} in thy faithfulness answer me, and in thy {b} righteousness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "> Hear my prayer, O LORD, give ear to my supplications: {a} in thy faithfulness answer me, and in thy {b} righteousness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) That is, as you have promised to be faithful in your promise to all who trust in you.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "(a) That is, as you have promised to be faithful in your promise to all who trust in you.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) That is, according to your free goodness, by which you defend your own.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "(b) That is, according to your free goodness, by which you defend your own.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At first sight it seems inconsistent that the Psalmist should appeal to Jehovah’s righteousness, and yet (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 143:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") deprecate being put on his trial. But Jehovah’s righteousness here denotes His unvarying conformity to His own character, that absolute perfection of dealing which is the perpetual expression of His unchanging Will. Similarly His faithfulness is the attribute which makes it impossible that He should be false to the covenant which He has made with His servants. And as He has revealed Himself as a God of mercy and forgiveness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Psalmist can boldly plead for a merciful answer on the ground of His righteousness and faithfulness. Cp. St John’s words “He is faithful and righteous to forgive us our sins” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1, 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". An appeal for mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hear my prayer, O Lord, give ear to my supplications",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In thy faithfulness answer me, and in thy righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In thy faithfulness to thy promises, since thou hast promised to hear prayer, and in thy mere righteousness, since it is right and just that thou shouldest do so, hearken unto me. Psalm 143:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet pleads two motives for the answering of his prayer which are to be found in God Himself, viz., God's אמוּנה, truthfulness, with which He verifies the truth of His promises, that is to say, His faithfulness to His promises; and His צדקה, righteousness, not in a recompensative legal sense, but in an evangelical sense, in accordance with His counsel, i.e., the strictness and earnestness with which He maintains the order of salvation established by His holy love, both against the ungratefully disobedient and against those who insolently despise Him. Having entered into this order of salvation, and within the sphere of it serving Jahve as his God and Lord, the poet is the servant of Jahve. And because the conduct of the God of salvation, ruled by this order of salvation, or His \"righteousness\" according to its fundamental manifestation, consists in His justifying the sinful man who has no righteousness that he can show corresponding to the divine holiness, but penitently confesses this disorganized relationship, and, eager for salvation, longs for it to be set right again - because of all this, the poet prays that He would not also enter into judgment (בּוא בּמשׁפּט as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with him, that He therefore would let mercy instead of justice have its course with him. For, apart from the fact that even the holiness of the good spirits does not coincide with God's absolute holiness, and that this defect must still be very far greater in the case of spirit-corporeal man, who has earthiness as the basis of his origin-yea, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", man is conceived in sin, so that he is sinful from the point at which he begins to live onward - his life is indissolubly interwoven with sin, no living man possesses a righteousness that avails before God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Gerson observes on this point (vid., Thomasius, Dogmatik, iv. 251): I desire the righteousness of pity, which Thou bestowest in the present life, not the judgment of that righteousness which Thou wilt put into operation in the future life - the righteousness which justifies the repentant one.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With כּי (Psalm 143:3) the poet introduces the ground of his petition for an answer, and more particularly for the forgiveness of his guilt. He is persecuted by deadly foes and is already nigh unto death, and that not without transgression of his own, so that consequently his deliverance depends upon the forgiveness of his sins, and will coincide with this. \"The enemy persecuteth my soul\" is a variation of language taken from Psalm 7:6 (חיּה for חיּים, as in Psalm 78:50, and frequently in the Book of Job, more particularly in the speeches of Elihu). Psalm 143:3 also recalls Psalm 7:6, but as to the words it sounds like Lamentations 3:6 (cf. Psalm 88:7). מתי עולם (lxx νεκροὺς αἰῶνος) are either those for ever dead (the Syriac), after שׁנת עולם in Jeremiah 51:39, cf. בּית עולמו in Ecclesiastes 12:5, or those dead time out of mind (Jerome), after עם עולם in Ezekiel 26:20. The genitive construction admits both senses; the former, however, is rendered more natural by the consideration that הושׁיבני glances back to the beginning that seems to have no end: the poet seems to himself like one who is buried alive for ever. In consequence of this hostility which aims at his destruction, the poet feels his spirit within him, and consequently his inmost life, veil itself (the expression is the same as Psalm 142:4; Psalm 77:4); and in his inward part his heart falls into a state of disturbance (ישׁתּומם, a Hithpo. peculiar to the later language), so that it almost ceases to beat. He calls to mind the former days, in which Jahve was manifestly with him; he reflects upon the great redemptive work of God, with all the deeds of might and mercy in which it has hitherto been unfolded; he meditates upon the doing (בּמעשׂה, Ben-Naphtali בּמעשׂה) of His hands, i.e., the hitherto so wondrously moulded history of himself and of his people. They are echoes out of Psalm 77:4-7, Psalm 77:12. The contrast which presents itself to the Psalmist in connection with this comparison of his present circumsntaces with the past opens his wounds still deeper, and makes his prayer for help all the more urgent. He stretches forth his hands to God that He may protect and assist him (vid., Hlemann, Bibelstudien, i. 150f.). Like parched land is his soul turned towards Him, - language in which we recognise a bending round of the primary passage Psalm 63:2. Instead of לך it would be לך, if סלה (Targum לעלמין) were not, as it always is, taken up and included in the sequence of the accents. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With כּי (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the poet introduces the ground of his petition for an answer, and more particularly for the forgiveness of his guilt. He is persecuted by deadly foes and is already nigh unto death, and that not without transgression of his own, so that consequently his deliverance depends upon the forgiveness of his sins, and will coincide with this. \"The enemy persecuteth my soul\" is a variation of language taken from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (חיּה for חיּים, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently in the Book of Job, more particularly in the speeches of Elihu). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " also recalls ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but as to the words it sounds like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 88:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). מתי עולם (lxx νεκροὺς αἰῶνος) are either those for ever dead (the Syriac), after שׁנת עולם in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. בּית עולמו in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or those dead time out of mind (Jerome), after עם עולם in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 26:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The genitive construction admits both senses; the former, however, is rendered more natural by the consideration that הושׁיבני glances back to the beginning that seems to have no end: the poet seems to himself like one who is buried alive for ever. In consequence of this hostility which aims at his destruction, the poet feels his spirit within him, and consequently his inmost life, veil itself (the expression is the same as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 142:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and in his inward part his heart falls into a state of disturbance (ישׁתּומם, a Hithpo. peculiar to the later language), so that it almost ceases to beat. He calls to mind the former days, in which Jahve was manifestly with him; he reflects upon the great redemptive work of God, with all the deeds of might and mercy in which it has hitherto been unfolded; he meditates upon the doing (בּמעשׂה, Ben-Naphtali בּמעשׂה) of His hands, i.e., the hitherto so wondrously moulded history of himself and of his people. They are echoes out of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:4-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The contrast which presents itself to the Psalmist in connection with this comparison of his present circumsntaces with the past opens his wounds still deeper, and makes his prayer for help all the more urgent. He stretches forth his hands to God that He may protect and assist him (vid., Hlemann, Bibelstudien, i. 150f.). Like parched land is his soul turned towards Him, - language in which we recognise a bending round of the primary passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 63:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Instead of לך it would be לך, if סלה (Targum לעלמין) were not, as it always is, taken up and included in the sequence of the accents. ",
            "children": []
          }
        ]
      }
    ]
  }
]