[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:4-10 The most despicable living man's state, is preferable to that of the most noble who have died impenitent. Solomon exhorts the wise and pious to cheerful confidence in God, whatever their condition in life. The meanest morsel, coming from their Father's love, in answer to prayer, will have a peculiar relish. Not that we may set our hearts upon the delights of sense, but what God has given us we may use with wisdom. The joy here described, is the gladness of heart that springs from a sense of the Divine favour. This is the world of service, that to come is the world of recompence. All in their stations, may find some work to do. And above all, sinners have the salvation of their souls to seek after, believers have to prove their faith, adorn the gospel, glorify God, and serve their generation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. The living are conscious that there is a future before them: but the dead are unconscious; they earn nothing, receive nothing, even the memory of them soon disappears; they are no longer excited by the passions which belong to people in this life; their share in its activity has ceased. Solomon here describes what he sees, not what he believes; there is no reference here to the fact or the mode of the existence of the soul in another world, which are matters of faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The last clause of Ecclesiastes 9:6 indicates that the writer confines his observations on the dead to their portion in, or relation to, this world.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The last clause of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " indicates that the writer confines his observations on the dead to their portion in, or relation to, this world.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. know that they shall die—and may thereby be led \"so to number their days, that they may apply their hearts to wisdom\" (Ec 7:1-4; Ps 90:12).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dead know not anything—that is, so far as their bodily senses and worldly affairs are concerned (Job 14:21; Isa 63:16); also, they know no door of repentance open to them, such as is to all on earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither … reward—no advantage from their worldly labors (Ec 2:18-22; 4:9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "memory—not of the righteous (Ps 112:6; Mal 3:16), but the wicked, who with all the pains to perpetuate their names (Ps 49:11) are soon \"forgotten\" (Ec 8:10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The living know that they shall die; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereby they are taught to improve life, whilst they have it, to their greatest comfort and advantage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The dead know not anything, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, of the actions and events in this world, as this is limited in the end of the next verse. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 14:21 Isaiah 13:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A reward; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the reward or fruit of their labours in this world, which is utterly lost as to them, and enjoyed by others. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 2:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 2:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". For otherwise, that there are future rewards after death, is asserted by Solomon elsewhere, as we have seen, and shall hereafter see. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is forgotten, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, amongst living men, and even in those places where they had lived in great power and glory; as was noted, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 8:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 8:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the living know that they shall die,.... Death is certain, it is the demerit of sin, the appointment of God and the time of it is fixed; it may be known that it will be, from the word of God that assures it, from all experience which confirms it, and from the decline of nature, and the seeds of death in men. This \"the living\" know that live corporeally, even the wicked themselves, though they put the evil day far from them; and so good men, that live spiritually, being quickened by the Spirit and grace of God, and live a life of faith and holiness; they know they shall die, though Christ died for them, and has abolished death, as a punishment and a curse, and took away its sting, and made it a blessing; wherefore it is desirable to them, as being for their good: but there are some things about death they ordinarily know not; they do not know the time of their death; nor the place where they shall die; nor of what death they shall die; nor in what circumstances, both outward and inward: of these the Targum understands the passage; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for the righteous know that if they sin, they shall be reckoned as dead men in the world to come, therefore they keep their ways, and sin not; but if they sin, they return by repentance;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but the dead know not anything; this is not to be understood of their separate spirits, and of the things of the other world; for the righteous dead know much, their knowledge is greatly increased; they know, as they are known; they know much of God in Christ, of his perfections, purposes, covenant, grace, and love; they know much of Christ, of his person, offices, and glory, and see him as he is; they know much of the Gospel, and the mysteries of it; and of angels, and the spirits of just men, they now converse with; and of the glories and happiness of the heavenly state; even they know abundantly more than they did in this life: and the wicked dead, in their separate spirits, know there is a God that judgeth; that their souls are immortal; that there is a future state; indeed they know and feel the torments of hell, the worm that never dies, and the fire that is not quenched: but this is to be interpreted of their bodily senses now extinct, and of worldly things they have now nothing to do with; they know not any thing that is done in this world, nor how it fares with their children and friends they have left behind them; see Job 14:21; nor therefore are they to be prayed unto, and used as mediators with God. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but the dead know not anything; this is not to be understood of their separate spirits, and of the things of the other world; for the righteous dead know much, their knowledge is greatly increased; they know, as they are known; they know much of God in Christ, of his perfections, purposes, covenant, grace, and love; they know much of Christ, of his person, offices, and glory, and see him as he is; they know much of the Gospel, and the mysteries of it; and of angels, and the spirits of just men, they now converse with; and of the glories and happiness of the heavenly state; even they know abundantly more than they did in this life: and the wicked dead, in their separate spirits, know there is a God that judgeth; that their souls are immortal; that there is a future state; indeed they know and feel the torments of hell, the worm that never dies, and the fire that is not quenched: but this is to be interpreted of their bodily senses now extinct, and of worldly things they have now nothing to do with; they know not any thing that is done in this world, nor how it fares with their children and friends they have left behind them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; nor therefore are they to be prayed unto, and used as mediators with God. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and sinners know not any good, so that they do not make their works good while they live; and they know not any good in the world to come;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither have they any more a reward; not but that there will be rewards in a future state, in which everyone shall have his own reward; there will be a reward for the righteous; they will receive the reward of the inheritance, though it will be, not of debt, but of grace; and particularly in the millennium state, Psalm 58:11; and every transgression of the wicked will receive a just recompence of reward; to whom the reward of their hands will be given them, Hebrews 2:2; but the sense is, that after death there will be no enjoyment of a man's labours; he will not have the use, profit, and advantage of them, but his heirs that succeed him, Ecclesiastes 4:9; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither have they any more a reward; not but that there will be rewards in a future state, in which everyone shall have his own reward; there will be a reward for the righteous; they will receive the reward of the inheritance, though it will be, not of debt, but of grace; and particularly in the millennium state, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 58:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and every transgression of the wicked will receive a just recompence of reward; to whom the reward of their hands will be given them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the sense is, that after death there will be no enjoyment of a man's labours; he will not have the use, profit, and advantage of them, but his heirs that succeed him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for the memory of them is forgotten; not the memory of the righteous with God, for whom a book of remembrance is written, and whose names are written in heaven; these are had in everlasting remembrance, and their memory blessed: but the memory of wicked men; who, though they take pains to perpetuate their names, which they give to their lands, yet the Lord causes their memory to cease, and they are forgotten in the place where they lived; not only among the righteous, as the Targum, but among others, Isaiah 26:14; even among those that enjoy the fruit of their labour; they will scarce think of them any more, or, however, in a little time they will be quite forgotten by them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the memory of them is forgotten; not the memory of the righteous with God, for whom a book of remembrance is written, and whose names are written in heaven; these are had in everlasting remembrance, and their memory blessed: but the memory of wicked men; who, though they take pains to perpetuate their names, which they give to their lands, yet the Lord causes their memory to cease, and they are forgotten in the place where they lived; not only among the righteous, as the Targum, but among others, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; even among those that enjoy the fruit of their labour; they will scarce think of them any more, or, however, in a little time they will be quite forgotten by them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the living know that they shall die: but the dead know not any thing, neither have they any more a reward; for the memory of them is forgotten.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the living know that they shall die",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The writer in one of the strange paradoxes of the mood of pessimism finds that though life is vanity, it is yet better than the death which he looks upon as its only outcome. There is a greatness in the very consciousness of the coming doom. Man, knowing he must perish and lamenting over his fate, is nobler than those that are already numbered with the dead. There is a pride even in the cry with which those who enter on the arena as doomed to death greet the sovereign Power that dooms them:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Ave, Cæsar; morituri te salutamus.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Hail to thee Cæsar, hail! on our way to our death-doom we greet thee.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They were nobler then than when their bleeding and mangled car-cases on the arena were all that was left of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither have they any more a reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words exclude the thought (in the then phase of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Debater’s",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " feeling) of reward in a life after death, but the primary meaning of the word is that of “hire” and “wages” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the idea conveyed is that the dead no longer find, as on earth, that which rewards their labour. There is no longer even death to look forward to as the wages of his life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So we have in Shakespeare:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Thou thy worldly task hast done,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Home art gone and ta’en thy wages.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cymbeline",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Act iv., Sc. 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the memory of them is forgotten",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew gives an assonance between “reward” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sheker",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and “memory” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "zeker",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which it is hard to reproduce in English. “Reward” and “record” suggest themselves as the nearest approximation. For the thought see note on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Even the immortality of living in the memory of others, which modern thinkers have substituted for the Christian hope, is denied to the vast majority of mankind.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the living know that they shall die",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is added in confirmation of the statement in ver. 4. The living have at least the consciousness that they will soon have to die, and this leads them to work while it is day, to employ their faculties worthily, to make use of opportunities, to enjoy and profit by the present. They have a certain fixed event to which they must look forward; and they have not to stand idle, lamenting their fate, but their duty and their happiness is to accept the inevitable and make the best of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But the dead know not anything",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are cut off from the active, bustling world; their work is done; they have nothing to expect, nothing to labor for. What passes upon earth affects them not; the knowledge of it reaches them no longer. Aristotle's idea was that the dead did know something, in a hazy and indistinct way, of what went on in the upper world, and were in some slight degree influenced thereby, but not to such a degree as to change happiness into misery, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vice versa",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ('Eth. Nicom.,' 1:10 and 11). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither have they any more a reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " no fruit for labor done. There is no question here about future retribution in another world. The gloomy view of the writer at this moment precludes all idea of such an adjustment of anomalies after death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the memory of them is forgotten.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They have not even the poor reward of being remembered by loving posterity, which in the mind of an Oriental was an eminent blessing, to be much desired. There is a paronomasia in ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "zeker",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"memory,\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sakar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"reward,\" which, as Plumptre suggests, may be approximately represented in English by the words \"record\" and \"reward.\" Ecclesiastes 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He sarcastically verifies his comparison in favour of a living dog. \"For the living know that they shall die; but the dead know not anything, and have no more a reward; for their memory is forgotten. Their love, as well as their hatred and their envy, has long ago perished, and they have part no more for ever in all that is done under the sun.\" The description of the condition of death begins sarcastically and then becomes elegiac. \"They have no reward further,\" viz., in this upper world, since there it is only too soon forgotten that they once existed, and that they did anything worthy of being remembered; Koheleth might here indeed, with his view shrouded in dark clouds, even suppose that God also forgot them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The suff. of אהב, etc., present themselves was subjective, and there is no reason, with Knobel and Ginsburg, to render them objectively: not merely the objects of their love, and hatred, and envy, are lost to them, but these their affections and strivings themselves have ceased (Rosenm., Hitzig, Zckl., and others), they lie (Kevar 'avadah) far behind them as absolutely gone; for the dead have no part more in the history which is unfolding itself amid the light of the upper world, and they can have no more any part therein, for the dead as not living are not only without knowledge, but also without feeling and desire. The representation of the state after death is here more comfortless than anywhere else. For elsewhere we read that those who have been living here spend in Sheol, i.e., in the deep (R. של, to be loose, to hang down, to go downwards) realm of the dead, as rephaim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), lying beneath the upper world, far from the love and the praise of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a prospectless (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:6-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 18:11-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), dark, shadowy existence; the soul in Hades, though neither annihilated nor sleeping, finds itself in a state of death no less than does the body in the grave. But here the state of death is not even set forth over against the idea of the dissolution of life, the complete annihilation of individuality, much less that a retribution in eternity, i.e., a retribution executed, if not here, yet at some time, postulated elsewhere by the author, throws a ray of light into the night of death. The apocryphal book of the Wisdom of Solomon, which distinguishes between a state of blessedness and a state of misery measured out to men in the future following death, has in this surpassed the canonical Book of Koheleth. In vain do the Targ., Midrash, and the older Christian interpreters refer that which is said to the wicked dead; others regard Koheleth as introducing here the discourse of atheists (e.g., Oetinger), and interpret, under the influence of monstrous self-deception, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the voice of the spirit (Hengst.) opposing the voice of the flesh. But that which Koheleth expresses here only in a particularly rugged way is the view of Hades predominating in the O.T. It is the consequence of viewing death from the side of its anger. Revelation intentionally permits this manner of viewing it to remain; but from premises which the revelation sets forth, the religious consciousness in the course of time draws always more decidedly the conclusion, that the man who is united to God will fully reach through death that which since the entrance of sin into the world cannot be reached without the loss of this present life, i.e., without death, viz., a more perfect life in fellowship with God. Yet the confusion of the O.T. representation of Hades remains; in the Book of Sirach it also still throws its deep shadows (17:22f.) into the contemplation of the future; for the first time the N.T. solution actually removes the confusion, and turns the scale in favour of the view of death on its side of light. In this history of the ideas of eternity moving forward amid many fluctuations to the N.T. goal, a significant place belongs to the Book of Koheleth; certainly the Christian interpreter ought not to have an interest in explaining away and concealing the imperfections of knowledge which made it impossible for the author spiritually to rise above his pessimism. He does not rise, in contrast to his pessimism, above an eudaemonism which is earthly, which, without knowing of a future life (not like the modern pessimism, without wishing to know of a future life), recommends a pleasant enjoyment of the present life, so far as that is morally allowable: ",
        "children": []
      }
    ]
  }
]