[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Take every man his censer.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "These censers may have been household vessels resembling censers, and available for the same purpose; or they may have been vessels which were used by the heads of houses, as priests, before the order of priesthood was restricted to the family of Aaron; or they may have been made by Korah and his company for their own use.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:16-22 The same glory of the Lord that appeared to place Aaron in his office at first, Le 9:23, now appeared to confirm him in it; and to confound those who set up against him. Nothing is more terrible to those who are conscious of guilt, than the appearance of the Divine glory. See how dangerous it is to have fellowship with sinners, and to partake with them. Though the people had treacherously deserted them, yet Moses and Aaron approved themselves faithful shepherds of Israel. If others fail in their duty to us, that does not take away the obligations we are under to seek their welfare. Their prayer was a pleading prayer, and it proved a prevailing one.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wilt thou put out the eyes of these men? - i. e. \"blind them to the fact that you keep none of your promises;\" \"throw dust in their eyes.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. two hundred fifty censers—probably the small platters, common in Egyptian families, where incense was offered to household deities and which had been among the precious things borrowed at their departure [Ex 12:35, 36].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And take every man his censer, and put incense therein,.... Which they were to bring with them the next day from their own tents; and these might be censers which they had in their several families, and which they had used in them before the order of priesthood was set up in Aaron's family, and limited to that; or they might be a sort of chafing dishes, or vessels like censers, and would serve the present purpose; they were ordered to put fire into them, that was to be taken from the altar of burnt offering; for strange fire might not be used: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and bring ye before the Lord every man his censer, two hundred and fifty censers: according to the number of the men that were gathered with Korah: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou also, and Aaron, each of you his censer; Korah and Aaron were to bring each their censers, between whom lay the contest concerning the high priesthood; which was to be determined by their offering incense before the Lord, and by his approbation or disapprobation of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou also, and Aaron, each of you his censer; Korah and Aaron were to bring each their censers, between whom lay the contest concerning the high priesthood; which was to be determined by their offering incense before the Lord, and by his approbation or disapprobation of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And take every man his censer, and put incense in them, and bring ye before the LORD every man his censer, two hundred and fifty censers; thou also, and Aaron, each of you his censer.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In conclusion, he summoned Korah and his associates once more, to present themselves the following day before Jehovah with censers and incense. ",
        "children": []
      }
    ]
  }
]