[{"num":17,"verse":"“Do not sacrifice to the Lord your God cattle or sheep that have any defects; the Lord hates this."},{"num":2,"verse":"“Suppose you hear that in one of your towns some men or women have sinned against the Lord and broken his covenant "},{"num":3,"verse":"by worshiping and serving other gods or the sun or the moon or the stars, contrary to the Lord's command. "},{"num":4,"verse":"If you hear such a report, then investigate it thoroughly. If it is true that this evil thing has happened in Israel, "},{"num":5,"verse":"then take them outside the town and stone them to death. "},{"num":6,"verse":"However, they may be put to death only if two or more witnesses testify against them; they are not to be put to death if there is only one witness. "},{"num":7,"verse":"The witnesses are to throw the first stones, and then the rest of the people are to stone them; in this way you will get rid of this evil."},{"num":8,"verse":"“It may be that some cases will be too difficult for the local judges to decide, such as certain cases of property rights or of bodily injury or those cases that involve a distinction between murder and manslaughter. When this happens, go to the one place of worship chosen by the Lord your God, "},{"num":9,"verse":"and present your case to the levitical priests and to the judge who is in office at that time, and let them decide the case. "},{"num":10,"verse":"They will give their decision, and you are to do exactly as they tell you. "},{"num":11,"verse":"Accept their verdict and follow their instructions in every detail. "},{"num":12,"verse":"Anyone who dares to disobey either the judge or the priest on duty is to be put to death; in this way you will remove this evil from Israel. "},{"num":13,"verse":"Then everyone will hear of it and be afraid, and no one else will dare to act in such a way."},{"header":"Instructions concerning a King"},{"num":14,"verse":"“After you have taken possession of the land that the Lord your God is going to give you and have settled there, then you will decide you need a king like all the nations around you. "},{"num":15,"verse":"Be sure that the man you choose to be king is the one whom the Lord has chosen. He must be one of your own people; do not make a foreigner your king. "},{"num":16,"verse":"The king is not to have a large number of horses for his army, and he is not to send people to Egypt to buy horses, because the Lord has said that his people are never to return there. "},{"num":17,"verse":"The king is not to have many wives, because this would make him turn away from the Lord; and he is not to make himself rich with silver and gold. "},{"num":18,"verse":"When he becomes king, he is to have a copy of the book of God's laws and teachings made from the original copy kept by the levitical priests. "},{"num":19,"verse":"He is to keep this book near him and read from it all his life, so that he will learn to honor the Lord and to obey faithfully everything that is commanded in it. "},{"num":20,"verse":"This will keep him from thinking that he is better than other Israelites and from disobeying the Lord's commands in any way. Then he will reign for many years, and his descendants will rule Israel for many generations."}]