[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A SHEAF OF PRAYER ARROWSPsalm 86:1 - Psalm 86:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A SHEAF OF PRAYER ARROWS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We have here a sheaf of arrows out of a good man’s quiver, shot into heaven. This series of supplications is remarkable in more than one respect. They all mean substantially the same thing, but the Psalmist turns the one blessing round in all sorts of ways, so great does it seem to him, and so earnest is his desire to possess it. They are almost all quotations from earlier psalms, just as our prayers are often words of Scripture, hallowed by many associations, and uniting us with the men of old who cried unto God and were answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The structure of the petitions is remarkably uniform. In each there are a prayer and a plea, and in most of them a direct invocation of God. So I have thought that, if we put them all together now, we may get some lessons as to the invocations, the petitions, and the pleas of true prayer; or, in other words, we may be taught how to lay hold of God, what to ask from Him, and how to be sure of an answer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, the lesson as to how to lay hold upon God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, the lesson as to how to lay hold upon God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The divine names in this psalm are very frequent and significant, and the order in which they are used is evidently intentional. We have the great covenant name of Jehovah set in the very first verse, and in the last verse; as if to bind the whole together with a golden circlet. And then, in addition, it appears once in each of the other two sections of the psalm, with which we have nothing to do at present. Then we have, further, the name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " employed in each of the sections; and further, the name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is not the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but implies the simple idea of superiority and authority. In each portion of the psalm, then, we see the writer laying his hand, as it were, upon these three names-’Jehovah,’ ‘my God,’ ‘Lord’-and in all of them finding grounds for his confidence and reasons for his cry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nothing in our prayers is often more hollow and unreal than the formal repetitions of the syllables of that divine name, often but to fill a pause in our thoughts. But to ‘call upon the Name of the Lord’ means, first and foremost, to bring before our minds the aspects of His great and infinite character, which are gathered together into the Name by which we address Him. So when we say ‘Jehovah!’ ‘Lord!’ what we ought to mean is this, that we are gazing upon that majestic, glorious thought of Being, self-derived, self-motived, self-ruled, the being of Him whose Name can only be, ‘I am that I am.’ Of all other creatures the name is, ‘I am that I have been made,’ or ‘I am that I became,’ but of Him the Name is, ‘I am that I am.’ Nowhere outside of Himself is the reason for His being, nor the law that shapes it, nor the aim to which it tends. And this infinite, changeless Rock is laid for our confidence, Jehovah the Eternal, the Self-subsisting, Self-sufficing One.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is more than that thought in this wondrous Name, for it not only expresses the timeless, unlimited, and changeless being of God, but also the truth that He has entered into what He deigns to call a Covenant with us men. The name Jehovah is the seal of that ancient Covenant, of which, though the form has vanished, the essence abides for ever, and God has thereby bound Himself to us by promises that cannot be abrogated. So that when we say, ‘O Lord!’ we summon up before ourselves, and grasp as the grounds of our confidence, and we humbly present before Him as the motives, if we may so call them, for His action, His own infinite being and His covenanted grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, further, our psalm invokes ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God.’ That names implies in itself, simply, the notion of power to be reverenced. But when we add to it that little word ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ we rise to the wonderful thought that the creature can claim an individual relation to Him, and in some profound sense a possession there. The tiny mica flake claims kindred with the Alpine peak from which it fell. The poor, puny hand, that can grasp so little of the material and temporal, can grasp all of God that it needs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, there is the other name, ‘Lord,’ which simply expresses illimitable sovereignty, power over all circumstances, creatures, orders of being, worlds, and cycles of ages. Wherever He is He rules, and therefore my prayer can be answered by Him. When a child cries ‘Mother!’ it is more than all other petitions. A dear name may be a caress when it comes from loving lips. If we are the kind of Christians that we ought to be, there will be nothing sweeter to us than to whisper to ourselves, and to say to Him, ‘Abba! Father!’ See to it that your calling on the Name of the Lord is not formal, but the true apprehension, by a believing mind and a loving heart, of the ineffable and manifold sweetnesses which are hived in His manifold names.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, we have here a lesson as to what we should ask. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, we have here a lesson as to what we should ask.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The petitions of our text, of course, only cover a part of the whole field of prayer. The Psalmist is praying in the midst of some unknown trouble, and his petitions are manifold in form, though in substance, as I have said, they may all be reduced to one. Let me run over them very briefly. ‘Bow down Thine ear and hear me.’ That is not simply the invocation of the omniscience of a God, but an appeal for loving, attentive regard to the desires of His poor servant. The hearing is not merely the perception in the divine mind of what the creature desires, but it is the answer in fact, or the granting of the petition. The best illustration of what the Psalmist desires here may be found in another psalm, where another Psalmist tells us his experience and says, ‘My cry came unto His ears, and the earth shook and trembled.’ You put a spoonful of water into a hydraulic press at the one end, and you get a force that squeezes tons together at the other. Here there is a poor, thin stream of the voice of a sorrowful man at the one end, and there is an earthquake at the other. That is what ‘hearing’ and ‘bowing down the ear’ means.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then the prayers go on to three petitions, which may be all regarded as diverse acts of deliverance or of help. ‘Preserve my soul.’ The word expresses the guardianship with which a garrison keeps a fortress. It is the Hebrew equivalent of the word employed by Paul-’The peace of God shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " your hearts and minds in Christ Jesus.’ The thought is that of a defenceless man or thing round which some strong protection is cast. And the desire expressed by it is that in the midst of sorrow, whatever it is, the soul may be guarded from evil. Then, the next petition-’Save Thy servant’-goes a step further, and not only asks to be kept safe in the midst of sorrows, but to be delivered out of them. And then the next petition-’Be merciful unto me, O Lord!’-craves that the favour which comes down to inferiors, and is bestowed upon those who might deserve something far otherwise, may manifest itself, in such acts of strengthening, or help, or deliverance, as divine wisdom may see fit. And then the last petition is-’Rejoice the soul of Thy servant.’ The series begins with ‘hearing,’ passes through ‘preserving,’ ‘saving,’ showing ‘mercy,’ and comes at last to ‘rejoice the soul’ that has been so harassed and troubled. Gladness is God’s purpose for us all; joy we all have a right to claim from Him. It is the intended issue of every sorrow, and it can only be had when we cleave to Him, and pass through the troubles of life with continual dependence on and aspiration towards Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So these are the petitions massed together, and out of them let me take two or three lessons. First, then, let us learn to make all wishes and annoyances material of prayer. This man was harassed by some trouble, the nature of which we do not know; and although the latter portion of his psalm rises into loftier regions of spiritual desire, here, in the first part of it, he is wrestling with his afflicting circumstances, whatever they were, and he has no hesitation in spreading them all out before God and asking for His delivering help. Wishes that are not turned into prayers irritate, disturb, unsettle. Wishes that are turned into prayers are calmed and made blessed. Stanley and his men lived for weeks upon a poisonous root, which, if eaten crude, brought all manner of diseases, but, steeped in running water, had all the acrid juices washed out of it, and became wholesome food. If you steep your wishes in the stream of prayer the poison will pass out of them. Some of them will be suppressed, all of them will be hallowed, and all of them will be calmed. Troubles, great or small, should be turned into prayers. Breath spent in sighs is wasted; turned into prayers it will swell our sails. If a man does not pray ‘without ceasing,’ there is room for doubt whether he ever prays at all. What would you think of a traveller who had a valuable cordial of which he only tasted a drop in the morning and another in the evening; or who had a sure staff on which to lean which he only employed at distant intervals on the weary march, and that only for a short time? Let us turn all that we want into petitions, and all that annoys us let us spread before God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Learn, further, that earnest reiteration is not vain repetition. ‘Use not vain repetitions as the heathen do, for they think they shall be heard for their much speaking,’ said the Master. But the same Master ‘went away from them and prayed the third time, using the same words.’ As long as we have not consciously received the blessing, it is no vain reiteration if we renew our prayers that it may come upon our heads. The man who asks for a thing once, and then gets up from his knees and goes away, and does not notice whether he gets the answer or not, does not pray. The man who truly desires anything from God cannot be satisfied with one languid request for it. But as the heart contracts with a sense of need, and expands with a faith in God’s sufficiency, it will drive the same blood of prayer over and over again through the same veins; and life will be wholesome and strong.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then learn, further, to limit wishes and petitions within the bounds of God’s promises. The most of these supplications of our text may be found in other parts of Scripture, as promises from God. Only so far as an articulate divine word carries my faith has my faith the right to go. In the crooked alleys of Venice there is a thin thread of red stone, inlaid in the pavement or wall, which guides through all the devious turnings to the Piazza, in the centre, where the great church stands. As long as we have the red line of promise on our path, faith may follow it and will come to the Temple. Where the line stops it is presumption, and not faith, that takes up the running. God’s promises are sunbeams flung down upon us. True prayer catches them on its mirror, and signals them back to God. We are emboldened to say, ‘Bow down Thine ear!’ because He has said, ‘I will hear.’ We are encouraged to cry, ‘Be merciful!’ because we have our foot upon the promise that He will be; and all that we can ask of Him is, ‘Do for us what Thou hast said; be to us what Thou art.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The final lesson is, Leave God to settle how He answers your prayer. The Psalmist prayed for preservation, for safety, for joy; but he did not venture to prescribe to God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "how",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these blessings were to be ministered to him. He does not ask that the trouble may be taken away. That is as it may be; it may be better that it shall be left. But he asks that in it he shall not be allowed to sink, and that, however the waves may run high, they shall not be allowed to swamp his poor little cockle-shell of a boat. This is the true inmost essence of prayer-not that we should prescribe to Him how to answer our desires, but that we should leave all that in His hands. The Apostle Paul said, in his last letter, with triumphant confidence, that he knew that God would ‘deliver him and save him into His everlasting kingdom.’ And he knew, at the same time, that his course was ended, and that there was nothing for him now but the crown. How was he ‘saved into the kingdom’ and ‘delivered from the mouth of the lion’? The sword that struck off the wearied head that had thought so long for God’s Church was the instrument of the deliverance and the means of the salvation. For us it may be that a sharper sorrow may be the answer to the prayer, ‘Preserve Thy servant.’ It may be that God’s ‘bowing down His ear’ and answering us when we cry shall be to pass us through a mill that has finer rollers, to crush still more the bruised corn. But the end and the meaning of it all will be to ‘rejoice the soul of the servant’ with a deeper joy at last.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Finally, mark the lesson which we have here as to the pleas that are to be urged, or the conditions on which prayer is answered. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Finally, mark the lesson which we have here as to the pleas that are to be urged, or the conditions on which prayer is answered.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I am poor and needy,’ or, as perhaps the words more accurately mean, ‘afflicted and poor.’ The first condition is the sense of need. God’s highest blessings cannot be given except to the men who know they want them. The self-righteous man cannot receive the righteousness of Christ. The man who has little or no consciousness of sin is not capable of receiving pardon. God cannot put His fulness into our emptiness if we conceit ourselves to be filled and in need of nothing. We must know ourselves to be ‘poor and naked and blind and miserable’ ere He can make us rich, and clothe us, and enlighten our eyes, and flood our souls with His own gladness. Our needs are dumb appeals to Him; and in regard to all outward and lower things, they bind Him to supply us, because they themselves have been created by Him. He that hears the raven’s croak satisfies the necessities that He has ordained in man and beast. But, for all the best blessings of His providence and of His love, the first steps towards receiving them are the knowledge that we need them and the desire that we should possess them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then the Psalmist goes on to put another class of pleas derived from his relation to God. These are mainly two-’I am holy,’ and ‘Thy servant that trusteth in Thee.’ Now, with regard to that first word ‘holy,’ according to our modern understanding of the expression it by no means sets forth the Psalmist’s idea. It has an unpleasant smack of self-righteousness, too, which is by no means to be found in the original. But the word employed is a very remarkable and pregnant one. It really carries with it, in germ, the great teaching of the Apostle John. ‘We love Him because He first loved us.’ It means one who, being loved and favoured by God, answers the divine love with his own love. And the Psalmist is not pleading any righteousness of his own, but declaring that he, touched by the divine love, answers that love, and looks up; not as if thereby he deserved the response that he seeks, but as knowing that it is impossible but that the waiting heart should thus be blessed. They who love God are sure that the answer to their desires will come fluttering down upon their heads, and fold its white wings and nestle in their hearts. Christian people are a great deal too much afraid of saying, ‘I love God.’ They rob themselves of much peace and power thereby. We should be less chary of so saying if we thought more about God’s love to us, and poked less into our own conduct.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, the Psalmist brings this plea-’Thy servant that trusteth in Thee.’ He does not say, ‘I deserve to be answered because I trust,’ but ‘because I trust I am sure that I shall be answered’; for it is absurd to suppose that God will look down from heaven on a soul that is depending upon Him, and will let that soul’s confidence be put to shame. Dear friend! if your heart is resting upon God, be sure of this, that anything is possible rather than that you should not get from Him the blessings that you need.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Psalmist gathers together all his pleas which refer to himself into two final clauses-’I cry unto Thee daily,’ ‘I lift up my soul unto Thee’-which, taken together, express the constant effort of a devout heart after communion with God. To withdraw my heart from the low levels of earth, and to bear it up into communion with God, is the sure way to get what I desire, because then God Himself will be my chief desire, and ‘they who seek the Lord shall not want any good.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the true and prevailing plea is not in our needs, desires, or dispositions, but in God’s own character, as revealed by His words and acts, and grasped by our faith. Therefore the Psalmist ends by passing from thoughts of self to thoughts of God, and builds at last on the sure foundation which underlies all his other ‘fors’ and gives them all their force-’For Thou, Lord, art good, and ready to forgive, and plenteous in mercy unto all them that call upon Thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! turn all your wishes and all your annoyances into prayers. If a wish is not fit to be prayed about, it is not fit to be cherished. If a care is too small to be made a prayer, it is too small to be made a burden. Be frank with God as God is frank with you, and go to His throne, keeping back nothing of your desires or of your troubles. To carry them there will take the poison and the pain out of wasps’ stings, and out of else fatal wounds. We have a Name to trust to, tenderer and deeper than those which evoked the Psalmist’s triumphant confidence. Let us see to it that, as the basis of our faith is firmer, our faith be stronger than his. We have a plea to urge, more persuasive and mighty than those which he pressed on God and gathered to his own heart. ‘For Christ’s sake’ includes all that he pled, and stretches beyond it. If we come to God through Him who declares His name to us, we shall not draw near to the Throne with self-willed desires, nor leave it with empty hands. ‘If ye ask anything in My Name, I will do it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 86:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bow down thine ear, O Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When God hears our prayers he is fifty said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bow down his ear ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to them, for it is great condescension in him even to take notice of such mean creatures as we are, and much more to hear our defective and unworthy prayers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For I am poor and needy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Forsaken and persecuted by men, and utterly unable to save myself, and therefore a proper object; in behalf of whom thy power and goodness may be exerted. Observe, reader, “All prayer is founded on a sense of our own wants, and God’s ability to supply them. In the sight of his Maker every sinner is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "poor and needy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and he must become so in his own, that his petitions may be regarded; he must pray with the humility and importunity of a starving beggar, at the gate of heaven, if he expect the great King to bow down his ear and hear him.” — Horne.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "86:1-7 Our poverty and wretchedness, when felt, powerfully plead in our behalf at the throne of grace. The best self-preservation is to commit ourselves to God's keeping. I am one whom thou favourest, hast set apart for thyself, and made partaker of sanctifying grace. It is a great encouragement to prayer, to feel that we have received the converting grace of God, have learned to trust in him, and to be his servants. We may expect comfort from God, when we keep up our communion with God. God's goodness appears in two things, in giving and forgiving. Whatever others do, let us call upon God, and commit our case to him; we shall not seek in vain.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bow down thine ear, O Lord, hear me - See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For I am poor and needy - This is the reason here assigned why God should hear him. It is not a plea of merit. It is not that there was any claim on God in the fact that he was a poor and needy man - a sinner helpless and dependent, or that it would be any injustice if God should not hear, for a sinner has no claim to favor; but it is that this was a condition in which the aid of God was needed, and in which it was proper or appropriate for God to hear prayer, and to render help. We may always make our helplessness, our weakness, our poverty, our need, a ground of appeal to God; not as a claim of justice, but as a case in which he will glorify himself by a gracious interposition. It is also to be remarked that it is a matter of unspeakable thankfulness that the \"poor and needy\" may call upon God; that they will be as welcome as any class of people; that there is no condition of poverty and want so low that we are debarred from the privilege of approaching One who has infinite resources, and who is as willing to help as he is able. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For I am poor and needy - This is the reason here assigned why God should hear him. It is not a plea of merit. It is not that there was any claim on God in the fact that he was a poor and needy man - a sinner helpless and dependent, or that it would be any injustice if God should not hear, for a sinner has no claim to favor; but it is that this was a condition in which the aid of God was needed, and in which it was proper or appropriate for God to hear prayer, and to render help. We may always make our helplessness, our weakness, our poverty, our need, a ground of appeal to God; not as a claim of justice, but as a case in which he will glorify himself by a gracious interposition. It is also to be remarked that it is a matter of unspeakable thankfulness that the \"poor and needy\" may call upon God; that they will be as welcome as any class of people; that there is no condition of poverty and want so low that we are debarred from the privilege of approaching One who has infinite resources, and who is as willing to help as he is able. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 86",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 86:1-17. This is a prayer in which the writer, with deep emotion, mingles petitions and praises, now urgent for help, and now elated with hope, in view of former mercies. The occurrence of many terms and phrases peculiar to David's Psalms clearly intimates its authorship.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1, 2. poor and needy—a suffering child of God, as in Ps 10:12, 17; 18:27.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am holy—or, \"godly,\" as in Ps 4:3; 85:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I am holy—or, \"godly,\" as in Ps 4:3; 85:8.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Bow down thine ear, O Lord, hear me: for I am poor and needy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Preserve my soul; for I am holy: O thou my God, save thy servant that trusteth in thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 Be merciful unto me, O Lord: for I cry unto thee daily.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Rejoice the soul of thy servant: for unto thee, O Lord, do I lift up my soul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 For thou, Lord, art good, and ready to forgive; and plenteous in mercy unto all them that call upon thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 Give ear, O Lord, unto my prayer; and attend to the voice of my supplications.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 In the day of my trouble I will call upon thee: for thou wilt answer me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Bow down thine ear, O Lord, hear me.\" In condescension to my littleness, and in pity to my weakness, \"bow down thine ear, O Lord.\" When our prayers are lowly by reason of our humility, or feeble by reason of our sickness, or without wing by reason of our despondency, the Lord will bow down to them, the infinitely exalted Jehovah will have respect unto them. Faith, when she has the loftiest name of God on her tongue, and calls him Jehovah, yet dares to ask from him the most tender and condescending acts of love. Great as he is he loves his children to be bold with him. \"For I am poor and needy\" - doubly a son of poverty, because, first, poor and without supply for my needs, and next, needy, and so full of wants though unable to supply them. Our distress is a forcible reason for our being heard by the Lord God, merciful, and gracious, for misery is ever the master argument with mercy. Such reasoning as this would never be adopted by a proud man, and when we hear it repeated in the public congregation by those great ones of the earth who count the peasantry to be little better than the earth they tread upon, it sounds like a mockery of the Most High. Of all despicable sinners those are the worst who use the language of spiritual poverty while they think themselves to be rich and increased in goods.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Preserve my soul.\" Let my life be safe from my enemies, and my spiritual nature be secure from their temptations. He feels himself unsafe except he be covered by the divine protection. \"For I am holy.\" I am set apart for holy uses, therefore do not let thine enemies commit a sacrilege by injuring or defiling me: I am clear of the crimes laid to my charge, and in that sense innocent; therefore, I beseech thee, do not allow me to suffer from unjust charges: and I am inoffensive, meek, and gentle towards others, therefore deal mercifully with me as I have dealt with my fellow men. Any of these renderings may explain the text, perhaps all together will expound it best. It is not self-righteous in good men to plead their innocence as a reason for escaping from the results of sins wrongfully ascribed to them; penitents do not bedaub themselves with mire for the love of it, or make themselves out to be worse than they are out of compliment to heaven. No, the humblest saint is not a fool, and he is as well aware of the matters wherein he is clear as of those wherein he must cry \"peccavi.\" To plead guilty to offences we have never committed is as great a lie as the denial of our real faults. \"O thou my God, save thy servant that trusteth in thee.\" Lest any man should suppose that David trusted in his own holiness he immediately declared his trust in the Lord, and begged to be saved as one who was not holy in the sense of being perfect, but was even yet in need of the very elements of salvation. How sweet is that title, \"my God,\" when joined to the other, \"servant;\" and how sweet is the hope that on this ground we shall be saved; seeing that our God is not like the Amalekitish master who left his poor sick servant to perish. Note how David's poor I am (or rather the I repeated without the am) appeals to the great I Am with that sacred boldness engendered by the necessity which breaks through stone walls, aided by the faith which removes mountains.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Be merciful unto me, O Lord.\" The best of men need mercy, and appeal to mercy, yea to nothing else but mercy; they need it for themselves, and crave it eagerly of their God as a personal requisite. \"For I cry unto thee daily.\" Is there not a promise that importunity shall prevail? May we not, then, plead our importunity as an argument with God. He who prays every day, and all the day, for so the word may mean, may rest assured that the Lord will hear him in the day of his need. If we cried sometimes to man, or other false confidences, we might expect to be referred to them in the hour of our calamity, but if in all former time we have looked to the Lord alone, we may be sure that he will not desert us now. See how David pleaded, first that he was poor and needy, next that he was the Lord's set-apart one, then that he was God's servant and had learned to trust in the Lord, and lastly that he had been taught to pray daily; surely these are such holy pleadings as any tried believer may employ when wrestling with a prayer-hearing God, and with such weapons the most trembling suppliant may hope to win the day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...When he was in some deep distress, either from Saul, or by Absalom, or upon some other occasion. David strengtheneth himself in prayer by the truth of his religion, Psalm 86:1-4, and by God’s goodness and his readiness to hear, Psalm 86:5-10; desireth the continuance of his grace, Psalm 86:11-13. Complaining of his proud enemies, he entreateth for some token of his love, to their shame and confusion, Psalm 86:14-17.  Forsaken and persecuted by men, and utterly unable to save myself, and therefore a very proper object for thy power and goodness to work upon. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...When he was in some deep distress, either from Saul, or by Absalom, or upon some other occasion. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David strengtheneth himself in prayer by the truth of his religion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 86:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and by God’s goodness and his readiness to hear, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 86:5-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; desireth the continuance of his grace, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 86:11-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Complaining of his proud enemies, he entreateth for some token of his love, to their shame and confusion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 86:14-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Forsaken and persecuted by men, and utterly unable to save myself, and therefore a very proper object for thy power and goodness to work upon. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bow down thine ear, O Lord, hear me,.... This is spoken of God after the manner of men, who, when they listen and attentively hearken to what is said to them, stoop and bow the head, and incline the ear; and it denotes condescension in the Lord, who humbles himself as to look upon men, so to bow down the ear and hearken to them: this favour is granted to the saints, to whom he is a God hearing and answering prayer, and which Christ, as man and Mediator, enjoyed; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for I am poor and needy; weak and feeble, destitute and distressed, and so wanted help and assistance; and which carries in it an argument or reason enforcing the above petition; for the Lord has a regard to the poor and needy; see Psalm 6:2. This may be understood literally, it being the common case of the people of God, who are generally the poor and needy of this world, whom God chooses, calls, and makes his own; and so was David when he fled from Saul, being often in want of temporal mercies, as appears by his application to Ahimelech and Nabal for food; and having nothing, as Kimchi observes, to support him, but what his friends, and the men of Judah, privately helped him to; and the character well agrees with Christ, whose case this was; see 2 Corinthians 8:9. Moreover, it may be taken in a spiritual sense; all men are poor and needy, though not sensible of it; good men are poor in spirit, are sensible of their spiritual poverty, and apply to the Lord, and to the throne of his grace, for the supply of their need; and such an one was David, even when he was king of Israel, as well as at this time, Psalm 40:17, and may be applied to Christ; especially when destitute of his Father's gracious presence, and was forsaken by him and all his friends, Matthew 27:46. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I am poor and needy; weak and feeble, destitute and distressed, and so wanted help and assistance; and which carries in it an argument or reason enforcing the above petition; for the Lord has a regard to the poor and needy; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This may be understood literally, it being the common case of the people of God, who are generally the poor and needy of this world, whom God chooses, calls, and makes his own; and so was David when he fled from Saul, being often in want of temporal mercies, as appears by his application to Ahimelech and Nabal for food; and having nothing, as Kimchi observes, to support him, but what his friends, and the men of Judah, privately helped him to; and the character well agrees with Christ, whose case this was; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moreover, it may be taken in a spiritual sense; all men are poor and needy, though not sensible of it; good men are poor in spirit, are sensible of their spiritual poverty, and apply to the Lord, and to the throne of his grace, for the supply of their need; and such an one was David, even when he was king of Israel, as well as at this time, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 40:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and may be applied to Christ; especially when destitute of his Father's gracious presence, and was forsaken by him and all his friends, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<> Bow down {a} thine ear, O LORD, hear me: for I am poor and needy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "> Bow down {a} thine ear, O LORD, hear me: for I am poor and needy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) David, when persecuted by Saul, prayed this way, leaving the same to the Church as a monument, how to seek relief against their miseries.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "(a) David, when persecuted by Saul, prayed this way, leaving the same to the Church as a monument, how to seek relief against their miseries.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bow down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] A common form of invocation. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hear me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Answer me (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for I am poor and needy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, afflicted and needy: and therefore one of those whom God has specially promised to help (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 70:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A series of petitions, each supported by the ground on which the Psalmist pleads for a hearing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Prayer, the predominant note of the entire psalm, holds almost exclusive possession of the first strophe, only passing into praise when the last verse is reached, where the petitioner reminds God of his loving kindness and readiness to forgive. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Bow down thine ear, O Lord, hear me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For I am poor and needy;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, \"I am afflicted and in misery.\" Poverty in the ordinary sense is scarcely intended. Psalm 86:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prayer to be heard runs like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the statement of the ground on which it is based, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", word for word like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is then particularly expressed as a prayer for preservation (שׁמרה, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:167",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although imperative, to be read shāmerah; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " מיּרדי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " רדפי or רדפי, and what we have already observed on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " שׁמרני); for he is not only in need of God's help, but also because חסיד (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., united to Him in the bond of affection (חסד, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not unworthy of it. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we hear the strains of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 57:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: the confirmation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken verbally from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, what is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this shorter Adonajic Psalm, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is abbreviated in the ἅπαξ γεγραμ. סלּח (root סל, של, to allow to hang loose, χαλᾶν, to give up, remittere). The Lord is good (טּוב), i.e., altogether love, and for this very reason also ready to forgive, and great and rich in mercy for all who call upon Him as such. The beginning of the following group also accords with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]