[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) See Note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence the verse is taken.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 86:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O God, the proud are risen against me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Behold, O God, a new opportunity to glorify that mercy, for ambitious men have risen up against me in open rebellion, and have not only plotted against me, but endeavoured to put their plots in execution, and both to depose and destroy me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The assemblies of violent men have sought after my soul ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, after my life: to take it away; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and have not set thee before them —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They have no reverence nor regard for thee, neither for thy word, which hath conferred the kingdom upon me, nor for thine all-seeing eye, which beholds all their wicked devices and practices against me, nor for thy justice, which will undoubtedly bring their mischief upon their own heads. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But thou art a God full of compassion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Namely, to thy people, and to me in particular, and therefore thou wilt forgive my manifold sins, for which thou mightest justly reject me, and wilt save me from my cruel enemies. Thus, from praises, the psalmist returns again to prayer, as all the people of God are frequently compelled to do. In the opposition he met with he was a type of the Messiah, his seed according to the flesh, and his church. “We know the treatment which Christ met with, when he was upon earth, from proud and violent men, who had not set God before their eyes; from self-righteous Jews, and conceited Gentiles, who rose up, and look counsel together against him. What his church afterward suffered, at the hands of the same enemies, is likewise well known. How much more she is to undergo in the latter days we know not as yet; but this we know, that the spirit of the world stands, now and ever, in opposition to the Spirit of God; its design is always the same, although its methods of working be divers.” — Horne. So that, even from without, and from visible enemies, not to mention those within the human heart, and such as are invisible, every one, who is a Christian indeed, shall be sure to find his state on earth a warfare, and to have his portion of tribulation in this life. But, like David, he may, in the midst of all the trials and oppositions he meets with, find a place of sure refuge, and an almighty helper, in that Being who is here said to be full of compassion and gracious, long-suffering, and plenteous in goodness and truth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "86:8-17 Our God alone possesses almighty power and infinite love. Christ is the way and the truth. And the believing soul will be more desirous to be taught the way and the truth. And the believing soul will be more desirous to be taught the way and the truth of God, in order to walk therein, than to be delivered out of earthly distress. Those who set not the Lord before them, seek after believers' souls; but the compassion, mercy, and truth of God, will be their refuge and consolation. And those whose parents were the servants of the Lord, may urge this as a plea why he should hear and help them. In considering David's experience, and that of the believer, we must not lose sight of Him, who though he was rich, for our sakes became poor, that we through his poverty might be rich.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O God, the proud are risen against me - People who are self-confident, ambitious, haughty; who do not regard the welfare or the rights of others; who are disposed to trample down all others in order that they may accomplish their own purposes; these are the people who have opposed me and sought my life. This would apply either to the time of Saul or of Absalom. In both these cases there were men who would correspond to this description.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the assemblies of violent men - Margin,\" terrible.\" The Septuagint and the Vulgate render this, \"the synagogue of the wicked.\" The word rendered violent means properly terrible, inspiring terror; then, violent, fierce, lawless, tyrants. The idea here is that they pursued their object by violence and not by right; they did it in a fierce and savage manner, or in such a way as to inspire terror. The word assembly here means merely that they were banded together; what was done was the result of a conspiracy or combination.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Have sought after my soul - After my life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And have not set thee before them - They do not fear thee; they do not act as if in thy presence; they have no regard for thee, for thy law, for thy favor, for thy threatenings. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And have not set thee before them - They do not fear thee; they do not act as if in thy presence; they have no regard for thee, for thy law, for thy favor, for thy threatenings. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13, 14. The reason: God had delivered him from death and the power of insolent, violent, and godless persecutors (Ps 54:3; Eze 8:12).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14 O God, the proud are risen against me, and the assemblies of violent men have sought after my soul; and have not set thee before them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15 But thou, O Lord, art a God full of compassion, and gracious, long-suffering, and plenteous in mercy and truth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16 O turn unto me, and have mercy upon me; give thy strength unto thy servant, and save the son of thine handmaid.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 Shew me a token for good; that they which hate me may see it, and be ashamed: because thou, Lord, hast holpen me, and comforted me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:14",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O God, the proud are risen against me.\" They could not let God's poor servant alone, his walk with God was as smoke to their eyes, and therefore they determined to destroy him. None hate good men so fiercely as do the high-minded and domineering. \"And the assemblies of violent men have sought after roll soul.\" Unitedly oppressors sought the good man's life; they hunted in packs, with keen scent, and eager foot. In persecuting times many a saint has used these words in reference to Papal bishops and inquisitors. \"And have not set thee before them.\" They would not have molested the servant if they had cared one whit for the master. Those who fear not God are not afraid to commit violent and cruel acts. An atheist is a misanthrope. Irreligion is akin to inhumanity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"But thou, O Lord.\" What a contrast! We get away from the hectorings and blusterings of proud but puny men to the glory and goodness of the Lord. We turn from the boisterous foam of chafing waves to the sea of glass mingled with fire, calm and serene. \"Art a God full of compassion, and gracious, longsuffering, and plenteous in mercy and truth.\" A truly glorious doxology, in which there is not one redundant word. As we have before observed, it is mainly transcribed from Exodus 34:6. Here is compassion for the weak and sorrowing, grace for the undeserving, longsuffering for the provoking, mercy for the guilty, and truth for the tried. God's love assumes many forms, and is lovely in them all. Into whatsoever state we may be cast, there is a peculiar hue in the light of love which will harmonize with our condition; love is one and yet sevenfold, its white ray contains the chromatic scale. Are we sorrowful? We find the Lord full of compassion. Are we contending with temptation? His grace comes to our aid. Do we err? He is patient with us. Have we sinned? He is plenteous in mercy. Are we resting on his promise? He will fulfil it with abundant truth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"But thou, O Lord.\" What a contrast! We get away from the hectorings and blusterings of proud but puny men to the glory and goodness of the Lord. We turn from the boisterous foam of chafing waves to the sea of glass mingled with fire, calm and serene. \"Art a God full of compassion, and gracious, longsuffering, and plenteous in mercy and truth.\" A truly glorious doxology, in which there is not one redundant word. As we have before observed, it is mainly transcribed from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here is compassion for the weak and sorrowing, grace for the undeserving, longsuffering for the provoking, mercy for the guilty, and truth for the tried. God's love assumes many forms, and is lovely in them all. Into whatsoever state we may be cast, there is a peculiar hue in the light of love which will harmonize with our condition; love is one and yet sevenfold, its white ray contains the chromatic scale. Are we sorrowful? We find the Lord full of compassion. Are we contending with temptation? His grace comes to our aid. Do we err? He is patient with us. Have we sinned? He is plenteous in mercy. Are we resting on his promise? He will fulfil it with abundant truth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O turn unto me.\" As though the face of God had been before averted in anger, the suppliant pleads for a return of conscious favour. One turn of God's face will turn all our darkness into day. \"And have mercy upon me,\" that is all he asks, for he is lowly in heart; that is all he wants, for mercy answereth all a sinner's needs. \"Give thy strength unto thy servant.\" Gird me with it that I may serve thee, guard me with it that I may not be overcome. When the Lord gives us his own strength we are sufficient for all emergencies, and have no cause to fear any adversaries. \"And save the son of thine handmaid.\" He meant that he was a home-born servant of God. As the sons of slaves were their master's property by their birth, so he gloried in being the son of a woman who herself belonged to the Lord. What others might think a degrading illustration he uses with delight, to show how intensely he loved the Lord's service; and also as a reason why the Lord should interpose to rescue him, seeing that he was no newly-purchased servant, but had been in the house from his very birth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Shew me a token for good.\" Let me be assured of thy mercy by being delivered out of trouble. \"That they which hate me may see it, and be ashamed.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Some token of thy favour show,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some sign which all my foes may see:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " They have no reverence nor regard for thee, neither for thy word, which hath conferred the kingdom upon me; nor for thine all-seeing eye, which beholds all their wicked devices and practices against me; nor for thy justice, which will undoubtedly bring their mischief upon their own heads. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O God, the proud are risen against me,.... As all men naturally are, and as all are without the grace of God; and because they are, they deal in proud wrath: as, through the pride of their heart, they seek not after God; so, through the same, they persecute his people, treating them with the utmost contempt, and as the offscouring of all things. Jarchi interprets this particularly of Doeg and Ahithophel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the assemblies of violent men have sought after my soul; or \"terrible\" (s) ones, who breathed out nothing but cruelty, threatenings, and slaughter; and who were many, and got together in bodies, and entered into combinations and conspiracies; and whom nothing would satisfy but the taking away of his life, which they sought after; see Psalm 22:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the assemblies of violent men have sought after my soul; or \"terrible\" (s) ones, who breathed out nothing but cruelty, threatenings, and slaughter; and who were many, and got together in bodies, and entered into combinations and conspiracies; and whom nothing would satisfy but the taking away of his life, which they sought after; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and have not set thee before them; they did not consider the omniscience of God, that he knew and took notice of all they did; nor his omnipresence, that he was everywhere, and there was no fleeing from him; nor his omnipotence, who was able to crush them to pieces; nor his justice, which will render tribulation to them that trouble his; nor his goodness, which should lead to repentance; nor had they any fear of him, nor respect to his glory: in short, they were like the unjust judge, who neither feared God nor regarded men, Luke 18:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and have not set thee before them; they did not consider the omniscience of God, that he knew and took notice of all they did; nor his omnipresence, that he was everywhere, and there was no fleeing from him; nor his omnipotence, who was able to crush them to pieces; nor his justice, which will render tribulation to them that trouble his; nor his goodness, which should lead to repentance; nor had they any fear of him, nor respect to his glory: in short, they were like the unjust judge, who neither feared God nor regarded men, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) \"terribilium\", Montanus; so some in Vatablus, Gejerus, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) \"terribilium\", Montanus; so some in Vatablus, Gejerus, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O God, the proud are risen against me, and the assemblies of violent men have {k} sought after my soul; and have not set thee before them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O God, the proud are risen against me, and the assemblies of violent ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "men",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sought after my soul; and have not set thee before them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) He shows that there can be no moderation or equity where proud tyrants reign, and that the lack of God's fear is as a privilege to all vice and cruelty.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Again, though the Psalmist may be referring to personal circumstances, it is not impossible that he is alluding to dangers by which the community was threatened. The verse is taken almost word for word from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with perhaps a reminiscence of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "assembly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of evil doers’). The variation ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "proud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strangers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be accidental: the consonants of the two words zçdîm and zarim are easily confused, D (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and R (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") being much alike in Hebrew. It should be noted that Psalms 54. is quoted in its ‘Elohistic’ form, so that apparently the collection had already been made and edited by the Elohistic editor.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "assemblies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Assembly, or congregation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O God, the proud are risen against me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:51, 69, 85, 122",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the assemblies of violent men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "have sought after my soul;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a crew of violent ones have sought after my soul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or \"plotted against my life\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:1, 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:3, 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And have not set thee before them;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"have given no thought to God, or how he would act, whether he would allow their wickedness or prevent it.\" Psalm 86:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The situation is like that in the Psalms of the time of Saul. The writer is a persecuted one, and in constant peril of his life. He has taken ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " out of the Elohimic ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and retained the Elohim as a proper name of God (cf. on the other hand ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); he has, however, altered זרים to זרים, which here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. however, ibid. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is the alternating word to עריצים. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he supports his petition that follows by Jahve's testimony concerning Himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The appellation given to himself by the poet in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " recurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Wisd. 9:5). The poet calls himself \"the son of Thy handmaid\" as having been born into the relation to Him of servant; it is a relationship that has come to him by birth. How beautifully does the Adonaj come in here for the seventh time! He is even from his mother's womb the servant of the sovereign Lord, from whose omnipotence he can therefore also look for a miraculous interposition on his behalf. A \"token for good\" is a special dispensation, from which it becomes evident to him that God is kindly disposed towards him. לטובה as in the mouth of Nehemiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 13:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 8:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and also even in Jeremiah and earlier. ויבשׁוּ is just as parenthetical as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]