[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) For the sources of this verse see marginal reference and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After expressing his conviction of God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "willingness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to hear prayer, the psalmist goes on to his confidence in Divine power to save.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 86:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Among the gods — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The false gods, whom the heathen worship; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there is none like unto thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "None so wise, so mighty, so good; none so able and willing to hear and answer prayer. I am not now calling on a deaf and impotent idol, for then my prayers, however fervent and importunate, would be in vain, (as those of Baal’s worshippers were, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) but I am calling on the almighty and most gracious God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither are there any works like unto thy works — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is an undeniable proof that there is none like thee. Thy own works praise thee, and demonstrate that thou art infinitely superior to, and different from, all other beings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "86:8-17 Our God alone possesses almighty power and infinite love. Christ is the way and the truth. And the believing soul will be more desirous to be taught the way and the truth. And the believing soul will be more desirous to be taught the way and the truth of God, in order to walk therein, than to be delivered out of earthly distress. Those who set not the Lord before them, seek after believers' souls; but the compassion, mercy, and truth of God, will be their refuge and consolation. And those whose parents were the servants of the Lord, may urge this as a plea why he should hear and help them. In considering David's experience, and that of the believer, we must not lose sight of Him, who though he was rich, for our sakes became poor, that we through his poverty might be rich.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Among the gods there is none like unto thee, O Lord - Among all those which are worshipped as gods there is no one that can hear and save. The psalmist, in respect to prayer, and to help to be obtained by prayer, compares his own condition with that of those who worshipped false gods. He had a God who could hear; they had none. A true child of God now in trouble may properly compare his condition in this respect with that of those who make no profession of religion; who do not profess to worship God, or to have a God. To him there is a throne of grace which is always accessible; to them there is none. There is One to whom he may always pray; they profess to have no one on whom they can call.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither are there any works like unto thy works - That is, as done by those \"gods.\" There is nothing they have done which can be a ground of confidence that can be compared with what thou hast done. The allusion is to the power, the wisdom, and the skill evinced in the works of creation, and in the merciful interpositions of Providence. From these the psalmist derives a proof that God is able to save. There is no such argument to which the worshippers of false gods can appeal in the time of trouble. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither are there any works like unto thy works - That is, as done by those \"gods.\" There is nothing they have done which can be a ground of confidence that can be compared with what thou hast done. The allusion is to the power, the wisdom, and the skill evinced in the works of creation, and in the merciful interpositions of Providence. From these the psalmist derives a proof that God is able to save. There is no such argument to which the worshippers of false gods can appeal in the time of trouble. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. neither … works—literally, \"nothing like thy works,\" the \"gods\" have none at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8 Among the gods there is none like unto thee, O Lord; neither are there any works like unto thy works.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9 An nations whom thou hast made shall come and worship before thee, O Lord; and shall glorify thy name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 For thou art great, and doest wondrous things: thou art God alone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11 Teach me thy way, O Lord; I will walk in thy truth: unite my heart to fear thy name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12 I will praise thee, O Lord my God, with all my heart: and I will glorify thy name for evermore.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13 For great is thy mercy toward me: and thou hast delivered my soul from the lowest hell.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:8",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Among the gods there is none like unto thee, O Lord.\" There are gods by delegated office, such as kings and magistrates, but they are as nothing in the presence of Jehovah; there are also gods by the nomination of superstition, but these are vanity itself, and cannot be compared with the living and true God. Even if the heathen idols were gods, none of them in power or even in character, could be likened unto the self-existent, all-creating God of Israel. If every imaginary deity could start into actual existence, and become really divine, yet would we choose Jehovah to be our God, and reject all others. \"Neither are there any works like unto thy works.\" What have the false gods ever made or unmade? What miracles have they wrought? When did they divide a sea, or march through a wilderness scattering bread from the skies? O Jehovah, in thy person and in thy works, thou art as far above all gods as the heavens are above the nethermost abyss.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"All nations whom thou hast made,\" and these include all mankind, since they all come of the first Adam - thy creature, and their lives are all distinct creations of thine omnipotence. All these \"shall come\" with penitent hearts, in thine own way, to thine own self, \"and worship before thee, O Lord.\" Because thou art thus above all gods, the people who have been so long deceived shall at last discover thy greatness, and shall render thee the worship which is thy due: thou hast created them all, and unto thee shall they all yield homage. This was David's reason for resorting to the Lord in trouble, for he felt that one day all men would acknowledge the Lord to be the only God. It makes us content to be in the minority to-day, when we are sure that the majority will be with us to-morrow, ay, and that the truth will one day be carried unanimously and heartily. David was not a believer in the theory that the world will grow worse and worse, and that the dispensation will wind up with general darkness, and idolatry. Earth's sun is to go down amid tenfold night if some of our prophetic brethren are to be believed. Not so do we expect, but we look for a day when the dwellers in all lands shall learn righteousness, shall trust in the Saviour, shall worship thee alone, O God, \"and shall glorify thy name.\" The modern notion has greatly damped the zeal of the church for missions, and the sooner it is shown to be unscriptural the better for the cause of God. It neither consorts with prophecy, honours God, nor inspires the church with ardour. Far hence be it driven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For thou art great.\" He had before said, \"thou art good;\" it is a grand thing when greatness and goodness are united; it is only in the Divine Being that either of them exists absolutely, and essentially. Happy is it for us that they both exist in the Lord to an equal degree. To be great and not good might lead to tyranny in the King, and for him to be good and not great might involve countless calamities upon his subjects from foreign foes, so that either alternative would be terrible; let the two be blended, and we have a monarch in whom the nation may rest and rejoice. \"And doest wondrous things.\" Being good, he is said to be ready to forgive; being great, he works wonders: we may blend the two, for there is no wonder so wonderful as the pardon of our transgressions. All that God does or makes has wonder in it; he breathes, and the wind is mystery; he speaks, and the thunder astounds us; even the commonest daisy is a marvel, and a pebble enshrines wisdom. Only to fools is anything which God has made uninteresting: the world is a world of wonders. Note that the verb doest is in the present, the Lord is doing wondrous things, they are transpiring before our eyes. Where are they? Look upon the bursting buds of spring or the maturing fruits of autumn, gaze on the sky or skim the sea, mark the results of providence and the victories of grace, everywhere at all times the great Thaumaturge stretches forth his rod of power. \"Thou art God alone.\" Alone wast thou God before thy creatures were; alone in godhead still art thou now that thou hast given life to throngs of beings; alone for ever shalt thou be, for none can ever rival thee. True religion makes no compromises, it does not admit Baal or Dagon to be a god; it is exclusive and monopolizing, claiming for Jehovah nothing less than all. The vaunted liberality of certain professors of modern thought is not to be cultivated by believers in the truth. \"Philosophic breadth\" aims at building a Pantheon, and piles a Pandemonium; it is not for us to be helpers in such an evil work. Benevolently intolerant, we would, for the good of mankind, as well as for the glory of God, undeceive mankind as to the value of their compromises, - they are mere treason to truth. Our God is not to be worshipped as one among many good and true beings, but as God alone; and his gospel is not to be preached as one of several saving systems, but as the one sole way of salvation. Lies can face each other beneath one common dome; but in the temple of truth the worship is one and indivisible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 86:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:11",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Teach me thy way, O Lord.\" Instruct me thus at all times, let me live in thy school; but teach me now especially since I am in trouble and perplexity. Be pleased to shew me the way which thy wisdom and mercy have prepared for my escape; behold I lay aside all wilfulness, and only desire to be informed as to thy holy and gracious mind. Not my way give me, but thy way teach me, I would follow thee and not be wilful: \"I will walk in thy truth.\" When taught I will practise what I know, truth shall not be a mere doctrine or sentiment to me, but a matter of daily life. The true servant of God regulates his walk by his master's will, and hence he never walks deceitfully, for God's way is ever truth. Providence has a way for us, and it is our wisdom to keep in it. We must not be as the bullock which needs to be driven and urged forward because it likes not the road, but be as men who voluntarily go where their trusted friend and helper appoints their path.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is none like unto thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either for power or readiness to hear and answer prayers. I am not now calling upon a deaf and impotent idol, for then I might cry my heart out, and all in vain, as they did, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; &c, but upon the Almighty and most gracious God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Among the gods there is none like unto thee, O Lord,.... Among the angels of heaven, as the Targum, in the king's Bible; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and who are sometimes called gods, and among whom there is none like to the Lord; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 97:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or among civil magistrates, he being King of kings, and Lord of lords, the only Potentate; among whom he judges, over whom he presides, and whom he sets up and puts down at pleasure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 82:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or among all those that are named gods in heaven, or on earth, the nominal and fictitious gods of the Gentiles, who are vanity, and the work of error: the portion of Jacob is not like them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", there is none like him, for the perfections of his nature, his power, wisdom, faithfulness, holiness, justice, mercy, grace, and goodness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither are there any works like unto thy works; as the works of creation and providence, and those of redemption and grace, in which there is such a manifest display of the perfections of his nature, Deuteronomy 3:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither are there any works like unto thy works; as the works of creation and providence, and those of redemption and grace, in which there is such a manifest display of the perfections of his nature, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Among the gods there is none like unto thee, O Lord; neither {f} are there any works like unto thy works.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Among the gods ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " none like unto thee, O Lord; neither ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are there any works",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " like unto thy works.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) He condemns all idols as they can do nothing to declare that they are gods.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is none like thee among the gods, O Lord;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And there is nought like thy works.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Based upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is frequently imitated elsewhere; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 86:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " the Psalmist dwelt on God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "willingness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to answer prayer; here he comforts himself with the thought of His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ability",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His is the power possessed by none of those who are called gods and worshipped as such.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Among the gods there is none like unto thee, O Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the Song of Moses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The imaginary gods of the heathen - not, perhaps, known to the psalmist to be wholly imaginary - are probably meant (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 95:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither are there any works like unto thy works.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"What god is there in heaven or in earth that can do according to thy works?\" Psalm 86:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Here, too, almost everything is an echo of earlier language of the Psalms and of the Law; viz., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and other passages; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where, however, אלהים, gods, is avoided; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", שׁאול תּחתּיּה from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where instead of this it is תּחתּית, just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " תּחנוּני (supplicatory prayer) instead of תּחנוּנותי (importunate supplications); and also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a doxological formula that was already in existence. The construction הקשׁיב בּ is the same as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 66:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But although for the most part flowing on only in the language of prayer borrowed from earlier periods, this Psalm is, moreover, not without remarkable significance and beauty. With the confession of the incomparableness of the Lord is combined the prospect of the recognition of the incomparable One throughout the nations of the earth. This clear unallegorical prediction of the conversion of the heathen is the principal parallel to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"All nations, which Thou hast made\" - they have their being from Thee; and although they have forgotten it (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), they will nevertheless at last come to recognise it. כּל־גּוים, since the article is wanting, are nations of all tribes (countries and nationalities); cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Tobit 13:11, ἔθνη πολλά, with ibid. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", πάντα τὰ ἔθνη. And how weightily brief and charming is the petition in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : uni cor meum, ut timeat nomen tuum! Luther has rightly departed from the renderings of the lxx, Syriac, and Vulgate: laetetur (יחדּ from חדה). The meaning, however, is not so much \"keep my heart near to the only thing,\" as \"direct all its powers and concentrate them on the one thing.\" The following group shows us what is the meaning of the deliverance out of the hell beneath (שׁאול תּחתּיּה, like ארץ תּחתּית, the earth beneath, the inner parts of the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 31:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), for which the poet promises beforehand to manifest his thankfulness (כּי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]