[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:1-8 Jacob proceeded cheerfully in his journey, after the sweet communion he had with God at Beth-el. Providence brought him to the field where his uncle's flocks were to be watered. What is said of the care of the shepherds for their sheep, may remind us of the tender concern which our Lord Jesus, the great Shepherd of the sheep, has for his flock the church; for he is the good Shepherd, that knows his sheep, and is known of them. The stone at the well's mouth was to secure it; water was scarce, it was not there for every one's use: but separate interests should not take us from helping one another. When all the shepherds came together with their flocks, then, like loving neighbours, they watered their flocks together. The law of kindness in the tongue has a commanding power, Pr 31:26. Jacob was civil to these strangers, and he found them civil to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob arrives at the well of Haran. \"The land of the sons of the east.\" The points of the heavens were defined by the usage of practical life, and not by the standard of a science yet unknown. Hence, the east means any quarter toward the sunrising. Haran was about four degrees east of Beer-sheba, and five and a half degrees north. The distance was about four hundred and fifty miles, and therefore it would take Jacob fifteen days to perform the journey at thirty miles a day. If he reached Bethel the first night, he must have travelled about fifty miles the first day. After this he proceeds on his journey without any memorable incident. In the neighborhood of Haran he comes upon a well, by which lay three flocks. This is not the well near Haran where Abraham's servant met Rebekah. It is in the pasture grounds at some distance from the town. On its mouth was a large stone, indicating that water was precious, and that the well was the common property of the surrounding natives. The custom was to gather the flocks, roll away the stone, which was too great to be moved by a boy or a female, water the flocks, and replace the stone. Jacob, on making inquiry, learns that Haran is at hand, that Laban is well, and that Rachel is drawing nigh with her father's flocks. Laban is called by Jacob the son of Nahor, that is, his grandson, with the usual latitude of relative names in Scripture ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The day is great.\" A great part of it yet remains. It is not yet the time to shut up the cattle for the night; \"water the sheep and go feed them.\" Jacob may have wished to meet with Rachel without presence of the shepherds. \"We cannot.\" There was a rule or custom that the flocks must be all assembled before the stone was rolled away for the purpose of watering the cattle. This may have been required to insure a fair distribution of the water to all parties, and especially to those who were too weak to roll away the stone.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. Jacob said, My brethren—Finding from the shepherds who were reposing there with flocks and who all belonged to Haran, that his relatives in Haran were well and that one of the family was shortly expected, he enquired why they were idling the best part of the day there instead of watering their flocks and sending them back to pasture.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He calls them ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "my brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " partly in token of respect and affection, and partly because they were of the same nature and employment with himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jacob said unto them,.... To the shepherds, though not expressly mentioned; it cannot be imagined he spoke to the flocks, but to the keepers of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my brethren, whence be ye? a kind and affable way of speaking, used even to strangers, since all men are brethren by nature; or might be used by Jacob, because they were of the same occupation with himself, shepherds, asking them of what city they were, and from whence they came? and which being answered, would lead on to a conversation, which was what he wanted: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they said, of Haran are we; the very place he was bound for, and was sent unto, Genesis 27:43. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they said, of Haran are we; the very place he was bound for, and was sent unto, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jacob said unto them, My {c} brethren, whence be ye? And they said, Of Haran are we.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Jacob said unto them, My ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " brethren, whence ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ye? And they said, Of Haran ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) It seems that in those days the custom was to call even strangers, brethren.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. the shepherds of the three flocks mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 29:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Of Haran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is nothing to shew whether Haran, the town, was near or far off.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Jacob said unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the shepherds of the three flocks), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a friendly salutation from one who was himself a shepherd), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "whence be ye?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Anticipating that their reply would reveal his whereabouts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they said, Of Haran are we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This could scarcely fail to remind Jacob of God's premise to guide him in his journey. Genesis 29:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Arrival in Haran, and Reception by Laban. - Being strengthened in spirit by the nocturnal vision, Jacob proceeded on his journey into \"the land of the sons of the East,\" by which we are to understand, not so much the Arabian desert, that reaches to the Euphrates, as Mesopotamia, which lies on the other side of that river. For there he saw the well in the field (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), by which three flocks were lying, waiting for the arrival of the other flocks of the place, before they could be watered. The remark in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the stone upon the well's mouth was large (גּדלה without the article is a predicate), does not mean that the united strength of all the shepherds was required to roll it away, whereas Jacob rolled it away alone (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but only that it was not in the power of every shepherd, much less of a shepherdess like Rachel, to roll it away. Hence in all probability the agreement that had been formed among them, that they would water the flocks together. The scene is so thoroughly in harmony with the customs of the East, both ancient and modern, that the similarity to the one described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is by no means strange (vid., Rob. Pal. i. 301, 304, ii. 351, 357, 371). Moreover the well was very differently constructed from that at which Abraham's servant met with Rebekah. There the water was drawn at once from the (open) well and poured into troughs placed ready for the cattle, as is the case now at most of the wells in the East; whereas here the well was closed up with a stone, and there is no mention of pitchers and troughs. The well, therefore, was probably a cistern dug in the ground, which was covered up or closed with a large stone, and probably so constructed, that after the stone had been rolled away the flocks could be driven to the edge to drink.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Like the cistern Bir Beshat, described by Rosen., in the valley of Hebron, or those which Robinson found in the desert of Judah (Pal. ii. 165), hollowed out in the great mass of rock, and covered with a large, thick, flat stone, in the middle of which a round hole had been left, which formed the opening of the cistern, and in many cases was closed up with a heavy stone, which it would take two or three men to roll away.) ",
        "children": []
      }
    ]
  }
]