[{"header":"David's Activities in Jerusalem(A)"},{"num":14,"verse":"King Hiram of Tyre sent a trade mission to David; he provided him with cedar logs and with stonemasons and carpenters to build a palace. "},{"num":2,"verse":"And so David realized that the Lord had established him as king of Israel and was making his kingdom prosperous for the sake of his people."},{"num":3,"verse":"There in Jerusalem, David married more wives and had more sons and daughters. "},{"num":4,"verse":"The following children were born to him in Jerusalem: Shammua, Shobab, Nathan, Solomon, "},{"num":5,"verse":"Ibhar, Elishua, Elpelet, "},{"num":6,"verse":"Nogah, Nepheg, Japhia, "},{"num":7,"verse":"Elishama, Beeliada, and Eliphelet."},{"header":"Victory over the Philistines(B)"},{"num":8,"verse":"When the Philistines heard that David had now been made king over the whole country of Israel, their army went out to capture him. So David marched out to meet them. "},{"num":9,"verse":"The Philistines arrived at Rephaim Valley and began plundering. "},{"num":10,"verse":"David asked God, “Shall I attack the Philistines? Will you give me the victory?”"},{"num":11,"verse":"So David attacked them at Baal Perazim and defeated them. He said, “God has used me to break through the enemy army like a flood.” So that place is called Baal Perazim. "},{"num":12,"verse":"When the Philistines fled, they left their idols behind, and David gave orders for them to be burned."},{"num":13,"verse":"Soon the Philistines returned to the valley and started plundering it again. "},{"num":14,"verse":"Once more David consulted God, who answered, “Don't attack them from here, but go around and get ready to attack them from the other side, near the balsam trees. "},{"num":15,"verse":"When you hear the sound of marching in the treetops, then attack, because I will be marching ahead of you to defeat the Philistine army.” "},{"num":16,"verse":"David did what God had commanded, and so he drove the Philistines back from Gibeon all the way to Gezer. "},{"num":17,"verse":"David's fame spread everywhere, and the Lord made every nation afraid of him."}]