[[],[{"type":"header","content":"David Builds"}],[{"type":"prose","content":"King Hiram of Tyre sent an envoy to David, along with cedar lumber, masons, and carpenters to build him a royal palace. Then David knew for sure that  had confirmed him as king over Israel, because of the rising reputation that  was giving his kingdom for the benefit of his people Israel. David married more wives and had more children in Jerusalem. His children born in Jerusalem were Shammua, Shobab, Nathan, Solomon, Ibhar, Elishua, Elpelet, Nogah, Nepheg, Japhia, Elishama, Beeliada, and Eliphelet.* * *"}],[{"type":"prose","content":"The minute the Philistines heard that David had been made king over a united Israel, they went out in force to capture David. When David got the report, he marched out to confront them. On their way, the Philistines stopped off to plunder the Valley of Rephaim."}],[{"type":"prose","content":"David prayed to God: “Is this the right time to attack the Philistines? Will you give me the victory?” answered, “Attack; I’ll give you the victory.”"}],[{"type":"prose","content":"David attacked at Baal Perazim and slaughtered them. David said, “God exploded my enemies, as water explodes from a burst pipe.” That’s how the place got its name, Baal Perazim (Baal-Explosion). The Philistines left their gods behind and David ordered that they be burned up."}],[{"type":"prose","content":"And then the Philistines were back at it again, plundering in the valley. David again prayed to God. God answered, “This time don’t attack head-on; circle around and come at them out of the balsam grove. When you hear a sound like shuffling feet in the tops of the balsams, attack; God will be two steps ahead of you, slaughtering the Philistines.”"}],[{"type":"prose","content":"David did exactly as God commanded, slaughtering Philistines all the way from Gibeon to Gezer."}],[{"type":"prose","content":"David was soon famous all over the place, far and near; and  put the fear of God into the godless nations."}]]