[{"header":"David in Jerusalem"},{"num":14,"verse":"Now King Hiram of Tyre sent men with cedar trees to David. With them came men who worked with stone and wood. They came to build a house for him. "},{"num":2,"verse":"David understood that the Lord had made him to be king of Israel. He knew that his nation was very honored because of God’s people Israel."},{"num":3,"verse":"Then David took more wives at Jerusalem. He became the father of more sons and daughters. "},{"num":4,"verse":"The names of the children born to him in Jerusalem are Shammua, Shobab, Nathan, Solomon, "},{"num":5,"verse":"Ibhar, Elishua, Elpelet, "},{"num":6,"verse":"Nogah, Nepheg, Japhia, "},{"num":7,"verse":"Elishama, Beeliada and Eliphelet."},{"header":"Battle with the Philistines"},{"num":8,"verse":"The Philistines heard that David had been chosen as king of all Israel. So they went up to look for him. David heard of it and went out against them. "},{"num":9,"verse":"Now the Philistines had come to fight a surprise battle in the valley of Rephaim. "},{"num":10,"verse":"David asked God, “Should I go fight against the Philistines? Will You give them to me?” And the Lord said to him, “Go, for I will give them to you.” "},{"num":11,"verse":"So they came up to Baal-perazim, and David won the battle against them there. David said, “By my hand God has broken through those who hate me, like the breaking through of a flood.” So they gave that place the name Baal-perazim. "},{"num":12,"verse":"The Philistines left their gods there. So David had them burned with fire."},{"num":13,"verse":"The Philistines fought another surprise battle in the valley. "},{"num":14,"verse":"So David asked God again what he should do. God said to him, “Do not go after them. Go around behind them, and come upon them in front of the balsam trees. "},{"num":15,"verse":"When you hear the sound of their steps in the tops of the balsam trees, then go out to battle. For God will have gone out before you to destroy the Philistine army.” "},{"num":16,"verse":"David did just as God had told him, and they destroyed the Philistine army from Gibeon as far as Gezer. "},{"num":17,"verse":"Then the name of David became known in all the lands. The Lord brought the fear of him upon all the nations."}]