[{"header":"Jesus Denounces the Scribes and the Pharisees(A)"},{"num":23,"verse":"Then Jesus told the crowds and his disciples, "},{"num":2,"verse":"“The scribes and the Pharisees administer the authority of Moses, "},{"num":3,"verse":"so do whatever they tell you and follow it, but stop doing what they do, because they don’t do what they say. "},{"num":4,"verse":"They tie up burdens that are heavy and unbearable and lay them on people’s shoulders, but they refuse to lift a finger to remove them."},{"num":5,"verse":"“They do everything to be seen by people. They increase the size of their phylacteries and lengthen the tassels of their garments. "},{"num":6,"verse":"They love to have the places of honor at festivals, the best seats in the synagogues, "},{"num":7,"verse":"to be greeted in the marketplaces, and to be called ‘Rabbi’ by people."},{"num":8,"verse":"“But you are not to be called ‘Rabbi,’ because you have only one teacher, and all of you are brothers. "},{"num":9,"verse":"And don’t call anyone on earth ‘Father,’ because you have only one Father, the one in heaven. "},{"num":10,"verse":"Nor are you to be called ‘Teachers,’ because you have only one teacher, the Messiah! "},{"num":11,"verse":"The person who is greatest among you must be your servant. "},{"num":12,"verse":"Whoever exalts himself will be humbled, and whoever humbles himself will be exalted."},{"num":13,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You shut the door to the kingdom from heaven in people’s faces. You don’t go in yourselves, and you don’t allow those who are trying to enter to go in."},{"num":14,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You devour widows’ houses and say long prayers to cover it up. Therefore, you will receive greater condemnation!"},{"num":15,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You travel over land and sea to make a single convert, and when this happens you make him twice as fit for hell as you are."},{"num":16,"verse":"“How terrible it will be for you, blind guides! You say, ‘Whoever swears an oath by the sanctuary is excused, but whoever swears an oath by the gold of the sanctuary must keep his oath.’ "},{"num":17,"verse":"You blind fools! What is more important, the gold or the sanctuary that made the gold holy? "},{"num":18,"verse":"Again you say, ‘Whoever swears an oath by the altar is excused, but whoever swears by the gift that is on it must keep his oath.’ "},{"num":19,"verse":"You blind men! Which is more important, the gift or the altar that makes the gift holy? "},{"num":20,"verse":"Therefore, the one who swears an oath by the altar swears by it and by everything on it. "},{"num":21,"verse":"The one who swears an oath by the sanctuary swears by it and by the one who lives there. "},{"num":22,"verse":"And the one who swears an oath by heaven swears by God’s throne and by the one who sits on it."},{"num":23,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You give a tenth of your mint, dill, and cummin, but have neglected the more important matters of the Law: justice, mercy, and faithfulness. These are the things you should have practiced, without neglecting the others. "},{"num":24,"verse":"You blind guides! You filter out a gnat, yet swallow a camel!"},{"num":25,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You clean the outside of the cup and the plate, but on the inside they are full of greed and self-indulgence. "},{"num":26,"verse":"You blind Pharisee! First clean the inside of the cup, so that its outside may also be clean."},{"num":27,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You are like whitewashed tombs that look beautiful on the outside but inside are full of dead people’s bones and every kind of impurity. "},{"num":28,"verse":"In the same way, on the outside you look righteous to people, but inside you are full of hypocrisy and lawlessness."},{"num":29,"verse":"“How terrible it will be for you, scribes and Pharisees, you hypocrites! You build tombs for the prophets and decorate the monuments of the righteous. "},{"num":30,"verse":"Then you say, ‘If we had been living in the days of our ancestors, we would have had no part with them in shedding the blood of the prophets.’ "},{"num":31,"verse":"Therefore, you testify against yourselves that you are descendants of those who murdered the prophets. "},{"num":32,"verse":"Then finish what your ancestors started! "},{"num":33,"verse":"You snakes, you children of serpents! How can you escape being condemned to hell?"},{"num":34,"verse":"“That is why I am sending you prophets, wise men, and scribes. Some of them you will kill and crucify, and some of them you will whip in your synagogues and persecute from town to town. "},{"num":35,"verse":"As a result, you will be held accountable for all the righteous blood shed on earth, from the blood of the righteous Abel to the blood of Berechiah’s son Zechariah, whom you murdered between the sanctuary and the altar. "},{"num":36,"verse":"I tell all of you with certainty, all these things will happen to those living today.”"},{"header":"Jesus Rebukes Jerusalem(B)"},{"num":37,"verse":"“O Jerusalem, Jerusalem, who kills the prophets and stones to death those who have been sent to her! How often I wanted to gather your children together as a hen gathers her chicks under her wings, but you were unwilling! "},{"num":38,"verse":"Look! Your house is left abandoned! "},{"num":39,"verse":"I tell you, you will not see me again until you say, ‘How blessed is the one who comes in the name of the Lord!’”"}]