[[],[{"type":"header","content":"Seven Woes"},{"type":"prose","content":"Then Jesus said to the crowds and to his disciples, "}],[{"type":"prose","content":"“The experts in the law and the Pharisees sit on Moses’ seat. "}],[{"type":"prose","content":"Therefore pay attention to what they tell you and do it. But do not do what they do, for they do not practice what they teach. "}],[{"type":"prose","content":"They tie up heavy loads, hard to carry, and put them on men’s shoulders, but they themselves are not willing even to lift a finger to move them. "}],[{"type":"prose","content":"They do all their deeds to be seen by people, for they make their phylacteries wide and their tassels long. "}],[{"type":"prose","content":"They love the place of honor at banquets and the best seats in the synagogues "}],[{"type":"prose","content":"and elaborate greetings in the marketplaces, and to have people call them ‘Rabbi.’ "}],[{"type":"prose","content":"But you are not to be called ‘Rabbi,’ for you have one Teacher and you are all brothers. "}],[{"type":"prose","content":"And call no one your ‘father’ on earth, for you have one Father, who is in heaven. "}],[{"type":"prose","content":"Nor are you to be called ‘teacher,’ for you have one teacher, the Christ. "}],[{"type":"prose","content":"The greatest among you will be your servant. "}],[{"type":"prose","content":"And whoever exalts himself will be humbled, and whoever humbles himself will be exalted."}],[{"type":"prose","content":"“But woe to you, experts in the law and you Pharisees, hypocrites! You keep locking people out of the kingdom of heaven! For you neither enter nor permit those trying to enter to go in."}],[{"type":"prose","content":"“Woe to you, experts in the law and you Pharisees, hypocrites! You cross land and sea to make one convert, and when you get one, you make him twice as much a child of hell as yourselves!"}],[{"type":"prose","content":"“Woe to you, blind guides, who say, ‘Whoever swears by the temple is bound by nothing. But whoever swears by the gold of the temple is bound by the oath.’ "}],[{"type":"prose","content":"Blind fools! Which is greater, the gold or the temple that makes the gold sacred? "}],[{"type":"prose","content":"And, ‘Whoever swears by the altar is bound by nothing. But if anyone swears by the gift on it he is bound by the oath.’ "}],[{"type":"prose","content":"You are blind! For which is greater, the gift or the altar that makes the gift sacred? "}],[{"type":"prose","content":"So whoever swears by the altar swears by it and by everything on it. "}],[{"type":"prose","content":"And whoever swears by the temple swears by it and the one who dwells in it. "}],[{"type":"prose","content":"And whoever swears by heaven swears by the throne of God and the one who sits on it."}],[{"type":"prose","content":"“Woe to you, experts in the law and you Pharisees, hypocrites! You give a tenth of mint, dill, and cumin, yet you neglect what is more important in the law—justice, mercy, and faithfulness! You should have done these things without neglecting the others. "}],[{"type":"prose","content":"Blind guides! You strain out a gnat yet swallow a camel!"}],[{"type":"prose","content":"“Woe to you, experts in the law and you Pharisees, hypocrites! You clean the outside of the cup and the dish, but inside they are full of greed and self-indulgence. "}],[{"type":"prose","content":"Blind Pharisee! First clean the inside of the cup, so that the outside may become clean too!"}],[{"type":"prose","content":"“Woe to you, experts in the law and you Pharisees, hypocrites! You are like whitewashed tombs that look beautiful on the outside but inside are full of the bones of the dead and of everything unclean. "}],[{"type":"prose","content":"In the same way, on the outside you look righteous to people, but inside you are full of hypocrisy and lawlessness."}],[{"type":"prose","content":"“Woe to you, experts in the law and you Pharisees, hypocrites! You build tombs for the prophets and decorate the graves of the righteous. "}],[{"type":"prose","content":"And you say, ‘If we had lived in the days of our ancestors, we would not have participated with them in shedding the blood of the prophets.’ "}],[{"type":"prose","content":"By saying this you testify against yourselves that you are descendants of those who murdered the prophets. "}],[{"type":"prose","content":"Fill up then the measure of your ancestors! "}],[{"type":"prose","content":"You snakes, you offspring of vipers! How will you escape being condemned to hell?"}],[{"type":"prose","content":"“For this reason I am sending you prophets and wise men and experts in the law, some of whom you will kill and crucify, and some you will flog in your synagogues and pursue from town to town, "}],[{"type":"prose","content":"so that on you will come all the righteous blood shed on earth, from the blood of righteous Abel to the blood of Zechariah son of Barachiah, whom you murdered between the temple and the altar. "}],[{"type":"prose","content":"I tell you the truth, this generation will be held responsible for all these things!"}],[{"type":"header","content":"Judgment on Israel"},{"type":"prose","content":"“O Jerusalem, Jerusalem, you who kill the prophets and stone those who are sent to you! How often I have longed to gather your children together as a hen gathers her chicks under her wings, but you would have none of it! "}],[{"type":"prose","content":"Look, your house is left to you desolate! "}],[{"type":"prose","content":"For I tell you, you will not see me from now until you say, ‘’”"}]]