[{"header":"Warnings against Scribes and Pharisees"},{"num":23,"verse":"Then Jesus spoke to the crowds and to his disciples: "},{"num":2,"verse":"‘The scribes and Pharisees’, he said, ‘sit on the seat of Moses. "},{"num":3,"verse":"So you must do whatever they tell you, and keep it, but don’t do the things they do. You see, they talk but they don’t do. "},{"num":4,"verse":"They tie up heavy bundles which are difficult to carry, and they dump them on people’s shoulders – but they themselves aren’t prepared to lift a little finger to move them!"},{"num":5,"verse":"‘Everything they do is for show, to be seen by people. Yes, they make their prayer-boxes large and their prayer-tassels long, "},{"num":6,"verse":"and they love the chief places at dinners, the main seats in the synagogues, "},{"num":7,"verse":"the greetings in the market-places, and having people call them “Rabbi”."},{"num":8,"verse":"‘You mustn’t be called “Rabbi”. You have one teacher, and you are all one family. "},{"num":9,"verse":"And you shouldn’t call anyone “father” on earth, because you have one father, in heaven. "},{"num":10,"verse":"Nor should you be called “teacher”, because you have one teacher, the Messiah."},{"num":11,"verse":"‘The greatest among you should be your servant. "},{"num":12,"verse":"People who make themselves great will be humbled; and people who humble themselves will become great.’"},{"header":"Condemnation of Scribes and Pharisees (1)"},{"num":13,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites!’ Jesus continued. ‘You lock up the kingdom of heaven in front of people’s faces. You don’t go in yourselves, and when other people try to enter, you stop them."},{"num":15,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites! You cross sea and land to make one single Gentile take up Judaism, and when that happens you make the convert twice as much a child of Gehenna as you are yourselves."},{"num":16,"verse":"‘Woe betide you, you blind guides! This is what you say: “If anyone swears by the Temple, it’s nothing; but if anyone swears by the gold in the Temple, the oath is valid.” "},{"num":17,"verse":"How crazy and blind can you get! Which is greater, the gold, or the Temple that makes the gold sacred? "},{"num":18,"verse":"And you say, “If anyone swears by the altar, it’s nothing; but if anyone swears by the gift on it, the oath is valid.” "},{"num":19,"verse":"How blind you are! Which is greater, the gift, or the altar that makes the gift sacred? "},{"num":20,"verse":"So whoever swears by the altar swears by it and by everything on it. "},{"num":21,"verse":"And whoever swears by the Temple swears by it and by the one who lives in it. "},{"num":22,"verse":"And whoever swears by heaven swears by the throne of God and by the one who sits on it.’"},{"header":"Condemnation of Scribes and Pharisees (2)"},{"num":23,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites!’ Jesus went on. ‘You tithe mint and dill and cummin, and you omit the serious matters of the law like justice, mercy and loyalty. You should have done these, without neglecting the others. "},{"num":24,"verse":"You’re blind guides! You filter out a gnat, but you gulp down a camel!"},{"num":25,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites! You scrub the outside of the cup and the dish, but the inside is full of extortion and moral flabbiness. "},{"num":26,"verse":"You blind Pharisee, first make the inside of the cup clean, and then the outside will be clean as well."},{"num":27,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites! You’re like whitewashed graves, which look very fine on the outside, but inside they are full of the bones of the dead and uncleanness of every kind. "},{"num":28,"verse":"That’s like you: on the outside you appear to be virtuous and law-abiding, but inside you are full of hypocrisy and lawlessness."},{"num":29,"verse":"‘Woe betide you, scribes and Pharisees, you hypocrites! You build the tombs of the prophets, and you decorate the memorials of the righteous, "},{"num":30,"verse":"and you say, “If we’d lived in the days of our ancestors, we wouldn’t have gone along with them in killing the prophets.” "},{"num":31,"verse":"So you testify against yourselves that you are the children of the people who murdered the prophets! "},{"num":32,"verse":"Well then, go ahead: complete the work your ancestors began! "},{"num":33,"verse":"You snakes, you nest of vipers, how can you escape the judgment of Gehenna?’"},{"header":"Judgment on Jerusalem and Its Leaders"},{"num":34,"verse":"‘Because of all this,’ Jesus concluded, ‘I’m sending you prophets, wise men and scribes. Some of them you will kill and crucify. Some of them you will whip in your synagogues. You’ll chase them from town to town. "},{"num":35,"verse":"That’s how all the righteous blood that’s been shed on earth, from the blood of righteous Abel to the blood of Zechariah son of Barachiah – you murdered him between sanctuary and altar – all that blood will come upon you. "},{"num":36,"verse":"I’m telling you the solemn truth: it will all come on this generation."},{"num":37,"verse":"‘Jerusalem, Jerusalem, killing the prophets and stoning those who are sent to you! How often have I longed to gather up your children, the way a hen gathers up her brood under her wings, and you didn’t want me to! "},{"num":38,"verse":"Now, see here: your house has been abandoned by God; it’s a ruin. "},{"num":39,"verse":"Yes, I tell you: you won’t see me again from now on until you say, “God’s blessing on the coming one, the one who comes in the Lord’s own name!” ’"}]