[{"num":23,"verse":"Then Jesus spoke to the multitude, and to His disciples,"},{"num":2,"verse":"saying, “The scribes and the Pharisees sit in Moses’ seat."},{"num":3,"verse":"“Therefore, all of whatever they ask you to observe, observe and do. But do not imitate their deeds, for they do not do as they say."},{"num":4,"verse":"“For they bind heavy burdens, and hard to bear, and lay them on men’s shoulders. But they themselves will not lift a finger to move them."},{"num":5,"verse":"“They do all their works to be seen by man. For they make their phylacteries broad, and the fringes of their garments long."},{"num":6,"verse":"“And they love the chief place at feasts, and to have the chief seats in the assemblies;"},{"num":7,"verse":"“and greetings in the markets, and to be called by man, ‘Rabbi, Rabbi.’"},{"num":8,"verse":"“But do not be called, ‘Rabbi’. For One is your Master - Christ, and all of you are brothers."},{"num":9,"verse":"“And call no man your father upon the earth. For there is but One, your Father Who is in Heaven."},{"num":10,"verse":"“Do not be called ‘Masters’. For One is your Master - Christ."},{"num":11,"verse":"“But the one who is greatest among you, let him be your servant."},{"num":12,"verse":"“For whoever will exalt himself shall be brought low. And whoever will humble himself shall be exalted."},{"num":13,"verse":"“Therefore, woe to you, scribes and Pharisees. Hypocrites! Because you shut up the Kingdom of Heaven before man. For you yourselves do not go in, nor do you allow those who wish entrance to come in."},{"num":14,"verse":"“Woe to you, scribes and Pharisees. Hypocrites! For you devour widows’ houses, even under a pretense of long prayers. Therefore, you shall receive the greater damnation."},{"num":15,"verse":"“Woe to you, scribes and Pharisees, Hypocrites! For you traverse sea and land to make one proselyte. And when he is made, you make him twofold more a child of hell than you yourselves!"},{"num":16,"verse":"“Woe to you, blind guides, who say, ‘Whoever swears by the Temple, it is nothing. But whoever swears by the gold of the Temple, he sins.’"},{"num":17,"verse":"“You fools, and blind! Which is greater, the gold or the Temple that sanctifies the gold?"},{"num":18,"verse":"“And, ‘Whoever swears by the altar, it is nothing. But whoever swears by the offering upon it, sins.’"},{"num":19,"verse":"“You fools, and blind! Which is greater, the offering or the altar which sanctifies the offering?"},{"num":20,"verse":"“Therefore, whoever swears by the altar, swears by it and by all things thereupon."},{"num":21,"verse":"“And whoever swears by the Temple, swears by it and by Him Who dwells therein."},{"num":22,"verse":"“And the one who swears by Heaven, swears by the throne of God and by Him Who sits thereupon."},{"num":23,"verse":"“Woe to you, scribes and Pharisees, Hypocrites! For you tithe mint and anise and cumin, and leave the weightier matters of the law, judgment, and mercy and fidelity. These you ought to have done, and not to have left the other."},{"num":24,"verse":"You blind guides, who strain out a gnat and swallow a camel!"},{"num":25,"verse":"“Woe to you, scribes and Pharisees, Hypocrites! For you make clean the outside of the cup and the platter. But inside they are full of bribery and excess."},{"num":26,"verse":"“You blind Pharisee! First, cleanse the inside of the cup and platter, so that the outside of them may be clean also."},{"num":27,"verse":"“Woe to you, scribes and Pharisees, Hypocrites! For you are like whitened tombs which appear beautiful outside, but inside are full of dead men’s bones and all filthiness."},{"num":28,"verse":"“So are you also. For outward you appear righteous to man, but within you are full of hypocrisy and iniquity."},{"num":29,"verse":"“Woe to you, scribes and Pharisees, Hypocrites! For you build the tombs of the Prophets, and garnish the sepulchers of the righteous,"},{"num":30,"verse":"“and say, ‘If we had lived in the days of our fathers, we would not have been partners with them in the blood of the Prophets.’"},{"num":31,"verse":"“So then you are witnesses to yourselves that you are the children of those who murdered the Prophets."},{"num":32,"verse":"“And you fill up the measure of your fathers."},{"num":33,"verse":"“O serpents! The generation of vipers! How shall you escape the damnation of Hell!"},{"num":34,"verse":"“Therefore, behold, I send to you Prophets, and wise men, and scribes. And some of them you shall kill and crucify. And some of them you shall scourge in your synagogues and persecute from city to city."},{"num":35,"verse":"“So that upon you may come all the righteous blood that was shed upon the earth, from the blood of Abel the righteous to the blood of Zechariah the son of Berechiah, whom you killed between the Temple and the altar."},{"num":36,"verse":"“Truly I say to you that all these things shall come upon this generation."},{"num":37,"verse":"“Jerusalem, Jerusalem; who kills the Prophets and stones those who are sent to you! How often would I have gathered your children together - as the hen gathers her chickens under her wings - and you would not!"},{"num":38,"verse":"“Behold, your house shall be left to you desolate."},{"num":39,"verse":"“For I say to you, you shall not see Me again until you say, ‘Blessed is the One Who comes in the Name of the Lord’.”"}]