[{"header":"Samuel’s call"},{"num":3,"verse":"Now the boy Samuel was serving the Lord under Eli. The Lord’s word was rare at that time, and visions weren’t widely known."},{"num":2,"verse":"One day Eli, whose eyes had grown so weak he was unable to see, was lying down in his room."},{"num":3,"verse":"God’s lamp hadn’t gone out yet, and Samuel was lying down in the Lord’s temple, where God’s chest was."},{"num":4,"verse":"The Lord called to Samuel. “I’m here,” he said."},{"num":5,"verse":"Samuel hurried to Eli and said, “I’m here. You called me?”"},{"num":6,"verse":"Again the Lord called Samuel, so Samuel got up, went to Eli, and said, “I’m here. You called me?”"},{"num":7,"verse":"(Now Samuel didn’t yet know the Lord, and the Lord’s word hadn’t yet been revealed to him.)"},{"num":8,"verse":"A third time the Lord called Samuel. He got up, went to Eli, and said, “I’m here. You called me?”"},{"num":9,"verse":"So Eli said to Samuel, “Go and lie down. If he calls you, say, ‘Speak, Lord. Your servant is listening.’” So Samuel went and lay down where he’d been."},{"num":10,"verse":"Then the Lord came and stood there, calling just as before, “Samuel, Samuel!”"},{"num":11,"verse":"The Lord said to Samuel, “I am about to do something in Israel that will make the ears of all who hear it tingle!"},{"num":12,"verse":"On that day, I will bring to pass against Eli everything I said about his household—every last bit of it!"},{"num":13,"verse":"I told him that I would punish his family forever because of the wrongdoing he knew about—how his sons were cursing God, but he wouldn’t stop them."},{"num":14,"verse":"Because of that I swore about Eli’s household that his family’s wrongdoing will never be reconciled by sacrifice or by offering.”"},{"num":15,"verse":"Samuel lay there until morning, then opened the doors of the Lord’s house. Samuel was afraid to tell the vision to Eli."},{"num":16,"verse":"But Eli called Samuel, saying: “Samuel, my son!”"},{"num":17,"verse":"“What did he say to you?” Eli asked. “Don’t hide anything from me. May God deal harshly with you and worse still if you hide from me a single word from everything he said to you.”"},{"num":18,"verse":"So Samuel told him everything and hid nothing from him."},{"num":19,"verse":"So Samuel grew up, and the Lord was with him, not allowing any of his words to fail."},{"num":20,"verse":"All Israel from Dan to Beer-sheba knew that Samuel was trustworthy as the Lord’s prophet."},{"num":21,"verse":"The Lord continued to appear at Shiloh because the Lord revealed himself to Samuel at Shiloh through the Lord’s own word."}]