[{"header":"The Lord Calls Out to Samuel"},{"num":3,"verse":"The boy Samuel served the Lord under the direction of Eli. In those days the Lord didn’t give many messages to his people. He didn’t give them many visions."},{"num":2,"verse":"One night Eli was lying down in his usual place. His eyes were becoming so weak he couldn’t see very well. "},{"num":3,"verse":"Samuel was lying down in the Lord’s house. That’s where the ark of God was kept. The lamp of God was still burning. "},{"num":4,"verse":"The Lord called out to Samuel."},{"num":5,"verse":"He ran over to Eli and said, “Here I am. You called out to me.”"},{"num":6,"verse":"Again the Lord called out, “Samuel!” Samuel got up and went to Eli. He said, “Here I am. You called out to me.”"},{"num":7,"verse":"Samuel didn’t know the Lord yet. That’s because the Lord still hadn’t given him a message."},{"num":8,"verse":"The Lord called out for the third time. He said, “Samuel!” Samuel got up and went to Eli. He said, “Here I am. You called out to me.”"},{"num":9,"verse":"So Eli told Samuel, “Go and lie down. If someone calls out to you again, say, ‘Speak, Lord. I’m listening.’ ” So Samuel went and lay down in his place."},{"num":10,"verse":"The Lord came and stood there. He called out, just as he had done the other times. He said, “Samuel! Samuel!”"},{"num":11,"verse":"The Lord said to Samuel, “Pay attention! I am about to do something terrible in Israel. It will make the ears of everyone who hears about it tingle. "},{"num":12,"verse":"At that time I will do everything to Eli and his family that I said I would. I will finish what I have started. "},{"num":13,"verse":"I told Eli I would punish his family forever. He knew his sons were sinning. He knew they were saying bad things about me. In spite of that, he did not stop them. "},{"num":14,"verse":"So I made a promise to the family of Eli. I said, ‘The sins of Eli’s family will never be paid for by bringing sacrifices or offerings.’ ”"},{"num":15,"verse":"Samuel lay down until morning. Then he opened the doors of the Lord’s house. He was afraid to tell Eli about the vision he had received. "},{"num":16,"verse":"But Eli called out to him. He said, “Samuel, my son.”"},{"num":17,"verse":"“What did the Lord say to you?” Eli asked. “Don’t hide from me anything he told you. If you do, may God punish you greatly.” "},{"num":18,"verse":"So Samuel told him everything. He didn’t hide anything from him. Then Eli said, “He is the Lord. Let him do what he thinks is best.”"},{"num":19,"verse":"As Samuel grew up, the Lord was with him. He made everything Samuel said come true. "},{"num":20,"verse":"So all the Israelites recognized that Samuel really was a prophet of the Lord. Everyone from Dan all the way to Beersheba knew it. "},{"num":21,"verse":"The Lord continued to appear at Shiloh. There he made himself known to Samuel through the messages he gave him."}]