[{"header":"Calling of Samuel"},{"num":3,"verse":"Now the boy Samuel was in the service of Adonai under Eli. In those days the word of Adonai was rare—there were no visions breaking through. "},{"num":2,"verse":"One day, Eli was lying down in his place—now his eyes had grown dim so that he could not see, "},{"num":3,"verse":"and the lamp of God had not yet gone out. Samuel was lying down in Adonai’s Temple, where the ark of God was. "},{"num":4,"verse":"Then Adonai called, “Samuel!” So he answered, “Here I am.” "},{"num":5,"verse":"Then he ran to Eli and said, “Here I am, for you called me.”"},{"num":6,"verse":"Then Adonai called Samuel yet again. So Samuel arose and went to Eli, and said, “Here I am, for you called me.”"},{"num":7,"verse":"Now Samuel had not experienced Adonai yet, since the word of Adonai had not yet been revealed to him."},{"num":8,"verse":"Adonai called Samuel again for the third time. So he got up and went to Eli, and said “Here I am, for you called me.” Then Eli perceived that Adonai was calling the boy."},{"num":9,"verse":"So Eli said to Samuel, “Go back to sleep, and if He calls you, say: ‘Speak, Adonai, for Your servant is listening.’” So Samuel went back and lay down in his place. "},{"num":10,"verse":"Then Adonai came and stood and called as at the other times, “Samuel! Samuel!” Then Samuel said, “Speak, for Your servant is listening.”"},{"num":11,"verse":"Then Adonai said to Samuel, “Behold, I am about to do something in Israel at which both ears of everyone that hears it will tingle. "},{"num":12,"verse":"In that day I will perform against Eli all that I have spoken concerning his house, from beginning to end. "},{"num":13,"verse":"For I have told him that I am about to judge his house forever for the iniquity that he knew about, because his sons brought a curse on themselves yet he did not rebuke them. "},{"num":14,"verse":"Therefore I have sworn to the house of Eli that the iniquity of Eli’s house will never be atoned for by sacrifice or offering.”"},{"num":15,"verse":"Then Samuel lay down until the morning, when he opened the doors of the House of Adonai. But Samuel was afraid to tell Eli about the vision. "},{"num":16,"verse":"Then Eli called Samuel and said, “Samuel, my son.”"},{"num":17,"verse":"“What is the word that He has spoken to you?” he said. “Please don’t hide it from me. May God do so to you and even more if you hide anything at all from me that He spoke to you.” "},{"num":18,"verse":"So Samuel told him everything and hid nothing. Then Eli said, “He is Adonai. May He do what is good in His eyes.”"},{"num":19,"verse":"So Samuel grew up and Adonai was with him, and let none of his words fall to the ground. "},{"num":20,"verse":"Then all Israel from Dan to Beersheba knew that Samuel was entrusted as a prophet of Adonai. "},{"num":21,"verse":"Adonai started to appear once more in Shiloh, for Adonai revealed Himself to Samuel in Shiloh by the word of Adonai."}]