[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The staves ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not be taken from it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The staves were to remain always in the rings, whether the ark was in motion or at rest, that there might never at any time be a necessity for touching the ark itself, or even the rings. He who touched the ark imperilled his life. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 6:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:10-22 The ark was a chest, overlaid with gold, in which the two tables of the law were to be kept. These tables are called the testimony; God in them testified his will. This law was a testimony to the Israelites, to direct them in their duty, and would be a testimony against them, if they transgressed. This ark was placed in the holy of holies; the blood of the sacrifices was sprinkled, and the incense burned, before it, by the high priest; and above it appeared the visible glory, which was the symbol of the Divine presence. This was a type of Christ in his sinless nature, which saw no corruption, in personal union with his Divine nature, atoning for our sins against it, by his death. The cherubim of gold looked one towards another, and both looked downward toward the ark. It denotes the angels' attendance on the Redeemer, their readiness to do his will, their presence in the assemblies of saints, and their desire to look into the mysteries of the gospel. It was covered with a covering of gold, called the mercy-seat. God is said to dwell, or sit between the cherubim, on the mercy-seat. There he would give his law, and hear supplicants, as a prince on his throne.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall not be taken from it - This direction was probably given in order that the ark might not be touched by the hand (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. staves shall be in the rings of the ark—that is, always remain in the rings, whether the ark be at rest or in motion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The staves shall be in the rings of the ark,.... Not only be put into them, but remain in them, yea, always: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall not be taken from it; or, as the Septuagint version is, be immovable; so that those gold rings in the ark may signify the churches of Christ, which are instrumental to bear his name, and spread his truth in the world, comparable to rings for their circular form, being the purest and most perfect bodies of men on earth, and to gold rings for their worth and value, preciousness, excellency, and duration; and with whom the ministers of the Gospel, comparable to golden staves, are always to be, and never depart from them: or else they may signify the perfect and precious doctrines of Christ, in which his ministers are always to be; either in meditation on them, or in preaching of them, and by which they are always to abide, see 1 Timothy 4:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they shall not be taken from it; or, as the Septuagint version is, be immovable; so that those gold rings in the ark may signify the churches of Christ, which are instrumental to bear his name, and spread his truth in the world, comparable to rings for their circular form, being the purest and most perfect bodies of men on earth, and to gold rings for their worth and value, preciousness, excellency, and duration; and with whom the ministers of the Gospel, comparable to golden staves, are always to be, and never depart from them: or else they may signify the perfect and precious doctrines of Christ, in which his ministers are always to be; either in meditation on them, or in preaching of them, and by which they are always to abide, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 4:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The staves shall be in the rings of the ark: they shall not be taken from it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The staves, when once inserted into the rings of the ark, were never to be taken from them. The object probably was that there might be no need of touching even the rings, when the ark was set down or taken up. The bearers took hold of the staves only, which were no part of the ark. On the danger of touching the ark itself, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:6, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Exodus 25:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Ark of the Covenant (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 37:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - They were to make an ark (ארון) of acacia-wood, two cubits and a half long, one and a half broad, and one and a half high, and to plate it with pure gold both within and without. Round about it they were to construct a golden זר, i.e., probably a golden rim, encircling it like an ornamental wreath. They were also to cast four golden rings and fasten them to the four feet (פּעמת walking feet, feet bent as if for walking) of the ark, two on either side; and to cut four poles of acacia-wood and plate them with gold, and put them through the rings for carrying the ark. The poles were to remain in the rings, without moving from them, i.e., without being drawn out, that the bearers might not touch the ark itself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]