[{"header":"False Teachers"},{"num":2,"verse":"In the past there were false prophets among God’s people. It is the same now. You will have some false teachers in your group. They will teach things that are wrong—ideas that will cause people to be lost. And they will teach in a way that will be hard for you to see that they are wrong. They will even refuse to follow the Master who bought their freedom. And so they will quickly destroy themselves."},{"num":2,"verse":"Many people will follow them in the morally wrong things they do. And because of them, others will say bad things about the way of truth we follow."},{"num":3,"verse":"These false teachers only want your money. So they will use you by telling you things that are not true. But the judgment against these false teachers has been ready for a long time. And they will not escape God who will destroy them."},{"num":4,"verse":"When angels sinned, God did not let them go free without punishment. He sent them to hell. He put those angels in caves of darkness, where they are being held until the time when God will judge them."},{"num":5,"verse":"And God punished the evil people who lived long ago. He brought a flood to the world that was full of people who were against God. But he saved Noah and seven other people with him. Noah was a man who told people about living right."},{"num":6,"verse":"God also punished the evil cities of Sodom and Gomorrah. He burned them until there was nothing left but ashes. He used those cities as an example of what will happen to people who are against God."},{"num":7,"verse":"But he saved Lot, a good man who lived there. Lot was greatly troubled by the morally bad lives of those evil people."},{"num":8,"verse":"This good man lived with those evil people every day, and his good heart was hurt by the evil things he saw and heard."},{"num":9,"verse":"So you see that the Lord God knows how to save those who are devoted to him. He will save them when troubles come. And the Lord will hold evil people to punish them on the day of judgment."},{"num":10,"verse":"That punishment is for those who are always doing the evil that their sinful selves want to do. It is for those who hate the Lord’s authority."},{"num":11,"verse":"The angels are much stronger and more powerful than these beings. But even the angels don’t accuse them and say bad things about them to the Lord."},{"num":12,"verse":"But these false teachers speak evil against what they don’t understand. They are like animals that do things without really thinking—like wild animals that are born to be caught and killed. And, like wild animals, they will be destroyed."},{"num":13,"verse":"They have made many people suffer. So they themselves will suffer. That is their pay for what they have done."},{"num":14,"verse":"Every time they look at a woman, they want her. They are always sinning this way. And they lead weaker people into the trap of sin. They have taught themselves well to be greedy. They are under a curse."},{"num":15,"verse":"These false teachers left the right way and went the wrong way. They followed the same way that the prophet Balaam went. He was the son of Beor, who loved being paid for doing wrong."},{"num":16,"verse":"But a donkey told him that he was doing wrong. A donkey cannot talk, of course, but that donkey spoke with a man’s voice and stopped the prophet from acting so crazy."},{"num":17,"verse":"These false teachers are like springs that have no water. They are like clouds that are blown by a storm. A place in the deepest darkness has been kept for them."},{"num":18,"verse":"They boast with words that mean nothing. They lead people into the trap of sin. They find people who have just escaped from a wrong way of life and lead them back into sin. They do this by using the evil things people want to do in their human weakness."},{"num":19,"verse":"These false teachers promise those people freedom, but they themselves are not free. They are slaves to a mind that has been ruined by sin. Yes, people are slaves to anything that controls them."},{"num":20,"verse":"People can be made free from the evil in the world. They can be made free by knowing our Lord and Savior Jesus Christ. But if they go back into those evil things and are controlled by them, then it is worse for them than it was before."},{"num":21,"verse":"Yes, it would be better for them to have never known the right way. That would be better than to know the right way and then to turn away from the holy teaching that was given to them."},{"num":22,"verse":"What they did is like these true sayings: “A dog vomits and goes back to what it threw up.” And, “After a pig is washed, it goes back and rolls in the mud again.”"}]