[[],[{"type":"header","content":"Destructive Doctrines"},{"type":"prose","content":"But there were also false prophets among the people, even as there will be false teachers among you, who will secretly bring in destructive heresies, even denying the Lord who bought them,  bring on themselves swift destruction. "}],[{"type":"prose","content":"And many will follow their destructive ways, because of whom the way of truth will be blasphemed. "}],[{"type":"prose","content":"By covetousness they will exploit you with deceptive words; for a long time their judgment has not been idle, and their destruction does not slumber."},{"type":"header","content":"Doom of False Teachers"}],[{"type":"prose","content":"For if God did not spare the angels who sinned, but cast  down to hell and delivered  into chains of darkness, to be reserved for judgment; "}],[{"type":"prose","content":"and did not spare the ancient world, but saved Noah,  eight , a preacher of righteousness, bringing in the flood on the world of the ungodly; "}],[{"type":"prose","content":"and turning the cities of Sodom and Gomorrah into ashes, condemned  to destruction, making  an example to those who afterward would live ungodly; "}],[{"type":"prose","content":"and delivered righteous Lot,  oppressed by the filthy conduct of the wicked "}],[{"type":"prose","content":"(for that righteous man, dwelling among them, tormented  righteous soul from day to day by seeing and hearing  lawless deeds)— "}],[{"type":"prose","content":" the Lord knows how to deliver the godly out of temptations and to reserve the unjust under punishment for the day of judgment, "}],[{"type":"prose","content":"and especially those who walk according to the flesh in the lust of uncleanness and despise authority.  presumptuous, self-willed. They are not afraid to speak evil of dignitaries, "}],[{"type":"prose","content":"whereas angels, who are greater in power and might, do not bring a reviling accusation against them before the Lord."},{"type":"header","content":"Depravity of False Teachers"}],[{"type":"prose","content":"But these, like natural brute beasts made to be caught and destroyed, speak evil of the things they do not understand, and will utterly perish in their own corruption, "}],[{"type":"prose","content":" will receive the wages of unrighteousness,  those who count it pleasure to carouse in the daytime.  spots and blemishes, carousing in their own deceptions while they feast with you, "}],[{"type":"prose","content":"having eyes full of adultery and that cannot cease from sin, enticing unstable souls. They have a heart trained in covetous practices,  accursed children. "}],[{"type":"prose","content":"They have forsaken the right way and gone astray, following the way of Balaam the  of Beor, who loved the wages of unrighteousness; "}],[{"type":"prose","content":"but he was rebuked for his iniquity: a dumb donkey speaking with a man’s voice restrained the madness of the prophet."}],[{"type":"prose","content":"These are wells without water, clouds carried by a tempest, for whom is reserved the blackness of darkness forever."},{"type":"header","content":"Deceptions of False Teachers"}],[{"type":"prose","content":"For when they speak great swelling  of emptiness, they allure through the lusts of the flesh, through lewdness, the ones who have actually escaped from those who live in error. "}],[{"type":"prose","content":"While they promise them liberty, they themselves are slaves of corruption; for by whom a person is overcome, by him also he is brought into bondage. "}],[{"type":"prose","content":"For if, after they have escaped the pollutions of the world through the knowledge of the Lord and Savior Jesus Christ, they are again entangled in them and overcome, the latter end is worse for them than the beginning. "}],[{"type":"prose","content":"For it would have been better for them not to have known the way of righteousness, than having known  to turn from the holy commandment delivered to them. "}],[{"type":"prose","content":"But it has happened to them according to the true proverb:  and, “a sow, having washed, to her wallowing in the mire.”"}]]