[{"num":2,"verse":"There were false prophets among the people, even as there will be false teachers among you, who will slyly bring in damnable sects, even denying the Lord who has bought them, and bring upon themselves swift damnation. "},{"num":2,"verse":"And many will follow their damnable ways, by which the way of truth will be ill spoken of. "},{"num":3,"verse":"And through covetousness they will with feigned words make merchandise of you. Their judgment is not far off, and their damnation sleeps not."},{"num":4,"verse":"For God spared not the angels that sinned, but cast them down into hell, and delivered them into chains of darkness, to be kept until the judgment. "},{"num":5,"verse":"And he did not spare the old world, but saved Noah, the preacher of righteousness, with seven others, and brought in the flood upon the world of the ungodly. "},{"num":6,"verse":"And he turned the cities of Sodom and Gomorrah into ashes, overthrew them, damned them, and made them an example to all who afterwards would live ungodly. "},{"num":7,"verse":"But just Lot, vexed with the unclean ways of the wicked, he delivered. "},{"num":8,"verse":"For he, being righteous, and dwelling among them, was vexed in his righteous soul from day to day, with seeing and hearing their unlawful deeds."},{"num":9,"verse":"So then, the Lord knows how to deliver the godly out of affliction, and how to reserve the unjust for the day of judgment, to be punished; "},{"num":10,"verse":"namely those who walk after the flesh in the lust of uncleanness, and despise authority. Presumptuous they are, and stubborn, and fear not to speak evil of those who are in authority, "},{"num":11,"verse":"whereas the angels, who are greater both in power and might, do not bring railing judgment against them before the Lord. "},{"num":12,"verse":"But these, like brute beasts by nature born to be captured and destroyed, speak evil of that which they do not understand, and shall perish through their own destruction, "},{"num":13,"verse":"and receive the reward of unrighteousness."},{"num":14,"verse":"having eyes full of adultery, and that cannot cease to sin, beguiling unstable souls. Hearts they have exercised with covetousness. They are cursed children, "},{"num":15,"verse":"and have forsaken the right way, and have gone astray, following the way of Balaam, the son of Beor, who loved the reward of unrighteousness – "},{"num":16,"verse":"but was rebuked for his iniquity: the tame and dumb beast, speaking with man’s voice, opposed the foolishness of the prophet."},{"num":17,"verse":"These are wells without water, and clouds carried about by a tempest, for whom the mist of darkness is reserved forever. "},{"num":18,"verse":"For when they have spoken the swelling words of vanity, they beguile with wantonness through the lusts of the flesh those who were clean escaped, but now are wrapped in errors. "},{"num":19,"verse":"They promise them liberty, and are themselves the bond-servants of corruption. For by whomever a person is overcome, to him he is in bondage."},{"num":20,"verse":"For if, after they have escaped from the corruption of the world through the knowledge of the Lord and of the Saviour Jesus Christ, they are yet tangled again in it and overcome, then is the latter end worse with them than the beginning. "},{"num":21,"verse":"For it would have been better for them not to have known the way of righteousness than, after they have known it, to turn from the holy commandment given to them. "},{"num":22,"verse":"It has happened to them according to the true proverb: The dog is turned to his vomit again, and the sow that was washed, to her wallowing in the mire."}]