[{"num":1,"verse":"But even in those days there were false prophets, just as there will be false teachers among you today. They will be men who will subtly introduce dangerous heresies. They will thereby deny the Lord who redeemed them, and it will not be long before they bring on themselves their own downfall. Many will follow their pernicious teaching and thereby bring discredit on the way of truth. In their lust to make converts these men will try to exploit you too with their bogus arguments."},{"num":3,"verse":"But judgment has been for some time hard on their heels and their downfall is inevitable. For if God did not spare angels who sinned against him, but banished them to the dark imprisonment of hell till judgment day: if he did not spare the ancient world but only saved Noah (the solitary voice that cried out for righteousness) and his seven companions when he brought the flood upon the world in its wickedness; and if God reduced the entire cities of Sodom and Gomorrah to ashes (when he sentenced them to destruction as a fearful example to those who wanted to live in defiance of his laws), and yet saved Lot the righteous man, in acute mental distress at the filthy lives of the godless—Lot, remember, was a good man suffering spiritual agonies day after day at what he saw and heard of their lawlessness—then you may be absolutely certain that the Lord knows how to rescue a good man surrounded by temptation, and how to reserve his punishment for the wicked until his day comes."},{"header":"Let me show you what these men are really like"},{"num":10,"verse":"His judgment is chiefly reserved for those who have indulged all the foulness of their lower natures, and have nothing but contempt for authority. These men are arrogant and presumptuous—they think nothing of scoffing at the glories of the unseen world. Yet even angels, who are their superiors in strength and power, do not bring insulting criticisms of such things before the Lord."},{"num":12,"verse":"But these men, with no more sense than the unreasoning brute beasts which are born to be caught and killed, scoff at things outside their own experience, and will most certainly be destroyed in their own corruption. Their wickedness has earned them an evil end and they will be paid in full."},{"num":13,"verse":"These are the men who delight in daylight self-indulgence; they are foul spots and blots, playing their tricks at your very dinner-table. Their eyes cannot look at a woman without lust, they captivate the unstable ones, and their techniques of getting what they want is, through long practice, highly developed. They are born under a curse, for they have abandoned the right road and wandered off to follow the old trail of Balaam, son of Peor, the man who had no objection to wickedness as long as he was paid for it. But he, you remember, was sharply reprimanded for his wickedness—by a donkey, of all things, speaking with a human voice to check the prophet’s wicked infatuation!"},{"num":17,"verse":"These men are like wells without a drop of water in them, like the changing shapes of whirling storm-clouds, and their fate will be the black night of utter darkness."},{"num":18,"verse":"With their high-sounding nonsense they use the sensual pull of the lower passions to attract those who were just on the point of cutting loose from their companions in misconduct. They promise them liberty. Liberty!—when they themselves are bound hand and foot to utter depravity. For a man is the slave of whatever masters him."},{"num":20,"verse":"If men have escaped from the world’s contaminations through knowing our Lord and saviour Jesus Christ, and then become entangled and defeated all over again, their last position is far worse than their first. It would be better for them not to have known the way of goodness at all, rather than after knowing it to turn their backs on the sacred commandments given to them. Alas, for them, the old proverbs have come true about ‘a dog returns to his own vomit’,  and “the sow that had been washed going back to wallow in the muck”."}]