[{"num":36,"verse":"In the fourth year of Y’hoyakim the son of Yoshiyahu, king of Y’hudah, this word came to Yirmeyahu from Adonai: "},{"num":2,"verse":"“Take a scroll and write on it all the words I have spoken to you against Isra’el, Y’hudah and all the other nations, from the day I started speaking to you, back in the time of Yoshiyahu, until today. "},{"num":3,"verse":"Perhaps the house of Y’hudah will listen to all the disaster I intend to bring on them, and turn back, each person from his evil way; then I will forgive their wickedness and sin.”"},{"num":4,"verse":"So Yirmeyahu summoned Barukh the son of Neriyah; and Barukh wrote down on a scroll, at Yirmeyahu’s dictation, all the words that Adonai had said to him. "},{"num":5,"verse":"Then Yirmeyahu gave this order to Barukh: “I am not allowed to enter the house of Adonai. "},{"num":6,"verse":"Therefore, you take the scroll which you wrote at my dictation, go into the house of Adonai on a fast-day, and read from it the words of Adonai in the hearing of the people; also read them to all Y’hudah as they exit their cities. "},{"num":7,"verse":"Perhaps they will turn to Adonai in prayer and will return, each one, from his evil way. For the anger and fury which Adonai has decreed against this people is great.”"},{"num":8,"verse":"Barukh the son of Neriyah obeyed everything Yirmeyahu the prophet ordered him to do, reading the words of Adonai from the scroll in Adonai’s house. "},{"num":9,"verse":"A fast was proclaimed in the ninth month of the fifth year of Y’hoyakim the son of Yoshiyahu, king of Y’hudah, for all the people in Yerushalayim and all the people who came from the cities of Y’hudah to Yerushalayim. "},{"num":10,"verse":"It was then that Barukh read from the scroll the words of Yirmeyahu in the house of Adonai, in the chamber of G’maryahu the son of Shafan the secretary, in the upper courtyard, at the entry to the New Gate of Adonai’s house, for all the people to hear. "},{"num":11,"verse":"When Mikhay’hu the son of G’maryahu, the son of Shafan, had heard from the scroll all the words of Adonai, "},{"num":12,"verse":"he went down to the king’s palace, into the secretary’s room. All the officials were there — Elishama the secretary, D’layahu the son of Sh’ma‘yahu, Elnatan the son of ‘Akhbor, G’maryah the son of Shafan, Tzidkiyahu the son of Hananyahu and all the [other] officials. "},{"num":13,"verse":"Mikhay’hu told them all the words he had heard when Barukh read the scroll in the people’s hearing; "},{"num":14,"verse":"whereupon all the officials sent Y’hudi the son of N’tanyahu, the son of Shelemyahu, the son of Kushi, to Barukh to say, “Take in your hand the scroll from which you read in the hearing of the people, and come.” So Barukh the son of Neriyah took the scroll in his hand and went to them. "},{"num":15,"verse":"They said to him, “Sit down, please, and read it to us.” Barukh read it to them. "},{"num":16,"verse":"After they had heard all the words, they turned in fear to each other and said to Barukh, “We will certainly tell the king about all these words.” "},{"num":17,"verse":"Then they asked Barukh, “Tell us now, how did you write all these words? At his dictation?” "},{"num":18,"verse":"Barukh answered them, “He said all these words to me with his mouth, and I wrote them with ink in the scroll.” "},{"num":19,"verse":"At this, the officials said to Barukh, “Go and hide yourselves, you and Yirmeyahu; don’t let anyone know where you are.” "},{"num":20,"verse":"After depositing the scroll in the room of Elishama the secretary, they went in to the courtyard and told everything to the king."},{"num":21,"verse":"The king sent Y’hudi to bring the scroll, and he took it from the room of Elishama the secretary. Y’hudi read it to the king and all the officials standing near the king. "},{"num":22,"verse":"The king was sitting in his winter house; and since it was the ninth month, he had a fire burning in the stove in front of him. "},{"num":23,"verse":"After Y’hudi had read three or four columns from the scroll, he would cut off that portion with a knife and throw it into the fire that was burning in the stove, until the entire scroll had been consumed by the fire in the stove. "},{"num":24,"verse":"But even though they heard all these words, neither the king nor any of his servants grew afraid or tore their clothes. "},{"num":25,"verse":"Elnatan, D’layahu and G’maryahu had begged the king not to burn the scroll; but he wouldn’t listen to them. "},{"num":26,"verse":"Then the king ordered Yerachme’el the king’s son, S’rayahu the son of ‘Azri’el and Shelemyahu the son of ‘Avde’el to arrest Barukh the scribe and Yirmeyahu the prophet; but Adonai hid them."},{"num":27,"verse":"Then this word of Adonai came to Yirmeyahu after the king had burned the scroll with the words Barukh had written at Yirmeyahu’s dictation: "},{"num":28,"verse":"“Take another scroll, and write on it all the words that were on the first scroll, which Y’hoyakim the king of Y’hudah burned up. "},{"num":29,"verse":"And as far as Y’hoyakim king of Y’hudah is concerned, you are to say that Adonai says, ‘You burned this scroll, asking, “Why did you write in it that the king of Bavel will certainly come and destroy this land and leave it without either humans or animals?” "},{"num":30,"verse":"Therefore Adonai says this about Y’hoyakim king of Y’hudah: “He will have no one to occupy David’s throne; and his dead body will be thrown out to lie in the heat by day and in the frost by night. "},{"num":31,"verse":"Moreover, I will punish him, his offspring and his officials for their wickedness; and I will bring on them, the inhabitants of Yerushalayim and the people of Y’hudah all the disaster I have decreed against them, to which they have paid no attention.”’”"},{"num":32,"verse":"Then Yirmeyahu took another scroll and gave it to Barukh the scribe, the son of Neriyah. At Yirmeyahu’s dictation he wrote in it all the words of the scroll which Y’hoyakim king of Y’hudah had burned up in the fire, and to those he added many similar words."}]