[{"header":"King Jehoiakim Burns Jeremiah’s Scroll"},{"num":36,"verse":"The message from the Lord came to Jeremiah. This was during the fourth year that Jehoiakim son of Josiah was king of Judah. This was the message from the Lord:"},{"num":2,"verse":"“Jeremiah, get a scroll and write on it all the messages I have spoken to you. I have spoken to you about the nations of Israel and Judah and all the other nations. Write all the words that I have spoken to you from the time that Josiah was king, until now."},{"num":3,"verse":"Maybe the people of Judah will hear what I am planning to do to them and will stop doing bad things. If they will do that, I will forgive them for the terrible sins they have committed.”"},{"num":4,"verse":"So Jeremiah called a man named Baruch son of Neriah. Jeremiah spoke the messages the Lord had given him. While he spoke, Baruch wrote the messages on the scroll."},{"num":5,"verse":"Then Jeremiah said to Baruch, “I cannot go to the Lord’s Temple. I am not allowed to go there."},{"num":6,"verse":"So I want you to go to the Temple of the Lord. Go there on a day of fasting and read to the people from the scroll. Read to the people the messages from the Lord that you wrote on the scroll as I spoke them to you. Read them to all the people of Judah who come into Jerusalem from the towns where they live."},{"num":7,"verse":"Perhaps they will ask the Lord to help them. Perhaps each person will stop doing bad things. The Lord has announced that he is very angry with them.”"},{"num":8,"verse":"So Baruch son of Neriah did everything Jeremiah the prophet told him to do. Baruch read aloud the scroll that had the Lord’s messages written on it. He read it in the Lord’s Temple."},{"num":9,"verse":"In the ninth month of the fifth year that Jehoiakim was king, a fast was announced. All those who lived in the city of Jerusalem and everyone who had come into Jerusalem from the towns of Judah were supposed to fast before the Lord."},{"num":10,"verse":"At that time Baruch read the scroll that contained Jeremiah’s words. He read the scroll in the Temple of the Lord to all the people who were there. Baruch was in the room of Gemariah in the upper courtyard when he read from the scroll. That room was located at the entrance of the New Gate of the Temple. Gemariah was the son of Shaphan. Gemariah was a scribe in the Temple."},{"num":11,"verse":"A man named Micaiah heard all the messages from the Lord that Baruch read from the scroll. Micaiah was the son of Gemariah, the son of Shaphan."},{"num":12,"verse":"When Micaiah heard the messages from the scroll, he went down to the secretary’s room in the king’s palace. All the royal officials were sitting there in the king’s palace. These are the names of the officials: Elishama the secretary, Delaiah son of Shemaiah, Elnathan son of Acbor, Gemariah son of Shaphan, Zedekiah son of Hananiah; all the other royal officials were there too."},{"num":13,"verse":"Micaiah told them everything he had heard Baruch read from the scroll."},{"num":14,"verse":"Then all the officials sent a man named Jehudi to Baruch. (Jehudi was the son of Nethaniah, son of Shelemiah. Shelemiah was the son of Cushi.) Jehudi said to Baruch, “Bring the scroll that you read from and come with me.”"},{"num":15,"verse":"Then the officials said to Baruch, “Sit down and read the scroll to us.”"},{"num":16,"verse":"When the royal officials heard all the messages from the scroll, they were afraid and looked at one another. They said to Baruch, “We must tell King Jehoiakim about these messages on the scroll.”"},{"num":17,"verse":"Then the officials asked Baruch, “Tell us, Baruch, where did you get these messages that you wrote on the scroll? Did you write down what Jeremiah said to you?”"},{"num":18,"verse":"“Yes,” Baruch answered. “Jeremiah spoke, and I wrote down all the messages with ink on this scroll.”"},{"num":19,"verse":"Then the royal officials said to Baruch, “You and Jeremiah must go and hide. Don’t tell anyone where you are hiding.”"},{"num":20,"verse":"Then the royal officials put the scroll in the room of Elishama the scribe. They went to King Jehoiakim and told him all about the scroll."},{"num":21,"verse":"So King Jehoiakim sent Jehudi to get the scroll. Jehudi brought the scroll from the room of Elishama the scribe. Then Jehudi read the scroll to the king and all the servants who stood around the king."},{"num":22,"verse":"The time this happened was in the ninth month, so King Jehoiakim was sitting in the part of the palace used for winter. There was a fire burning in a small fireplace in front of the king."},{"num":23,"verse":"Jehudi began to read from the scroll. But after he would read two or three columns, King Jehoiakim would grab the scroll. Then he would cut those columns off the scroll with a small knife and throw them into the fireplace. Finally, the whole scroll was burned in the fire."},{"num":24,"verse":"And, when King Jehoiakim and his servants heard the message from the scroll, they were not afraid. They did not tear their clothes to show sorrow for doing wrong."},{"num":25,"verse":"Elnathan, Delaiah, and Gemariah tried to talk King Jehoiakim out of burning the scroll, but he would not listen to them."},{"num":26,"verse":"Instead King Jehoiakim commanded some men to arrest Baruch the scribe and Jeremiah the prophet. These men were Jerahmeel, a son of the king, Seraiah son of Azriel, and Shelemiah son of Abdeel. But they could not find Baruch and Jeremiah, because the Lord had hidden them."},{"num":27,"verse":"King Jehoiakim burned the scroll on which Baruch had written all the words that Jeremiah had spoken to him. Then this message from the Lord came to Jeremiah:"},{"num":28,"verse":"“Get another scroll. Write all the messages on it that were on the first scroll that King Jehoiakim of Judah burned."},{"num":29,"verse":"Also tell King Jehoiakim of Judah that this is what the Lord says: ‘Jehoiakim, you burned that scroll. You said, “Why did Jeremiah write that the king of Babylon will surely come and destroy this land and kill all the people and animals in it?”"},{"num":30,"verse":"So this is what the Lord says about King Jehoiakim of Judah: Jehoiakim’s descendants will not sit on David’s throne. When Jehoiakim dies, he will not get a king’s funeral, but his body will be thrown out on the ground. His body will be left out in the heat of the day and the cold frost of the night."},{"num":31,"verse":"I will punish Jehoiakim and his children, and I will punish his officials. I will do this because they are wicked. I will bring terrible disasters on them and on all those who live in Jerusalem and on the people from Judah. I will bring all these bad things on them, just as I warned them, because they have not listened to me.’”"},{"num":32,"verse":"Then Jeremiah took another scroll and gave it to Baruch son of Neriah, the scribe. As Jeremiah spoke, Baruch wrote on the scroll the same messages that were on the scroll that King Jehoiakim had burned in the fire. And many other words like those messages were added to the second scroll."}]