[{"header":"Jeremiah’s Scroll Read in the Temple"},{"num":36,"verse":"In the fourth year of the reign of Josiah’s son King Jehoiakim of Judah, this message came to Jeremiah from the Lord: "},{"num":2,"verse":"“Take a scroll and write on it all the words that I’ve spoken to you about Israel, about Judah, and about all the nations, since I first spoke to you in the time of Josiah until the present time. "},{"num":3,"verse":"Perhaps the house of Judah will hear about all the calamity that I’m planning to bring on them, and so each of them will turn from his wicked way and I’ll forgive their iniquities and sins.”"},{"num":4,"verse":"Jeremiah summoned Neriah’s son Baruch and at Jeremiah’s dictation, Baruch wrote on the scroll all the words of the Lord that he had spoken to him."},{"num":5,"verse":"Jeremiah instructed Baruch, “I’m confined and can’t go to the Lord’s Temple. "},{"num":6,"verse":"You go and read the words of the Lord that you wrote at my dictation from the scroll. Read them to the people at the Lord’s Temple on the fast day. Also read them to all the people of Judah who are coming from their towns. "},{"num":7,"verse":"Perhaps their pleas for help will come to the Lord’s attention, and each of them will turn from his evil lifestyle in light of the great anger and wrath that the Lord has declared against this people.” "},{"num":8,"verse":"So Neriah’s son Baruch did just as Jeremiah the prophet instructed him, reading the words of the Lord from the scroll at the Lord’s Temple."},{"num":9,"verse":"In the ninth month of the fifth year of the reign of Josiah’s son Jehoiakim, king of Judah, a fast was proclaimed in the Lord’s presence in Jerusalem for all the people of Jerusalem, as well as all the people who were coming from the towns of Judah. "},{"num":10,"verse":"Baruch read the words of Jeremiah from the scroll to all the people at the Lord’s Temple. He did this from the office of Shaphan’s son Gemariah the scribe, in the upper court at the entrance of the New Gate of the Lord’s Temple."},{"header":"Jeremiah’s Scroll Read in the Palace"},{"num":11,"verse":"When Gemariah’s son Micaiah, the grandson of Shaphan, heard all the words of the Lord from the scroll, "},{"num":12,"verse":"he went down to the palace, to the scribe’s office, where all the officials were sitting. Elishama the scribe, Shemaiah’s son Delaiah, Achbor’s son Elnathan, Shaphan’s son Gemariah, Hananiah’s son Zedekiah, and all the other officials were there. "},{"num":13,"verse":"Micaiah told them all the things that he had heard when Baruch read from the scroll to the people. "},{"num":14,"verse":"Then all the officials sent Nethaniah’s son Jehudi, (who was also the grandson of Shelemiah and Cushi’s great-grandson), to Baruch, who said, “Take the scroll that you read to the people and come.” Neriah’s son Baruch took the scroll with him and went to them."},{"num":15,"verse":"They told him, “Please sit down and read it to us.” So Baruch read it to them. "},{"num":16,"verse":"When they heard all the words, they turned to one another in fear, saying to Baruch, “We must report all these things to the king.” "},{"num":17,"verse":"Then they asked Baruch, “Please tell us how you wrote all the words. Did Jeremiah dictate them all?”"},{"num":18,"verse":"Baruch answered them, “Yes, Jeremiah dictated all these words to me, and I wrote them in the scroll with ink.”"},{"num":19,"verse":"Then the officials told Baruch, “Go, hide yourself, both you and Jeremiah, and don’t let anyone know where you are.”"},{"header":"The King Burns Jeremiah’s Scroll"},{"num":20,"verse":"The officials went to the king in the courtyard, but they deposited the scroll in the office of Elishama the scribe. Then they reported everything written on the scroll to the king. "},{"num":21,"verse":"The king sent Jehudi to get the scroll, and he took it from the office of Elishama the scribe. Jehudi read it to the king and to all the officials who were standing beside the king. "},{"num":22,"verse":"The king was sitting in the winter palace in the ninth month and a stove was burning in front of him. "},{"num":23,"verse":"As Jehudi would read three or four columns, the king would cut it with a scribe’s knife and throw it into the fire which was in the stove, until all the scroll was burned in the fire in the stove. "},{"num":24,"verse":"The king and all his officials who were listening to these words were not afraid, nor did they tear their garments. "},{"num":25,"verse":"Even though Elnathan, Delaiah, and Gemariah urged the king not to burn the scroll, he would not listen to them. "},{"num":26,"verse":"The king ordered his son Jerahmeel, Azriel’s son Seraiah, and Abdeel’s son Shelemiah to get Baruch the scribe and Jeremiah the prophet, but the Lord had hidden them."},{"header":"Jeremiah Rewrites the Scroll"},{"num":27,"verse":"This message from the Lord came to Jeremiah after the king burned the scroll containing the words that Baruch had written at Jeremiah’s dictation: "},{"num":28,"verse":"“Go back, take another scroll and write on it all the original words which were on the scroll that Jehoiakim, king of Judah, burned. "},{"num":29,"verse":"Concerning Jehoiakim, king of Judah, you are to say, ‘This is what the Lord says: “You burned this scroll, all the while saying, ‘Why did you write on it that the king of Babylon will definitely come, destroy this land, and eliminate both people and animals from it?’” "},{"num":30,"verse":"Therefore, this is what the Lord says concerning Jehoiakim, king of Judah, “He will have no one to sit on the throne of David, and his corpse will be thrown out to rot during the heat of the day and the frost of the night. "},{"num":31,"verse":"I’ll punish him, his descendants, and his officials for their iniquity. I’ll bring on them, on the residents of Jerusalem, and on the men of Judah all the calamity about which I’ve warned them, but they would not listen.”’”"},{"num":32,"verse":"Then Jeremiah took another scroll and gave it to Neriah’s son Baruch the scribe. He wrote on it, at Jeremiah’s dictation, all the words of the book that Jehoiakim king of Judah burned in the fire. He also added to them many similar words."}]