[{"num":36,"verse":"And it was done, in the fourth year of Jehoiakim, son of Josiah, king of Judah, this word was made of the Lord to Jeremy, and said, (And it was done, in the fourth year of Jehoiakim, the son of Josiah, the king of Judah, that this word of the Lord was made to Jeremiah, and said,)"},{"num":2,"verse":"Take thou the volume of a book, and thou shalt write therein all the words, which I spake to thee against Israel and Judah, and against all folks, from the day in which I spake to thee, from the days of Josiah unto this day. (Take thou the volume of a book, and thou shalt write in it all the words, which I spoke to thee against Israel and Judah, and against all the nations, from the day when I first spoke to thee, yea, from the days of Josiah unto this day.)"},{"num":3,"verse":"If peradventure when the house of Judah heareth all the evils which I think to do to them, each man turn again from his worst way, and I shall be merciful to the wickedness and sin of them. (And perhaps when the house of Judah heareth all the evils which I think to do to them, each person shall turn from his worst ways, and then I shall be merciful to them regarding their wickedness and their sin.)"},{"num":4,"verse":"Therefore Jeremy called Baruch, the son of Neriah; and Baruch wrote (out) of the mouth of Jeremy in the volume of a book all the words of the Lord, which he spake to him. (And so Jeremiah called Baruch, the son of Neriah; and Baruch wrote in the volume of a book, from the mouth of Jeremiah, all the words of the Lord which he spoke to him.)"},{"num":5,"verse":"And Jeremy commanded to Baruch, and said, I am closed, and I may not enter into the house of the Lord. (And Jeremiah said to Baruch, I am enclosed, or imprisoned, and I cannot go to the House of the Lord.)"},{"num":6,"verse":"Therefore enter thou, and read (out) of the book, in which thou hast written (out) of my mouth the words of the Lord, in hearing of the people, in the house of the Lord, in the day of fasting; furthermore and in hearing of all Judah, that come from their cities, thou shalt read to them; (And so go thou, and read from the book in which thou hast written from my mouth the words of the Lord, in the hearing of all the people, in the House of the Lord, on the day of fasting; and thou shalt even read this in the hearing of all those of Judah, who come from their cities;)"},{"num":7,"verse":"if peradventure the prayer of them fall in the sight of the Lord, and each man turn again from his worst way; for why the strong vengeance and indignation is great, which the Lord spake against this people. (if perhaps their prayer come before the Lord, and each person turn from his worst ways; for great is the strong vengeance and the indignation, which the Lord spoke against this people.)"},{"num":8,"verse":"And Baruch, the son of Neriah, did after all things, which Jeremy, the prophet, commanded to him; and he read (out) of the book the words of the Lord, in the house of the Lord. (And Baruch, the son of Neriah, did all the things, which the prophet Jeremiah commanded him to do; and so he read from the book the words of the Lord, in the House of the Lord.)"},{"num":9,"verse":"Forsooth it was done, in the fifth year of Jehoiakim, son of Josiah, king of Judah, in the ninth month, they preached fasting in the sight of the Lord, to all the people in Jerusalem, and to all the multitude, that came together from the cities of Judah into Jerusalem. (For it was done, in the fifth year of Jehoiakim, the son of Josiah, the king of Judah, in the ninth month, they proclaimed a fast before the Lord, for all the people in Jerusalem, and for all the multitude, who came together from the cities of Judah into Jerusalem.)"},{"num":10,"verse":"And Baruch read (out) of the volume the words of Jeremy, in the house of the Lord, in the treasury of Gemariah, the son of Shaphan, scribe, in the higher porch, in the entering of the new gate of the house of the Lord, in audience of all the people. (And Baruch read from the book the words of Jeremiah, in the House of the Lord, in the chamber of Gemariah, the son of Shaphan, the writer, or the court secretary, in the upper courtyard, at the entrance to the New Gate of the House of the Lord, before all the people.)"},{"num":11,"verse":"And when Michaiah, the son of Gemariah, son of Shaphan, had heard all the words of the Lord, of the book (from the book),"},{"num":12,"verse":"he went down into the house of the king, to the treasury of the scribe. And lo! all the princes sat there, Elishama, the scribe, and Delaiah, the son of Shemaiah, and Elnathan, the son of Achbor, and Gemariah, the son of Shaphan, and Zedekiah, the son of Hananiah, and all [the] princes. (he went down to the house of the king, to the chamber of the writer, or of the court secretary. And lo! all the leaders, or all the officers, sat there, Elishama, the writer, and Delaiah, the son of Shemaiah, and Elnathan, the son of Achbor, and Gemariah, the son of Shaphan, and Zedekiah, the son of Hananiah, and all the other officers.)"},{"num":13,"verse":"And Michaiah told to them all the words, which he heard Baruch reading of the book, in the ears of the people. (And Michaiah told them all the words, which he had heard Baruch reading from the book, before the people.)"},{"num":14,"verse":"Therefore all the princes sent to Baruch Jehudi, the son of Nethaniah, son of Shelemiah, son of Cushi, and said, Take in thine hand the book, of which thou readest in audience of the people, and come thou. Therefore Baruch, the son of Neriah, took the book in his hand, and came to them. (And so all the officers sent Jehudi, the son of Nethaniah, the son of Shelemiah, the son of Cushi, to Baruch, and he said, Bring the book in thy hand, from which thou readest before the people, and come thou. And so Baruch, the son of Neriah, brought the book in his hand, and came to them.)"},{"num":15,"verse":"And they said to him, Sit thou, and read these things in our ears; and Baruch read (it) in the ears of them. (And they said to him, Sit thou, and read these things to us; and so Baruch read from the book to them.)"},{"num":16,"verse":"Therefore when they had heard all the words, they wondered each man to his neighbour, and they said to Baruch, Ought we to tell to the king all these words?"},{"num":17,"verse":"And they asked him, and said, Show thou to us, how thou hast written all these words of his mouth. (And they asked him, and said, Tell thou us, how thou hast written all these words from his mouth.)"},{"num":18,"verse":"Forsooth Baruch said to them, Of his mouth he spake, as (if) reading to me, all these words; and I wrote (them) in a book with ink. (And Baruch said to them, He spoke all these words out of his mouth, as if reading to me, and I wrote them down with ink in a book.)"},{"num":19,"verse":"And all the princes said to Baruch, Go, be thou hid, thou and Jeremy; and no man know where ye be. (And all the officers said to Baruch, Go, be thou hid, thou and Jeremiah; and let no one know where ye be.)"},{"num":20,"verse":"And they entered to the king, into the hall; forsooth they betook the book to be kept into the treasury of Elishama, the scribe. And they told all the words, in audience of the king. (And then they went to the king, in the hall; and they had put the book in the chamber of Elishama, the writer, or the court secretary, for safekeeping. And they told everything to the king.)"},{"num":21,"verse":"Therefore the king sent Jehudi, that he should take the book. Which took the book from the treasury of Elishama, the scribe, and read in audience of the king, and of all the princes that stood about the king. (And so the king sent Jehudi, to get the book. Who brought the book from the chamber of Elishama, the writer, or the court secretary, and then he read it before the king, and before all the officers who stood about the king.)"},{"num":22,"verse":"Forsooth the king sat in the winter house, in the ninth month; and a pan full of coals was set before him."},{"num":23,"verse":"And when Jehudi had read three pages, either four, he cutted it with the knife of a scribe, and casted into the fire (he cut it with a writer’s knife, and threw it into the fire), that was in the pan, till all the book was wasted by the fire, that was in the pan."},{"num":24,"verse":"And the king, and all his servants, that heard all these words, dreaded not, neither rent their clothes. (And the king, and all his officers, who heard all these words, did not fear, nor tore their clothes.)"},{"num":25,"verse":"Nevertheless Elnathan, and Delaiah, and Gemariah against-said [to] the king, that he should not burn the book; and he heard not them (but he would not listen to them)."},{"num":26,"verse":"And the king commanded to Jerahmeel, son of Hammelech, and to Seraiah, son of Azriel, and to Shelemiah, son of Abdeel, that they should take (hold of) Baruch, the writer, and Jeremy, the prophet; forsooth the Lord hid them."},{"num":27,"verse":"And the word of the Lord was made to Jeremy, the prophet, after that the king had burnt the book, and [the] words, which Baruch had written of Jeremy’s mouth; and he said, (And the word of the Lord was made to the prophet Jeremiah, after that the king had burned the book, and the words, which Baruch had written from Jeremiah’s mouth; and he said,)"},{"num":28,"verse":"Again take thou another book, and write therein all the former words, that were in the first book, which Jehoiakim, the king of Judah, burnt. (Take thou another book, and write in it all the former words, that were in the first book, which Jehoiakim, the king of Judah, burned.)"},{"num":29,"verse":"And thou shalt say to Jehoiakim, king of Judah, The Lord saith these things, Thou burntest that book, and saidest, What hast thou written therein, telling, The king of Babylon shall come hasting, and shall destroy this land, and shall make man and beast to cease thereof? (And thou shalt say to Jehoiakim, the king of Judah, The Lord saith these things, Thou hast burned that book, and thou asked, Why hast thou written in it, saying, The king of Babylon shall come with haste, and shall destroy this land, and shall make the people and the beasts to cease to be there, that is, that he shall kill them all?)"},{"num":30,"verse":"Therefore the Lord saith these things against Jehoiakim, king of Judah, None there shall be of him, that shall sit on the seat of David; and his carrion shall be cast forth to the heat by day, and to the frost by night. (And so the Lord saith these things against Jehoiakim, the king of Judah, There shall be none of his kin, who shall sit on David’s throne; and his dead body shall be cast forth to the heat of the day, and to the frost of the night.)"},{"num":31,"verse":"And I shall visit against him, and against his seed, and against his servants, (for) their wickednesses. And I shall bring on them, and on the dwellers of Jerusalem, and on the men of Judah, all the evil which I spake to them, and they heard not. (And I shall punish him, and his descendants, and his officers, for their wickednesses. And I shall bring down upon them, and upon the inhabitants of Jerusalem, and upon the people of Judah, all the evil which I spoke against them, but they would not hear about.)"},{"num":32,"verse":"Forsooth Jeremy took another book, and gave it to Baruch, the writer, the son of Neriah, which wrote therein of Jeremy’s mouth all the words of the book, which book Jehoiakim, king of Judah, had burnt by fire; and furthermore many more words were added than were before. (And so Jeremiah took another book, and gave it to Baruch, the writer, the son of Neriah, who wrote in it from Jeremiah’s mouth all the words of the book, which Jehoiakim, the king of Judah, had burned in the fire; and furthermore many more words were added to it, than were there before.)"}]