[{"num":36,"verse":"And it cometh to pass, in the fourth year of Jehoiakim son of Josiah king of Judah, this word hath been unto Jeremiah from Jehovah, saying:"},{"num":2,"verse":"`Take to thee a roll of a book, and thou hast written on it all the words that I have spoken unto thee concerning Israel, and concerning Judah, and concerning all the nations, from the day I spake unto thee, from the days of Josiah, even unto this day;"},{"num":3,"verse":"if so be the house of Israel do hear all the evil that I am thinking of doing to them, so that they turn back each from is evil way, and I have been propitious to their iniquity, and to their sin.'"},{"num":4,"verse":"And Jeremiah calleth Baruch son of Neriah, and Baruch writeth from the mouth of Jeremiah all the words of Jehovah, that He hath spoken unto him, on a roll of a book."},{"num":5,"verse":"And Jeremiah commandeth Baruch, saying, `I am restrained, I am not able to enter the house of Jehovah;"},{"num":6,"verse":"but thou hast entered -- and thou hast read in the roll that thou hast written from my mouth, the words of Jehovah, in the ears of the people, in the house of Jehovah, in the day of the fast, and also in the ears of all Judah who are coming in from their cities thou dost read them;"},{"num":7,"verse":"if so be their supplication doth fall before Jehovah, and they turn back each from his evil way, for great [is] the anger and the fury that Jehovah hath spoken concerning this people.'"},{"num":8,"verse":"And Baruch son of Neriah doth according to all that Jeremiah the prophet commanded him, to read in the book the words of Jehovah in the house of Jehovah."},{"num":9,"verse":"And it cometh to pass, in the fifth year of Jehoiakim son of Josiah king of Judah, in the ninth month, proclaimed a fast before Jehovah have all the people in Jerusalem, and all the people who are coming in from cities of Judah to Jerusalem;"},{"num":10,"verse":"and Baruch readeth in the book the words of Jeremiah in the house of Jehovah, in the chamber of Gemariah son of Shaphan the scribe, in the higher court, at the opening of the new gate of the house of Jehovah, in the ears of all the people."},{"num":11,"verse":"And Michaiah son of Gemariah, son of Shaphan, heareth all the words of Jehovah from off the book,"},{"num":12,"verse":"and he goeth down [to] the house of the king, unto the chamber of the scribe, and lo, there are all the heads sitting: Elishama the scribe, and Delaiah son of Shemaiah, and Elnathan son of Acbor, and Gemariah son of Shaphan, and Zedekiah son of Hananiah, and all the heads."},{"num":13,"verse":"And declare to them doth Micaiah all the words that he hath heard, when Baruch readeth in the book in the ears of the people;"},{"num":14,"verse":"and all the heads send unto Baruch, Jehudi son of Nethaniah, son of Shelemiah, son of Cushi, saying, `The roll in which thou hast read in the ears of the people take in thy hand, and come.' And Baruch son of Neriah taketh the roll in his hand and cometh in unto them,"},{"num":15,"verse":"and they say unto him, `Sit down, we pray thee, and read it in our ears,' and Baruch readeth in their ears,"},{"num":16,"verse":"and it cometh to pass, when they hear all the words, they have been afraid one at another, and say unto Baruch, `We do surely declare to the king all these words.'"},{"num":17,"verse":"And they asked Baruch, saying, `Declare, we pray thee, to us, how didst thou write all these words -- from his mouth?'"},{"num":18,"verse":"And Baruch saith to them, `From his mouth, he pronounceth unto me all these words, and I am writing on the book with ink.'"},{"num":19,"verse":"And the heads say unto Baruch, `Go, be hidden, thou and Jeremiah, and let no one know where ye [are].'"},{"num":20,"verse":"And they go in unto the king, to the court, and the roll they have laid up in the chamber of Elishama the scribe, and they declare in the ears of the king all the words."},{"num":21,"verse":"And the king sendeth Jehudi to take the roll, and he taketh it out of the chamber of Elishama the scribe, and Jehudi readeth it in the ears of the king, and in the ears of all the heads who are standing by the king;"},{"num":22,"verse":"and the king is sitting in the winter-house, in the ninth month, and the stove before him is burning,"},{"num":23,"verse":"and it cometh to pass, when Jehudi readeth three or four leaves, he cutteth it out with the scribe's knife, and hath cast unto the fire, that [is] on the stove, till the consumption of all the roll by the fire that [is] on the stove."},{"num":24,"verse":"And the king and all his servants who are hearing all these words have not been afraid, nor rent their garments."},{"num":25,"verse":"And also Elnathan, and Delaiah, and Gemariah have interceded with the king not to burn the roll, and he hath not hearkened unto them."},{"num":26,"verse":"And the king commandeth Jerahmeel son of Hammelek, and Seraiah son of Azriel, and Shelemiah son of Abdeel, to take Baruch the scribe, and Jeremiah the prophet, and Jehovah doth hide them."},{"num":27,"verse":"And there is a word of Jehovah unto Jeremiah -- after the king's burning the roll, even the words that Baruch hath written from the mouth of Jeremiah -- saying:"},{"num":28,"verse":"`Turn, take to thee another roll, and write on it all the former words that were on the first roll, that Jehoiakim king of Judah burnt,"},{"num":29,"verse":"and unto Jehoiakim king of Judah thou dost say: Thus said Jehovah, Thou hast burnt this roll, saying, Wherefore hast thou written on it, saying, The king of Babylon surely cometh in, and hath destroyed this land, and caused to cease from it man and beast?"},{"num":30,"verse":"`Therefore, thus said Jehovah, concerning Jehoiakim king of Judah: He hath none sitting on the throne of David, and his carcase is cast out to heat by day, and to cold by night;"},{"num":31,"verse":"and I have charged on him, and on his seed, and on his servants, their iniquity; and I have brought in on them, and on the inhabitants of Jerusalem, and unto the men of Judah, all the evil that I have spoken unto them, and they hearkened not.'"},{"num":32,"verse":"And Jeremiah hath taken another roll, and giveth it unto Baruch son of Neriah the scribe, and he writeth on it from the mouth of Jeremiah all the words of the book that Jehoiakim king of Judah hath burnt in the fire; and again there were added unto them many words like these."}]