[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Looking unto Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the description precedes the mention of the name, “Looking unto the Author and Perfecter of (our) faith, Jesus.” The first word is very similar to that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the runner looks away from all other objects and fixes his gaze on One. Jesus is not directly spoken of as the Judge (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Timothy 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but, as the next words show, He has Himself reached the goal, and His presence marks the point at which the race will close. As the last verse spoke of our “patient endurance,” this speaks of our faith, and of this Jesus is the Author and the Perfecter. The former word has occurred before, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and here, as there, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "origination",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the principal thought. There the idea of leading the way was also present; but here “Author” stands in contrast with “Perfecter,” and the example of our Lord is the subject of the clause which follows. Because it is He who begins and brings to perfection our faith, we must run the race with our eye fixed upon Him: in Him is the beginning, in Him the completion of the promises (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in the steady and trustful dependence upon Him which this figure describes consists our faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who for the joy that was set before him endured the cross.—The literal meaning is very forcible, endured a cross, despising shame; the shame of such a death being set over against the joy that lay before Him. Here again we have the thought of Hebrews 2:9 (Philippians 2:9-10); the joy of His accomplished purpose (Isaiah 53:11; Matthew 25:21; Luke 10:21-22) and the glory with which He was crowned (John 17:1; 1Peter 1:11) being the reward for His “obedience even unto death.” The whole form of the expression (comp. especially Hebrews 6:18, “the hope set before us”) shows that Jesus is presented to us as an example not of endurance only, but also of faith (Hebrews 2:12). On the last words of the verse see Hebrews 1:3; Hebrews 1:13; Hebrews 8:1; Hebrews 10:12-13; there is here a slight change in the Greek, which requires the rendering, and hath sat down at the right hand of the throne of God.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Who for the joy that was set before him endured the cross.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The literal meaning is very forcible, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "endured a cross, despising shame;",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the shame of such a death being set over against the joy that lay before Him. Here again we have the thought of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the joy of His accomplished purpose (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 10:21-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and the glory with which He was crowned (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Peter 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") being the reward for His “obedience even unto death.” The whole form of the expression (comp. especially ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “the hope set before us”) shows that Jesus is presented to us as an example not of endurance only, but also of faith (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). On the last words of the verse see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; there is here a slight change in the Greek, which requires the rendering, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and hath sat down at the right hand of the throne of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hebrews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE CLOUD OF WITNESSES AND THEIR LEADER",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "WHAT an awful sight the rows above rows of spectators must have been to the wrestler who looked up at them from the arena, and saw a mist of white faces and pitiless eyes all directed on himself! How many a poor gladiator turned in his despair from them to the place where purple curtains and flashing axes proclaimed the presence of the emperor, on whose word hung his life, whose will could crown him with a rich reward!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is the picture which this text brings before our eyes, as the likeness of the Christian life. We are in the arena; the race has to be run, the battle to be fought, All round and high above us, a mist, as it were, of fixed gazers beholds us, and on the throne is the Lord of life, the judge of the strife, whose smile is better than all crowns, whose downward-pointing finger seals our fate. We are compassed with a cloud of witnesses, and we may see Jesus the author and finisher of faith. Both of these facts are alleged here as encouragements to persevering, brave struggle in the Christian life. Hence we have here mainly two subjects for consideration, namely the relation between the saints who are gone and ourselves, and the encouragement derived from it; and the contrasted relation between Jesus and ourselves, and the encouragement derived from it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The metaphor of the ‘cloud of witnesses’ is perhaps intended to express multitude, and also elevation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It may have been naturally suggested by the thought of the saints of the Old Testament {of whom the previous chapter has been so nobly speaking} as exalted to heaven, and hovering far above and far away like the pure whitenesses that tower there. Raphael’s great Sistine Madonna has for background just such a light mist of angel faces and adoring eyes all turned to the gentle majesty of the Virgin. There may also be blending in the writer’s mind such a reference to the amphitheatre as we have already noticed, which certainly exists in the later portion of the context. But we must remember that tempting as it is to a hasty reader to deduce from the words the idea that the saints whose ‘warfare is accomplished’ look down on our struggles here, there is, at all events, no support to that idea in the word ‘witnesses.’ It is not used, as often in our speech, as equivalent to spectators, but means here exactly what it does in the previous chapter, namely, attesters or testifiers. They are not witnesses of us, but to us, as we shall see presently. It may, indeed, be that the thought of the heavenly spectators of our Christian course is implied in the whole strain of the passage, and of the imagery borrowed from the arena, which would certainly be incomplete if there were nothing to answer to the spectators, who, whether at Corinth or Rome, made so important a part in the scene.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We shall be going too far, I think, if we dogmatically assert, on the strength of a figure, that this context teaches a positive communion between earth and heaven of such a sort as that they who have ‘overcome by the blood of the Lamb, and by the word of His testimony,’ know about the struggles of us down here in the arena. Still, one feels that such an idea is almost needed to give full force either to the figure or exhortation. It does seem somewhat lame to say, You are like racers, surrounded with a crowd of witnesses, therefore run, only do not suppose that they really see you. If this be so, the glowing imagery certainly seems to receive a violent chill, and the flow of the exhortation to be much choked. Still we can go no further than a modest ‘perhaps.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But even as a ‘may be,’ the thought of such a knowledge stimulates. As all the thousand eyes of assembled Greece looked on at the runners, and all the dialects of its states swelled the tumult of acclaim which surged round the victor, so here the general assembly and Church of the firstborn, the festal gathering on Mount Zion, into relations with which this very chapter says we have come, may be conceived of as sitting, solemn and still, on the thrones around the central throne, and bending not unloving looks of earnest pity on the arena below where they too once toiled and suffered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It may be that, before their eyes, who have been made wise by death, and who, standing within the ‘sanctuary of God, understand the end’ of life and life’s sorrows, are manifest our struggles, as with Weary feet and drooping limbs we blunder on in the race. Surely there is love in heaven, and it may be there is knowledge, and it may be there is care for us. It may be that, standing on the serene shore beside the Lord, who has already prepared a meal for us with His own hands, they discern, tossing on the darkened sea, the poor little boats of us downhearted, unsuccessful toilers, who cannot yet descry the Lord, or the welcome which waits on the beach.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "At all events the thought may come with cheer to our hearts, that, whether conscious of one another’s mode of being or no, they in their triumph and we in our toils are bound together with real bonds The thought, if not the knowledge, of their blessedness may be wafted down to us, just as the thought, if not the knowledge, of our labour may be in their restful souls. The hope of their tranquil shore may strengthen us that are far off upon the sea, though we cannot see more of it than the dim lights moving about, and catch an occasional fragrance in the air that tells of land, just as the memory of their stormy voyage mingles in their experience with their gladness because the waves be quiet, and God has brought them to their desired haven. Such thoughts may come with encouragement for the conflict, even if we hesitate to assert that the cloud of witnesses is a cloud of spectators. What, then, is the sense in which these heroes of the faith which the previous chapter has marshalled in a glorious bede-roll, are ‘witnesses’? The answer will be found by observing the frequent occurrence of the word, and its cognate words, in that chapter. We read there, for instance, that the elders ‘had witness borne to them’ {verse 2, Revised Version}; that Abel by the acceptance of his sacrifice, ‘had witness borne to him that he was righteous,’ ‘God bearing witness in respect of his gifts’ {verse 4, Revised Version}; that Enoch ‘had witness borne to him that he had been well pleasing unto God’ {verse 5, Revised Version}, and that the whole illustrious succession ‘had witness borne to them through their faith’ {verse 39, Revised Version}. This witness borne to them by God is, of course, His giving to them the blessings which belong to a genuine faith, whether of conscious acceptance with God, or of inward peace and power, or of outward victory over sorrows and foes. But they become witnesses to us for God by the very same facts by which He makes Himself the witness of their faith, for they therein become proofs of the blessedness of true religion, visible evidences of God’s faithfulness, and their histories shine out across the centuries testifying to us in our toils how good it is to trust in the Lord, and how small and transient are the troubles and hindrances that a life of faith meets. The calm stars declare the glory of God, and witness from age to age of His power, which keeps them every one from failing; and these bright names that shine in the heaven of His word proclaim His tender pity, and His rewarding love to all who, like them, fight the good fight. Like the innumerable suns that make up the Milky Way, they melt into one bright cloud that lies still and eternal above our heads and sheds a radiance on our dim struggles. So we have here brought out the stimulus to our Christian race from the faith and blessedness of these saints.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We have their history before us: we know what they were, and we have the ‘end of their conversation’ - that is, the issue or outcome of their manner of life - as the next chapter says. It was a hard fight, but it ended in victory. They had more than their share of sorrows and troubles, but ‘the glory dies not, and the grief is past.’ From their thrones they call to us words of cheer, and point us to their tears turned into diamonds, to their struggles stilled in depths of repose, to their wounded brows crowned with light and glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They witness to us how mighty and divine a thing is a life of faith. Their human weakness was filled with the power of God. Tremblings and self- distrust and all the ills that flesh is heir to dwelt in them. Black doubts and sore conflicts were their portion. They, too, knew what we know, how hard it is to live and do the right. But they fought through, because a mightier hand was upon them, and God’s grace was breathed into their weakness - and there they stand, victorious witnesses to us, that",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "whosoever will put his trust in the Lord shall have strength according to his need inbreathed into his uttermost weakness, and have One by his side in every furnace, like unto the Son of Man. They witness to us of companions in suffering, and the thought of them may come to a lonely heart wading in dark, deep waters, with the assurance that there is a ford, and that others have known the icy cold, and the downward rush of the stream, and have not been carried away by it. It is not a selfish thought that sometimes brings encouragement to a solitary sufferer, ‘the same afflictions have been accomplished in your brethren.’ It helps us to remember the great multitude who before us have come through the great tribulation and are before the throne. The cloud of witnesses testify how impotent is sorrow to harm, how strong to bless those who put their trust in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They witness to us of the faithfulness of God, who has led them, and upheld them, through all their conflicts, and has brought them to His side at last. That wondrous power avails for us, fresh and young, as when it helped the world’s grey fathers. God refers us to their experiences, and summons them as His witnesses, for they will speak good of His name, and each of them, as they bend down from their seats around the arena, calls to us, ‘O love the Lord, all ye His saints. I was brought low and He helped me.’ So that we, taking heart by their example, can set ourselves to our struggles with the peaceful confidence, ‘This God is our God for ever and ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word rendered ‘witnesses’ has a narrower meaning in later usage, according to which it comes to signify those who have sealed their testimony with their blood, in which sense it is transferred, untranslated, into English, in ‘martyr.’ What an eloquent epitome of the early history of the Church lies in that one fact! So ordinarily had the faithful confessor to die for his testimony that the very name had the thought of a bloody death inextricably associated with it. And if we for a moment think of that meaning, and look back to the long series of martyrs from the days of Stephen to the last Malagasy Christian or missionary, what solemn scorn of soft delights, and noble contempt of life itself may be kindled in our souls. Easy paths are appointed to us. We ‘have not yet resisted unto blood.’ Let us run our smoother race with patience, as we think of those who ran theirs with bleeding feet, and through the smoke of Smithfield or the dust of the arena beheld the heavens opened, and the Son of Man standing ready to help, and so went to their death with the light from His face changing theirs into the same image.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But let us not forget that all these witnesses for God were imperfect men, whose imperfections are full of encouragement for us. Look at the names in that great muster-roll - Noah with his drunkenness, Jacob with his craft, Samson with his giant strength and giant passion, Jephtha with his savage faithfulness to a savage vow, David with his too well-known sins, and in them all not one name to which some great evil did not cling. There are quickly reached limits to the veneration with which we are to regard the noblest heroes and saints, and none of them are to be to us patterns, however we may draw encouragement from their lives, and in some respects follow their faith. Thank God for the shameful stories told of so many of them in the unmoved narrative of Scripture! They were men of common clay. The saints’ halo is round the head of men and women like ourselves. We look at our own sins and shortcomings, and are ready to despair. But we may lift our eyes to the cloud of witnesses and for every evil of ours find a counterpart in the earthly lives of these radiant saints. Thinking of our own evil we may hopefully say, as we gaze on them, ‘Such were some of ye, but ye are washed, and ye are sanctified.’ Therefore I will not doubt but that He is able to keep me, even me, ‘from falling, and to present me faultless before the presence of His glory.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. But we are not left to draw encouragement from the remembrance of men of like passions with ourselves only.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The second of these clauses turns our thoughts to the contrasted relations between Christ and us, and the stimulus derived from it. ‘Looking unto Jesus, the author and perfecter of our faith.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Our Lord is hero very emphatically set in a place by Himself apart from all that cloud of witnesses, who in their measure are held forth as noble examples of faith. All these, the greatest names of old, are in one class, and He stands above them in a class of which He is the only member. There we see no other man save Jesus only. Whatever be the inference from that fact, the fact itself is plain. He is something to all the fighters in the lists which none of these are. Our eyes may profitably dwell on them, but we have to look higher than their serene seats, even to His throne, and the relation between us and Him is altogether unlike that which binds us to the holiest of these. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The names He bears in this context are noteworthy, ‘the author and finisher of faith,’ the former being the same word which, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is rendered ‘prince’ {of life}, and in this Epistle {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, ‘captain’ {of salvation}. Its meaning may perhaps be best given as ‘leader.’ All these others are the long files of the great army, but Christ is the Commander of the whole array. ‘As Captain of the Lord’s host am I come up, said the man with the drawn sword, who stood before Joshua as he brooded outside the walls of Jericho over his task, and that armed angel of the Lord was He who, in the fulness of time, took our humanity that He might lead the many sons to glory. Not in order of time, but by the precedence of nature, is He the Leader and Lord of all who live by faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "He is also the finisher, or more properly the perfecter of faith, inasmuch as He in His own life has shown it in its perfect form and power; inasmuch also as He gives to each of us, if we will have it, grace to perfect it in our lives; and inasmuch as, finally, He crowns and rewards it at last.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "One more remark as to the force of the language here may be allowed. The word rendered ‘looking’ is an emphatic compound, and if full force be given to both its elements, we might read it ‘looking away,’ that is, turning our eyes from all other, even the grandest of these grand witnesses, to gaze on Christ alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "All these details serve to bring out the unique position which our Lord holds, and the attitude in which we should stand to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christ is the one perfect example of faith. We are familiar with the rest of His perfect example in regard to other graces of the Christian character, but we dwell less frequently than we ought on Him as having Himself lived a life of faith. Many orthodox believers so believe in Christ’s divinity as to weaken their sense of the reality of His manhood, just as, on the other hand, a vivid apprehension of His manhood obscures to many the rays of His divinity. We lose much by not making very real to our minds that Jesus lived His earthly life by faith, that for Him as for us dependence on God, and humble confidence in Him, were the secret of peace, and the spring of power. This very Epistle, in another place, quotes the words of the psalm, ‘I will put my trust in Him,’ as the very inmost expression of Christ’s life, and as one of the ways in which He proves His brotherhood with us. He, too, knows what it is to hang on God; and is not only in His divine nature the object, but in His true manhood the pattern of our faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And His pattern is perfect. In all others, even the loveliest of saints and most heroic of martyrs, the gem is marred by many a streak of baser material, but in Him is the one ‘entire and perfect chrysolite.’ That faith never faltered, never turned its gaze from the things not seen, never slackened its grasp of the things hoped, nor degenerated into self-pleasing, nor changed its attitude of meek submission. We may look to others for examples, but they will all be sometimes warnings as well, only to Jesus we may look continually and find uusullied purity and perfect faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "He is more than example. He gives us power to copy His fair pattern. The influence of heroic, saintly lives may be depressing as well as encouraging. Despondency often creeps over us when we think of them. It is not models that we want, for we all know well enough what we ought to be, and an example of supreme excellence in morals or religion may be as hurtful as the unapproachable superiority of Shake-spears or Raphael may to a young aspirant. Perfect patterns will not save the world. They do not get themselves copied. What we want is not the knowledge of what we ought to be, but the will and the power to be it. And that we get from Christ, and from Him alone. He stretches out His hand to hold us up in our poor struggles. His grace and His peace come into our hearts, Looking to Him, His Spirit enters our spirits, and we live, yet not we, but Christ liveth in us. Models will help us little. They stand there like statues on their pedestals, pure marble loveliness; but in Christ the marble becomes flesh, and the lovely perfection has a heart to pity and a strong hand stretched out to help. So let us look away from all others, who can only give us example, to Him who can give us strength. Turn from the circling thrones to the imperial throne in the centre. We are more closely bound to Him who sits on it than to them. Look away from the cloud of witnesses to the sun of uls, from whom, gazing, we receive warmth and light and life. They may teach us to fight, but He fights in us. They are patterns of faith. So is He, but He is also its object and its giver.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christ is the imperial Rewarder of faith. At the last He will give the full possession of all which it has looked and hoped for, and will lift it into the nobler form in which, even in heaven, we shall live by faith. In that region where struggles cease, and sense and sight no longer lead astray, and we behold Him as He is, faith still abides, as conscious dependence and happy trust. It is perfected in manner, measure, and reward. And Christ is the giver of all that perfects it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Let us, then, turn away our eyes from all beside, and look to Christ. He is the Reward as well as the Rewarder of our faith. As we look to Him we shall gain power for the fight, and victory and the crown. The gladiators in the arena lowered their swords to the emperor, before they fought, with the grim greeting ‘Hail, Caesar! the dying salute thee.’ So, in happier fashion, our Lord, who has Himself fought in the lists where we now strive. Then we shall have strength for the conflict, and when the conflict is drawing to its end and all else swims before our sight, and the din grows faint in our ears, we shall close our eyes in peace; and when we open them again, lo! the bloody field, and the broken sword, and the battered helm, have all disappeared, and we sit, crowned, and palm-bearing, at His side, hailed as victors, and lapped in sweetest rest for ever more!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE PERFECTER OF FAITH",
        "children": [
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "THE PERFECTER OF FAITH",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ST. LUKE gives us two accounts of the Ascension, one at the end of his Gospel and one at the beginning of the Acts. The difference of position suggests delicate shades of colouring and of distinction in the two narratives, the one is the ending of the sweet intercourse on earth, the other is the beginning of a new era and a different type of companionship. So in that which closes the Gospel, emphasis is put upon our Lord’s ascension as being parted from; and all that is told us is of the final benediction befitting a farewell, and of the uplifted hands, which left upon their minds the last sweet impression of the departing friend. But if we turn to the Acts of the Apostles, where the incident is the same, the whole spirit of the narrative is altered. We see there the beginning of a new era, and so we read nothing about parting, but, instead of the indefinite expression, He blessed them, we hear of their promised investiture with a new power, and of there being laid upon them a new obligation - ‘Ye shall be clothed with the Spirit: ye shall be My witnesses.’ And the two men who stand by them, and are only mentioned in the Book of Acts, announce the great thought, that the departing Christ will return, ‘He shall so come in like manner as ye have seen Him go.’ All in that account has a forward aspect. It is a beginning with a new power, strengthened by a new duty, and having a far- off hope. Thus equipped, these eleven no more feel that their Lord is parted from them, nor that they are abandoned and forlorn; but they cast themselves into their new circumstances, and joyfully take up their new work. So the Ascension of Christ is represented in that second account as being the transition from the earthly to the heavenly life and type of communion with Him, and as the preparation for that great fact which my text enshrines in highly figurative language, as being the sitting at the right hand of the throne of God. The Ascension is no transient fact, it is the beginning of the permanent condition of the Church, and of the permanent present relations between Jesus Christ, God, the Church, and the world. So I desire to turn now to the various characteristics of the present and permanent relationship of Jesus Christ to these three - God, the Church, the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And first of all I wish to notice’ we have here the thought of the Enthroned Christ. The attitude of sitting indicates repose. The position at the right hand of the throne of God indicates participation in the divine energies and in the administration of the divine providences. But the point to observe is that the Ascension is declared to be the prerogative of the Man Christ Jesus. And so with great emphasis and significance, in the verse with a part of which I am now dealing, we have brought together the name of the humanity, the name that was borne by many another Jew in the same era as Jesus bore it, we have brought together the name of the humanity and the affirmation of the divine dignity, ‘We see Jesus... set down at the right hand of the throne of God.’ And over and over again, not only in this Epistle, But in other parts of Scripture, we have the same intentional, emphatic juxtaposition of the two ideas which shallow thinkers regard as in some sense incompatible - the humanity and the divinity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Remember, for instance, ‘this same Jesus shall so come in like manner as ye have seen Him go.’ And remember the rapturous and wonderful exclamation which broke from the lips of the proto-martyr. ‘Behold, I see the heavens opened and the Son of Man standing at the right hand of God.’ So then that exaltation and ascension is - according to New Testament teaching, which is not contradicted by the deepest thought of the affinities and resemblances of the divine and the human - the lifting up of the Man into the glory which the Incarnate Word had with the Father before the world was. And just as the earthly life of that Incarnate Word has shown how divine a thing a human life here may be, so the heavenly life of the still Incarnate Word shows us what our approximation to, and union with, the divine nature may be, when we are purged and perfected in the Kingdom of God, whither the Forerunner is for us entered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But further, in addition to this thought, there comes another which is constantly associated with the teaching of this session of the Son of Man at the right hand Of God, namely, that it is intercessory. That is a word the history of which will take us far, and I dare not enter upon it now. But one thing I wish to make very emphatic, and that is that the ordinary notion of intercession is not the New Testament notion. We limit it, or tend to limit it, to prayer for others. There is no such idea in the New Testament use of the phrase. It is a great deal wider than any verbal expression of sympathy and desire. It has to deal with realities and not with words. It is not a synonym for asking for another that some blessing may come upon him; but the intercession of the great High Priest who has gone into the holiest of all for us covers the whole ground of the acts by which, by reason of our deep and true union with Jesus Christ through faith, He communicates to His children whatsoever of blessing and power and sweet tokens of ineffable love He has received from the Father. Whatsoever He draws in filial dependence from the Divine Father He in brotherly unity imparts to us; and the real communication of real blessing, and not the verbal petitions for forgiveness, is what He is doing there within the veil. ‘He is able to save them to the uttermost that come unto God by Him, seeing He ever liveth to make intercession for them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But still further in this great figure of my text, the Enthroned Christ, there lies a wondrous thought which He Himself has given us, ‘I go to prepare a place for you.’ What activities are involved in that wondrous idea it boots us not to inquire, nor would it become us to say. We know that never could we tread those pure pavements except our robes and our feet had been washed By Him. But that is the consequence of His earthly work, and not of His heavenly and present energy. Perhaps in our ignorance of all that lies behind the veil, we can get little further than to see that the very fact of His presence is the preparation of the place. For that awful thought, that crushing thought, of eternal life under conditions bewilderingly different from anything we experience here, would be no joy unless we could say we shall see Him and be with Him. I know not how it may be with you, but I think that the nearer we come to the end of the earthly life, and the more the realities beyond begin to press upon our thoughts and our imaginations as those with which we shall soon make acquaintance, we feel more and more how unquestionable the misery the thought of eternal life would bring if it were not for the fact that the world beyond is lighted up and made familiar by the thought of Christ’s presence there. Can you fancy some poor clod-hopping rustic brought up from a remote village and set down all in a moment in the midst of some brilliant court? How out of place he would feel, how unhomelike it would appear, how ill at ease he would be; ay, and what an unburdening there would be in his heart, if amongst the strange splendour he detected beneath the crown and above the robes, sitting on the throne, one whom he had known in the far-off hamlet, and who there had taken part with him in all the ignoble toils and narrow interests of that rustic scene. Jesus said, ‘I go to prepare a place for you,’ and when I lift up my eyes to those far-off realities which overwhelm me when I try to think about them, I say, I am not dazzled by the splendour, I am not oppressed by the perpetuity of it, I do not faint at the thought of unlike conditions, for I shall be the same and He will be with me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘It is enough that Christ knows all, And I shall be with Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And so the Enthroned Christ is preparing a place for us. Ay, brethren, and He is not preparing it for us only when we die, but He is preparing it for us whilst we live; for it is only by faith in Him that we have boldness of access and confidence. And neither for the prayers and desires of Christian men on earth nor for the spirits of just men made perfect hereafter will the eternal golden gates swing open except His hand is on the bolt, and by His power the way into the Holiest is made manifest. And so set your minds as well as your affections on the things above, where Christ is sitting on the right hand of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, secondly, we have here the Present Christ. Matthew, in his Gospel, does not tell of the Ascension, but he preserves the promise, ‘Lo, I am with you alway, even to the end of the world,’ and that promise is not contradicted, but is realised by the fact of Christ’s ascension. He does tell us of the remarkable utterance to Mary on the morning of the Resurrection. ‘Touch Me not, for I am not yet ascended to My Father.’ The implication that we have plainly is, when I am ascended you may touch. And the contact of even her nervous and clutching hand round His feet is less than the touch and the presence for which that departure makes the way. ‘He was parted from them’ is the thought that ends the Gospel. He was parted for a season that thou mightest receive Him for ever, is the thought that begins the Acts and the history of the Church. And it is true of Him and His relation to us,, and because it is true about Him and about His relation to us, it is also true about all those who sleep in Jesus. Their relation towards the earthly form ceases, and there is an empty place where they once stood.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But there is a presence more real and capable of yielding finer influences, strengthening and sanctifying, than ever came from the earthly presence. It is blessed to clasp hands, it is blessed to link arms, it is blessed to press together the lips; but there is a higher touch than these, and sight is a less clear vision than faith; and they who can pass across the abyss of the centuries and the yet broader and deeper and blacker abyss between earth and heaven, and lay the hand of faith on the hand of Christ, have passed through the veil, that is to say His flesh, and have clasped His real presence. Yes, and the thing that calls itself such, is but a part of the general retrogression of Catholicism to heathenism and materialism. We have the real presence if we have the Christ in our heart by faith. He is present with us; enthroned on high above all heavens, He yet is near the humblest heart, the companion of the lonely, the solace of all that trust Him. ‘He trod the winepress alone,’ in order that none of us need ever live alone or die alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And there is another side to this presence. As I have said, He is present with us here, and you and I may be present with Him yonder; for one of the Epistles tells us that, ‘we die with Him that we may live with Him, and that God has quickened us {if we are Christian people} together with Him and made us sit together with Him in heavenly places in Christ Jesus.’ Your life, Christian men and women, is in its roots and sources, and ought to be in its flow and course, ‘hid with Christ in God,’ and you should not only seek to realise the presence of the Master with you, but to climb to Himself, being present with Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Thirdly, this great figure of my text sets before us the working Christ. The attitude of sitting at the right hand of God suggests repose; but that is a repose which is consistent with, and is accompanied by, the greatest energy for continuous operation. You remember, no doubt {although, perhaps, not in its full significance}, the great words with which the close of St. Mark’s Gospel points on to the future, ‘So then, after the Lord had spoken unto them, He was received up into heaven, and sat on the right hand of God. And they went everywhere preaching the word.’ The Master gone, the servants left; the Master resting, the servants journeying and toiling. It is like the two halves of Raphael’s great transfiguration picture. The Lord and the three are up there in the amber light, the demoniac boy writhing in his convulsions, and the disciples by him helpless, down here. The gap is great. Yes. ‘They went everywhere preaching the Word, the Lord also working with them, and confirming the Word with signs following.’ There is the true notion of the repose of Christ resting indeed at the right hand of God, yet working with His servants scattered over the face of the earth. And so in the Book of the Acts of the Apostles, the keynote is struck when St. Luke says, ‘The former treatise have I made of all that Jesus began both to do and to teach until the day on which He was taken up’; and this treatise, O Theophilus, is the second volume of the one story, the history of all that Jesus Continued both to do and to teach after the day on which He was taken up. Acts of the Apostles? No; Acts of the Ascended Christ - that is the name of the book. Never mind about the apostles. They do come into the foreground; but the writer has little care about them. It is the Christ who is moving; and so we find it all through the book, the Lord did this, the Lord did that, the Lord did the other thing; and the apostles are, I was going to say, the pawns on the chess-board. And so you remember, too, that dying Stephen saw the Son of Man standing at the right hand of God. He sprang to his feet, not breaking the eternal repose, to look down and to send down help and sustenance and blessing and good cheer to the man there at the foot of the old wall ready to die for Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And that is. the type of the whole history of the Church, I have said that Christ’s Ascension is the transition from the lower to the higher form of presence; and it is the transition to the wider form of work. He works for us, on us, in us, and with us, and as the apostle Peter said in expounding the significance of the Day of Pentecost, ‘Being to the right hand of God exalted He hath shed forth this,’ so the Christ is no longer tired, but is still working, working in us, with us, and for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And lastly, the metaphor of my text brings before us the returning Christ, It was not only the angel’s message that declared that departure and ascension were not the last that the worker was going to see of. Jesus. The necessities of the case, if I may say so, tell us the same message. The Incarnation necessarily involves the Crucifixion; the Crucifixion {if it is what we believe it to be} as necessarily involves the Resurrection, ‘for it was not possible that He should be holden of it,’ the grim death. The Resurrection and the Ascension are but as it were the initial point, which is produced into the line of His heavenly session. It cannot be that Ascension is the last word to be said The path of the King does not run into a cul de sac like that. The world has not done with Jesus Christ. He is coming, was the great thought around which all the past clustered. He will come, is the great hope around which all the future hopes for the Church and the world are piled and built, ‘He shall so come in like manner as ye havre seen Him go,’ corporeally, visibly, locally, in His manhood, in His divinity. ‘As He was once offered to bear the sin of many, so shall He come the second time without sin unto salvation.’ Brethren, that is the hope of the Church, discredited by many unworthy representations and mixed up with a great deal that does not commend it by the folly of those who believe in it; but standing out so distinct and so required by all that is gone before, that no Christian man can afford to relegate the expectation into the region of dimness, or to waver in his faith in it, without much imperilling his conception of his Master, and the blessedness of union with Him. You do not understand the Cross unless you believe in the throne; and you do not understand the throne unless you believe in the judgment-seat. The returning Christ shall judge the world. Brethren! Jesus is enthroned. Do you bow to His command? Do you trust His power? Do you see in Him the pattern of what you may be, and the pledge that you will be it if you put your confidence in your Lord? The enthroned Christ is present. Do you walk in blessed and continuous communion with Him? The enthroned and present Christ is working. Do you trust in His operation, peacefully, for yourself, for the Church, for the world? Do you open your heart to the abundant energies with which He is flooding His Church, and which His Church is so sadly and so much allowing to run to waste? The enthroned, present, working Christ is coming back, and you and I have to choose whether we shall be of ‘the servants whom the Lord, when He cometh, shall find watching,’ and obeying His command with girt loins and lit lamps, and so will sweep with Him into the festal hall, and sit down with Him, on His throne; or whether we shall wail because of Him, and shrink abashed from the judgment-seat of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 12:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Looking ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αφορωντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looking off, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "from all other things; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto Jesus ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the wounded Israelites looked to the brazen serpent. Our crucified Lord was prefigured by the lifting up of this; our guilt by the stings of the fiery serpents; and our faith by their looking up to the miraculous remedy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the author and finisher of our faith ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who called us out to this strenuous yet glorious enterprise, who animates us by his example, and supports us by his grace, till the season comes in which he shall bestow upon us the promised crown; or who begins it in us, carries it on, and perfects it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who for the joy that was set before him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, that of bringing many sons unto glory; or, who, in consideration of that glory and dignity his human nature should be advanced to, as a reward of his labours and sufferings, and of that satisfaction and pleasure he should take in the happiness of his members, procured for them by his incarnation, life, and death; patiently and willingly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "endured the cross ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The ignominious and painful death of crucifixion, with all the torture and misery connected therewith; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "despising the shame ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not accounting the disgrace which attended his sufferings so great an evil as for fear thereof to neglect the prosecution of his great and glorious design. He did not faint because of it; he regarded it not, in comparison of the blessed and glorious effect of his sufferings, which was always in his eye. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And is set down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Where there is fulness of joy for evermore. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-11 The persevering obedience of faith in Christ, was the race set before the Hebrews, wherein they must either win the crown of glory, or have everlasting misery for their portion; and it is set before us. By the sin that does so easily beset us, understand that sin to which we are most prone, or to which we are most exposed, from habit, age, or circumstances. This is a most important exhortation; for while a man's darling sin, be it what it will, remains unsubdued, it will hinder him from running the Christian race, as it takes from him every motive for running, and gives power to every discouragement. When weary and faint in their minds, let them recollect that the holy Jesus suffered, to save them from eternal misery. By stedfastly looking to Jesus, their thoughts would strengthen holy affections, and keep under their carnal desires. Let us then frequently consider him. What are our little trials to his agonies, or even to our deserts? What are they to the sufferings of many others? There is a proneness in believers to grow weary, and to faint under trials and afflictions; this is from the imperfection of grace and the remains of corruption. Christians should not faint under their trials. Though their enemies and persecutors may be instruments to inflict sufferings, yet they are Divine chastisements; their heavenly Father has his hand in all, and his wise end to answer by all. They must not make light of afflictions, and be without feeling under them, for they are the hand and rod of God, and are his rebukes for sin. They must not despond and sink under trials, nor fret and repine, but bear up with faith and patience. God may let others alone in their sins, but he will correct sin in his own children. In this he acts as becomes a father. Our earthly parents sometimes may chasten us, to gratify their passion, rather than to reform our manners. But the Father of our souls never willingly grieves nor afflicts his children. It is always for our profit. Our whole life here is a state of childhood, and imperfect as to spiritual things; therefore we must submit to the discipline of such a state. When we come to a perfect state, we shall be fully reconciled to all God's chastisement of us now. God's correction is not condemnation; the chastening may be borne with patience, and greatly promote holiness. Let us then learn to consider the afflictions brought on us by the malice of men, as corrections sent by our wise and gracious Father, for our spiritual good.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Looking unto Jesus - As a further inducement to do this, the apostle exhorts us to look to the Saviour. We are to look to his holy life; to his patience and perseverance in trials; to what he endured in order to obtain the crown, and to his final success and triumph.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The author and finisher of our faith - The word \"our\" is not in the original here, and obscures the sense. The meaning is, he is the first and the last as an example of faith or of confidence in God - occupying in this, as in all other things, the pre-eminence, and being the most complete model that can be placed before us. The apostle had not enumerated him among those who had been distinguished for their faith, but he now refers to him as above them all; as a case that deserved to stand by itself. It is probable that there is a continuance here of the allusion to the Grecian games which the apostle had commenced in the previous verse. The word \"author\" - ἀρχηγὸν  archēgon - (marg. beginner) - means properly the source, or cause of anything; or one who makes a beginning. It is rendered in Acts 3:15; Acts 5:31, \"Prince\"; in Hebrews 2:10, \"Captain\"; and in the place before us, \"Author.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The author and finisher of our faith - The word \"our\" is not in the original here, and obscures the sense. The meaning is, he is the first and the last as an example of faith or of confidence in God - occupying in this, as in all other things, the pre-eminence, and being the most complete model that can be placed before us. The apostle had not enumerated him among those who had been distinguished for their faith, but he now refers to him as above them all; as a case that deserved to stand by itself. It is probable that there is a continuance here of the allusion to the Grecian games which the apostle had commenced in the previous verse. The word \"author\" - ἀρχηγὸν  archēgon - (marg. beginner) - means properly the source, or cause of anything; or one who makes a beginning. It is rendered in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 5:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Prince\"; in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Captain\"; and in the place before us, \"Author.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It does not occur elsewhere in the New Testament. The phrase \"the beginner of faith,\" or the leader on of faith, would express the idea. He is at the head of all those who have furnished an example of confidence in God, for he was himself the most illustrious instance of it. The expression, then, does not mean properly that he produces faith in us, or that we believe because he causes us to believe - whatever may be the truth about that - but that he stands at the head as the most eminent example that can be referred to on the subject of faith. We are exhorted to look to him, as if at the Grecian games there was one who stood before the racer who had previously carried away every palm of victory; who had always been triumphant, and with whom there was no one who could be compared. The word \"finisher\" -  τελειωτὴν  teleiōtēn - corresponds in meaning with the word \"author.\" It means that he is the completer as well as the beginner; the last as well as the first.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As there has been no one hitherto who could be compared with him, so there will be no one hereafter; compare Revelation 1:8, Revelation 1:11. \"I am Alpha and Omega, the beginning and the ending, the first and the last.\" The word does not mean that he was the \"finisher\" of faith in the sense that he makes our faith complete or perfects it - whatever may be true about that - but that he occupies this elevated position of being beyond comparison above all others. Alike in the commencement and the close, in the beginning of faith, and in its ending, he stands pre-eminent. To this illustrious model we should look - as a racer would on one who had been always so successful that he surpassed all competitors and rivals. If this be the meaning, then it is not properly explained, as it is commonly (see Bloomfield and Stuart in loc.), by saying that the word here is synonymous with \"rewarder,\" and refers to the βραβευτὴς  brabeutēs - or the distributor of the prize; compare notes on Colossians 3:15, There is no instance where the word is used in this sense in the New Testament (compare Passow), nor would such an interpretation present so beautiful and appropriate a thought as the one suggested above.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As there has been no one hitherto who could be compared with him, so there will be no one hereafter; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"I am Alpha and Omega, the beginning and the ending, the first and the last.\" The word does not mean that he was the \"finisher\" of faith in the sense that he makes our faith complete or perfects it - whatever may be true about that - but that he occupies this elevated position of being beyond comparison above all others. Alike in the commencement and the close, in the beginning of faith, and in its ending, he stands pre-eminent. To this illustrious model we should look - as a racer would on one who had been always so successful that he surpassed all competitors and rivals. If this be the meaning, then it is not properly explained, as it is commonly (see Bloomfield and Stuart in loc.), by saying that the word here is synonymous with \"rewarder,\" and refers to the βραβευτὴς  brabeutēs - or the distributor of the prize; compare notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", There is no instance where the word is used in this sense in the New Testament (compare Passow), nor would such an interpretation present so beautiful and appropriate a thought as the one suggested above.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Who for the joy that was set before him - That is, who in view of all the honor which he would have at the right hand of God, and the happiness which he would experience from the consciousness that he had redeemed a world, was willing to bear the sorrows connected with the atonement.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Endured the cross - Endured patiently the ignominy and pain connected with the suffering of death on the cross.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Despising the shame - Disregarding the ignominy of such a mode of death. It is difficult for us now to realize the force of the expression, \"enduring the shame of the cross,\" as it was understood in the time of the Saviour and the apostles. The views of the world have changed, and it is now difficult to divest the \"cross\" of the associations of honor and glory which the word suggests, so as to appreciate the ideas which encompassed it then. There is a degree of dishonor which we attach to the guillotine, but the ignominy of a death on the cross was greater than that; there is disgrace attached to the block, but the ignominy of the cross was greater than that; there is a much deeper infamy attached to the gallows, but the ignominy of the cross was greater than that. And that word - the cross - which when now proclaimed in the ears of the refined, the intelligent, and even the frivolous, excites an idea of honor, in the ears of the people of Athens, of Corinth, and of Rome, excited deeper disgust than the word \"gallows\" does with us - for it was regarded as the appropriate punishment of the most infamous of mankind.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We can now scarcely appreciate these feelings, and of course the declaration that Jesus \"endured the cross, despising the shame,\" does not make the impression on our minds in regard to the nature of his sufferings, and the value of his example, which it should do. When we now think of the \"cross,\" it is not of the multitude of slaves, and robbers, and thieves, and rebels, who have died on it, but of the one great Victim, whose death has ennobled even this instrument of torture, and encircled it with a halo of glory. We have been accustomed to read of it as an imperial standard in war in the days of Constantine, and as the banner under which armies have marched to conquest; it is intermingled with the sweetest poetry; it is a sacred thing in the most magnificent cathedrals; it adorns the altar, and is even an object of adoration; it is in the most elegant engravings; it is worn by beauty and piety as an ornament near the heart; it is associated with all that is pure in love, great in self-sacrifice, and holy in religion. To see the true force of the expression here, therefore, it is necessary to divest ourselves of these ideas of glory which encircle the \"cross,\" and to place ourselves in the times and lands in which, when the most infamous of mankind were stretched upon it, it was regarded for such people as an appropriate mode of punishment. That infamy Jesus was willing to bear, and the strength of his confidence in God, his love for man, and the depth of his humiliation, was shown in the readiness and firmness with which he went forward to such a death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And is set down at the right hand of the throne of God - Exalted to the highest place of dignity and honor in the universe; Mark 16:19 note; Ephesians 1:20-22 notes. The sentiment here is, \"Imitate the example of the great Author of our religion. He, in view of the honor and joy before him, endured the most severe sufferings to which the human frame can be subjected, and the form of death which is regarded as the most shameful. So amidst all the severe trials to which you are exposed on account of religion, patiently endure all - for the glorious rewards, the happiness and the triumph of heaven, are before you.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And is set down at the right hand of the throne of God - Exalted to the highest place of dignity and honor in the universe; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 1:20-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " notes. The sentiment here is, \"Imitate the example of the great Author of our religion. He, in view of the honor and joy before him, endured the most severe sufferings to which the human frame can be subjected, and the form of death which is regarded as the most shameful. So amidst all the severe trials to which you are exposed on account of religion, patiently endure all - for the glorious rewards, the happiness and the triumph of heaven, are before you.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. Looking unto—literally, \"Looking from afar\" (see on [2594]Heb 11:26); fixing the eyes upon Jesus seated on the throne of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "author—\"Prince-leader.\" The same Greek is translated, \"Captain (of salvation),\" Heb 2:10; \"Prince (of life),\" Ac 3:15. Going before us as the Originator of our faith, and the Leader whose matchless example we are to follow always. In this He is distinguished from all those examples of faith in Heb 11:2-40. (Compare 1Co 11:1). On His \"faith\" compare Heb 2:13; 3:12. Believers have ever looked to Him (Heb 11:26; 13:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "finisher—Greek, \"Perfecter,\" referring to Heb 11:40.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of our faith—rather as Greek, \"of the faith,\" including both His faith (as exhibited in what follows) and our faith. He fulfilled the ideal of faith Himself, and so, both as a vicarious offering and an example, He is the object of our faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the joy … set before him—namely, of presently after sitting down at the right hand of the throne of God; including besides His own personal joy, the joy of sitting there as a Prince and Saviour, to give repentance and remission of sins. The coming joy disarmed of its sting the present pain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cross … shame—the great stumbling-block to the Hebrews. \"Despised,\" that is, disregarded.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Looking unto Jesus the author and finisher of our faith:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as if all the former witnesses were not enough, he adds a more excellent one than them all, even our Lord Jesus Christ, who is not only a pattern to them in their race and running of it, but a help, and for which end they were looking to him: the word aforwntev is only here used in all the New Testament, and signifieth a looking off from whatever would distract us from earnestly looking on the proposed object alone; and though a word of sense, yet here noteth an act of the mind. It is borrowed from racers, the similitude of whom the apostle further improves: they fixedly eye their guides or leaders, to help them on in their course; so must a Christian in his race look off from all things else, and singly and intently look on Jesus to help him through it; archgon see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; here it denotes Jesus to be the great institutor of, and chief leader in, the Christian race, and perfecter of them in running it. The disposition, grace, ability, and success which they have for running, it is all from him; from the beginning of the work of faith unto the end of it, to the finishing of the course, he doth infuse, assist, strengthen, and accomplish the work of it to the last, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 6:29,30 Php 4:13 2 Timothy 4:7 1Jo 5:4,5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",30 Php 4:13 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who for the joy that was set before him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who for that joyful and glorious state which was clearly represented and faithfully promised to him by his Father to succeed his sufferings, that he should immediately attain himself, and successively communicate to all who believe in him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 24:26 John 17:1,5,24 1 Peter 1:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",5,24 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This did so cheer and strengthen him, that with unexpressible patience he cheerfully ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "endured the cross, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with all the concomitants of it, the sorrows in his soul, the torturing pains in his body, of buffetings, smitings, piercings of thorns, tearing his flesh with scourges, boring of his hands and feet with nails, with all the evils that either the malice or rage of devils or men could inflict on him; he was neither weary of his burden, nor shrinking from nor fainting under it. With what invincible meekness and passive fortitude did he undergo all that was foretold of him! ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 53:1-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Despising the shame; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the same time slighting and casting out of his thoughts all the disgrace poured on him by his enemies, both in his mind and action, contemning all the blasphemies, taunts, reproaches, and shameful carriages of sinners to him, suffering without any emotion all their indignities, even in the most shameful death itself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Philippians 2:6-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:6-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", though he were the most innocent as well as excellent person in all the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And is set down at the right hand of the throne of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the issue of all which was, his exaltation by God for his abasement by man; he riseth from the dead, ascendeth to heaven, sets himself down as a triumphing conqueror over sin, the prince of the powers in the air, death, and hell, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "at the right hand of the throne of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and thence discovers himself in his state and glory, as the great Ruler of the world, King of kings, and Lord of lords, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Philippians 2:9,10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "{see Hebrews 8:1}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "{see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hebrews 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and the glorious rewarder of those who serve him, and suffer for him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Looking unto Jesus, the author and finisher of our faith,.... Not with bodily eyes, for at present he is not to be looked upon in this manner, but with the eye of the understanding, or with the eye of faith; for faith is a seeing of the Son; it is a spiritual sight of Christ, which is at first but glimmering, afterwards it increases, and is of a soul humbling nature; it is marvellous and surprising; it transforms into the image of Christ, and fills with joy unspeakable, and full of glory: a believer should be always looking to Christ, and off of every object, as the word here used signifies. Christ is to be looked unto as \"Jesus\", a Saviour, who being appointed and sent by God to be a Saviour, came, and is become the author of eternal salvation; and to him only should we look for it: he is able and willing to save; he is a suitable, complete, and only Saviour; and whoever look to him by faith shall be saved; and he is to be considered, and looked unto, as \"the author and finisher of faith\": he is the author or efficient cause of it; all men are by nature without it; it is not in the power of man to believe of himself; it is a work of omnipotence; it is an instance of the exceeding greatness of the power of God; and it is the operation of Christ, by his Spirit; and the increase of it is from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and he is the finisher of it; he gives himself, and the blessings of his grace, to his people, to maintain and strengthen it; he prays for it, that it fail not; he carries on the work of faith, and will perform it with power; and brings to, and gives that which is the end of it, eternal life, or the salvation of the soul. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who for the joy that was set before him; the word  rendered \"for\"; sometimes signifies, in the room, or stead of, as in Matthew 2:22 and is so rendered here in the Syriac and Arabic versions; and then the sense is, that Christ instead of being in the bosom of the Father, came into this world; instead of being in the form of God, he appeared in the form of a servant; instead of the glory which he had with his Father from eternity, he suffered shame and disgrace; instead of living a joyful and comfortable life on earth, he suffered a shameful and an accursed death; and instead of the temporal joy and glory the Jews proposed to him, he endured the shame and pain of the cross: sometimes it signifies the end for which a thing is, as in Ephesians 5:31 and may intend that, for the sake of which Christ underwent so much disgrace, and such sufferings; namely, for the sake of having a spiritual seed, a numerous offspring with him in heaven, who are his joy, and crown of rejoicing; for the sake of the salvation of all the elect, on which his heart was set; and for the glorifying of the divine perfections, which was no small delight and pleasure to him. And to this agrees the Chaldee paraphrase of Psalm 21:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who for the joy that was set before him; the word  rendered \"for\"; sometimes signifies, in the room, or stead of, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and is so rendered here in the Syriac and Arabic versions; and then the sense is, that Christ instead of being in the bosom of the Father, came into this world; instead of being in the form of God, he appeared in the form of a servant; instead of the glory which he had with his Father from eternity, he suffered shame and disgrace; instead of living a joyful and comfortable life on earth, he suffered a shameful and an accursed death; and instead of the temporal joy and glory the Jews proposed to him, he endured the shame and pain of the cross: sometimes it signifies the end for which a thing is, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and may intend that, for the sake of which Christ underwent so much disgrace, and such sufferings; namely, for the sake of having a spiritual seed, a numerous offspring with him in heaven, who are his joy, and crown of rejoicing; for the sake of the salvation of all the elect, on which his heart was set; and for the glorifying of the divine perfections, which was no small delight and pleasure to him. And to this agrees the Chaldee paraphrase of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 21:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O Lord, in thy power shall the King Messiah  \"rejoice\", and in thy redemption how greatly will he exult!'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And also because of his own glory as Mediator, which was to follow his sufferings, and which includes his resurrection from the dead, his exaltation at the right hand of God, and the whole honour and glory Christ has in his human nature; see Psalm 16:8 and with a view to all this, he endured the cross; which is to be taken not properly for that frame of wood, on which he was crucified; but, improperly, for all his sufferings, from his cradle to his cross; and particularly the tortures of the cross, being extended on it, and nailed unto it; and especially the death of the cross, which kind of death he endured to verify the predictions of it,  Psalm 22:16 and to show that he was made a curse for his people; and this being a Roman punishment, shows that the sceptre was taken from Judah, and therefore the Messiah must be come; and that Christ suffered for the Gentiles, as well as Jews: and this death he endured with great courage and intrepidity, with much patience and constancy, and in obedience to the will of his Father: despising the shame; of the cross; for it was an ignominious death, as well as a painful one; and as he endured the pain of it with patience, he treated the shame of it with contempt; throughout the whole of his life, he despised the shame and reproach that was cast upon him; and so he did at the time of his apprehension, and when upon his trial, and at his death, under all the ignominious circumstances that attended it; which should teach us not to be ashamed of the reproach of Christ, but count it an honour to be worthy to suffer shame for his name. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And also because of his own glory as Mediator, which was to follow his sufferings, and which includes his resurrection from the dead, his exaltation at the right hand of God, and the whole honour and glory Christ has in his human nature; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and with a view to all this, he endured the cross; which is to be taken not properly for that frame of wood, on which he was crucified; but, improperly, for all his sufferings, from his cradle to his cross; and particularly the tortures of the cross, being extended on it, and nailed unto it; and especially the death of the cross, which kind of death he endured to verify the predictions of it,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to show that he was made a curse for his people; and this being a Roman punishment, shows that the sceptre was taken from Judah, and therefore the Messiah must be come; and that Christ suffered for the Gentiles, as well as Jews: and this death he endured with great courage and intrepidity, with much patience and constancy, and in obedience to the will of his Father: despising the shame; of the cross; for it was an ignominious death, as well as a painful one; and as he endured the pain of it with patience, he treated the shame of it with contempt; throughout the whole of his life, he despised the shame and reproach that was cast upon him; and so he did at the time of his apprehension, and when upon his trial, and at his death, under all the ignominious circumstances that attended it; which should teach us not to be ashamed of the reproach of Christ, but count it an honour to be worthy to suffer shame for his name. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And is set down at the right hand of the throne of God; Which is in heaven; and is expressive of the majesty and glory of God; and of the honour done to Christ in human nature, which is not granted to any of the angels: here Christ sits as God's fellow, as equal to him, as God, and as having done his work as man, and Mediator; and this may assure us, that when we have run out our race, we shall sit down too, with Christ upon his throne, and be at rest. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And is set down at the right hand of the throne of God; Which is in heaven; and is expressive of the majesty and glory of God; and of the honour done to Christ in human nature, which is not granted to any of the angels: here Christ sits as God's fellow, as equal to him, as God, and as having done his work as man, and Mediator; and this may assure us, that when we have run out our race, we shall sit down too, with Christ upon his throne, and be at rest. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{2} {b} Looking unto Jesus the author and finisher of our faith; who for the {c} joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{2}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Looking unto Jesus the author and finisher of ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "our",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " faith; who for the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) He sets before us, as the mark of this race, Jesus himself our captain, who willingly overcame all the roughness of the same way.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) As it were upon the mark of our faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) While he had every type of blessedness in his hand and power, yet suffered willingly the shame of the cross.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Second factor in the encouragement. Not only the example of the O. T. witnesses for the faith, but also the example of the Beginner and Perfecter of the faith, Christ Himself, must animate us to a persevering ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τρέχειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀφορῶντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in that we look forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (for our encouragement and for our ardent imitation). ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀφορᾶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as, immediately after, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τελειωτής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") only here in the N. T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς τὸν τῆς πίστεως ἀρχηγὸν καὶ τελειωτὴν Ἰησοῦν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to the Beginner and Perfecter of the faith, Jesus, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to Jesus, who has begun or awakened in us the Christian faith, and carries it on in us to perfection, or to the close (Chrysostom, Oecumenius, Theophylact, Erasmus, and the majority), which last particular then naturally includes the attaining of salvation. But it is going too far when one finds—as Grotius, Bloomfield, and many others—in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τελειωτής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the figure of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βραβευτής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the judge or umpire of the games, who, on the completion of the contest, awards the prize of victory; for the expression itself does not warrant this special application. According to Bengel, Baumgarten, Schulz, Bleek, de Wette, Ebrard, Bisping, Grimm (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Theol. Literaturbl. z. Darmst. Ally. Kirch.-Zeit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 1857, No. 29, p. 667), Nickel (Reuter’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Repertor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". March 1858, p. 208 f.), Riehm (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lehrbeyr. des Hebräerbr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 326), Maier, Moll, Kurtz,—comp. also Theodoret: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Κατὰ τὸ ἀνθρώπινον ἀμφότερα τέθεικεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ τῆς πίστεως ἀρχηγὸς καὶ τελειωτὴς Ἰησοῦς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has the sense: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus, who in manifestation of the faith has preceded us by His example, and in the manifestation of this faith has carried on the work unto perfection",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[114] But the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "virtue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of faith the author of the Epistle to the Hebrews could not possibly predicate of Christ in like manner as he does of the Christians. From the lofty conception he had of the person of the Redeemer, he must, like the Apostle Paul, regard Him by whom the divine decrees of salvation were to be realized, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "object",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πίστις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". More than this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΤΕΛΕΙΩΤΉς",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΤΕΛΕΙΩΤΉς",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " can be used only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "transitively",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not also ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "intransitively",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχηγὸς τῆς πίστεως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stands, therefore, in a sense quite analogous to that of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἈΡΧΗΓῸς Τῆς ΣΩΤΗΡΊΑς",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἈΡΧΗΓῸς Τῆς ΣΩΤΗΡΊΑς",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the exemplary characteristic in Jesus, to which the author directs his readers, is not already expressed by His being designated as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἈΡΧΗΓῸς ΚΑῚ ΤΕΛΕΙΩΤῊς Τῆς ΠΊΣΤΕΩς",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἈΡΧΗΓῸς ΚΑῚ ΤΕΛΕΙΩΤῊς Τῆς ΠΊΣΤΕΩς",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",—which, on the contrary, is only designed to make us aware of the assistance which Christ affords the Christians in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΤΡΈΧΕΙΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΤΡΈΧΕΙΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",—but first ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expressed by means of the following relative clause.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀντὶ τῆς προκειμένης αὐτῷ χαρᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who for the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (heavenly) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joy lying ready for Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the obtaining of which should be the reward of His sufferings. So Primasius, Piscator, Schlichting, Grotius, Bengel, Whitby, Schulz, Böhme, Stuart, Bleek, de Wette, Tholuck, Ebrard, Delitzsch, Riehm (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lehrbegr. des Hebräerbr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 357), Alford, Maier, Moll, Kurtz, Hofmann, Woerner, and the majority. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀντί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΧΑΡΆ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΧΑΡΆ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", however, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comprehended under the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΠΡΟΚΕΙΜΈΝΗ ΑὐΤῷ ΧΑΡΆ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΠΡΟΚΕΙΜΈΝΗ ΑὐΤῷ ΧΑΡΆ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is also the joy over the completed work of redemption, with its blessings for mankind; yet it is erroneous, with Theodoret (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΧΑΡᾺ ΔῈ ΤΟῦ ΣΩΤῆΡΟς ΤῶΝ ἈΝΘΡΏΠΩΝ Ἡ ΣΩΤΗΡΊΑ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΧΑΡᾺ ΔῈ ΤΟῦ ΣΩΤῆΡΟς ΤῶΝ ἈΝΘΡΏΠΩΝ Ἡ ΣΩΤΗΡΊΑ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), to limit it thereto. The sense is not: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "instead of the heavenly glory which He already had as the premundane Logos, and which He might have retained, but which He gave up by His incarnation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Peshito, Gregory Nazianz. in Oecum.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ᾧ ἐξὸν μένειν ἐπὶ τῆς ἰδίας δόξης τε καὶ θεότητος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ μόνον ἑαυτὸν ἐκένωσεν ἄχρι τῆς δούλου μορφῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀλλὰ καὶ σταυρὸν ὑπέμεινεν κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; Beza, Nemethus, Heinrichs, Ewald). Nor is it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "instead of the earthly freedom from suffering, which, as the sinless One, He could have procured for Himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Chrysostom, Oecumenius, Theophylact, Zeger, Jac. Cappellus, Calov, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".); or: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "instead of the joys of the world, which Jesus, had He willed it, could have partaken of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Calvin, Wolf, Carpzov, Stein, Bisping, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). For the immediate concern of the author must evidently be to point to the prize which Christ was to receive in return for His sufferings, in order thereupon further to indicate that to the readers likewise, upon their persevering in the conflict, the palm of victory will not be wanting. A further consideration is, that also the closing member of the verse, which is closely attached by means of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to that which precedes, has for its subject-matter still the thought of the reward conferred upon Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὙΠΈΜΕΙΝΕΝ ΣΤΑΥΡΌΝ, ΑἸΣΧΎΝΗς ΚΑΤΑΦΡΟΝΉΣΑς",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ὙΠΈΜΕΙΝΕΝ ΣΤΑΥΡΌΝ, ΑἸΣΧΎΝΗς ΚΑΤΑΦΡΟΝΉΣΑς",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "endured the cross, in that He contemned the infamy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the death of the cross was crudelissimum teterrimumque supplicium (Cic. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Verr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 5. 64).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν δεξιᾷ τε τοῦ θρόνου τοῦ θεοῦ κεκάθικεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and has sat down at the right hand of the throne of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[114] Inconsistently does Delitzsch adhere to this explanation (and similarly Alford and Kluge),—in reference, indeed, to the notion ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ τῆς πίστεως ἀρχηγός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—but rejects it in reference to the notion, necessarily combining in homogeneity therewith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ τῆς πίστεως τελειωτής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense is supposed to be: “Jesus is the Prince of faith: for upon the path on which faith has to run, He has gone first to open the way; He is faith’s Completer: for upon this path He leads us to the goal.” That Jesus Himself reached the goal upon this path, is then supposed to be an unuttered intermediate thought (!).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looking unto Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It is not possible to express in English the thought suggested by the Greek verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "aphorôntes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which implies that we must “look away (from other things) unto Jesus.” It implies “the concentration of the wandering gaze into a single direction.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the author",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word is the same (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχηγὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 5:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is rendered “a Prince,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX.). By His faithfulness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") he became our captain and standard-bearer on the path of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and finisher",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He leads us to “the end of our faith,” which is the salvation of our souls (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of our faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, “of faith.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "endured the cross, despising the shame",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., “endured ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cross",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", despising shame.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is set down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, “hath sat down” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀφορῶντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " denotes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "afar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπέβλεπε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He, says the apostle, sits at the right hand of the throne of GOD.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς τὸν τῆς πίστεως ἀρχηγὸν καὶ τελειωτὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to the prince and finisher of our faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") By this appellation Jesus is distinguished from all those who are enumerated in ch. 11. He Himself is the only matchless example, the only rule and standard of our faith. He is called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prince and Finisher of faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because He Himself showed faith in the Father from the beginning to the end: ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Our faith, first and last, has respect to Him: it is drawn from Him to its necessary consequence (following Him), and is confirmed: believers, from the first to the last, have looked and still look to Him: ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀντὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The faith of Jesus is hereby denoted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the joy set before Him, namely, that joy which He was presently to experience, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". With equal willingness, He meanwhile endured the cross. [—— For the joy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e. that He might obtain the joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.] Christ had not such a mind as that the cross should not seem to be a matter of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joy;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προκίμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προκειμένης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " correspond to one another.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σταυρὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the cross",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Now at last, Paul, after he had strengthened the faith of those to whom he is writing, expresses the name of the cross, which was hateful to many.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἰσχύνης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the shame",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which was very great in connection with the cross. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταφρονήσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "despising",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") although it was a source of pain and grief: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν δεξιᾷ τε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and at the right hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") after He was made perfect. At that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Right hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "glory. Joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cross",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are opposed to each other, and so also are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ignominy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“the shame”) and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sitting at the right hand of the throne of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " GOD.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Looking unto the Author and Finisher of our faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Leader",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Captain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Perfecter of the faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of faith - faith's",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Captain and Completer), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus; who for the joy that was set before him endured the cross, despising shame, and is set down at the right hand of the throne of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The idea is not, as implied in the A.V. and understood by Chrysostom and other ancients, that Jesus first inspires and then brings to its complete result the individual Christian's faith (\"quod caepit in nobis consummabit\"), but (as implied in the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀρχηγὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and suiting the context better) that he is the Leader of the whole army of faith, whose standard we are to follow, and whoso own completed victory is the enabling cause as well as the earnest of our own. It is no valid objection to this view that he could not have been a Leader in this sense to the faithful ones before his coming, referred to in the last chapter; for, as has been before observed (see on \"the reproach of Christ,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he is regarded as the Head and Leader, in all ages, of the faithful; and in virtue of his future warfare for mankind the saints of old endured and triumphed: - and certainly Christians, to whom the exhortation is addressed, may look to him in an obvious sense as their Captain to be followed. Nor, again, is there difficulty - apart from that of the whole mystery of the Incarnation - in his being presented to us as himself an example of triumphant faith. For he is elsewhere spoken of as having so \"emptied himself\" of his Divine glory as to have become like unto us in all things, sin except; and thus to have been sustained during his human life by faith in the unseen, as we are. His addresses to the Father (see especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) are strikingly significant in this regard. The expression, \"for the joy,\" etc. (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀντὶ τῆς προκειμένης αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χαρᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), does not mean, as some take it, \"instead ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the joy which he might have had on earth\" (such e.g. as was offered to him by the tempter), but, as is evident from the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "προκειμένης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"as set against, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the sake of, future joy\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀντὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "βρώσεως μιᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ver. 16). Such looking forward to joy with the Father and the redeemed after triumph is expressed in the great intercessory prayer-above referred to (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:5, 13, 22, 23, 24, 26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It may be here observed that anticipation of reward hereafter is among legitimate human motives to a good life. It may be said, indeed, that the highest virtue consists in doing what is right simply because it is right - in fulfilling God's will, whatever may come of it to ourselves; but the hope of a final happy issue comes properly, and indeed inevitably, in as an inspiring and sustaining motive. Aspiration after Happiness is a God-given instinct of humanity, necessary for keeping up the life of virtue. There may be some so in love with virtue as to be capable of persevering in lifelong self-denial, though without any faith in a life to come. But human nature in general certainly requires this further incentive, and Christian faith supplies it. Nor are those who thus work with a view to future joy to be accused of selfish motives, as though they balanced only a greater against a smaller gain. To the true Christian the grand inspiring principle is still the love of God and of his neighbor, and of goodness for its own sake, though the hope of an eternal reward supports and cheers him mightily. Nor, again, is the joy looked forward to a selfish joy. It is the joy of sharing in the triumph of eternal righteousness in company with all the redeemed, whose salvation, no less than his own, he desires and strives for. And, further, with regard to his own individual joy, what is it but the joy of attaining the end of his being, the perfection God meant him for, and to which it is his duty to aspire? Hence Christ would not have been a perfect Example to man had he not been represented as looking forward to \"the joy that was set before him.\" Hebrews 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Looking (ἀφορῶντες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only here and Philippians 2:28. In lxx see 4 Macc. 17:10. Looking away from everything which may distract. Comp. Philippians 3:13, Philippians 3:14, and ἀπέβλεπεν he had respect, lit. looked away, Hebrews 11:26. Wetstein cites Arrian, Epictet. ii. 19, 29: εἰς τὸν Θεὸν ἀφορῶντες ἐν παντὶ μικρῷ καὶ μεγάλῳ looking away unto God in everything small and great.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In lxx see 4 Macc. 17:10. Looking away from everything which may distract. Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ἀπέβλεπεν he had respect, lit. looked away, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Wetstein cites Arrian, Epictet. ii. 19, 29: εἰς τὸν Θεὸν ἀφορῶντες ἐν παντὶ μικρῷ καὶ μεγάλῳ looking away unto God in everything small and great.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Having presented a long catalogue of witnesses under the old covenant, he now presents Jesus, the mediator of the new covenant, and the supreme witness. See Revelation 1:5; Revelation 3:14; 1 Timothy 6:13.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Having presented a long catalogue of witnesses under the old covenant, he now presents Jesus, the mediator of the new covenant, and the supreme witness. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The author and finisher of our faith (τὸν τῆς πίστεως ἀρχηγὸν καὶ τελειωτὴν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The A.V. is misleading, and narrows the scope of the passage. For author, rend. leader or captain, and see on Hebrews 2:10. For finisher, rend. perfecter. For our faith, rend. faith or the faith. Not our Christian faith, but faith absolutely, as exhibited in the whole range of believers from Abel to Christ. Christ cannot be called the author or originator of faith, since the faith here treated existed and worked before Christ. Christ is the leader or captain of faith, in that he is the perfecter of faith. In himself he furnished the perfect development, the supreme example of faith, and in virtue of this he is the leader of the whole believing host in all time. Notice the recurrence of the favorite idea of perfecting. Comp. Hebrews 2:10; Hebrews 5:9; Hebrews 6:1; Hebrews 7:11, Hebrews 7:19, Hebrews 7:28; Hebrews 9:9; Hebrews 10:1, Hebrews 10:14; Hebrews 11:40. Τελειωτής perfecter, N.T.o, olxx, oClass.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The A.V. is misleading, and narrows the scope of the passage. For author, rend. leader or captain, and see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For finisher, rend. perfecter. For our faith, rend. faith or the faith. Not our Christian faith, but faith absolutely, as exhibited in the whole range of believers from Abel to Christ. Christ cannot be called the author or originator of faith, since the faith here treated existed and worked before Christ. Christ is the leader or captain of faith, in that he is the perfecter of faith. In himself he furnished the perfect development, the supreme example of faith, and in virtue of this he is the leader of the whole believing host in all time. Notice the recurrence of the favorite idea of perfecting. Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Τελειωτής perfecter, N.T.o, olxx, oClass.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For the joy that was set before him (ἀντὶ τῆς προκειμένης αὐτῷ χαρᾶς)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ἁντὶ in its usual sense, in exchange for. Προκειμένης lying before, present. The joy was the full, divine beatitude of his preincarnate life in the bosom of the Father; the glory which he had with God before the world was. In exchange for this he accepted the cross and the blame. The contrast is designed between the struggle which, for the present, is alone set before the readers (Hebrews 12:1), and the joy which was already present to Christ. The heroic character of his faith appears in his renouncing a joy already in possession in exchange for shame and death. The passage thus falls in with Philippians 2:6-8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ἁντὶ in its usual sense, in exchange for. Προκειμένης lying before, present. The joy was the full, divine beatitude of his preincarnate life in the bosom of the Father; the glory which he had with God before the world was. In exchange for this he accepted the cross and the blame. The contrast is designed between the struggle which, for the present, is alone set before the readers (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the joy which was already present to Christ. The heroic character of his faith appears in his renouncing a joy already in possession in exchange for shame and death. The passage thus falls in with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The cross (σταυρὸν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Comp. Philippians 2:8. olxx. Originally an upright stake or pale. Σταυροῦν to drive down a stake; to crucify. Comp. the use of ξύλον wood or tree for the cross, Acts 5:30; Acts 10:39; 1 Peter 2:24. See on Luke 23:31.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". olxx. Originally an upright stake or pale. Σταυροῦν to drive down a stake; to crucify. Comp. the use of ξύλον wood or tree for the cross, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 5:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The shame (αἰσχύνης)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Attendant upon a malefactor's death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Is set down, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See Hebrews 1:3, Hebrews 1:13; Hebrews 8:1; Hebrews 10:12. Notice the tenses: endured, aorist, completed: hath sat down, perfect, he remains seated and reigning. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Notice the tenses: endured, aorist, completed: hath sat down, perfect, he remains seated and reigning. ",
            "children": []
          }
        ]
      }
    ]
  }
]