[[],[],[{"type":"prose","content":"My dear congregation, I, your pastor, love you in very truth. And I’m not alone—everyone who knows the Truth that has taken up permanent residence in us loves you."}],[{"type":"prose","content":"Let grace, mercy, and peace be with us in truth and love from God the Father and from Jesus Christ, Son of the Father!"}],[{"type":"prose","content":"I can’t tell you how happy I am to learn that many members of your congregation are diligent in living out the Truth, exactly as commanded by the Father. But permit me a reminder, friends, and this is not a new commandment but simply a repetition of our original and basic charter: that we love each other. Love means following his commandments, and his unifying commandment is that you conduct your lives in love. This is the first thing you heard, and nothing has changed."}],[{"type":"header","content":"Don’t Walk Out on God"},{"type":"prose","content":"There are a lot of smooth-talking con artists loose in the world who refuse to believe that Jesus Christ was truly human, a flesh-and-blood human being. Give them their true title: Deceiver! Antichrist!"}],[{"type":"prose","content":"And be very careful around them so you don’t lose out on what we’ve worked so diligently in together; I want you to get every reward you have coming to you. Anyone who gets so progressive in his thinking that he walks out on the teaching of Christ, walks out on God. But whoever stays with the teaching, stays faithful to both the Father and the Son."}],[{"type":"prose","content":"If anyone shows up who doesn’t hold to this teaching, don’t invite him in and give him the run of the place. That would just give him a platform to perpetuate his evil ways, making you his partner."}],[{"type":"prose","content":"I have a lot more things to tell you, but I’d rather not use paper and ink. I hope to be there soon in person and have a heart-to-heart talk. That will be far more satisfying to both you and me. Everyone here in your sister congregation sends greetings."}]]