[{"num":1,"verse":"And Paul, having looked-intently at the Sanhedrin, said, “Men, brothers, I have conducted-myself  with all good conscience before God up to this day”. "},{"num":2,"verse":"And the high priest Ananias commanded the ones standing near him to strike his mouth. "},{"num":3,"verse":"Then Paul said to him, “God is going to strike you— whitewashed wall! Do You indeed sit there judging me according to the Law, and violating-the-Law, order that I be struck?” "},{"num":4,"verse":"And the ones standing near said, “Are you reviling the high priest of God?” "},{"num":5,"verse":"And Paul said, “I did not know, brothers, that he was high priest. For it has been written [in Ex 22:28] that ‘You shall not speak badly of a ruler of your people’”."},{"header":"Paul Divides The Assembly Over The Question of The Resurrection"},{"num":6,"verse":"And Paul, having known that the one part of them was of Sadducees and the other of Pharisees, was crying-out in the Sanhedrin, “Men, brothers, I am a Pharisee, a son of Pharisees. I am being judged concerning the hope and resurrection of the dead”. "},{"num":7,"verse":"And he having said this, a dispute between the Pharisees and Sadducees took place, and the assembly was divided. "},{"num":8,"verse":"For Sadducees say that there is not a resurrection, nor an angel, nor a spirit— but Pharisees confess all three. "},{"num":9,"verse":"And a great clamor took place. And having stood up, some of the scribes of the Pharisees’ part were battling, saying, “We are finding no evil in this man. And what if a spirit did speak to him, or an angel?”"},{"header":"The Romans Take Paul Away"},{"num":10,"verse":"And while a great dispute was taking place, the commander— having feared that Paul might be torn-to-pieces by them— ordered the troop, having gone down, to snatch him out of the midst of them and bring him to the barracks."},{"header":"That Night The Lord Appears To Paul And Says He Will Also Testify In Rome"},{"num":11,"verse":"And on the following night, the Lord, having stood near him, said, “Take-courage. For as you solemnly-testified in Jerusalem as to the things concerning Me, so you must also testify in Rome”."},{"header":"The Next Day, Over 40 Jews Swear an Oath To Kill Paul, And Hatch a Plot"},{"num":12,"verse":"And having become day, the Jews, having held a gathering, bound themselves under-a-curse, saying that they would neither eat nor drink until which time they killed Paul. "},{"num":13,"verse":"Now there were more than forty having made this sworn-pact— "},{"num":14,"verse":"who, having gone to the chief priests and the elders, said, “With a curse, we bound ourselves under-a-curse to eat nothing until which time we kill Paul. "},{"num":15,"verse":"Now therefore, you, along with the Sanhedrin, notify the commander so that he may bring him down to you, as-though you are intending to determine the things concerning him more accurately. And we are prepared that we might kill him before he draws-near”."},{"header":"Paul’s Nephew Hears of The Plot, And Informs The Roman Commander"},{"num":16,"verse":"But the son of the sister of Paul— having heard-of the ambush, having come and entered into the barracks— reported it to Paul. "},{"num":17,"verse":"And Paul, having summoned one of the centurions, said, “Lead this young-man away to the commander, for he has something to report to him”. "},{"num":18,"verse":"So indeed the one, having taken him along, led him to the commander. And he says, “Paul the prisoner, having summoned me, asked that I lead this young man to you— he having something to tell you”. "},{"num":19,"verse":"And the commander— having taken-hold-of his hand, and having withdrawn privately— was asking, “What is it that you have to report to me?” "},{"num":20,"verse":"And he said that “The Jews agreed to ask you so that tomorrow you might bring Paul down to the Sanhedrin, as-though intending to inquire something more accurately concerning him. "},{"num":21,"verse":"So don’t you be persuaded by them. For more than forty men from-among them are lying-in-wait-for him who bound themselves under-a-curse neither to eat nor drink until which time they kill him. And now they are prepared, waiting-for the promise from you”."},{"header":"The Roman Commander Makes Arrangements To Send Paul To Caesarea"},{"num":22,"verse":"Then indeed the commander sent away the young-man, having commanded him to tell no one “that you revealed these things to me”. "},{"num":23,"verse":"And having summoned a certain two of the centurions, he said, “Prepare two-hundred soldiers and seventy horsemen and two-hundred spearmen so that they may proceed to Caesarea at the third hour of the night”; "},{"num":24,"verse":"and that they should provide mounts in order that having put-on Paul, they might bring him safely through to Felix the governor, "},{"num":25,"verse":"he having written a letter having this form:"},{"num":26,"verse":"“Claudius Lysias, to the most-excellent governor Felix: Greetings. "},{"num":27,"verse":"I rescued this man having been seized by the Jews and being about to be killed by them, having come-suddenly-upon them with the troop— having learned that he was a Roman. "},{"num":28,"verse":"And wanting to know the reason for which they were accusing him, I brought him down to their Sanhedrin— "},{"num":29,"verse":"whom I found being accused about issues of their Law, but having no accusation worthy of death or imprisonment. "},{"num":30,"verse":"And a plot having been disclosed to me that would be against the man, I sent him to you at once, having also ordered his accusers to speak the things against him before you”."},{"header":"Roman Soldiers Take Paul To Caesarea, Where He Awaits The Arrival of His Accusers"},{"num":31,"verse":"So indeed the soldiers, in accordance with the thing having been commanded them, having picked-up Paul, brought him during the night to Antipatris. "},{"num":32,"verse":"And on the next day, they returned to the barracks, having let the horsemen depart with him— "},{"num":33,"verse":"who, having entered into Caesarea, and having delivered the letter to the governor, presented Paul to him also. "},{"num":34,"verse":"And having read it, and having asked from what province he was, and having learned that he was from Cilicia, "},{"num":35,"verse":"he said, “I will give you a hearing whenever your accusers also arrive”— having ordered that he be guarded in the Praetorium of Herod."}]