[{"num":23,"verse":"Gazing intently at the Council, Paul began:"},{"num":2,"verse":"Instantly Ananias the High Priest commanded those close to Paul to slap him on the mouth."},{"num":3,"verse":"Paul said to him, “God shall slap you, you whitewashed pigpen. What kind of judge are you to break the law yourself by ordering me struck like that?”"},{"num":4,"verse":"Those standing near Paul said to him, “Is that the way to talk to God’s High Priest?”"},{"num":5,"verse":"“I didn’t realize he was the High Priest, brothers,” Paul replied, “for the Scriptures say, ‘Never speak evil of any of your rulers.’”"},{"num":6,"verse":"Then Paul thought of something! Part of the Council were Sadducees, and part were Pharisees! So he shouted, “Brothers, I am a Pharisee, as were all my ancestors! And I am being tried here today because I believe in the resurrection of the dead!”"},{"num":7,"verse":"This divided the Council right down the middle—the Pharisees against the Sadducees—"},{"num":8,"verse":"for the Sadducees say there is no resurrection or angels or even eternal spirit within us, but the Pharisees believe in all of these."},{"num":9,"verse":"So a great clamor arose. Some of the Jewish leaders jumped up to argue that Paul was all right. “We see nothing wrong with him,” they shouted. “Perhaps a spirit or angel spoke to him there on the Damascus road.*”"},{"num":10,"verse":"The shouting grew louder and louder, and the men were tugging at Paul from both sides, pulling him this way and that. Finally the commander, fearing they would tear him apart, ordered his soldiers to take him away from them by force and bring him back to the armory."},{"num":11,"verse":"That night the Lord stood beside Paul and said, “Don’t worry, Paul; just as you have told the people about me here in Jerusalem, so you must also in Rome.”"},{"num":12,"verse":"The next morning some forty or more of the Jews got together and bound themselves by a curse neither to eat nor drink until they had killed Paul! "},{"num":14,"verse":"Then they went to the chief priests and elders and told them what they had done. "},{"num":15,"verse":"“Ask the commander to bring Paul back to the Council again,” they requested. “Pretend you want to ask a few more questions. We will kill him on the way.”"},{"num":16,"verse":"But Paul’s nephew got wind of their plan and came to the armory and told Paul."},{"num":17,"verse":"Paul called one of the officers and said, “Take this boy to the commander. He has something important to tell him.”"},{"num":18,"verse":"So the officer did, explaining, “Paul, the prisoner, called me over and asked me to bring this young man to you to tell you something.”"},{"num":19,"verse":"The commander took the boy by the hand, and leading him aside asked, “What is it you want to tell me, lad?”"},{"num":20,"verse":"“Tomorrow,” he told him, “the Jews are going to ask you to bring Paul before the Council again, pretending they want to get some more information. "},{"num":21,"verse":"But don’t do it! There are more than forty men hiding along the road ready to jump him and kill him. They have bound themselves under a curse to neither eat nor drink till he is dead. They are out there now, expecting you to agree to their request.”"},{"num":22,"verse":"“Don’t let a soul know you told me this,” the commander warned the boy as he left. "},{"num":23,"verse":"Then the commander called two of his officers and ordered, “Get 200 soldiers ready to leave for Caesarea at nine o’clock tonight! Take 200 spearmen and 70 mounted cavalry. Give Paul a horse to ride and get him safely to Governor Felix.”"},{"num":25,"verse":"Then he wrote this letter to the governor:"},{"num":26,"verse":"“From: Claudius Lysias"},{"num":27,"verse":"“This man was seized by the Jews, and they were killing him when I sent the soldiers to rescue him, for I learned that he was a Roman citizen. "},{"num":28,"verse":"Then I took him to their Council to try to find out what he had done. "},{"num":29,"verse":"I soon discovered it was something about their Jewish beliefs, certainly nothing worthy of imprisonment or death. "},{"num":30,"verse":"But when I was informed of a plot to kill him, I decided to send him on to you and will tell his accusers to bring their charges before you.”"},{"num":31,"verse":"So that night, as ordered, the soldiers took Paul to Antipatris. "},{"num":32,"verse":"They returned to the armory the next morning, leaving him with the cavalry to take him on to Caesarea."},{"num":33,"verse":"When they arrived in Caesarea, they presented Paul and the letter to the governor. "},{"num":34,"verse":"He read it and then asked Paul where he was from."},{"num":35,"verse":"“I will hear your case fully when your accusers arrive,” the governor told him, and ordered him kept in the prison at King Herod’s palace."}]