[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beginning of his kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Nimrod’s empire began with the cities enumerated in this verse, and thence extended into Assyria, as is mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". First, then, he established his sovereignty “in the land of Shinar: “that is, in Babylonia, the lower portion of Mesopotamia, as distinguished from Assyria, the upper portion. It is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sumir ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the cuneiform inscriptions. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Babylonia is called “the land of Nimrod.” His cities there were four.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Babel.—That is, Bab-ili, “the gate of God,” the literal translation in Assyrian of its previous Accadian name, Ca-dimirra (Chald. Gen., p. 168). In Genesis 11:9 the word is derisively derived from a Hebrew root meaning confusion, because of the confusion of tongues there.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Babel.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—That is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Bab-ili, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "“the gate of God,” the literal translation in Assyrian of its previous Accadian name, Ca-dimirra (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Chald. Gen., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 168). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the word is derisively derived from a Hebrew root meaning ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "confusion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "because of the confusion of tongues there.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Erech.—“At the time of the opening of the Izdubar legends, the great city of the south of Babylonia was Urak, called in Genesis Erech” (Chald. Gen., p. 192). It was ravaged by Kudur-nankhunte, king of Elam, in the year B.C. 2280, according to an inscription of Assurbanipal (B.C. 670). It lies about thirty leagues to the south-east of Babylon, and is now called Warka. From the numerous mounds and remains of coffins discovered there, it is supposed to have been the early burial-place of the Assyrian kings. (See also Rawlin-son’s Ancient Monarchies, 1, pp. 18, 156.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Erech.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—“At the time of the opening of the Izdubar legends, the great city of the south of Babylonia was Urak, called in Genesis Erech” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Chald. Gen., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 192). It was ravaged by Kudur-nankhunte, king of Elam, in the year B.C. 2280, according to an inscription of Assurbanipal (B.C. 670). It lies about thirty leagues to the south-east of Babylon, and is now called Warka. From the numerous mounds and remains of coffins discovered there, it is supposed to have been the early burial-place of the Assyrian kings. (See also Rawlin-son’s ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ancient Monarchies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1, pp. 18, 156.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Accad.—This name, which was meaningless fifty years ago, is now a household word in the mouth of Assyriologers; for in deciphering the cuneiform literature it was found that many of the works, especially in the library of Sargon, were translations from an extinct language; and as these were deciphered it gradually became evident that before any inhabitants of the Semitic stock had entered Chaldea it had been peopled by the Accadians, a black race, who had been “the builders of its cities, the inventors of the cuneiform system of writing, and the founders of the culture and civilisation afterwards borrowed by the Semites” (Chald. Gen., p. 19). This Sargon, who was king of Agané, in Babylonia, about B.C. 1800. is of course a different person from the Ninevite Sargon mentioned in Isaiah 20:1, who also was the founder of a noble library about B.C. 721; and as the Accadian language was already in his days passing away, this earlier or Babylonian Sargon caused translations to be made, especially of those works in which the Accadians had recorded their astronomical and astrological observations, and placed them in his library at Agané. Previously also “Semitic translations of Accadian works had been made for the library of Erech, one of the earliest seats of Semitic power” (Ibid, p. 21). Mr. Sayce places the conquest of Shinar by the Semites at some period two or three thousand years before the Christian era, and thus the founding of these cities and the empire of the Accadians goes back to a still more remote date, especially as the struggle between them and their conquerors was a very prolonged one (Ibid, p. 20).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Accad.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This name, which was meaningless fifty years ago, is now a household word in the mouth of Assyriologers; for in deciphering the cuneiform literature it was found that many of the works, especially in the library of Sargon, were translations from an extinct language; and as these were deciphered it gradually became evident that before any inhabitants of the Semitic stock had entered Chaldea it had been peopled by the Accadians, a black race, who had been “the builders of its cities, the inventors of the cuneiform system of writing, and the founders of the culture and civilisation afterwards borrowed by the Semites” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Chald. Gen., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 19). This Sargon, who was king of Agané, in Babylonia, about B.C. 1800. is of course a different person from the Ninevite Sargon mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who also was the founder of a noble library about B.C. 721; and as the Accadian language was already in his days passing away, this earlier or Babylonian Sargon caused translations to be made, especially of those works in which the Accadians had recorded their astronomical and astrological observations, and placed them in his library at Agané. Previously also “Semitic translations of Accadian works had been made for the library of Erech, one of the earliest seats of Semitic power” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ibid, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 21). Mr. Sayce places the conquest of Shinar by the Semites at some period two or three thousand years before the Christian era, and thus the founding of these cities and the empire of the Accadians goes back to a still more remote date, especially as the struggle between them and their conquerors was a very prolonged one (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ibid, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 20).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Calneh.—The Caino of Isaiah 10:9, where the LXX. read, “Have I not taken the region above Babylon and Khalanné, where the tower was built?” It was thus opposite Babylon, and the site of the tower of Babel (see Chald. Gen., p. 75, and Note on Genesis 11:9). The other place suggested, Ctesiphon, is not in Shinar, but in Assyria.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Calneh.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Caino of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the LXX. read, “Have I not taken the region above Babylon and Khalanné, where the tower was built?” It was thus opposite Babylon, and the site of the tower of Babel (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Chald. Gen., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 75, and Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The other place suggested, Ctesiphon, is not in Shinar, but in Assyria.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 10:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beginning of his kingdom was Babel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Some way or other, he got into power; and so laid the foundation of a monarchy which was afterward a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "head of gold. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It does not appear that he had any right to rule by birth; but either his fitness for government recommended him, or by power and policy he gradually advanced himself to a throne. See the antiquity of civil government, and particularly of that form of it which lodges the sovereignty in a single person.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:8-14 Nimrod was a great man in his day; he began to be mighty in the earth, Those before him were content to be upon the same level with their neighbours, and though every man bare rule in his own house, yet no man pretended any further. Nimrod was resolved to lord it over his neighbours. The spirit of the giants before the flood, who became mighty men, and men of renown, Ge 6:4, revived in him. Nimrod was a great hunter. Hunting then was the method of preventing the hurtful increase of wild beasts. This required great courage and address, and thus gave an opportunity for Nimrod to command others, and gradually attached a number of men to one leader. From such a beginning, it is likely, that Nimrod began to rule, and to force others to submit. He invaded his neighbours' rights and properties, and persecuted innocent men; endeavouring to make all his own by force and violence. He carried on his oppressions and violence in defiance of God himself. Nimrod was a great ruler. Some way or other, by arts or arms, he got into power, and so founded a monarchy, which was the terror of the mighty, and bid fair to rule all the world. Nimrod was a great builder. Observe in Nimrod the nature of ambition. It is boundless; much would have more, and still cries, Give, give. It is restless; Nimrod, when he had four cities under his command, could not be content till he had four more. It is expensive; Nimrod will rather be at the charge of rearing cities, than not have the honour of ruling them. It is daring, and will stick at nothing. Nimrod's name signifies rebellion; tyrants to men are rebels to God. The days are coming, when conquerors will no longer be spoken of with praise, as in man's partial histories, but be branded with infamy, as in the impartial records of the Bible.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning or first seat and the extent of his kingdom among men are then described. It consists of four towns - Babel and Erek and Akkad and Kalneh, in the land of Shinar. The number four is characteristic of Nimrod's kingdom. It is the mark of the four quarters of the earth, of universality in point of extent, and therefore of ambition. The site of Babel (Babylon) has been discovered in certain ruins near Hillah, chiefly on the opposite or eastern bank of the Euphrates, where there is a square mound called Babil by the natives. Erek has been traced also on the east bank of the Euphrates, about one hundred miles southeast of Babil, or half way between the city and the confluence of the rivers. It is the Orchoe of the Greeks, and the ruins now bear the name of Urka, or Warka. This name appears as Huruk on the cuneiform inscriptions of the place. Akkad, in the Septuagint. Archad, Col. Taylor finds in Akkerkoof, north of Babel, and about nine miles west of the Tigris, where it approaches the Euphrates. Here there is a hill or mound of ruins called Tel Nimrud. Rawlinson finds the name Akkad frequent in the inscriptions, and mentions Kingi Akkad as part of the kingdom of Urukh, but without identifying the site. Kalneh, Kalno, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Kanneh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is regarded by Jerome, and the Targum of Jonathan, as the same with Ktesiphon on the Tigris, in the district of Chalonitis. Its ruins are near Takti Kesra. Rawlinson identifies it with Niffer, but without assigning satisfactory grounds. The sites of these towns fix that of Shinar, which is evidently the lower part of Mesopotamia, or, more precisely, the country west of the Tigris, and south of Is, or Hit, on the Euphrates, and Samara on the Tigris. It is otherwise called Babylonia and Chaldaea.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. the beginning of his kingdom—This kingdom, of course, though then considered great, would be comparatively limited in extent, and the towns but small forts.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beginning of his kingdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. either his chief and royal city, or the place where his dominion began, and from whence it was extended to other parts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Babel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which being not built till the confusion of languages, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 11:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", showeth that this, though here mentioned upon occasion of the genealogy, was not executed till afterward; it being very usual in Scripture to neglect the order of time in historical relations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Calneh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Calno, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 10:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Canneh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ezekiel 27:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and as it is here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cabneh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Amos 6:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 6:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; where it is mentioned amongst the eminent cities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The land of Shinar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in Mesopotamia. This clause belongs to all the cities here named; and is added for distinction sake, because there is a Babylon in the land of Egypt, and there might be other cities of the same name with the rest in other countries. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the beginning of his kingdom was Babel,.... The city of Babel, or Babylon, which was built by his direction; for though Babylon is by some writers said to be built by Semiramis, the wife of Ninus, and others by Ninus himself, yet the truest account is, that it was built by Belus, the same with Nimrod. Curtius (t) says, Semiramis built it; or, as most believe, adds he, Belus, whose royal palace is shown: and Berosus (u), the Chaldean, blames the Greek writers for ascribing it to Semiramis; and Abydenus (w), out of Megasthenes, affirms, that Belus surrounded Babylon with a wall: however, this was the head of the kingdom of Nimrod, as Onkelos renders it, or his chief city, or where he first began to reign. Here he set up his kingdom, which he enlarged and extended afterwards to other places; and from hence it appears, that what is related in this context, concerning Nimrod, is by way of anticipation; for it was not a fact that he was a mighty man, or a powerful prince possessed of a kingdom, until after the building of Babel, and the confusion of languages there; when those that continued on the spot either chose him for their ruler, or he, by power or policy, got the dominion over them. Artapanus (x), an Heathen writer, relates, that the giants which inhabited Babylon being taken away by the gods for their impiety, one of them, Belus, escaped death and dwelt in Babylon, and took up his abode in the tower which he had raised up, and which, from him the founder of it, was called Belus; so that this, as Moses says, was the beginning of his kingdom, together with ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Erech, and Accad, and Calneh in the land of Shinar, where the city and tower of Babel were built: for of these four cities, which were all in the same country, did the kingdom of Nimrod consist; they all, either by force or by consent, were brought into subjection to him, and were under one form of government, and is the first kingdom known to be set up in the world. Erech, according to the Targums of Jonathan and Jerusalem, is Hades, or Edessa, a city in Mesopotamia; but it is rather thought to be the name with the Aracca of Ptolemy (y), and the Arecha of Marcellinus (z), placed by them both in Susiana; though one would think it should be that city in Chaldea which took its present Arabic name of Erak from Erech: the Arabic writers say (a), when Irac or Erac is absolutely put, it denotes Babylonia, or Chaldea, in the land of Shinar; and they say that Shinar is in Al-Erac. The next city, Accad, according to the Targums of Jonathan and Jerusalem, is Netzibin, or Nisibis, a city in Mesopotamia; in the Septuagint version it is called Archad; and Ctesias (b) relates, that at the Persian Sittace was a river called Argad, which Bochart (c) thinks carries in it a manifest trace of this name; and observes, from Strabo (d), that that part of Babylon nearest to Susa was called Sitacena. And the other city, Calneh, according to the above Targums, is Ctesiphon, and is generally thought to be the place intended, and was a town upon the Tigris, near to Seleucia in Babylon; it was first called Chalone, and its name was changed to Ctesiphon by Pacorus, king of the Persians. It is in Isaiah 10:9 called Calno, and by the Septuagint version there the Chalane, which adds,\"where the tower was built;''and from whence the country called the Chalonitis by Pliny (e) had its name, the chief city of which was Ctesiphon; and who says (f) Chalonitis is joined with Ctesiphon. Thus far goes the account of Nimrod; and, though no mention is made of his death, yet some writers are not silent about it. Abulpharagius (g), an Arabic writer, says he died in the tower of Babel, it being blown down by stormy winds; the Jewish writers say (h) he was killed by Esau for the sake of his coat, which was Adam's, and came to Noah, and from him to Ham, and so to Nimrod. When he began his reign, and how long he reigned, is not certain; we have only some fabulous accounts: according to Berosus (i), he began to reign one hundred and thirty one years after the flood, and reigned fifty six years, and then disappeared, being translated by the gods: and, indeed, the authors of the Universal History place the beginning of his reign in the year of the flood one hundred and thirty one, and thirty years after the dispersion at Babylon (k); and who relate, that the eastern writers speak of his reign as very long: a Persian writer gives his name a Persian derivation, as if it was Nemurd, that is, \"immortal\", on account of his long reign of above one hundred and fifty years: and some of the Mahometan historians say he reigned in Al-Sowad, that is, the \"black country\", four hundred years (l). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Erech, and Accad, and Calneh in the land of Shinar, where the city and tower of Babel were built: for of these four cities, which were all in the same country, did the kingdom of Nimrod consist; they all, either by force or by consent, were brought into subjection to him, and were under one form of government, and is the first kingdom known to be set up in the world. Erech, according to the Targums of Jonathan and Jerusalem, is Hades, or Edessa, a city in Mesopotamia; but it is rather thought to be the name with the Aracca of Ptolemy (y), and the Arecha of Marcellinus (z), placed by them both in Susiana; though one would think it should be that city in Chaldea which took its present Arabic name of Erak from Erech: the Arabic writers say (a), when Irac or Erac is absolutely put, it denotes Babylonia, or Chaldea, in the land of Shinar; and they say that Shinar is in Al-Erac. The next city, Accad, according to the Targums of Jonathan and Jerusalem, is Netzibin, or Nisibis, a city in Mesopotamia; in the Septuagint version it is called Archad; and Ctesias (b) relates, that at the Persian Sittace was a river called Argad, which Bochart (c) thinks carries in it a manifest trace of this name; and observes, from Strabo (d), that that part of Babylon nearest to Susa was called Sitacena. And the other city, Calneh, according to the above Targums, is Ctesiphon, and is generally thought to be the place intended, and was a town upon the Tigris, near to Seleucia in Babylon; it was first called Chalone, and its name was changed to Ctesiphon by Pacorus, king of the Persians. It is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " called Calno, and by the Septuagint version there the Chalane, which adds,\"where the tower was built;''and from whence the country called the Chalonitis by Pliny (e) had its name, the chief city of which was Ctesiphon; and who says (f) Chalonitis is joined with Ctesiphon. Thus far goes the account of Nimrod; and, though no mention is made of his death, yet some writers are not silent about it. Abulpharagius (g), an Arabic writer, says he died in the tower of Babel, it being blown down by stormy winds; the Jewish writers say (h) he was killed by Esau for the sake of his coat, which was Adam's, and came to Noah, and from him to Ham, and so to Nimrod. When he began his reign, and how long he reigned, is not certain; we have only some fabulous accounts: according to Berosus (i), he began to reign one hundred and thirty one years after the flood, and reigned fifty six years, and then disappeared, being translated by the gods: and, indeed, the authors of the Universal History place the beginning of his reign in the year of the flood one hundred and thirty one, and thirty years after the dispersion at Babylon (k); and who relate, that the eastern writers speak of his reign as very long: a Persian writer gives his name a Persian derivation, as if it was Nemurd, that is, \"immortal\", on account of his long reign of above one hundred and fifty years: and some of the Mahometan historians say he reigned in Al-Sowad, that is, the \"black country\", four hundred years (l). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Hist. l. 5. c. 1.((u) Apud Joseph. contra Apion. l. 1. c. 20. (w) Apud. Euseb. Evangel. Praepar. l. 9. c. 41. p. 457. (x) Apud. Euseb. Evangel. Praepar. l. 9. c. 18. p. 420. (y) Geograph. l. 6. c. 3.((z) Lib. 23. (a) Vid. Hyde in notis ad Peritsol. Itinera Mundi, p. 65. (b) Apud Aelian. Hist. Animal. l. 16. c. 42. (c) Phaleg. l. 4. c. 17. (d) Geograph. l. 15. p. 503. (e) Nat. Hist. l. 6. c. 26. (f) Ibid. c. 27. (g) Hist. Dynast. p. 12. (h) In Pirke Eliezer, c. 24. (i) Antiqu. l. 4. p. 28, 29. (k) Vol. 1. p. 282. and vol. 21. p. 2.((l) Apud Hyde's Hist. Relig. Pers. c. 2. p. 43. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Hist. l. 5. c. 1.((u) Apud Joseph. contra Apion. l. 1. c. 20. (w) Apud. Euseb. Evangel. Praepar. l. 9. c. 41. p. 457. (x) Apud. Euseb. Evangel. Praepar. l. 9. c. 18. p. 420. (y) Geograph. l. 6. c. 3.((z) Lib. 23. (a) Vid. Hyde in notis ad Peritsol. Itinera Mundi, p. 65. (b) Apud Aelian. Hist. Animal. l. 16. c. 42. (c) Phaleg. l. 4. c. 17. (d) Geograph. l. 15. p. 503. (e) Nat. Hist. l. 6. c. 26. (f) Ibid. c. 27. (g) Hist. Dynast. p. 12. (h) In Pirke Eliezer, c. 24. (i) Antiqu. l. 4. p. 28, 29. (k) Vol. 1. p. 282. and vol. 21. p. 2.((l) Apud Hyde's Hist. Relig. Pers. c. 2. p. 43. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the beginning of his kingdom was Babel, and Erech, and Accad, and Calneh, in the land of {g} Shinar.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the beginning of his kingdom was Babel, and Erech, and Accad, and Calneh, in the land of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Shinar.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) For there was another city in Egypt, called Babel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the beginning of his kingdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Nimrod is represented, not as the founder of the Babylonian cities, but as their king. His four cities are enumerated:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Babel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. Babylon, as the Hebrew is rendered in the Greek: Assyrian ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Babilu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", possibly = “the gate of God.” This was the capital of the Babylonian empire from the time of Hammurabi who founded that empire, circ. 2130 b.c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Erech",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Uruk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the inscriptions. LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὀρέχ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the modern ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Warka",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was the principal seat of the Babylonian deities Anu and Istar, and the scene of the exploits of the mythical hero Gilgames.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Accad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Agade",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the inscriptions, the chief town in ancient northern Babylonia, and the capital of Sargon the First, one of the earliest Babylonian kings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Calneh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of doubtful identification; not to be identified with the Syrian town Calneh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jensen conjectures that there is an error of one Hebrew letter, and that we should read for Calneh ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cullaba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an important town in Babylonia. Another conjecture is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nippur",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the land of Shinar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. in Babylonia, which comprised both northern Babylonia or Accad, and southern Babylonia or Sumer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the beginning of his kingdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either his first kingdom, as contrasted with his second (Knobel), or the commencement of his sovereignty (Keil, Kalisch), or the principal city of his empire (Rosenmüller); or all three may be legitimately embraced in the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "reshith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", only it does not necessarily imply that Nimrod ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "built",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " any of the cities mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Was Babel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Babylon, \"the land of Nimrod\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the origin of which is described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", grew to be a great city covering an area of 225 square reties, reached its highest glory under Nebuchadnezzar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and succumbed to the Medo-Persian power under Belshazzar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The remains of this great city have been discovered on the east bank of the Euphrates near Hillah, where there is a square mound called \"Babil\" by the Arabs (Rawlinson's 'Ancient Monarchies,' vol. 1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Erech",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Orchoe of Ptolemy, identified by Rawlinson as Wurka, about eighty miles south of Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Accad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἀρχάδ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX.); the city Sittace on the river Argade (Bochart); Sakada, a town planted by Ptolemy below Ninus (Clericus); Accete, north of Babylon (Knobel, Lange); identified with the ruins of Niffer, to the south of Hillah (Keil); with those of Akkerkoof, north of Hillah (Kalisch). Rawlinson does not identify the site; George Smith regards it as \"the capital of Sargon, the great city Agadi, near the city of Sippara on the Euphrates, and north of Babylon ('Assyrian Discoveries,' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Calneh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Calno (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Canneh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Ctesiphon, east of the Tigris, north-east of Babylon (Jerome, Eusebius, Bochart, Michaelis, Kalisch); identified with the ruins of Niffer on the east of the Euphrates (Rawlinson). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the land of Shinar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Babylonia, as distinguished from Assyria (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the lower part of Mesopotamia, or Chaldaea. Genesis 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And the beginning of his kingdom was Babel,\" the well-known city of Babylon on the Euphrates, which from the time of Nimrod downwards has been the symbol of the power of the world in its hostility to God; - \"and Erech\" (Ὀρέχ, lxx), one of the seats of the Cutheans (Samaritans), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", no doubt Orcho, situated, according to Rawlinson, on the site of the present ruins of Warka, thirty hours' journey to the south-east of Babel; - and Accad (Ἀρχάδ, lxx), a place not yet determined, though, judging from its situation between Erech and Calneh, it was not far from either, and Pressel is probably right in identifying it with the ruins of Niffer, to the south of Hillah; - \"and Calneh:\" this is found by early writers on the cite of Ctesiphon, now a great heap of ruins, twenty hours north-east of Babel. These four cities were in the land of Shinar, i.e., of the province of Babylon, on the Lower Euphrates and Tigris.",
        "children": []
      }
    ]
  }
]