[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Peleg; for in his days was the earth divided",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—This may refer to the breaking up of the race of Shem into separate nations, which severally occupied a distinct region; and so, while Joktan took Arabia, and in course of time expelled the Hamites from that country, Asshur, Aram, and Peleg occupied the regions on the north and north-west. But as Peleg, according to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tôldôth Shem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was born only 101 years after the flood, Noah’s family could scarcely have multiplied in so short a time to as many as 500 people; and Mr. Cyril Graham considers that the name refers to “the first cutting of some of those canals which are found in such numbers between the Tigris and the Euphrates.” This is made more probable by the fact that Peleg in Hebrew means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "water-course.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 10:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In his days the earth was divided — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, about the time of his birth it was divided among those that were to inhabit it, either when Noah made an orderly distribution of it among his descendants, as Joshua divided the land of Canaan by lot; or when, upon their refusal to comply with that division, God, in justice, divided them by the confusion of tongues.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:15-32 The posterity of Canaan were numerous, rich, and pleasantly seated; yet Canaan was under a Divine curse, and not a curse causeless. Those that are under the curse of God, may, perhaps, thrive and prosper in this world; for we cannot know love or hatred, the blessing or the curse, by what is before us, but by what is within us. The curse of God always works really, and always terribly. Perhaps it is a secret curse, a curse to the soul, and does not work so that others can see it; or a slow curse, and does not work soon; but sinners are reserved by it for a day of wrath Canaan here has a better land than either Shem or Japheth, and yet they have a better lot, for they inherit the blessing. Abram and his seed, God's covenant people, descended from Eber, and from him were called Hebrews. How much better it is to be like Eber, the father of a family of saints and honest men, than the father of a family of hunters after power, worldly wealth, or vanities. Goodness is true greatness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This nation was very extensive, and accordingly branched out into several, of which the immediate ones are Peleg and Joctan.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(56) Peleg is remarkable on account of the origin assigned to his name. \"In his days was the land divided.\" Here two questions occur. What is the meaning of the earth being divided, and what is the time denoted by \"his days?\" The verb \"divide\" (פלג  pālag) occurs only three times elsewhere in the Hebrew scriptures 1 Chronicles 1:19; Job 38:25; Psalm 55:10. The connection in which this rare word is used in the Psalm, \"divide their tongues,\" seems to determine its reference in the present passage to the confusion of tongues and consequent dispersion of mankind recorded in the following chapter. This affords a probable answer to our first question. The land was in his days divided among the representative heads of the various nations. But to what point of time are we directed by the phrase \"in his days?\" Was the land divided at his birth, or some subsequent period of his life? The latter is possible, as Jacob and Gideon received new names, and Joshua an altered name, in later life.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(56) Peleg is remarkable on account of the origin assigned to his name. \"In his days was the land divided.\" Here two questions occur. What is the meaning of the earth being divided, and what is the time denoted by \"his days?\" The verb \"divide\" (פלג  pālag) occurs only three times elsewhere in the Hebrew scriptures ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 1:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 38:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The connection in which this rare word is used in the Psalm, \"divide their tongues,\" seems to determine its reference in the present passage to the confusion of tongues and consequent dispersion of mankind recorded in the following chapter. This affords a probable answer to our first question. The land was in his days divided among the representative heads of the various nations. But to what point of time are we directed by the phrase \"in his days?\" Was the land divided at his birth, or some subsequent period of his life? The latter is possible, as Jacob and Gideon received new names, and Joshua an altered name, in later life.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The phrase \"in his days\" seems to look the same way. And the short interval from the deluge to his birth appears scarcely to suffice for such an increase of the human family as to allow of a separation into nations. Yet, on the other hand, it is hard to find any event in later life which connected this individual more than any other with the dispersion of man. It is customary to give the name at birth. The phrase \"in his days\" may, without any straining, refer to this period. And if we suppose, at a time when there were only a few families on the earth, an average increase of ten children in each in four generations, we shall have a thousand, or twelve hundred full-grown persons, and, therefore, may have five hundred families at the birth of Peleg. We cannot suppose more than fifty-five nations distinguished from one another at the dispersion, as Heber is the fifty-fifth name, and all the others are descended from him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And if three families were sufficient to propagate the race after the flood, nine or ten were enough to constitute a primeval tribe or nation. We see some reason, therefore, to take the birth of Peleg as the occasion on which he received his name, and no stringent reason for fixing upon any later date. At all events the question seems to be of no chronological importance, as in any case only four generations preceded Peleg, and these might have been of comparatively longer or shorter duration without materially affecting the number of mankind at the time of his birth. Peleg is also remarkable as the head of that nation out of which, at an after period, the special people of God sprang. Of the Palgites, as a whole, we hear little or nothing further in history.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(57) Joctan, if little or insignificant as an individual or a nation, is the progenitor of a large group of tribes, finding their place among the wandering races included afterward under the name Arabic. Cachtan, as the Arabs designate him in their traditions, may have given name to Cachtan, a town and province mentioned by Niebuhr.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(57) Joctan, if little or insignificant as an individual or a nation, is the progenitor of a large group of tribes, finding their place among the wandering races included afterward under the name Arabic. Cachtan, as the Arabs designate him in their traditions, may have given name to Cachtan, a town and province mentioned by Niebuhr.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. Peleg; for in his days was the earth divided—After the flood (Ge 11:10-16) the descendants of Noah settled at pleasure and enjoyed the produce of the undivided soil. But according to divine instruction, made probably through Eber, who seems to have been distinguished for piety or a prophetic character, the earth was divided and his son's name, \"Peleg,\" was given in memory of that event (see De 32:8; Ac 17:26).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In his days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. In the time of his birth, whence he was so called. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Afterwards in the time of life. So his father gave him this name by the Spirit of prophecy, foreseeing this great event, and the time of it; this being no unusual thing in Scripture, as we shall hereafter see, to give prophetical names to children. And thus there is a longer and more convenient space left for the peopling of the world, and ripening of things for the general dispersion and habitation of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The earth was divided, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " first in language, and then in habitations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And unto Eber were born two sons: the name of one was Peleg,.... Bochart (k) thinks, that either Peleg, or one of his posterity, in memory of him, gave the name of Phalga to a town situated on the Euphrates; though the reason of the name, as given by Arrianus, as he himself observes, was because it divided between the two Seleucias, as the reason of Peleg's name was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for in his days was the earth divided; among the three sons of Noah, and their respective posterities; their language was divided, and that obliged them to divide and separate in bodies which understood one another; hence that age, in which was this event, was usually called by the Jews the age of division; whether this was done about the time of his birth, and so this name was given him to perpetuate the memory of it, or in some after part of his life, and so was given by a spirit of prophecy, is a question: Josephus, Jarchi, and the Jewish writers, generally go the latter way; if it was at the time of his birth, which is the sense of many, then this affair happened in the one hundred and first year after the flood, for in that year Peleg was born, as appears from Genesis 11:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for in his days was the earth divided; among the three sons of Noah, and their respective posterities; their language was divided, and that obliged them to divide and separate in bodies which understood one another; hence that age, in which was this event, was usually called by the Jews the age of division; whether this was done about the time of his birth, and so this name was given him to perpetuate the memory of it, or in some after part of his life, and so was given by a spirit of prophecy, is a question: Josephus, Jarchi, and the Jewish writers, generally go the latter way; if it was at the time of his birth, which is the sense of many, then this affair happened in the one hundred and first year after the flood, for in that year Peleg was born, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and his brother's name was Joktan, whom the Arabs call Cahtan, and claim him as their parent, at least, of their principal tribes; and say he was the first that reigned in Yaman, and put a diadem on his head (l); and there is a city in the territory of Mecca, about seven furlongs or a mile to the south of it, and one station from the Red sea, called Baisath Jektan, the seat of Jektan (m), which manifestly retains his name; and there are a people called Catanitae, placed by Ptolemy (n) in Arabia Felix. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Phaleg. l. 2. c. 14. Colossians 93. (l) Vid. Pocock. Specimen. Arab. Hist. p. 39. 55. (m) Arab. Geograph. apud Bochart. Phaleg: l. 2. c. 15. Colossians 98. (n) Geograph, l. 6. c. 7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) Phaleg. l. 2. c. 14. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 93",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (l) Vid. Pocock. Specimen. Arab. Hist. p. 39. 55. (m) Arab. Geograph. apud Bochart. Phaleg: l. 2. c. 15. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 98",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (n) Geograph, l. 6. c. 7. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And unto Eber were born two sons: the name of one was Peleg; for in his days was the earth {l} divided; and his brother's name was Joktan.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And unto Eber were born two sons: the name of one ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Peleg; for in his days was the earth ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " divided; and his brother's name ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Joktan.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) This division came by the diversity of language, as appears in Ge 11:9.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Peleg",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. marg. That is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Division",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His descendants are not recorded. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:18-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (P) Peleg is the father of Reu, the father of Serug, the father of Nahor. Eber’s two sons, Peleg and Joktan, apparently represent the two divisions of Shemites, Peleg the northern or Mesopotamian, Joktan the southern or Arabian.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was the earth divided",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The reference is generally assumed to be to the division, or dispersion, of the peoples at the tower of Babel, the words being an anticipation of the story in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “The earth” will then mean “the inhabitants of the earth,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Sayce, on the strength of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "palgu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being Assyrian for “canal,” would conjecture “the division of the earth” to signify the introduction of a system of canals into Babylonia during the reign of Hammurabi.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Perhaps, however, the name Peleg may indicate the historic “severance” of the northern Shemites from their southern brethren.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joktan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The genealogy of Eber’s elder son, Peleg, is here omitted, evidently because the compiler is giving the descendants of Peleg in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from P; in which passage Joktan’s name is not mentioned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The thirteen sons of Joktan probably represent tribes in Arabia. The division of the population into tribes, continually warring with each other, has always been a feature of the Arabian Peninsula.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Dillmann suggests that one name has been interpolated; and that, as in the case of Israel, the number of tribes was originally twelve. Obal’s name is omitted in some MSS. of LXX.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Most of their names have been, with more or less reason, identified with places in Arabia, for details of which the student should consult the dictionaries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sheleph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The name of a tribe, or region, in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yemen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or southern Arabia.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And unto Eber were born two sons: the name of one was Peleg.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Division",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "palg",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to divide; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πέλαγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pela",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a division of the sea. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For in his days was the earth divided.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " At the confusion of tongues (Bochart, Rosenmüller, Keil, Lange, Murphy); at an earlier separation of the earth's population (Delitzsch), of which there is no record or trace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And his brother's name was Joktan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Father of the Arabians, by whom he is called Kachtan. Genesis 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Among the descendants of Arphaxad, Eber's eldest son received the name of Peleg, because in his days the earth, i.e., the population of the earth, was divided, in consequence of the building of the tower of Babel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). His brother Joktan is called Kachtan by the Arabians, and is regarded as the father of all the primitive tribes of Arabia. The names of his sons are given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:26-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There are thirteen of them, some of which are still retained in places and districts of Arabia, whilst others are not yet discovered, or are entirely extinct. Nothing certain has been ascertained about Almodad, Jerah, Diklah, Obal, Abimael, and Jobab. Of the rest, Sheleph is identical with Salif or Sulaf (in Ptl. 6, 7, Σαλαπηνοί), an old Arabian tribe, also a district of Yemen. Hazarmaveth (i.e., forecourt of death) is the Arabian Hadhramaut in South-eastern Arabia on the Indian Ocean, whose name Jauhari is derived from the unhealthiness of the climate. Hadoram: the Ἀδραμῖται of Ptol. 6, 7, Atramitae of Plin. 6, 28, on the southern coast of Arabia. Uzal: one of the most important towns of Yemen, south-west of Mareb. Sheba: the Sabaeans, with the capital Saba or Mareb, Mariaba regia (Plin.), whose connection with the Cushite (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Abrahamite Sabaeans (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is quite in obscurity. Ophir has not yet been discovered in Arabia; it is probably to be sought on the Persian Gulf, even if the Ophir of Solomon was not situated there. Havilah appears to answer to Chaulaw of Edrisi, a district between Sanaa and Mecca. But this district, which lies in the heart of Yemen, does not fit the account in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", nor the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Havilah formed the boundary of the territory of the Ishmaelites. These two passages point rather to Χαυλοταῖοι, a place on the border of Arabia Petraea towards Yemen, between the Nabataeans and Hagrites, which Strabo describes as habitable. ",
        "children": []
      }
    ]
  }
]