[{"header":"Samuel anoints David"},{"num":16,"verse":"The Lord said to Samuel, “How long are you going to grieve over Saul? I have rejected him as king over Israel. Fill your horn with oil and get going. I’m sending you to Jesse of Bethlehem because I have found my next king among his sons.”"},{"num":2,"verse":"“How can I do that?” Samuel asked. “When Saul hears of it he’ll kill me!”"},{"num":3,"verse":"Invite Jesse to the sacrifice, and I will make clear to you what you should do. You will anoint for me the person I point out to you.”"},{"num":4,"verse":"Samuel did what the Lord instructed. When he came to Bethlehem, the city elders came to meet him. They were shaking with fear. “Do you come in peace?” they asked."},{"num":5,"verse":"“Yes,” Samuel answered. “I’ve come to make a sacrifice to the Lord. Now make yourselves holy, then come with me to the sacrifice.” Samuel made Jesse and his sons holy and invited them to the sacrifice as well."},{"num":6,"verse":"When they arrived, Samuel looked at Eliab and thought, That must be the Lord’s anointed right in front."},{"num":7,"verse":"But the Lord said to Samuel, “Have no regard for his appearance or stature, because I haven’t selected him. God doesn’t look at things like humans do. Humans see only what is visible to the eyes, but the Lord sees into the heart.”"},{"num":8,"verse":"Next Jesse called for Abinadab, who presented himself to Samuel, but he said, “The Lord hasn’t chosen this one either.”"},{"num":9,"verse":"So Jesse presented Shammah, but Samuel said, “No, the Lord hasn’t chosen this one.”"},{"num":10,"verse":"Jesse presented seven of his sons to Samuel, but Samuel said to Jesse, “The Lord hasn’t picked any of these.”"},{"num":11,"verse":"Then Samuel asked Jesse, “Is that all of your boys?”"},{"num":12,"verse":"So Jesse sent and brought him in. He was reddish brown, had beautiful eyes, and was good-looking. The Lord said, “That’s the one. Go anoint him.”"},{"num":13,"verse":"So Samuel took the horn of oil and anointed him right there in front of his brothers. The Lord’s spirit came over David from that point forward."},{"header":"David is introduced to Saul"},{"num":14,"verse":"Now the Lord’s spirit had departed from Saul, and an evil spirit from the Lord tormented him."},{"num":15,"verse":"Saul’s servants said to him, “Look, an evil spirit from God is tormenting you."},{"num":16,"verse":"If our master just says the word, your servants will search for someone who knows how to play the lyre. The musician can play whenever the evil spirit from God is affecting you, and then you’ll feel better.”"},{"num":17,"verse":"Saul said to his servants, “Find me a good musician and bring him to me.”"},{"num":18,"verse":"One of the servants responded, “I know that one of Jesse’s sons from Bethlehem is a good musician. He’s a strong man and heroic, a warrior who speaks well and is good-looking too. The Lord is with him.”"},{"num":19,"verse":"So Saul sent messengers to Jesse to say, “Send me your son David, the one who keeps the sheep.”"},{"num":20,"verse":"Jesse then took a donkey and loaded it with a homer of bread, a jar of wine, and a young goat, and he sent it along with his son David to Saul."},{"num":21,"verse":"That is how David came to Saul and entered his service. Saul liked David very much, and David became his armor-bearer."},{"num":22,"verse":"Saul sent a message to Jesse: “Please allow David to remain in my service because I am pleased with him.”"},{"num":23,"verse":"Whenever the evil spirit from God affected Saul, David would take the lyre and play it. Then Saul would relax and feel better, and the evil spirit would leave him alone."}]