[{"num":1,"verse":"One day he said, “Samuel, I’ve rejected Saul, and I refuse to let him be king any longer. Stop feeling sad about him. Put some olive oil in a small container and go visit a man named Jesse, who lives in Bethlehem. I’ve chosen one of his sons to be my king.”"},{"num":2,"verse":"Samuel answered, “If I do that, Saul will find out and have me killed.”"},{"num":3,"verse":"then invite Jesse to the sacrifice. When I show you which one of his sons I have chosen, pour the olive oil on his head.”"},{"num":4,"verse":"Samuel did what the Lord told him and went to Bethlehem. The town leaders went to meet him, but they were terribly afraid and asked, “Is this a friendly visit?”"},{"num":5,"verse":"“Yes, it is!” Samuel answered. “I’ve come to offer a sacrifice to the Lord. Get yourselves ready to take part in the sacrifice and come with me.” Samuel also invited Jesse and his sons to come to the sacrifice, and he got them ready to take part."},{"num":6,"verse":"When Jesse and his sons arrived, Samuel noticed Jesse’s oldest son, Eliab. “He has to be the one the Lord has chosen,” Samuel said to himself."},{"num":7,"verse":"But the Lord told him, “Samuel, don’t think Eliab is the one just because he’s tall and handsome. He isn’t the one I’ve chosen. People judge others by what they look like, but I judge people by what is in their hearts.”"},{"num":8,"verse":"Jesse told his son Abinadab to go over to Samuel, but Samuel said, “No, the Lord hasn’t chosen him.”"},{"num":9,"verse":"Next, Jesse sent his son Shammah to him, and Samuel said, “The Lord hasn’t chosen him either.”"},{"num":10,"verse":"Jesse had all seven of his sons go over to Samuel. Finally, Samuel said, “Jesse, the Lord hasn’t chosen any of these young men. "},{"num":11,"verse":"Do you have any more sons?”"},{"num":12,"verse":"Jesse sent for David. He was a healthy, good-looking boy with a sparkle in his eyes. As soon as David came, the Lord told Samuel, “He’s the one! Get up and pour the olive oil on his head.”"},{"num":13,"verse":"Samuel poured the oil on David’s head while his brothers watched. At that moment, the Spirit of the Lord took control of David and stayed with him from then on."},{"header":"David Plays the Harp for Saul"},{"num":14,"verse":"The Spirit of the Lord had left Saul, and an evil spirit from the Lord was terrifying him. "},{"num":15,"verse":"“It’s an evil spirit from God that’s frightening you,” Saul’s officials told him. "},{"num":16,"verse":"“Your Majesty, let us go and look for someone who is good at playing the harp. He can play for you whenever the evil spirit from God bothers you, and you’ll feel better.”"},{"num":17,"verse":"“All right,” Saul answered. “Find me someone who is good at playing the harp and bring him here.”"},{"num":18,"verse":"“A man named Jesse who lives in Bethlehem has a son who can play the harp,” one official said. “He’s a brave warrior, he’s good-looking, he can speak well, and the Lord is with him.”"},{"num":19,"verse":"Saul sent a message to Jesse: “Tell your son David to leave your sheep and come here to me.”"},{"num":20,"verse":"Jesse loaded a donkey with bread and a goatskin full of wine, then he told David to take the donkey and a young goat to Saul. "},{"num":21,"verse":"David went to Saul and started working for him. Saul liked him so much that he put David in charge of carrying his weapons. "},{"num":22,"verse":"Not long after this, Saul sent another message to Jesse: “I really like David. Please let him stay with me.”"},{"num":23,"verse":"Whenever the evil spirit from God bothered Saul, David would play his harp. Saul would relax and feel better, and the evil spirit would go away."}]