[{"header":"Samuel Goes to Bethlehem"},{"num":16,"verse":"The Lord said to Samuel, “How long will you continue to feel sorry for Saul? I have rejected him as king of Israel. Fill your container with olive oil and go. I am sending you to Jesse who lives in Bethlehem. I have chosen one of his sons to be king.”"},{"num":2,"verse":"But Samuel said, “If I go, Saul will hear the news. And he will try to kill me.”"},{"num":3,"verse":"Invite Jesse to the sacrifice. Then I will show you what to do. You must appoint the one I show you.”"},{"num":4,"verse":"Samuel did what the Lord told him to do. When he arrived at Bethlehem, the elders of Bethlehem shook with fear. They met him and asked, “Are you coming in peace?”"},{"num":5,"verse":"Samuel answered, “Yes, I come in peace. I have come to make a sacrifice to the Lord. Make yourselves holy for the Lord and come to the sacrifice with me.” Then he made Jesse and his sons holy for the Lord. And he invited them to come to the sacrifice."},{"num":6,"verse":"When they arrived, Samuel saw Eliab. Samuel thought, “Surely the Lord has appointed this person standing here before him.”"},{"num":7,"verse":"But the Lord said to Samuel, “Don’t look at how handsome Eliab is. Don’t look at how tall he is. I have not chosen him. God does not see the same way people see. People look at the outside of a person, but the Lord looks at the heart.”"},{"num":8,"verse":"Then Jesse called Abinadab and told him to pass by Samuel. But Samuel said, “The Lord has not chosen this man either.” "},{"num":9,"verse":"Then Jesse had Shammah pass by. But Samuel said, “No, the Lord has not chosen this one.” "},{"num":10,"verse":"Jesse had seven of his sons pass by Samuel. But Samuel said to him, “The Lord has not chosen any of these.”"},{"num":11,"verse":"Then he asked Jesse, “Are these all the sons you have?”"},{"num":12,"verse":"So Jesse sent and had his youngest son brought in. He was a fine boy, tanned and handsome."},{"num":13,"verse":"So Samuel took the container of olive oil. Then he poured oil on Jesse’s youngest son to appoint him in front of his brothers. From that day on, the Lord’s Spirit entered David with power. Samuel then went back to Ramah."},{"header":"David Serves Saul"},{"num":14,"verse":"But the Lord’s Spirit had gone out of Saul. And an evil spirit from the Lord troubled him."},{"num":15,"verse":"Saul’s servants said to him, “See, an evil spirit from God is troubling you. "},{"num":16,"verse":"Give us the command. We will look for someone who can play the harp. When the evil spirit from the Lord enters you, he will play. Then the evil spirit will leave you alone. And you will feel better.”"},{"num":17,"verse":"So Saul said to his servants, “Find someone. If he plays well, bring him to me.”"},{"num":18,"verse":"One of the servants said, “Jesse of Bethlehem has a son who plays the harp. I have seen him play it. He is a brave man and fights well. He is a good speaker and handsome. And the Lord is with him.”"},{"num":19,"verse":"Then Saul sent messengers to Jesse. The message said, “Send me your son David, who is with the sheep.” "},{"num":20,"verse":"So Jesse loaded a donkey with bread and a leather bag full of wine. He also took a young goat. He sent them all with his son David to Saul."},{"num":21,"verse":"When David came to Saul, he began to serve him. Saul loved David very much. And David became the officer who carried Saul’s armor. "},{"num":22,"verse":"Saul sent a message to Jesse. He said, “Let David stay and serve me. I like him.”"},{"num":23,"verse":"When the evil spirit from God entered Saul, David would take his harp and play. Then the evil spirit would go out of him. And Saul would feel relief. He would feel better again."}]