[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 34:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 34:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the land which ye shall inherit ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This is repeated, that they might not extend their desires beyond the bounds of God’s gracious grant to them. And, by the foregoing description, it appears that they were placed in a very pleasant land, sheltered from the sultry air of the deserts of Arabia by great mountains on the south, refreshed by western breezes from the Mediterranean sea, and on the north defended by mount Lebanon from the colder blasts of that quarter, and having the delightful plains of Jordan on the east.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:1-15 Canaan was of small extent; as it is here bounded, it is but about 160 miles in length, and about 50 in breadth; yet this was the country promised to the father of the faithful, and the possession of the seed of Israel. This was that little spot of ground, in which alone, for many ages, God was known. This was the vineyard of the Lord, the garden enclosed; but as it is with gardens and vineyards, the narrowness of the space was made up by the fruitfulness of the soil. Though the earth is the Lord's, and the fulness thereof, yet few know him, and serve him; but those few are happy, because fruitful to God. Also, see how little a share of the world God gives to his own people. Those who have their portion in heaven, have reason to be content with a small pittance of this earth. Yet a little that a righteous man has, having it from the love of God, and with his blessing, is far better and more comfortable than the riches of many wicked.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shepham, the first point after Hazar-enan, is unknown. The name Riblah is by some read Har-bel, i. e., \"the Mountain of Bel;\" the Har-baal-Hermon of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No more striking landmark could be set forth than the summit of Hermon, the southernmost and by far the loftiest peak of the whole Antilibanus range, rising to a height of 10,000 feet, and overtopping every other mountain in the Holy land. Ain, i. e. the fountain, is understood to be the fountain of the Jordan; and it is in the plain at the southwestern foot of Hermon that the two most celebrated sources of that river, those of Daphne and of Paneas, are situate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The \"sea of Chinnereth\" is better known by its later name of Gennesaret, which is supposed to be only a corruption of Chinnereth. The border ran parallel to this sea, along the line of hill about 10 miles further east. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The \"sea of Chinnereth\" is better known by its later name of Gennesaret, which is supposed to be only a corruption of Chinnereth. The border ran parallel to this sea, along the line of hill about 10 miles further east. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-15. The two tribes and the half-tribe have received their inheritance on this side Jordan—The conquered territories of Sihon and Og, lying between the Arnon and mount Hermon, were allotted to them—that of Reuben in the most southerly part, Gad north of it, and the half Manasseh in the northernmost portion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses commanded the children of Israel, saying,.... Strictly enjoining them to observe what he was about to say to them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "this is the land which ye shall inherit by lot; as above described and bounded: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which the Lord commanded to give unto the nine tribes, and to the half tribe; to the tribes of Judah, Simeon, Benjamin, Dan, Ephraim, Zebulun, Issachar, Asher, and Naphtali, and the half tribe of Manasseh; though this command is not before expressed, it is very probable it was delivered to Moses at the same time he had the mind of God concerning the settlement of the tribes of Reuben and Gad, and the other half tribe of Manasseh, on the other side Jordan; see Numbers 32:31. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which the Lord commanded to give unto the nine tribes, and to the half tribe; to the tribes of Judah, Simeon, Benjamin, Dan, Ephraim, Zebulun, Issachar, Asher, and Naphtali, and the half tribe of Manasseh; though this command is not before expressed, it is very probable it was delivered to Moses at the same time he had the mind of God concerning the settlement of the tribes of Reuben and Gad, and the other half tribe of Manasseh, on the other side Jordan; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 32:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Moses commanded the children of Israel, saying, This is the land which ye shall inherit by lot, which the LORD commanded to give unto the nine tribes, and to the half tribe:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This land, according to the boundaries thus described, the Israelites were to distribute by lot (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 26:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to give it to the nine tribes and a half, as the tribes of Reuben, Gad, and half Manasseh had already received their inheritance on the other side of the Jordan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). ",
        "children": []
      }
    ]
  }
]