[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:16-29 God here appoints men to divide the land to them. So sure must they feel of victory and success while God fought for them, that the persons are named who should be intrusted with the dividing of the land.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Of the representatives now selected through Moses beforehand, who were all princes, i. e. heads of chief families, in their respective tribes (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Caleb alone, of the tribe of Judah, is otherwise known to us (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff). The order in which the tribes are named is peculiar to this passage. If they be taken in pairs, Judah and Simeon, Benjamin and Dan, Manasseh and Ephraim, Zebulun and Issachar, Asher and Naphtali, the order of the pairs agrees with the order in which the allotments in the Holy land, taken also in couples, followed each other in the map from south to north. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16-29. names of the men … which shall divide the land—This appointment by the Lord before the Jordan tended not only to animate the Israelites faith in the certainty of the conquest, but to prevent all subsequent dispute and discontent, which might have been dangerous in presence of the natives. The nominees were ten princes for the nine and a half tribes, one of them being selected from the western section of Manasseh, and all subordinate to the great military and ecclesiastical chiefs, Joshua and Eleazar. The names are mentioned in the exact order in which the tribes obtained possession of the land, and according to brotherly connection.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the names of the men are these,.... Which were not left to the tribes to choose, but were nominated by the Lord himself, who best knew their capacities and qualifications for this service: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of the tribe of Judah, Caleb the son of Jephunneh: who was one of the two spies that brought a good report of the land, and Joshua is the other; and these were the only two of the spies living, and who are the first that were appointed to this service, of overseeing the division of the land; the rest were all of the new generation, that were sprung up, whose fathers fell in the wilderness, and we know no more of them than their names; and therefore from hence, to the end of Numbers 34:28, no further remarks are necessary, only that the tribes and the princes are reckoned in a different order than they were at any time before, either at the first numbering of them, Numbers 1:1 or at the offerings for the dedication of the altar, Numbers 7:1 or at the taking the sum of them, Numbers 26:1 even according to the order of their situation in the land of Canaan by their lots, and which Moses did not live to see; and which therefore shows the prescience and predisposing providence of God, and that Moses, as Bishop Patrick observes, was guided by a divine Spirit in all his writings. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "of the tribe of Judah, Caleb the son of Jephunneh: who was one of the two spies that brought a good report of the land, and Joshua is the other; and these were the only two of the spies living, and who are the first that were appointed to this service, of overseeing the division of the land; the rest were all of the new generation, that were sprung up, whose fathers fell in the wilderness, and we know no more of them than their names; and therefore from hence, to the end of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 34:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", no further remarks are necessary, only that the tribes and the princes are reckoned in a different order than they were at any time before, either at the first numbering of them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or at the offerings for the dedication of the altar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or at the taking the sum of them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " even according to the order of their situation in the land of Canaan by their lots, and which Moses did not live to see; and which therefore shows the prescience and predisposing providence of God, and that Moses, as Bishop Patrick observes, was guided by a divine Spirit in all his writings. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the prince of the tribe of the children of Issachar, Paltiel the son of Azzan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "List of the Men Appointed to Distribute the Land. - In addition to Eleazar and Joshua, the former of whom was to stand at the head as high priest, in accordance with the divine appointment in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the latter to occupy the second place as commander of the army, a prince was selected from each of the ten tribes who were interested in the distribution, as Reuben and Gad had nothing to do with it. Of these princes, namely heads of fathers' houses of the tribes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not heads of tribes (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Caleb, who is well known from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is the only one whose name if known. The others are not mentioned anywhere else. The list of tribes, in the enumeration of their princes, corresponds, with some exceptions, to the situation of the territory which the tribes received in Canaan, reckoning from south to north, and deviates considerably from the order in which the lots came out for the different tribes, as described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". נחל in the Kal, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", signifies to give for an inheritance, just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to put into possession. There is not sufficient ground for altering the Kal into Piel, especially as the Piel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is construed with the accusative of the person, and with the thing governed by ב; whereas in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Kal is construed with the person governed by ל, and the accusative of the thing. ",
        "children": []
      }
    ]
  }
]