[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:31-39 The robe of the ephod was under the ephod, and reached down to the knees, without sleeves. Aaron must minister in the garments appointed. We must serve the Lord with holy fear, as those who know they deserve to die. A golden plate was fixed on Aaron's forehead, engraven with Holiness to the Lord. Aaron was hereby reminded that God is holy, and that his priests must be holy, devoted to the Lord. This must appear in their forehead, in open profession of their relation to God. It must be engraven like the engravings of a signet; deep and durable; not painted so as to be washed off, but firm and lasting; such must our holiness to the Lord be. Christ is our High Priest; through him sins are forgiven to us, and not laid to our charge. Our persons, our doings, are pleasing to God upon the account of Christ, and not otherwise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "An habergeon - Corselets of linen, such as appear to be here referred to, were well known amongst the Egyptians.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34. a golden bell and a pomegranate—The bells were hung between the pomegranates, which were said to have amounted to seventy-two, and the use of them seems to have been to announce to the people when the high priest entered the most holy place, that they might accompany him with their prayers, and also to remind himself to be attired in his official dress, to minister without which was death.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A golden bell and a pomegranate, a golden bell and a pomegranate,.... First a golden bell and then a pomegranate, then a bell and then a pomegranate again, and so on: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon the hem of the robe round about; all round the hem or skirts of the robe were they placed in this manner: the Targum of Jonathan says, the sum or number of them were seventy one; but Maimonides (c) says there were seventy two, thirty six in each skirt; and so says R. Levi Ben Gersom; but Clemens of Alexandria (d) has increased the number to three hundred and sixty six, according to the days of the year, and thinks they signified the acceptable year of the Lord proclaiming and resounding the great appearance of the Saviour: \"golden bells\" may denote either the intercession of Christ in heaven, which if not vocal, as on earth, has a speech or sound in it, which is understood: his blood, righteousness, and sacrifice, call aloud for peace and pardon, and it is a sound that is always heard with delight; the matter of them being gold may denote the preciousness and excellency of Christ's intercession, and the duration of it; and being on the hem of the robe shows that Christ's righteousness is that on which his intercession depends, and from whence it has its efficacy: or else these bells may be an emblem of the Gospel, as preached by Christ himself, and by his apostles and ministers, compared to \"bells\" for sound; the sound of the Gospel being a sound of love, grace, mercy, peace, pardon, righteousness, life, and salvation; a joyful sound, like that of the jubilee, an even and certain one, different from that of the law, and exceeding musical and delightful; and to \"golden\" bells for the preciousness of it, and its truths, and for its duration; and being on the hem of the robe may signify that in the Gospel the righteousness of Christ is revealed and pointed at, and that faith in this righteousness comes hereby; \"the pomegranates\" on Aaron might be an emblem of his priesthood, and of the ceremonial law, and of the good things they were shadows and types of; and of Christ himself, and of the virtue, odour, and fragrancy of his sufferings, sacrifice, and intercession; and also of the church, called an orchard of pomegranates, Sol 4:13 consisting of various members, as the pomegranate of various grains; the juice of which the blood of Christ may resemble, in which those members swim and are washed; and who are of a grateful odour to God, and are surrounded by his power and love; and their hanging upon the hem of the robe may signify the acceptableness of them through the righteousness, sacrifice, and mediation of Christ, and the fruits of good works, which both the righteousness of Christ and the Gospel produce; and particularly the bells and pomegranates may signify that sound doctrine and a savoury life and conversation should go together in the priests of the Lord, in the ministers of his word. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Hilchot Cele Hamikdash, c. 9. sect. 4. (d) Stromat. l. 5. p. 564. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Hilchot Cele Hamikdash, c. 9. sect. 4. (d) Stromat. l. 5. p. 564. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "A golden bell and a pomegranate, a golden bell and a pomegranate, upon the hem of the robe round about.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 34, 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A golden bell and a pomegranate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hebrew tradition gives a most uncertain sound with respect to the number of the bells. According to some, they were 12 only; according to others, 72; according to a third school, 3651 Equally conflicting are the explanations given of their symbolism - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they typified the proclamation and expounding of the law by the high-priest - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they were a musical offering of praise - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they marked kingly dignity, since Oriental kings sometimes wore bells - and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they were a call to vigilance and attention. This last view is supported by the words of verse 35 - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "it shall be upon Aaron to minister, and his sound shall be hoard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or \"that its sound may be heard.\" The bells were a means of uniting priest and people in one common service - they enabled the people to enter into and second what the priest was doing for them, and so to render his mediation efficacious - they made the people's worship in the court of the sanctuary a \"reasonable service.\" And hence the threat, which certainly does not extend to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the priestly garments, implied in the words, \"that he die not.\" If the high priest neglected to wear the robe with the bells, he separated himself off from the people; made himself their substitute and not their mouthpiece; reduced their worship to a drear formality; deprived it of all heartiness and life and vigour. For thus abusing his office, he would deserve death, especially as he could not do it unwittingly, for his ears would tell him whether he was wearing the bells or not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " CHAPTER 28:36-38 Exodus 28:34",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the lower hem (שׁוּלים the tail or skirt) there were to be pomegranates of dark-blue and dark-red purple and crimson, made of twisted yarn of these colours (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and little golden bells between them round about, a bell and a pomegranate occurring alternately all round. According to Rashi the pomegranates were \"globi quidam rotundi instar malorum punicorum, quasi essent ova gallinarum.\" פּעמנים (from פּעם to strike of knock, like the old High German cloccon, clochon, i.e., to smite) signifies a little bell, not a spherical ball.",
        "children": []
      }
    ]
  }
]