[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. THE MITRE.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(36-39) The head-dress of the high priest was to be of fine white linen (shêsh) and appears by the description of Josephus (Ant. Jud. iii. 7, § 3) to have been a turban, made of several thick swathes or folds in the usual way. It was to be adorned in front with a plate of pure gold bearing the inscription “Holiness to Jehovah,” which was to be attached to the linen fabric by a ribbon or “lace” of blue.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(36-39) The head-dress of the high priest was to be of fine white linen (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shêsh",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and appears by the description of Josephus (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ant. Jud. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "iii. 7, § 3) to have been a turban, made of several thick swathes or folds in the usual way. It was to be adorned in front with a plate of pure gold bearing the inscription “Holiness to Jehovah,” which was to be attached to the linen fabric by a ribbon or “lace” of blue.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(36) Thou shalt make a plate.—The plate is so much of the essence of the mitre that it is put forward first, as that whereto all the rest is subordinate. It was to be “of pure gold,” and “fastened on high upon the mitre” (Exodus 39:31); so catching the eye even more than the breastplate, and drawing men’s special attention. But the plate itself was only the vehicle for an inscription, and thus men’s attention would be especially directed to that. It taught the great truth that religion culminates in “Holiness to Jehovah,” without which all else is worthless—forms, ceremonies, priestly attire, sacrifice, prayer, are mockeries. It required primarily the high priest himself to be holy; but it was a call also to the whole nation, whose representative the high priest was, that they should be “a holy nation,” “a kingdom of priests” (Exodus 19:6), and should consecrate themselves heart and soul to Jehovah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(36) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Thou shalt make a plate.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The plate is so much of the essence of the mitre that it is put forward first, as that whereto all the rest is subordinate. It was to be “of pure gold,” and “fastened on high upon the mitre” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 39:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); so catching the eye even more than the breastplate, and drawing men’s special attention. But the plate itself was only the vehicle for an inscription, and thus men’s attention would be especially directed to that. It taught the great truth that religion culminates in “Holiness to Jehovah,” without which all else is worthless—forms, ceremonies, priestly attire, sacrifice, prayer, are mockeries. It required primarily the high priest himself to be holy; but it was a call also to the whole nation, whose representative the high priest was, that they should be “a holy nation,” “a kingdom of priests” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and should consecrate themselves heart and soul to Jehovah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exodus",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THREE INSCRIPTIONS WITH ONE MEANING",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "HOLINESS TO THE LORD.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "HOLINESS UNTO THE LORD.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘His name shall be in their foreheads.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You will have perceived my purpose in putting these three widely separated texts together. They all speak of inscriptions, and they are all obviously connected with each other. The first of them comes from the ancient times of the institution of the ceremonial ritual, and describes a part of the high priest’s official dress. In his mitre was a thin plate of gold on which was written, ‘Holiness to the Lord.’ The second of them comes from almost the last portion recorded of the history of Israel in the Old Testament, and is from the words of the great Prophet of the Restoration-his ideal presentation of the Messianic period, in which he recognises as one feature, that the inscription on the mitre of the high priest shall be written on ‘the bells of the horses.’ And the last of them is from the closing vision of the celestial kingdom, the heavenly and perfected form of the Christian Church. John, probably remembering the high priest and his mitre, with its inscription upon the forehead, says: ‘His servants shall do Him priestly service’-for that is the meaning of the word inadequately translated ‘serve Him’-’and see His face, and His name shall be in their foreheads.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These three things, then-the high priest’s mitre, the horses’ bells, the foreheads of the perfected saints-present three aspects of the Christian thought of holiness. Take them one by one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The high priest’s mitre. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The high priest’s mitre.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The high priest was the official representative of the nation. He stood before God as the embodied and personified Israel. For the purposes of worship Israel was the high priest, and the high priest was Israel. And so, on his forehead, not to distinguish him from the rest of the people, but to include all the people in his consecration, shone a golden plate with the motto, ‘Holiness to the Lord.’ So, at the very beginning of Jewish ritual there stands a protest against all notions that make ‘saint’ the designation of any abnormal or exceptional sanctity, and confine the name to the members of any selected aristocracy of devoutness and goodness. All Christian men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ex officio",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the very fact of their Christianity, are saints, in the true sense of the word. And the representative of the whole of Israel stood there before God, with this inscription blazing on his forehead, as a witness that, whatsoever holiness may be, it belongs to every member of the true Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what is it? It is a very unfortunate thing-indicating superficiality of thought-that the modern popular notion of ‘holiness’ identifies it with purity, righteousness, moral perfection. Now that idea ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in it, but is not the whole of it. For, not to spend time upon mere remarks on words, the meaning of the word thus rendered is in Hebrew, as well as in Greek and in our own English, one and the same. The root-meaning is ‘separated,’ ‘set apart,’ and the word expresses primarily, not moral character, but relation to God. That makes all the difference; and it incalculably deepens the conception, as well as puts us on the right track for understanding the only possible means by which there can ever be realised that moral perfection and excellence which has unfortunately monopolised the meaning of the word in most people’s minds. The first thought is ‘set apart to God.’ That is holiness, in its root and germ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how can we be set apart for God? You may devote a dead thing for certain uses easily enough. How can a man be separated and laid aside?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well, there is only one way, brethren, and that is by self-surrender. ‘Yield yourselves to God’ is but the other side, or, rather, the practical shape, of the Old and the New Testament doctrine of holiness. A man becomes God’s when he says, ‘Lord, take me and mould me, and fill me and cleanse me, and do with me what Thou wilt.’ In that self-surrender, which is the tap-root of all holiness, the first and foremost thing to be offered is that most obstinate of all, the will that is in us. And when we yield our wills in submission both to commandments and providences, both to gifts and to withdrawals, both to gains and to losses, both to joys and to sorrows, then we begin to write upon our foreheads ‘Holiness to the Lord.’ And when we go on to yield our hearts to Him, by enshrining Him sole and sovereign in their innermost chamber, and turning to Him the whole current of our lives and desires, and hopes and confidences, which we are so apt to allow to run to waste and be sucked up in the desert sands of the world, then we write more of that inscription. And when we fill our minds with joyful submission to His truth, and occupy our thoughts with His mighty Name and His great revelation, and carry Him with us in the hidden corners of our consciousness, even whilst we are busy about daily work, then we add further letters to it. And when the submissive will, and the devoted heart, and the occupied thoughts are fully expressed in daily life and its various external duties, then the writing is complete. ‘Holiness to the Lord’ is self-surrender of will and heart and mind and everything. And that surrender is of the very essence of Christianity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is a saint? Some man or woman that has practised unheard-of austerities? Somebody that has lived an isolated and self-regarding life in convent or monastery or desert? No! a man or woman in the world who, moved by the mercies of God, yields self to God as ‘a living sacrifice.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the New Testament writers never hesitate to speak even of such very imperfect Christians as were found in abundance in churches like Corinth and Galatia as being all ‘saints,’ every man of them. That is not because the writers were minimising their defects, or idealising their persons, but because, if they are Christians at all, they are saints; seeing that no man is a Christian who has not been drawn by Christ’s great sacrifice for him to yield himself a sacrifice for Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course that intrusive idea which has, in popular apprehension, so swallowed up the notion of holiness-viz. that of perfection of moral character or conduct-is included in this other, or rather is developed from it. For the true way to conquer self is to surrender self; and the more entire our giving up of ourselves, the more certainly shall we receive ourselves back again from His hands. ‘By the mercies of God, I beseech you, yield yourselves living sacrifices.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. I come to my next text-the horses’ bells. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. I come to my next text-the horses’ bells.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Zechariah has a vision of the ideal Messianic times, and, of course, as must necessarily be the case, his picture is painted with colours laid upon his palette by his experience, and he depicts that distant future in the guise suggested to him by what he saw around him. So we have to disentangle from his words the sentiment which he expresses, and to recognise the symbolic way in which he puts it. His thought is this,-the inscription on the high priest’s mitre will be written on the bells which ornament the harness of the horses, which in Israel were never used as with us, but only either for war or for pomp and display, and the use of which was always regarded with a certain kind of doubt and suspicion. Even these shall be consecrated in that far-off day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then he goes on with variations on the same air, ‘In that day there shall be upon the bells of the horses, \"Holiness unto the Lord,\"‘ and adds that ‘the pots in the Lord’s house’-the humble vessels that were used for the most ordinary parts of the Temple services-’shall be like the bowls before the altar,’ into which the sacred blood of the offerings was poured. The most external and secular thing bearing upon religion shall be as sacred as the sacredest. But that is not all. ‘Yea! every pot in Jerusalem and in Judah shall be holiness unto the Lord of hosts, and all they that sacrifice shall come and take of them,’ and put their offerings therein. That is to say, the coarse pottery vessels that were in every poverty-stricken house in the city shall be elevated to the rank of the sacred vessels of the Temple. Domestic life with all its secularities shall be hallowed. The kitchens of Jerusalem shall be as truly places of worship as is the inner shrine of the Most High.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " On the whole, the prophet’s teaching is that, in the ideal state of man upon earth, there will be an entire abolition of the distinction between ‘sacred’ and ‘secular’; a distinction that has wrought infinite mischief in the world, and in the lives of Christian people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me translate these words of our prophet into English equivalents. Every cup and tumbler in a poor man’s kitchen may be as sacred as the communion chalice that passes from lip to lip with the ‘blood of Jesus Christ’ in it. Every common piece of service that we do, down among the vulgarities and the secularities and the meannesses of daily life, may be lifted up to stand upon precisely the same level as the sacredest office that we undertake. The bells of the horses may jingle to the same tune as the trumpets of the priests sounded within the shrine, and on all, great and small, may be written, ‘Holiness to the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But let us remember that that universally diffused sanctity will need to have a centre of diffusion, else there will be no diffusion, and that all life will become sacred when the man that lives it has ‘Holiness to the Lord’ written on his forehead, and not else. If that be the inscription on the driver’s heart, the horses that he drives will have it written on their bells, but they will not have it unless it be. Holy men make all things holy. ‘To the pure all things are pure,’ but unto them that are unclean and disobedient there is nothing pure. Hallow thyself, and all things are clean unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And so I come to my third text-the perfected saints’ foreheads. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And so I come to my third text-the perfected saints’ foreheads.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The connection between the first and the last of these texts is as plain and close as between the first and the second. For John in his closing vision gives emphasis to the priestly idea as designating in its deepest relations the redeemed and perfected Christian Church. Therefore he says, as I have already explained, ‘His servants shall do Him ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "priestly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " service, and His name shall be in their foreheads.’ The old official dress of the high priest comes into his mind, and he paints the future, just as Zechariah did, under the forms of the past, and sees before the throne the perfected saints, each man of them with that inscription clear and conspicuous.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is an advance in his words which I think it is not fanciful to note. It is only the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is written in the perfected saint’s forehead. Not the ‘Holiness unto the Lord,’ but just the bare name. What does that mean? Well, it means the same as your writing your name in one of your books does, or as when a man puts his initials on the back of his oxen, or as the old practice of branding the master’s mark upon the slave did. It means absolute ownership.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But it means something more. The name is the manifested personality, the revealed God, or, as we say in an abstract way, the character of God. That Name is to be in the foreheads of His perfected people. How does it come to be there? Read also the clause before the text-’His servants shall see His face, and His name shall be in their foreheads.’ That is to say, the perfected condition is not reached by surrender only, but by assimilation; and that assimilation comes by contemplation. The faces that are turned to Him, and behold Him, are smitten with the light and shine, and those that look upon them see ‘as it had been the face of an angel,’ as the Sanhedrim saw that of Stephen, when he beheld the Son of Man ‘standing at the right hand of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My last text is but a picturesque way of saying what the writer of it says in plain words when he declares, ‘We shall be like Him, for we shall see Him as He is.’ The name is to be ‘in their foreheads,’ where every eye can see it. Alas! alas! it is so hard for us to live out our best selves, and to show to the world what is in us. Cowardice, sheepishness, and a hundred other reasons prevent it. In this poor imperfect state no emotion ever takes shape and visibility without losing more or less of its beauty. But yonder the obstructions to self-manifestation will be done away; and ‘when He shall be manifested, we also shall be manifested with Him in glory.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Then shall the righteous blaze forth like the sun in My heavenly Father’s Kingdom.’ But the beginning of it all is ‘Holiness to the Lord’ written on our hearts; and the end of that is the vision which is impossible without holiness, and which leads on to the beholder’s perfect likeness to his Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 28:36",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:36",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "golden plate ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "fixed upon Aaron’s forehead, like a half coronet, reaching, as the Jews say, from ear to ear, must be engraved, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Holiness to the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Aaron must hereby be reminded, that God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is holy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and that his priests must be holy. The high-priest must be consecrated to God, and so must all his ministrations. All that attend in God’s house must have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holiness to the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "engraven upon their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "foreheads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, they must be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "devoted to the Lord, and designing his glory in all they do. This must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "appear ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their forehead, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in an open profession of their relation to God, as those that are not ashamed to own it, and in a conversation answerable to it. It must likewise be engraven like the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "engravings of a signet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so deep, so durable; not painted, so as it may be washed off, but sincere and lasting.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:31-39 The robe of the ephod was under the ephod, and reached down to the knees, without sleeves. Aaron must minister in the garments appointed. We must serve the Lord with holy fear, as those who know they deserve to die. A golden plate was fixed on Aaron's forehead, engraven with Holiness to the Lord. Aaron was hereby reminded that God is holy, and that his priests must be holy, devoted to the Lord. This must appear in their forehead, in open profession of their relation to God. It must be engraven like the engravings of a signet; deep and durable; not painted so as to be washed off, but firm and lasting; such must our holiness to the Lord be. Christ is our High Priest; through him sins are forgiven to us, and not laid to our charge. Our persons, our doings, are pleasing to God upon the account of Christ, and not otherwise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:27-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Exodus 28:36",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:36",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Holiness to the Lord - This inscription testified in express words the holiness with which the high priest was invested in virtue of his sacred calling.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Holiness to the Lord - This inscription testified in express words the holiness with which the high priest was invested in virtue of his sacred calling.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "36-38. plate—literally, a petal of a flower, which seems to have been the figure of this golden plate, which was tied with a ribbon of blue on the front of the mitre, so that every one facing him could read the inscription.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "plate of pure gold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was like a half coronet, reaching, as the Jews say, from ear to ear. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holiness to the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to mind the priest of his special consecration to God, and of that singular holiness which was required of him, as at all times, so especially in his approaches to God. It might also represent Christ, who is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Holy One of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and who is a crowned Priest, or both King and Priest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou shalt make a plate of pure gold,.... It was, as Jarchi says, two fingers broad, and reached from ear to ear, and so Maimonides (f); it is sometimes called the holy crown, and the plate of the holy crown, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", this was a priestly crown, for priests were very honourable and dignified persons, especially the high priest among the Jews; and even among the Gentiles it was common for their kings to be priests: and though this crown may denote the kingly power of Christ, yet as residing in him who is a priest, for he is a priest on his throne, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so may signify the conjunction of the kingly and priestly offices in Christ, who has a crown of pure gold given him by his Father, and put upon him, and by his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and being of pure gold, holy, and on the forehead, as this plate was, may signify the purity and holiness of Christ's kingdom and office, the glory, visibility, and perpetuity of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and grave upon it, like the engravings of a signet, HOLINESS TO THE LORD; which words were written either in two lines, or in one. If in two, Maimonides (g) says, the word \"holiness\" was above, and to \"the Lord\" below: but it might be written in one line, and that seems most likely: he also says the letters were protuberant, or stood out; but then they would not be graved like the engravings of a signet, in which the letters or figures are engraved within, but like the impressions of a signet made on wax, or other things: in this the high priest was a type of Christ, who is holy in himself, in his person, in both his natures, divine and human, in his offices of prophet, priest, and King; and he is holiness itself, the most holy, essentially, infinitely, and perfectly so, as angels and men are not, and the source and spring of holiness to others: and he is holiness to the Lord for his people; he is so representatively; as their covenant head he has all grace in his hands for them, and they have it in him; this is sanctification in Christ, and is by virtue of union to him, and is complete and perfect, and the cause of holiness in his people; and he is so by imputation. The holiness of his human nature was not a mere qualification for his office, or only exemplary to us, but is with his obedience and sufferings imputed to us for justification. Moreover, Christ has by his blood sanctified his people, or made atonement for them, and procured the cleansing of them from their sins, or the expiation of them; and he is also the efficient cause of their internal holiness by his Spirit, without which there is no seeing God, 1 Corinthians 6:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and grave upon it, like the engravings of a signet, HOLINESS TO THE LORD; which words were written either in two lines, or in one. If in two, Maimonides (g) says, the word \"holiness\" was above, and to \"the Lord\" below: but it might be written in one line, and that seems most likely: he also says the letters were protuberant, or stood out; but then they would not be graved like the engravings of a signet, in which the letters or figures are engraved within, but like the impressions of a signet made on wax, or other things: in this the high priest was a type of Christ, who is holy in himself, in his person, in both his natures, divine and human, in his offices of prophet, priest, and King; and he is holiness itself, the most holy, essentially, infinitely, and perfectly so, as angels and men are not, and the source and spring of holiness to others: and he is holiness to the Lord for his people; he is so representatively; as their covenant head he has all grace in his hands for them, and they have it in him; this is sanctification in Christ, and is by virtue of union to him, and is complete and perfect, and the cause of holiness in his people; and he is so by imputation. The holiness of his human nature was not a mere qualification for his office, or only exemplary to us, but is with his obedience and sufferings imputed to us for justification. Moreover, Christ has by his blood sanctified his people, or made atonement for them, and procured the cleansing of them from their sins, or the expiation of them; and he is also the efficient cause of their internal holiness by his Spirit, without which there is no seeing God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Cele Hamikdash, c. 9. sect. 1. Vid. T. Bab. Sabbat, fol. 63. 2. & Succah, fol. 5. 1.((g) Cele Hamikdash, c. 9. sect. 1. Vid. T. Bab, Sabbat, fol. 63. 2. & Succah, fol. 5. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Cele Hamikdash, c. 9. sect. 1. Vid. T. Bab. Sabbat, fol. 63. 2. & Succah, fol. 5. 1.((g) Cele Hamikdash, c. 9. sect. 1. Vid. T. Bab, Sabbat, fol. 63. 2. & Succah, fol. 5. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And thou shalt make a plate of pure gold, and grave upon it, like the engravings of a signet, {o} HOLINESS TO THE LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And thou shalt make a plate ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "of",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " pure gold, and grave upon it, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "like",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the engravings of a signet, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " HOLINESS TO THE LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Holiness belongs to the Lord: for he is most holy, and nothing unholy may appear before him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a plate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ẓiẓ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—properly, it seems, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shining thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (usu. a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flower",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., here, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "burnished plate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in this sense only ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " besides); LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πέταλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "leaf",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", fig. a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thin plate of metal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. Polycrates ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ap.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Eus. v. 24 (a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πέταλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " worn by St John, as priest). According to tradition, the ‘plate’ was 2 fingers broad.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "HOLY TO YAHWEH",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The high priest, in virtue of his office, was brought specially near to Jehovah, and was thus specially ‘holy’ to Him. Cf., in other connexions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 27:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jos. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "BJ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " v. 5, 7), and Pseudo-Aristeas (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ap.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Swete, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Introd. to O.T. in Greek",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 536), say that the inscription was written in ‘sacred,’ or ‘holy,’ characters, by which they mean doubtless the older Hebrew characters, such as are found on old Heb. seals, as also on the Moabite stone, and in Phoen. inscriptions, before they had changed into the later ‘square’ characters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 36-38.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE MITRE. Josephus tells us that the head-dress of the high priest was \"not a conical cap, but a sort of crown, made of thick linen swathes\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ant. Jud.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 3:7, § 3). It was thus really a species of turban. The colour was white; and the only ornament on it was the gold plate, with its blue ribbon or fillet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 36.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou shalt make a plate of pure gold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The plate, though a mere ornament of the mitre, was, at once, its most conspicuous and its most significant feature. Placed directly in front, right over the forehead, and probably of burnished gold, it would attract universal attention, and catch the eye even more than the breast-plate. Its position made it \"the culminating point of the whole priestly attire\" (Kalisch) - and its inscription gave to that position extraordinary force and significance. For it taught that \"",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "holiness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "to the Lord\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the very highest crown and truest excellence of religion - that to which all ceremonial is meant to conduce - that without which all the paraphernalia of worship must ever be in God's sight a mockery. It set this truth conspicuously before the eyes, and was apt to impress it upon the hearts of all. It taught the high priest himself not to rest upon outward forms, but to aim in his own person, and teach the people to aim continually, at internal holiness. The extreme importance of this, causes the putting forward at once of the plate and its inscription before any account of the \"mitre\" is given. Exodus 28:36",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fourth article of the high priest's dress was the diadem upon his head-band. ציץ, from צוּץ to shine, a plate of pure gold, on which the words ליהוה קדשׁ, \"holiness (i.e., all holy) to Jehovah,\" were engraved, and which is called the \"crown of holiness\" in consequence, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This gold plate was to be placed upon a riband of dark-blue purple, or, as it is expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a riband of this kind was to be fastened to it, to attach it to the head-band, \"upon the fore-front (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the head-band,\" from above (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 39:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); by which we are to understand that the gold plate was placed above the lower coil of the head-band and over Aaron's forehead. The word מצנפת, from צנף to twist or coil (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is only applied to the head-band or turban of the high priest, which was made of simply byssus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and, judging from the etymology, was in the shape of a turban. This is all that can be determined with reference to its form. The diadem was the only thing about it that had any special significance. This was to be placed above (upon) Aaron's forehead, that he \"might bear the iniquity of the holy things, which the children of Israel sanctified, with regard to all their holy gifts,...as an acceptableness for them before Jehovah.\" עון נשׁא: to bear iniquity (sin) and take it away; in other words, to exterminate it by taking it upon one's self. The high priest was exalted into an atoning mediator of the whole nation; and an atoning, sin-exterminating intercession was associated with his office. The qualification for this he received from the diadem upon his forehead with the inscription, \"holiness to the Lord.\" Through this inscription, which was fastened upon his head-dress of brilliant white, the earthly reflection of holiness, he was crowned as the sanctified of the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and endowed with the power to exterminate the sin which clung to the holy offerings of the people on account of the unholiness of their nature, so that the gifts of the nation became well-pleasing to the Lord, and the good pleasure of God was manifested to the nation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: See my Archaeology i. pp. 183-4. The following are Calvin's admirable remarks: Oblationum sanctarum iniquitas tollenda et purganda fuit per sacerdotem. Frigidum est illud commentum, si quid erroris admissum est in ceremoniis, remissum fuisse sacerdotis precibus. Longius enim respicere nos oportet: ideo oblationum iniquitatem deleri a sacerdote, quia nulla oblatio, quatenus est hominis, omni vitio caret. Dictu hoc asperum est et fere παράδοξον, sanctitates ipsas esse immundas, ut venia indigeant; sed tenendum est, nihil esse sane purum, quod non aliquid labis a nobis contrahat.... Nihil Dei cultu praestantius: et tamen nihil offerre potuit populus, etiam a lege praescriptum, nisi intercedente venia, quam nonnisi per sacerdotem obtinuit.) ",
        "children": []
      }
    ]
  }
]