[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Two onyx stones.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shôham ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the Hebrews has been regarded by some as the emerald, by others as the beryl; but it is probably either the stone usually called the onyx, or that variety which is known as the sardonyx—a stone of three layers—black, white, and red. (See Joseph., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant. Jud., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "iii. 7, § 5.) Emeralds could not have been cut by any process known at the time. Onyx and sardonyx were used from a very early period, as stones for signets, both in Egypt and elsewhere.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And grave on them the names of the children of Israel.—That gem-engraving was practised from a remote antiquity both in Egypt and in Babylonia appears from the remains found in those countries. The signet cylinders of Chaldæan kings are regarded by the best Assyriologists as going back, at least, to B.C. 2,000. The signets of Egyptian monarchs reach, at any rate, to the twelfth dynasty, which is perhaps nearly as early. The hardest kinds of stone—diamond, ruby, emerald, sapphire, topaz—defied the art of the time; but stones of the second class—sard, carnelian, onyx, beryl, jasper, lapis lazuli—readily yielded to the engraver’s tools. There is no difficulty in supposing that among the Israelites were to be found persons who had been engaged in Egyptian workshops during the servitude, and were acquainted with Egyptian art in all its principal departments. The “names” to be engraved were doubtless the “tribe” names, as explained by Josephus.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And grave on them the names of the children of Israel.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—That gem-engraving was practised from a remote antiquity both in Egypt and in Babylonia appears from the remains found in those countries. The signet cylinders of Chaldæan kings are regarded by the best Assyriologists as going back, at least, to B.C. 2,000. The signets of Egyptian monarchs reach, at any rate, to the twelfth dynasty, which is perhaps nearly as early. The hardest kinds of stone—diamond, ruby, emerald, sapphire, topaz—defied the art of the time; but stones of the second class—sard, carnelian, onyx, beryl, jasper, lapis lazuli—readily yielded to the engraver’s tools. There is no difficulty in supposing that among the Israelites were to be found persons who had been engaged in Egyptian workshops during the servitude, and were acquainted with Egyptian art in all its principal departments. The “names” to be engraved were doubtless the “tribe” names, as explained by Josephus.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:6-14 This richly-wrought ephod was the outmost garment of the high priest; plain linen ephods were worn by the inferior priests. It was a short coat without sleeves, fastened close to the body with a girdle. The shoulder-pieces were buttoned together with precious stones set in gold, one on each shoulder, on which were engraven the names of the children of Israel. Thus Christ, our High Priest, presents his people before the Lord for a memorial. As Christ's coat had no seam, but was woven from the top throughout, so it was with the ephod. The golden bells on this ephod, by their preciousness and pleasant sound, well represent the good profession that the saints make, and the pomegranates the fruit they bring forth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The curious girdle ... - Rather: the band for fastening it, which is upon it, shall be of the same work, of one piece with it. This band being woven on to one of the pieces of the ephod, was passed round the body, and fastened by buttons, or strings, or some other suitable contrivance.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6-14. ephod—It was a very gorgeous robe made of byssus, curiously embroidered, and dyed with variegated colors, and further enriched with golden tissue, the threads of gold being either originally interwoven or afterwards inserted by the embroiderer. It was short—reaching from the breast to a little below the loins—and though destitute of sleeves, retained its position by the support of straps thrown over each shoulder. These straps or braces, connecting the one with the back, the other with the front piece of which the tunic was composed, were united on the shoulder by two onyx stones, serving as buttons, and on which the names of the twelve tribes were engraved, and set in golden encasements. The symbolical design of this was, that the high priest, who bore the names along with him in all his ministrations before the Lord, might be kept in remembrance of his duty to plead their cause, and supplicate the accomplishment of the divine promises in their favor. The ephod was fastened by a girdle of the same costly materials, that is, dyed, embroidered, and wrought with threads of gold. It was about a handbreadth wide and wound twice round the upper part of the waist; it fastened in front, the ends hanging down at great length (Re 1:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou shall take two onyx stones,.... called from the colour of a man's nail, which they to resemble: the Targums of Onkelos and Jonathan call them stones of beryl, and so the Syriac version; the Septuagint, stones of emerald, and the Arabic version, crystal stones: but, according to Josephus (x), they were sardonyx stones, and in which Brannius (y) thinks he was right: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and grave on them the names of the children of Israel; the names of the twelve sons of Jacob, six on one stone and six on the other, as often mentioned, for which onyx stones are very fit; and they must be very large to have so many letters graved upon them; for there is no reason to believe the initial letters of their names only were engraved, but their whole names at length. In the Museum at Dresden is an oriental onyx which cost 48,000 dollars; it is of an oval figure, and its longest diameter is almost six inches, and in such an one might easily be engraved so many names: and Wagenseil makes mention of one in the possession of the bishop of Bamberg, in which were represented Christ sitting, and teaching his twelve apostles standing round him, of which he has given the figure (z): the onyx stone being of the colour observed, was a fit emblem of Christ in his human nature, and if the sardonyx, of him in both his natures; and as the twelve tribes of Israel were a figure of the church, their names being on two stones may denote both the Jewish and Gentile churches; these being precious stones on which they were engraven, may signify how valuable the church and its members are to Christ; and being alike there, their being equally loved of God, chosen in Christ, redeemed by his blood, interested in all the blessings of his grace, and shall enjoy the same glory; and their names being there, the distinct knowledge had of them by name, and being in ouches of gold, their dignity and safety, as afterwards declared. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Ut supra. (Antiqu. l. 3. c. 7. sect. 5.) (y) De Vestitu Sacerd. Heb. l. 2. c. 18. sect. 4. p. 730. (z) Not. in Misn. Sotah, c. 9. p. 996. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Ut supra. (Antiqu. l. 3. c. 7. sect. 5.) (y) De Vestitu Sacerd. Heb. l. 2. c. 18. sect. 4. p. 730. (z) Not. in Misn. Sotah, c. 9. p. 996. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And thou shalt take two onyx stones, and grave on them the names of the children of Israel:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9–12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Two onyx stones, enclosed in filigree settings of gold, and each engraved with the names of six of the tribes of Israel, to be fixed on the top of the two shoulder-straps.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "onyx",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Two onyx stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The correctness of this rendering has been much disputed. The LXX. give ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σμάραγδος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"emeraid.\" as the Greek equivalent in the present passage, while many argue for the beryl (Winer, Rosenmuller, Bollermann), and others for the sardonyx. This last rendering has the support of Josephus and Aquila. The sardonyx is, in fact, nothing but the best kind of onyx, differing from the onyx by having three layers - black, white, and red - instead of two  - black and white - only. When large, it fetches a high price, as much as a thousand pounds having been asked for one by a dealer recently. The probability is, that it is the stone here intended. It is an excellent material for engraving. With respect to the possibility of Moses having in the congregation persons who could engrave the sardonyx, we may remark that the Egyptians cut stones quite as hard, from a date long anterior to the exodus. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Grave",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "on them the names of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the children of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Egyptian names are frequently found engraved on rings and amulets in hard stone; these rings and amulets date from the time of the twelfth dynasty. The names here intended are evidently the Israelite tribe names, which are reckoned as twelve, the double tribe of Joseph counting as one only. (Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Exodus 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Upon the shoulder-piece of the ephod two beryls (previous stones) were to be placed, one upon each shoulder; and upon these the names of the sons of Israel were to be engraved, six names upon each \"according to their generations,\" i.e., according to their respective ages, or, as Josephus has correctly explained it, so that the names of the six elder sons were engraved upon the previous stone on the right shoulder, and those of the six younger sons upon that on the left.",
        "children": []
      }
    ]
  }
]