[{"num":27,"verse":"2 Of divers vows, and the redemption of the same. 28 A thing separate from the use of man, cannot be sold nor redeemed, but remained to the Lord."},{"num":1,"verse":"Moreover, the Lord spake unto Moses, saying,"},{"num":2,"verse":"Speak unto the children of Israel, and say unto them, If any man shall make a vow of a person unto the Lord, by thy estimation,"},{"num":3,"verse":"Then thy estimation shall be thus: a male from twenty years old unto sixty years old shall be by thy estimation even fifty shekels of silver, after the shekel of the Sanctuary."},{"num":4,"verse":"But if it be a female, then thy valuation shall be thirty shekels."},{"num":5,"verse":"And from five years old to twenty years old, thy valuation shall be for the male twenty shekels, and for the female ten shekels."},{"num":6,"verse":"But from a month old unto five years old, thy price of the male shall be five shekels of silver, and thy price of the female, three shekels of silver."},{"num":7,"verse":"And from sixty years old and above, if he be a male, then thy price shall be fifteen shekels, and for the female ten shekels."},{"num":8,"verse":"But if he be poorer than thou hast esteemed him, then shall he present himself before the Priest, and the Priest shall value him, according to the ability of him that vowed, so shall the Priest value him."},{"num":9,"verse":"And if it be a beast, whereof men bring an offering unto the Lord, all that one giveth of such unto the Lord, shall be holy."},{"num":10,"verse":"He shall not alter it nor change it, a good for a bad, nor a bad for a good: and if he change beast for beast, then both this and that, which was changed for it, shall be holy."},{"num":11,"verse":"And if it be any unclean beast, of which men do not offer a sacrifice unto the Lord, he shall then present the beast before the Priest."},{"num":12,"verse":"And the Priest shall value it, whether it be good or bad: and as thou valuest it, which art the Priest, so shall it be."},{"num":13,"verse":"But if he will buy it again, then he shall give the fifth part of it more above thy valuation."},{"num":14,"verse":"¶ Also when a man shall dedicate his house to be holy unto the Lord, then the Priest shall value it, whether it be good or bad, and as the Priest shall price it, so shall the value be."},{"num":15,"verse":"But if he that sanctified it, will redeem his house, then he shall give thereto the fifth part of money more than thy estimation, and it shall be his."},{"num":16,"verse":"If also a man dedicate to the Lord any ground of his inheritance, then shalt thou esteem it according to the seed thereof, an Homer of barley seed shall be at fifty shekels of silver."},{"num":17,"verse":"If he dedicate his field immediately from the year of Jubilee, it shall be worth as thou dost esteem it."},{"num":18,"verse":"But if he dedicate his field after the Jubilee, then the Priest shall reckon him the money according to the years that remain unto the year of Jubilee, and it shall be abated by thy estimation."},{"num":19,"verse":"And if he that dedicateth it, will redeem the field, then he shall put the fifth part of the price, that thou esteemedst it at, thereunto, and it shall remain his."},{"num":20,"verse":"And if he will not redeem the field, but the Priest sell the field to another man, it shall be redeemed no more."},{"num":21,"verse":"But the field shall be holy to the Lord, when it goeth out in the Jubilee, as a field separate from common uses: the possession thereof shall be the Priest’s."},{"num":22,"verse":"If a man also dedicate unto the Lord a field which he hath bought, which is not of the ground of his inheritance,"},{"num":23,"verse":"Then the Priest shall set the price to him, as thou esteemest it, unto the year of Jubilee, and he shall give thy price the same day, as a thing holy unto the Lord."},{"num":24,"verse":"But in the year of Jubilee, the field shall return unto him, of whom it was bought: to him I say, whose inheritance the land was."},{"num":25,"verse":"And all the valuation shall be according to the shekel of the Sanctuary: a shekel containeth twenty gerahs."},{"num":26,"verse":"¶ Notwithstanding the firstborn of the beasts, because it is the Lord’s firstborn, none shall dedicate such, be it bullock, or sheep: For it is the Lord’s."},{"num":27,"verse":"But if it be an unclean beast, then he shall redeem it by thy valuation, and give the fifth part more thereto: and if it be not redeemed, then it shall be sold, according to thy estimation."},{"num":28,"verse":"Notwithstanding, nothing separate from the common use that a man doth separate unto the Lord of all that he hath (whether it be man or beast, or land of his inheritance) may be sold nor redeemed: for everything separate from the common use is most holy unto the Lord."},{"num":29,"verse":"Nothing separate from the common use, which shall be separate from man, shall be redeemed, but die the death."},{"num":30,"verse":"Also all the tithe of the land both of the seed of the ground, and of the fruit of the trees is the Lord’s: it is holy to the Lord."},{"num":31,"verse":"But if a man will redeem any of his tithe, he shall add the fifth part thereto."},{"num":32,"verse":"And every tithe of bullock, and of sheep, and of all that goeth under the rod, the tenth shall be holy unto the Lord."},{"num":33,"verse":"He shall not look if it be good or bad, neither shall he change it: else if he change it, both it, and that it was changed withal, shall be holy, and it shall not be redeemed."},{"num":34,"verse":"These are the Commandments which the Lord commanded by Moses unto the children of Israel in Mount Sinai."}]