[{"header":"Divine Appraisals"},{"num":27,"verse":"Then Adonai spoke to Moses saying, "},{"num":2,"verse":"“Speak to Bnei-Yisrael and say to them: When anyone makes a special vow to Adonai involving the valuation of persons, "},{"num":3,"verse":"then your valuation of a male from 20 years old to 60 years old should be 50 shekels of silver, after the shekel of the Sanctuary. "},{"num":4,"verse":"If it is a female, then your valuation should be 30 shekels. "},{"num":5,"verse":"If the person is from five years to 20 years old, then your valuation is to be 20 shekels for a male and ten shekels for a female. "},{"num":6,"verse":"If the person is from one month to five years old, then your valuation is to be five shekels of silver for a male and three shekels of silver for a female. "},{"num":7,"verse":"If the person is from 60 years old and upward, if it is a male, then your valuation is to be 15 shekels and for a female ten shekels. "},{"num":8,"verse":"But if he is poorer than your valuation, then he is to be set before the kohen and the kohen will set a value for him, in keeping with what the one who made the vow can afford."},{"num":9,"verse":"“Now if it is an animal that may be brought as an offering to Adonai, anything that one gives to Adonai will be holy. "},{"num":10,"verse":"He is not to replace it or exchange it, either good for bad, or bad for good. But if he does exchanges one animal for another, then both it and the one for which it is exchanged will become holy. "},{"num":11,"verse":"If it is any sort of unclean animal that may not be brought as an offering to Adonai, then he is to set that animal before the kohen. "},{"num":12,"verse":"The kohen is to evaluate it, whether it is good or bad. As the kohen values it, so it will be. "},{"num":13,"verse":"But if he would redeem it, then he is to add a fifth to its valuation."},{"num":14,"verse":"“If a man consecrates his house as holy to Adonai, then the kohen is to evaluate it, whether it is good or bad. As the kohen evaluates it, so it will stand. "},{"num":15,"verse":"If the one who dedicates it would redeem his own house, then he is to add a fifth of the money of your valuation to it, and it will become his."},{"num":16,"verse":"“If one consecrates to Adonai part of the field of his possession, then your valuation is to be in proportion to the seed to sow it: an omer of barley at 50 shekels of silver. "},{"num":17,"verse":"If he dedicates his field from the Year of Jubilee, it will stand according to your own valuation. "},{"num":18,"verse":"But if he dedicates his field after the Jubilee, then the kohen is to calculate for him the money according to the years that remain until the Year of Jubilee, with a deduction to be made from your valuation. "},{"num":19,"verse":"He who dedicated the field would ever redeem it, then he is to add a fifth of the money of your valuation to it, and it will remain his. "},{"num":20,"verse":"But if he will not redeem the field, or if he has sold the field to someone else, it may not be redeemed anymore. "},{"num":21,"verse":"But the field, when it is released in the Jubilee, will be holy to Adonai as a consecrated field. It will be owned by the kohanim."},{"num":22,"verse":"“Now if one consecrates to Adonai a field that he has bought, which is not from the fields of his possession, "},{"num":23,"verse":"then the kohen is to calculate for him the worth of your valuation up to the Year of Jubilee, and give your valuation on that day as a holy thing to Adonai. "},{"num":24,"verse":"In the Year of Jubilee the field is to return to the one from whom it was bought, to the one to whom the possession of the land belongs. "},{"num":25,"verse":"All your valuations should be according to the shekel of the Sanctuary, 20 gerahs to the shekel."},{"num":26,"verse":"“But the firstborn among animals, which is made a firstborn to Adonai, may be dedicated by anyone. Whether an ox or sheep, it belongs to Adonai. "},{"num":27,"verse":"If it is an unclean animal, then he is to buy it back according to your valuation, and add a fifth of the value to it. But if it is not redeemed, then it is to be sold according to your valuation."},{"num":28,"verse":"“Nevertheless, no devoted thing which a man sets apart from all that he has for Adonai, whether man or animal, or from the field of his possession, may be sold or redeemed. Every devoted thing is most holy to Adonai."},{"num":29,"verse":"“No one who may be set apart from men for destruction is to be ransomed. He is surely to be put to death."},{"num":30,"verse":"“All the tithe of the land whether from the seed of the land, or the fruit of the trees, belongs to Adonai, for it is holy to Adonai. "},{"num":31,"verse":"If a man redeems anything of his tithe he must add a fifth part to it. "},{"num":32,"verse":"From all the tithe of the herds or the flocks, whatever passes under the rod, a tenth will be holy to Adonai. "},{"num":33,"verse":"One is not to inquire if it is good or bad, nor exchange it. Or if he does exchange it, then both it and that for which it is exchanged will become holy, and may not be redeemed.”"},{"num":34,"verse":"These are the mitzvot which Adonai commanded Moses for Bnei-Yisrael on Mount Sinai."}]