[{"header":"The Altar for Burning Incense"},{"num":30,"verse":"“Make an altar out of acacia wood for burning incense. "},{"num":2,"verse":"Make it square—eighteen inches long and eighteen inches wide—and make it thirty-six inches high. The corners that stick out like horns must be one piece with the altar. "},{"num":3,"verse":"Cover its top, its sides, and its corners with pure gold, and put a gold strip all around the altar. "},{"num":4,"verse":"Make two gold rings beneath the gold strip on opposite sides of the altar, and slide poles through them to carry the altar. "},{"num":5,"verse":"Make the poles from acacia wood and cover them with gold. "},{"num":6,"verse":"Put the altar of incense in front of the curtain that is near the Ark of the Agreement, in front of the lid that covers that Ark. There I will meet with you."},{"num":7,"verse":"“Aaron must burn sweet-smelling incense on the altar every morning when he comes to take care of the oil lamps. "},{"num":8,"verse":"He must burn incense again in the evening when he lights the lamps, so incense will burn before the Lord every day from now on. "},{"num":9,"verse":"Do not use this altar for offering any other incense, or burnt offering, or any kind of grain offering, or drink offering. "},{"num":10,"verse":"Once a year Aaron must make the altar ready for service to God by putting blood on its corners—the blood of the animal offered to remove sins. He is to do this once a year from now on. This altar belongs completely to the Lord’s service.”"},{"header":"The Tax for the Meeting Tent"},{"num":11,"verse":"The Lord said to Moses, "},{"num":12,"verse":"“When you count the people of Israel, every person must buy back his life from the Lord so that no terrible things will happen to the people when you number them. "},{"num":13,"verse":"Every person who is counted must pay one-fifth of an ounce of silver. (This is set by using one-half of the Holy Place measure, which weighs two-fifths of an ounce.) This amount is a gift to the Lord. "},{"num":14,"verse":"Every person who is counted and is twenty years old or older must give this amount to the Lord. "},{"num":15,"verse":"A rich person must not give more than one-fifth of an ounce, and a poor person must not give less. You are paying this to the Lord to buy back your lives. "},{"num":16,"verse":"Gather from the people of Israel this money paid to buy back their lives, and spend it on things for the service in the Meeting Tent. This payment will remind the Lord that the Israelites’ lives have been bought back.”"},{"header":"The Bronze Bowl"},{"num":17,"verse":"The Lord said to Moses, "},{"num":18,"verse":"“Make a bronze bowl, on a bronze stand, for washing. Put the bowl and stand between the Meeting Tent and the altar, and put water in the bowl. "},{"num":19,"verse":"Aaron and his sons must wash their hands and feet with the water from this bowl. "},{"num":20,"verse":"Each time they enter the Meeting Tent they must wash with water so they will not die. Whenever they approach the altar to serve as priests and offer a sacrifice to the Lord by fire, "},{"num":21,"verse":"they must wash their hands and their feet so they will not die. This is a rule which Aaron and his descendants are to keep from now on.”"},{"header":"Oil for Appointing"},{"num":22,"verse":"Then the Lord said to Moses, "},{"num":23,"verse":"“Take the finest spices: twelve pounds of liquid myrrh, half that amount (that is, six pounds) of sweet-smelling cinnamon, six pounds of sweet-smelling cane, "},{"num":24,"verse":"and twelve pounds of cassia. Weigh all these by the Holy Place measure. Also take four quarts of olive oil, "},{"num":25,"verse":"and mix all these things like a perfume to make a holy olive oil. This special oil must be put on people and things to make them ready for service to God. "},{"num":26,"verse":"Put this oil on the Meeting Tent and the Ark of the Agreement, "},{"num":27,"verse":"on the table and all its dishes, on the lampstand and all its tools, and on the incense altar. "},{"num":28,"verse":"Also, put the oil on the altar for burnt offerings and on all its tools, as well as on the bowl and the stand under the bowl. "},{"num":29,"verse":"You will prepare all these things for service to God, and they will be very holy. Anything that touches these things must be holy."},{"num":30,"verse":"“Put the oil on Aaron and his sons to give them for service to me, that they may serve me as priests. "},{"num":31,"verse":"Tell the Israelites, ‘This is to be my holy olive oil from now on. It is to be put on people and things to make them ready for service to God. "},{"num":32,"verse":"Do not pour it on the bodies of ordinary people, and do not make perfume the same way you make this oil. It is holy, and you must treat it as holy. "},{"num":33,"verse":"If anyone makes perfume like it or puts it on someone who is not a priest, that person must be cut off from his people.’”"},{"header":"Incense"},{"num":34,"verse":"Then the Lord said to Moses, “Take these sweet-smelling spices: resin, onycha, galbanum, and pure frankincense. Be sure that you have equal amounts of each. "},{"num":35,"verse":"Make incense as a person who makes perfume would do. Add salt to it to keep it pure and holy. "},{"num":36,"verse":"Beat some of the incense into a fine powder, and put it in front of the Ark of the Agreement in the Meeting Tent, where I will meet with you. You must use this incense powder only for its very special purpose. "},{"num":37,"verse":"Do not make incense for yourselves the same way you make this incense. Treat it as holy to the Lord. "},{"num":38,"verse":"Whoever makes incense like this to use as perfume must be cut off from his people.”"}]