[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he said.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The reply to the implied reproof is one of impatient self-exculpation and even remonstrance. He himself (it says) had been very jealous for the Lord; yet the Lord had not been jealous for Himself, suffering this open rebellion of the people, the slaughter of His prophets, the persecution to death of the one solitary champion left. What use is there in further striving, if he is left unsupported and alone? The complaint is like that of Isaiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), “O that thou wouldest rend the heavens and come down!” The zeal for God’s glory, as imperilled by His long-suffering, is like that of Jonah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the impatience of the mysterious permission of evil, like that rebuked in the celebrated story of Abraham and the Fire-worshipper. In the Elias of the New Testament there is something of the same despondent impatience shown in the message from prison to our Lord: “Art Thou He that should come, or look we for another?”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 19:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said, I have been very jealous for the Lord of hosts — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I have not been wholly wanting to my vocation; but have executed my office with zeal for thy honour and service, and with the hazard of my life; and am fled hither, not being able to endure to see the dishonour done to thy name by their obstinate idolatry and wickedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They have thrown down thine altars — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only deserted them, and suffered them to go to decay, but, in their zeal for the worship of Baal, have wilfully demolished them. The private altars, which the prophets of the Lord had, and which good people attended who could not go up to Jerusalem, and would not worship the calves nor Baal; these separate altars, though breaking in upon the unity of the church, yet being erected and intended by those that sincerely aimed at the glory of God, and served him faithfully, God was pleased to own for his altars, as well as that at Jerusalem, and the pulling of them down is charged upon Israel as a crying sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I only am left — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of all thy prophets, who boldly and publicly plead thy cause: for the rest of thy prophets, who are not slain, hide themselves, and dare not appear to do thee service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they seek my life — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I despair of doing them any good; for, instead of receiving my testimony, they hunt for my life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:9-13 The question God put, What doest thou here, Elijah? is a reproof. It concerns us often to ask whether we are in our place, and in the way of our duty. Am I where I should be? whither God calls me, where my business lies, and where I may be useful? He complained of the people, and their obstinacy in sin; I only am left. Despair of success hinders many a good enterprise. Did Elijah come hither to meet with God? he shall find that God will meet him. The wind, and earthquake, and fire, did not make him cover his face, but the still voice did. Gracious souls are more affected by the tender mercies of the Lord, than by his terrors. The mild voice of Him who speaks from the cross, or the mercy-seat, is accompanied with peculiar power in taking possession of the heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I, even I only, am left - The same statement as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the sense is different. There Elijah merely said that he alone remained to execute the prophet's office, which was true; here he implies that he is the only prophet left alive, whereas a hundred had been saved by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Kings ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Ki 19:4-18. He Is Comforted by an Angel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4-18. went a day's journey into the wilderness—on the way from Beer-sheba to Horeb—a wide expanse of sand hills, covered with the retem (not juniper, but broom shrubs), whose tall and spreading branches, with their white leaves, afford a very cheering and refreshing shade. His gracious God did not lose sight of His fugitive servant, but watched over him, and, miraculously ministering to his wants, enabled him, in a better but not wholly right frame of mind, by virtue of that supernatural supply, to complete his contemplated journey. In the solitude of Sinai, God appeared to instruct him. \"What doest thou here, Elijah?\" was a searching question addressed to one who had been called to so arduous and urgent a mission as his. By an awful exhibition of divine power, he was made aware of the divine speaker who addressed him; his attention was arrested, his petulance was silenced, his heart was touched, and he was bid without delay return to the land of Israel, and prosecute the Lord's work there. To convince him that an idolatrous nation will not be unpunished, He commissions him to anoint three persons who were destined in Providence to avenge God's controversy with the people of Israel. Anointing is used synonymously with appointment (Jud 9:8), and is applied to all named, although Jehu alone had the consecrated oil poured over his head. They were all three destined to be eminent instruments in achieving the destruction of idolaters, though in different ways. But of the three commissions, Elijah personally executed only one; namely, the call of Elisha to be his assistant and successor [1Ki 19:19], and by him the other two were accomplished (2Ki 8:7-13; 9:1-10). Having thus satisfied the fiery zeal of the erring but sincere and pious prophet, the Lord proceeded to correct the erroneous impression under which Elijah had been laboring, of his being the sole adherent of the true religion in the land; for God, who seeth in secret, and knew all that were His, knew that there were seven thousand persons who had not done homage (literally, \"kissed the hand\") to Baal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have been very jealous for the Lord God of hosts; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I have not been wholly wanting to my vocation, but have executed my office with zeal for God’s honour and service, and with the hazard of my own life; and am fled hither, not being able to endure to see the dishonour done to thy name by their obstinate idolatry and wickedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thrown down thine altars; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those which were erected for thy worship in high places, which they did not destroy because they were to be abolished by thy command, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Deu 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but out of mere contempt and opposition against thee, and therefore they suffered the altars of Baal to stand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I only am left, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, of all thy prophets, I mean, which do boldly and publicly plead thy cause; for the rest of thy prophets who are not slain hide themselves, and dare not appear to do thee any service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They seek my life to take it away:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I despair of doing them any good; for instead of receiving my testimony, they hunt for my life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said, I have been jealous for the Lord God of hosts,.... Through zeal for the glory of God he had slain four hundred and fifty prophets of Baal, and this had stirred up the malice and revenge of Jezebel against him, who sought his life, and which had obliged him to flee, and come to this place for shelter; this is the first part of his answer, others follow: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the children of Israel have forsaken thy covenant; the law, especially the two first commandments delivered in this very place; and therefore he could hope for no protection from them, but was forced to leave his country: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thrown down thy altars: which had been built in times past for the worship of God, to sacrifice thereon to him, but were now demolished, that those that would not bow the knee to Baal, and could not go to Jerusalem, might make no use of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and slain thy prophets with the sword; which was done by Jezebel, the Israelites conniving at it, and consenting to it, and not daring to oppose her; slain all she had knowledge of, or even were known by the prophet: hence it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I, even I only am left, and they seek my life to take it away: all this Elijah said, as it seems, not only to excuse himself for fleeing, and taking up his abode where he was, but to stir up the indignation of God against Israel for their idolatries and murders, and to put him upon inflicting his judgments on them for the same. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I, even I only am left, and they seek my life to take it away: all this Elijah said, as it seems, not only to excuse himself for fleeing, and taking up his abode where he was, but to stir up the indignation of God against Israel for their idolatries and murders, and to put him upon inflicting his judgments on them for the same. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said, I have {e} been very jealous for the LORD God of hosts: for the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I, even I only, am left; and they seek my life, to take it away.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he said, I have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " been very jealous for the LORD God of hosts: for the children of Israel have forsaken thy covenant, thrown down thine altars, and slain thy prophets with the sword; and I, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I only, am left; and they seek my life, to take it away.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) He complains that the more zealous he was to maintain God's glory, the more cruelly he was persecuted.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have been very jealous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] There is no boastfulness in these words. Elijah only opens his grief, and sets forth that he has done his utmost, but that, in spite of all, both king and people are still unrepentant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have forsaken thy covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For ‘thy covenant’ the LXX. reads, in this verse but not in 14, ‘Thee.’ The portion of the covenant here referred to is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘Thou shalt have none other gods but Me.’ So forsaking the covenant is the same as forsaking God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thrown down thine altars",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Elijah’s language here implies that acceptable sacrifices had been offered to God in more places than one. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the altar of Carmel is called ‘the altar of the Lord that was broken down.’ And there were probably many similar ones.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slain thy prophets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The people appear to have assented to such acts of Jezebel and her agents as are mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Elijah also immediately includes them with Jezebel as seeking his life to take it away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I only, am left",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Elijah speaks according to his own knowledge. No one had stood with him on Carmel. His words on that occasion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are the same as here.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Elijah’s reply seems to indicate that he saw nothing more which could be done, and for this reason had sought solitude and refuge in flight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said, I have been very jealous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which the prophet may have had in his mind. But the jealousy of Phinehas was in harmony with that of God (ver. 13)] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for the Lord God of hosts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [\"The title of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Lord God of hosts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is first heard in the mouth of Elijah the prophet, who had been very jealous for Jehovah in opposition to Baal and Ashtaroth [Ash-toreth?] the Phoenician deifies; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'Baal, the sun, and moon, and planets, and all the host of heaven'\" (Wordsworth)]: ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for the children of Israel have forsaken thy covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [he had memories of the covenant all around him], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thrown down thine altars",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. It is clear that many altars, similar to that on Carmel, had been built, and had been overturned], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and slain thy prophets with the sword",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [If the \"hundred prophets\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " escaped, of which we cannot be certain, others did not]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and I, even I only, am left",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [See note on 1 Kings 18:22. It must be confessed that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "prima facie",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " view is that the prophets had been well nigh exterminated. But we must take into account the deep despondency with which Elijah spoke, and remember the correction which his words received (ver. 18)]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "they seek my life, to take it away.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The commentators are hopelessly divided as to the spirit and temper with which these words were spoken. Bahr, as before, is very positive that there is no complaint or murmuring against God on Elijah's part. He contends that the prophet has been led to Sinai simply by the earnest longing for a disclosure concerning the dealings of God, and for instructions as to his future conduct; and this view has the support of other weighty authorities. But it is extremely difficult to resist the conclusion that we have here at the least a \"tacit reproof that God had looked on so quietly for such a length of time, and had suffered things to come to such an extremity\" (Keil).  St. Paul speaks of him as pleading with God ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "against Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐντυγχάνει τῷ θεῷ κατὰ τοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἰσραὴλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), said certainly represents the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χρηματισμός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he received as a connection. And the idea which this verse, taken in connexion with the prophet's flight (ver. 3) and his prayer (ver. 4), leaves on the unbiassed mind certainly is that in his zeal for God he resented not only the growing corruption of the age, but above all the frustration of his efforts to stay it. What burdened and vexed his righteous soul was that in the very hour of victory, when the people had confessed that Jehovah alone was God, he, the one solitary witness for the truth, should be driven from his post to escape as best he might, and to leave the covenant people to the baneful influence of Jezebel and her army of false prophets. It is the cry which we hear over and over again in the Old Testament, the complaint of the silence and apparent indifference of God, of the persecution of the righteous, and the impunity of evil doers.] 1 Kings 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elijah answered: \"I have striven zealously for Jehovah the God of hosts, for the children of Israel have forsaken Thy covenant, destroyed Thine altars, and killed Thy prophets with the sword; and I only am left, and they seek my life.\" In these words there was not only the greatest despair expressed as to the existing condition of things, but also a carnal zeal which would gladly have called down the immediate vengeance of the Almighty upon all idolaters. The complaint contained, on the one hand, the tacit reproof that God had looked on quietly for so long a time at the conduct of the ungodly, and had suffered things to come to such an extremity, that he, His prophet, was the only one left of all the true worshippers of God, and, on the other hand, the indirect appeal that He would interpose at last with His penal judgments. Because Elijah had not seen the expected salutary fruits of his zeal for the Lord, he thought that all was lost, and in his gloomy state of mind overlooked what he had seen a short time before with his own eyes, that even in the neighbourhood of the king himself there lived a pious and faithful worshipper of Jehovah, viz., Obadiah, who had concealed a hundred prophets from the revenge of Jezebel, and that the whole of the people assembled upon Carmel had given glory to the Lord, and at his command had seized the prophets of Baal and put them to death, and therefore that the true worshippers of the Lord could not all have vanished out of Israel. קנּא קנּאתי ליהוה recalls to mind the zeal of Phinehas (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), which put an end to the whoredom of the sons of Israel with the daughters of Moab. But whereas Phinehas received the promise of an everlasting priesthood for his zeal, Elijah had seen so little fruit from his zeal against the worshippers of Baal, that they actually sought his life. מזבּחתך are altars, which pious Israelites in the kingdom of the ten tribes had built in different places for the worship of Jehovah (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]