[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Amos 5:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore will I cause you to go into captivity beyond Damascus, saith the Lord, whose name is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Ye shall be removed further from your own country, than when Hazael, king of Syria, carried away so many Israelites captives to Damascus, (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and consequently shall have less hopes of returning home. The king of Assyria carried the ten tribes captive as far as Media, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore St. Stephen, in the passage above quoted, expressing rather the sense than the words, reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will carry you away beyond Babylon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Media being at a much greater distance than Babylon. Both readings imply, that the captivity of the ten tribes would be far worse than that of the two remaining, and likely to be of much longer duration. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:18-27 Woe unto those that desire the day of the Lord's judgments, that wish for times of war and confusion; as some who long for changes, hoping to rise upon the ruins of their country! but this should be so great a desolation, that nobody could gain by it. The day of the Lord will be a dark, dismal, gloomy day to all impenitent sinners. When God makes a day dark, all the world cannot make it light. Those who are not reformed by the judgments of God, will be pursued by them; if they escape one, another stands ready to seize them. A pretence of piety is double iniquity, and so it will be found. The people of Israel copied the crimes of their forefathers. The law of worshipping the Lord our God, is, Him only we must serve. Professors thrive so little, because they have little or no communion with God in their duties. They were led captive by Satan into idolatry, therefore God caused them to go into captivity among idolaters.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore - (And) this being so, such having been their way from the beginning until now, will I cause you to go into captivity beyond Damascus Syria was the most powerful enemy by whom God had heretofore chastened them ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From Syria He had recently, for the time, delivered them, and had given Damascus into their hands ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That day of grace had been wasted, and they were still rebellious. Now God would bring against them a mightier enemy. Damascus, the scene of their triumph, should be their pathway to captivity. God would \"cause\" them \"to go into captivity,\" not to \"Damascus,\" from where they might have easily returned, but \"beyond\" it, as He did, \"into the cities of the Medes.\" But Israel had, up to the time of Amos and beyond it, no enemy, no war, \"beyond Damascus.\" Jehu had probably paid tribute to Shalmanubar king of Assyria, to strengthen himself . The Assyrian monarch had warred against Israel's enemies, and seemingly received some check from them (see the note above at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Against Israel he had shown no hostility. But for the conspiracy of one yet to be born in private life, one of the captains of Israel who by murder, became its sovereign, it might have continued on in its own land. The Assyrian monarchs needed tribute, not slaves; nor did they employ Israel as slaves. Exile was but a wholesale imprisonment of the nation in a large but safe prison-house. Had they been still, they were more profitable to Assyria, as tributaries in their own land. There was no temptation to remove them, when Amos prophesied. The temptation came with political intrigues which had not then commenced. The then Assyrian monarch, Shamasiva, defeated their enemies the Syrians, united with and aiding the Babylonians ; \"they\" had then had no share in the opposition to Assyria, but lay safe in their mountain-fastness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It has been said , \"Although the kingdom of Israel had, through Jeroboam, recovercd its old borders, yet careless insolence, luxury, unrighteousness, \"must\" bring the destruction of the kingdom which the prophet foretells. The prophet does but dimly forebode the superior power of Assyria.\" Solomon had declared the truth, \"Righteousness exalteth a nation, but sin is a reproach to any people\" Proverbs 14:34. But there are many sorts of decay. Decay does not involve the transportation of a people. Nay, decay would not bring it, but the contrary. A mere luxurious people rots on its own soil, and would be left to rot there. It was the little remnant of energy, political cabaling, warlike spirit, in Israel, which brought its ruin from man. Idolatry, \"insolence, luxury, unrighteousness,\" bring down the displeasure of God, not of man. Yet Amos foretold, that God would bring the destruction through man.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It has been said , \"Although the kingdom of Israel had, through Jeroboam, recovercd its old borders, yet careless insolence, luxury, unrighteousness, \"must\" bring the destruction of the kingdom which the prophet foretells. The prophet does but dimly forebode the superior power of Assyria.\" Solomon had declared the truth, \"Righteousness exalteth a nation, but sin is a reproach to any people\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 14:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But there are many sorts of decay. Decay does not involve the transportation of a people. Nay, decay would not bring it, but the contrary. A mere luxurious people rots on its own soil, and would be left to rot there. It was the little remnant of energy, political cabaling, warlike spirit, in Israel, which brought its ruin from man. Idolatry, \"insolence, luxury, unrighteousness,\" bring down the displeasure of God, not of man. Yet Amos foretold, that God would bring the destruction through man.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They were, too, no worse than their neighbors, nor so bad; not so bad as the Assyrians themselves, except that, God having revealed Himself to them, they had more light. The sin then, the punishment the mode of punishment, belong to the divine revelation. Such sins and worse have existed in Christian nations. They were in part sins directly against God. God reserves to Himself, how and when He will punish. He has annexed no such visible laws of punishment to a nation's sins that man could, of his own wisdom or observation of God's ways, foresee it. They through whom Itc willed to inflict it, and whom Amos pointed out, were not provoked by \"those\" sins. There was no connection between Israel's present sins, and Assyria's future vengeance. No Eastern despot cares for the oppressions of his subjects, so that his own tribute is collected. See the whole range of Muslim rule now. As far too as we know, neither Assyria nor any other power had hitherto punished rebellious nations by transporting them ; and certainly Israel had not yet rebelled, or meditated rebellion. He only who controls the rebellious wills of people, and through their self-will works out His own all-wise Will and man's punishment, could know the future of Israel and Assyria, and how through the pride of Assyria He would bring down the pride of Samaria.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It has been well said by a thoughtful observer of the world's history, \"Whosoever attempts to prophesy, not being inspired, is a fool.\" We English know our own sins, many and grievous; we know of a vast reign of violence, murder, blasphemy, theft, uncleanness, covetousness, dishonest dealing, unrighteousness, and of the breach of every commandment of God: we know well  now of an instrument in God's Hands, not far off; like the Assyrian, but within two hours of our coast; armaments have been collected; a harbor is being formed; our own coast openly examined; iron-sheeted vessels prepared; night-signals provided; some of our own alienated population organized; with a view to our invasion. We recognize the likelihood of the invasion, fortify our coast, arm, not as a profession, but for security. Our preparations testify, how widespread is our expectation. No one scarcely doubts that it will be.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet who dare predict the issue? Will God permit that scourge to come? Will he prevail? What would be the extent of our sufferings or loss? How would our commerce or our Empire be impaired? Would it be dismembered? Since no man can affirm anything as to this which is close at hand, since none of us would dare to affirm in God's Name, in regard to any one stage of all this future, that this or that would or would not happen, then let people have at least the modesty of the magicians of Egypt, and seeing in God's prophets those absolute predictions of a future, such as their own wisdom, under circumstances far more favorable, could not dare to make, own; \"This is the finger of God\" Exodus 8:19. Not we alone. We see all Europe shaken; we see powers of all sorts, heaving to and fro; we see the Turkish power ready to dissolve, stayed up, like a dead man, only by un-Christian jealousies of Christians. Some things we may partially guess at.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet who dare predict the issue? Will God permit that scourge to come? Will he prevail? What would be the extent of our sufferings or loss? How would our commerce or our Empire be impaired? Would it be dismembered? Since no man can affirm anything as to this which is close at hand, since none of us would dare to affirm in God's Name, in regard to any one stage of all this future, that this or that would or would not happen, then let people have at least the modesty of the magicians of Egypt, and seeing in God's prophets those absolute predictions of a future, such as their own wisdom, under circumstances far more favorable, could not dare to make, own; \"This is the finger of God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Not we alone. We see all Europe shaken; we see powers of all sorts, heaving to and fro; we see the Turkish power ready to dissolve, stayed up, like a dead man, only by un-Christian jealousies of Christians. Some things we may partially guess at.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But with all our means of knowing what passes everywhere, with all our knowledge of the internal impulses of nations, hearing, as we do, almost every pulse which beats in the great European system, knowing the diseases which, here and there, threaten convulsion or dissolution, no one dare stake his human wisdom on any absolute prediction, like these of the shepherd of Tekoa as to Damascus (see the note above at Amos 1:5. pp. 160, 161) and Israel. To say the like in God's Name, unless inspired, we should know to be blasphemy. God Himself set the alternative before men. \"Let all the nations be gathered together, and let the people be assembled; who among them that can declare this, and show former things? Let them bring forth their witnesses, that they may be justified; or let them hear, and say,\" It is \"truth\" Isaiah 43:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But with all our means of knowing what passes everywhere, with all our knowledge of the internal impulses of nations, hearing, as we do, almost every pulse which beats in the great European system, knowing the diseases which, here and there, threaten convulsion or dissolution, no one dare stake his human wisdom on any absolute prediction, like these of the shepherd of Tekoa as to Damascus (see the note above at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". pp. 160, 161) and Israel. To say the like in God's Name, unless inspired, we should know to be blasphemy. God Himself set the alternative before men. \"Let all the nations be gathered together, and let the people be assembled; who among them that can declare this, and show former things? Let them bring forth their witnesses, that they may be justified; or let them hear, and say,\" It is \"truth\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Stephen, in quoting this prophecy, substitutes, Babylon for Damascus, as indeed \"the cities of the Medes\" were further than Babylon. Perhaps he set the name, in order to remind them, that as God had brought Abraham \"out of the land of the Chaldeans\" Acts 7:4, leaving the idols which his \"fathers\" had \"served\" Joshua 24:14, to serve God only, so they, serving idols, were carried back, from where Abraham had come, forfeiting, with the faith of Abraham, the promises made to Abraham; aliens and outcasts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Stephen, in quoting this prophecy, substitutes, Babylon for Damascus, as indeed \"the cities of the Medes\" were further than Babylon. Perhaps he set the name, in order to remind them, that as God had brought Abraham \"out of the land of the Chaldeans\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", leaving the idols which his \"fathers\" had \"served\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to serve God only, so they, serving idols, were carried back, from where Abraham had come, forfeiting, with the faith of Abraham, the promises made to Abraham; aliens and outcasts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Saith the Lord, the Lord of hosts - The Lord of the heavenly hosts for whose worship they forsook God; the Lord of the hosts on earth, whose ministry He employs to punish those who rebel against Him , \"For He hath many hosts to execute His judgments, the hosts of the Assyrians, the Medes and Persians, the Greeks and Romans.\" All creatures in heaven and in earth are, as He says of the holy Angels, \"ministers of His, that do His pleasure\" Psalm 103:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Saith the Lord, the Lord of hosts - The Lord of the heavenly hosts for whose worship they forsook God; the Lord of the hosts on earth, whose ministry He employs to punish those who rebel against Him , \"For He hath many hosts to execute His judgments, the hosts of the Assyrians, the Medes and Persians, the Greeks and Romans.\" All creatures in heaven and in earth are, as He says of the holy Angels, \"ministers of His, that do His pleasure\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. beyond Damascus—In Ac 7:43 it is \"beyond Babylon,\" which includes beyond Damascus. In Amos' time, Damascus was the object of Israel's fear because of the Syrian wars. Babylon was not yet named as the place of their captivity. Stephen supplies this name. Their place of exile was in fact, as he states, \"beyond Babylon,\" in Halah and Habor by the river Gozan, and in the cities of the Medes (2Ki 17:6; compare here Am 1:5; 4:3; 6:14). The road to Assyria lay through \"Damascus.\" It is therefore specified, that not merely shall they be carried captives to Damascus, as they had been by Syrian kings (2Ki 10:32, 33; 13:7), but, beyond that, to a region whence a return was not so possible as from Damascus. They were led captive by Satan into idolatry, therefore God caused them to go captive among idolaters. Compare 2Ki 15:29; 16:9; Isa 8:4, whence it appears Tiglath-pileser attacked Israel and Damascus at the same time at Ahaz' request (Am 3:11).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for all your idolatry and other sins in which you have obstinately continued, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will I cause you to go into captivity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " you shall certainly be subdued and captivated; and this shall be done so that my hand shall appear evidently in it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Beyond Damascus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into Assyria, and into parts beyond Damascus: it is not certain into what corners of the world they were sent, but probably to those parts that lay about the Caspian Sea, more remote from their own country than ever to hope they may get back again. Or thus, You shall be carried into a captivity more grievous by Shalmaneser, than was the captivity of those whom Tiglathpileser led captive when he slew Resin, took Damascus, and wasted Israel in the days of Pekah, when some Israelites were carried captives; but this shall be a more grievous captivity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore will I cause you to go into captivity beyond Damascus,.... The chief city of Syria; and which, as Aben Ezra says, lay to the east of the land of Israel, and was a very strong and fortified place: and Syria being in alliance with Israel, the Israelites might think of fleeing thither for refuge, in the time of their distress; but they are here told that they should be taken captive, and be carried to places far more remote than that: Stephen says, \"beyond Babylon\"; as they were, for they were carried into Media, to Halah and Habor by the river of Gozan, to the cities of the Medes; their way to which lay through Syria and Babylon; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saith the Lord, whose name is the God of hosts; and therefore is able to do what he threatens; and it might be depended upon it would be certainly done, as it is clear, beyond all contradiction, it has been done; see 2 Kings 17:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saith the Lord, whose name is the God of hosts; and therefore is able to do what he threatens; and it might be depended upon it would be certainly done, as it is clear, beyond all contradiction, it has been done; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore will I cause you to go into captivity beyond Damascus, saith the LORD, whose name is The God of hosts.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The consequence of their continued alienation from God should be deportation to a foreign land, beyond Damascus, far away from the confines of the country once their own possession (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), thus dimly denoting As. syria, at that time not hostile, but known in the time of Tiglath-Pileser I. (see the accomplishment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). St. Stephen says (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"beyond Babylon;\" \"Magis enim,\" observes Jerome, \"intelligentiam quam verbum posuit;\" and he is probably blending other prophecies with that of Amos, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Amos 5:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is attached in an adversative sense: \"To me (Jehovah) ye have offered no sacrifices, but ye have borne,\" etc. The opposition between the Jehovah-worship which they suspended, and the idol-worship which they carried on, is so clearly expressed in the verbs הגּשׁתּם and נשׂאתם, which correspond to one another, that the idea is precluded at once as altogether untenable, that \"Amo 5:26 refers to either the present or future in the form of an inference drawn from the preceding verse: therefore do ye (or shall ye) carry the hut of your king,\" etc. Moreover, the idea of the idols being carried into captivity, which would be the meaning of נשׂא in that case, is utterly foreign to the prophetical range of thought. It is not those who go into captivity who carry their gods away with them; but the gods of a vanquished nation are carried away by the conquerors (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To give a correct interpretation to this difficult verse, which has been explained in various ways from the very earliest times, it is necessary, above all things, to bear in mind the parallelism of the clauses. Whereas in the first half of the verse the two objects are connected together by the copula ו (ואת), the omission of both את and the copula ו before כּוכב indicates most obviously that כּוכב אלהיכם does not introduce a third object in addition to the two preceding ones, but rather that the intention is to define those objects more precisely; from which it follows still further, that סכּוּת מלכּכם and כּיּוּן צלמיכם do not denote two different kinds of idolatry, but simply two different forms of the very same idolatry. The two ἁπ. λεγ. sikkūth and kiyyūn are undoubtedly appellatives, notwithstanding the fact that the ancient versions have taken kiyyūn as the proper name of a deity. This is required by the parallelism of the members; for צלמיכם stands in the same relation to כיון as מלככם to סכות. The plural צלמיכם, however, cannot be in apposition to the singular כיון (kiyyūn, your images), but must be a genitive governed by it: \"the kiyyūn of your images.\" And in the same way מלככם is the genitive after סכות: \"the sikkūth of your king.\" Sikkūth has been taken in an appellative sense by all the ancient translators. The lxx and Symm. render it τὴν σκηνήν; the Peshito, Jerome, and the Ar. tentorium. The Chaldee has retained sikkūth. The rendering adopted by Aquila, συσκιασμός, is etymologically the more exact; for sikkūth, from סכך, to shade, signifies a shade or shelter, hence a covering, a booth, and is not to be explained either from sâkhath, to be silent, from which Hitzig deduces the meaning \"block,\" or from the Syriac and Chaldee word סכתא, a nail or stake, as Rosenmller and Ewald suppose. כּיּוּן, from כּוּן, is related to כּן, basis (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and מכונה, and signifies a pedestal or framework. The correctness of the Masoretic pointing of the word is attested by the kiyyūn of the Chaldee, and also by צלמיכם, inasmuch as the reading כּיון, which is given in the lxx and Syr., requires the singular צלמכם, which is also given in the Syriac. צלמים are images of gods, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 11:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words כּוכב אל which follow are indeed also governed by נשׂאתם; but, as the omission of ואת clearly shows, the connection is only a loose one, so that it is rather to be regarded as in apposition to the preceding objects in the sense of \"namely, the star of your god;\" and there is no necessity to alter the pointing, as Hitzig proposes, and read כּוכב, \"a star was your god,\" although this rendering expresses the sense quite correctly. כּוכב אלהיכם is equivalent to the star, which is your god, which ye worship as your god (for this use of the construct state, see Ges. 116, 5). By the star we have to picture to ourselves not a star formed by human hand as a representation of the god, nor an image of a god with the figure of a star upon its head, like those found upon the Ninevite sculptures (see Layard). For if this had been what Amos meant, he would have repeated the particle ואת before כּוכב. The thought is therefore the following: the king whose booth, and the images whose stand they carried, were a star which they had made their god, i.e., a star-deity (אשׁר refers to אלהיכם, not to כּוכב). This star-god, which they worshipped as their king, they had embodied in tselâmı̄m. The booth and the stand were the things used for protecting and carrying the images of the star-god.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sikkūth was no doubt a portable shrine, in which the image of the deity was kept. Such shrines (ναΐ́σκοι) were used by the Egyptians, according to Herodotus (ii. 63) and Diodorus Sic. (i.:97): they were \"small chapels, generally gilded and ornamented with flowers and in other ways, intended to hold a small idol when processions were made, and to be carried or driven about with it\" (Drumann, On the Rosetta Inscription, p. 211). The stand on which the chapel was placed during these processions was called παστοφόριον (Drumann, p. 212); the bearers were called ἱεραφόροι or παστοφόροι (D. p. 226). This Egyptian custom explains the prophet's words: \"the hut of your king, and the stand of your images,\" as Hengstenberg has shown in his Dissertations on the Pentateuch, vol. i. p. 161), and points to Egypt as the source of the idolatry condemned by Amos. This is also favoured by the fact, that the golden calf which the Israelites worshipped at Sinai was an imitation of the idolatry of Egypt; also by the testimony of the prophet Ezekiel (Ezekiel 20:7.), to the effect that the Israelites did not desist even in the wilderness from the abominations of their eyes, namely the idols of Egypt; and lastly, by the circumstance that the idea of there being any allusion in the words to the worship of Moloch or Saturn is altogether irreconcilable with the Hebrew text, and cannot be historically sustained,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Sikkūth was no doubt a portable shrine, in which the image of the deity was kept. Such shrines (ναΐ́σκοι) were used by the Egyptians, according to Herodotus (ii. 63) and Diodorus Sic. (i.:97): they were \"small chapels, generally gilded and ornamented with flowers and in other ways, intended to hold a small idol when processions were made, and to be carried or driven about with it\" (Drumann, On the Rosetta Inscription, p. 211). The stand on which the chapel was placed during these processions was called παστοφόριον (Drumann, p. 212); the bearers were called ἱεραφόροι or παστοφόροι (D. p. 226). This Egyptian custom explains the prophet's words: \"the hut of your king, and the stand of your images,\" as Hengstenberg has shown in his Dissertations on the Pentateuch, vol. i. p. 161), and points to Egypt as the source of the idolatry condemned by Amos. This is also favoured by the fact, that the golden calf which the Israelites worshipped at Sinai was an imitation of the idolatry of Egypt; also by the testimony of the prophet Ezekiel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), to the effect that the Israelites did not desist even in the wilderness from the abominations of their eyes, namely the idols of Egypt; and lastly, by the circumstance that the idea of there being any allusion in the words to the worship of Moloch or Saturn is altogether irreconcilable with the Hebrew text, and cannot be historically sustained,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This explanation of the words is simply founded upon the rendering of the lxx: καὶ ἀνελάβετε τὴν σκηνὴν τοῦ Μολόχ καὶ τὸ ἄστρον τοῦ Θεοῦ ὑμῶν Ῥαιφάν, τοὺς τύπους οὓς ἐποιήσατε ἑαυτοῖς. These translators, therefore, have not only rendered מלכּכם erroneously as Μολόχ, but have arbitrarily twisted the other words of the Hebrew text. For the Hebrew reading מלככם is proved to be the original one, not only by the τοῦ βασιλέως ὑμῶν of Symm. and Theod., but also by the Μαλχόμ of Aquila and the malkūm of the Peshito; and all the other ancient translators enter a protest against the displacing of the other words. The name Ῥαιφάν (Ῥηφαν), or Ῥεμφάν (Acts 7:43), however, owes its origin simply to the false reading of the unpointed כיון as ריפן, inasmuch as in the old Hebrew writings not only is כ similar to ר, but ו is also similar to פ; and in 2 Samuel 22:12, where חשׁרת־מים is rendered σκοτός (i.e., חשׁכת) ὑδάτων, we have an example of the interchange of כ and ר. There was no god Rephan or Rempha; for the name never occurs apart from the lxx. The statement made in the Arabico-Coptic list of planets, edited by Ath. Kircher, that Suhhel (the Arabic name of Saturn) is the same as Ῥηφάν, and the remark found in a Coptic MS on the Acts of the Apostles, \"Rephan deus temporis,\" prove nothing more than that Coptic Christians supposed the Rephan or Remphan, whose name occurred in their version of the Bible which was founded upon the lxx, to be the star Saturn as the god of time; but they by no means prove that the ancient Egyptians called Saturn Rephan, or were acquainted with any deity of that name, since the occurrence of the Greek names Υλια and Σελινη for sun and moon are a sufficient proof of the very recent origin of the list referred to. It is true that the Peshito has also rendered כּיּוּן by ke'wām (כּיון), by which the Syrians understood Saturn, as we may see from a passage of Ephraem Syrus, quoted by Gesenius in his Comm. on Isaiah (ii. p. 344), where this father, in his Sermones adv. haer. s. 8, when ridiculing the star-worshippers, refers to the Kevan, who devoured his own children. But no further evidence can be adduced in support of the correctness of this explanation of כּיון. The corresponding use of the Arabic Kaivan for Saturn, to which appeal has also been made, does not occur in any of the earlier Arabic writings, but has simply passed into the Arabic from the Persian; so that the name and its interpretation originated with the Syrian church, passing thence to the Persians, and eventually reaching the Arabs through them. Consequently the interpretation of Kevan by Saturn has no higher worth than that of an exegetical conjecture, which is not elevated into a truth by the fact that כיון is mentioned in the Cod. Nazar. i. p. 54, ed. Norb., in connection with Nebo, Bel, and Nerig ( equals  Nergal). With the exception of these passages, and the gloss of a recent Arabian grammarian cited by Bochart, viz., \"Keivan signifies Suhhel,\" not a single historical trace can be found of Kevan having been an ancient oriental name of Saturn; so that the latest supporter of this hypothesis, namely Movers (Phnizier, i. p. 290), has endeavoured to prop up the arguments already mentioned in his own peculiar and uncritical manner, by recalling the Phoenician and Babylonian names, San-Choniâth, Kyn-el-Adan, and others. Not even the Graeco-Syrian fathers make any reference to this interpretation. Theodoret cannot say anything more about Μολόχ καὶ Ῥεφάν, than that they were εἰδώλων ὀνόματα; and Theod. Mops. has this observation on Ῥεμφάν: φασὶ δὲ τὸν ἑωσφόρον οὕτω κατὰ τὴν Ἑβραίων γλῶτταν. It is still very doubtful, therefore, whether the Alexandrian and Syrian translators of Amos really supposed Ῥαιφάν and כּיון to signify Saturn; and this interpretation, whether it originated with the translators named, or was first started by later commentators upon these versions, arose in all probability simply from a combination of the Greek legend concerning Saturn, who swallowed his own children, and the Moloch who was worshipped with the sacrifice of children, and therefore might also be said to devour children; that is to say, it was merely an inference drawn from the rendering of מלככם as Μολόχ. But we are precluded from thinking of Moloch-worship, or regarding מלככם, \"your king,\" as referring to Moloch, by the simple circumstance that כּוכב אלהיכם unquestionably points to the Sabaean (sidereal) character of the worship condemned by Amos, whereas nothing is known of the sidereal nature of Moloch; and even if the sun is to be regarded as the physical basis of their deity, as Mnter, Creuzer, and others conjecture, it is impossible to discover the slightest trace in the Old Testament of any such basis as this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: This explanation of the words is simply founded upon the rendering of the lxx: καὶ ἀνελάβετε τὴν σκηνὴν τοῦ Μολόχ καὶ τὸ ἄστρον τοῦ Θεοῦ ὑμῶν Ῥαιφάν, τοὺς τύπους οὓς ἐποιήσατε ἑαυτοῖς. These translators, therefore, have not only rendered מלכּכם erroneously as Μολόχ, but have arbitrarily twisted the other words of the Hebrew text. For the Hebrew reading מלככם is proved to be the original one, not only by the τοῦ βασιλέως ὑμῶν of Symm. and Theod., but also by the Μαλχόμ of Aquila and the malkūm of the Peshito; and all the other ancient translators enter a protest against the displacing of the other words. The name Ῥαιφάν (Ῥηφαν), or Ῥεμφάν (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), however, owes its origin simply to the false reading of the unpointed כיון as ריפן, inasmuch as in the old Hebrew writings not only is כ similar to ר, but ו is also similar to פ; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where חשׁרת־מים is rendered σκοτός (i.e., חשׁכת) ὑδάτων, we have an example of the interchange of כ and ר. There was no god Rephan or Rempha; for the name never occurs apart from the lxx. The statement made in the Arabico-Coptic list of planets, edited by Ath. Kircher, that Suhhel (the Arabic name of Saturn) is the same as Ῥηφάν, and the remark found in a Coptic MS on the Acts of the Apostles, \"Rephan deus temporis,\" prove nothing more than that Coptic Christians supposed the Rephan or Remphan, whose name occurred in their version of the Bible which was founded upon the lxx, to be the star Saturn as the god of time; but they by no means prove that the ancient Egyptians called Saturn Rephan, or were acquainted with any deity of that name, since the occurrence of the Greek names Υλια and Σελινη for sun and moon are a sufficient proof of the very recent origin of the list referred to. It is true that the Peshito has also rendered כּיּוּן by ke'wām (כּיון), by which the Syrians understood Saturn, as we may see from a passage of Ephraem Syrus, quoted by Gesenius in his Comm. on Isaiah (ii. p. 344), where this father, in his Sermones adv. haer. s. 8, when ridiculing the star-worshippers, refers to the Kevan, who devoured his own children. But no further evidence can be adduced in support of the correctness of this explanation of כּיון. The corresponding use of the Arabic Kaivan for Saturn, to which appeal has also been made, does not occur in any of the earlier Arabic writings, but has simply passed into the Arabic from the Persian; so that the name and its interpretation originated with the Syrian church, passing thence to the Persians, and eventually reaching the Arabs through them. Consequently the interpretation of Kevan by Saturn has no higher worth than that of an exegetical conjecture, which is not elevated into a truth by the fact that כיון is mentioned in the Cod. Nazar. i. p. 54, ed. Norb., in connection with Nebo, Bel, and Nerig ( equals  Nergal). With the exception of these passages, and the gloss of a recent Arabian grammarian cited by Bochart, viz., \"Keivan signifies Suhhel,\" not a single historical trace can be found of Kevan having been an ancient oriental name of Saturn; so that the latest supporter of this hypothesis, namely Movers (Phnizier, i. p. 290), has endeavoured to prop up the arguments already mentioned in his own peculiar and uncritical manner, by recalling the Phoenician and Babylonian names, San-Choniâth, Kyn-el-Adan, and others. Not even the Graeco-Syrian fathers make any reference to this interpretation. Theodoret cannot say anything more about Μολόχ καὶ Ῥεφάν, than that they were εἰδώλων ὀνόματα; and Theod. Mops. has this observation on Ῥεμφάν: φασὶ δὲ τὸν ἑωσφόρον οὕτω κατὰ τὴν Ἑβραίων γλῶτταν. It is still very doubtful, therefore, whether the Alexandrian and Syrian translators of Amos really supposed Ῥαιφάν and כּיון to signify Saturn; and this interpretation, whether it originated with the translators named, or was first started by later commentators upon these versions, arose in all probability simply from a combination of the Greek legend concerning Saturn, who swallowed his own children, and the Moloch who was worshipped with the sacrifice of children, and therefore might also be said to devour children; that is to say, it was merely an inference drawn from the rendering of מלככם as Μολόχ. But we are precluded from thinking of Moloch-worship, or regarding מלככם, \"your king,\" as referring to Moloch, by the simple circumstance that כּוכב אלהיכם unquestionably points to the Sabaean (sidereal) character of the worship condemned by Amos, whereas nothing is known of the sidereal nature of Moloch; and even if the sun is to be regarded as the physical basis of their deity, as Mnter, Creuzer, and others conjecture, it is impossible to discover the slightest trace in the Old Testament of any such basis as this.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Alexandrian translation of this passage, which we have thus shown to rest upon a misinterpretation of the Hebrew text, has acquired a greater importance than it would otherwise possess, from the fact that the proto-martyr Stephen, in his address (Acts 7:42-43), has quoted the words of the prophet according to that version, simply because the departure of the Greek translation from the original text was of no consequence, so far as his object was concerned, viz., to prove to the Jews that they had always resisted the Holy Ghost, inasmuch as the Alex. rendering also contains the thought, that their fathers worshipped the στρατιᾶ τοῦ οὐρανοῦ.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Alexandrian translation of this passage, which we have thus shown to rest upon a misinterpretation of the Hebrew text, has acquired a greater importance than it would otherwise possess, from the fact that the proto-martyr Stephen, in his address (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:42-43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), has quoted the words of the prophet according to that version, simply because the departure of the Greek translation from the original text was of no consequence, so far as his object was concerned, viz., to prove to the Jews that they had always resisted the Holy Ghost, inasmuch as the Alex. rendering also contains the thought, that their fathers worshipped the στρατιᾶ τοῦ οὐρανοῦ.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "whereas star-worship, or at any rate the worship of the sun, was widely spread in Egypt from the very earliest times. According to the more recent investigations into the mythology of the ancient Egyptians which have been made by Lepsius (Transactions of the Academy of Science at Berlin, 1851, p. 157ff.), \"the worship of the sun was the oldest kernel and most general principle of the religious belief of Egypt;\" and this \"was regarded even down to the very latest times as the outward culminating point of the whole system of religion\" (Lepsius, p. 193). The first group of deities of Upper and Lower Egypt consists of none but sun-gods (p. 188).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It is true, that in the first divine sphere Ra occupies the second place according to the Memphitic doctrine, namely, after Phtha (Hephaestos), and according to the Theban doctrine, Amen (Ἄμων). Mentu and Atmu stand at the head (Leps. p. 186); but the two deities, Mentu, i.e., the rising sun, and Atmu, i.e., the setting sun, are simply a splitting up of Ra; and both Hephaestos and Amon (Amon-Ra) were placed at the head of the gods at a later period (Leps. pp. 187, 189).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ra, i.e., Helios, is the prototype of the kings, the highest potency and prototype of nearly all the gods, the king of the gods, and he is identified with Osiris (p. 194). But from the time of Menes, Osiris has been worshipped in This and Abydos; whilst in Memphis the bull Apis was regarded as the living copy of Osiris (p. 191). According to Herodotus (ii. 42), Osiris and Isis were the only gods worshipped by the ancient Egyptians; and, according to Diodorus Sic. (i. 11), the Egyptians were said to have had originally only two gods, Helios and Selene, and to have worshipped the former in Osiris, the latter in Isis. The Pan of Mendes appears to have also been a peculiar form of Osiris (cf. Diod. Sic. i. 25, and Leps. p. 175). Herodotus (ii. 145) speaks of this as of primeval antiquity, and reckons it among the eight so-called first gods; and Diodorus Sic. (i. 18) describes it as διαφερόντως ὑπὸ τῶν Αἰγυπτίων τιμώμενον. It was no doubt to these Egyptian sun-gods that the star-god which the Israelites carried about with them in the wilderness belonged. This is all that can at present be determined concerning it. There is not sufficient evidence to support Hengstenberg's opinion, that the Egyptian Pan as the sun-god was the king worshipped by them. It is also impossible to establish the identity of the king mentioned by Amos with the שׂעירים in Leviticus 17:7, since these שׂעירים, even if they are connected with the goat-worship of Mendes, are not exhausted by this goat-deity.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ra, i.e., Helios, is the prototype of the kings, the highest potency and prototype of nearly all the gods, the king of the gods, and he is identified with Osiris (p. 194). But from the time of Menes, Osiris has been worshipped in This and Abydos; whilst in Memphis the bull Apis was regarded as the living copy of Osiris (p. 191). According to Herodotus (ii. 42), Osiris and Isis were the only gods worshipped by the ancient Egyptians; and, according to Diodorus Sic. (i. 11), the Egyptians were said to have had originally only two gods, Helios and Selene, and to have worshipped the former in Osiris, the latter in Isis. The Pan of Mendes appears to have also been a peculiar form of Osiris (cf. Diod. Sic. i. 25, and Leps. p. 175). Herodotus (ii. 145) speaks of this as of primeval antiquity, and reckons it among the eight so-called first gods; and Diodorus Sic. (i. 18) describes it as διαφερόντως ὑπὸ τῶν Αἰγυπτίων τιμώμενον. It was no doubt to these Egyptian sun-gods that the star-god which the Israelites carried about with them in the wilderness belonged. This is all that can at present be determined concerning it. There is not sufficient evidence to support Hengstenberg's opinion, that the Egyptian Pan as the sun-god was the king worshipped by them. It is also impossible to establish the identity of the king mentioned by Amos with the שׂעירים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", since these שׂעירים, even if they are connected with the goat-worship of Mendes, are not exhausted by this goat-deity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophet therefore affirms that, during the forty years' journey through the wilderness, Israel did not offer sacrifices to its true King Jehovah, but carried about with it a star made into a god as the king of heaven. If, then, as has already been observed, we understand this assertion as referring to the great mass of the people, like the similar passage in Isaiah 43:23, it agrees with the intimations in the Pentateuch as to the attitude of Israel. For, beside the several grosser outbreaks of rebellion against the Lord, which are the only ones recorded at all circumstantially there, and which show clearly enough that it was not devoted to its God with all its heart, we also find traces of open idolatry. Among these are the command in Leviticus 17, that every one who slaughtered a sacrificial animal was to bring it to the tabernacle, when taken in connection with the reason assigned, namely, that they were not to offer their sacrifices any more to the Se‛ı̄rı̄m, after which they went a whoring (Amos 5:7), and the warning in Deuteronomy 4:19, against worshipping the sun, moon, and stars, even all the host of heaven, from which we may infer that Moses had a reason for this, founded upon existing circumstances. After this further proof of the apostasy of Israel from its God, the judgment already indicated in Amos 5:24 is still further defined in Amos 5:27 as the banishment of the people far beyond the borders of the land given to it by the Lord, where higlâh evidently points back to yiggal in Amos 5:24. מהלאה ל, lit., \"from afar with regard to,\" i.e., so that when looked at from Damascus, the place showed itself afar off, i.e., according to one mode of viewing it, \"far beyond Damascus.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophet therefore affirms that, during the forty years' journey through the wilderness, Israel did not offer sacrifices to its true King Jehovah, but carried about with it a star made into a god as the king of heaven. If, then, as has already been observed, we understand this assertion as referring to the great mass of the people, like the similar passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it agrees with the intimations in the Pentateuch as to the attitude of Israel. For, beside the several grosser outbreaks of rebellion against the Lord, which are the only ones recorded at all circumstantially there, and which show clearly enough that it was not devoted to its God with all its heart, we also find traces of open idolatry. Among these are the command in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that every one who slaughtered a sacrificial animal was to bring it to the tabernacle, when taken in connection with the reason assigned, namely, that they were not to offer their sacrifices any more to the Se‛ı̄rı̄m, after which they went a whoring (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the warning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", against worshipping the sun, moon, and stars, even all the host of heaven, from which we may infer that Moses had a reason for this, founded upon existing circumstances. After this further proof of the apostasy of Israel from its God, the judgment already indicated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is still further defined in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the banishment of the people far beyond the borders of the land given to it by the Lord, where higlâh evidently points back to yiggal in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". מהלאה ל, lit., \"from afar with regard to,\" i.e., so that when looked at from Damascus, the place showed itself afar off, i.e., according to one mode of viewing it, \"far beyond Damascus.\" ",
            "children": []
          }
        ]
      }
    ]
  }
]