[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am God, the God of thy father.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am the El, the Elohim of thy father. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is the last revelation given to Jacob, nor is any other supernatural event recorded until the vision of the burning bush (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is brief, clear, and decisive, and every clause is weighty. Jacob is to migrate into Egypt, his race is to grow there into a nation, so that the stay there would be long; God’s presence and blessing will accompany and remain with them, and finally will bring them back to the promised land. For himself, too, there is the promise that Joseph will tend his sick bed and be with him at his death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 46:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am God, the God of thy father — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "True to the covenant made with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fear not to go down into Egypt — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems though Jacob, upon the first intelligence of Joseph’s life and glory in Egypt, resolved, without any hesitation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will go and see him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yet, upon second thoughts, he saw difficulties in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " st, He was one hundred and thirty years old; it was a long journey, and he was unfit to travel. 2d, He feared lest his sons should be tainted with the idolatry of Egypt, and forget the God of their fathers. 3d, Probably he thought of what God had said to Abraham concerning the bondage and affliction of his seed. 4th, He could not think of laying his bones in Egypt. But whatever his discouragements were, this was enough to answer them all, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fear not to go down into Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:1-4 Even as to those events and undertakings which appear most joyful, we should seek counsel, assistance, and a blessing from the Lord. Attending on his ordinances, and receiving the pledges of his covenant love, we expect his presence, and that peace which it confers. In all removals we should be reminded of our removal out of this world. Nothing can encourage us to fear no evil when passing through the valley of the shadow of death, but the presence of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob arriving at Beer-sheba is encouraged by a revelation from God. Beer-sheba may be regarded as the fourth scene of Abraham's abode in the land of promise. \"Offered sacrifices.\" He had gathered from the words of the Lord to Abraham ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the way in which the dreams of Joseph were realized in the events of Providence, that his family were to descend into Egypt. He felt therefore, that in taking this step he was obeying the will of Heaven. Hence, he approaches God in sacrifices at an old abode of Abraham and Isaac, before he crosses the border to pass into Egypt. On this solemn occasion God appears to him in the visions of the night. He designates himself EL the Mighty, and the God of his father. The former name cheers him with the thought of an all-sufficient Protector. The latter identifies the speaker with the God of his father, and therefore, with the God of eternity, of creation, and of covenant. \"Fear not to go down into Mizraim.\" This implies both that it was the will of God that he should go down to Egypt, and that he would be protected there. \"A great nation.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jacob had now a numerous family, of whom no longer one was selected, but all were included in the chosen seed. He had received the special blessing and injunction to be fruitful and multiply Genesis 28:3; Genesis 35:11. The chosen family is to be the beginning of the chosen nation. \"I will go down with thee.\" The \"I\" is here emphatic, as it is also in the assurance that he will bring him up in the fullness of time from Egypt. If Israel in the process of growth from a family to a nation had remained among the Kenaanites, he would have been amalgamated with the nation by intermarriage, and conformed to its vices. By his removal to Egypt he is kept apart from the demoralizing influence of a nation, whose iniquity became so great as to demand a judicial extirpation Genesis 15:16. He is also kept from sinking into an Egyptian by the fact that a shepherd, as he was, is an abomination to Egypt; by his location in the comparatively high land of Goshen, which is a border land, not naturally, but only politically, belonging to Egypt; and by the reduction of his race to a body of serfs, with whom that nation would not condescend to intermingle. \"Joseph shall put his hand upon thine eyes.\" His long-lost son shall be present to perform the last offices to him when deceased.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jacob had now a numerous family, of whom no longer one was selected, but all were included in the chosen seed. He had received the special blessing and injunction to be fruitful and multiply ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The chosen family is to be the beginning of the chosen nation. \"I will go down with thee.\" The \"I\" is here emphatic, as it is also in the assurance that he will bring him up in the fullness of time from Egypt. If Israel in the process of growth from a family to a nation had remained among the Kenaanites, he would have been amalgamated with the nation by intermarriage, and conformed to its vices. By his removal to Egypt he is kept apart from the demoralizing influence of a nation, whose iniquity became so great as to demand a judicial extirpation ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He is also kept from sinking into an Egyptian by the fact that a shepherd, as he was, is an abomination to Egypt; by his location in the comparatively high land of Goshen, which is a border land, not naturally, but only politically, belonging to Egypt; and by the reduction of his race to a body of serfs, with whom that nation would not condescend to intermingle. \"Joseph shall put his hand upon thine eyes.\" His long-lost son shall be present to perform the last offices to him when deceased.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. I will there make of thee a great nation—How truly this promise was fulfilled, appears in the fact that the seventy souls who went down into Egypt increased [Ex 1:5-7], in the space of two hundred fifteen years, to one hundred eighty thousand.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Here were many causes of fear; lest he should do evil in forsaking the promised and blessed land, and going to a place which had been incommodious to his grandfather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 12:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and forbidden to his father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 26:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; lest he should expose his children to manifold perils, as of being infected with the vices, and particularly the idolatry, which reigned there above all other countries, and of being inveigled by the pleasantness and eminent fruitfulness of that soil, to give up themselves to all manner of pleasures, and to settle themselves there, and give over all thoughts of returning to Canaan, and of being brought into that grievous bondage and affliction which was spoken of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 15:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and lest some mischief should befall him or his in so long and dangerous a journey. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said, I am God, the God of thy father,.... His father Isaac, who was now dead, and who is the rather mentioned, because in him Abraham's seed was to be called, and in his line the promise both of the land of Canaan, and of the Messiah, ran, and from him Jacob received the blessing; and this might be a confirmation of it to him, in that Jehovah calls himself his God; he first declares himself to be his God, and so able to perform whatever he should promise him, and his father's God, who would show him favour, as he had to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fear not to go down into Egypt; Jacob might have many fears arise in his mind about this journey, as interpreters generally observe; as lest it should not be agreeable to the will of God, since his father Isaac was forbidden to go into Egypt, when in like circumstances with him, Genesis 26:1; as well as he, might fear it would be too great a journey for him in his old age, some evil would befall him, or he die by the way and not see his son; or lest going with his family thither, and there continuing for some time, they might be tempted with the pleasantness and fruitfulness of the land, and settle there, and forget and neglect the promised land of Canaan; and especially lest they should be drawn into the idolatry of the Egyptians, and forsake the worship of the true God; and very probably he might call to mind the prophecy delivered to Abraham, of his seed being strangers and servants, and afflicted in a land not theirs for the space of four hundred years, Genesis 15:13; and Jacob might fear this step he was now taking would bring on, as indeed it did, the completion of this prediction, by which his offspring would be oppressed and diminished. The Targum of Jonathan makes this to be Jacob's principal fear;\"fear not to go down into Egypt, because of the business of the servitude decreed with Abraham;''as also he might fear his going thither might seem to be a giving up his title to, and expectation of the promised land: to remove which fears the following is said: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "fear not to go down into Egypt; Jacob might have many fears arise in his mind about this journey, as interpreters generally observe; as lest it should not be agreeable to the will of God, since his father Isaac was forbidden to go into Egypt, when in like circumstances with him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; as well as he, might fear it would be too great a journey for him in his old age, some evil would befall him, or he die by the way and not see his son; or lest going with his family thither, and there continuing for some time, they might be tempted with the pleasantness and fruitfulness of the land, and settle there, and forget and neglect the promised land of Canaan; and especially lest they should be drawn into the idolatry of the Egyptians, and forsake the worship of the true God; and very probably he might call to mind the prophecy delivered to Abraham, of his seed being strangers and servants, and afflicted in a land not theirs for the space of four hundred years, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Jacob might fear this step he was now taking would bring on, as indeed it did, the completion of this prediction, by which his offspring would be oppressed and diminished. The Targum of Jonathan makes this to be Jacob's principal fear;\"fear not to go down into Egypt, because of the business of the servitude decreed with Abraham;''as also he might fear his going thither might seem to be a giving up his title to, and expectation of the promised land: to remove which fears the following is said: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for I will there make of thee a great nation: as he did; for though in process of time his seed were greatly afflicted here, yet the more they were afflicted, the more they multiplied; and their increase in Egypt was vastly greater than it had been in a like space of time before; for in the space of two hundred fifteen years before their descent into Egypt, they were become no more than seventy persons, whereas in the like number of years in Egypt, they became 600,000, besides children; see Genesis 46:27 Exodus 12:37. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I will there make of thee a great nation: as he did; for though in process of time his seed were greatly afflicted here, yet the more they were afflicted, the more they multiplied; and their increase in Egypt was vastly greater than it had been in a like space of time before; for in the space of two hundred fifteen years before their descent into Egypt, they were become no more than seventy persons, whereas in the like number of years in Egypt, they became 600,000, besides children; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said, I am God, the God of thy father: fear not to go down into Egypt; for I will there make of thee a great nation:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “I am the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Êl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” the name occurring in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 33:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". LXX does not translate it. The Lat. gives ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fortissimus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It seems especially to be used of the Divine Being, the true God of Revelation, who had manifested Himself to Abraham and to Isaac.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fear not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These and the following words seem to indicate the reason of Jacob’s prayer and sacrifice at Beer-sheba. He needed reassurance at the thought of leaving his home and settling in Egypt in his old age.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jacob’s family was to grow into a great people while they were still in Egypt (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:13-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said, I am God, the God of thy father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I am the El",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Mighty One), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Elohim of thy father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though in consequence of this phrase the section (vers. 1-7), indeed the entire chapter, is usually assigned to the Elohist (Tuch, Bleek, Vaihinger), yet the contents of this theophany are felt to be so substantially Jehovistic in their import (Hengstenberg), that certain critics have been constrained to give verses 1-5 to the Jehovist (Colenso), or, omitting the last clause of ver. 5, to the redactor (Davidson). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the designation used is \"I am Jehovah, the God of Abraham thy father.\" As on that former occasion when setting out for Padanaram, so now, when departing for Egypt, he receives a comforting assurance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Fear not to go down into Egypt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Them was reason for Jacob's apprehensions, since Abraham had been in peril in the land of the Pharaohs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:14-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Isaac had been forbidden to go thither (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Egypt had been foreshadowed as a place of servitude for his descendants (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מֵרְדָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is an irregular infinitive ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רֵדָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רֶדֶת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "דֵּעַה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "דַּעַת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מִן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". prefixed after a verb of fearing (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ewald's 'Hebrews Synt.,' § 336). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For I will there make of thee a great nation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for to a great nation will I put thee there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jacob had previously received the injunction, accompanied by the Divine benediction, to be fruitful and multiply (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Twice over had it previously been predicted that he should develop into a multitudinous people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The present promise was an indication that the fulfillment of the prophecy was at band. Genesis 46:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Here God appeared to him in a vision of the night (מראת, an intensive plural), and gave him, as once before on his flight from Canaan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), the comforting promise, \"I am האל (the Mighty One), the God of thy father: fear not to go down into Egypt (מרדה for מרדת, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " דּעה for דּעת, cf. Ges. 69, 3, Anm. 1); for I will there make thee a great nation. I will go down with thee into Egypt, and I-- bring thee up again also will I, and Joseph shall close thine eyes.\" גּם־עלה an inf. abs. appended emphatically (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); according to Ges. inf. Kal.",
        "children": []
      }
    ]
  }
]