[{"header":"God Remains Faithful"},{"num":3,"verse":"Then what’s the advantage of being a Jew? Is there any value in the ceremony of circumcision?"},{"num":2,"verse":"Yes, there are great benefits! First of all, the Jews were entrusted with the whole revelation of God."},{"num":3,"verse":"True, some of them were unfaithful; but just because they were unfaithful, does that mean God will be unfaithful?"},{"num":4,"verse":"Of course not! Even if everyone else is a liar, God is true. As the Scriptures say about him, "},{"num":5,"verse":"“But,” some might say, “our sinfulness serves a good purpose, for it helps people see how righteous God is. Isn’t it unfair, then, for him to punish us?” (This is merely a human point of view.)"},{"num":6,"verse":"Of course not! If God were not entirely fair, how would he be qualified to judge the world?"},{"num":7,"verse":"“But,” someone might still argue, “how can God condemn me as a sinner if my dishonesty highlights his truthfulness and brings him more glory?”"},{"num":8,"verse":"And some people even slander us by claiming that we say, “The more we sin, the better it is!” Those who say such things deserve to be condemned."},{"header":"All People Are Sinners"},{"num":9,"verse":"Well then, should we conclude that we Jews are better than others? No, not at all, for we have already shown that all people, whether Jews or Gentiles, are under the power of sin."},{"num":10,"verse":"As the Scriptures say,"},{"num":19,"verse":"Obviously, the law applies to those to whom it was given, for its purpose is to keep people from having excuses, and to show that the entire world is guilty before God."},{"num":20,"verse":"For no one can ever be made right with God by doing what the law commands. The law simply shows us how sinful we are."},{"header":"Christ Took Our Punishment"},{"num":21,"verse":"But now God has shown us a way to be made right with him without keeping the requirements of the law, as was promised in the writings of Moses and the prophets long ago."},{"num":22,"verse":"We are made right with God by placing our faith in Jesus Christ. And this is true for everyone who believes, no matter who we are."},{"num":23,"verse":"For everyone has sinned; we all fall short of God’s glorious standard."},{"num":24,"verse":"Yet God, in his grace, freely makes us right in his sight. He did this through Christ Jesus when he freed us from the penalty for our sins."},{"num":25,"verse":"For God presented Jesus as the sacrifice for sin. People are made right with God when they believe that Jesus sacrificed his life, shedding his blood. This sacrifice shows that God was being fair when he held back and did not punish those who sinned in times past,"},{"num":26,"verse":"for he was looking ahead and including them in what he would do in this present time. God did this to demonstrate his righteousness, for he himself is fair and just, and he makes sinners right in his sight when they believe in Jesus."},{"num":27,"verse":"Can we boast, then, that we have done anything to be accepted by God? No, because our acquittal is not based on obeying the law. It is based on faith."},{"num":28,"verse":"So we are made right with God through faith and not by obeying the law."},{"num":29,"verse":"After all, is God the God of the Jews only? Isn’t he also the God of the Gentiles? Of course he is."},{"num":30,"verse":"There is only one God, and he makes people right with himself only by faith, whether they are Jews or Gentiles."},{"num":31,"verse":"Well then, if we emphasize faith, does this mean that we can forget about the law? Of course not! In fact, only when we have faith do we truly fulfill the law."}]