[{"header":"The First Children: Cain and Abel"},{"num":4,"verse":"The man was intimate with Eve, his wife. She conceived and gave birth to Cain. She said, “I have gotten a man with the Lord.” "},{"num":2,"verse":"She also gave birth to Cain’s brother Abel."},{"num":3,"verse":"As time passed, one day Cain brought an offering to the Lord from the fruit of the soil. "},{"num":4,"verse":"Abel also brought some of the firstborn of his flock and their fat portions. The Lord looked favorably on Abel and his offering, "},{"num":5,"verse":"but he did not look favorably on Cain and his offering. Cain was very angry, and his face showed it."},{"num":6,"verse":"The Lord said to Cain, “Why are you angry? Why do you have that angry look on your face? "},{"num":7,"verse":"If you do good, will you not be lifted up? If you do not do good, sin is crouching at the door. It has a strong desire for you, but you must rule over it.”"},{"num":8,"verse":"Cain said to Abel, his brother, “Let’s go into the field.” When they were in the field, Cain attacked Abel, his brother, and killed him."},{"num":9,"verse":"The Lord said to Cain, “Where is Abel, your brother?”"},{"num":10,"verse":"The Lord said, “What have you done? The voice of your brother’s blood is crying to me from the soil. "},{"num":11,"verse":"Now you are cursed and sent away from the soil which has opened its mouth to receive your brother’s blood from your hand. "},{"num":12,"verse":"When you work the soil, it will no longer give its strength to you. You shall be a fugitive and a wanderer on the earth.”"},{"num":13,"verse":"Cain said to the Lord, “My punishment is too great for me to bear. "},{"num":14,"verse":"Look, today you have driven me away from the soil. I will be hidden from your face, and I will be a fugitive and a wanderer on the earth. And whoever finds me will kill me.”"},{"num":15,"verse":"The Lord said to him, “No! If anyone kills Cain, he will face sevenfold revenge.” And the Lord appointed a sign for Cain, so that anyone who found him would not strike him down."},{"header":"The Descendants of Cain"},{"num":16,"verse":"Cain went out from the Lord’s presence and lived in the land of Nod, east of Eden."},{"num":17,"verse":"Cain was intimate with his wife. She conceived and gave birth to Enoch. Cain built a city and named the city after his son Enoch. "},{"num":18,"verse":"To Enoch, Irad was born. Irad became the father of Mehujael. Mehujael became the father of Methushael. Methushael became the father of Lamech."},{"num":19,"verse":"Lamech took two wives. The name of one was Adah, and the name of the other was Zillah. "},{"num":20,"verse":"Adah gave birth to Jabal, who was the predecessor of those who dwell in tents and have livestock. "},{"num":21,"verse":"His brother’s name was Jubal, who was the predecessor of all who play the lyre and flute. "},{"num":22,"verse":"Zillah also gave birth to Tubal Cain, who made all kinds of tools and weapons from bronze and iron. Tubal Cain’s sister was Na’amah."},{"header":"The Family Line of Seth"},{"num":25,"verse":"Adam was intimate with his wife again. She gave birth to a son and named him Seth, because she said, “God has set another child in place of Abel for me, since Cain killed him.” "},{"num":26,"verse":"Later a son was born to Seth, and he named him Enosh. This is when people began to proclaim the name of the Lord."}]