[{"num":4,"verse":"Then Adam had sexual intercourse with Eve his wife, and she conceived and gave birth to a son, Cain (meaning “I have created”). For, as she said, “With God’s help, I have created a man!” "},{"num":2,"verse":"Her next child was his brother, Abel."},{"num":3,"verse":"At harvest time Cain brought the Lord a gift of his farm produce, "},{"num":4,"verse":"and Abel brought the fatty cuts of meat from his best lambs, and presented them to the Lord. And the Lord accepted Abel’s offering, "},{"num":5,"verse":"but not Cain’s. This made Cain both dejected and very angry, and his face grew dark with fury."},{"num":6,"verse":"“Why are you angry?” the Lord asked him. “Why is your face so dark with rage? "},{"num":7,"verse":"It can be bright with joy if you will do what you should! But if you refuse to obey, watch out. Sin is waiting to attack you, longing to destroy you. But you can conquer it!”"},{"num":8,"verse":"One day Cain suggested to his brother, “Let’s go out into the fields.” And while they were together there, Cain attacked and killed his brother."},{"num":9,"verse":"But afterwards the Lord asked Cain, “Where is your brother? Where is Abel?”"},{"num":10,"verse":"But the Lord said, “Your brother’s blood calls to me from the ground. What have you done? "},{"num":11,"verse":"You are hereby banished from this ground which you have defiled with your brother’s blood. "},{"num":12,"verse":"No longer will it yield crops for you, even if you toil on it forever! From now on you will be a fugitive and a tramp upon the earth, wandering from place to place.”"},{"num":13,"verse":"Cain replied to the Lord, “My punishment is greater than I can bear. "},{"num":14,"verse":"For you have banished me from my farm and from you, and made me a fugitive and a tramp; and everyone who sees me will try to kill me.”"},{"num":15,"verse":"The Lord replied, “They won’t kill you, for I will give seven times your punishment to anyone who does.” Then the Lord put an identifying mark on Cain as a warning not to kill him. "},{"num":16,"verse":"So Cain went out from the presence of the Lord and settled in the land of Nod, east of Eden."},{"num":17,"verse":"Then Cain’s wife conceived and presented him with a baby son named Enoch; so when Cain founded a city, he named it Enoch, after his son."},{"num":18,"verse":"Enoch was the father of Irad; Irad was the father of Mehujael; Mehujael was the father of Methusael; Methusael was the father of Lamech."},{"num":19,"verse":"Lamech married two wives—Adah and Zillah. "},{"num":20,"verse":"To Adah was born a baby named Jabal. He became the first of the cattlemen and those living in tents. "},{"num":21,"verse":"His brother’s name was Jubal, the first musician—the inventor of the harp and flute. "},{"num":22,"verse":"To Lamech’s other wife, Zillah, was born Tubal-cain. He opened the first foundry forging instruments of bronze and iron."},{"num":23,"verse":"One day Lamech said to Adah and Zillah, “Listen to me, my wives. I have killed a youth who attacked and wounded me. "},{"num":24,"verse":"If anyone who kills Cain will be punished seven times, anyone taking revenge against me for killing that youth should be punished seventy-seven times!”"},{"num":25,"verse":"Later on Eve gave birth to another son and named him Seth (meaning “Granted”); for, as Eve put it, “God has granted me another son for the one Cain killed.” "},{"num":26,"verse":"When Seth grew up, he had a son and named him Enosh. It was during his lifetime that men first began to call themselves “the Lord’s people.”"}]