[{"header":"Why Giving is Important"},{"num":9,"verse":"I do not need to write to you any further about the ministry to the saints. "},{"num":2,"verse":"For I know how willing you are, and I boast about you to the people of Macedonia, saying that Achaia has been ready since last year, and your enthusiasm has stimulated most of them. "},{"num":3,"verse":"Now I have sent the brothers so that our boasting about you in this matter may not prove to be an idle boast, and so that you may stand ready, just as I said. "},{"num":4,"verse":"Otherwise, if any Macedonians come with me and find out that you are not ready, we would be humiliated—to say nothing of you—in this undertaking. "},{"num":5,"verse":"Therefore, I thought it necessary to urge these brothers to visit you ahead of me, to make arrangements in advance for this gift you promised, and to have it ready as something given generously and not forced."},{"num":6,"verse":"Remember this: The person who sows sparingly will also reap sparingly, and the person who sows generously will also reap generously. "},{"num":7,"verse":"Each of you must give what you have decided in your heart, not with regret or under compulsion, since God loves a cheerful giver. "},{"num":8,"verse":"Besides, God is able to make every blessing of yours overflow for you, so that in every situation you will always have all you need for any good work. "},{"num":9,"verse":"As it is written,"},{"num":10,"verse":"Now he who supplies seed to the farmer and bread to eat will also supply you with seed and multiply it and enlarge the harvest that results from your righteousness. "},{"num":11,"verse":"In every way you will grow richer and become even more generous, and this will cause others to give thanks to God because of us, "},{"num":12,"verse":"since this ministry you render is not only fully supplying the needs of the saints, it is also overflowing with more and more prayers of thanksgiving to God. "},{"num":13,"verse":"Because your service in giving proves your love, you will be glorifying God as you obey what your confession of the Messiah’s gospel demands, since you are generous in sharing with them and with everyone else. "},{"num":14,"verse":"And so in their prayers for you they will long for you because of God’s exceptional grace that was shown to you. "},{"num":15,"verse":"Thanks be to God for his indescribable gift!"}]