[{"num":9,"verse":"Now concerning the ministering to the saints, it is superfluous for me to write to you."},{"num":2,"verse":"For I know the forwardness of your thinking, for which I boast of you to those of Macedonia that Achaia was ready a year ago; and your zeal hath called forth very many."},{"num":3,"verse":"Yet I have sent the brethren, lest our boasting of you on this account should be in vain, that, as I said, ye may be ready;"},{"num":4,"verse":"lest it might happen, if those of Macedonia come with me and find you unprepared, that we (that we say not “ye”) should be ashamed in this same confident boasting."},{"num":5,"verse":"Therefore I thought it necessary to exhort the brethren to go ahead unto you and make up your bounty beforehand (whereof ye had notice beforehand), that the same might be ready as a matter of bounty, and not as of covetousness."},{"num":6,"verse":"But this I say: He who soweth sparingly shall reap also sparingly, and he who soweth bountifully shall reap also bountifully."},{"num":7,"verse":"As every man purposeth in his heart, so let him give, not grudgingly or out of compulsion; for God loveth the cheerful giver."},{"num":8,"verse":"And God is able to make all grace abound toward you, that ye, always having all sufficiency in all things, may abound in every good work."},{"num":9,"verse":"As it is written: “He hath dispersed abroad, he hath given to the poor; his righteousness remaineth for ever.”"},{"num":10,"verse":"Now may He that ministereth seed to the sower both minister bread for your food, and multiply your seed sown, and increase the fruits of your righteousness,"},{"num":11,"verse":"ye being enriched in everything to all bountifulness, which causeth through us thanksgiving to God."},{"num":12,"verse":"For the administration of this service not only supplieth the want of the saints, but is abundant also in much thanksgiving unto God,"},{"num":13,"verse":"while by the experience of this ministration they glorify God for your freely declared subjection unto the Gospel of Christ, and for your liberal distribution unto them and unto all men,"},{"num":14,"verse":"and by their prayer for you, they who long after you for the exceeding grace of God in you."},{"num":15,"verse":"Thanks be unto God for His unspeakable gift!"}]