[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 21:25-26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:25-26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Another dieth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Another wicked man, or any other man promiscuously considered, either good or bad. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the bitterness of his soul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — With heart-breaking pains and sorrows; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and never eateth with pleasure",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Hath no pleasure in his life, no, not so much as at meal-time, when men usually are most free and pleasant. So he shows there is a great variety in God’s dispensations; he distributes great prosperity to one, and great afflictions to another, according to his wise but secret counsel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall lie down alike in the dust — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "All these worldly differences are ended by death, and they lie in the grave without any distinction till the time of the general resurrection. So that no man can tell who is good and who is bad, by events which befall them in this life. And if one wicked man die in a palace, and another in a dungeon, they will meet in the congregation of the dead and damned; and the worm that dieth not, and the fire that is not quenched, will be the same to both: which makes those differences inconsiderable, and not worth perplexing ourselves about.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:17-26 Job had described the prosperity of wicked people; in these verses he opposes this to what his friends had maintained about their certain ruin in this life. He reconciles this to the holiness and justice of God. Even while they prosper thus, they are light and worthless, of no account with God, or with wise men. In the height of their pomp and power, there is but a step between them and ruin. Job refers the difference Providence makes between one wicked man and another, into the wisdom of God. He is Judge of all the earth, and he will do right. So vast is the disproportion between time and eternity, that if hell be the lot of every sinner at last, it makes little difference if one goes singing thither, and another sighing. If one wicked man die in a palace, and another in a dungeon, the worm that dies not, and the fire that is not quenched, will be the same to them. Thus differences in this world are not worth perplexing ourselves about.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His breasts - Margin, \"milk pails.\" The marginal translation is much the most correct, and it is difficult to understand why so improbable a statement has been introduced into our common version. But there has been great variety in the translation. The Vulgate renders it, Viscera ejus plena sunt adipe - \"his viscera are full of fat.\" So the Septuagint, τὰ ἔγκατα ἀυτοῦ πλήρη στέατος  ta engkata autou plērē steatos. The Syraic, \"his sides;\" Prof. Lee, \"his bottles;\" Noyes, \"his sides;\" Luther, \"sein milkfass\" - \"his milk-pail;\" Wemyss, \"the stations of his cattle;\" Good, \"his sleek skin.\" In this variety of rendering, what hope is there of ascertaining the meaning of the word? It is not easy to account for this variety, though it is clear that Jerome and the Septuagint followed a different reading from the present, and instead of עטיניו  ‛ăṭı̂ynāyv, they read בטיניו  baṭı̂ynāyv - from בטן  beṭen - \"the belly;\" and that instead of the word חלב  châlâb as at present pointed, meaning \"milk,\" they understood it as if it were pointed חלב  cheleb - meaning \"fat\" - the same letters, but different vowels.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The word which is rendered \"breast\" (עטין  ‛ăṭı̂yn) occurs nowhere else in the Hebrew Scriptures. It has become necessary, therefore, to seek its meaning in the ancient versions, and in the cognate languages. For a full examination of the word, the reader may consult Bochart, Hieroz. P. 1, Lib. ii. c. xliv., pp. 455, 458; or Rosenmuller, where the remarks of Bochart are abridged; or Lee on Job, \"in loc.\" The Chaldee renders it ביזיו, \"his breasts.\" So Junius et Tre. Piscator, and others. Among the rabbis, Moses Bar Nackman, Levi, and others, render it as denoting the breasts, or \"mulctralia\" - \"milk-vessels,\" denoting, as some have supposed, \"the lacteals.\" This idea would admirably suit the connection, but it is doubtful whether it can be maintained; and the presumption is, that it would be in advance of the knowledge of physiology in the times of Job. Aben Ezra explains it of the places where camels lie down to drink - an idea which is found in the Arabic, and which will well suit the connection.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According to this, the sense would be, that those places abounded with milk - that is, that he was prospered and happy. The Hebrew word עטין  ‛ăṭı̂yn, as has been observed, occurs nowhere else. It is supposed to be derived from an obsolete root, the same as the Arabic \"atana, to lie down around water, as cattle do;\" and then the derivative denotes a place where cattle and flocks lie down around water; and then the passage would mean, \"the resting places of his herds are full, or abound with milk.\" Yet the primary idea, according to Castell, Golius, and Lee, is that of saturating with water; softening, \"scil.\" a skin with water, or dressing a skin, for the purpose of using it as a bottle. Perhaps the word was used with reference to the place where camels came to drink, because it was a place that was \"saturated\" with water, or that abounded with water. The Arabic verb, also, according to Castell, is used in the sense of freeing a skin from wool and hairs - a lana pilisve levari pellem - so that it might be dressed for use.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From this reference to a \"skin\" thus dressed, Prof. Lee supposes that the word here means \"a bottle,\" arid that the sense is, that his bottles were full of milk; that is, that he had great prosperity and abundance. But it is very doubtful whether the word will bear this meaning, and whether it is ever used in this sense. In the instances adduced by Castell, Schultens, and even of Prof. Lee, of the use of the word, I find no one where it means \"a skin,\" or denotes a bottle made of a skin. The application of the \"verb\" to a skin is only in the sense of saturating and dressing it. The leading idea in all the forms of the word, and its common use in Arabic, is \"that of a place where cattle kneel down for the purpose of drinking,\" and then a place well watered, where a man might lead his camels and flocks to water. The noun would then come to mean a watering place - a place that would be of great value, and which a man who had large flocks and herds would greatly prize. The thought here is, therefore, that the places of this kind, in the possession of the man referred to, would abound with milk - that is, he would have abundance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Are full of milk - Milk, butter and honey, are, in the Scriptures, the emblems of plenty and prosperity. Many of the versions, however, here render this \"fat.\" The change is only in the pointing of the Hebrew word. But, if the interpretation above given be correct, then the word here means \"milk.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his bones are moistened with marrow - From the belief, that bones full of marrow are an indication of health and vigor. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his bones are moistened with marrow - From the belief, that bones full of marrow are an indication of health and vigor. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. breasts—rather, \"skins,\" or \"vessels\" for fluids [Lee]. But [Umbreit] \"stations or resting-places of his herds near water\"; in opposition to Zophar (Job 20:17); the first clause refers to his abundant substance, the second to his vigorous health.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "moistened—comparing man's body to a well-watered field (Pr 3:8; Isa 58:11).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Another; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Another wicked man. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Any other man promiscuously considered, either good or bad. So hereby he shows how indifferently and alike God deals the concerns of this life to one and another, to good and bad. So he shows that there is a great variety in God’s dispensations; that he distributes great prosperity to one, and great afflictions to another no worse than he, according to his wise but secret counsel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the bitterness of his soul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. with heart-breaking pains and sorrows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Never eateth with pleasure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. hath no pleasure in his life, no, not so much as at meal-time, when men usually are most free and pleasant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And another dieth in the bitterness of his soul,.... Either another wicked man; for there is a difference among wicked men; some are outwardly happy in life, and in the circumstances of their death, as before described; and others are very unhappy in both; their life is a scene of afflictions which embitter life, and make death eligible; and in the midst of which they die, as well as oftentimes in bitter pains, and terrible agonies of body, as well as in great distress and horror of mind, and black despair, as Judas and others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and never eateth with pleasure, or \"of any good\", or \"any good thing\" (y); either he has it not to eat, or what he has is not good, but like husks which swine eat, of which the prodigal would fain have filled his belly, when in extreme poverty, such as those words may describe; or else having what is good, has not an heart to eat of it; and so they describe a miser, living and dying such; see Ecclesiastes 6:2; or rather the case of a man, who, through distempers and diseases of body, has lost his appetite, and cannot with any pleasure taste of the richest dainties; see Job 33:20. Some (z) interpret this verse and Job 21:23 as what should be the case according to the sentiments of Job's friends, who objected, that God punished the iniquities of wicked men, not in their own persons, but in their children; according to which, a wicked man then should die in the perfection of happiness, without weakness or want, in all quietness, ease, peace, and prosperity; and not in poverty and distress: but as Job 21:23 respect a wicked man, and his case and circumstances at death, agreeably to the whole context; so this relates to those of a good man, whom the Lord often deals bitterly with in life, as he did with Naomi, and was now the case of Job; see Ruth 1:20; and who die in very poor and distressed circumstances; so that nothing is to be concluded from such appearances, with respect to the characters of men, as good or bad, and especially since both are brought into a like condition by death, as follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and never eateth with pleasure, or \"of any good\", or \"any good thing\" (y); either he has it not to eat, or what he has is not good, but like husks which swine eat, of which the prodigal would fain have filled his belly, when in extreme poverty, such as those words may describe; or else having what is good, has not an heart to eat of it; and so they describe a miser, living and dying such; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or rather the case of a man, who, through distempers and diseases of body, has lost his appetite, and cannot with any pleasure taste of the richest dainties; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some (z) interpret this verse and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as what should be the case according to the sentiments of Job's friends, who objected, that God punished the iniquities of wicked men, not in their own persons, but in their children; according to which, a wicked man then should die in the perfection of happiness, without weakness or want, in all quietness, ease, peace, and prosperity; and not in poverty and distress: but as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " respect a wicked man, and his case and circumstances at death, agreeably to the whole context; so this relates to those of a good man, whom the Lord often deals bitterly with in life, as he did with Naomi, and was now the case of Job; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and who die in very poor and distressed circumstances; so that nothing is to be concluded from such appearances, with respect to the characters of men, as good or bad, and especially since both are brought into a like condition by death, as follows. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) \"bonum\", Pagninus, Mercerus; so Junius & Tremellius, Piscator & Bar Tzemach; \"de bono\", Cocceius, Michaelis, Schultens. (z) Bar Tzemach. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) \"bonum\", Pagninus, Mercerus; so Junius & Tremellius, Piscator & Bar Tzemach; \"de bono\", Cocceius, Michaelis, Schultens. (z) Bar Tzemach. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And another {n} dieth in the bitterness of his soul, and never eateth with pleasure.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And another ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " dieth in the bitterness of his soul, and never eateth with pleasure.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) That is, the godly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A different history; cf. Job’s words of himself, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "never eateth with pleasure",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and hath not tasted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (lit. eaten) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Job 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22  Shall one teach God knowledge,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who judgeth those who are in heaven?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23  One dieth in his full strength,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Being still cheerful and free from care.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24  His troughs are full of milk,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the marrow of his bones is well watered.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25  And another dieth with a sorrowing spirit,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And hath not enjoyed wealth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26  They lie beside one another in the dust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And worms cover them both.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The question, Job 21:22, concerns the friends. Since they maintain that necessarily and constantly virtue is rewarded by prosperity, and sin by misfortune, but without this law of the divine order of the world which is maintained by them being supported by experience: if they set themselves up as teachers of God, they will teach Him the right understanding of the conduct which is to be followed by Him as a ruler and judge of men, while nevertheless He is the Absolute One, beneath whose judicial rule not merely man, but also the heavenly spirits, are placed, and to which they must conform and bow. The verb למּד, instead of being construed with two acc., as in the dependent passage Isaiah 40:14, is here construed with the dat. of the person (which is not to be judged according to Job 5:2; Job 19:3, but according to διδάσκειν τινί τι, to teach one anything, beside the other prevailing construction). With והוא a circumstantial clause begins regularly: while He, however, etc. Arnh. and Lwenth. translate: while, however, He exaltedly judges, i.e., according to a law that infinitely transcends man; but that must have been מרום (and even thus it would still be liable to be misunderstood). Hahn (whom Olsh. is inclined to support): but He will judge the proud, to which first the circumstantial clause, and secondly the parallels, Job 35:2; Job 15:15; Job 4:18 (comp. Isaiah 24:21), from which it is evident that רמים signifies the heavenly beings (as Psalm 78:69, the heights of heaven), are opposed: it is a fundamental thought of this book, which abounds in allusions to the angels, that the angels, although exalted above men, are nevertheless in contrast with God imperfect, and therefore are removed neither from the possibility of sin nor the necessity of a government which holds them together in unity, and exercises a judicial authority over them. The rule of the all-exalted Judge is different from that which the three presumptuously prescribe to Him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The question, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", concerns the friends. Since they maintain that necessarily and constantly virtue is rewarded by prosperity, and sin by misfortune, but without this law of the divine order of the world which is maintained by them being supported by experience: if they set themselves up as teachers of God, they will teach Him the right understanding of the conduct which is to be followed by Him as a ruler and judge of men, while nevertheless He is the Absolute One, beneath whose judicial rule not merely man, but also the heavenly spirits, are placed, and to which they must conform and bow. The verb למּד, instead of being construed with two acc., as in the dependent passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is here construed with the dat. of the person (which is not to be judged according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but according to διδάσκειν τινί τι, to teach one anything, beside the other prevailing construction). With והוא a circumstantial clause begins regularly: while He, however, etc. Arnh. and Lwenth. translate: while, however, He exaltedly judges, i.e., according to a law that infinitely transcends man; but that must have been מרום (and even thus it would still be liable to be misunderstood). Hahn (whom Olsh. is inclined to support): but He will judge the proud, to which first the circumstantial clause, and secondly the parallels, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 24:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), from which it is evident that רמים signifies the heavenly beings (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:69",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the heights of heaven), are opposed: it is a fundamental thought of this book, which abounds in allusions to the angels, that the angels, although exalted above men, are nevertheless in contrast with God imperfect, and therefore are removed neither from the possibility of sin nor the necessity of a government which holds them together in unity, and exercises a judicial authority over them. The rule of the all-exalted Judge is different from that which the three presumptuously prescribe to Him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The one (viz., the evil-doer) dies בּעצם תּמּו, in ipsa sua integritate, like בעצם היום, ipso illo die; the Arabic would be fı̂ ‛yn, since there the eye, here the bone (comp. Uhlemann, Syr. Gramm. 58), denote corporeality, duration, existence, and therefore identity. תּם is intended of perfect external health, as elsewhere מתם; comp. תּמימים, Proverbs 1:12. In Job 21:23 the pointing שׁלאנן (adj.) and שׁלאנן (3 praet.) are interchanged in the Codd.; the following verbal adjective favours the form of writing with Kametz. As to the form, however (which Rd. and Olsh. consider to be an error in writing), it is either a mixed form from שׁאנן and שׁלו with the blended meaning of both (Ew. 106, c), to which the comparison with שׁליו ( equals  שׁלו) is not altogether suitable, or it is formed from שׁאנן by means of an epenthesis (as זלעף from זעף, aestuare, and בלסם, βάλσαμον, from בשׂם), and of similar but intensified signification; we prefer the latter, without however denying the real existence of such mixed forms (vid., on Job 26:9; Job 33:25). This fulness of health and prosperity is depicted in Job 21:24. The ancient translators think, because the bones are mentioned in the parallel line, עטיניו must also be understood of a part of the body: lxx ἔγκατα, Jer. viscera; Targ. בּיזוי, his breasts, βυζία",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The one (viz., the evil-doer) dies בּעצם תּמּו, in ipsa sua integritate, like בעצם היום, ipso illo die; the Arabic would be fı̂ ‛yn, since there the eye, here the bone (comp. Uhlemann, Syr. Gramm. 58), denote corporeality, duration, existence, and therefore identity. תּם is intended of perfect external health, as elsewhere מתם; comp. תּמימים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the pointing שׁלאנן (adj.) and שׁלאנן (3 praet.) are interchanged in the Codd.; the following verbal adjective favours the form of writing with Kametz. As to the form, however (which Rd. and Olsh. consider to be an error in writing), it is either a mixed form from שׁאנן and שׁלו with the blended meaning of both (Ew. 106, c), to which the comparison with שׁליו ( equals  שׁלו) is not altogether suitable, or it is formed from שׁאנן by means of an epenthesis (as זלעף from זעף, aestuare, and בלסם, βάλσαμον, from בשׂם), and of similar but intensified signification; we prefer the latter, without however denying the real existence of such mixed forms (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 26:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This fulness of health and prosperity is depicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The ancient translators think, because the bones are mentioned in the parallel line, עטיניו must also be understood of a part of the body: lxx ἔγκατα, Jer. viscera; Targ. בּיזוי, his breasts, βυζία",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Handschriftliche Funde, 2. S. V.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(for Hebr. שׁדים, שׁד); Syr. version gabauh ( equals  ganbauh), his sides in regard to עטמא, Syr. ‛attmo  equals  אטמא, side, hip; Saad. audâguhu, his jugular veins, in connection with which (not, however, by this last rendering) חלב is read instead of חלב: his bowels, etc., are full of fat.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]