[{"header":"Solomon’s temple equipment"},{"num":4,"verse":"He also made a bronze altar thirty feet long, thirty feet wide, and fifteen feet high."},{"num":2,"verse":"Then he made a tank of cast metal called the Sea. It was circular in shape, fifteen feet from rim to rim, seven and a half feet high, and forty-five feet in circumference."},{"num":3,"verse":"Under the rim were two rows of oxlike figures completely encircling it, ten every eighteen inches, each cast in its mold."},{"num":4,"verse":"The Sea rested on twelve oxen with their backs toward the center, three facing north, three facing west, three facing south, and three facing east."},{"num":5,"verse":"The Sea was as thick as the width of a hand. Its rim was shaped like a cup or an open lily blossom. It could hold three thousand baths."},{"num":6,"verse":"He also made ten washbasins and put five on the south and five on the north. The items used for the entirely burned offerings were rinsed in these. The priests washed in the Sea."},{"num":7,"verse":"He made ten gold lampstands as prescribed and put them in the sanctuary, five on the south and five on the north."},{"num":8,"verse":"He also made ten tables and put them in the sanctuary, five on the south and five on the north, as well as a hundred gold bowls."},{"num":9,"verse":"He made the courtyard of the priests and the great courtyard, with doors covered with bronze for the courtyard."},{"num":10,"verse":"He placed the Sea at the southeast corner."},{"num":11,"verse":"Huram made the pots, the shovels, and the bowls. So Huram finished all his work on God’s temple for King Solomon:"},{"num":17,"verse":"The king cast them in clay molds in the Jordan Valley between Succoth and Zarethan."},{"num":18,"verse":"Due to the very large number of objects, Solomon didn’t even try to weigh the bronze."},{"num":19,"verse":"Solomon also made all the equipment for God’s temple: the gold altar; the tables for the bread of the presence;"},{"num":20,"verse":"the lampstands with their lamps, all of pure gold, to burn before the inner sanctuary as prescribed;"},{"num":21,"verse":"the flowers, the lamps, and the tongs of pure gold;"},{"num":22,"verse":"and the wick trimmers, bowls, ladles, and censers of pure gold. As for the temple entrance, the inner doors to the most holy place as well as the doors to the main hall were made of gold."}]