[{"num":4,"verse":"1 The altar of brass. 2 The molten sea. 6 The caldrons. 7 The candlesticks, etc."},{"num":1,"verse":"And he made an altar of brass twenty cubits long, and twenty cubits broad, and ten cubits high."},{"num":2,"verse":"And he made a molten Sea of ten cubits from brim to brim, round in compass, and five cubits high: and a line of thirty cubits did compass it about."},{"num":3,"verse":"And under it was the fashion of oxen, which did compass it round about, ten in a cubit compassing the Sea about: two rows of oxen were cast when it was molten."},{"num":4,"verse":"It stood upon twelve oxen: three looked toward the North, and three looked toward the West, and three looked toward the South, and three looked toward the East, and the Sea stood above upon them, and all their hinder parts were inward."},{"num":5,"verse":"And the thickness thereof was an hand breadth, and the brim thereof was like the work of the brim of a cup, with flowers of lilies: it contained three thousand baths."},{"num":6,"verse":"¶ He made also ten caldrons, and put five on the right hand, and five on the left, to wash in them, and to cleanse in them that which appertained to the burnt offerings: but the Sea was for the Priests to wash in."},{"num":7,"verse":"¶ And he made ten candlesticks of gold (according to their form) and put them in the Temple, five on the right hand, and five on the left."},{"num":8,"verse":"¶ And he made ten tables, and put them in the Temple, five on the right hand, and five on the left: and he made an hundred basins of gold."},{"num":9,"verse":"And he made the court of the Priests, and the great court and doors for the court, and overlaid the doors thereof with brass."},{"num":10,"verse":"And he set the Sea on the right side Eastward toward the South."},{"num":11,"verse":"And Huram made pots and besoms and basins, and Huram finished the work that he should make for King Solomon for the house of God,"},{"num":12,"verse":"To wit, two pillars, and the bowls and the chapiters on the top of the two pillars, and two grates to cover the two bowls of the chapiters which were upon the top of the pillars:"},{"num":13,"verse":"And four hundred pomegranates for the two grates, two rows of pomegranates for every grate to cover the two bowls of the chapiters, that were upon the pillars."},{"num":14,"verse":"He made also bases, and made caldrons upon the bases:"},{"num":15,"verse":"And a Sea, and twelve bulls under it:"},{"num":16,"verse":"Pots also and besoms, and flesh hooks, and all these vessels made Huram his father to King Solomon for the house of the Lord of shining brass."},{"num":17,"verse":"In the plain of Jordan did the King cast them in clay between Succoth and Zeredathah."},{"num":18,"verse":"And Solomon made all these vessels in great abundance: for the weight of brass could not be reckoned."},{"num":19,"verse":"And Solomon made all the vessels that were for the house of God: the golden altar also and the tables, whereon the showbread stood."},{"num":20,"verse":"Moreover, the candlesticks with their lamps, to burn them after the manner before the Oracle, of pure gold."},{"num":21,"verse":"And the flowers and the lamps, and the snuffers of gold, which was fine gold."},{"num":22,"verse":"And the hooks, and the basins, and the spoons, and the ash pans of pure gold: the entry also of the house and doors thereof within, even of the most holy place: and the doors of the house, to wit, of the Temple were of gold."}]