[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:14-19 In the fourth day's work, the creation of the sun, moon, and stars is accounted for. All these are the works of God. The stars are spoken of as they appear to our eyes, without telling their number, nature, place, size, or motions; for the Scriptures were written, not to gratify curiosity, or make us astronomers, but to lead us to God, and make us saints. The lights of heaven are made to serve him; they do it faithfully, and shine in their season without fail. We are set as lights in this world to serve God; but do we in like manner answer the end of our creation? We do not: our light does not shine before God, as his lights shine before us. We burn our Master's candles, but do not mind our Master's work.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God gave them. - The absolute giving of the heavenly bodies in their places was performed at the time of their actual creation. The relative giving here spoken of is what would appear to an earthly spectator, when the intervening veil of clouds would be dissolved by the divine agency, and the celestial luminaries would stand forth in all their dazzling splendor.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. two great lights—In consequence of the day being reckoned as commencing at sunset—the moon, which would be seen first in the horizon, would appear \"a great light,\" compared with the little twinkling stars; while its pale benign radiance would be eclipsed by the dazzling splendor of the sun; when his resplendent orb rose in the morning and gradually attained its meridian blaze of glory, it would appear \"the greater light\" that ruled the day. Both these lights may be said to be \"made\" on the fourth day—not created, indeed, for it is a different word that is here used, but constituted, appointed to the important and necessary office of serving as luminaries to the world, and regulating by their motions and their influence the progress and divisions of time.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God set them in the firmament of the heaven,.... He not only ordered that there they should be, and made them that there they might be, but he placed them there with his own hands; and they are placed, particularly the sun, at such a particular distance as to be beneficial and not hurtful: had it been set nearer to the earth, its heat would have been intolerable; and had it been further off it would have been of no use; in the one case we should have been scorched with its heat, and in the other been frozen up for the want of it. The various expressions used seem to be designed on purpose to guard against and expose the vanity of the worship of the sun and moon; which being visible, and of such great influence and usefulness to the earth, were the first the Heathens paid adoration to, and was as early as the times of Job, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and yet these were but creatures made by God, his servants and agents under him, and therefore to worship them was to serve the creature besides the Creator, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To give light upon the earth; this is repeated from Genesis 1:15 to show the end for which they were made, and set up, and the use they were to be of to the earth; being hung up like so many lamps or chandeliers, to contain and send forth light unto the earth, to the inhabitants of it, that they may see to walk and work by, and do all the business of life, as well as be warmed and comforted thereby, and the earth made fertile to bring forth its precious fruits for the use of creatures in it: and it is marvellous that such light should be emitted from the sun, when it is at such a vast distance from the earth, and should reach it in so short a space. A modern astronomer (m) observes, that a bullet discharged from a cannon would be near twenty five years, before it could finish its journey from the sun to the earth: and yet the rays of light reach the earth in seven minutes and a half, and are said to pass ten millions of miles in a minute. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To give light upon the earth; this is repeated from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to show the end for which they were made, and set up, and the use they were to be of to the earth; being hung up like so many lamps or chandeliers, to contain and send forth light unto the earth, to the inhabitants of it, that they may see to walk and work by, and do all the business of life, as well as be warmed and comforted thereby, and the earth made fertile to bring forth its precious fruits for the use of creatures in it: and it is marvellous that such light should be emitted from the sun, when it is at such a vast distance from the earth, and should reach it in so short a space. A modern astronomer (m) observes, that a bullet discharged from a cannon would be near twenty five years, before it could finish its journey from the sun to the earth: and yet the rays of light reach the earth in seven minutes and a half, and are said to pass ten millions of miles in a minute. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Huygen. Cosmotheoros. l. 2. p. 125. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Huygen. Cosmotheoros. l. 2. p. 125. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And God set them in the firmament of the heaven to give light upon the earth,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And God set them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Having made the heavenly bodies (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 1:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") God is now said to “set,” that is, to place (LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔθετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "posuit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), them in “the firmament of heaven.” They are located in the firm structure which stood as a dome, or convex roof, over the surface of the earth; see note ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 1:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. Pliny ii. 106, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sidera coelo adfixa",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No mention is here added of the movements of the heavenly bodies; nor is any explanation given, in this condensed narrative, of the way in which the luminaries placed in the firmament were nevertheless apparently possessed with mysterious powers of movement; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They occupied certain positions, and moved upon certain paths, appointed them by God; and, like the sea, they were not able to pass the bounds set them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 17, 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And God set",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, gave) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. sun, moon, and stars) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the firmament of the heaven to give light upon the earth, and to rule over the day and ever the night, and to divide the light from the darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". An intimation that on this day the astronomical arrangements for the illumination of the globe and the measurement of time were permanently settled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And God saw that it was good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Laplace was inclined to question the Divine verdict with regard at least to the moon, which he thought might have been so placed as to be always full, whereas, at its present distance from the earth, we are sometimes deprived of both its light and the sun's together. But not to dwell upon the fact that to remove the moon four times its present distance from the earth, which it would require to be in order to be always full, would necessitate important changes in the other members of the solar system which might not be for the earth's advantage, the immediate effect of such a disposition of the lunar orb would be to give us a moon of only one sixteenth the size of that which now dispenses its silver beams upon our darkened globe (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Genesis 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Fourth Day. - After the earth had been clothed with vegetation, and fitted to be the abode of living beings, there were created on the fourth day the sun, moon, and stars, heavenly bodies in which the elementary light was concentrated, in order that its influence upon the earthly globe might be sufficiently modified and regulated for living beings to exist and thrive beneath its rays, in the water, in the air, and upon the dry land. At the creative word of God the bodies of light came into existence in the firmament, as lamps. On יהי, the singular of the predicate before the plural of the subject, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., vid., Gesenius, Heb. Gr. 147. מאורת, bodies of light, light-bearers, then lamps. These bodies of light received a threefold appointment: (1)  They were \"to divide between the day and the night,\" of, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", between the light and the darkness, in other words, to regulate from that time forward the difference, which had existed ever since the creation of light, between the night and the day. (2) They were to be (or serve: והיוּ after an imperative has the force of a command) - (a) for signs (sc., for the earth), partly as portents of extraordinary events (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and divine judgments (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), partly as showing the different quarters of the heavens, and as prognosticating the changes in the weather; - (b) for seasons, or for fixed, definite times (מועדים, from יעד to fix, establish), - not for festal seasons merely, but \"to regulate definite points and periods of time, by virtue of their periodical influence upon agriculture, navigation, and other human occupations, as well as upon the course of human, animal, and vegetable life (e.g., the breeding time of animals, and the migrations of birds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); - (c) for days and years, i.e., for the division and calculation of days and years. The grammatical construction will not allow the clause to be rendered as a Hendiadys, viz., \"as signs for definite times and for days and years,\" or as signs both for the times and also for days and years. (3)  They were to serve as lamps upon the earth, i.e., to pour out their light, which is indispensable to the growth and health of every creature. That this, the primary object of the lights, should be mentioned last, is correctly explained by Delitzsch: \"From the astrological and chronological utility of the heavenly bodies, the record ascends to their universal utility which arises from the necessity of light for the growth and continuance of everything earthly.\" This applies especially to the two great lights which were created by God and placed in the firmament; the greater to rule the day, the lesser to rule the night. \"The great\" and \"the small\" in correlative clauses are to be understood as used comparatively (cf. Gesenius, 119, 1). That the sun and moon were intended, was too obvious to need to be specially mentioned. It might appear strange, however, that these lights should not receive names from God, like the works of the first three days. This cannot be attributed to forgetfulness on the part of the author, as Tuch supposes. As a rule, the names were given by God only to the greater sections into which the universe was divided, and not to individual bodies (either plants or animals). The man and the woman are the only exceptions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sun and moon are called great, not in comparison with the earth, but in contrast with the stars, according to the amount of light which shines from them upon the earth and determines their rule over the day and night; not so much with reference to the fact, that the stronger light of the sun produces the daylight, and the weaker light of the moon illumines the night, as to the influence which their light exerts by day and night upon all nature, both organic and inorganic-an influence generally admitted, but by no means fully understood. In this respect the sun and moon are the two great lights, the stars small bodies of light; the former exerting great, the latter but little, influence upon the earth and its inhabitants.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This truth, which arises from the relative magnitude of the heavenly bodies, or rather their apparent size as seen from the earth, is not affected by the fact that from the standpoint of natural science many of the stars far surpass both sun and moon in magnitude. Nor does the fact, that in our account, which was written for inhabitants of the earth and for religious purposes, it is only the utility of the sun, moon, and stars to the inhabitants of the earth that is mentioned, preclude the possibility of each by itself, and all combined, fulfilling other purposes in the universe of God. And not only is our record silent, but God Himself made no direct revelation to man on this subject; because astronomy and physical science, generally, neither lead to godliness, nor promise peace and salvation to the soul. Belief in the truth of this account as a divine revelation could only be shaken, if the facts which science has discovered as indisputably true, with regard to the number, size, and movements of the heavenly bodies, were irreconcilable with the biblical account of the creation. But neither the innumerable host nor the immeasurable size of many of the heavenly bodies, nor the almost infinite distance of the fixed stars from our earth and the solar system, warrants any such assumption. Who can set bounds to the divine omnipotence, and determine what and how much it can create in a moment? The objection, that the creation of the innumerable and immeasurably great and distant heavenly bodies in one day, is so disproportioned to the creation of this one little globe in six days, as to be irreconcilable with our notions of divine omnipotence and wisdom, does not affect the Bible, but shows that the account of the creation has been misunderstood. We are not taught here that on one day, viz., the fourth, God created all the heavenly bodies out of nothing, and in a perfect condition; on the contrary, we are told that in the beginning God created the heaven and the earth, and on the fourth day that He made the sun, the moon, and the stars (planets, comets, and fixed stars) in the firmament, to be lights for the earth. According to these distinct words, the primary material, not only of the earth, but also of the heaven and the heavenly bodies, was created in the beginning. If, therefore, the heavenly bodies were first made or created on the fourth day, as lights for the earth, in the firmament of heaven; the words can have no other meaning than that their creation was completed on the fourth day, just as the creative formation of our globe was finished on the third; that the creation of the heavenly bodies therefore proceeded side by side, and probably by similar stages, with that of the earth, so that the heaven with its stars was completed on the fourth day. Is this representation of the work of creation, which follows in the simplest way from the word of God, at variance with correct ideas of the omnipotence and wisdom of God? Could not the Almighty create the innumerable host of heaven at the same time as the earthly globe? Or would Omnipotence require more time for the creation of the moon, the planets, and the sun, or of Orion, Sirius, the Pleiades, and other heavenly bodies whose magnitude has not yet been ascertained, than for the creation of the earth itself? Let us beware of measuring the works of Divine Omnipotence by the standard of human power. The fact, that in our account the gradual formation of the heavenly bodies is not described with the same minuteness as that of the earth; but that, after the general statement in Genesis 1:1 as to the creation of the heavens, all that is mentioned is their completion on the fourth day, when for the first time they assumed, or were placed in, such a position with regard to the earth as to influence its development; may be explained on the simple ground that it was the intention of the sacred historian to describe the work of creation from the standpoint of the globe: in other words, as it would have appeared to an observer from the earth, if there had been one in existence at the time. For only from such a standpoint could this work of God be made intelligible to all men, uneducated as well as learned, and the account of it be made subservient to the religious wants of all.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This truth, which arises from the relative magnitude of the heavenly bodies, or rather their apparent size as seen from the earth, is not affected by the fact that from the standpoint of natural science many of the stars far surpass both sun and moon in magnitude. Nor does the fact, that in our account, which was written for inhabitants of the earth and for religious purposes, it is only the utility of the sun, moon, and stars to the inhabitants of the earth that is mentioned, preclude the possibility of each by itself, and all combined, fulfilling other purposes in the universe of God. And not only is our record silent, but God Himself made no direct revelation to man on this subject; because astronomy and physical science, generally, neither lead to godliness, nor promise peace and salvation to the soul. Belief in the truth of this account as a divine revelation could only be shaken, if the facts which science has discovered as indisputably true, with regard to the number, size, and movements of the heavenly bodies, were irreconcilable with the biblical account of the creation. But neither the innumerable host nor the immeasurable size of many of the heavenly bodies, nor the almost infinite distance of the fixed stars from our earth and the solar system, warrants any such assumption. Who can set bounds to the divine omnipotence, and determine what and how much it can create in a moment? The objection, that the creation of the innumerable and immeasurably great and distant heavenly bodies in one day, is so disproportioned to the creation of this one little globe in six days, as to be irreconcilable with our notions of divine omnipotence and wisdom, does not affect the Bible, but shows that the account of the creation has been misunderstood. We are not taught here that on one day, viz., the fourth, God created all the heavenly bodies out of nothing, and in a perfect condition; on the contrary, we are told that in the beginning God created the heaven and the earth, and on the fourth day that He made the sun, the moon, and the stars (planets, comets, and fixed stars) in the firmament, to be lights for the earth. According to these distinct words, the primary material, not only of the earth, but also of the heaven and the heavenly bodies, was created in the beginning. If, therefore, the heavenly bodies were first made or created on the fourth day, as lights for the earth, in the firmament of heaven; the words can have no other meaning than that their creation was completed on the fourth day, just as the creative formation of our globe was finished on the third; that the creation of the heavenly bodies therefore proceeded side by side, and probably by similar stages, with that of the earth, so that the heaven with its stars was completed on the fourth day. Is this representation of the work of creation, which follows in the simplest way from the word of God, at variance with correct ideas of the omnipotence and wisdom of God? Could not the Almighty create the innumerable host of heaven at the same time as the earthly globe? Or would Omnipotence require more time for the creation of the moon, the planets, and the sun, or of Orion, Sirius, the Pleiades, and other heavenly bodies whose magnitude has not yet been ascertained, than for the creation of the earth itself? Let us beware of measuring the works of Divine Omnipotence by the standard of human power. The fact, that in our account the gradual formation of the heavenly bodies is not described with the same minuteness as that of the earth; but that, after the general statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as to the creation of the heavens, all that is mentioned is their completion on the fourth day, when for the first time they assumed, or were placed in, such a position with regard to the earth as to influence its development; may be explained on the simple ground that it was the intention of the sacred historian to describe the work of creation from the standpoint of the globe: in other words, as it would have appeared to an observer from the earth, if there had been one in existence at the time. For only from such a standpoint could this work of God be made intelligible to all men, uneducated as well as learned, and the account of it be made subservient to the religious wants of all.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Most of the objections to the historical character of our account, which have been founded upon the work of the fourth day, rest upon a misconception of the proper point of view from which it should be studied. And, in addition to that, the conjectures of astronomers as to the immeasurable distance of most of the fixed stars, and the time which a ray of light would require to reach the earth, are accepted as indisputable mathematical proof; whereas these approximative estimates of distance rest upon the unsubstantiated supposition, that everything which has been ascertained with regard to the nature and motion of light in our solar system, must be equally true of the light of the fixed stars.) ",
        "children": []
      }
    ]
  }
]