[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let the waters . . . in the open firmament.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The days of the second creative triad correspond to those of the first. Light was created on the first day, and on the fourth it was gathered into light-bearers; on the second day air and water were called into being, and on the fifth day they were peopled with life; lastly, on the third day the dry land appeared, and on the sixth day it became the home of animals and man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Bring forth abundantly the moving creature that hath life.—Literally, let the waters swarm a swarm of living soul. But the word soul properly signifies “breath,” and thus, after the long pause of the fourth day, during which vegetation was advancing under the ripening effects of solar heat, we now hasten onward to another creative act, by which God called into being creatures which live by breathing. And as vegetation began with a green tinge upon the rocks, so doubtless animal life began in the most rudimentary manner, and advanced through animalcules and insects up to fish and reptiles. The main point noticed in the text as to the living things produced on this day is their fecundity. They are all those creatures which multiply in masses. It does not, however, follow that the highest forms of fish and reptiles were reached before the lowest form of land animal was created. All that we are taught is that the Infusoria and Ovipara preceded the Mammalia. As the most perfect trees may not have been produced till the Garden of Eden was planted, so the peacock may not have spread his gaudy plumes till the time was approaching when there would be human eyes capable of admiring his beauty.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Bring forth abundantly the moving creature that hath life.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "let the waters swarm a swarm of living soul. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "But the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "soul ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "properly signifies “breath,” and thus, after the long pause of the fourth day, during which vegetation was advancing under the ripening effects of solar heat, we now hasten onward to another creative act, by which God called into being creatures which live by breathing. And as vegetation began with a green tinge upon the rocks, so doubtless animal life began in the most rudimentary manner, and advanced through animalcules and insects up to fish and reptiles. The main point noticed in the text as to the living things produced on this day is their fecundity. They are all those creatures which multiply in masses. It does not, however, follow that the highest forms of fish and reptiles were reached before the lowest form of land animal was created. All that we are taught is that the Infusoria and Ovipara preceded the Mammalia. As the most perfect trees may not have been produced till the Garden of Eden was planted, so the peacock may not have spread his gaudy plumes till the time was approaching when there would be human eyes capable of admiring his beauty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And fowl that may fly.—Heb., and let fowl, or winged creatures, fly above the earth. It does not say that they were formed out of the water (comp. Genesis 2:19). Nor is it confined to birds, but includes all creatures that can wing their way in the air.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And fowl that may fly.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and let fowl, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or winged creatures, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "fly above the earth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "It does not say that they were formed out of the water (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Nor is it confined to birds, but includes all creatures that can wing their way in the air.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the open firmament.—Literally, upon the face of the expanse of heaven—that is, in front of it, upon the lower surface of the atmosphere near to the earth.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "In the open firmament.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "upon the face of the expanse of heaven",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—that is, in front of it, upon the lower surface of the atmosphere near to the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 1:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The moving creature that hath life — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Endued with self-motion and animal life. — How much soever we may be astonished at the stupendous vastness and magnificence of inanimate matter, the least piece that is animated and has ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is still more admirable. But who can conceive the nature of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "life? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "We see it daily around us, but cannot comprehend it!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We observe that it enables millions and millions of creatures to act, as it were, of themselves, and to seek and obtain such enjoyments as give them a sensible pleasure; but how it does this surpasses all understanding: and we can reach no more of its nature, than that it is such an amazing property, as, if we think at all, must carry up our thoughts to that Almighty Being, who alone could bestow such a wonderful blessing, and who, in his exuberant goodness, has conferred it, not on one or a few merely, but on innumerable millions, and has inclined and enabled them to communicate it to millions and millions more of the same species with themselves, that shall succeed one another till time shall be no more! Thus in the work of creation, after the formation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "light, air, water, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the originals of all things, he proceeds from creatures less excellent to those that are more so: from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vegetables ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "animals; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and then from animals less perfect in their form to the more perfect. Such was the Creator’s progress in his work; and, in imitation of him, we should be continually advancing to greater excellence and perfection in our dispositions and actions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fish ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fowl ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "were both formed out of the water: there being a nearer alliance and greater resemblance between the form of the bodies in general, and the motions of creatures that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "swim ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and of those that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "than there is between either of these and such as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "creep ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "walk ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "on the earth: and their bodies being intended to be lighter, and their motions swifter, the wise Creator saw fit to form them from a lighter and fluid element.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The waters are said to produce them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abundantly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to signify the prodigious and rapid multiplication, especially of all the various species of fishes. The word in Hebrew, which generally stands for fish, also means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "multiplication; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "no creatures, it seems, multiplying so fast as they do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:20-25 God commanded the fish and fowl to be produced. This command he himself executed. Insects, which are more numerous than the birds and beasts, and as curious, seem to have been part of this day's work. The Creator's wisdom and power are to be admired as much in an ant as in an elephant. The power of God's providence preserves all things, and fruitfulness is the effect of his blessing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " - VII. The Fifth Day",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20. שׁרץ shārats, \"crawl, teem, swarm, abound.\" An intransitive verb, admitting, however, an objective noun of its own or a like signification.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "נפשׁ  nephesh, \"breath, soul, self.\" This noun is derived from a root signifying to breathe. Its concrete meaning is, therefore, \"that which breathes,\" and consequently has a body, without which there can be no breathing; hence, \"a breathing body,\" and even a body that once had breath Numbers 6:6. As breath is the accompaniment and sign of life, it comes to denote \"life,\" and hence, a living body, \"an animal.\" And as life properly signifies animal life, and is therefore essentially connected with feeling, appetite, thought, נפשׁ  nephesh, denotes also these qualities, and what possesses them. It is obvious that it denotes the vital principle not only in man but in the brute. It is therefore a more comprehensive word than our soul, as commonly understood.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "נפשׁ  nephesh, \"breath, soul, self.\" This noun is derived from a root signifying to breathe. Its concrete meaning is, therefore, \"that which breathes,\" and consequently has a body, without which there can be no breathing; hence, \"a breathing body,\" and even a body that once had breath ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As breath is the accompaniment and sign of life, it comes to denote \"life,\" and hence, a living body, \"an animal.\" And as life properly signifies animal life, and is therefore essentially connected with feeling, appetite, thought, נפשׁ  nephesh, denotes also these qualities, and what possesses them. It is obvious that it denotes the vital principle not only in man but in the brute. It is therefore a more comprehensive word than our soul, as commonly understood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "21. תנין  tannı̂yn, \"long creature,\" a comprehensive genus, including vast fishes, serpents, dragons, crocodiles; \"stretch.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. ברך  bārak \"break, kneel; bless.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The solitude בהוּ  bohû, the last and greatest defect in the state of the earth, is now to be removed by the creation of the various animals that are to inhabit it and partake of its vegetable productions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On the second day the Creator was occupied with the task of reducing the air and water to a habitable state. And now on the corresponding day of the second three he calls into existence the inhabitants of these two elements. Accordingly, the animal kingdom is divided into three parts in reference to the regions to be inhabited - fishes, birds, and land animals. The fishes and birds are created on this day. The fishes seem to be regarded as the lowest type of living creatures.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They are here subdivided only into the monsters of the deep and the smaller species that swarm in the waters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Genesis 1:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The crawler - שׁרץ  sherets apparently includes all animals that have short legs or no legs, and are therefore unable to raise themselves above the soil. The aquatic and most amphibious animals come under this class. \"The crawler of living breath,\" having breath, motion, and sensation, the ordinary indications of animal life. \"Abound with.\" As in Genesis 1:11 we have, \"Let the earth grow grass,\" (דשׁא תדשׁע  tadshē‛ deshe', so here we have, \"Let the waters crawl with the crawler,\" שׁרץ ישׁרצוּ  yı̂shretsû sherets; the verb and noun having the same root. The waters are here not the cause but the element of the fish, as the air of the fowl. Fowl, everything that has wings. \"The face of the expanse.\" The expanse is here proved to be aerial or spatial; not solid, as the fowl can fly on it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The crawler - שׁרץ  sherets apparently includes all animals that have short legs or no legs, and are therefore unable to raise themselves above the soil. The aquatic and most amphibious animals come under this class. \"The crawler of living breath,\" having breath, motion, and sensation, the ordinary indications of animal life. \"Abound with.\" As in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have, \"Let the earth grow grass,\" (דשׁא תדשׁע  tadshē‛ deshe', so here we have, \"Let the waters crawl with the crawler,\" שׁרץ ישׁרצוּ  yı̂shretsû sherets; the verb and noun having the same root. The waters are here not the cause but the element of the fish, as the air of the fowl. Fowl, everything that has wings. \"The face of the expanse.\" The expanse is here proved to be aerial or spatial; not solid, as the fowl can fly on it.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 1:20-23. Fifth Day. The signs of animal life appeared in the waters and in the air.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20. moving creature—all oviparous animals, both among the finny and the feathery tribes—remarkable for their rapid and prodigious increase.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fowl—means every flying thing: The word rendered \"whales,\" includes also sharks, crocodiles, &c.; so that from the countless shoals of small fish to the great sea monsters, from the tiny insect to the king of birds, the waters and the air were suddenly made to swarm with creatures formed to live and sport in their respective elements.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The moving creature, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "creeping thing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A word which belongs to all those living creatures who move with their bellies close to the element they move in. Hence it is used both of birds which fly in the air, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 11:20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and of things creeping upon the earth, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and of fishes that swim in the sea, as here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And fowl that may fly above the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft wanting, and to be understood in the Hebrew language, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 39:4 Job 41:1 Isaiah 6:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 39:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": according to this translation the fowl have their matter from the water as well as the fishes; which seem most probable, as from this, so also from the following verses, in which they are both mentioned together, as made of the same materials, and as works of the same day, and both are blessed together, and both are distinguished and separated from the production of the earth, which were the works of the sixth day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. And whereas it is said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 2:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Out of the ground the Lord God formed every beast of the field, and every fowl of the air; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it may be answered, That the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ground",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be there understood more largely, as it is confessedly in some other places of Scripture, for the lower part of the world, consisting of earth and water. For it is most reasonable to expound that short and general passage from the foregoing chapter, wherein the original both of beasts and fowls are largely and distinctly described. Moreover, the fowl seem to have been made of both these elements, viz. of soft and moist earth, possibly taken from the bottom of the water, in which case they were brought forth by the water, as is said here, and formed out of the ground, as there. As Eve is said to be made of Adam’s bone and rib, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 2:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and of his flesh ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Which shows that with the rib flesh was taken from Adam, though it be not said so, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So here, the fowl were made both of water and earth, as their temper and constitution shows, though but one of them be here expressed. But these words are by some translated thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and let the fowl fly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But according to that translation, the mention of the fowl, both here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", seems to be very improper and forced. For it is preposterous, and contrary to the method constantly used in this whole chapter, to speak of the motion of any living creature, and the place thereof, before its original and production be mentioned. Besides, either the original of the fowls is described here, or it is wholly omitted in this chapter, which is not credible. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God said, let the waters bring forth abundantly,.... The waters gathered together in one place, the waters of the ocean, and those in rivers, pools and lakes, and which, before their collection into those places, had been sat on, moved, and impregnated by the Spirit of God; so that they could, as they did, by the divine order accompanied with his power, bring forth abundance of creatures, next mentioned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the moving creature that hath life: an animal life, of which sort of creatures as yet there had been none made; vegetables, or such as have a vegetative life, were made on the third day; but those that have a sensitive and animal life not till this day, the fifth; and the less perfect, or lower sort of these, were first produced, even such as move or \"creep\" (n), as the word used signifies; which is applied to fishes as well as creeping things, because in swimming their bellies touch the water, and are close to it, as reptiles on the earth: and of these creeping things in the seas there are innumerable, as the Psalmist says, Psalm 104:25. Pliny (o) reckons up an hundred and seventy six kinds of fishes, which he puts in an alphabetical order: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the moving creature that hath life: an animal life, of which sort of creatures as yet there had been none made; vegetables, or such as have a vegetative life, were made on the third day; but those that have a sensitive and animal life not till this day, the fifth; and the less perfect, or lower sort of these, were first produced, even such as move or \"creep\" (n), as the word used signifies; which is applied to fishes as well as creeping things, because in swimming their bellies touch the water, and are close to it, as reptiles on the earth: and of these creeping things in the seas there are innumerable, as the Psalmist says, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Pliny (o) reckons up an hundred and seventy six kinds of fishes, which he puts in an alphabetical order: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and fowl that may fly above the earth in the open firmament of heaven; which according to our version were to be produced out of the waters also; not out of mere water, but out of earth and water mixed together, or out of the earth or clay (p) that lay at the bottom of the waters: and it may be observed of some fowls, that they live on the waters, and others partly on land and partly on water; and as the elements of fowl and fish, the air and water, bear a resemblance to each other, so do these creatures, some fowls both fly and swim; and what wings are to the one, fins are to the other; and both steer their course by their tails, and are both oviparous: though it should seem, according to Genesis 2:19, that the fowls were produced from the earth, and the words may be rendered here, \"let the fowl fly above the earth\", &c. as they are in the Samaritan and Syriac versions, and in others (q). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and fowl that may fly above the earth in the open firmament of heaven; which according to our version were to be produced out of the waters also; not out of mere water, but out of earth and water mixed together, or out of the earth or clay (p) that lay at the bottom of the waters: and it may be observed of some fowls, that they live on the waters, and others partly on land and partly on water; and as the elements of fowl and fish, the air and water, bear a resemblance to each other, so do these creatures, some fowls both fly and swim; and what wings are to the one, fins are to the other; and both steer their course by their tails, and are both oviparous: though it should seem, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that the fowls were produced from the earth, and the words may be rendered here, \"let the fowl fly above the earth\", &c. as they are in the Samaritan and Syriac versions, and in others (q). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) \"reptile\", V. L. Pagninus, Montanus; \"reptilia\", Junius & Tremellius, Piscator. (o) Nat. Hist. l. 32. c. 11. (p) Vid. T. Bab. Cholin. fol. 27. 2.((q)  \"et volatile volet\", Pagninus, Montanus, Vatablus, Amama, \"et volatile volitet\", Tigurine version; \"et volucres volent\", Junius & Tremellius, Piscator; \"et aves volent\", Drusius; \"et volucris volet\", Cartwrightus; \"et avis volitet\", Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) \"reptile\", V. L. Pagninus, Montanus; \"reptilia\", Junius & Tremellius, Piscator. (o) Nat. Hist. l. 32. c. 11. (p) Vid. T. Bab. Cholin. fol. 27. 2.((q)  \"et volatile volet\", Pagninus, Montanus, Vatablus, Amama, \"et volatile volitet\", Tigurine version; \"et volucres volent\", Junius & Tremellius, Piscator; \"et aves volent\", Drusius; \"et volucris volet\", Cartwrightus; \"et avis volitet\", Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And God said, Let the waters bring forth abundantly the {p} moving creature that hath life, and fowl that may fly above the earth in the open firmament of heaven.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And God said, Let the waters bring forth abundantly the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{p}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " moving creature that hath life, and fowl ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may fly above the earth in the open firmament of heaven.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) As fish and worms which slide, swim or creep.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20–23. The Fifth Day. The Creation of Water Animals and Flying Animals",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let the waters … life",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The rendering, “bring forth abundantly the moving creature that hath life,” fails to give the full meaning of the original. Literally, the words mean “let the waters swarm swarms, even living soul”: and the purpose of the command is that the waters are to teem with myriads of living animals. Hence the R.V. margin, “swarm with swarms of living creatures” is closer to the original; but it fails to reproduce the phrase “living soul,” in apposition to the word translated “swarms.” No translation is satisfactory which fails to give prominence to the thought, that the waters are to teem with things endowed with a wondrous new gift, the active principle of animal life, which the Hebrews called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nephesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and which is nearly represented by the Greek ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ψυχή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We might, therefore, translate “let the waters swarm with swarms of creatures, even with countless things which have life.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That there should ever be any difficulty in deciding whether an organism belonged to the vegetable or to the animal “kingdom would never have occurred to an ancient writer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The rendering “the moving creature” went wrong in following the ancient versions, which supposed that the word rendered in the margin “swarm,” denoted only “creeping things” or “reptiles.” LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑρπετὰ ψυχῶν ζωσῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reptile animae viventis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This gives an entirely false impression. The command is for the creation of all sorts of water animals.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and let fowl fly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, “and let winged things fly.” The command includes all creatures with wings, e.g. bats, butterflies, beetles, insects, as well as birds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the open firmament of heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This rendering scarcely reproduces the sense of the Hebrew words, which literally mean “in the face of,” or “over against, the firmament of heaven.” The idea is that winged things are to fly “above” the earth, and “in front of” the vault of heaven. The R.V. margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on the face of the expanse of the heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is cumbrous and obscure. The meaning seems to be that the flight of winged things shall be in mid air, “in front,” as it were, of the solid “firmament of heaven,” which was not remote. The winged creatures would continually be visible against the sky.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20. Day five. The waters and the air, separated on the second day, are on this filled with their respective inhabitants. And God said. Nature never makes an onward movement, in the sense of an absolutely new departure, unless under the impulse of the word of Elohim. These words distinctly claim that the creatures of the sea and of the air, even if evolved from material elements, were produced in obedience to Divine command, and not spontaneously generated by the potentia vitae of either land, sea, or sky. Let the waters bring forth abundantly the moving creature. Literally, swarm with swarmers, or crawl with crawlers. The fundamental signification of sharatz is to creep or swarm, and hence to multiply (Gesenius); or, vice versa, to multiply in masses, and hence to swarm or abound (Furst; cf. Genesis 8:17; Exodus 1:7; Exodus 8:3). The sheretzim, though including small aquatic creatures that have short or no legs, are obviously \"all kinds of living creatures inhabiting either land or water which are oviparous and remarkable for fecundity\" (Bush). We may, therefore, understand the creative fiat of the fifth day as summoning first into existence the insect creation (in Leviticus 11:20-23 defined as flying sheretzim), the fishes of the sea (sheretzim of the waters, Leviticus 11:9, 10), and the reptiles and saurians of sea and land (sheretzim of the land, Leviticus 11:41, 42). Dawson concludes that \"the prolific animals of the fifth day's creation belonged to the three Cuvierian sub-kingdoms of the radiata articulata, mollusca, and to the classes of fish and reptiles among the vertebrata. That hath life. Nephesh chayyah; literally, a living breath. Here the creatures of the sea are distinguished from all previous creations, and in particular from vegetation, as being possessed of a vital principle. This does not, of course, contradict the well-known truth that plants are living organisms. Only the life principle of the animal creation is different from that of the vegetable kingdom. It may be impossible by the most acute microscopic analysis to differentiate the protoplasmic cell of vegetable matter from that of animal organisms, and plants may appear to be possessed of functions that resemble those of animals, yet the two are generically different - vegetable protoplasm never weaving animal texture, and plant fiber never issuing from the loom of animal protoplasm. That which constitutes an animal is the possession of respiratory organs, to which, doubtless. there is a reference in the term nephesh from naphash, to breathe. And fowl that may fly. Literally, let \"winged creatures\" fly. The fowls include all tribes covered with feathers that can raise themselves hate the air. The English version produces the impression that they were made from the waters, which is contrary to Genesis 2:19. The correct rendering disposes of the difficulty. Above the earth in the open firmament of heaven. Not above the firmament like the clouds (Von Bohlen, Baumgarten), but in the concave vault (Tuch, Delitzsch), or before the surface of the expanse (Kalisch). Genesis 1:20Keil and Delitzsch Biblical Commentary on the Old TestamentThe Fifth Day. - \"God said: Let the waters swarm with swarms, with living beings, and let birds fly above the earth in the face (the front, i.e., the side turned towards the earth) of the firmament.\" ישׁרצוּ and יעופף are imperative. Earlier translators, on the contrary, have rendered the latter as a relative clause, after the πετεινὰ πετόμενα of the lxx, \"and with birds that fly;\" thus making the birds to spring out of the water, in opposition to Genesis 2:19. Even with regard to the element out of which the water animals were created the text is silent; for the assertion that שׁרץ is to be understood \"with a causative colouring\" is erroneous, and is not sustained by Exodus 8:3 or Psalm 105:30. The construction with the accusative is common to all verbs of multitude. שׁרץ and שׁרץ, to creep and swarm, is applied, \"without regard to size, to those animals which congregate together in great numbers, and move about among one another.\" חיּה גפשׁ, anima viva, living soul, animated beings (vid., Genesis 2:7), is in apposition to שׁרץ, \"swarms consisting of living beings.\" The expression applies not only to fishes, but to all water animals from the greatest to the least, including reptiles, etc. In carrying out His word, God created (Genesis 1:21) the great \"tanninim,\" - lit., the long-stretched, from תּנן, to stretch-whales, crocodiles, and other sea-monsters; and \"all moving living beings with which the waters swarm after their kind, and all (every) winged fowl after its kind.\" That the water animals and birds of every kind were created on the same day, and before the land animals, cannot be explained on the ground assigned by early writers, that there is a similarity between the air and the water, and a consequent correspondence between the two classes of animals. For in the light of natural history the birds are at all events quite as near to the mammalia as to the fishes; and the supposed resemblance between the fins of fishes and the wings of birds, is counterbalanced by the no less striking resemblance between birds and land animals, viz., that both have feet. The real reason is rather this, that the creation proceeds throughout from the lower to the higher; and in this ascending scale the fishes occupy to a great extent a lower place in the animal economy than birds, and both water animals and birds a lower place than land animals, more especially the mammalia. Again, it is not stated that only a single pair was created of each kind; on the contrary, the words, \"let the waters swarm with living beings,\" seem rather to indicate that the animals were created, not only in a rich variety of genera and species, but in large numbers of individuals. The fact that but one human being was created at first, by no means warrants the conclusion that the animals were created singly also; for the unity of the human race has a very different signification from that of the so-called animal species. - (Genesis 1:22). As animated beings, the water animals and fowls are endowed, through the divine blessing, with the power to be fruitful and multiply. The word of blessing was the actual communication of the capacity to propagate and increase in numbers. LinksGenesis 1:20 InterlinearGenesis 1:20 Parallel TextsGenesis 1:20 NIVGenesis 1:20 NLTGenesis 1:20 ESVGenesis 1:20 NASBGenesis 1:20 KJVGenesis 1:20 Bible AppsGenesis 1:20 ParallelGenesis 1:20 Biblia ParalelaGenesis 1:20 Chinese BibleGenesis 1:20 French BibleGenesis 1:20 German BibleBible Hub",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Verse 20. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Day five. The waters and the air, separated on the second day, are on this filled with their respective inhabitants. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "And God said.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Nature never makes an onward movement, in the sense of an absolutely new departure, unless under the impulse of the word of Elohim. These words distinctly claim that the creatures of the sea and of the air, even if evolved from material elements, were produced in obedience to Divine command, and not spontaneously generated by the ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "potentia vitae",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of either land, sea, or sky. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "Let the waters bring forth abundantly the moving creature.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Literally, swarm with swarmers, or crawl with crawlers. The fundamental signification of ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "sharatz",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is to creep or swarm, and hence to multiply (Gesenius); or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "vice versa",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to multiply in masses, and hence to swarm or abound (Furst; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "sheretzim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though including small aquatic creatures that have short or no legs, are obviously \"",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "all",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " kinds of living creatures inhabiting either land or water which are oviparous and remarkable for fecundity\" (Bush). We may, therefore, understand the creative fiat of the fifth day as summoning first into existence the insect creation (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:20-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " defined as ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "flying sheretzim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the fishes of the sea (",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "sheretzim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the waters, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:9, 10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the reptiles and saurians of sea and land (",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "sheretzim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the land, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:41, 42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Dawson concludes that \"the prolific animals of the fifth day's creation belonged to the three Cuvierian sub-kingdoms of the radiata articulata, mollusca, and to the classes of fish and reptiles among the vertebrata. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "That hath life",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "Nephesh chayyah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; literally, a living breath. Here the creatures of the sea are distinguished from all previous creations, and in particular from vegetation, as being possessed of a vital principle. This does not, of course, contradict the well-known truth that plants are living organisms. Only the life principle of the animal creation is different from that of the vegetable kingdom. It may be impossible by the most acute microscopic analysis to differentiate the protoplasmic cell of vegetable matter from that of animal organisms, and plants may appear to be possessed of functions that resemble those of animals, yet the two are generically different - vegetable protoplasm never weaving animal texture, and plant fiber never issuing from the loom of animal protoplasm. That which constitutes an animal is the possession of respiratory organs, to which, doubtless. there is a reference in the term ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "nephesh",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "naphash",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to breathe. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "And fowl that may fly",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Literally, let \"winged creatures\" fly. The fowls include all tribes covered with feathers that can raise themselves hate the air. The English version produces the impression that they were made from the waters, which is contrary to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The correct rendering disposes of the difficulty. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "Above the earth in the open firmament of heaven",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Not above the firmament like the clouds (Von Bohlen, Baumgarten), but in the concave vault (Tuch, Delitzsch), or before the surface of the expanse (Kalisch). Genesis 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Keil and Delitzsch Biblical Commentary on the Old Testament",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The Fifth Day. - \"God said: Let the waters swarm with swarms, with living beings, and let birds fly above the earth in the face (the front, i.e., the side turned towards the earth) of the firmament.\" ישׁרצוּ and יעופף are imperative. Earlier translators, on the contrary, have rendered the latter as a relative clause, after the πετεινὰ πετόμενα of the lxx, \"and with birds that fly;\" thus making the birds to spring out of the water, in opposition to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Even with regard to the element out of which the water animals were created the text is silent; for the assertion that שׁרץ is to be understood \"with a causative colouring\" is erroneous, and is not sustained by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The construction with the accusative is common to all verbs of multitude. שׁרץ and שׁרץ, to creep and swarm, is applied, \"without regard to size, to those animals which congregate together in great numbers, and move about among one another.\" חיּה גפשׁ, anima viva, living soul, animated beings (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is in apposition to שׁרץ, \"swarms consisting of living beings.\" The expression applies not only to fishes, but to all water animals from the greatest to the least, including reptiles, etc. In carrying out His word, God created (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the great \"tanninim,\" - lit., the long-stretched, from תּנן, to stretch-whales, crocodiles, and other sea-monsters; and \"all moving living beings with which the waters swarm after their kind, and all (every) winged fowl after its kind.\" That the water animals and birds of every kind were created on the same day, and before the land animals, cannot be explained on the ground assigned by early writers, that there is a similarity between the air and the water, and a consequent correspondence between the two classes of animals. For in the light of natural history the birds are at all events quite as near to the mammalia as to the fishes; and the supposed resemblance between the fins of fishes and the wings of birds, is counterbalanced by the no less striking resemblance between birds and land animals, viz., that both have feet. The real reason is rather this, that the creation proceeds throughout from the lower to the higher; and in this ascending scale the fishes occupy to a great extent a lower place in the animal economy than birds, and both water animals and birds a lower place than land animals, more especially the mammalia. Again, it is not stated that only a single pair was created of each kind; on the contrary, the words, \"let the waters swarm with living beings,\" seem rather to indicate that the animals were created, not only in a rich variety of genera and species, but in large numbers of individuals. The fact that but one human being was created at first, by no means warrants the conclusion that the animals were created singly also; for the unity of the human race has a very different signification from that of the so-called animal species. - (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As animated beings, the water animals and fowls are endowed, through the divine blessing, with the power to be fruitful and multiply. The word of blessing was the actual communication of the capacity to propagate and increase in numbers. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Links",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Interlinear",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Parallel Texts",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 NIV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 NLT",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 ESV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 NASB",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 KJV",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Bible Apps",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Parallel",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Biblia Paralela",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 Chinese Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 French Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:20 German Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Bible Hub",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  }
]