[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold, it was very good.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This final blessing of God’s completed work on the Friday must be compared with the final words of Christ spoken of the second creation, upon the same day of the week, when He said “It is finished.” Next we must notice that this world was only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "until man was placed upon it, but then became ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "very good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This verdict, too, had respect to man as a species, and is not therefore annulled by the fall. In spite, therefore, of the serious responsibilities attendant upon the bestowal of freewill on man, we believe that the world is still for purposes of mercy, and that God not only rejoiced at first, but “shall rejoice in His works” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 85:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 1:31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, it was very good — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It had been said of each day’s work, except the second, that it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but now, of every thing, that it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "very good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For man, the master-piece of God’s works, and his visible image and deputy here on earth, was now formed and constituted the head and governor of the whole. And all these wonderful works being connected together and dependant one on another, till the last link of the chain was made and added to the rest, some defect and imperfection must of necessity be attached to them all: but this being now finished, the whole was complete, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "very good. The evening and the morning were the sixth day — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "No doubt, God could as easily have made the world and all things therein in an instant, as in six days: but he chose to form it in this gradual way, partly, perhaps, that his wisdom, power, and goodness, manifested in each part, might be more distinctly viewed and considered; and that he might show us how great things might rise from small beginnings, and be gradually accomplished; as also that he might set us an example of working six days, and resting on the seventh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:31 When we come to think about our works, we find, to our shame, that much has been very bad; but when God saw his work, all was very good. Good, for it was all just as the Creator would have it to be. All his works, in all places of his dominion, bless him; and therefore, bless thou the Lord, O my soul. Let us bless God for the gospel of Christ, and when we consider his almighty power, let us sinners flee from the wrath to come. If new-created unto the image of God in holiness, we shall at length enter the new heavens and new earth, wherein dwelleth righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Here we have the general review and approval of everything God had made, at the close of the six days' work of creation. Man, as well as other things, was very good when he came from his Maker's hand; but good as yet untried, and therefore good in capacity rather than in victory over temptation. It remains yet to be seen whether he will be good in act and habit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This completes, then, the restoration of that order and fullness the absence of which is described in the second verse. The account of the six days' work, therefore, is the counterpart of that verse. The six days fall into two threes, corresponding to each other in the course of events. The first and fourth days refer principally to the darkness on the face of the deep; the second and fifth to the disorder and emptiness of the aerial and aqueous elements; and the third and sixth to the similar condition of the land. Again, the first three days refer to a lower, the second three to a higher order of things. On the first the darkness on the face of the earth is removed; on the fourth that on the face of the sky. On the second the water is distributed above and below the expanse; on the fifth the living natives of these regions are called into being. On the third the plants rooted in the soil are made; on the sixth the animals that move freely over it are brought into existence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter shows the folly and sin of the worship of light, of sun, moon, or star, of air or water, of plant, of fish or fowl, of earth, of cattle, creeping thing or wild beast, or, finally, of man himself; as all these are but the creatures of the one Eternal Spirit, who, as the Creator of all, is alone to be worshipped by his intelligent creatures.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter is also to be read with wonder and adoration by man; as he finds himself to be constituted lord of the earth, next in rank under the Creator of all, formed in the image of his Maker, and therefore capable not only of studying the works of nature, but of contemplating and reverently communing with the Author of nature.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In closing the interpretation of this chapter, it is proper to refer to certain first principles of hermeneutical science. First, that interpretation only is valid which is true to the meaning of the author. The very first rule on which the interpreter is bound to proceed is to assign to each word the meaning it commonly bore in the time of the writer. This is the prime key to the works of every ancient author, if we can only discover it. The next is to give a consistent meaning to the whole of that which was composed at one time or in one place by the author. The presumption is that there was a reasonable consistency of thought in his mind during one effort of composition. A third rule is to employ faithfully and discreetly whatever we can learn concerning the time, place, and other circumstances of the author to the elucidation of his meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And, in the second place, the interpretation now given claims acceptance on the ground of its internal and external consistency with truth. First, It exhibits the consistency of the whole narrative in itself. It acknowledges the narrative character of the first verse. It assigns an essential significance to the words, \"the heavens,\" in that verse. It attributes to the second verse a prominent place and function in the arrangement of the record. It places the special creative work of the six days in due subordination to the absolute creation recorded in the first verse. It gathers information from the primitive meanings of the names that are given to certain objects, and notices the subsequent development of these meanings. It accounts for the manifestation of light on the first day, and of the luminaries of heaven on the fourth, and traces the orderly steps of a majestic climax throughout the narrative. It is in harmony with the usage of speech as far as it can be known to us at the present day. It assigns to the words \"heavens,\" \"earth,\" \"expanse,\" \"day,\" no greater latitude of meaning than was then customary. It allows for the diversity of phraseology employed in describing the acts of creative power. It sedulously refrains from importing modern notions into the narrative.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second, the narrative thus interpreted is in striking harmony with the dictates of reason and the axioms of philosophy concerning the essence of God and the nature of man. On this it is unnecessary to dwell.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Third, it is equally consistent with human science. It substantially accords with the present state of astronomical science. It recognizes, as far as can be expected, the relative importance of the heavens and the earth, the existence of the heavenly bodies from the beginning of time, the total and then the partial absence of light from the face of the deep, as the local result of physical causes. It allows, also, if it were necessary, between the original creation, recorded in the first verse, and the state of things described in the second, the interval of time required for the light of the most distant discoverable star to reach the earth. No such interval, however, could be absolutely necessary, as the Creator could as easily establish the luminous connection of the different orbs of heaven as summon into being the element of light itself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Fourth, it is also in harmony with the elementary facts of geological knowledge. The land, as understood by the ancient author, may be limited to that portion of the earth's surface which was known to antediluvian man. The elevation of an extensive tract of land, the subsidence of the overlying waters into the comparative hollows, the clarifying of the atmosphere, the creation of a fresh supply of plants and animals on the newly-formed continent, compose a series of changes which meet the geologist again and again in prosecuting his researches into the bowels of the earth. What part of the land was submerged when the new soil emerged from the waters, how far the shock of the plutonic or volcanic forces may have been felt, whether the alteration of level extended to the whole solid crust of the earth, or only to a certain region surrounding the cradle of mankind, the record before us does not determine. It merely describes in a few graphic touches, that are strikingly true to nature, the last of those geologic changes which our globe has undergone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Fifth, it is in keeping, as far as it goes, with the facts of botany, zoology, and ethnology.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sixth, it agrees with the cosmogonies of all nations, so far as these are founded upon a genuine tradition and not upon the mere conjectures of a lively fancy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Finally, it has the singular and superlative merit of drawing the diurnal scenes of that creation to which our race owes its origin in the simple language of common life, and presenting each transcendent change as it would appear to an ordinary spectator standing on the earth. It was thus sufficiently intelligible to primeval man, and remains to this day intelligible to us, as soon as we divest ourselves of the narrowing preconceptions of our modern civilization. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Finally, it has the singular and superlative merit of drawing the diurnal scenes of that creation to which our race owes its origin in the simple language of common life, and presenting each transcendent change as it would appear to an ordinary spectator standing on the earth. It was thus sufficiently intelligible to primeval man, and remains to this day intelligible to us, as soon as we divest ourselves of the narrowing preconceptions of our modern civilization. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. Be fruitful, &c.—The human race in every country and age has been the offspring of the first pair. Amid all the varieties found among men, some black, some copper-colored, others white, the researches of modern science lead to a conclusion, fully accordant with the sacred history, that they are all of one species and of one family (Ac 17:26). What power in the word of God! \"He spake and it was done. He commanded and all things stood fast\" [Ps 33:9]. \"Great and manifold are thy works, Lord God Almighty! in wisdom hast thou made them all\" [Ps 104:24]. We admire that wisdom, not only in the regular progress of creation, but in its perfect adaptation to the end. God is represented as pausing at every stage to look at His work. No wonder He contemplated it with complacency. Every object was in its right place, every vegetable process going on in season, every animal in its structure and instincts suited to its mode of life and its use in the economy of the world. He saw everything that He had made answering the plan which His eternal wisdom had conceived; and, \"Behold it was very good\" [Ge 1:31].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No notes from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God saw everything that he had made,.... Either all that he had made on the several six days of the creation, he took a survey of them, looked over them again, as workmen do when they have finished their work, to see if anything is amiss or wanting; not that anything of this nature can be supposed in the works of God, but such a survey is attributed to him after the manner of men, to show the completeness of his works, and the excellency of them. Picherellus (q) limits this to what had been done on this day, with respect to man, who alone, as he thinks, was the subject of this day's work; and so it respects the creation of man after the image and likeness of God; the forming of the woman out of his rib, and so providing a suitable helper for him; giving them dominion over all the creatures, and suitable food for the support of the animal life; and God reflected on this, and foresaw it would be good in the issue, as it was in itself, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And behold, it was very good; it had been said of everything else, at the close of each day's work, excepting the second, that it was good; but here the expression is stronger upon the creation of man, the chief and principal work of God, that it was \"very good\"; he being made upright and holy, bearing the image of his Creator upon him, and in such circumstances as to be happy and comfortable himself, and to glorify God: the phrase may be expressive not only of the goodness of everything God had made, as it was in itself, and in its use; but of his complacency, and delight therein, every thing being made for himself and for, his pleasure, Revelation 4:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And behold, it was very good; it had been said of everything else, at the close of each day's work, excepting the second, that it was good; but here the expression is stronger upon the creation of man, the chief and principal work of God, that it was \"very good\"; he being made upright and holy, bearing the image of his Creator upon him, and in such circumstances as to be happy and comfortable himself, and to glorify God: the phrase may be expressive not only of the goodness of everything God had made, as it was in itself, and in its use; but of his complacency, and delight therein, every thing being made for himself and for, his pleasure, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the evening and the morning were the sixth day; by that time all these works on this day were finished; the sun had gone round the earth, or the earth about that, for the space of twenty four hours, which completed the sixth day, within which term of time God had determined to finish all his works, as he did. This day, according to Capellus, was the twenty third of April, and, according, to Archbishop Usher, the twenty eighth of October, or, as others, the sixth of September. Mr. Whiston, as has been before observed, is of opinion, that the six days of the creation were equal to six years: and the Persians have a tradition, which they pretend to have received from Zoroastres, that God created the world, not in six natural days, but in six times or spaces of different length, called in their tongue \"Ghahan barha\". The first of these spaces, in which the heavens were created, was a space of forty five days; the second, in which the waters were created, sixty days; the third, in which the earth was created, seventy five days; the fourth, in which grass and trees were created, thirty days; the fifth, in which all creatures were made, eighty days; the sixth, in which man was created, seventy five days; in all three hundred sixty five days, or a full year (r). The first of the six principal good works they are taught to do is to observe the times of the creation (s). And the ancient Tuscans or Etrurians allot six thousand years to the creation; the order of which, with them, is much the same with the Mosaic account, only making a day a thousand years: in the first thousand, they say, God made the heaven and the earth; in the next, the firmament, which appears to us, calling it heaven; in the third, the sea, and all the waters that are in the earth; in the fourth, the great lights, the sun and moon, and also the stars; in the fifth, every volatile, reptile, and four footed animal, in the air, earth and water, (which agrees with Picherellus); see Gill on Genesis 1:25, and in the sixth, man; and whereas they say God employed twelve thousand years in all his creation, and the first six being passed at the creation of man, it seems, according to them, that mankind are to continue for the other six thousand years (t). And it is a notion that obtains among the Jews, that, answerable to the six days of creation, the world will continue six thousand years. It is a tradition of Elias (u), an ancient Jewish doctor, that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the evening and the morning were the sixth day; by that time all these works on this day were finished; the sun had gone round the earth, or the earth about that, for the space of twenty four hours, which completed the sixth day, within which term of time God had determined to finish all his works, as he did. This day, according to Capellus, was the twenty third of April, and, according, to Archbishop Usher, the twenty eighth of October, or, as others, the sixth of September. Mr. Whiston, as has been before observed, is of opinion, that the six days of the creation were equal to six years: and the Persians have a tradition, which they pretend to have received from Zoroastres, that God created the world, not in six natural days, but in six times or spaces of different length, called in their tongue \"Ghahan barha\". The first of these spaces, in which the heavens were created, was a space of forty five days; the second, in which the waters were created, sixty days; the third, in which the earth was created, seventy five days; the fourth, in which grass and trees were created, thirty days; the fifth, in which all creatures were made, eighty days; the sixth, in which man was created, seventy five days; in all three hundred sixty five days, or a full year (r). The first of the six principal good works they are taught to do is to observe the times of the creation (s). And the ancient Tuscans or Etrurians allot six thousand years to the creation; the order of which, with them, is much the same with the Mosaic account, only making a day a thousand years: in the first thousand, they say, God made the heaven and the earth; in the next, the firmament, which appears to us, calling it heaven; in the third, the sea, and all the waters that are in the earth; in the fourth, the great lights, the sun and moon, and also the stars; in the fifth, every volatile, reptile, and four footed animal, in the air, earth and water, (which agrees with Picherellus); see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in the sixth, man; and whereas they say God employed twelve thousand years in all his creation, and the first six being passed at the creation of man, it seems, according to them, that mankind are to continue for the other six thousand years (t). And it is a notion that obtains among the Jews, that, answerable to the six days of creation, the world will continue six thousand years. It is a tradition of Elias (u), an ancient Jewish doctor, that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the world shall stand six thousand years, two thousand void, two thousand under the law, and two thousand, the days of the Messiah.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Baal Hatturim (w) observes, there are six \"alephs\" in the first verse of this chapter, answerable to the six thousand years the world is to continue: and R. Gedaliah says (x), at the end of the sixth millennium the world shall return without form and void, (to its former condition, \"tohu\" and \"bohu\",) and the whole shall be a sabbath: and very particular is another writer (y) of theirs concerning these six days of the creation, who having spoken of the day of judgment, the resurrection of the dead, and the world to come, observes, that the six days' work is an intimation and sign of these things: on the sixth day man was created, and the work was perfected on the seventh; so the kings of the nations shall be in the world five thousand years, answerable to the five days in which the fowls, and creeping things of the waters, and the rest, were created; and the holding of their kingdoms will be a little within the sixth millennium, answerable to the creation of cattle and beasts, who were now created on the beginning of it, the \"sixth day\"; and the kingdom of the house of David will be in the sixth millennium, answerable to the creation of man, who knew his Creator, and ruled over them all; and at the end of that millennium will be the day of judgment, answerable to man's being judged at the end of it, \"the sixth day; and the seventh millennium will be the sabbath\". And a like notion obtains among the Persian Magi; it is said that Zerdusht, or Zoroastres, was born in the middle age of the world, so it was told him from the age of Keiomaras (the first man) unto thy age are 3000 years, and from this thy age unto the resurrection are 3000 years (z). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) In Cosmopoeiam, p. 2841. (r) Hyde Hist. Relig. vet. Pers. p. 164, 166, 168, 483, 484. (s) Lib. Sad-der, port. 6. 94. apud Hyde, ib. p. 439, 483. (t) See Universal History, vol. 1. p. 64. (u) T. Bab. Sanhedrin, fol. 97. 1. Avoda Zara, fol. 9. 1.((w) Comment. in Gen. i. 1.((x) Shalshelet Hakabala, fol. 36. 1.((y) Comment. in Maimon. Hilch. Teshuva, c. 9. sect. 2.((z) Lib. Sad-der, port. 11. Vid. Hyde, ut supra, (Hist. Relig. vet. Pers. p. 481.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) In Cosmopoeiam, p. 2841. (r) Hyde Hist. Relig. vet. Pers. p. 164, 166, 168, 483, 484. (s) Lib. Sad-der, port. 6. 94. apud Hyde, ib. p. 439, 483. (t) See Universal History, vol. 1. p. 64. (u) T. Bab. Sanhedrin, fol. 97. 1. Avoda Zara, fol. 9. 1.((w) Comment. in Gen. i. 1.((x) Shalshelet Hakabala, fol. 36. 1.((y) Comment. in Maimon. Hilch. Teshuva, c. 9. sect. 2.((z) Lib. Sad-der, port. 11. Vid. Hyde, ut supra, (Hist. Relig. vet. Pers. p. 481.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and, behold, it was very good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The work of the six days’ Creation having been completed, God, as it were, contemplates the universe both in its details and in its entirety. That which He saw to be “good,” on each separate day, was but a fragment; that which He sees to be “very good,” on the sixth day, is the vast ordered whole, in which the separate parts are combined. The Divine approval of the material universe constitutes one of the most instructive traits of the Hebrew cosmogony. According to it, matter is not something hostile to God, independent of Him, or inherently evil, but made by Him, ordered by Him, good in itself, and good in its relation to the purpose and plan of the Creator. The adjective “good” should not therefore be limited in meaning to the sense of “suitable,” or “fitting.” There is nothing “evil” in the Divinely-created universe: it is “very good” (LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καλὰ λίαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "valde bona",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 31.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And God saw every thing that he had made, and, behold, it was very good.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Literally, lo! good very! Not simply good, but good exceedingly. It is not man alone that God surveys, but the completed cosmos, with man as its crown and glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "decu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "set tutamen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"It is not merely a benediction which he utters, but an expression of admiration, as we may say without any fear of the anthropomorphism - Euge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bone proclare!\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (T. Lewis). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the evening and the morning were the sixth day.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It seems unnecessary to add that this clay corresponds to the Cainozoic or tertiary era of geology, the Palaeontological remains of which sufficiently attest the truth of the Divine record in asserting that animals were anterior to man in their appearance on the earth, and that man is of comparatively recent origin. The alleged evidence of prehistoric man is too fragmentary and hypothetical to be accepted as conclusive; and yet, so far as the cosmogony of the present chapter is concerned, there is nothing to prevent the belief that man is of a much more remote antiquity than 6000 years. As of the other days, so of this the Chaldean tablets preserve an interesting monument. The saventh in the creation series, of which a fragment was discovered in one of the trenches at Konyunjik, runs: - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " When the gods in their assembly had created.... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Were delightful the strong monsters... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They caused to be living creatures... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Cattle of the field, beasts of the field, and creeping things of the field .... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They fixed for the living creatures... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Cattle and creeping thing of the city they fixed.... ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And the god Nin-si-ku (the lord of noble face) caused to be two...  in which it is not difficult to trace an account of the creation of the animal kingdom, and of the first pair of human beings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Sixth Day. - Sea and air are filled with living creatures; and the word of God now goes forth to the earth, to produce living beings after their kind. These are divided into three classes. בּהמה, cattle, from בהם, mutum, brutum esse, generally denotes the larger domesticated quadrupeds (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), but occasionally the larger land animals as a whole. רמשׂ (the creeping) embraces the smaller land animals, which move either without feet, or with feet that are scarcely perceptible, viz., reptiles, insects, and worms. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they are distinguished from the race of water reptiles by the term האדמה ארץ חיתו (the old form of the construct state, for הארץ חיּת), the beast of the earth, i.e., the freely roving wild animals.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"After its kind:\" this refers to all three classes of living creatures, each of which had its peculiar species; consequently in Genesis 1:25, where the word of God is fulfilled, it is repeated with every class. This act of creation, too, like all that precede it, is shown by the divine word \"good\" to be in accordance with the will of God. But the blessing pronounced is omitted, the author hastening to the account of the creation of man, in which the work of creation culminated. The creation of man does not take place through a word addressed by God to the earth, but as the result of the divine decree, \"We will make man in Our image, after our likeness,\" which proclaims at the very outset the distinction and pre-eminence of man above all the other creatures of the earth. The plural \"We\" was regarded by the fathers and earlier theologians almost unanimously as indicative of the Trinity: modern commentators, on the contrary, regard it either as pluralis majestatis; or as an address by God to Himself, the subject and object being identical; or as communicative, an address to the spirits or angels who stand around the Deity and constitute His council. The last is Philo's explanation: διαλέγεται ὁ τῶν ὁ͂λων πατὴρ ταῖς ἑαυτο͂υ δυνάεσιν (δυνάμεις  equals  angels). But although such passages as 1 Kings 22:19., Psalm 89:8, and Daniel 10, show that God, as King and Judge of the world, is surrounded by heavenly hosts, who stand around His throne and execute His commands, the last interpretation founders upon this rock: either it assumes without sufficient scriptural authority, and in fact in opposition to such distinct passages as Genesis 2:7, Genesis 2:22; Isaiah 40:13 seq., Genesis 44:24, that the spirits took part in the creation of man; or it reduces the plural to an empty phrase, inasmuch as God is made to summon the angels to cooperate in the creation of man, and then, instead of employing them, is represented as carrying out the work alone. Moreover, this view is irreconcilable with the words \"in our image, after our likeness;\" since man was created in the image of God alone (Genesis 1:27; Genesis 5:1), and not in the image of either the angels, or God and the angels. A likeness to the angels cannot be inferred from Hebrews 2:7, or from Luke 20:36. Just as little ground is there for regarding the plural here and in other passages (Genesis 3:22; Genesis 11:7; Isaiah 6:8; Isaiah 41:22) as reflective, an appeal to self; since the singular is employed in such cases as these, even where God Himself is preparing for any particular work (cf. Genesis 2:18; Psalm 12:5; Isaiah 33:10). No other explanation is left, therefore, than to regard it as pluralis majestatis, - an interpretation which comprehends in its deepest and most intensive form (God speaking of Himself and with Himself in the plural number, not reverentiae causa, but with reference to the fullness of the divine powers and essences which He possesses) the truth that lies at the foundation of the trinitarian view, viz., that the potencies concentrated in the absolute Divine Being are something more than powers and attributes of God; that they are hypostases, which in the further course of the revelation of God in His kingdom appeared with more and more distinctness as persons of the Divine Being. On the words \"in our image, after our likeness\" modern commentators have correctly observed, that there is no foundation for the distinction drawn by the Greek, and after them by many of the Latin Fathers, between εἰκών (imago) and ὁμοίωσις (similitudo), the former of which they supposed to represent the physical aspect of the likeness to God, the latter the ethical; but that, on the contrary, the older Lutheran theologians were correct in stating that the two words are synonymous, and are merely combined to add intensity to the thought: \"an image which is like Us\" (Luther); since it is no more possible to discover a sharp or well-defined distinction in the ordinary use of the words between צלם and דּמוּת, than between בּ and כּ. צלם, from צל, lit., a shadow, hence sketch, outline, differs no more from דּמוּת, likeness, portrait, copy, than the German words Umriss or Abriss (outline or sketch) from Bild or Abbild (likeness, copy). בּ and כּ are also equally interchangeable, as we may see from a comparison of this verse with Genesis 5:1 and Genesis 5:3. (Compare also Leviticus 6:4 with Leviticus 27:12, and for the use of בּ to denote a norm, or sample, Exodus 25:40; Exodus 30:32, Exodus 30:37, etc.) There is more difficulty in deciding in what the likeness to God consisted. Certainly not in the bodily form, the upright position, or commanding aspect of the man, since God has no bodily form, and the man's body was formed from the dust of the ground; nor in the dominion of man over nature, for this is unquestionably ascribed to man simply as the consequence or effluence of his likeness to God. Man is the image of God by virtue of his spiritual nature. of the breath of God by which the being, formed from the dust of the earth, became a living soul.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"After its kind:\" this refers to all three classes of living creatures, each of which had its peculiar species; consequently in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the word of God is fulfilled, it is repeated with every class. This act of creation, too, like all that precede it, is shown by the divine word \"good\" to be in accordance with the will of God. But the blessing pronounced is omitted, the author hastening to the account of the creation of man, in which the work of creation culminated. The creation of man does not take place through a word addressed by God to the earth, but as the result of the divine decree, \"We will make man in Our image, after our likeness,\" which proclaims at the very outset the distinction and pre-eminence of man above all the other creatures of the earth. The plural \"We\" was regarded by the fathers and earlier theologians almost unanimously as indicative of the Trinity: modern commentators, on the contrary, regard it either as pluralis majestatis; or as an address by God to Himself, the subject and object being identical; or as communicative, an address to the spirits or angels who stand around the Deity and constitute His council. The last is Philo's explanation: διαλέγεται ὁ τῶν ὁ͂λων πατὴρ ταῖς ἑαυτο͂υ δυνάεσιν (δυνάμεις  equals  angels). But although such passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", show that God, as King and Judge of the world, is surrounded by heavenly hosts, who stand around His throne and execute His commands, the last interpretation founders upon this rock: either it assumes without sufficient scriptural authority, and in fact in opposition to such distinct passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " seq., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 44:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that the spirits took part in the creation of man; or it reduces the plural to an empty phrase, inasmuch as God is made to summon the angels to cooperate in the creation of man, and then, instead of employing them, is represented as carrying out the work alone. Moreover, this view is irreconcilable with the words \"in our image, after our likeness;\" since man was created in the image of God alone (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and not in the image of either the angels, or God and the angels. A likeness to the angels cannot be inferred from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 20:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Just as little ground is there for regarding the plural here and in other passages (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as reflective, an appeal to self; since the singular is employed in such cases as these, even where God Himself is preparing for any particular work (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). No other explanation is left, therefore, than to regard it as pluralis majestatis, - an interpretation which comprehends in its deepest and most intensive form (God speaking of Himself and with Himself in the plural number, not reverentiae causa, but with reference to the fullness of the divine powers and essences which He possesses) the truth that lies at the foundation of the trinitarian view, viz., that the potencies concentrated in the absolute Divine Being are something more than powers and attributes of God; that they are hypostases, which in the further course of the revelation of God in His kingdom appeared with more and more distinctness as persons of the Divine Being. On the words \"in our image, after our likeness\" modern commentators have correctly observed, that there is no foundation for the distinction drawn by the Greek, and after them by many of the Latin Fathers, between εἰκών (imago) and ὁμοίωσις (similitudo), the former of which they supposed to represent the physical aspect of the likeness to God, the latter the ethical; but that, on the contrary, the older Lutheran theologians were correct in stating that the two words are synonymous, and are merely combined to add intensity to the thought: \"an image which is like Us\" (Luther); since it is no more possible to discover a sharp or well-defined distinction in the ordinary use of the words between צלם and דּמוּת, than between בּ and כּ. צלם, from צל, lit., a shadow, hence sketch, outline, differs no more from דּמוּת, likeness, portrait, copy, than the German words Umriss or Abriss (outline or sketch) from Bild or Abbild (likeness, copy). בּ and כּ are also equally interchangeable, as we may see from a comparison of this verse with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (Compare also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 6:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and for the use of בּ to denote a norm, or sample, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 25:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.) There is more difficulty in deciding in what the likeness to God consisted. Certainly not in the bodily form, the upright position, or commanding aspect of the man, since God has no bodily form, and the man's body was formed from the dust of the ground; nor in the dominion of man over nature, for this is unquestionably ascribed to man simply as the consequence or effluence of his likeness to God. Man is the image of God by virtue of his spiritual nature. of the breath of God by which the being, formed from the dust of the earth, became a living soul.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"The breath of God became the soul of man; the soul of man therefore is nothing but the breath of God. The rest of the world exists through the word of God; man through His own peculiar breath. This breath is the seal and pledge of our relation to God, of our godlike dignity; whereas the breath breathed into the animals is nothing but the common breath, the life-wind of nature, which is moving everywhere, and only appears in the animal fixed and bound into a certain independence and individuality, so that the animal soul is nothing but a nature-soul individualized into certain, though still material spirituality.\" - Ziegler.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The image of God consists, therefore, in the spiritual personality of man, though not merely in unity of self-consciousness and self-determination, or in the fact that man was created a consciously free Ego; for personality is merely the basis and form of the divine likeness, not its real essence. This consists rather in the fact, that the man endowed with free self-conscious personality possesses, in his spiritual as well as corporeal nature, a creaturely copy of the holiness and blessedness of the divine life. This concrete essence of the divine likeness was shattered by sin; and it is only through Christ, the brightness of the glory of God and the expression of His essence (Hebrews 1:3), that our nature is transformed into the image of God again (Colossians 3:10; Ephesians 4:24).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The image of God consists, therefore, in the spiritual personality of man, though not merely in unity of self-consciousness and self-determination, or in the fact that man was created a consciously free Ego; for personality is merely the basis and form of the divine likeness, not its real essence. This consists rather in the fact, that the man endowed with free self-conscious personality possesses, in his spiritual as well as corporeal nature, a creaturely copy of the holiness and blessedness of the divine life. This concrete essence of the divine likeness was shattered by sin; and it is only through Christ, the brightness of the glory of God and the expression of His essence (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that our nature is transformed into the image of God again (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And they (אדם, a generic term for men) shall have dominion over the fish,\" etc. There is something striking in the introduction of the expression \"and over all the earth,\" after the different races of animals have been mentioned, especially as the list of races appears to be proceeded with afterwards. If this appearance were actually the fact, it would be impossible to escape the conclusion that the text is faulty, and that חיּת has fallen out; so that the reading should be, \"and over all the wild beasts of the earth,\" as the Syriac has it. But as the identity of \"every creeping thing that creepeth upon the earth\" (הארץ) with \"every thing that creepeth upon the ground\" (האדמה) in Genesis 1:25 is not absolutely certain; on the contrary, the change in expression indicates a difference of meaning; and as the Masoretic text is supported by the oldest critical authorities (lxx, Sam., Onk.), the Syriac rendering must be dismissed as nothing more than a conjecture, and the Masoretic text be understood in the following manner. The author passes on from the cattle to the entire earth, and embraces all the animal creation in the expression, \"every moving thing (כל־הרמשׂ) that moveth upon the earth,\" just as in Genesis 1:28, \"every living thing הרמשׂת upon the earth.\" According to this, God determined to give to the man about to be created in His likeness the supremacy, not only over the animal world, but over the earth itself; and this agrees with the blessing in Genesis 1:28, where the newly created man is exhorted to replenish the earth and subdue it; whereas, according to the conjecture of the Syriac, the subjugation of the earth by man would be omitted from the divine decree. - Genesis 1:27. In the account of the accomplishment of the divine purpose the words swell into a jubilant song, so that we meet here for the first time with a parallelismus membrorum, the creation of man being celebrated in three parallel clauses. The distinction drawn between אתו (in the image of God created He him) and אתם (as man and woman created He them) must not be overlooked. The word אתם, which indicates that God created the man and woman as two human beings, completely overthrows the idea that man was at first androgynous (cf. Genesis 2:18.). By the blessing in Genesis 1:28, God not only confers upon man the power to multiply and fill the earth, as upon the beasts in Genesis 1:22, but also gives him dominion over the earth and every beast. In conclusion, the food of both man and beast is pointed out in Genesis 1:29, Genesis 1:30, exclusively from the vegetable kingdom. Man is to eat of \"every seed-bearing herb on the face of all the earth, and every tree on which there are fruits containing seed,\" consequently of the productions of both field and tree, in other words, of corn and fruit; the animals are to eat of \"every green herb,\" i.e., of vegetables or green plants, and grass.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"And they (אדם, a generic term for men) shall have dominion over the fish,\" etc. There is something striking in the introduction of the expression \"and over all the earth,\" after the different races of animals have been mentioned, especially as the list of races appears to be proceeded with afterwards. If this appearance were actually the fact, it would be impossible to escape the conclusion that the text is faulty, and that חיּת has fallen out; so that the reading should be, \"and over all the wild beasts of the earth,\" as the Syriac has it. But as the identity of \"every creeping thing that creepeth upon the earth\" (הארץ) with \"every thing that creepeth upon the ground\" (האדמה) in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not absolutely certain; on the contrary, the change in expression indicates a difference of meaning; and as the Masoretic text is supported by the oldest critical authorities (lxx, Sam., Onk.), the Syriac rendering must be dismissed as nothing more than a conjecture, and the Masoretic text be understood in the following manner. The author passes on from the cattle to the entire earth, and embraces all the animal creation in the expression, \"every moving thing (כל־הרמשׂ) that moveth upon the earth,\" just as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"every living thing הרמשׂת upon the earth.\" According to this, God determined to give to the man about to be created in His likeness the supremacy, not only over the animal world, but over the earth itself; and this agrees with the blessing in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the newly created man is exhorted to replenish the earth and subdue it; whereas, according to the conjecture of the Syriac, the subjugation of the earth by man would be omitted from the divine decree. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the account of the accomplishment of the divine purpose the words swell into a jubilant song, so that we meet here for the first time with a parallelismus membrorum, the creation of man being celebrated in three parallel clauses. The distinction drawn between אתו (in the image of God created He him) and אתם (as man and woman created He them) must not be overlooked. The word אתם, which indicates that God created the man and woman as two human beings, completely overthrows the idea that man was at first androgynous (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). By the blessing in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", God not only confers upon man the power to multiply and fill the earth, as upon the beasts in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but also gives him dominion over the earth and every beast. In conclusion, the food of both man and beast is pointed out in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", exclusively from the vegetable kingdom. Man is to eat of \"every seed-bearing herb on the face of all the earth, and every tree on which there are fruits containing seed,\" consequently of the productions of both field and tree, in other words, of corn and fruit; the animals are to eat of \"every green herb,\" i.e., of vegetables or green plants, and grass.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From this it follows, that, according to the creative will of God, men were not to slaughter animals for food, nor were animals to prey upon one another; consequently, that the fact which now prevails universally in nature and the order of the world, the violent and often painful destruction of life, is not a primary law of nature, nor a divine institution founded in the creation itself, but entered the world along with death at the fall of man, and became a necessity of nature through the curse of sin. It was not till after the flood, that men received authority from God to employ the flesh of animals as well as the green herb as food (Genesis 9:3); and the fact that, according to the biblical view, no carnivorous animals existed at the first, may be inferred from the prophetic announcements in Isaiah 11:6-8; Isaiah 65:25, where the cessation of sin and the complete transformation of the world into the kingdom of God are described as being accompanied by the cessation of slaughter and the eating of flesh, even in the case of the animal kingdom. With this the legends of the heathen world respecting the golden age of the past, and its return at the end of time, also correspond (cf. Gesenius on Isaiah 11:6-8). It is true that objections have been raised by natural historians to this testimony of Scripture, but without scientific ground. For although at the present time man is fitted by his teeth and alimentary canal for the combination of vegetable and animal food; and although the law of mutual destruction so thoroughly pervades the whole animal kingdom, that not only is the life of one sustained by the death of another, but \"as the graminivorous animals check the overgrowth of the vegetable kingdom, so the excessive increase of the former is restricted by the beasts of prey, and of these again by the destructive implements of man;\" and although, again, not only beasts of prey, but evident symptoms of disease are met with among the fossil remains of the aboriginal animals: all these facts furnish no proof that the human and animal races were originally constituted for death and destruction, or that disease and slaughter are older than the fall. For, to reply to the last objection first, geology has offered no conclusive evidence of its doctrine, that the fossil remains of beasts of prey and bones with marks of disease belong to a pre-Adamite period, but has merely inferred it from the hypothesis already mentioned of successive periods of creation. Again, as even in the present order of nature the excessive increase of the vegetable kingdom is restrained, not merely by the graminivorous animals, but also by the death of the plants themselves through the exhaustion of their vital powers; so the wisdom of the Creator could easily have set bounds to the excessive increase of the animal world, without requiring the help of huntsmen and beasts of prey, since many animals even now lose their lives by natural means, without being slain by men or eaten by beasts of prey. The teaching of Scripture, that death entered the world through sin, merely proves that the human race was created for eternal life, but by no means necessitates the assumption that the animals were also created for endless existence. As the earth produced them at the creative word of God, the different individuals and generations would also have passed away and returned to the bosom of the earth, without violent destruction by the claws of animals or the hand of man, as soon as they had fulfilled the purpose of their existence. The decay of animals is a law of nature established in the creation itself, and not a consequence of sin, or an effect of the death brought into the world by the sin of man. At the same time, it was so far involved in the effects of the fall, that the natural decay of the different animals was changed into a painful death or violent end. Although in the animal kingdom, as it at present exists, many varieties are so organized that they live exclusively upon the flesh of other animals, which they kill and devour; this by no means necessitates the conclusion, that the carnivorous beasts of prey were created after the fall, or the assumption that they were originally intended to feed upon flesh, and organized accordingly. If, in consequence of the curse pronounced upon the earth after the sin of man, who was appointed head and lord of nature, the whole creation was subjected to vanity and the bondage of corruption (Romans 8:20.); this subjection might have been accompanied by a change in the organization of the animals, though natural science, which is based upon the observation and combination of things empirically discovered, could neither demonstrate the fact nor explain the process. And if natural science cannot boast that in any one of its many branches it has discovered all the phenomena connected with the animal and human organism of the existing world, how could it pretend to determine or limit the changes through which this organism may have passed in the course of thousands of years?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From this it follows, that, according to the creative will of God, men were not to slaughter animals for food, nor were animals to prey upon one another; consequently, that the fact which now prevails universally in nature and the order of the world, the violent and often painful destruction of life, is not a primary law of nature, nor a divine institution founded in the creation itself, but entered the world along with death at the fall of man, and became a necessity of nature through the curse of sin. It was not till after the flood, that men received authority from God to employ the flesh of animals as well as the green herb as food (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the fact that, according to the biblical view, no carnivorous animals existed at the first, may be inferred from the prophetic announcements in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the cessation of sin and the complete transformation of the world into the kingdom of God are described as being accompanied by the cessation of slaughter and the eating of flesh, even in the case of the animal kingdom. With this the legends of the heathen world respecting the golden age of the past, and its return at the end of time, also correspond (cf. Gesenius on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is true that objections have been raised by natural historians to this testimony of Scripture, but without scientific ground. For although at the present time man is fitted by his teeth and alimentary canal for the combination of vegetable and animal food; and although the law of mutual destruction so thoroughly pervades the whole animal kingdom, that not only is the life of one sustained by the death of another, but \"as the graminivorous animals check the overgrowth of the vegetable kingdom, so the excessive increase of the former is restricted by the beasts of prey, and of these again by the destructive implements of man;\" and although, again, not only beasts of prey, but evident symptoms of disease are met with among the fossil remains of the aboriginal animals: all these facts furnish no proof that the human and animal races were originally constituted for death and destruction, or that disease and slaughter are older than the fall. For, to reply to the last objection first, geology has offered no conclusive evidence of its doctrine, that the fossil remains of beasts of prey and bones with marks of disease belong to a pre-Adamite period, but has merely inferred it from the hypothesis already mentioned of successive periods of creation. Again, as even in the present order of nature the excessive increase of the vegetable kingdom is restrained, not merely by the graminivorous animals, but also by the death of the plants themselves through the exhaustion of their vital powers; so the wisdom of the Creator could easily have set bounds to the excessive increase of the animal world, without requiring the help of huntsmen and beasts of prey, since many animals even now lose their lives by natural means, without being slain by men or eaten by beasts of prey. The teaching of Scripture, that death entered the world through sin, merely proves that the human race was created for eternal life, but by no means necessitates the assumption that the animals were also created for endless existence. As the earth produced them at the creative word of God, the different individuals and generations would also have passed away and returned to the bosom of the earth, without violent destruction by the claws of animals or the hand of man, as soon as they had fulfilled the purpose of their existence. The decay of animals is a law of nature established in the creation itself, and not a consequence of sin, or an effect of the death brought into the world by the sin of man. At the same time, it was so far involved in the effects of the fall, that the natural decay of the different animals was changed into a painful death or violent end. Although in the animal kingdom, as it at present exists, many varieties are so organized that they live exclusively upon the flesh of other animals, which they kill and devour; this by no means necessitates the conclusion, that the carnivorous beasts of prey were created after the fall, or the assumption that they were originally intended to feed upon flesh, and organized accordingly. If, in consequence of the curse pronounced upon the earth after the sin of man, who was appointed head and lord of nature, the whole creation was subjected to vanity and the bondage of corruption (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".); this subjection might have been accompanied by a change in the organization of the animals, though natural science, which is based upon the observation and combination of things empirically discovered, could neither demonstrate the fact nor explain the process. And if natural science cannot boast that in any one of its many branches it has discovered all the phenomena connected with the animal and human organism of the existing world, how could it pretend to determine or limit the changes through which this organism may have passed in the course of thousands of years?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The creation of man and his installation as ruler on the earth brought the creation of all earthly beings to a close (Genesis 1:31). God saw His work, and behold it was all very good; i.e., everything perfect in its kind, so that every creature might reach the goal appointed by the Creator, and accomplish the purpose of its existence. By the application of the term \"good\" to everything that God made, and the repetition of the word with the emphasis \"very\" at the close of the whole creation, the existence of anything evil in the creation of God is absolutely denied, and the hypothesis entirely refuted, that the six days' work merely subdued and fettered an ungodly, evil principle, which had already forced its way into it. The sixth day, as being the last, is distinguished above all the rest by the article - השּׁשּׁי יום \"a day, the sixth\" (Gesenius, 111, 2a). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The creation of man and his installation as ruler on the earth brought the creation of all earthly beings to a close (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). God saw His work, and behold it was all very good; i.e., everything perfect in its kind, so that every creature might reach the goal appointed by the Creator, and accomplish the purpose of its existence. By the application of the term \"good\" to everything that God made, and the repetition of the word with the emphasis \"very\" at the close of the whole creation, the existence of anything evil in the creation of God is absolutely denied, and the hypothesis entirely refuted, that the six days' work merely subdued and fettered an ungodly, evil principle, which had already forced its way into it. The sixth day, as being the last, is distinguished above all the rest by the article - השּׁשּׁי יום \"a day, the sixth\" (Gesenius, 111, 2a). ",
            "children": []
          }
        ]
      }
    ]
  }
]