[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 9:22-23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:22-23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Called for them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably not only the messengers, but the elders of Gibeon were now present. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore ye are cursed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "You shall not escape the curse of God, which, by divine sentence, belongs to all the Canaanites; but only change the quality of it. You shall feel that curse of bondage, which is proper to your race by virtue of that ancient decree, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bondmen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The slavery which is upon you shall be entailed on your posterity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The house of my God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This only service they mention here, because it was their durable servitude, being first in the tabernacle, and then in the temple, whence they were called Nethinim, 1",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Chronicles ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 2:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereas their servitude to the whole congregation, in a great measure, ceased when the Israelites were dispersed to their several habitations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:22-27 The Gibeonites do not justify their lie, but plead that they did it to save their lives. And the fear was not merely of the power of man; one might flee from that to the Divine protection; but of the power of God himself, which they saw engaged against them. Joshua sentences them to perpetual bondage. They must be servants, but any work becomes honourable, when it is done for the house of the Lord, and the offices thereof. Let us, in like manner, submit to our Lord Jesus, saying, We are in thy hand, do unto us as seemeth good and right unto thee, only save our souls; and we shall not repent it. If He appoints us to bear his cross, and serve him, that shall be neither shame nor grief to us, while the meanest office in God's service will entitle us to a dwelling in the house of the Lord all the days of our life. And in coming to the Saviour, we do not proceed upon a peradventure. We are invited to draw nigh, and are assured that him that cometh to Him, he will in nowise cast out. Even those things which sound harsh, and are humbling, and form sharp trials of our sincerity, will prove of real advantage.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Were the Israelites bound to respect an oath thus procured by fraud? Were they right in doing so? Dr. Sanderson (\"Works,\" vol. iv. 4 pp. 269, 300, Oxford edition), determines these questions in the affirmative; and rightly, since the oath, though unlawfully taken, was not an oath taken to do an unlawful thing, i. e. a thing in itself unlawful. It was the carelessness of the Israelites themselves which betrayed them into this league. It was therefore their duty when they found themselves entrapped into this unlawful covenant, to devise means by which they might respect both their own oath and God's purposes as intimated in His injunctions ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " against sparing the Canaanites. This was accomplished by granting their lives to the Gibeonites, but reducing them to a servile condition, which might be expected to disable them from influencing the Israelites to do wrong. It may be added, that had the Israelites broken their oath, taken solemnly in the Name of the Lord, they would have brought that Name into contempt among the pagan; and, while punishing perfidy in others, would have themselves, the Lord's people, incurred the reproach of perjury. The result showed that Joshua and the princes judged rightly in this matter. God gave to Israel a notable victory, crowned with special miracles, over the kings who were confederated against Gibeon, because of the treaty made with Israel ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and God punished as a national act of blood-guiltiness the slaughter of the Gibeonites by Saul, which was a distinct violation of the covenant here before us (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This sparing of the Gibeonites, as well as the previous sparing of Rahab and her household, must be borne in mind when the massacre of the Canaanites by Joshua and the Israelites is discussed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18-27. the children of Israel smote them not—The moral character of the Gibeonites' stratagem was bad. The princes of the congregation did not vindicate either the expediency or the lawfulness of the connection they had formed; but they felt the solemn obligations of their oath; and, although the popular clamor was loud against them, caused either by disappointment at losing the spoils of Gibeon, or by displeasure at the apparent breach of the divine commandment, they determined to adhere to their pledge, \"because they had sworn by the Lord God of Israel.\" The Israelitish princes acted conscientiously; they felt themselves bound by their solemn promise; but to prevent the disastrous consequences of their imprudent haste, they resolved to degrade the Gibeonites to a servile condition as a means of preventing their people from being ensnared into idolatry, and thus acted up, as they thought, to the true spirit and end of the law.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joshua called for them,.... The Gibeonites, who came as ambassadors for their people, who were detained at Gilgal until the children of Israel returned from Gibeon; and upon their return, and having made their report to Joshua that they found it to be true that they were near neighbours, Joshua ordered them to be brought before him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he spake unto them, saying, wherefore have ye beguiled us? what is your reason and motive for so doing? what has induced you to act such a deceitful part, to tell such lies and falsehoods, and impose upon us after this manner? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, we are very far from you, when ye dwell among us: pretending to come from a very far country, when they were inhabitants of the land Israel were come to possess. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying, we are very far from you, when ye dwell among us: pretending to come from a very far country, when they were inhabitants of the land Israel were come to possess. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joshua called for them, and he spake unto them, saying, Wherefore have ye beguiled us, saying, We are very far from you; when ye dwell among us?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joshua then summoned the Gibeonites, charged them with their deceit, and pronounced upon them the curse of eternal servitude: \"There shall not be cut off from you a servant,\" i.e., ye shall never cease to be servants, ye shall remain servants for ever (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"and that as hewers of wood and drawers of waters for our God's house.\" This is a fuller definition of the expression \"for all the congregation\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Gibeonites were to perform for the congregation the slaves' labour of hewing wood and drawing water for the worship of the sanctuary-a duty which was performed, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the lowest classes of people. In this way the curse of Noah upon Canaan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was literally fulfilled upon the Hivites of the Gibeonitish republic. ",
        "children": []
      }
    ]
  }
]