[{"header":"Chapter 24"},{"num":1,"verse":"David Spares Saul’s Life. David went up from there and dwelt in the strongholds of En-gedi."},{"num":2,"verse":"When Saul returned from pursuing after the Philistines, he was told, “David is in the desert in En-gedi.”"},{"num":3,"verse":"Saul took three thousand chosen men from out of all of Israel, and he went out and sought David and his men on the rocks of the wild goats."},{"num":4,"verse":"He came to the sheepfolds along the way, and there was a cave there. Saul entered it to relieve himself, and David and his men stayed in the recesses of the cave."},{"num":5,"verse":"David’s men said to him, “This is the day that the Lord spoke of when he said, ‘I will deliver your enemy into your hands, you may do to him as you see fit.’ ” David got up and secretly cut off a corner of Saul’s robe."},{"num":6,"verse":"But David’s conscience began to bother him because he had cut off a corner of Saul’s robe."},{"num":7,"verse":"He said to his men, “The Lord forbid that I should do such a thing to my lord, lifting my hand against the Lord’s anointed, for he is the Lord’s anointed.”"},{"num":8,"verse":"With these words David rebuked his servants, and he would not let them rise up against Saul."},{"num":17,"verse":"Saul’s Apology to David. When David had finished saying these things to Saul, Saul said, “Is that your voice, my son, David?” And Saul cried out and wept."},{"num":18,"verse":"He said to David, “You are more righteous than I am, for you have treated me well, but I have treated you poorly."},{"num":19,"verse":"Today you have revealed to me how you have treated me well, for the Lord had delivered me into your hands, but you did not kill me."},{"num":20,"verse":"When a man finds his enemy, does he allow him to walk away unharmed? May the Lord richly reward you for what you have done to me today."},{"num":21,"verse":"Truly, now I know that the kingdom of Israel will be firmly placed in your hands."},{"num":22,"verse":"Now swear to me by the Lord that you will not cut off my descendants after me, nor will you eliminate my name from my father’s family.”"},{"num":23,"verse":"David swore an oath to Saul, and Saul returned to his home. David and his men went up into the stronghold."}]