[{"header":"David Doesn’t Kill Saul When He Has the Chance"},{"num":24,"verse":"Saul returned from chasing the Philistines. Then he was told, “David is in the Desert of En Gedi.” "},{"num":2,"verse":"So Saul took 3,000 of the best soldiers from the whole nation of Israel. He started out to look for David and his men. He planned to look near the Rocky Cliffs of the Wild Goats."},{"num":3,"verse":"He came to some sheep pens along the way. A cave was there. Saul went in to go to the toilet. David and his men were far back in the cave. "},{"num":4,"verse":"David’s men said, “This is the day the Lord told you about. He said to you, ‘I will hand your enemy over to you. Then you can deal with him as you want to.’ ” So David came up close to Saul without being seen. He cut off a corner of Saul’s robe."},{"num":5,"verse":"Later, David felt sorry that he had cut off a corner of Saul’s robe. "},{"num":6,"verse":"He said to his men, “May the Lord keep me from doing a thing like that again to my master. He is the Lord’s anointed king. So I promise that I will never lay my hand on him. The Lord has anointed him.” "},{"num":7,"verse":"David said that to correct his men. He wanted them to know that they should never suggest harming the king. He didn’t allow them to attack Saul. So Saul left the cave and went on his way."},{"num":8,"verse":"Then David went out of the cave. He called out to Saul, “King Saul! My master!” When Saul looked behind him, David bowed down. He lay down flat with his face toward the ground. "},{"num":9,"verse":"He said to Saul, “Why do you listen when men say, ‘David is trying to harm you’? "},{"num":10,"verse":"This day you have seen with your own eyes how the Lord handed you over to me in the cave. Some of my men begged me to kill you. But I didn’t. I said, ‘I will never lay my hand on my master. He is the Lord’s anointed king.’ "},{"num":11,"verse":"Look, my father! Look at this piece of your robe in my hand! I cut off the corner of your robe. But I didn’t kill you. See, there is nothing in my hand that shows I am guilty of doing anything wrong. I haven’t turned against you. I haven’t done anything to harm you. But you are hunting me down. You want to kill me. "},{"num":12,"verse":"May the Lord judge between you and me. And may the Lord pay you back because of the wrong things you have done to me. But I won’t do anything to hurt you. "},{"num":13,"verse":"People say, ‘Evil acts come from those who do evil.’ So I won’t do anything to hurt you."},{"num":14,"verse":"“King Saul, who are you trying to catch? Who do you think you are chasing? I’m nothing but a dead dog or a flea! "},{"num":15,"verse":"May the Lord be our judge. May he decide between us. May he consider my case and stand up for me. May he show that I’m not guilty of doing anything wrong. May he save me from you.”"},{"num":16,"verse":"When David finished speaking, Saul asked him a question. He said, “My son David, is that your voice?” And Saul wept out loud. "},{"num":17,"verse":"“You are a better person than I am,” he said. “You have treated me well. But I’ve treated you badly. "},{"num":18,"verse":"You have just now told me about the good things you did to me. The Lord handed me over to you. But you didn’t kill me. "},{"num":19,"verse":"Suppose a man finds his enemy. He doesn’t let him get away without harming him. May the Lord reward you with many good things. May he do it because of the way you treated me today. "},{"num":20,"verse":"I know for sure that you will be king. I know that the kingdom of Israel will be made secure under your control. "},{"num":21,"verse":"Now make a promise in the name of the Lord. Promise me that you won’t kill the children of my family. Also promise me that you won’t wipe out my name from my family line.”"},{"num":22,"verse":"So David made that promise to Saul. Then Saul returned home. But David and his men went up to his usual place of safety."}]