[{"header":"David Did Not Kill Saul"},{"num":24,"verse":"When Saul returned from following the Philistines, he was told, “See, David is in the desert of Engedi.” "},{"num":2,"verse":"Then Saul took 3,000 chosen men from all Israel, and went to find David and his men in front of the Rocks of the Wild Goats. "},{"num":3,"verse":"He came to the places where the sheep were kept on the way. There was a cave there, and Saul went in to get rid of his body waste. Now David and his men were sitting farther back in the cave. "},{"num":4,"verse":"David’s men said to David, “See, this is the day the Lord told you, ‘See, I am about to give the one who hates you into your hand. You will do to him what you think is best.’” Then David got up and cut off a piece of Saul’s clothing in secret. "},{"num":5,"verse":"After this, David felt guilty in his heart because he had cut off a piece of Saul’s clothing. "},{"num":6,"verse":"So he said to his men, “May the Lord not let me put out my hand against my leader, for he is the Lord’s chosen one.” "},{"num":7,"verse":"David stopped his men with these words. He did not let them go against Saul. So Saul stood up and left the cave, and went on his way."},{"num":8,"verse":"After this David got up and went out of the cave and called to Saul, saying, “My lord the king!” When Saul looked behind him, David put his face to the ground, showing much respect. "},{"num":9,"verse":"David said to Saul, “Why do you listen to the words of men who say, ‘David wants to hurt you’? "},{"num":10,"verse":"See, your eyes have seen how the Lord gave you to me today in the cave. Some told me to kill you, but I had pity on you. I said, ‘I will not put out my hand against my leader, for he is the Lord’s chosen one.’ "},{"num":11,"verse":"Now, my father, see the piece of your clothing in my hand. I cut off the piece of your clothing but did not kill you. So know and understand that I have no desire to do wrong to you. I have not sinned against you, yet you come wanting to kill me. "},{"num":12,"verse":"May the Lord judge between you and me. May He punish you for your action against me. But my hand will not be against you. "},{"num":13,"verse":"As the men of long ago said in their wisdom, ‘Out of the sinful comes sin,’ but my hand will not be against you. "},{"num":14,"verse":"After whom has the king come out? After whom are you running? After a dead dog? After a little bug? "},{"num":15,"verse":"May the Lord be the One to judge between you and me. May He see and help me, and save me from you.” "},{"num":16,"verse":"When David had finished speaking to Saul, Saul said, “Is this your voice, my son David?” Then Saul gave a loud cry. "},{"num":17,"verse":"He said to David, “You are more right and good than I. For you have brought good to me, while I have done wrong to you. "},{"num":18,"verse":"You have said today that you have done good to me. The Lord gave me to you and you did not kill me. "},{"num":19,"verse":"If a man finds the one who hates him, will he let him go away safe? May the Lord bring good to you for what you have done for me this day. "},{"num":20,"verse":"Now I know that you will be king for sure. The nation of Israel will be made strong under your power. "},{"num":21,"verse":"So promise to me by the Lord that you will not destroy my children after me. Promise that you will not destroy my name from my father’s family.” "},{"num":22,"verse":"David gave Saul his promise, and Saul went home. But David and his men went up to the safe place."}]