[{"num":24,"verse":"And it came to pass, when Sha’ul was returned from following the Pelishtim, that it was told him, saying, Hinei, Dovid is in the midbar of Ein-Gedi."},{"num":3,"verse":"Then Sha’ul took shloshet alafim (three thousand) chosen men out of kol Yisroel, and went to search for Dovid and his anashim upon [the area known as] Wild Goat Rocks."},{"num":4,"verse":"And he came to the gidrot hatzon (sheep pens of the flock) on the derech, where was a me’arah (cave); and Sha’ul went in to cover his feet [i.e., relieve himself], and Dovid and his anashim remained in the far end of the me’arah (cave)."},{"num":5,"verse":"And the anashim of Dovid said unto him, Hinei, the day of which Hashem said unto thee, Hinei, I will deliver thine oyev (enemy) into thine yad, that thou mayest do to him as it shall seem tov unto thee. Then Dovid arose, and cut off the corner of the me’il of Sha’ul without his notice."},{"num":6,"verse":"And it came to pass afterward, that the lev Dovid smote him because he had cut off the corner of Sha’ul."},{"num":7,"verse":"And he said unto his anashim, Chalilah (far be it) before Hashem that I should do this thing unto adoni, Hashem’s moshiach, to stretch forth mine yad against him, seeing he is the moshiach of Hashem."},{"num":8,"verse":"So Dovid restrained his anashim with these devarim, and allowed them not to rise against Sha’ul. But Sha’ul rose up out of the me’arah (cave), and went on his derech."},{"num":9,"verse":"Dovid also arose afterward, and went out of the me’arah, and called after Sha’ul, saying, Adoni HaMelech. And when Sha’ul looked behind him, Dovid bowed down with his face to the ground, and prostrated himself."},{"num":10,"verse":"And Dovid said to Sha’ul, Wherefore hearest thou divrei adam, saying, Hinei, Dovid seeketh thy hurt?"},{"num":11,"verse":"Hinei, this day thine eyes have seen how that Hashem had delivered thee today into mine yad in the me’arah; and some urged me kill thee; but mine [nefesh] spared thee; and I said, I will not put forth mine yad against adoni; for he is the moshiach of Hashem."},{"num":12,"verse":"Moreover, avi, see, indeed, see the corner of thy me’il (robe) in my yad; for in that I cut off the corner of thy me’il, and killed thee not, know thou and see that there is neither ra’ah nor peysha (rebellion) in mine yad, and I have not sinned against thee; yet thou huntest my nefesh to take it."},{"num":13,"verse":"Hashem judge between me and thee, and Hashem avenge me on thee; but mine yad shall not be upon thee."},{"num":14,"verse":"As saith the mashal (proverb) of the ancients, Resha (wickedness) proceedeth from the resha’im; but mine yad shall not be upon thee."},{"num":15,"verse":"After whom is the Melech Yisroel come out? After whom dost thou pursue? After a dead kelev (dog), after a parosh (flea)."},{"num":16,"verse":"Hashem therefore be judge, and judge between me and thee, and see, and uphold my cause, and deliver me out of thine yad."},{"num":17,"verse":"And it came to pass, when Dovid had made an end of speaking these devarim unto Sha’ul, that Sha’ul said, Is this thy voice, beni Dovid? And Sha’ul lifted up his voice, and wept."},{"num":18,"verse":"And he said to Dovid, Thou art more tzaddik than I; for thou hast rewarded me tovah, whereas I have rewarded thee ra’ah."},{"num":19,"verse":"And thou hast shown this day how that thou hast dealt tovah with me; forasmuch as when Hashem had delivered me into thine yad, thou killedst me not."},{"num":20,"verse":"For if an ish find his oyev, will he let him go bederech tovah? Wherefore Hashem reward thee tovah for that thou hast done unto me this day."},{"num":21,"verse":"And now, hinei, I know that thou shalt surely be Melech, and that the Mamlechet Yisroel shall be established in thine yad."},{"num":22,"verse":"Swear now therefore unto me by Hashem, that thou wilt not cut off my zera after me, and that thou wilt not destroy my shem out of the Bais Avi."},{"num":23,"verse":"And Dovid swore unto Sha’ul. And Sha’ul went to his bais; but Dovid and his anashim went up unto the metzudah (stronghold, masada)."}]