[[],[{"type":"header","content":"Israel Oppressed by Midian"},{"type":"prose","content":"Then the Israelites did evil in the sight of the ; and the  gave them into the hand of Midian for seven years. "}],[{"type":"prose","content":"The [powerful] hand of Midian prevailed against Israel. Because of Midian the sons of Israel made for themselves the dens (hideouts) which were in the mountains, and the caves and the [mountain] strongholds. "}],[{"type":"prose","content":"For it was whenever Israel had sown [their seed] that the Midianites would come up with the Amalekites and the people of the east and go up against them. "}],[{"type":"prose","content":"So they would camp against them and destroy the crops of the land as far as Gaza, and leave no sustenance in Israel as well as no sheep, ox, or donkey. "}],[{"type":"prose","content":"For they would come up with their livestock and their tents, and they would come in as numerous as locusts; both they and their camels were innumerable. So they came into the land to devastate it. "}],[{"type":"prose","content":"So Israel was greatly impoverished because of the Midianites, and the Israelites cried out to the  [for help]."}],[{"type":"prose","content":"Now it came about when they cried out to the  because of Midian, "}],[{"type":"prose","content":"that the  sent a prophet to the Israelites, and he said to them, “Thus says the , the God of Israel, ‘I brought you up from Egypt and brought you out of the house of slavery. "}],[{"type":"prose","content":"And I rescued you from the hand of the Egyptians and from the hand of all who oppressed you, and drove them out before you and gave you their land, "}],[{"type":"prose","content":"and I said to you, “I am the  your God; you shall not fear the gods of the Amorites in whose land you live.” But you have not listened to  obeyed My voice.’”"},{"type":"header","content":"Gideon Is Visited"}],[{"type":"prose","content":"Now the Angel of the  came and sat under the terebinth tree at Ophrah, which belonged to Joash the Abiezrite, and his son Gideon was beating wheat in the wine press [instead of the threshing floor] to [hide it and] save it from the Midianites. "}],[{"type":"prose","content":"And the Angel of the  appeared to him and said to him, “The  is with you, O brave man.” "}],[{"type":"prose","content":"But Gideon said to him, “Please my lord, if the  is with us, then why has all this happened to us? And where are all His wondrous works which our fathers told us about when they said, ‘Did not the  bring us up from Egypt?’ But now the  has abandoned us and put us into the hand of Midian.” "}],[{"type":"prose","content":"The  turned to him and said, “Go in this strength of yours and save Israel from the hand of Midian. Have I not sent you?” "}],[{"type":"prose","content":"But Gideon said to Him, “Please Lord, how am I to rescue Israel? Behold, my family is the least [significant] in Manasseh, and I am the youngest (smallest) in my father’s house.” "}],[{"type":"prose","content":"The  answered him, “I will certainly be with you, and you will strike down the Midianites as [if they were only] one man.” "}],[{"type":"prose","content":"Gideon replied to Him, “If I have found any favor in Your sight, then show me a sign that it is You who speaks with me. "}],[{"type":"prose","content":"Please do not depart from here until I come back to You, and bring my offering and place it before You.” And He said, “I will wait until you return.”"}],[{"type":"prose","content":"Then Gideon went and prepared a young goat and unleavened bread from an ephah of flour. The meat he put in a basket and the broth in a pot, and he brought  to Him under the oak (terebinth) and presented it. "}],[{"type":"prose","content":"The Angel of God said to him, “Take the meat and unleavened bread and lay them on this rock, and pour out the broth [over them].” And he did so. "}],[{"type":"prose","content":"Then the Angel of the  put out the end of the staff that was in His hand and touched the meat and the unleavened bread; and fire flared up from the rock and consumed the meat and the unleavened bread. Then the Angel of the  vanished from his sight. "}],[{"type":"prose","content":"When Gideon realized [without any doubt] that He was the Angel of the , he declared, “Oh no, Lord ! For now I have seen the Angel of the  face to face [and I am doomed]!” "}],[{"type":"prose","content":"The  said to him, “Peace to you, do not be afraid; you shall not die.” "}],[{"type":"prose","content":"Then Gideon built an altar there to the  and named it The  is Peace. To this day it is still in Ophrah, of the Abiezrites."}],[{"type":"prose","content":"Now on that same night the  said to Gideon, “Take your father’s bull, the second bull seven years old, and tear down the altar of Baal that belongs to your father, and cut down the Asherah that is beside it; "}],[{"type":"prose","content":"and build an altar to the  your God on top of this mountain stronghold [with stones laid down] in an orderly way. Then take the second bull and offer a burnt sacrifice using the wood of the Asherah which you shall cut down.” "}],[{"type":"prose","content":"Then Gideon took ten men of his servants and did just as the  had told him; but because he was too afraid of his father’s household (relatives) and the men of the city to do it during daylight, he did it at night."},{"type":"header","content":"The Altar of Baal Destroyed"}],[{"type":"prose","content":"Early the next morning when the men of the city got up, they discovered that the altar of Baal was torn down, and the Asherah which was beside it was cut down, and the second bull was offered on the altar which had been built. "}],[{"type":"prose","content":"So they said to one another, “Who has done this thing?” When they searched about and inquired, they were told, “Gideon the son of Joash did it.” "}],[{"type":"prose","content":"Then the men of the city said to Joash, “Bring out your son, so that he may be executed, because he has torn down the altar of Baal and cut down the Asherah which was beside it.” "}],[{"type":"prose","content":"But Joash said to all who stood against him, “Will you plead for Baal? Will you save him? Whoever pleads for Baal shall be put to death while it is still morning. If Baal is a god, let him defend himself, because someone has torn down his altar.” "}],[{"type":"prose","content":"Therefore on that day he named Gideon Jerubbaal, meaning, “Let Baal plead,” because he had torn down his altar."}],[{"type":"prose","content":"Then all the Midianites and the Amalekites and the people of the east assembled together; and they crossed over [the Jordan] and camped in the Valley of Jezreel. "}],[{"type":"prose","content":"So the Spirit of the  clothed Gideon [and empowered him]; and he blew a trumpet, and the Abiezrites were called together [as a militia] to follow him. "}],[{"type":"prose","content":"He sent messengers throughout [the tribe of] Manasseh, and the fighting men were also called together to follow him; and he sent messengers to [the tribes of] Asher, Zebulun, and Naphtali, and they came up to meet them."},{"type":"header","content":"Sign of the Fleece"}],[{"type":"prose","content":"Then Gideon said to God, “If You are going to rescue Israel through me, as You have spoken, "}],[{"type":"prose","content":"behold, I will put a fleece of [freshly sheared] wool on the threshing floor. If there is dew only on the fleece, and it is dry on all the ground [around it], then I will know that You will rescue Israel through me, as You have said.” "}],[{"type":"prose","content":"And it was so. When he got up early the next morning and squeezed the dew out of the fleece, he wrung from it a bowl full of water. "}],[{"type":"prose","content":"Then Gideon said to God, “Do not let your anger burn against me, so that I may speak once more. Please let me make a test once more with the fleece; now let only the fleece be dry, and let there be dew on all the ground.” "}],[{"type":"prose","content":"God did so that night; for it was dry only on the fleece, and there was dew on all the ground [around it]."}]]