[{"num":6,"verse":"Then the people of Israel began once again to worship other gods, and once again the Lord let their enemies harass them. This time it was by the people of Midian, for seven years. "},{"num":2,"verse":"The Midianites were so cruel that the Israelis took to the mountains, living in caves and dens. "},{"num":3,"verse":"When they planted their seed, marauders from Midian, Amalek, and other neighboring nations came and destroyed their crops and plundered the countryside as far away as Gaza, leaving nothing to eat and taking away all their sheep, oxen, and donkeys. "},{"num":5,"verse":"These enemy hordes arrived on droves of camels too numerous to count and stayed until the land was completely stripped and devastated. "},{"num":6,"verse":"So Israel was reduced to abject poverty because of the Midianites. Then at last the people of Israel began to cry out to the Lord for help."},{"num":8,"verse":"However, the Lord’s reply through the prophet he sent to them was this: “The Lord God of Israel brought you out of slavery in Egypt, "},{"num":9,"verse":"and rescued you from the Egyptians and from all who were cruel to you, and drove out your enemies before you, and gave you their land. "},{"num":10,"verse":"He told you he is the Lord your God, and you must not worship the gods of the Amorites who live around you on every side. But you have not listened to him.”"},{"num":11,"verse":"But one day the Angel of the Lord came and sat beneath the oak tree at Ophrah, on the farm of Joash the Abiezrite. Joash’s son, Gideon, had been threshing wheat by hand in the bottom of a grape press—a pit where grapes were pressed to make wine—for he was hiding from the Midianites."},{"num":12,"verse":"The Angel of the Lord appeared to him and said, “Mighty soldier, the Lord is with you!”"},{"num":13,"verse":"“Stranger,” Gideon replied, “if the Lord is with us, why has all this happened to us? And where are all the miracles our ancestors have told us about—such as when God brought them out of Egypt? Now the Lord has thrown us away and has let the Midianites completely ruin us.”"},{"num":14,"verse":"Then the Lord turned to him and said, “I will make you strong! Go and save Israel from the Midianites! I am sending you!”"},{"num":15,"verse":"But Gideon replied, “Sir, how can I save Israel? My family is the poorest in the whole tribe of Manasseh, and I am the least thought of in the entire family!”"},{"num":16,"verse":"Whereupon the Lord said to him, “But I, Jehovah, will be with you! And you shall quickly destroy the Midianite hordes!”"},{"num":17,"verse":"Gideon replied, “If it is really true that you are going to help me like that, then do some miracle to prove it! Prove that it is really Jehovah who is talking to me! "},{"num":18,"verse":"But stay here until I go and get a present for you.”"},{"num":19,"verse":"Gideon hurried home and roasted a young goat and baked some unleavened bread from a bushel of flour. Then, carrying the meat in a basket and broth in a pot, he took it out to the Angel, who was beneath the oak tree, and presented it to him."},{"num":20,"verse":"The Angel said to him, “Place the meat and the bread upon that rock over there, and pour the broth over it.”"},{"num":21,"verse":"the Angel touched the meat and bread with his staff, and fire flamed up from the rock and consumed them! And suddenly the Angel was gone!"},{"num":22,"verse":"When Gideon realized that it had indeed been the Angel of the Lord, he cried out, “Alas, O Lord God, for I have seen the Angel of the Lord face-to-face!”"},{"num":23,"verse":"“It’s all right,” the Lord replied. “Don’t be afraid! You shall not die.”"},{"num":24,"verse":"And Gideon built an altar there and named it “The Altar of Peace with Jehovah.” (The altar is still there in Ophrah in the land of the Abiezrites.) "},{"num":25,"verse":"That night the Lord told Gideon to hitch his father’s best ox to the family altar of Baal and pull it down, and to cut down the wooden idol of the goddess Asherah that stood nearby."},{"num":26,"verse":"“Replace it with an altar for the Lord your God, built here on this hill, laying the stones carefully. Then sacrifice the ox as a burnt offering to the Lord, using the wooden idol as wood for the fire on the altar.”"},{"num":27,"verse":"So Gideon took ten of his servants and did as the Lord had commanded. But he did it at night for fear of the other members of his father’s household, and for fear of the men of the city; for he knew what would happen if they found out who did it! "},{"num":28,"verse":"Early the next morning, as the city began to stir, someone discovered that the altar of Baal was knocked apart, the idol beside it was gone, and a new altar had been built instead, with the remains of a sacrifice on it."},{"num":29,"verse":"“Who did this?” everyone demanded. Finally they learned that it was Gideon, the son of Joash."},{"num":30,"verse":"“Bring out your son,” they shouted to Joash. “He must die for insulting the altar of Baal and for cutting down the Asherah idol.”"},{"num":31,"verse":"But Joash retorted to the whole mob, “Does Baal need your help? What an insult to a god! You are the ones who should die for insulting Baal! If Baal is really a god, let him take care of himself and destroy the one who broke apart his altar!”"},{"num":32,"verse":"From then on Gideon was called “Jerubbaal,” a nickname meaning “Let Baal take care of himself!”"},{"num":33,"verse":"Soon afterward the armies of Midian, Amalek, and other neighboring nations united in one vast alliance against Israel. They crossed the Jordan and camped in the valley of Jezreel. "},{"num":34,"verse":"Then the Spirit of the Lord came upon Gideon, and he blew a trumpet as a call to arms, and the men of Abiezer came to him. "},{"num":35,"verse":"He also sent messengers throughout Manasseh, Asher, Zebulun, and Naphtali, summoning their fighting forces, and all of them responded."},{"num":36,"verse":"Then Gideon said to God, “If you are really going to use me to save Israel as you promised, "},{"num":37,"verse":"prove it to me in this way: I’ll put some wool on the threshing floor tonight, and if, in the morning, the fleece is wet and the ground is dry, I will know you are going to help me!”"},{"num":38,"verse":"And it happened just that way! When he got up the next morning, he pressed the fleece together and wrung out a whole bowlful of water!"},{"num":39,"verse":"Then Gideon said to the Lord, “Please don’t be angry with me, but let me make one more test: this time let the fleece remain dry while the ground around it is wet!”"},{"num":40,"verse":"So the Lord did as he asked; that night the fleece stayed dry, but the ground was covered with dew!"}]