[{"header":"Chapter 31"},{"num":1,"verse":"The Appointment of Joshua. Moses continued to speak these words to all of Israel,"},{"num":2,"verse":"and he said to them: I am one hundred and twenty years old today. I am no longer able to go about freely. The Lord has told me, “You will not go over this Jordan.”"},{"num":3,"verse":"The Lord, your God, himself will go over before you. He will destroy all of these nations before you so that you might dispossess them. Joshua will lead you over, as the Lord has decreed."},{"num":4,"verse":"The Lord will do to them what he did to Sihon and Og, the kings of the Amorites, and to their land, when he destroyed them."},{"num":5,"verse":"The Lord will deliver them up to you so that you can do to them everything that I ordered you to do."},{"num":6,"verse":"Be strong and courageous. Do not be afraid or terrified of them, for the Lord, your God, is going forth with you. He will never leave you or abandon you."},{"num":7,"verse":"Then Moses summoned Joshua and said to him before all of the Israelites, “Be strong and courageous, for you must go with this people into the land that the Lord, their God, promised their fathers to give to them. You will give it to them as an inheritance."},{"num":8,"verse":"Do not be afraid or dismayed, the Lord will go before you; he will not fail or forsake you.”"},{"num":9,"verse":"The Reading of the Law. Then Moses wrote down this law and he handed it over to the priests, the Levites, who carried the Ark of the Covenant of the Lord, and to all of the elders of Israel."},{"num":10,"verse":"Moses commanded them, saying, “At the end of every seven years, the feast of canceling debts, the Feast of Booths,"},{"num":11,"verse":"when all of Israel comes before the Lord in the place that he has chosen, you are to proclaim it in the hearing of all of Israel."},{"num":12,"verse":"Gather together the people, the men, the women, the children, and the foreigner who lives in your towns, so that they might hear it and learn to fear the Lord, your God, so they might carefully observe the words of this law."},{"num":13,"verse":"Their children, who do not yet know it, must hear it and learn to fear the Lord, your God, the whole time that you are living in the land that you are crossing over the Jordan to enter and possess.”"},{"num":14,"verse":"Commissioning Joshua. The Lord said to Moses, “Behold, the day is approaching when you will die. Summon Joshua and present yourselves before the tent of meeting so that I can commission him.” Moses and Joshua went and presented themselves at the tent of meeting."},{"num":15,"verse":"The Lord appeared at the tent in a pillar of cloud, and the pillar of cloud stood over the entrance to the tent."},{"num":16,"verse":"Predicting Israel’s Rebellion. The Lord said to Moses, “You will soon sleep with your fathers, but this people will rise up and prostitute themselves with foreign gods from the land that they are entering. They will forsake and break the covenant that I have made with them."},{"num":17,"verse":"On the day that I become angry with them and forsake them, I will hide my face from them, and they will be consumed. Many disasters and difficulties will fall upon them. On that day they will say, ‘Have these disasters happened to us because our God is not with us?’"},{"num":18,"verse":"I will certainly hide my face that day on account of all their wickedness in turning to other gods."},{"num":19,"verse":"Now write this song and teach it to the Israelites. Put it in their mouths, so that this song can be a witness for me against the Israelites."},{"num":20,"verse":"When I brought them into the land flowing with milk and honey, the land that I promised to their fathers, and when they ate their fill and flourished, they will turn to other gods and serve them, rejecting me and breaking my covenant."},{"num":21,"verse":"When many disasters and difficulties come upon them, this song will testify against them, because it will not be forgotten by their descendants. I know their inclinations even before I bring them into the land that I promised them by oath.”"},{"num":22,"verse":"So Moses wrote down this song that day, and he taught it to the Israelites."},{"num":23,"verse":"The Lord commissioned Joshua, the son of Nun, saying to him, “Be strong and courageous for you will lead the Israelites into the land that I promised them and I will be with you.”"},{"num":24,"verse":"When Moses had entirely finished writing the words of this law in a book,"},{"num":25,"verse":"Moses gave a command to the Levites who carry the Ark of the Covenant of the Lord,"},{"num":26,"verse":"“Take this book of the law and put it beside the Ark of the Covenant of the Lord, your God, so that it can bear witness against you"},{"num":27,"verse":"for I know how rebellious and stiff-necked you are. If you rebel against the Lord while I am still alive and with you, how much more so will you be after my death."},{"num":28,"verse":"Gather all the elders of your tribes and your officials before me so that I can proclaim these words in their hearing and call upon the heavens and the earth to give witness against them."},{"num":29,"verse":"I know that after my death you will be totally perverse. You will turn away from the way that I have commanded of you. In days to come disasters will shower down upon you because you will have done what is evil in the sight of the Lord, provoking him to anger through the works of your hands.”"},{"num":30,"verse":"Moses then recited in the hearing of the Israelites the words of this entire song."}]