[{"header":"Joshua Becomes the New Leader"},{"num":31,"verse":"Here are the words Moses spoke to all the Israelites. "},{"num":2,"verse":"He said, “I am now 120 years old. I’m not able to lead you anymore. The Lord has said to me, ‘You will not go across the Jordan River.’ "},{"num":3,"verse":"The Lord your God himself will go across ahead of you. He’ll destroy the nations there in order to make room for you. You will take over their land. Joshua will also go across ahead of you, just as the Lord said he would. "},{"num":4,"verse":"The Lord will do to those nations what he did to Sihon and Og. He destroyed those Amorite kings along with their land. "},{"num":5,"verse":"The Lord will hand those nations over to you. Then you must do to them everything I’ve commanded you to do. "},{"num":6,"verse":"Be strong and brave. Don’t be afraid of them. Don’t be terrified because of them. The Lord your God will go with you. He will never leave you. He’ll never desert you.”"},{"num":7,"verse":"Then Moses sent for Joshua. Moses spoke to him in front of all the Israelites. He said, “Be strong and brave. You must go with these people. They are going into the land the Lord promised to give to their people of long ago. You must divide it up among them. They will each receive their share. "},{"num":8,"verse":"The Lord himself will go ahead of you. He will be with you. He will never leave you. He’ll never desert you. So don’t be afraid. Don’t lose hope.”"},{"header":"The Law Must Be Read to the People"},{"num":9,"verse":"Moses wrote down this law. He gave it to the priests, who are sons of Levi. They carried the ark of the covenant of the Lord. He also gave the law to all the elders of Israel. "},{"num":10,"verse":"Then Moses commanded them, “You must read this law at the end of every seven years. Do it in the year when you forgive people what they owe. Read it during the Feast of Booths. "},{"num":11,"verse":"That’s when all the Israelites come to appear in front of the Lord your God at the holy tent. It will be at the place he will choose. You must read this law to them. "},{"num":12,"verse":"Gather the people together. Gather the men, women and children. Also bring together the outsiders living in your towns. Then they can listen and learn to have respect for the Lord your God. And they’ll be careful to obey all the words of this law. "},{"num":13,"verse":"Their children must hear it read too. They don’t know this law yet. They too must learn to have respect for the Lord your God. They must honor him as long as you live in the land. You are about to go across the Jordan River and take that land as your very own.”"},{"header":"The Israelites Will Refuse to Obey the Lord"},{"num":14,"verse":"The Lord said to Moses, “The day when you will die is near. Have Joshua go to the tent of meeting. Join him there. That is where I will appoint him as the new leader.” So Joshua and Moses went to the tent of meeting."},{"num":15,"verse":"Then the Lord appeared at the tent in a pillar of cloud. It stood over the entrance to the tent. "},{"num":16,"verse":"The Lord spoke to Moses. He said, “You are going to join the members of your family who have already died. The Israelites will not be faithful to me. They will soon join themselves to the false gods that are worshiped in the land they are entering. The people will desert me. They will break the covenant I made with them. "},{"num":17,"verse":"In that day I will become angry with them. I will desert them. I will turn my face away from them. And they will be destroyed. Many horrible troubles and hard times will come on them. On that day they will say, ‘Trouble has come on us. Our God isn’t with us!’ "},{"num":18,"verse":"I will certainly turn away from them on that day. I will do it because they did a very evil thing when they turned to other gods."},{"num":19,"verse":"“I want you to write down a song and teach it to the Israelites. Have them sing it. It will be my witness against them. "},{"num":20,"verse":"I will bring them into a land that has plenty of milk and honey. I promised the land to their people of long ago. In that land they will eat until they have had enough. They will get fat. When they do, they will turn to other gods and worship them. They will turn their backs on me. They will break my covenant. "},{"num":21,"verse":"Many horrible troubles and hard times will come on them. Then the song I am giving you will be a witness against them. That is because the song will not be forgotten by their children and their children’s children. I know what they are likely to do. I know it even before I bring them into the land I promised them.” "},{"num":22,"verse":"So that day Moses wrote the song down. And Moses taught it to the Israelites."},{"num":23,"verse":"The Lord gave a command to Joshua, the son of Nun. He said, “Be strong and brave. You will bring the Israelites into the land I promised them. I myself will be with you.”"},{"num":24,"verse":"Moses finished writing the words of this law in a book. He wrote them down from beginning to end. "},{"num":25,"verse":"Then he gave a command to the Levites who carried the ark of the covenant of the Lord. Moses said, "},{"num":26,"verse":"“Take this Book of the Law. Place it beside the ark of the covenant of the Lord your God. It will remain there as a witness against you. "},{"num":27,"verse":"I know how you refuse to obey the Lord. I know how stubborn you are. You have refused to obey him while I’ve been living among you. So you will certainly refuse to obey him after I’m dead! "},{"num":28,"verse":"Gather together all the elders of your tribes and all your officials. Bring them to me. Then I can speak these words to them. I can call for the heavens and the earth to be witnesses against them. "},{"num":29,"verse":"I know that after I’m dead you will certainly become very sinful. You will turn away from the path I’ve commanded you to take. In days to come, trouble will fall on you. That’s because you will do what is evil in the sight of the Lord. You will make him very angry because of the statues of gods your hands have made.”"},{"header":"The Song of Moses"},{"num":30,"verse":"Moses spoke the words of this song from beginning to end. The whole community of Israel heard them. Here is what he said."}]