[{"header":"Jacob Arrives in Northwestern Mesopotamia"},{"num":29,"verse":"Then Jacob ·continued his journey [lifted his feet] and came to the land of the people of the East [the area of the Arameans on the northern Euphrates]. "},{"num":2,"verse":"He looked and saw a well in the field and three flocks of sheep lying nearby, because they drank water from this well. A large stone covered the mouth of the well. "},{"num":3,"verse":"When all the flocks would gather there, ·the shepherds [they] would roll the stone away from the well and water the sheep. Then they would put the stone back in its place."},{"num":4,"verse":"Jacob said to the shepherds there, “My brothers, where are you from?”"},{"num":5,"verse":"Then Jacob asked, “Do you know Laban, ·grandson [descendant] of Nahor?”"},{"num":6,"verse":"Then Jacob asked, “How is he?”"},{"num":7,"verse":"Jacob said, “But look, it is still ·the middle of the day [broad daylight]. It is not time for the sheep to be gathered for the night, so give them water and let them go back into the pasture.”"},{"num":8,"verse":"But they said, “We cannot do that until all the flocks are gathered. Then we will roll away the stone from the mouth of the well and water the sheep.”"},{"num":9,"verse":"While ·Jacob [he] was talking with ·the shepherds [them], Rachel came with her father’s sheep, because ·it was her job to care for the sheep [she was a shepherdess]. "},{"num":10,"verse":"When Jacob saw Laban’s daughter Rachel and Laban’s sheep, he went to the well and rolled the stone from its mouth and watered Laban’s sheep. Now Laban was the brother of Rebekah, Jacob’s mother. "},{"num":11,"verse":"Then Jacob kissed Rachel and [lifted his voice and] cried. "},{"num":12,"verse":"He told her that he was from her father’s family and that he was the son of Rebekah. So Rachel ran home and told her father."},{"num":13,"verse":"When Laban heard the news about his sister’s son Jacob, he ran to meet him. Laban hugged him and kissed him and brought him to his house, where Jacob told Laban everything that had happened."},{"num":14,"verse":"Then Laban said, “You are my own ·flesh and blood [bone and flesh].”"},{"header":"Jacob Is Tricked"},{"num":15,"verse":"Then Laban said to Jacob, “You are my relative, but ·it is not right for you to work for me without pay [should you serve me for nothing?]. What ·would you like me to pay you [will your wages be]?”"},{"num":16,"verse":"Now Laban had two daughters. The older was Leah, and the younger was Rachel. "},{"num":17,"verse":"Leah had ·weak eyes [frail/tender eyes; likely means unattractive], but Rachel was very beautiful. "},{"num":18,"verse":"Jacob loved Rachel, so he said to Laban, “·Let me marry your younger daughter Rachel. If you will, I will work seven years for you [I will work for seven years for your younger daughter Rachel].”"},{"num":19,"verse":"Laban said, “It would be better for ·her to marry you [me to give her to you] than someone else, so stay here with me.” "},{"num":20,"verse":"So Jacob worked for Laban seven years so he could marry Rachel. But they seemed like just a few days to him because he loved Rachel very much."},{"num":21,"verse":"After seven years Jacob said to Laban, “Give me ·Rachel [my woman/wife] so that I may ·marry [go to] her. ·The time I promised to work for you is over [My days are fulfilled].”"},{"num":22,"verse":"So Laban gave a ·feast [banquet] for all the people there. "},{"num":23,"verse":"That evening he brought his daughter Leah to Jacob, and ·they had sexual relations [he (Jacob) went into her]. "},{"num":24,"verse":"(Laban gave his slave girl Zilpah to his daughter to be her ·servant [slave girl].) "},{"num":25,"verse":"In the morning when Jacob saw that ·he had had sexual relations with [it was] Leah, he said to Laban, “What have you done to me? I worked hard for you so that I could marry Rachel! Why did you ·trick [deceive; defraud] me?”"},{"num":26,"verse":"Laban said, “In our ·country [place] we do not allow the younger daughter to marry before the ·older daughter [firstborn]. "},{"num":27,"verse":"But complete the full week of ·the marriage ceremony with Leah [this one], and I will give you ·Rachel [the other one] to marry also. But you must serve me another seven years.”"},{"num":28,"verse":"So Jacob did this, and when he had completed the week ·with Leah [of this one], Laban gave him his daughter Rachel as a wife. "},{"num":29,"verse":"(Laban gave his slave girl Bilhah to his daughter Rachel to be her ·servant [slave girl].) "},{"num":30,"verse":"So Jacob ·had sexual relations with [went to] Rachel also, and Jacob loved Rachel more than Leah. Jacob worked for Laban for another seven years."},{"header":"Jacob’s Family Grows"},{"num":31,"verse":"When the Lord saw ·that Jacob loved Rachel more than Leah [Leah was unloved/hated], he ·made it possible for Leah to have children [opened up her womb], but ·not Rachel [Rachel was barren]. "},{"num":32,"verse":"Leah ·became pregnant [conceived] and gave birth to a son. She named him Reuben [sounds like “seen my troubles” in Hebrew], because she said, “The Lord has seen my ·troubles [distress]. Surely now my husband will love me.”"},{"num":33,"verse":"Leah ·became pregnant [conceived] again and gave birth to another son. She named him Simeon [sounds like “has heard” in Hebrew] and said, “The Lord has heard that I am ·not loved [or hated], so he has given me this son.”"},{"num":34,"verse":"Leah ·became pregnant [conceived] again and gave birth to another son. She named him Levi [sounds like “be close to” in Hebrew] and said, “Now, surely my husband will ·be close [bind/attach himself] to me, because I have given him three sons.”"},{"num":35,"verse":"Then Leah gave birth to another son. She named him Judah [sounds like “praise” in Hebrew], because she said, “Now I will praise the Lord.” Then Leah stopped having children."}]