[{"header":"Jacob Arrives at Laban's Home"},{"num":29,"verse":"Jacob continued on his way and went toward the land of the East. "},{"num":2,"verse":"Suddenly he came upon a well out in the fields with three flocks of sheep lying around it. The flocks were watered from this well, which had a large stone over the opening. "},{"num":3,"verse":"Whenever all the flocks came together there, the shepherds would roll the stone back and water them. Then they would put the stone back in place."},{"num":4,"verse":"Jacob asked the shepherds, “My friends, where are you from?”"},{"num":5,"verse":"He asked, “Do you know Laban, grandson of Nahor?”"},{"num":6,"verse":"“Is he well?” he asked."},{"num":7,"verse":"Jacob said, “Since it is still broad daylight and not yet time to bring the flocks in, why don't you water them and take them back to pasture?”"},{"num":8,"verse":"They answered, “We can't do that until all the flocks are here and the stone has been rolled back; then we will water the flocks.”"},{"num":9,"verse":"While Jacob was still talking with them, Rachel arrived with the flock. "},{"num":10,"verse":"When Jacob saw Rachel with his uncle Laban's flock, he went to the well, rolled the stone back, and watered the sheep. "},{"num":11,"verse":"Then he kissed her and began to cry for joy. "},{"num":12,"verse":"He told her, “I am your father's relative, the son of Rebecca.”"},{"num":13,"verse":"and when he heard the news about his nephew Jacob, he ran to meet him, hugged him and kissed him, and brought him into the house. When Jacob told Laban everything that had happened, "},{"num":14,"verse":"Laban said, “Yes, indeed, you are my own flesh and blood.” Jacob stayed there a whole month."},{"header":"Jacob Serves Laban for Rachel and Leah"},{"num":15,"verse":"Laban said to Jacob, “You shouldn't work for me for nothing just because you are my relative. How much pay do you want?” "},{"num":16,"verse":"Laban had two daughters; the older was named Leah, and the younger Rachel. "},{"num":17,"verse":"Leah had lovely eyes, but Rachel was shapely and beautiful."},{"num":18,"verse":"Jacob was in love with Rachel, so he said, “I will work seven years for you, if you will let me marry Rachel.”"},{"num":19,"verse":"Laban answered, “I would rather give her to you than to anyone else; stay here with me.” "},{"num":20,"verse":"Jacob worked seven years so that he could have Rachel, and the time seemed like only a few days to him, because he loved her."},{"num":21,"verse":"Then Jacob said to Laban, “The time is up; let me marry your daughter.” "},{"num":22,"verse":"So Laban gave a wedding feast and invited everyone. "},{"num":23,"verse":"But that night, instead of Rachel, he took Leah to Jacob, and Jacob had intercourse with her. "},{"num":24,"verse":"(Laban gave his slave woman Zilpah to his daughter Leah as her maid.) "},{"num":25,"verse":"Not until the next morning did Jacob discover that it was Leah. He went to Laban and said, “Why did you do this to me? I worked to get Rachel. Why have you tricked me?”"},{"num":26,"verse":"Laban answered, “It is not the custom here to give the younger daughter in marriage before the older. "},{"num":27,"verse":"Wait until the week's marriage celebrations are over, and I will give you Rachel, if you will work for me another seven years.”"},{"num":28,"verse":"Jacob agreed, and when the week of marriage celebrations was over, Laban gave him his daughter Rachel as his wife. "},{"num":29,"verse":"(Laban gave his slave woman Bilhah to his daughter Rachel as her maid.) "},{"num":30,"verse":"Jacob had intercourse with Rachel also, and he loved her more than Leah. Then he worked for Laban another seven years."},{"header":"The Children Born to Jacob"},{"num":31,"verse":"When the Lord saw that Leah was loved less than Rachel, he made it possible for her to have children, but Rachel remained childless. "},{"num":32,"verse":"Leah became pregnant and gave birth to a son. She said, “The Lord has seen my trouble, and now my husband will love me”; so she named him Reuben. "},{"num":33,"verse":"She became pregnant again and gave birth to another son. She said, “The Lord has given me this son also, because he heard that I was not loved”; so she named him Simeon. "},{"num":34,"verse":"Once again she became pregnant and gave birth to another son. She said, “Now my husband will be bound more tightly to me, because I have borne him three sons”; so she named him Levi. "},{"num":35,"verse":"Then she became pregnant again and gave birth to another son. She said, “This time I will praise the Lord”; so she named him Judah. Then she stopped having children."}]