[{"num":1,"verse":"These be the names of the sons of Israel, that entered into Egypt with Jacob; all entered with their house(hold)s;"},{"num":2,"verse":"Reuben, Simeon, Levi, Judah,"},{"num":3,"verse":"Issachar, Zebulun, and Benjamin,"},{"num":4,"verse":"Dan, and Naphtali, Gad, and Asher."},{"num":5,"verse":"Therefore all the souls of them that went out of the hip of Jacob were seventy and five. Forsooth Joseph was in Egypt; (And so all the souls of those who went out of the hip of Jacob were seventy. And Joseph was already in Egypt;)"},{"num":6,"verse":"and when he was dead (and after he died), and all his brethren, and all his kindred,"},{"num":7,"verse":"the sons of Israel increased, and were multiplied as burgeoning, and they were made strong greatly, and filled the land. (the Israelites increased, and were multiplied like burgeonings, and they were made very strong, and filled the land.)"},{"num":8,"verse":"(But) A new king, that knew not Joseph, rose [up] in the meantime on Egypt,"},{"num":9,"verse":"and said to his people, Lo! the people of the sons of Israel is much, and stronger than we;"},{"num":10,"verse":"come ye, wisely oppress we it, lest peradventure it be multiplied; and lest, if battle riseth against us, it be added to our enemies, and go out of the land, when we be overcome. (so come ye, and let us wisely oppress them, lest they be multiplied; and lest, if battle riseth against us, they join our enemies, and when we be overcome, they leave here.)"},{"num":11,"verse":"And so he made (the) masters of (the) works (to be the) sovereigns to them, that they should torment them with charges. And they made [the] cities of tabernacles, either of treasures, as it is in Hebrew, to Pharaoh, Pithom, and Raamses. (And so he set the taskmasters to be their rulers, and to torment them with burdens. And they made for Pharaoh the cities of treasures, that is, Pithom, and Raamses.)"},{"num":12,"verse":"And by how much they oppressed them, by so much they were multiplied, and increased the more. (But the more that they oppressed them, the more they multiplied, and increased.)"},{"num":13,"verse":"And (so) the Egyptians hated the sons of Israel, and tormented, and scorned them;"},{"num":14,"verse":"and they brought their life to bitterness, by hard works of clay and of tilestone, and by all servage, by which they were oppressed in the works of [the] earth. (and they made their life bitter, by hard work with clay and bricks, and by all the servitude, or all the slavery, by which they were oppressed with their work in the land.)"},{"num":15,"verse":"Forsooth the king of Egypt said to the midwives of (the) Hebrews, of which one was called Shiphrah, [and] the tother Puah;"},{"num":16,"verse":"and he commanded to them, When ye shall do the office of midwives to [the] Hebrew women, and the time of child-bearing shall come, if it is a knave child, slay ye him; if it is a woman (child), keep ye it. (and he commanded to them, and said, When ye shall do midwifing for the Hebrew women, and the time of child-bearing shall come, if it is a male child, kill ye him; but if it is a female child, keep ye her.)"},{"num":17,"verse":"But the midwives dreaded God, and did not by the commandment of the king of Egypt, but kept the knave children. (But the midwives feared God, and did not comply with the king of Egypt’s command, but let the male children live.)"},{"num":18,"verse":"To the which (when) called to him, the king said, What is this thing that ye would do, that ye would keep the knave children? (To whom, when called to him, the king said, What is this thing that ye would do, that ye have let the male children live?)"},{"num":19,"verse":"The which answered, Hebrew women be not as the women of Egypt, for they have knowing of the craft of midwifing, and childed before that we come to them. (And they answered, Hebrew women be not like the Egyptian women, for they have knowledge of the craft of midwifing, and have given birth before that we come to them.)"},{"num":20,"verse":"Therefore God did well to the midwives; and the people increased, and was comforted greatly (and were greatly strengthened)."},{"num":21,"verse":"And for the midwives dreaded God, God builded them houses. (And because the midwives feared God, God gave them their own households, or their own families.)"},{"num":22,"verse":"Therefore Pharaoh commanded (to) all his people, and said, Whatever thing of male kind is born to (the) Hebrews, cast ye into the flood (cast ye them into the River, that is, into the Nile); (but) whatever thing of women kind (is born), keep ye (them)."}]