[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "IV.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) If we assay.—Rather, perhaps, Has one ever assayed? or, Has a word ever been tried? It appears from Job 29:9-10, that Job was held in great honour and reverence by all, and Eliphaz regarded him with awe such as would have constrained him to be silent, but he is so convinced that Job is wrong and deserves reproof, that he cannot refrain from speaking. He strikes a note, however, which the friends all sound, namely, that it is the wicked who suffer, and that all who suffer must be wicked. This, in a variety of forms, is the sum and substance of what they have to say.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "If we assay.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Rather, perhaps, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Has one ever assayed? ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Has a word ever been tried? ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "It appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that Job was held in great honour and reverence by all, and Eliphaz regarded him with awe such as would have constrained him to be silent, but he is so convinced that Job is wrong and deserves reproof, that he cannot refrain from speaking. He strikes a note, however, which the friends all sound, namely, that it is the wicked who suffer, and that all who suffer must be wicked. This, in a variety of forms, is the sum and substance of what they have to say.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 4:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If we assay to commune with thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This is nearly the sense, but not exactly the construction of the Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "הנסה דבר אליךְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hanissah dabar eeleka, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Annon aggrediemur sermonem adversus te. Shall we not attempt a discourse against thee? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Shall we suffer thee to go on with thy complaints? Shall we hear thee with patience, and be altogether silent, without so much as attempting a reply? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wilt thou be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grieved? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou wilt be grieved; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "תלאה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tileh, moleste feres, thou wilt take it ill. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Our words will undoubtedly vex, and not comfort thee, as we desired and intended to do. For truth is surely to be regarded more than friendship, and we cannot, in consistency therewith, speak words of consolation, but we must use those of sharp reproof. This makes me desire to be silent, were it possible. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But who can withhold? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The Hebrew",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ועצר במלין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vagnetser bemillin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., is literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But to refrain from words, who can? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who, when he hears such unreasonable and ungodly words, coming from such a person as thou art, words whereby thou dost accuse thy Maker, reproach his providence, and contemn his blessings, can forbear speaking? No man, who hath any respect to God, or love to thee, can refrain from reproving thee. I will, therefore, suggest to thee some of those observations, which were the thoughts of wise and prudent men of old time; and from which, if well applied, thou mayest receive singular profit. The verse is intended as an apology for what he was about to say.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-6 Satan undertook to prove Job a hypocrite by afflicting him; and his friends concluded him to be one because he was so afflicted, and showed impatience. This we must keep in mind if we would understand what passed. Eliphaz speaks of Job, and his afflicted condition, with tenderness; but charges him with weakness and faint-heartedness. Men make few allowances for those who have taught others. Even pious friends will count that only a touch which we feel as a wound. Learn from hence to draw off the mind of a sufferer from brooding over the affliction, to look at the God of mercies in the affliction. And how can this be done so well as by looking to Christ Jesus, in whose unequalled sorrows every child of God soonest learns to forget his own?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If we assay to commune with thee - Margin, A word. Hebrew - הנסה דבר  dâbâr hanı̂câh. \"May we attempt a word with thee?\" This is a gentle and polite apology at the beginning of his speech - an inquiry whether he would take it as unkind if one should adventure on a remark in the way of argument. Jahn, in characterizing the part which Job's three friends respectively take in the controversy, says: \"Eliphaz is superior to the others in discernment and delicacy. He begins by addressing Job mildly; and it is not until irritated by opposition that he reckons him among the wicked.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wilt thou be grieved? - That is, Wilt thou take it ill? Will it be offensive to you, or weary you, or tire your patience? The word used here (לאה  lâ'âh) means to labor, to strive, to weary, to exhaust; and hence, to be weary, to try one's patience, to take anything ill. Here it is the language of courtesy, and is designed to introduce the subsequent remarks in the kindest manner. Eliphaz knew that he was about to make observations which might implicate Job, and he introduced them in as kind a manner as possible. There is nothing abrupt or harsh in his beginning. All is courteous in the highest degree, and is a model for debaters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But who can withhold himself from speaking? - Margin, \"Refrain from words.\" That is, \"the subject is so important, the sentiments advanced by Job are so extraordinary, and the principles involved are so momentous, that it is impossible to refrain.\" There is much delicacy in this. He did not begin to speak merely to make a speech. He professes that be would not have spoken, if he had not been pressed by the importance of the subject, and had not been full of matter. To a great extent, this is a good rule to adopt: not to make a speech unless there are sentiments which weigh upon the mind, and convictions of duty which cannot be repressed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But who can withhold himself from speaking? - Margin, \"Refrain from words.\" That is, \"the subject is so important, the sentiments advanced by Job are so extraordinary, and the principles involved are so momentous, that it is impossible to refrain.\" There is much delicacy in this. He did not begin to speak merely to make a speech. He professes that be would not have spoken, if he had not been pressed by the importance of the subject, and had not been full of matter. To a great extent, this is a good rule to adopt: not to make a speech unless there are sentiments which weigh upon the mind, and convictions of duty which cannot be repressed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. If we assay to commune—Rather, two questions, \"May we attempt a word with thee? Wilt thou be grieved at it?\" Even pious friends often count that only a touch which we feel as a wound.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wilt thou be grieved?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, (without a note of interrogation,)",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " thou wilt be grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Our words will undoubtedly vex thee, and not comfort thee, as we intended and desired to do. We must not use words of comfort, but of sharp reproof, which will be irksome to thee; and this makes me desire to be silent, if it were possible. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who can withhold himself from speaking, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when he hears such unreasonable and ungodly words coming from such a person as thou art, whereby thou dost accuse thy Maker, and reproach his providence, and contemn his blessings? No man who hath any respect to God, or love to thee, can forbear reproving thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If we assay to commune with thee, wilt thou be grieved?.... Eliphaz speaks in the name of himself and his two friends, who had doubtless consulted together, and compared their sentiments of Job; which appearing to be the same, they formed a plan and scheme in which they should attack him, and the part which each should take, and the order in which they should proceed: these words are said, either as seemingly doubting whether they should speak or be silent; for they may be rendered, \"shall we try\", or attempt, to drop or speak a \"word to thee\"; to enter into a conversation with thee? or, \"shall we take up a discourse\", and carry it on with thee, \"who art grieved\" already? or art weary and heavy laden, and bore down with the burden of affliction, with sorrows and troubles; or art impatient (h) under them; we fear, should we, that thou wilt be more grieved and burdened, and become more impatient; and therefore know not well what to do: or else, as supposing and taking it for granted that he would be grieved and burdened, and made more restless and uneasy, impatient and outrageous, yet they had determined to enter into a debate with him; for so the words are by some rendered, \"should we speak a word unto thee\"; or, \"against thee\" (i); even should the least word be spoken against thee, thou wilt be weary (k), or burdened, or grieved, or take it ill: we know thou wilt; yet, nevertheless, we must not, we cannot, we will not forbear speaking: or else interrogatively, as our version and others, \"wilt thou be grieved?\" we desire thou wouldest not, nor take it ill from us, but all in good part; we mean no hurt, we design no ill, but thy good, and beg thou wilt hear us patiently: this shows how great a man Job had been, and in what reverence and respect he was had, that his friends bespeak him after this manner in his low estate; however, this was artifice in them, to introduce the discourse, and bring on the debate after this sort: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but who can withhold himself from speaking? be it as it will; Eliphaz suggests, though Job was already and greatly burdened, and would be more so, and break out into greater impatience, yet there was a necessity of speaking, it could not be forborne; no man could refrain himself from speaking, nor ought in such a case, when the providence of God was reflected upon, and he was blasphemed and evil spoken of, and charged with injustice, as was supposed; in such circumstances, no good, no faithful man, could or ought to keep silence; indeed, when the glory of God, the honour of the Redeemer, and the good of souls require it, and a man's own reputation with respect to his faithfulness lies at stake, silence should not be kept, let the consequence be as it may; but how far this was the case may be considered. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h)    \"num suscipiemus verbum ad te, qui impatiens es?\" Schmidt; \"qui jam dum lassatus\", Michaelis. (i) \"Contra te\", Piscator. (k) \"Forsitan moleste accipies\", V. L. \"fatisces\", Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h)    \"num suscipiemus verbum ad te, qui impatiens es?\" Schmidt; \"qui jam dum lassatus\", Michaelis. (i) \"Contra te\", Piscator. (k) \"Forsitan moleste accipies\", V. L. \"fatisces\", Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If we assay to commune with thee, wilt thou be grieved? but {a} who can withhold himself from speaking?",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "If",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we assay to commune with thee, wilt thou be grieved? but ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who can withhold himself from speaking?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Seeing your impatience.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If we assay to commune",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if one should assay a word with thee. be grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This word is rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou faintest, Job 4:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou faintest, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to be weary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; this may be equivalent either to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be impatient",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be exhausted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is difficult to decide here. We may render, leaving the ambiguity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will it be too much for thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? Eliphaz speaks unwillingly, and would spare Job, but he is compelled by the frame of mind in which he sees his friend.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If we assay to commune with thee, wilt thou be grieved?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "If one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "assay a word against thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "wilt thou be angry?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Eliphaz feels that what he is about to say will be unwelcome, and, as it were, apologizes beforehand. Surely Job will not be angry if a friend just ventures a word. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But who can withhold himself from speaking?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Let Job be angry or not, Eliphaz must speak. It is impossible to hear such words as Job has uttered, and yet keep silence. God's wisdom and justice have been impugned, and must be vindicated. Job 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  2  If one attempts a word with thee, will it grieve thee?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And still to restrain himself from words, who is able?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  Behold, thou hast instructed many,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the weak hands thou hast strengthened.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  4  The stumbling turned to thy words,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the sinking knees thou hast strengthened.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  5  But now it cometh to thee, thou art grieved;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now it toucheth thee, thou despondest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The question with which Eliphaz beings, is certainly one of those in which the tone of interrogation falls on the second of the paratactically connected sentences: Wilt thou, if we speak to thee, feel it unbearable? Similar examples are Job 4:21; Numbers 16:22; Jeremiah 8:4; and with interrogative Wherefore? Isaiah 5:4; Isaiah 50:2 : comp. the similar paratactic union of sentences, Job 2:10; Job 3:11. The question arises here, whether נסּה is an Aramaic form of writing for נשּׂא (as the Masora in distinction from Deuteronomy 4:34 takes it), and also either future, Wilt thou, if we raise, i.e., utter, etc.; or passive, as Ewald formerly, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The question with which Eliphaz beings, is certainly one of those in which the tone of interrogation falls on the second of the paratactically connected sentences: Wilt thou, if we speak to thee, feel it unbearable? Similar examples are ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 16:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and with interrogative Wherefore? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : comp. the similar paratactic union of sentences, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 3:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The question arises here, whether נסּה is an Aramaic form of writing for נשּׂא (as the Masora in distinction from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " takes it), and also either future, Wilt thou, if we raise, i.e., utter, etc.; or passive, as Ewald formerly, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In the second edition, comp. Jahrb. ix. 37, he explains it otherwise: \"If we attempt a word with thee, will it be grievous to thee quod aegre feras?\" But that, however, must be נסּה; the form נסּה can only be third pers. Piel: If any one attempts, etc., which, according to Ewald's construction, gives no suitable rendering.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If a word is raised, i.e., uttered, דּבר נשׂא, like משׁל נשׂא, Job 27:1; or whether it is third pers. Piel, with the signification, attempt, tentare, Ecclesiastes 7:23. The last is to be preferred, because more admissible and also more expressive. נסּה followed by the fut. is a hypothetic praet., Supposing that, etc., wilt thou, etc., as e.g., Job 23:10. מלּין is the Aramaic plur. of מלּה, which is more frequent in the book of Job than the Hebrew plur. מלּים. The futt., Job 4:3., because following the perf., are like imperfects in the western languages: the expression is like Isaiah 35:3. In עתּה כּי, Job 4:5, כּי has a temporal signification, Now when, Ges. 155, 1, e, (b). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If a word is raised, i.e., uttered, דּבר נשׂא, like משׁל נשׂא, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or whether it is third pers. Piel, with the signification, attempt, tentare, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 7:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The last is to be preferred, because more admissible and also more expressive. נסּה followed by the fut. is a hypothetic praet., Supposing that, etc., wilt thou, etc., as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". מלּין is the Aramaic plur. of מלּה, which is more frequent in the book of Job than the Hebrew plur. מלּים. The futt., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., because following the perf., are like imperfects in the western languages: the expression is like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In עתּה כּי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", כּי has a temporal signification, Now when, Ges. 155, 1, e, (b). ",
            "children": []
          }
        ]
      }
    ]
  }
]