[{"num":51,"verse":"1 To trust in God alone by Abraham’s example. 7 Not to fear men. 17 The great affliction of Jerusalem, 22 and her deliverance."},{"num":1,"verse":"Hear me ye that follow after righteousness, and ye that seek the Lord: look unto the rock, whence you are hewn, and to the hole of the pit, whence ye are dug."},{"num":2,"verse":"Consider Abraham your father, and Sarah that bare you: for I called him alone, and blessed him and increased him."},{"num":3,"verse":"Surely the Lord shall comfort Zion: he shall comfort all her desolations, and he shall make her desert like Eden, and her wilderness like the garden of the Lord: joy and gladness shall be found therein: praise, and the voice of singing."},{"num":4,"verse":"Hearken ye unto me my people, and give ear unto me, O my people: for a Law shall proceed from me, and I will bring forth my judgment for the light of the people."},{"num":5,"verse":"My righteousness is near: my salvation goeth forth, and mine arm shall judge the people: the isles shall wait for me, and shall trust unto mine arm."},{"num":6,"verse":"Lift up your eyes to the heavens, and look upon the earth beneath: for the heavens shall vanish away like smoke, and the earth shall wax old like a garment, and they that dwell therein, shall perish in like manner: but my salvation shall be forever, and my righteousness shall not be abolished."},{"num":7,"verse":"Hearken unto me ye that know righteousness, the people in whose heart is my Law. Fear ye not the reproach of men, neither be ye afraid of their rebukes."},{"num":8,"verse":"For the moth shall eat them up like a garment, and the worm shall eat them like wood: but my righteousness shall be forever, and my salvation from generation to generation."},{"num":9,"verse":"Rise up, Rise up, and put on strength, O arm of the Lord: rise up as in the old time in the generations of the world. Art not thou the same, that hath cut Rahab, and wounded the dragon?"},{"num":10,"verse":"Art not thou the same, which hath dried the Sea, even the waters of the great deep, making the depth of the sea a way for the redeemed to pass over?"},{"num":11,"verse":"Therefore the redeemed of the Lord shall return, and come with joy unto Zion, and everlasting joy shall be upon their head: they shall obtain joy and gladness: and sorrow and mourning shall flee away."},{"num":12,"verse":"I, even I am he that comfort you. Who art thou that thou shouldest fear a mortal man, and the son of man, which shall be made as grass?"},{"num":13,"verse":"And forgettest the Lord thy maker, that hath spread out the heavens, and laid the foundations of the earth? and hast feared continually all the day, because of the rage of the oppressor, which is ready to destroy? Where is now the rage of the oppressor?"},{"num":14,"verse":"The captive hasteneth to be loosed, and that he should not die in the pit, nor that his bread should fail."},{"num":15,"verse":"And I am the Lord thy God that divided the sea, when his waves roared: the Lord of hosts is his Name."},{"num":16,"verse":"And I have put my words in thy mouth, and have defended thee in the shadow of mine hand, that I may plant the heavens, and lay the foundation of the earth, and say unto Zion, Thou art my people."},{"num":17,"verse":"Awake, awake, and stand up, O Jerusalem, which hast drunk at the hand of the Lord the cup of his wrath: thou hast drunken the dregs of the cup of trembling, and wrung them out."},{"num":18,"verse":"There is none to guide her among all her sons, whom she hath brought forth: there is none that taketh her by the hand of all the sons that she hath brought up."},{"num":19,"verse":"These two things are come unto thee: who will lament thee? desolation and destruction and famine, and the sword: by whom shall I comfort thee?"},{"num":20,"verse":"Thy sons have fainted, and lie at the head of all the streets as a wild bull in a net, and are full of the wrath of the Lord, and rebuke of thy God."},{"num":21,"verse":"Therefore hear now this, thou miserable and drunken, but not with wine."},{"num":22,"verse":"Thus saith thy Lord God, even God that pleadeth the cause of his people, Behold, I have taken out of thine hand the cup of trembling, even the dregs of the cup of my wrath: thou shalt drink it no more."},{"num":23,"verse":"But I will put it into their hand that spoil thee, which have said to thy soul, Bow down that we may go over, and thou hast laid thy body as the ground, and as the streets to them that went over."}]