[{"num":40,"verse":"Comfort, comfort My people, says your God."},{"num":2,"verse":"Speak tenderly to the heart of Jerusalem, and cry to her that her time of service and her warfare are ended, that [her punishment is accepted and] her iniquity is pardoned, that she has received [punishment] from the Lord’s hand double for all her sins."},{"num":3,"verse":"A voice of one who cries: Prepare in the wilderness the way of the Lord [clear away the obstacles]; make straight and smooth in the desert a highway for our God!"},{"num":4,"verse":"Every valley shall be lifted and filled up, and every mountain and hill shall be made low; and the crooked and uneven shall be made straight and level, and the rough places a plain."},{"num":5,"verse":"And the glory (majesty and splendor) of the Lord shall be revealed, and all flesh shall see it together; for the mouth of the Lord has spoken it."},{"num":6,"verse":"A voice says, Cry [prophesy]! And I said, What shall I cry? [The voice answered, Proclaim:] All flesh is as frail as grass, and all that makes it attractive [its kindness, its goodwill, its mercy from God, its glory and comeliness, however good] is transitory, like the flower of the field."},{"num":7,"verse":"The grass withers, the flower fades, when the breath of the Lord blows upon it; surely [all] the people are like grass."},{"num":8,"verse":"The grass withers, the flower fades, but the word of our God will stand forever."},{"num":9,"verse":"O you who bring good tidings to Zion, get up to the high mountain. O you who bring good tidings to Jerusalem, lift up your voice with strength, lift it up, be not afraid; say to the cities of Judah, Behold your God!"},{"num":10,"verse":"Behold, the Lord God will come with might, and His arm will rule for Him. Behold, His reward is with Him, and His recompense before Him."},{"num":11,"verse":"He will feed His flock like a shepherd: He will gather the lambs in His arm, He will carry them in His bosom and will gently lead those that have their young."},{"num":12,"verse":"Who has measured the waters in the hollow of his hand, marked off the heavens with a [nine-inch] span, enclosed the dust of the earth in a measure, and weighed the mountains in scales and the hills in a balance?"},{"num":13,"verse":"Who has directed the Spirit of the Lord, or as His counselor has taught Him?"},{"num":14,"verse":"With whom did He take counsel, that instruction might be given Him? Who taught Him the path of justice and taught Him knowledge and showed Him the way of understanding?"},{"num":15,"verse":"Behold, the nations are like a drop from a bucket and are counted as small dust on the scales; behold, He takes up the isles like a very little thing."},{"num":16,"verse":"And all Lebanon’s [forests] cannot supply sufficient fuel, nor all its wild beasts furnish victims enough to burn sacrifices [worthy of the Lord]."},{"num":17,"verse":"All the nations are as nothing before Him; they are regarded by Him as less than nothing and emptiness (waste, futility, and worthlessness)."},{"num":18,"verse":"To whom then will you liken God? Or with what likeness will you compare Him?"},{"num":19,"verse":"The graven image! A workman casts it, and a goldsmith overlays it with gold and casts silver chains for it."},{"num":20,"verse":"He who is so impoverished that he has no offering or oblation or rich gift to give [to his god is constrained to make a wooden offering, an idol; so he] chooses a tree that will not rot; he seeks out a skillful craftsman to carve and set up an image that will not totter or deteriorate."},{"num":21,"verse":"[You worshipers of idols, you are without excuse.] Do you not know? Have you not heard? Has it not been told you from the beginning? [These things ought to convince you of God’s omnipotence and of the folly of bowing to idols.] Have you not understood from the foundations of the earth?"},{"num":22,"verse":"It is God Who sits above the circle (the horizon) of the earth, and its inhabitants are like grasshoppers; it is He Who stretches out the heavens like [gauze] curtains and spreads them out like a tent to dwell in,"},{"num":23,"verse":"Who brings dignitaries to nothing, Who makes the judges and rulers of the earth as chaos (emptiness, falsity, and futility)."},{"num":24,"verse":"Yes, these men are scarcely planted, scarcely are they sown, scarcely does their stock take root in the earth, when [the Lord] blows upon them and they wither, and the whirlwind or tempest takes them away like stubble."},{"num":25,"verse":"To whom then will you liken Me, that I should be equal to him? says the Holy One."},{"num":26,"verse":"Lift up your eyes on high and see! Who has created these? He Who brings out their host by number and calls them all by name; through the greatness of His might and because He is strong in power, not one is missing or lacks anything."},{"num":27,"verse":"Why, O Jacob, do you say, and declare, O Israel, My way and my lot are hidden from the Lord, and my right is passed over without regard from my God?"},{"num":28,"verse":"Have you not known? Have you not heard? The everlasting God, the Lord, the Creator of the ends of the earth, does not faint or grow weary; there is no searching of His understanding."},{"num":29,"verse":"He gives power to the faint and weary, and to him who has no might He increases strength [causing it to multiply and making it to abound]."},{"num":30,"verse":"Even youths shall faint and be weary, and [selected] young men shall feebly stumble and fall exhausted;"},{"num":31,"verse":"But those who wait for the Lord [who expect, look for, and hope in Him] shall change and renew their strength and power; they shall lift their wings and mount up [close to God] as eagles [mount up to the sun]; they shall run and not be weary, they shall walk and not faint or become tired."}]