[{"num":8,"verse":"¶ Then Elisha spoke unto the woman, whose son he had restored to life, saying, Arise, and go thou and thine household and sojourn wherever thou canst sojourn; for the LORD has called for a famine which shall come upon the land seven years."},{"num":2,"verse":"Then the woman arose and did as the man of God told her; and she went with her household and sojourned in the land of the Philistines seven years."},{"num":3,"verse":"And it came to pass at the end of the seven years that the woman returned out of the land of the Philistines, and she went forth to cry unto the king for her house and for her lands."},{"num":4,"verse":"And the king had talked with Gehazi, the servant of the man of God, saying, Tell me, I pray thee, all the great things that Elisha has done."},{"num":5,"verse":"And as he was telling the king how he had restored a dead body to life, behold, the woman, whose son he had restored to life, cried to the king for her house and for her land. So Gehazi said, My lord, O king, this is the woman, and this is her son, whom Elisha restored to life."},{"num":6,"verse":"And when the king asked the woman, she told him. Then the king appointed unto her a eunuch, saying, Restore all that was hers and all the fruits of the lands since the day that she left the lands, even until now."},{"num":7,"verse":"¶ Elisha went to Damascus; and Benhadad, the king of Syria, was sick; and it was told him, saying, The man of God is come here."},{"num":8,"verse":"And the king said unto Hazael, Take a present in thy hand, and go, meet the man of God and enquire of the LORD by him, saying, Shall I recover of this disease?"},{"num":9,"verse":"So Hazael went to meet him and took a present with him, even of every good thing of Damascus, forty camels’ burden, and came and stood before him, and said, Thy son Benhadad, king of Syria, has sent me to thee, saying, Shall I recover of this disease?"},{"num":10,"verse":"And Elisha said unto him, Go, say unto him, Thou may certainly recover. But the LORD has showed me that he shall surely die."},{"num":11,"verse":"And he settled his countenance steadfastly, until he was ashamed; and the man of God wept."},{"num":12,"verse":"Then Hazael said unto him, Why does my lord weep? And he answered, Because I know the evil that thou wilt do unto the sons of Israel; their strong holds wilt thou set on fire, and their young men wilt thou slay with the sword and wilt dash their children and rip up their women with child."},{"num":13,"verse":"And Hazael said, But what, is thy slave a dog, that he should do this great thing? And Elisha answered, The LORD has showed me that thou shalt be king over Syria."},{"num":14,"verse":"So he departed from Elisha and came to his master; who said to him, What did Elisha say to thee? And he answered, He told me that thou may surely recover."},{"num":15,"verse":"And it came to pass on the next day that he took a thick cloth and dipped it in water and spread it on his face so that he died; and Hazael reigned in his stead."},{"num":16,"verse":"¶ And in the fifth year of Joram, the son of Ahab, king of Israel, Jehoshaphat being then king of Judah, Jehoram, the son of Jehoshaphat king of Judah, began to reign."},{"num":17,"verse":"He was thirty-two years old when he began to reign, and he reigned eight years in Jerusalem."},{"num":18,"verse":"He walked in the way of the kings of Israel, as did the house of Ahab, for the daughter of Ahab was his wife, and he did evil in the sight of the LORD."},{"num":19,"verse":"Yet with all this, the LORD would not destroy Judah for David, his slave’s sake, as he had promised him to give him always a light of his sons."},{"num":20,"verse":"In his days, Edom revolted from under the hand of Judah and made a king over themselves."},{"num":21,"verse":"So Joram went over to Zair and all his chariots with him, and he rose up by night and smote the Edomites, who had compassed him about, and the captains of the chariots; and the people fled into their tents."},{"num":22,"verse":"Yet Edom revolted from under the hand of Judah unto this day. Then Libnah revolted at the same time."},{"num":23,"verse":"And the rest of the acts of Joram and all that he did, are they not written in the book of the chronicles of the kings of Judah?"},{"num":24,"verse":"And Joram slept with his fathers and was buried with his fathers in the city of David, and Ahaziah, his son, reigned in his stead."},{"num":25,"verse":"¶ In the twelfth year of Joram, the son of Ahab king of Israel, Ahaziah, the son of Jehoram king of Judah, began to reign."},{"num":26,"verse":"Ahaziah was twenty-two years old when he began to reign, and he reigned one year in Jerusalem. And his mother’s name was Athaliah, the daughter of Omri, king of Israel."},{"num":27,"verse":"And he walked in the way of the house of Ahab and did evil in the sight of the LORD, as did the house of Ahab; for he was the son-in-law of the house of Ahab."},{"num":28,"verse":"And he went with Joram, the son of Ahab, to the war against Hazael, king of Syria, in Ramothgilead; and the Syrians wounded Joram."},{"num":29,"verse":"And King Joram went back to be healed in Jezreel of the wounds which the Syrians had given him at Ramah, when he fought against Hazael, king of Syria. And Ahaziah, the son of Jehoram king of Judah, went down to see Joram, the son of Ahab in Jezreel, because he was sick."}]