[{"header":"The Shunammite’s Land Restored"},{"num":8,"verse":"Now Elisha spoke to the woman whose son he had restored to life saying, “Arise and go with your household, and stay wherever you can stay, because Adonai has called for a famine—indeed it has already come—on the land for seven years.” "},{"num":2,"verse":"So the woman arose and did according to the word of the man of God. She and her household went and stayed in the land of the Philistines for seven years."},{"num":3,"verse":"Now at the end of seven years the woman returned from the land of the Philistines, and she went to the king to appeal for her house and her farm. "},{"num":4,"verse":"Now the king was talking with Gehazi, the servant of the man of God, “Please tell me,” he was saying, “all the great things that Elisha has done.” "},{"num":5,"verse":"Then it came to pass, just as he was telling the king how he had revived someone who was dead, behold, there was the woman whose son he had revived, appealing to the king for her house and her farm. So Gehazi said, “My Lord the king, this is the woman and this is her son whom Elisha revived.”"},{"num":6,"verse":"When the king asked the woman, she told him the story. So the king assigned to her a court official, saying, “Restore all that was hers, and all the revenue of the field since the day that she left the land until now.”"},{"header":"Elisha Weeps in Damascus"},{"num":7,"verse":"Then Elisha went to Damascus. At the time King Ben-hadad of Aram was sick, and he was told, “The man of God has come all the way here.” "},{"num":8,"verse":"So the king said to Hazael, “Take an offering in your hand and go meet the man of God, and inquire of Adonai by him saying: ‘Will I recover from this illness?’”"},{"num":9,"verse":"So Hazael went to meet him and took an offering in his hand, of every good thing of Damascus—forty camel-loads—then came and stood before him and said, “Your son Ben-hadad king of Aram has sent me to you saying: ‘Will I recover from this illness?’”"},{"num":10,"verse":"Elisha said to him, “Go, say to him: ‘You will surely recover.’ However, Adonai has also shown me that he will surely die.” "},{"num":11,"verse":"Then he fixed his gaze steadily on him until he was ashamed, and then the man of God wept. "},{"num":12,"verse":"When Hazael asked, “Why is my lord weeping?” he answered, “Because I know the evil that you will inflict on the men of Israel: their strongholds you will set on fire, their young men you will slay with the sword, their little ones you will dash into pieces, and their pregnant ones you will rip open.”"},{"num":13,"verse":"Then Hazael said, “But what is your servant, who is but a dog, that he should do anything of such magnitude?”"},{"num":14,"verse":"Then he departed from Elisha and went to his master, who asked him, “What did Elisha say to you?”"},{"num":15,"verse":"But the next day he took a thick cloth, soaked it in water and spread it on his face, so that he died. Then Hazael became king in his place."},{"header":"Edom Revolts Against Jehoram"},{"num":16,"verse":"Now in the fifth year of Joram son of Ahab king of Israel—Jehoshaphat had been king of Judah—Jehoram the son of King Jehoshaphat of Judah became king. "},{"num":17,"verse":"He was 32 years old when he became king, and he reigned eight years in Jerusalem. "},{"num":18,"verse":"But he walked in the way of the kings of Israel, just as the house of Ahab did—for Ahab’s daughter was his wife—and he did what was evil in Adonai’s eyes. "},{"num":19,"verse":"Nevertheless, Adonai was not willing to destroy Judah, for the sake of David His servant, since He had promised to give him a lamp for his children all days."},{"num":20,"verse":"In his days Edom revolted from under the hand of Judah, and set up their own king. "},{"num":21,"verse":"Then Joram crossed over to Zair with all his chariots. It came about that he rose by night and struck the Edomites who had surrounded him and the chariot commanders, but his troops fled to their tents. "},{"num":22,"verse":"So Edom kept rebelling from under the hand of Judah to this day. Then Libnah also revolted at the same time."},{"num":23,"verse":"Now the rest of the acts of Joram and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah? "},{"num":24,"verse":"Then Joram slept with his fathers, and was buried with his fathers in the city of David. Then his son Ahaziah became king in his place."},{"num":25,"verse":"In the twelfth year of Joram son of King Ahab of Israel, Ahaziah son of King Jehoram of Judah began to reign. "},{"num":26,"verse":"Ahaziah was 22 years old when he became king, and he reigned one year in Jerusalem. His mother’s name was Athaliah, the daughter of King Omri of Israel. "},{"num":27,"verse":"Now he walked in the way of the house of Ahab and did what was evil in Adonai’s eyes, as the house of Ahab had done—for he was a son-in-law of the house of Ahab. "},{"num":28,"verse":"He marched with Joram son of Ahab to war against Hazael king of Aram at Ramot-gilead, but the Arameans wounded Joram. "},{"num":29,"verse":"So King Joram returned to Jezreel to recover from the wounds that the Arameans had inflicted on him at Ramah, when he fought against King Hazael of Aram. Ahaziah son of King Jehoram of Judah went down to see Joram son of Ahab in Jezreel, because he was sick."}]