[{"num":5,"verse":"People of Jerusalem, gather your forces! We are besieged! They are attacking the leader of Israel!"},{"header":"God Promises a Ruler from Bethlehem"},{"num":2,"verse":"The Lord says, “Bethlehem Ephrathah, you are one of the smallest towns in Judah, but out of you I will bring a ruler for Israel, whose family line goes back to ancient times.”"},{"num":3,"verse":"So the Lord will abandon his people to their enemies until the woman who is to give birth has her son. Then those Israelites who are in exile will be reunited with their own people. "},{"num":4,"verse":"When he comes, he will rule his people with the strength that comes from the Lord and with the majesty of the Lord God himself. His people will live in safety because people all over the earth will acknowledge his greatness, "},{"num":5,"verse":"and he will bring peace."},{"header":"Deliverance and Punishment"},{"num":6,"verse":"By force of arms they will conquer Assyria, the land of Nimrod, and they will save us from the Assyrians when they invade our territory."},{"num":7,"verse":"The people of Israel who survive will be like refreshing dew sent by the Lord for many nations, like showers on growing plants. They will depend on God, not people. "},{"num":8,"verse":"Those who are left among the nations will be like a lion hunting for food in a forest or a pasture: it gets in among the sheep, pounces on them, and tears them to pieces—and there is no hope of rescue. "},{"num":9,"verse":"Israel will conquer her enemies and destroy them all."},{"num":10,"verse":"The Lord says, “At that time I will take away your horses and destroy your chariots. "},{"num":11,"verse":"I will destroy the cities in your land and tear down all your defenses. "},{"num":12,"verse":"I will destroy the magic charms you use and leave you without any fortunetellers. "},{"num":13,"verse":"I will destroy your idols and sacred stone pillars; no longer will you worship the things that you yourselves have made. "},{"num":14,"verse":"I will pull down the images of the goddess Asherah in your land and destroy your cities. "},{"num":15,"verse":"And in my great anger I will take revenge on all nations that have not obeyed me.”"}]