[{"num":5,"verse":"“Now gather yourselves into armies, people of Israel. They are all around us with their army. They will hit the judge of Israel on the face."},{"header":"God’s Chosen One Will Come from Bethlehem"},{"num":2,"verse":"“Bethlehem Ephrathah, you are too little to be among the family groups of Judah. But from you One will come who will rule for Me in Israel. His coming was planned long ago, from the beginning.” "},{"num":3,"verse":"He will give them up until the time when the woman in pain gives birth to a child. Then the rest of His brothers will return to the people of Israel. "},{"num":4,"verse":"And He will come and feed His flock in the strength of the Lord, in the great power of the name of the Lord His God. His people will live there and be safe, because at that time He will be great to the ends of the earth. "},{"num":5,"verse":"And He will be their peace."},{"header":"Those Who Fight Israel Are Judged"},{"num":6,"verse":"They will rule the land of Assyria, the land of Nimrod, with the sword. And He will take us from the Assyrians when they come into our country and crush under foot our land."},{"num":7,"verse":"Then the people who are left of Jacob will be among many people like water on the ground in the early morning from the Lord, like rain on the grass, which does not wait for man. "},{"num":8,"verse":"Those who are left of Jacob will be among the nations, among many people, like a lion among the animals in the woods, like a young lion among flocks of sheep. When he passes through, he crushes them and tears them to pieces, and there is no one to help them. "},{"num":9,"verse":"Your hand will be lifted up against those who hate you, and all of them will be destroyed."},{"num":10,"verse":"“In that day,” says the Lord, “I will destroy your horses and your war-wagons from among you. "},{"num":11,"verse":"I will destroy the cities of your land and tear down all your strong-places. "},{"num":12,"verse":"I will put an end to your witchcraft, and you will not have people telling your future any more. "},{"num":13,"verse":"I will destroy your false gods and your pillars of worship, so that you will no longer bow down to the work of your hands. "},{"num":14,"verse":"I will pull up your wooden, female goddesses Asherah, and destroy your cities. "},{"num":15,"verse":"And in My anger I will punish the nations that have not obeyed.”"}]