[{"num":14,"verse":"To the victory, [the psalm] of David. The unwise man said in his heart, God is not. They be corrupt, and they be made abominable in their studies; none there is that doeth good, none is till to one. (To victory, the song of David. The fool said in his heart, There is no God. Such men be corrupt, and they be made abominable in their deeds; there is no one who doeth good, no not one.)"},{"num":2,"verse":"The Lord beheld from heaven on the sons of men; that he see, if any is understanding, either seeking God. (The Lord looked down from heaven on the sons and daughters of men; to see if there is anyone who hath understanding, or is seeking God.)"},{"num":3,"verse":"All bowed away, (al)together they be made unprofitable; none is that doeth good, none is till to one (But they all have turned away, they all be made utterly unredeemable; there is no one who doeth good, no not one). The throat of them is an open sepulchre, they did guilefully with their tongues; the venom of snakes is under their lips. Whose mouth is full of cursing and bitterness; their feet be swift to shed out blood. Sorrow and cursedness is in the ways of them, and they knew not the way of peace; the dread of God is not before their eyes."},{"num":4,"verse":"Whether all men that work wickedness shall not know; that devour my people, as (the) meat of bread? They called not the Lord; (Surely all those, who do evil, already know this; yea, they who devour my people, like men eat bread. They do not call on the Lord;)"},{"num":5,"verse":"they trembled there for dread, where was no dread; for the Lord is in a rightful generation. (but they trembled there in fear, like never before. For the Lord is with the upright generation.)"},{"num":6,"verse":"Thou hast shamed the counsel of a poor man; for the Lord is his hope. (Ye evil-doers, ye have frustrated the plans of the poor; but the Lord is their hope.)"},{"num":7,"verse":"Who shall give from Zion health to Israel? When the Lord hath turned away the captivity of his people; Jacob shall fully be joyful/Jacob shall (make) full out joy, and Israel shall be glad. (Who shall give victory/Who shall give salvation, or deliverance, to Israel out of Zion? When the Lord hath returned the prosperity of his people, then Jacob shall rejoice; yea, Israel shall be glad.)"}]