[{"header":"A Life Pleasing to God"},{"num":4,"verse":"Finally, brethren, we beseech and exhort you in the Lord Jesus, that as you learned from us how you ought to live and to please God, just as you are doing, you do so more and more. "},{"num":2,"verse":"For you know what instructions we gave you through the Lord Jesus. "},{"num":3,"verse":"For this is the will of God, your sanctification: that you abstain from unchastity; "},{"num":4,"verse":"that each one of you know how to take a wife for himself in holiness and honor, "},{"num":5,"verse":"not in the passion of lust like heathen who do not know God; "},{"num":6,"verse":"that no man transgress, and wrong his brother in this matter, because the Lord is an avenger in all these things, as we solemnly forewarned you. "},{"num":7,"verse":"For God has not called us for uncleanness, but in holiness. "},{"num":8,"verse":"Therefore whoever disregards this, disregards not man but God, who gives his Holy Spirit to you."},{"num":9,"verse":"But concerning love of the brethren you have no need to have any one write to you, for you yourselves have been taught by God to love one another; "},{"num":10,"verse":"and indeed you do love all the brethren throughout Macedo′nia. But we exhort you, brethren, to do so more and more, "},{"num":11,"verse":"to aspire to live quietly, to mind your own affairs, and to work with your hands, as we charged you; "},{"num":12,"verse":"so that you may command the respect of outsiders, and be dependent on nobody."},{"header":"The Coming of the Lord"},{"num":13,"verse":"But we would not have you ignorant, brethren, concerning those who are asleep, that you may not grieve as others do who have no hope. "},{"num":14,"verse":"For since we believe that Jesus died and rose again, even so, through Jesus, God will bring with him those who have fallen asleep. "},{"num":15,"verse":"For this we declare to you by the word of the Lord, that we who are alive, who are left until the coming of the Lord, shall not precede those who have fallen asleep. "},{"num":16,"verse":"For the Lord himself will descend from heaven with a cry of command, with the archangel’s call, and with the sound of the trumpet of God. And the dead in Christ will rise first; "},{"num":17,"verse":"then we who are alive, who are left, shall be caught up together with them in the clouds to meet the Lord in the air; and so we shall always be with the Lord. "},{"num":18,"verse":"Therefore comfort one another with these words."}]