[{"num":51,"verse":"When David was rebuked by the Prophet Nathan for his great offenses, he did not only acknowledge the same to God, with protestation of his natural corruption and iniquity, but also left a memorial thereof to his posterity. 7 Therefore first he desireth God to forgive his sins, 10 And to renew in him his holy Spirit. 13 With promise that he will not be unmindful of those great graces. 18 Finally, fearing lest God would punish the whole Church for his fault, he requireth that he would rather increase his graces toward the same."},{"num":1,"verse":"Have mercy upon me, O God, according to thy loving-kindness: according to the multitude of thy compassions put away mine iniquities."},{"num":2,"verse":"Wash me thoroughly from mine iniquity, and cleanse me from mine sin."},{"num":3,"verse":"For I know mine iniquities, and my sin is ever before me."},{"num":4,"verse":"Against thee, against thee only have I sinned, and done evil in thy sight, that thou mayest be just when thou speakest, and pure when thou judgest."},{"num":5,"verse":"Behold, I was born in iniquity, and in sin hath my mother conceived me."},{"num":6,"verse":"Behold, thou lovest truth in the inward affections: therefore hast thou taught me wisdom in the secret of mine heart."},{"num":7,"verse":"Purge me with hyssop, and I shall be clean: wash me, and I shall be whiter than snow."},{"num":8,"verse":"Make me to hear joy and gladness, that the bones, which thou hast broken, may rejoice."},{"num":9,"verse":"Hide thy face from my sins, and put away all mine iniquities."},{"num":10,"verse":"Create in me a clean heart, O God, and renew a right spirit within me."},{"num":11,"verse":"Cast me not away from thy presence, and take not thine holy Spirit from me."},{"num":12,"verse":"Restore to me the joy of thy salvation, and establish me with thy free Spirit."},{"num":13,"verse":"Then shall I teach thy ways unto the wicked, and sinners shall be converted unto thee."},{"num":14,"verse":"Deliver me from blood, O God, which art the God of my salvation, and my tongue shall sing joyfully of thy righteousness."},{"num":15,"verse":"Open thou my lips, O Lord, and my mouth shall show forth thy praise."},{"num":16,"verse":"For thou desirest no sacrifice, though I would give it: thou delightest not in burnt offering."},{"num":17,"verse":"The sacrifices of God are a contrite spirit: a contrite and a broken heart, O God, thou wilt not despise."},{"num":18,"verse":"Be favorable unto Zion for thy good pleasure: build the walls of Jerusalem."},{"num":19,"verse":"Then shalt thou accept the sacrifices of righteousness, even the burnt offering and oblation: then shall they offer calves upon thine altar."}]