[{"header":"Prayer of the Sinner"},{"num":51,"verse":"O God, favor me because of Your loving-kindness. Take away my wrong-doing because of the greatness of Your loving-pity. "},{"num":2,"verse":"Wash me inside and out from my wrong-doing and make me clean from my sin. "},{"num":3,"verse":"For I know my wrong-doing, and my sin is always in front of me. "},{"num":4,"verse":"I have sinned against You, and You only. I have done what is sinful in Your eyes. You are always right when You speak, and fair when You judge."},{"num":5,"verse":"See, I was born in sin and was in sin from my very beginning. "},{"num":6,"verse":"See, You want truth deep within the heart. And You will make me know wisdom in the hidden part. "},{"num":7,"verse":"Take away my sin, and I will be clean. Wash me, and I will be whiter than snow. "},{"num":8,"verse":"Make me hear joy and happiness. Let the bones that You have broken be full of joy. "},{"num":9,"verse":"Hide Your face from my sins. And take away all my wrong-doing."},{"num":10,"verse":"Make a clean heart in me, O God. Give me a new spirit that will not be moved. "},{"num":11,"verse":"Do not throw me away from where You are. And do not take Your Holy Spirit from me. "},{"num":12,"verse":"Let the joy of Your saving power return to me. And give me a willing spirit to obey you. "},{"num":13,"verse":"Then I will teach wrong-doers Your ways. And sinners will turn to You."},{"num":14,"verse":"Save me from the guilt of blood, O God. You are the God Who saves me. Then my tongue will sing with joy about how right and good You are. "},{"num":15,"verse":"O Lord, open my lips, so my mouth will praise You. "},{"num":16,"verse":"For You are not happy with a gift given on the altar in worship, or I would give it. You are not pleased with burnt gifts. "},{"num":17,"verse":"The gifts on an altar that God wants are a broken spirit. O God, You will not hate a broken heart and a heart with no pride."},{"num":18,"verse":"Be pleased to do good to Zion. Build the walls of Jerusalem. "},{"num":19,"verse":"Then You will be happy with gifts given on the altar that are right and good, with burnt gifts and whole burnt gifts. Then young bulls will be given on Your altar."}]