[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He sent for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No doubt much more was said by the brave shepherd boy than the compiler of the history has preserved for us in the brief account here. David felt that supernatural strength had been communicated to him by the Spirit of God, which came upon him on the day of his anointing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it is probable that he had openly avowed his earnest desire of meeting the dreaded foe face to face. This had been reported to Saul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:31-39 A shepherd lad, come the same morning from keeping sheep, had more courage than all the mighty men of Israel. Thus God often sends good words to his Israel, and does great things for them, by the weak and foolish things of the world. As he had answered his brother's passion with meekness, so David answered Saul's fear with faith. When David kept sheep, he proved himself very careful and tender of his flock. This reminds us of Christ, the good Shepherd, who not only ventured, but laid down his life for the sheep. Our experience ought to encourage us to trust in God, and be bold in the way of duty. He that has delivered, does and will continue to do so. David gained leave to fight the Philistine. Not being used to such armour as Saul put upon him, he was not satisfied to go in that manner; this was from the Lord, that it might more plainly appear he fought and conquered in faith, and that the victory was from Him who works by the feeblest and most despised means and instruments. It is not to be inquired how excellent any thing is, but how proper. Let Saul's coat be ever so rich, and his armour ever so strong, what is David the better if they fit him not? But faith, prayer, truth, and righteousness; the whole armour of God, and the mind that was in Christ; are equally needful for all the servants of the Lord, whatever may be their work.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is there not a cause? - i. e., is not Saul's promise, and the insolence of Goliath, a sufficent cause for what I am about to do? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. make his father's house free in Israel—His family should be exempted from the impositions and services to which the general body of the Israelites were subjected.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when the words were heard which David spake,.... To one, and to another, and these reported to other persons, and so they went from one to another through many hands: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they rehearsed them before Saul; coming to the ears of some of his courtiers and counsellors, or officers about him, they told him what such an one had said: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he sent for him; to his tent or pavilion where he was, to talk with him on this subject. The whole of 1 Samuel 17:11 is wanting in the Septuagint version, according to the Vatican exemplar; and these \"twenty\" verses are thought, by some (e), to be an interpolation; and it must be owned there are difficulties in them, and that the connection of 1 Samuel 17:11 with the following is very clear and consistent, as also is 1 Samuel 17:50 left out in the same version; and likewise the last four of the chapter, 1 Samuel 17:55, and five with which the next begins, 1 Samuel 18:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he sent for him; to his tent or pavilion where he was, to talk with him on this subject. The whole of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is wanting in the Septuagint version, according to the Vatican exemplar; and these \"twenty\" verses are thought, by some (e), to be an interpolation; and it must be owned there are difficulties in them, and that the connection of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with the following is very clear and consistent, as also is ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " left out in the same version; and likewise the last four of the chapter, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:55",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and five with which the next begins, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) See Dr. Kennicott's Dissert. 2. p. 418, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) See Dr. Kennicott's Dissert. 2. p. 418, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the words were heard which David spake, they rehearsed them before Saul: and he sent for him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David's words were told to Saul, who had him sent for immediately.",
        "children": []
      }
    ]
  }
]