[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(55) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose son is this youth?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A grave difficulty, at first sight, indisputably exists here. It is briefly this. In the preceding chapter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 17:18-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), David, the son of Jesse, is chosen to play before the mentally sick king; his playing relieved the sufferer, who became attached to the young musician, and in consequence appointed him to a position about his person that certainly would have involved a lengthened, if not a continuous, residence at the court. In this and the following verses we read how this same David, at the time of his great exploit, was apparently unknown to the king and to Abner, the captain of the host. The LXX., fully conscious of the difficulty, determined to solve it by boldly, if not wisely, cutting the knot. They literally expunged from their version all the later passages which they could not easily bring into harmony with the earlier. The Greek Version, then, simply omits these four last verses of 1 Samuel 17, together with the first five verses of 1 Samuel 18, and the whole of the section ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 17:12-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Various ingenious explanations have been suggested by scholars.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The mental state of Saul when David played before him was such that the king failed to recognise him on the present occasion, and Abner probably had never seen him before.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") The mental state of Saul when David played before him was such that the king failed to recognise him on the present occasion, and Abner probably had never seen him before.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Some length of time had elapsed since his last visit to the court, and as he was then in very early manhood, he had, so to speak, grown, in a comparatively speaking short space of time, out of Saul’s memory.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "b",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") Some length of time had elapsed since his last visit to the court, and as he was then in very early manhood, he had, so to speak, grown, in a comparatively speaking short space of time, out of Saul’s memory.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The purpose of Saul’s inquiry was not to find out who David was—that he knew well already—but to ascertain the position and general circumstances of the young hero’s father, as, according to the promise (in 1Samuel 17:25), in the event of his success (which evidently the king confidently looked for), the father of the champion and his family would receive extraordinary honours.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) The purpose of Saul’s inquiry was ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "not ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "to find out who David was—that he knew well already—but to ascertain the position and general circumstances of the young hero’s father, as, according to the promise (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 17:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), in the event of his success (which evidently the king confidently looked for), the father of the champion and his family would receive extraordinary honours.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The real solution of the difficulty probably lies in the fact that, as has been before stated, this and the other historical books of the Old Testament were made up by the inspired compiler from well-authenticated traditions current in Israel, and most probably preserved in the archives of the great prophetic schools. (See Notes on 1Samuel 17:1; 1Samuel 17:15.) There were, no doubt, many of these traditions connected with the principal events of David’s early career. Two here were selected which, to a certain extent, covered the same ground. The first—preserved, no doubt, in some prophetic school where music and poetry were especially cultivated—narrates the influence which David acquired over Saul through his great gift of music. The power of music and poetry in Saul’s mental disease was evidently the great point of interest to the original writer of 1Samuel 16:14-23. Now, in the narrative contained in these ten verses no note of time occurs. The events related evidently were spread over a considerable, possibly over a very long, period. The afflicted king might have seen the young musician perhaps in a darkened tent once or twice before the Goliath combat, but the great intimacy described in 1Samuel 16:21-23, we may well assume, belonged to a period subsequent to the memorable combat with the giant.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The real solution of the difficulty probably lies in the fact that, as has been before stated, this and the other historical books of the Old Testament were made up by the inspired compiler from well-authenticated traditions current in Israel, and most probably preserved in the archives of the great prophetic schools. (See Notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) There were, no doubt, many of these traditions connected with the principal events of David’s early career. Two here were selected which, to a certain extent, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "covered the same ground. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The first—preserved, no doubt, in some prophetic school where music and poetry were especially cultivated—narrates the influence which David acquired over Saul through his great gift of music. The power of music and poetry in Saul’s mental disease was evidently the great point of interest to the original writer of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 16:14-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Now, in the narrative contained in these ten verses ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "no note of time ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "occurs. The events related evidently were spread over a considerable, possibly over a very long, period. The afflicted king might have seen the young musician perhaps in a darkened tent once or twice before the Goliath combat, but the great intimacy described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 16:21-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we may well assume, belonged to a period subsequent to the memorable combat with the giant.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Following out this hypothesis, we may with some confidence assume that King Saul failed entirely to recognise the young player whom he had only seen (possibly only heard in his darkened tent) on one or two sad occasions; and Abner probably had never seen him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As for the great love on the part of the king, and position of royal armour-bearer these things we have little doubt came to David after the victory over the giant Philistine, and very likely indeed in consequence of it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As for the great love on the part of the king, and position of royal armour-bearer these things we have little doubt came to David ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "after ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the victory over the giant Philistine, and very likely indeed in consequence of it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the later of the two sections of the Goliath history, the compiler cared little for the musical detail; his work was to show that the foundation stone of David’s brilliant and successful life was intense faith in the Jehovah of Israel, a perfect child-like trust in the power of the Invisible King.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "later ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the two sections of the Goliath history, the compiler cared little for the musical detail; his work was to show that the foundation stone of David’s brilliant and successful life was intense faith in the Jehovah of Israel, a perfect child-like trust in the power of the Invisible King.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the former of the two sections the relater—no doubt in his day a famous teacher in some school of prophetic music—was, only concerned to show the mighty influence of his Divine art upon the souls and the lives of men, as exemplified in the story of the early days of the sweet Psalmist-King of Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "former ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the two sections the relater—no doubt in his day a famous teacher in some school of prophetic music—was, only concerned to show the mighty influence of his Divine art upon the souls and the lives of men, as exemplified in the story of the early days of the sweet Psalmist-King of Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The musical details connected with the early life of David, the composer of so many of the famous hymns sung in the Tempie Service and also in the public gatherings of the people, would be—in the eyes of this writer—of the deepest interest to coming generations.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 17:55",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:55",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whose son is this youth? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It may, at first sight, appear strange that Saul should be represented here as not knowing who David was, when we have a relation in the foregoing chapter of his sending for him to court, being highly pleased with his behaviour, and much delighted with his music, making him his armour-bearer, and sending to his father Jesse to ask his leave for his continuance at court. But it may be observed that Saul, in this place, does not express an entire ignorance of David, but only inquires ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whose son he was — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A question of the more consequence to him, as he had promised his daughter in marriage to the conqueror of Goliath. Either Saul had never before made any inquiry about his parentage, or both he and Abner had forgotten whence he was. And this might very easily happen to a king and a general of an army, who daily see and have to do with so many different faces, and who pay so little regard to things of this sort. Nay, if Saul had entirely forgotten David, it would not have been strange, considering that he had been but little with him, had some time ago been dismissed from the court, and was returned home, where he had remained at least a year or two, during which time Saul had not seen him. Besides, the distemper of Saul’s mind might make him forgetful, and David might now be much changed, both in his countenance and in his habit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Abner said, I cannot tell — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Abner’s employment was generally in the camp, when David was at the court; and when Abner was there he probably took little notice of a youth so much inferior to him as David was.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“We may learn from the whole of this pleasing chapter,” says Dr. Dodd, “how ready God is to help those who trust in him; for whose defence and protection he makes use of means apparently the most weak, to humble the pride of the wicked, and to destroy the powers which seem most formidable. Some writers have considered this destruction of Goliath by David as a type of the victory of Jesus Christ, in his state of weakness and humiliation, over the strong and gigantic powers of hell and the grave.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:48-58 See how frail and uncertain life is, even when a man thinks himself best fortified; how quickly, how easily, and by how small a matter, the passage may be opened for life to go out, and death to enter! Let not the strong man glory in his strength, nor the armed man in his armour. God resists the proud, and pours contempt on those who defy him and his people. No one ever hardened his heart against God and prospered. The history is recorded, that all may exert themselves for the honour of God, and the support of his cause, with bold and unshaken reliance on him. There is one conflict in which all the followers of the Lamb are, and must be engaged; one enemy, more formidable than Goliath, still challenges the armies of Israel. But resist the devil, and he will flee from you. Go forth to battle with the faith of David, and the powers of darkness shall not stand against you. But how often is the Christian foiled through an evil heart of unbelief!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whose son ... - See the marginal reference note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "55-58. Saul … said unto Abner … whose son is this youth?—A young man is more spoken of in many Eastern countries by his father's name than his own. The growth of the beard, and other changes on a now full-grown youth, prevented the king from recognizing his former favorite minstrel [1Sa 16:23].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose son is this youth?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How could David be unknown to Saul, with whom he had lived? ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 16:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 16:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That might well be, for divers reasons, because David was not constantly with him, nor, as it seems, used by him, but upon extraordinary occasions, and desperate fits of melancholy; from which possibly he had been free for a good while, by God’s special providence and care for his people Israel, that so he might be capable of governing and protecting them against the Philistines, who watched all opportunities against them, and at last broke forth into an open war. Thus David had been for some considerable time dismissed from Saul’s court, and was returned home; and therefore it is not strange, if Saul had for the present forgotten David; for kings, because of the encumbrance of public business, and the multitude of persons who come to them on several occasions, may easily forget some persons; yea, such as have frequently been with them, especially their servants, whom they do not use to observe with so much attention and care as they do others. Add to this, that the distemper of Saul’s mind might make him forgetful; and that David might now be much changed, both in his countenance and in his habit, from what he had before; and it is apparent, that the change of habits makes so great a difference, that it oft keeps us from the knowledge of those persons whom in other habits we very well know. Some give this answer, That this was the first time that Saul had seen David; and that David’s exploit here recorded was performed before that which is recorded ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 17:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", though it be placed after it; but that is confuted by comparing ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 18:1-3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I cannot tell; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is not strange, because Abner’s conversation and employment was generally in the camp, when David was at the court; and when Abner was there, he took little notice of a person so much inferior to him as David was. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when Saul saw David go forth against the Philistine,.... Set out to meet him, and engage with him, as he might from the side of the mountain, where he was encamped: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he said unto Abner, the captain of the host; his own cousin, whom he had raised to this high post in the army, 1 Samuel 14:50, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he said unto Abner, the captain of the host; his own cousin, whom he had raised to this high post in the army, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Abner, whose son is this youth? it is thought strange by many that Saul should not know who he was, when he had been often at his court, and served him as a musician, and had been very useful to him, and he loved him, and made him his armourbearer, and even had just now conversed with him about encountering with the Philistine, and had clothed him with his own armour: to get rid of the former part of the objection, some have supposed that this event happened before David was his musician and armourbearer, and is by anticipation spoken of in 1 Samuel 16:14, but that the connection with this and the following chapter will not admit of; and besides, before this event, David is said to return home from Saul, 1 Samuel 17:15; so that it is certain he had been at Saul's court, and in his presence before: but to remove this seeming difficulty it may be observed, that Saul, having laboured under a disorder of body and mind, might easily forget David, and his serving him in the above capacity; and to which the multiplicity of business, and of persons in a court, might greatly contribute; and what with the distance of time, and the different habits in which David appeared, sometimes as a musician, and sometimes as a shepherd, and at other times as a soldier, and always as a servant, it is no wonder the king should not know him again; though after all it is not about his person that he inquires, but whose son he was, what was his father's name, and from what family he sprung; for though Saul was made acquainted with this in the time of his disorder, and therefore sent to his father Jesse for him, and afterwards desired leave for his continuance; yet this might slip out of his memory in a course of time, he having had no personal knowledge of Jesse, nor any correspondence with him, but just at that time; and it behoved him to know the pedigree of David, since, if he was victorious, he was not only to be enriched by him, but to have his daughter for wife, and his family ennobled: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Abner, whose son is this youth? it is thought strange by many that Saul should not know who he was, when he had been often at his court, and served him as a musician, and had been very useful to him, and he loved him, and made him his armourbearer, and even had just now conversed with him about encountering with the Philistine, and had clothed him with his own armour: to get rid of the former part of the objection, some have supposed that this event happened before David was his musician and armourbearer, and is by anticipation spoken of in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 16:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but that the connection with this and the following chapter will not admit of; and besides, before this event, David is said to return home from Saul, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so that it is certain he had been at Saul's court, and in his presence before: but to remove this seeming difficulty it may be observed, that Saul, having laboured under a disorder of body and mind, might easily forget David, and his serving him in the above capacity; and to which the multiplicity of business, and of persons in a court, might greatly contribute; and what with the distance of time, and the different habits in which David appeared, sometimes as a musician, and sometimes as a shepherd, and at other times as a soldier, and always as a servant, it is no wonder the king should not know him again; though after all it is not about his person that he inquires, but whose son he was, what was his father's name, and from what family he sprung; for though Saul was made acquainted with this in the time of his disorder, and therefore sent to his father Jesse for him, and afterwards desired leave for his continuance; yet this might slip out of his memory in a course of time, he having had no personal knowledge of Jesse, nor any correspondence with him, but just at that time; and it behoved him to know the pedigree of David, since, if he was victorious, he was not only to be enriched by him, but to have his daughter for wife, and his family ennobled: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and Abner said, as thy soul liveth, O king, I cannot tell; he swore by the life of Saul, as Joseph by the life of Pharaoh, that he knew nothing of him; which need not at all seem strange, that a general of an army, always employed in military affairs, and often abroad, should know nothing of a domestic servant of Saul's, under the character of a musician, and not always at court either; and still less that he should be ignorant of his family, and know nothing of his father, who lived in obscurity in Bethlehem, and was an old man in those days. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Abner said, as thy soul liveth, O king, I cannot tell; he swore by the life of Saul, as Joseph by the life of Pharaoh, that he knew nothing of him; which need not at all seem strange, that a general of an army, always employed in military affairs, and often abroad, should know nothing of a domestic servant of Saul's, under the character of a musician, and not always at court either; and still less that he should be ignorant of his family, and know nothing of his father, who lived in obscurity in Bethlehem, and was an old man in those days. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when Saul saw David go forth against the Philistine, he said unto Abner, the captain of the host, Abner, {e} whose son is this youth? And Abner said, As thy soul liveth, O king, I cannot tell.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when Saul saw David go forth against the Philistine, he said unto Abner, the captain of the host, Abner, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whose son ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this youth? And Abner said, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "As",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy soul liveth, O king, I cannot tell.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) That is, of what family and tribe is he? He had forgotten David, even though he had received so great a benefit by him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "55–58. Saul’s inquiry concerning David’s parentage",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he said unto Abner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This section is not found in the Septuagint (B). On the difficulty of reconciling it with ch. 16 see Note VI. P. 241.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 55-58.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Abner, whose son is this youth?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hebrew, \"lad,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "na'ar.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We have seen that the narrative in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 16:21-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " carries the history of David's relations with Saul down to a much later period, and that in ver. 15 of this chapter David is represented as not dwelling continuously at Saul's court, but as having returned to Bethlehem and resumed his pastoral occupations there, whence he would be summoned back in case of the recurrence of Saul's malady. It is plain from what is stated here that David had not thus far spent time enough at Gibeah to be personally well known either to Saul or his officers (see note on ver. 15). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Stripling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "na'ar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "alem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the masculine of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "almah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", used in  ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It means a young man fully grown, and arrived at the age to marry, and so is more definite than ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "na'ar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Saul uses in ver. 58. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As David returned,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. Abner, as captain of the host, would naturally watch the combat, and as soon as it was possible would bring the young warrior into the king's presence. But what is recorded here could have taken place only after the pursuit of the Philistines was over, and really these five verses should be united with ch. 17, as their object is to introduce the account of the love. of Jonathan for David. Starting then with the inquiry made by the king of Abner, asking for fuller information as to the young man's parentage, the historian then tells how after the chase he was brought before Saul, and then, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the result of their conversation was the warm love that henceforward knit together these two kindred souls. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1 Samuel 17:55",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jonathan's friendship. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:55-58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The account of the relation into which David was brought to Saul through the defeat of Goliath is introduced by a supplementary remark, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as to a conversation which took place between Saul and his commander-in-chief Abner concerning David, whilst he was fighting with the giant. So far, therefore, as the actual meaning is concerned, the verbs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be rendered as pluperfects. When Saul saw the youth walk boldly up to meet the Philistine, he asked Abner whose son he was; whereupon Abner assured him with an oath that he did not know. In our remarks concerning the integrity of this section we have already observed, with regard to the meaning of the question put by Saul, that it does not presuppose an actual want of acquaintance with the person of David and the name of his father, but only ignorance of the social condition of David's family, with which both Abner and Saul may hitherto have failed to make themselves more fully acquainted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The common solutions of this apparent discrepancy, such as that Saul pretended not to know David, or that his question is to be explained on the supposition that his disease affected his memory, have but little probability in them, although Karkar still adheres to them.) ",
        "children": []
      }
    ]
  }
]