[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The elder shall serve the younger.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The margin gives as an alternative rendering, “the greater shall serve the lesser.” The quotation is taken from the LXX., in which there is the same ambiguity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This ambiguity also appears to exist in the Hebrew, where it is a disputed question whether the words refer to age or to the comparative strength of the two peoples. In either case, it is the nations that should spring from Esau and Jacob that are meant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:6-13 The rejection of the Jews by the gospel dispensation, did not break God's promise to the patriarchs. The promises and threatenings shall be fulfilled. Grace does not run in the blood; nor are saving benefits always found with outward church privileges. Not only some of Abraham's seed were chosen, and others not, but God therein wrought according to the counsel of his own will. God foresaw both Esau and Jacob as born in sin, by nature children of wrath even as others. If left to themselves they would have continued in sin through life; but for wise and holy reasons, not made known to us, he purposed to change Jacob's heart, and to leave Esau to his perverseness. This instance of Esau and Jacob throws light upon the Divine conduct to the fallen race of man. The whole Scripture shows the difference between the professed Christian and the real believer. Outward privileges are bestowed on many who are not the children of God. There is, however, full encouragement to diligent use of the means of grace which God has appointed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It was said unto her - By Yahweh; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The elder - The oldest son, which was Esau. By the law of primogeniture among the Hebrews, he would have been entitled to special honors and privileges. But it was said that in his case this custom should be reversed, and that he should take the rank of the younger.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Should serve - Shall be subject to; shall not have the authority and priority, but should be inferior to. The passage in Genesis Gen 25:23 shows that this had reference particularly to the posterity of Esau, and not to him as an individual. The sense is, that the descendants of Esau, who were Edomites, should be inferior to, and subject to the descendants of Jacob. Jacob was to have the priority; the promised land; the promises; and the honor of being regarded as the chosen of God. There was reference here, therefore, to the whole train of temporal and spiritual blessings which were to be connected with the two races of people. If it be asked how this bears on the argument of the apostle, we may reply,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That it settles \"the principle\" that God might make a distinction among people, in the same nation, and the same family, without reference to their works or character.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that he might confer his blessings on such as he pleased.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) if this is done in regard to nations, it may be in regard to individuals. The principle is the same, and the justice the same. If it be supposed to be unjust in God to make such a distinction in regard to individuals, it is surely not less so to make a distinction in nations. The fact that numbers are thus favored, does not make it the more proper, or remove any difficulty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) if this distinction may be made in regard to temporal things, why not in regard to spiritual things? The principle must still be the same. If unjust in one case, it would be in the other. The fact that it is done in one case proves also that it will be in the other; for the same great principle will run through all the dealings of the divine government. And as people do not and cannot complain that God makes a distinction among them in regard to talents, health, beauty, prosperity, and rank, neither can they complain if he acts also as a sovereign in the distribution of his spiritual favors. They, therefore, who regard this as referring only to temporal and national privileges, gain no relief in respect to the real difficulty in the case, for the unanswerable question would still be asked, why has not God made all people equal in everything? Why has he made any distinction among people? The only reply to all such inquiries is, \"Even so, Father, for so it seemeth good in thy sight;\" Matthew 11:26. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) if this distinction may be made in regard to temporal things, why not in regard to spiritual things? The principle must still be the same. If unjust in one case, it would be in the other. The fact that it is done in one case proves also that it will be in the other; for the same great principle will run through all the dealings of the divine government. And as people do not and cannot complain that God makes a distinction among them in regard to talents, health, beauty, prosperity, and rank, neither can they complain if he acts also as a sovereign in the distribution of his spiritual favors. They, therefore, who regard this as referring only to temporal and national privileges, gain no relief in respect to the real difficulty in the case, for the unanswerable question would still be asked, why has not God made all people equal in everything? Why has he made any distinction among people? The only reply to all such inquiries is, \"Even so, Father, for so it seemeth good in thy sight;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10-13. And not only this; but when Rebecca, &c.—It might be thought that there was a natural reason for preferring the child of Sarah, as being Abraham's true and first wife, both to the child of Hagar, Sarah's maid, and to the children of Keturah, his second wife. But there could be no such reason in the case of Rebecca, Isaac's only wife; for the choice of her son Jacob was the choice of one of two sons by the same mother and of the younger in preference to the elder, and before either of them was born, and consequently before either had done good or evil to be a ground of preference: and all to show that the sole ground of distinction lay in the unconditional choice of God—\"not of works, but of Him that calleth.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This verse is to be read with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 9:10,11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " being a parenthesis. Then when she resorted to the Lord for counsel, about the struggling of the children in her womb, it was told her, or revealed to her of God, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the elder should serve the younger:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the sense of which words, sea annotations on ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 25:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where they are recorded. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It was said unto her,.... To Rebecca, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the elder shall serve the younger, or \"the greater shall serve the lesser\", an Hebrew way of speaking; so Japheth is called  \"the great\", or, as we render it, \"the elder\", Genesis 10:21; and the evil imagination is said (i) to be  \"greater\", that is, elder than the good, thirteen years; See Gill on Luke 22:26; The sense is, Esau shall be a servant to Jacob; which is to be understood, not of temporal servitude; for in this sense he never was a servant to him; so far from it, that as soon as Jacob had got the birthright and blessing, he was obliged to flee from the face and fury of Esau; and upon his return after many years, he sent messengers to Esau in a very submissive manner, charging them after this manner, \"thus shall ye shall say to my lord Esau, thy servant Jacob saith thus\", &c. Genesis 32:4, and when he found that his brother was coming to meet him, which threw him into a panic fear, lest he should \"smite him, and the mother with the children\", Genesis 32:11, he prepares presents for him; and when he came to him, bowed himself seven times, and his wives and children bowed likewise; and the language in which he addressed his brother Esau, all the while they were together, was that of \"my lord\": now if this oracle was to be understood of outward temporal servitude, it is strange it should have no appearance, nor any shadow of an accomplishment in the persons of Jacob and Esau, supposing it was to have one in their posterity; and indeed the completion of it, in this sense, is not very evident in their offspring. It is certain, there was a long train of dukes and kings in Esau's family, before there was any king in Israel; the posterity of Esau were in lordly grandeur and splendour, when the children of Israel were grievously oppressed with hard bondage in Egypt. The single instance usually referred to, when the Edomites became tributaries to David, was near a thousand years after the giving out of this oracle; and this show of servitude did not last long, for in Joram's time they revolted, and so continued; and it is evident, that at the time of the Babylonish captivity, the children of Edom were prosperous and triumphant, and said concerning Jerusalem, \"Raze it, raze it, even to the foundation thereof\", Psalm 137:7, this servitude therefore is to be understood in a spiritual sense, of Esau's exclusion from the favour of God, and blessings of grace, signified by his being rejected from inheriting the blessing, which was given to Jacob; and it appeared that he was not a son, but a servant, by his departure, and pitching his dwelling elsewhere; which showed he had no interest in spiritual adoption, no right to the covenant of grace, nor was he an heir of heaven, all which were peculiar to Jacob: Esau was a servant of sin, under the dominion of it, and in bondage to it; whilst Jacob was the Lord's freeman, and, as a prince, had power with God and with men, and prevailed: Esau was serviceable to Jacob, both in things temporal and spiritual; as reprobates are to the elect, for all things are for their sakes, and work together for their good; Jacob's being obliged to flee from his brother, was for his good; by this means he got him a suitable wife, and large substance: his brother's meeting him on his return, which gave him so much pain and uneasiness, issued in his spiritual good; this sent him to the throne of grace, to humble himself before God, acknowledge his mercies, and his dependence on him, to implore his help, and plead his promises; and thus the oracle was verified in the persons of Jacob and Esau. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the elder shall serve the younger, or \"the greater shall serve the lesser\", an Hebrew way of speaking; so Japheth is called  \"the great\", or, as we render it, \"the elder\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the evil imagination is said (i) to be  \"greater\", that is, elder than the good, thirteen years; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; The sense is, Esau shall be a servant to Jacob; which is to be understood, not of temporal servitude; for in this sense he never was a servant to him; so far from it, that as soon as Jacob had got the birthright and blessing, he was obliged to flee from the face and fury of Esau; and upon his return after many years, he sent messengers to Esau in a very submissive manner, charging them after this manner, \"thus shall ye shall say to my lord Esau, thy servant Jacob saith thus\", &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and when he found that his brother was coming to meet him, which threw him into a panic fear, lest he should \"smite him, and the mother with the children\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he prepares presents for him; and when he came to him, bowed himself seven times, and his wives and children bowed likewise; and the language in which he addressed his brother Esau, all the while they were together, was that of \"my lord\": now if this oracle was to be understood of outward temporal servitude, it is strange it should have no appearance, nor any shadow of an accomplishment in the persons of Jacob and Esau, supposing it was to have one in their posterity; and indeed the completion of it, in this sense, is not very evident in their offspring. It is certain, there was a long train of dukes and kings in Esau's family, before there was any king in Israel; the posterity of Esau were in lordly grandeur and splendour, when the children of Israel were grievously oppressed with hard bondage in Egypt. The single instance usually referred to, when the Edomites became tributaries to David, was near a thousand years after the giving out of this oracle; and this show of servitude did not last long, for in Joram's time they revolted, and so continued; and it is evident, that at the time of the Babylonish captivity, the children of Edom were prosperous and triumphant, and said concerning Jerusalem, \"Raze it, raze it, even to the foundation thereof\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this servitude therefore is to be understood in a spiritual sense, of Esau's exclusion from the favour of God, and blessings of grace, signified by his being rejected from inheriting the blessing, which was given to Jacob; and it appeared that he was not a son, but a servant, by his departure, and pitching his dwelling elsewhere; which showed he had no interest in spiritual adoption, no right to the covenant of grace, nor was he an heir of heaven, all which were peculiar to Jacob: Esau was a servant of sin, under the dominion of it, and in bondage to it; whilst Jacob was the Lord's freeman, and, as a prince, had power with God and with men, and prevailed: Esau was serviceable to Jacob, both in things temporal and spiritual; as reprobates are to the elect, for all things are for their sakes, and work together for their good; Jacob's being obliged to flee from his brother, was for his good; by this means he got him a suitable wife, and large substance: his brother's meeting him on his return, which gave him so much pain and uneasiness, issued in his spiritual good; this sent him to the throne of grace, to humble himself before God, acknowledge his mercies, and his dependence on him, to implore his help, and plead his promises; and thus the oracle was verified in the persons of Jacob and Esau. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Midrash Kohelet, fol. 80. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Midrash Kohelet, fol. 80. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{9} It was said unto her, The elder shall serve the younger.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{9}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " It was said unto her, The elder shall serve the younger.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(9) He proves the casting away of Esau in that he was made servant to his brother: and proves the choosing of Jacob in that he was made lord of his brother, although his brother was the first begotten. And in order that no man might take what God had said, and refer it to external things, the apostle shows out of Malachi, who is a good interpreter of Moses, that the servitude of Esau was joined with the hatred of God, and the lordship of Jacob with the love of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The elder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Verbatim as LXX. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Of both Hebrew and Greek the literal rendering is ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The greater shall he bondsman to the less",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall serve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the personal history of Esau and Jacob this was not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "literally",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fulfilled; but it was so in spirit, in the subjection of Esau’s interests and privileges to those of Jacob. In the history of their descendants it was repeatedly fulfilled to the letter; and prophecy (as in other cases, e.g. that of Abraham,) regarded the ancestor and his descendants as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "solidaire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αὐτῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It was often foretold to mothers before conception or birth, what would happen to their sons.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι ὁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐλάσσονι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ὁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐλάσσονι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ μείζων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the elder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who, it might be reasonably thought, should command, as the younger should obey.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δουλεύσει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall serve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and yet not so for ever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Romans 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elder - younger (μείζων  - ἐλάσσονι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., greater - smaller. Compare Genesis 27:1, here the Hebrew is: \"Esau his great son;\" Sept., πρεσβύτερον elder. Genesis 29:16, Sept., \"The name of the greater was Leah, and the name of the younger (τῇ νεωτέρᾳ) Rachel.\" See a similar use in Aeschylus, \"Agamemnon,\" 349, \"Neither old (μέγαν) nor young (νεαρῶν) could escape the great net of slavery.\" While in these cases \"greater\" and \"smaller\" are evidently used as older and younger, yet the radical meaning is greater and less, and the reference is not to age, but to their relative position in the theocratic plan. Μείζων greater, occurs in forty-four passages in the New Testament, and in no case with the meaning elder. Compare Genesis 25:23 be stronger; Sept., ὑπέρεξει; shall surpass. The reference, if to the persons of Jacob and Esau, is to them as representatives of the two nations. See Genesis 25:23.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lit., greater - smaller. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", here the Hebrew is: \"Esau his great son;\" Sept., πρεσβύτερον elder. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Sept., \"The name of the greater was Leah, and the name of the younger (τῇ νεωτέρᾳ) Rachel.\" See a similar use in Aeschylus, \"Agamemnon,\" 349, \"Neither old (μέγαν) nor young (νεαρῶν) could escape the great net of slavery.\" While in these cases \"greater\" and \"smaller\" are evidently used as older and younger, yet the radical meaning is greater and less, and the reference is not to age, but to their relative position in the theocratic plan. Μείζων greater, occurs in forty-four passages in the New Testament, and in no case with the meaning elder. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " be stronger; Sept., ὑπέρεξει; shall surpass. The reference, if to the persons of Jacob and Esau, is to them as representatives of the two nations. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Historically the Edomites, represented by Esau, were for a time the greater, and surpassed the Israelites in national and military development. Moses sent envoys to the king of Edom from Kadesh, asking permission to pass through his country, which was refused, and the Edomite army came out against Israel (Numbers 20:14-21). Later they were \"vexed\" by Saul (1 Samuel 14:47), and were conquered and made tributary by David (2 Samuel 8:14). Their strength was shown in their subsequent attempts to recover independence (2 Kings 8:20, 2 Kings 8:21; 2 Kings 14:7; 2 Chronicles 28:17). Their final subjugation was effected by John Hyrcanus, who incorporated them into the Jewish nation and compelled them to be circumcised. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Historically the Edomites, represented by Esau, were for a time the greater, and surpassed the Israelites in national and military development. Moses sent envoys to the king of Edom from Kadesh, asking permission to pass through his country, which was refused, and the Edomite army came out against Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:14-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Later they were \"vexed\" by Saul (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and were conquered and made tributary by David (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Their strength was shown in their subsequent attempts to recover independence (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Their final subjugation was effected by John Hyrcanus, who incorporated them into the Jewish nation and compelled them to be circumcised. ",
            "children": []
          }
        ]
      }
    ]
  }
]