[[],[{"type":"prose","content":"An instruction, by Ethan the Ezrahite. Of the kind acts of Jehovah, to the age I sing, To all generations I make known Thy faithfulness with my mouth,"}],[{"type":"prose","content":"For I said, `To the age is kindness built, The heavens! Thou dost establish Thy faithfulness in them.'"}],[{"type":"prose","content":"I have made a covenant for My chosen, I have sworn to David My servant:"}],[{"type":"prose","content":"`Even to the age do I establish thy seed, And have built to generation and generation thy throne. Selah."}],[{"type":"prose","content":"and the heavens confess Thy wonders, O Jehovah, Thy faithfulness also [is] in an assembly of holy ones."}],[{"type":"prose","content":"For who in the sky, Compareth himself to Jehovah? Is like to Jehovah among sons of the mighty?"}],[{"type":"prose","content":"God is very terrible, In the secret counsel of His holy ones, And fearful over all surrounding Him."}],[{"type":"prose","content":"O Jehovah, God of Hosts, Who [is] like Thee -- a strong Jah? And Thy faithfulness [is] round about Thee."}],[{"type":"prose","content":"Thou [art] ruler over the pride of the sea, In the lifting up of its billows Thou dost restrain them."}],[{"type":"prose","content":"Thou hast bruised Rahab, as one wounded. With the arm of Thy strength Thou hast scattered Thine enemies."}],[{"type":"prose","content":"Thine [are] the heavens -- the earth also [is] Thine, The habitable world and its fulness, Thou hast founded them."}],[{"type":"prose","content":"North and south Thou hast appointed them, Tabor and Hermon in Thy name do sing."}],[{"type":"prose","content":"Thou hast an arm with might, Strong is Thy hand -- high Thy right hand."}],[{"type":"prose","content":"Righteousness and judgment [Are] the fixed place of Thy throne, Kindness and truth go before Thy face."}],[{"type":"prose","content":"O the happiness of the people knowing the shout, O Jehovah, in the light of Thy face they walk habitually."}],[{"type":"prose","content":"In Thy name they rejoice all the day, And in Thy righteousness they are exalted,"}],[{"type":"prose","content":"For the beauty of their strength [art] Thou, And in Thy good will is our horn exalted,"}],[{"type":"prose","content":"For of Jehovah [is] our shield, And of the Holy One of Israel our king."}],[{"type":"prose","content":"Then Thou hast spoken in vision, To Thy saint, yea, Thou sayest, I have placed help upon a mighty one, Exalted a chosen one out of the people,"}],[{"type":"prose","content":"I have found David My servant, With My holy oil I have anointed him."}],[{"type":"prose","content":"With whom My hand is established, My arm also doth strengthen him."}],[{"type":"prose","content":"An enemy exacteth not upon him, And a son of perverseness afflicteth him not."}],[{"type":"prose","content":"And I have beaten down before him his adversaries, And those hating him I plague,"}],[{"type":"prose","content":"And My faithfulness and kindness [are] with him, And in My name is his horn exalted."}],[{"type":"prose","content":"And I have set on the sea his hand, And on the rivers his right hand."}],[{"type":"prose","content":"He proclaimeth me: `Thou [art] my Father, My God, and the rock of my salvation.'"}],[{"type":"prose","content":"I also first-born do appoint him, Highest of the kings of the earth."}],[{"type":"prose","content":"To the age I keep for him My kindness, And My covenant [is] stedfast with him."}],[{"type":"prose","content":"And I have set his seed for ever, And his throne as the days of the heavens."}],[{"type":"prose","content":"If his sons forsake My law, And in My judgments do not walk;"}],[{"type":"prose","content":"If My statutes they pollute, And My commands do not keep,"}],[{"type":"prose","content":"I have looked after with a rod their transgression, And with strokes their iniquity,"}],[{"type":"prose","content":"And My kindness I break not from him, Nor do I deal falsely in My faithfulness."}],[{"type":"prose","content":"I profane not My covenant, And that which is going forth from My lips I change not."}],[{"type":"prose","content":"Once I have sworn by My holiness, I lie not to David,"}],[{"type":"prose","content":"His seed is to the age, And his throne [is] as the sun before Me,"}],[{"type":"prose","content":"As the moon it is established -- to the age, And the witness in the sky is stedfast. Selah."}],[{"type":"prose","content":"And Thou, Thou hast cast off, and dost reject, Thou hast shown Thyself wroth With Thine anointed,"}],[{"type":"prose","content":"Hast rejected the covenant of Thy servant, Thou hast polluted to the earth his crown,"}],[{"type":"prose","content":"Thou hast broken down all his hedges, Thou hast made his fenced places a ruin."}],[{"type":"prose","content":"Spoiled him have all passing by the way, He hath been a reproach to his neighbours,"}],[{"type":"prose","content":"Thou hast exalted the right hand of his adversaries, Thou hast caused all his enemies to rejoice."}],[{"type":"prose","content":"Also -- Thou turnest back the sharpness of his sword, And hast not established him in battle,"}],[{"type":"prose","content":"Hast caused [him] to cease from his brightness, And his throne to the earth hast cast down."}],[{"type":"prose","content":"Thou hast shortened the days of his youth, Hast covered him over [with] shame. Selah."}],[{"type":"prose","content":"Till when, O Jehovah, art Thou hidden? For ever doth Thy fury burn as fire?"}],[{"type":"prose","content":"Remember, I pray Thee, what [is] life-time? Wherefore in vain hast Thou created All the sons of men?"}],[{"type":"prose","content":"Who [is] the man that liveth, and doth not see death? He delivereth his soul from the hand of Sheol. Selah."}],[{"type":"prose","content":"Where [are] Thy former kindnesses, O Lord. Thou hast sworn to David in Thy faithfulness,"}],[{"type":"prose","content":"Remember, O Lord, the reproach of Thy servants, I have borne in my bosom all the strivings of the peoples,"}],[{"type":"prose","content":"Wherewith Thine enemies reproached, O Jehovah, Wherewith they have reproached The steps of Thine anointed."}],[{"type":"prose","content":"Blessed [is] Jehovah to the age. Amen, and amen!"}]]