[{"header":"Jerusalem Is Captured and Destroyed"},{"num":25,"verse":"In Zedekiah’s ninth year as king, on the tenth day of the tenth month, King Nebuchadnezzar of Babylonia led his entire army to attack Jerusalem. The troops set up camp outside the city and built ramps up to the city walls."},{"num":2,"verse":"After a year and a half, all the food in Jerusalem was gone. Then on the ninth day of the fourth month, "},{"num":4,"verse":"the Babylonian troops broke through the city wall. That same night, Zedekiah and his soldiers tried to escape through the gate near the royal garden, even though they knew the enemy had the city surrounded. They headed toward the desert, "},{"num":5,"verse":"but the Babylonian troops caught up with them near Jericho. They arrested Zedekiah, but his soldiers scattered in every direction."},{"num":6,"verse":"Zedekiah was taken to Riblah, where Nebuchadnezzar put him on trial and found him guilty. "},{"num":7,"verse":"Zedekiah’s sons were killed right in front of him. His eyes were then poked out, and he was put in chains and dragged off to Babylon."},{"num":8,"verse":"About a month later, in Nebuchadnezzar’s nineteenth year as king, Nebuzaradan, who was his official in charge of the guards, arrived in Jerusalem. "},{"num":9,"verse":"Nebuzaradan burned down the Lord’s temple, the king’s palace, and every important building in the city, as well as all the houses. "},{"num":10,"verse":"Then he ordered the Babylonian soldiers to break down the walls around Jerusalem. "},{"num":11,"verse":"He led away as prisoners the people left in the city, including those who had become loyal to Nebuchadnezzar. "},{"num":12,"verse":"Only some of the poorest people were left behind to work the vineyards and the fields."},{"num":13,"verse":"The Babylonian soldiers took the two bronze columns that stood in front of the temple, the ten movable bronze stands, and the large bronze bowl called the Sea. They broke them into pieces so they could take the bronze to Babylonia. "},{"num":14,"verse":"They carried off the bronze things used for worship at the temple, including the pans for hot ashes, and the shovels, snuffers, and also the dishes for incense, "},{"num":15,"verse":"as well as the fire pans and the sprinkling bowls. Nebuzaradan ordered his soldiers to take everything made of gold or silver."},{"num":16,"verse":"The pile of bronze from the columns, the stands, and the large bowl that Solomon had made for the temple was too large to be weighed. "},{"num":17,"verse":"Each column had been twenty-seven feet tall with a bronze cap four and a half feet high. These caps were decorated with bronze designs—some of them like chains and others like pomegranates."},{"num":18,"verse":"Next, Nebuzaradan arrested Seraiah the chief priest, Zephaniah his assistant, and three temple officials. "},{"num":19,"verse":"Then he arrested one of the army commanders, the king’s five personal advisors, and the officer in charge of gathering the troops for battle. He also found sixty more soldiers who were still in Jerusalem. "},{"num":20,"verse":"Nebuzaradan led them all to Riblah "},{"num":21,"verse":"near Hamath, where Nebuchadnezzar had them killed."},{"header":"Gedaliah Is Made Ruler of the People Left in Judah"},{"num":22,"verse":"King Nebuchadnezzar appointed Gedaliah son of Ahikam to rule the few people still living in Judah. "},{"num":23,"verse":"When the army officers and troops heard that Gedaliah was their ruler, the officers met with him at Mizpah. These men were Ishmael son of Nethaniah, Johanan son of Kareah, Seraiah son of Tanhumeth from Netophah, and Jaazaniah from Maacah."},{"num":24,"verse":"Gedaliah said to them, “Everything will be fine, I promise. We don’t need to be afraid of the Babylonian rulers, if we live here peacefully and do what Nebuchadnezzar says.”"},{"num":25,"verse":"Ishmael was from the royal family. And about two months after Gedaliah began his rule, Ishmael and ten other men went to Mizpah. They killed Gedaliah and his officials, including those from Judah and those from Babylonia. "},{"num":26,"verse":"After that, the army officers and all the people in Mizpah, whether important or not, were afraid of what the Babylonians might do. So they left Judah and went to Egypt."},{"header":"Jehoiachin Is Set Free"},{"num":27,"verse":"Jehoiachin was a prisoner in Babylon for thirty-seven years. Then Evil-Merodach became king of Babylonia, and in the first year of his rule, on the twenty-seventh day of the twelfth month, he let Jehoiachin out of prison. "},{"num":28,"verse":"Evil-Merodach was kind to Jehoiachin and honored him more than any of the other kings held prisoner there. "},{"num":29,"verse":"Jehoiachin was even allowed to wear regular clothes, and he ate at the king’s table every day. "},{"num":30,"verse":"As long as Jehoiachin lived, he was paid a daily allowance to buy whatever he needed."}]