[{"num":1,"verse":"so on the tenth day of the tenth month of the ninth year of Zedekiah’s reign, King Nebuchadnezzar of Babylon and his entire army approached Jerusalem, attacked it, encamped against it, and built a siege wall that surrounded the city. "},{"num":2,"verse":"The city remained under siege until the eleventh year of the reign of King Zedekiah. "},{"num":3,"verse":"By the ninth day of the fourth month, the resulting famine had become so severe in the city that no food remained for the people who lived in the land. "},{"num":4,"verse":"The city was breached, and the entire army left during the night through the gate that stood between the two walls beside the royal garden, even though the Chaldeans had surrounded the city. They escaped through the Arabah, "},{"num":5,"verse":"but the Chaldean army pursued the king and overtook him in the Jericho plains, where his entire army was scattered. "},{"num":6,"verse":"The Chaldeans captured the king and brought him to Riblah, where the king of Babylon determined his sentence. "},{"num":7,"verse":"They executed Zedekiah’s sons in his presence, blinded Zedekiah, bound him with bronze chains, and transported him to Babylon."},{"header":"Jerusalem is Burned and the Temple Demolished"},{"num":8,"verse":"On the seventh day of the fifth month, which was during the nineteenth year of King Nebuchadnezzar’s reign as king of Babylon, captain of the guard Nebuzaradan, a servant of the king of Babylon, arrived in Jerusalem "},{"num":9,"verse":"and set fire to the Lord’s Temple, the royal palace, and all the houses of Jerusalem. He even incinerated the lavish homes. "},{"num":10,"verse":"The Chaldean army that accompanied the captain of the guard demolished the walls that surrounded Jerusalem. "},{"num":11,"verse":"Nebuzaradan, the captain of the guard, carried the survivors of the people who remained in the city, those who had deserted to the king of Babylon, and the rest of the multitude into exile. "},{"num":12,"verse":"However, the captain of the guard left some of the poor people of the land to work as vinedressers and farmers."},{"num":13,"verse":"The Chaldeans also broke into pieces and carried back to Babylon the bronze pillars that stood in the Lord’s Temple, along with the stands and the bronze sea that used to be in the Lord’s Temple. "},{"num":14,"verse":"They also confiscated the pots, shovels, snuffers, spoons, and the rest of the bronze vessels that were used in ministry. "},{"num":15,"verse":"The captain of the guard also confiscated the fire pans, basins, and whatever had been crafted of pure gold and pure silver. "},{"num":16,"verse":"The bronze contained in the two pillars, the one sea, and the stands that Solomon had crafted for the Lord’s Temple could not be inventoried for weight. "},{"num":17,"verse":"The height of one of the pillars was eighteen cubits, and the capital on top of it was three cubits high. A latticework carved in the form of pomegranates encircled the capital, crafted completely out of brass. The second pillar was identical to the first."},{"header":"Judah’s Leaders are Executed"},{"num":18,"verse":"The captain of the guard arrested Seraiah the chief priest, Zephaniah the second priest, three temple officials, "},{"num":19,"verse":"one overseer from the city who supervised the soldiers, five of the king’s advisors who had been discovered in the city, the scribe who served the army captain who mustered the army of the land, and 60 men of the land who were discovered in the city. "},{"num":20,"verse":"Nebuzaradan, the captain of the guard, took them to the king of Babylon at Riblah, "},{"num":21,"verse":"where the king of Babylon executed them in the land of Hamath. And so Judah was transported into exile from the land."},{"header":"Gedaliah is Appointed Governor"},{"num":22,"verse":"Now as for the people who remained in the land of Judah whom King Nebuchadnezzar of Babylon had left behind, he appointed Ahikam’s son Gedaliah, the grandson of Shaphan, to rule. "},{"num":23,"verse":"When all the captains of the armies, along with their men, heard that the king of Babylon had appointed Gedaliah, these men visited Gedaliah at Mizpah: Nethaniah’s son Ishmael, Kareah’s son Johanan, Tanhumeth the Netophathite’s son Seraiah, and Jaazaniah, who was descended from the Maacathites. "},{"num":24,"verse":"Gedaliah made this promise to them and to their men: “Don’t be afraid of the servants of the Chaldeans. Live in the land and serve the king of Babylon, and things will go well with you.” "},{"num":25,"verse":"Nevertheless, seven months later, Nethaniah’s son Ishmael, the grandson of Elishama from the royal family, came with ten men and attacked Gedaliah. As a result, he died along with the Jews and Chaldeans who were with him at Mizpah. "},{"num":26,"verse":"Then all the people, including those who were insignificant and those who were important, fled with the captains of the armed forces to Egypt, because they were afraid of the Chaldeans."},{"header":"Jehoiachin Leaves Prison"},{"num":27,"verse":"Later on, after King Jehoiachin of Judah had been in exile for 37 years, on the twenty-seventh day of the twelfth month, during the first year of his reign, King Evil-merodach of Babylon released King Jehoiachin of Judah from prison. "},{"num":28,"verse":"He spoke kindly to him and elevated his position above the thrones of the kings with him in Babylon. "},{"num":29,"verse":"Jehoiachin changed out of his prison clothes and had regular meals in the king’s presence every day for the rest of his life, "},{"num":30,"verse":"and a regular stipend was provided to him by the king in accordance with his needs for as long as he lived."}]