[{"num":11,"verse":"6 The building of Babel was the cause of the confusion of tongues. 10 The age and generation of Shem unto Abram. 31 Abram’s departure from Ur with his father Terah, Sarai and Lot. 32 The age and death of Terah."},{"num":1,"verse":"Then the whole earth was of one language and one speech."},{"num":2,"verse":"And as they went from the East, they found a plain in the land of Shinar, and there they abode."},{"num":3,"verse":"And they said one to another, Come, let us make brick and burn it in the fire, so they had brick for stone, and slime had they instead of mortar."},{"num":4,"verse":"Also they said, Go to, let us build us a city and a tower, whose top may reach unto the heaven, that we may get us a name, lest we be scattered upon the whole earth."},{"num":5,"verse":"But the Lord came down, to see the city and tower which the sons of men built."},{"num":6,"verse":"And the Lord said, Behold, the people is one, and they all have one language, and this they begin to do, neither can they now be stopped from whatsoever they have imagined to do."},{"num":7,"verse":"Come on, let us go down, and there confound their language, that everyone perceive not another’s speech."},{"num":8,"verse":"So the Lord scattered them from thence upon all the earth, and they left off to build the city."},{"num":9,"verse":"Therefore the name of it was called Babel, because the Lord did there confound the language of all the earth: from thence then did the Lord scatter them upon all the earth."},{"num":10,"verse":"¶ These are the generations of Shem: Shem was an hundred years old, and begat Arphaxad two years after the flood."},{"num":11,"verse":"And Shem lived after he begat Arphaxad five hundred years, and begat sons and daughters."},{"num":12,"verse":"Also Arphaxad lived five and thirty years, and begat Salah."},{"num":13,"verse":"And Arphaxad lived after he begat Salah, four hundred and three years, and begat sons and daughters."},{"num":14,"verse":"And Salah lived thirty years, and begat Eber."},{"num":15,"verse":"So Salah lived after he begat Eber four hundred and three years, and begat sons and daughters."},{"num":16,"verse":"Likewise Eber lived four and thirty years, and begat Peleg."},{"num":17,"verse":"So Eber lived after he begat Peleg four hundred and thirty years, and begat sons and daughters."},{"num":18,"verse":"And Peleg lived thirty years, and begat Reu."},{"num":19,"verse":"And Peleg lived after he begat Reu two hundred and nine years, and begat sons and daughters."},{"num":20,"verse":"Also Reu lived two and thirty years, and begat Serug."},{"num":21,"verse":"So Reu lived after he begat Serug two hundred and seven years, and begat sons and daughters."},{"num":22,"verse":"Moreover Serug lived thirty years, and begat Nahor."},{"num":23,"verse":"And Serug lived after he begat Nahor two hundred years, and begat sons and daughters."},{"num":24,"verse":"And Nahor lived nine and twenty years, and begat Terah."},{"num":25,"verse":"So Nahor lived after he begat Terah, an hundred and nineteen years, and begat sons and daughters."},{"num":26,"verse":"So Terah lived seventy years, and begat Abram, Nahor, and Haran."},{"num":27,"verse":"¶ Now these are the generations of Terah: Terah begat Abram, Nahor, and Haran: and Haran begat Lot."},{"num":28,"verse":"Then Haran died before Terah his father in the land of his nativity, in Ur of the Chaldeans."},{"num":29,"verse":"So Abram and Nahor took them wives. The name of Abram’s wife was Sarai, and the name of Nahor’s wife Milcah, the daughter of Haran, the father of Milcah, and the father of Iscah."},{"num":30,"verse":"But Sarai was barren, and had no child."},{"num":31,"verse":"Then Terah took Abram his son, and Lot the son of Haran his son’s son, and Sarai his daughter-in-law, his son Abram’s wife: and they departed together from Ur of the Chaldeans, to go into the land of Canaan, and they came to Haran, and dwelt there."},{"num":32,"verse":"So the days of Terah were two hundred and five years, and Terah died in Haran."}]