[{"num":12,"verse":"Six days before Pesach, Yeshua came to Beit-Anyah, where El‘azar lived, the man Yeshua had raised from the dead; "},{"num":2,"verse":"so they gave a dinner there in his honor. Marta served the meal, and El‘azar was among those at the table with him. "},{"num":3,"verse":"Miryam took a whole pint of pure oil of spikenard, which is very expensive, poured it on Yeshua’s feet and wiped his feet with her hair, so that the house was filled with the fragrance of the perfume. "},{"num":4,"verse":"But one of the talmidim, Y’hudah from K’riot, the one who was about to betray him, said, "},{"num":5,"verse":"“This perfume is worth a year’s wages! Why wasn’t it sold and the money given to the poor?” "},{"num":6,"verse":"Now he said this not out of concern for the poor, but because he was a thief — he was in charge of the common purse and used to steal from it. "},{"num":7,"verse":"Yeshua said, “Leave her alone! She kept this for the day of my burial. "},{"num":8,"verse":"You always have the poor among you, but you will not always have me.”"},{"num":9,"verse":"A large crowd of Judeans learned that he was there; and they came not only because of Yeshua, but also so that they could see El‘azar, whom he had raised from the dead. "},{"num":10,"verse":"The head cohanim then decided to do away with El‘azar too, "},{"num":11,"verse":"since it was because of him that large numbers of the Judeans were leaving their leaders and putting their trust in Yeshua."},{"num":12,"verse":"The next day, the large crowd that had come for the festival heard that Yeshua was on his way into Yerushalayim. "},{"num":13,"verse":"They took palm branches and went out to meet him, shouting,"},{"num":16,"verse":"His talmidim did not understand this at first; but after Yeshua had been glorified, then they remembered that the Tanakh said this about him, and that they had done this for him. "},{"num":17,"verse":"The group that had been with him when he called El‘azar out of the tomb and raised him from the dead had been telling about it. "},{"num":18,"verse":"It was because of this too that the crowd came out to meet him — they had heard that he had performed this miracle. "},{"num":19,"verse":"The P’rushim said to each other, “Look, you’re getting nowhere! Why, the whole world has gone after him!”"},{"num":20,"verse":"Among those who went up to worship at the festival were some Greek-speaking Jews. "},{"num":21,"verse":"They approached Philip, the one from Beit-Tzaidah in the Galil, with a request. “Sir,” they said, “we would like to see Yeshua.” "},{"num":22,"verse":"Philip came and told Andrew; then Andrew and Philip went and told Yeshua. "},{"num":23,"verse":"Yeshua gave them this answer: “The time has come for the Son of Man to be glorified. "},{"num":24,"verse":"Yes, indeed! I tell you that unless a grain of wheat that falls to the ground dies, it stays just a grain; but if it dies, it produces a big harvest. "},{"num":25,"verse":"He who loves his life loses it, but he who hates his life in this world will keep it safe right on into eternal life! "},{"num":26,"verse":"If someone is serving me, let him follow me; wherever I am, my servant will be there too. My Father will honor anyone who serves me."},{"num":27,"verse":"“Now I am in turmoil. What can I say — ‘Father, save me from this hour’? No, it was for this very reason that I have come to this hour. I will say this: "},{"num":28,"verse":"‘Father, glorify your name!’” At this a bat-kol came out of heaven, “I have glorified it before, and I will glorify it again!” "},{"num":29,"verse":"The crowd standing there and hearing it said that it had thundered; others said, “An angel spoke to him.” "},{"num":30,"verse":"Yeshua answered, “This bat-kol did not come for my sake but for yours. "},{"num":31,"verse":"Now is the time for this world to be judged, now the ruler of this world will be expelled. "},{"num":32,"verse":"As for me, when I am lifted up from the earth, I will draw everyone to myself.” "},{"num":33,"verse":"He said this to indicate what kind of death he would die."},{"num":34,"verse":"The crowd answered, “We have learned from the Torah that the Messiah remains forever. How is it that you say the Son of Man has to be ‘lifted up’? Who is this ‘Son of Man’?” "},{"num":35,"verse":"Yeshua said to them, “The light will be with you only a little while longer. Walk while you have the light, or the dark will overtake you; he who walks in the dark doesn’t know where he’s going. "},{"num":36,"verse":"While you have the light, put your trust in the light, so that you may become people of light.” Yeshua said these things, then went off and kept himself hidden from them."},{"num":37,"verse":"Even though he had performed so many miracles in their presence, they still did not put their trust in him, "},{"num":38,"verse":"in order that what Yesha‘yahu the prophet had said might be fulfilled,"},{"num":39,"verse":"The reason they could not believe was — as Yesha‘yahu said elsewhere —"},{"num":41,"verse":"(Yesha‘yahu said these things because he saw the Sh’khinah of Yeshua and spoke about him.) "},{"num":42,"verse":"Nevertheless, many of the leaders did trust in him; but because of the P’rushim they did not say so openly, out of fear of being banned from the synagogue; "},{"num":43,"verse":"for they loved praise from other people more than praise from God."},{"num":44,"verse":"Yeshua declared publicly, “Those who put their trust in me are trusting not merely in me, but in the One who sent me. "},{"num":45,"verse":"Also those who see me see the One who sent me. "},{"num":46,"verse":"I have come as a light into the world, so that everyone who trusts in me might not remain in the dark. "},{"num":47,"verse":"If anyone hears what I am saying and does not observe it, I don’t judge him; for I did not come to judge the world, but to save the world. "},{"num":48,"verse":"Those who reject me and don’t accept what I say have a judge — the word which I have spoken will judge them on the Last Day. "},{"num":49,"verse":"For I have not spoken on my own initiative, but the Father who sent me has given me a command, namely, what to say and how to say it. "},{"num":50,"verse":"And I know that his command is eternal life. So what I say is simply what the Father has told me to say.”"}]