[{"header":"Jesus with Friends in Bethany"},{"num":12,"verse":"Six days before the Passover Feast, Jesus went to Bethany, where Lazarus lived. (Lazarus is the man Jesus raised from death.) "},{"num":2,"verse":"There they had a dinner for Jesus. Martha served the food. Lazarus was one of the people eating with Jesus. "},{"num":3,"verse":"Mary brought in a pint of very expensive perfume made from pure nard. She poured the perfume on Jesus’ feet, and then she wiped his feet with her hair. And the sweet smell from the perfume filled the whole house."},{"num":4,"verse":"Judas Iscariot, one of Jesus’ followers, was there. (He was the one who would later turn against Jesus.) Judas said, "},{"num":5,"verse":"“This perfume was worth an entire year’s wages. It should have been sold and the money given to the poor.” "},{"num":6,"verse":"But Judas did not really care about the poor. He said this because he was a thief. He was the one who kept the money box, and he often stole money from it."},{"num":7,"verse":"Jesus answered, “Let her alone. It was right for her to save this perfume for today—the day for me to be prepared for burial. "},{"header":"The Plot Against Lazarus"},{"num":9,"verse":"A large crowd of Jews heard that Jesus was in Bethany. So they went there to see not only Jesus but also Lazarus. Lazarus was the one Jesus raised from death. "},{"num":10,"verse":"So the leading priests made plans to kill Lazarus, too. "},{"num":11,"verse":"Because of Lazarus many Jews were leaving them and believing in Jesus."},{"header":"Jesus Enters Jerusalem"},{"num":12,"verse":"The next day a great crowd in Jerusalem heard that Jesus was coming there. These were the people who had come to the Passover Feast. "},{"num":13,"verse":"They took branches of palm trees and went out to meet Jesus. They shouted,"},{"num":14,"verse":"Jesus found a colt and sat on it. This was as the Scripture says,"},{"num":16,"verse":"The followers of Jesus did not understand this at first. But after Jesus was raised to glory, they remembered that this had been written about him. And they remembered that they had done these things to him."},{"header":"People Tell About Jesus"},{"num":17,"verse":"There had been many people with Jesus when he raised Lazarus from death and told him to come out of the tomb. Now they were telling others about what Jesus did. "},{"num":18,"verse":"Many people went out to meet Jesus, because they had heard about this miracle. "},{"num":19,"verse":"So the Pharisees said to each other, “You can see that nothing is going right for us. Look! The whole world is following him.”"},{"header":"Jesus Talks About His Death"},{"num":20,"verse":"There were some Greek people, too, who came to Jerusalem to worship at the Passover Feast. "},{"num":21,"verse":"They went to Philip. (Philip was from Bethsaida, in Galilee.) They said, “Sir, we would like to see Jesus.” "},{"num":22,"verse":"Philip told Andrew. Then Andrew and Philip told Jesus."},{"num":23,"verse":"Jesus said to them, “The time has come for the Son of Man to receive his glory. "},{"num":29,"verse":"The crowd standing there heard the voice. They said it was thunder."},{"num":30,"verse":"Jesus said, “That voice was for you, not for me. "},{"num":33,"verse":"Jesus said this to show how he would die."},{"num":34,"verse":"The crowd said, “We have heard from the law that the Christ will live forever. So why do you say, ‘The Son of Man must be lifted up’? Who is this ‘Son of Man’?”"},{"num":35,"verse":"Then Jesus said, “The light will be with you for a little longer. So walk while you have the light. Then the darkness will not catch you. He who walks in the darkness does not know where he is going. "},{"header":"Some Don’t Believe in Jesus"},{"num":37,"verse":"Though Jesus had done many miracles before the people, they still did not believe in him. "},{"num":38,"verse":"This was to make clear the full meaning of what Isaiah the prophet said:"},{"num":39,"verse":"This is why the people could not believe: Isaiah also said,"},{"num":41,"verse":"Isaiah said this because he saw Jesus’ glory and spoke about him."},{"num":42,"verse":"But many people believed in Jesus, even many of the leaders. But because of the Pharisees, they did not say that they believed in him. They were afraid that they would be put out of the synagogue. "},{"num":43,"verse":"They loved praise from men more than praise from God."},{"num":44,"verse":"Then Jesus cried out, “He who believes in me is really believing in the One who sent me. "}]