[{"num":12,"verse":"Then, six days before the Passover, Jesus came to Bethany, where Lazarus was; who had died and whom He had raised from the dead."},{"num":2,"verse":"There they made Him a supper, and Martha served. But Lazarus was one of those who sat at the table with Him."},{"num":3,"verse":"Then Mary took a pound of ointment of Spikenard (very costly) and anointed Jesus’ feet, and wiped His feet with her hair. And the house was filled with the fragrance of the ointment."},{"num":4,"verse":"Then one of His disciples who would betray him, Judas Iscariot (son of Simon) said,"},{"num":5,"verse":"“Why was not this ointment sold for three hundred denari and given to the poor?”"},{"num":6,"verse":"Now, he said this, not because he cared for the poor, but because he was a thief, and had the bag, and held that which was given."},{"num":7,"verse":"Then Jesus said, “Let her alone. She kept it for the day of My burying."},{"num":8,"verse":"“For the poor you have with you always. But Me you shall not have always.”"},{"num":9,"verse":"Then many of the Jews knew that He was there. And they came, not for Jesus’ sake only, but that they might see Lazarus also, whom He had raised from the dead."},{"num":10,"verse":"Therefore, the chief priests consulted, so that they might put Lazarus to death also,"},{"num":11,"verse":"because many of the Jews went away and believed in Jesus because of him."},{"num":12,"verse":"The next day, a great multitude who had come to the feast, when they heard that Jesus would come to Jerusalem,"},{"num":13,"verse":"took branches of palm trees, and went forth to meet Him, and cried, “Hosanna! Blessed is the King of Israel Who comes in the Name of the Lord!”"},{"num":14,"verse":"And Jesus found a young donkey, and sat on it, as it is written,"},{"num":15,"verse":"“Fear not, daughter of Zion. Behold, your King comes, sitting on a donkey’s colt.”"},{"num":16,"verse":"His disciples did not understand these things at the first. But when Jesus was glorified, then they remembered that these things were written of Him. And that they had done these things to Him."},{"num":17,"verse":"Therefore, the people who were with Him bore witness that He called Lazarus out of the grave and raised him from the dead."},{"num":18,"verse":"Thus, the people also met Him, because they heard that He had done this miracle."},{"num":19,"verse":"And the Pharisees said among themselves, “Do you see how nothing is better? Behold, the world goes after Him.”"},{"num":20,"verse":"Now, there were certain Greeks among them who came up to worship at the Feast."},{"num":21,"verse":"And they came to Philip, who was of Bethsaida in Galilee, and asked him, saying, “Sir, we would like to see Jesus.”"},{"num":22,"verse":"Philip came and told Andrew. And then Andrew and Philip came and told Jesus."},{"num":23,"verse":"And Jesus answered them, saying, “The hour has come that the Son of Man must be glorified."},{"num":24,"verse":"“Truly, truly I say to you, unless the grain of wheat falls into the ground and dies, it remains alone. But if it dies, it brings forth much fruit."},{"num":25,"verse":"“The one who loves his life, shall lose it. And the one who hates his life in this world, shall keep it to life eternal."},{"num":26,"verse":"“If anyone serves Me, let him follow Me. For where I am, there My servant shall be. And if anyone serves Me, My Father will honor him."},{"num":27,"verse":"Now My soul is troubled. And what shall I say? ‘Father, save Me from this hour’? But, for this I came to this hour."},{"num":28,"verse":"“Father, glorify Your Name.” Then, there came a Voice from Heaven, “I have both glorified it and will glorify it again.”"},{"num":29,"verse":"Then, the people who stood by and heard it said that it was thunder. Others said an angel spoke to Him."},{"num":30,"verse":"Jesus answered, and said, “This Voice did not come because of Me, but for your sakes."},{"num":31,"verse":"“Now is the judgment of this world. Now shall the prince of this world be cast out."},{"num":32,"verse":"“And I, if I am lifted up from the earth, will draw all to Myself."},{"num":33,"verse":"Now He said this to signify what death He would die."},{"num":34,"verse":"The people answered Him, “We have heard out of the Law that the Christ abides forever. So how can You say that the Son of Man must be lifted up? Who is the Son of Man?”"},{"num":35,"verse":"Then Jesus said to them, “The Light is with you for a little while longer. Walk while you have the Light, lest the darkness come upon you. For one who walks in the dark, does not know where he goes."},{"num":36,"verse":"“While you have the Light, believe in the Light, that you may be the children of the Light.” These things Jesus spoke. And having departed, He hid Himself from them."},{"num":37,"verse":"And though He had done so many miracles before them, they did not believe in Him,"},{"num":38,"verse":"so that the saying of Isaiah the Prophet might be fulfilled, that said, ‘Lord, who believed our report? And to whom is the arm of the Lord revealed?’"},{"num":39,"verse":"Therefore they could not believe, because Isaiah says again,"},{"num":40,"verse":"‘He has blinded their eyes and hardened their heart, so that they would not see with their eyes, nor understand with their heart, and be converted, and I heal them.’"},{"num":41,"verse":"These things Isaiah said when he saw His glory and spoke of Him."},{"num":42,"verse":"Nevertheless, even among the chief rulers, many believed in Him. But because of the Pharisees, they did not confess Him, lest they should be cast out of the synagogue."},{"num":43,"verse":"For they loved the praise of man more than the praise of God."},{"num":44,"verse":"And Jesus cried, and said, “Whoever believes in Me, believes not in Me, but in Him who sent Me!"},{"num":45,"verse":"“And whoever sees Me, sees Him who sent Me!"},{"num":46,"verse":"“I have come, a Light into the world, so that everyone who believes in Me would not stay in darkness."},{"num":47,"verse":"“And if anyone hears My words, and does not believe, I do not judge him. For I did not come to judge the world, but to save the world."},{"num":48,"verse":"“Whoever refuses Me, and does not receive My words, has One Who judges him - the Word that I have spoken. It shall judge him on the last day."},{"num":49,"verse":"“For I have not spoken of Myself, but the Father Who sent Me. He gave Me a commandment, what I should say and what I should speak."},{"num":50,"verse":"“And I know that His commandment is life everlasting. Therefore, the things that I speak, I speak just as the Father said to Me.”"}]