[{"num":12,"verse":"Six days before the Passover Feast Jesus came to Bethany where Lazarus lived. This was the Lazarus that Jesus had raised from death."},{"num":2,"verse":"The people made supper for Jesus. Martha helped give food for the people, and Lazarus was one of those who sat at the table with Jesus."},{"num":3,"verse":"Mary had a jar of oil. It smelled very nice and cost much money. She put some of it on Jesus' feet. Then she wiped his feet with her hair. The smell of oil went all through the house."},{"num":4,"verse":"Judas, the son of Simon Iscariot, was there. He was one of the disciples, the one who was going to give Jesus over to the people who hated him."},{"num":5,"verse":"He said, `This oil is worth a year's wages! Why did we not sell it and give the money to poor people?'"},{"num":6,"verse":"Judas did not say this because he cared for poor people. But he used to steal. He carried the disciples' money bag and he used to take money out of the bag for himself."},{"num":7,"verse":"Then Jesus said, `Leave her alone. She has kept this oil for the time when they will bury me."},{"num":8,"verse":"You will have poor people with you always. But you will not always have me with you.'"},{"num":9,"verse":"Many of the Jews knew that Jesus was at Bethany. So they came because Jesus was there. But they also came to see Lazarus, whom Jesus had raised from death."},{"num":10,"verse":"The chief priests planned to kill Lazarus also."},{"num":11,"verse":"Many of the Jews left the priests and believed in Jesus, because of Lazarus."},{"num":12,"verse":"The next day Jesus went to Jerusalem. Many people who were at the feast heard that he was coming."},{"num":13,"verse":"So they took branches of palm trees and went to meet him. They shouted, `Praise God! God bless the King of Israel! He is coming in the name of the Lord!'"},{"num":14,"verse":"Then Jesus found a young donkey and rode on it. He did as the holy writings say,"},{"num":15,"verse":"`Do not fear, people of Jerusalem. Your King is coming. He will be riding on a young donkey.'"},{"num":16,"verse":"His disciples did not understand this at first. But when God had made Jesus great, then they remembered what the holy writings said about him. They remembered that people had done these things to him."},{"num":17,"verse":"Many people were with Jesus when he called Lazarus out of the grave and raised him from death. They had talked about what he did."},{"num":18,"verse":"That is why many people went out to meet Jesus. They had heard about the big work he did."},{"num":19,"verse":"The Pharisees said to each other, `See, you cannot stop this thing. People everywhere are going after him.'"},{"num":20,"verse":"Some of the people who came to worship God at the feast were Greek people."},{"num":21,"verse":"They came to Philip who was from Bethsaida in Galilee. They said, `Sir, we want to see Jesus.'"},{"num":22,"verse":"Philip came to Andrew and told him. Then they both went and told Jesus."},{"num":23,"verse":"Jesus said, `The time has come when the Son of Man will be made great."},{"num":24,"verse":"I tell you the truth. If a seed of grain is not put in the ground to die, it will be only a seed. But if it dies, it will bear many seeds."},{"num":25,"verse":"Anyone who tries to keep his life will lose it. Anyone who gives up his life in this world will live for ever in the next world."},{"num":26,"verse":"If anyone wants to do my work, he must go where I go. Then he and I will be together. My Father will honour everyone who works for me."},{"num":27,"verse":"`Now my heart is very sad. Shall I say, \"Father, save me from this time of trouble\"? No, I have come to this time just so that I might go through it."},{"num":28,"verse":"Father, do what will make your name great.' Then a voice from the sky said, `I have already done that and I will do it again.'"},{"num":29,"verse":"Some people were standing near. When they heard the voice, they said, `It is thundering.' Other people said, `An angel talked to him.'"},{"num":30,"verse":"Jesus answered them, `This voice did not come for my sake, but it came for your sake."},{"num":31,"verse":"It is time now for the world to be judged. The ruler of this world will be put out."},{"num":32,"verse":"And as for me, if they lift me up from the earth, I will draw all people to me.'"},{"num":33,"verse":"He said this to show how he would die."},{"num":34,"verse":"The people answered him, `Our law book tells us that Christ will stay here for ever. Why do you say, \"The Son of Man will be raised up from the earth\"? Tell us who this Son of Man is.'"},{"num":35,"verse":"Then Jesus said to them, `You have light for a short time longer. Walk while you have the light so that you will not need to walk in the dark. The person who walks in the dark cannot see where he is going."},{"num":36,"verse":"Believe in the light while you have the light, so that you may be a people who have the light in you.' When Jesus had said this, he left them. They did not know where he was."},{"num":37,"verse":"Even though they had seen Jesus doing many big works, they did not believe in him."},{"num":38,"verse":"What the prophet Isaiah said came true. He said, `Lord, who has believed what we told them? Who has believed even though they have seen the power of God's hand?'"},{"num":40,"verse":"So they could not believe. Isaiah said also, `God has made them blind. Their hearts have no feeling. They cannot see. They do not understand with their heart. They will not turn to God. If they did turn, he would heal them.'"},{"num":41,"verse":"Isaiah said this about the Christ when he saw how great he was."},{"num":42,"verse":"Some of the chief rulers believed in Jesus, but they did not tell anyone that they believed in him. They were afraid the Pharisees would put them out of the meeting place."},{"num":43,"verse":"They wanted the praise of men more than the praise of God."},{"num":44,"verse":"Jesus called out, `Anyone who believes in me does not believe just in me, but in the one who sent me."},{"num":45,"verse":"Anyone who sees me sees the one who sent me."},{"num":46,"verse":"I am a light and have come into the world. Anyone who believes in me will not be in the dark."},{"num":47,"verse":"If anyone hears what I say and does not believe it, I do not judge him. I did not come to judge the world. I came to save the world."},{"num":48,"verse":"The one who will not believe in me and will not listen to what I say will be judged anyway. The same things that I have said will judge him on the last day."},{"num":49,"verse":"`I have not said this from my own mind, but my Father who sent me told me what to say. He told me what to tell you."},{"num":50,"verse":"I know that what he told me to say has power to give life for ever. So I say everything my Father has told me to say.'"}]