[{"num":22,"verse":"Then David said, “This is the house of Adonai, God; and this is the altar Isra’el is to use for burnt offerings.” "},{"num":2,"verse":"David ordered that the foreigners in the land of Isra’el should be assembled, and he appointed stone-workers to shape stones for building the house of God. "},{"num":3,"verse":"David prepared a large store of iron from which to make nails and clamps for the gateway doors and, a quantity of bronze too great to weigh, "},{"num":4,"verse":"and cedar logs beyond numbering — because the Tzidonim and the people from Tzor brought cedar logs in abundance to David."},{"num":5,"verse":"David said, “Shlomo my son is young and inexperienced, while the house to be built for Adonai must be so magnificent and splendid that its fame and glory will be known in every country; so I will make preparations for him.” Therefore David made extensive preparations before his death. "},{"num":6,"verse":"Then he summoned Shlomo his son and charged him to build a house for Adonai, the God of Isra’el. "},{"num":7,"verse":"“My son,” said David to Shlomo, “my heart was set on building a house for the name of Adonai my God. "},{"num":8,"verse":"But a message from Adonai came to me, ‘You have shed much blood and fought great wars. You are not to build a house for my name, because you have shed so much blood on the earth in my sight. "},{"num":9,"verse":"But you will have a son who will be a man of rest. I will give him rest from all his enemies that surround him; for his name is to be Shlomo, and during his reign I will give peace  and quiet to Isra’el. "},{"num":10,"verse":"It is he who will build a house for my name. He will be my son and I will be his father, and I will establish the throne of his kingdom over Isra’el forever.’"},{"num":11,"verse":"“Now, my son, may Adonai be with you and give you success as you build the house of Adonai your God, in keeping with what he said about you. "},{"num":12,"verse":"May Adonai give you common sense and understanding, and may he give you his orders concerning Isra’el, so that you will observe the Torah of Adonai your God. "},{"num":13,"verse":"Then you will succeed, if you take care to obey the laws and rulings that Adonai ordered Moshe concerning Isra’el. Be strong, be bold; don’t be afraid or become discouraged!"},{"num":14,"verse":"“Now look: despite my difficulties, I have prepared for the house of Adonai 3,300 tons of gold, 33,000 tons of silver, and so much bronze and iron that it can’t be weighed. I’ve also prepared timber and stone, and you can add to it. "},{"num":15,"verse":"Moreover, you have plenty of workers — quarrymen, stone-workers, lumbermen, and all kinds of skilled craftsmen to do whatever has to be done with "},{"num":16,"verse":"the gold, silver, bronze and iron — they’re beyond number. So get up, and get to work! And may Adonai be with you.”"},{"num":17,"verse":"David also ordered all the leaders of Isra’el to help Shlomo his son: "},{"num":18,"verse":"“Isn’t Adonai your God with you? Hasn’t he given you rest on every side? For he has put the inhabitants of the land under my power — the land has been subdued before Adonai and his people. "},{"num":19,"verse":"Now set your heart and being on seeking Adonai your God. Get up, and build the sanctuary for Adonai, God. Then you can bring the ark for the covenant of Adonai and the holy articles of God into the house that will be built for the name of Adonai.”"}]