[[],[{"type":"prose","content":"Then David said, “This will be the location for the Temple of the LORD God and the place of the altar for Israel’s burnt offerings!”"}],[{"type":"header","content":"Preparations for the Temple"},{"type":"prose","content":"So David gave orders to call together the foreigners living in Israel, and he assigned them the task of preparing finished stone for building the Temple of God."}],[{"type":"prose","content":"David provided large amounts of iron for the nails that would be needed for the doors in the gates and for the clamps, and he gave more bronze than could be weighed."}],[{"type":"prose","content":"He also provided innumerable cedar logs, for the men of Tyre and Sidon had brought vast amounts of cedar to David."}],[{"type":"prose","content":"David said, “My son Solomon is still young and inexperienced. And since the Temple to be built for the LORD must be a magnificent structure, famous and glorious throughout the world, I will begin making preparations for it now.” So David collected vast amounts of building materials before his death."}],[{"type":"prose","content":"Then David sent for his son Solomon and instructed him to build a Temple for the LORD, the God of Israel."}],[{"type":"prose","content":"“My son, I wanted to build a Temple to honor the name of the LORD my God,” David told him."}],[{"type":"prose","content":"“But the LORD said to me, ‘You have killed many men in the battles you have fought. And since you have shed so much blood in my sight, you will not be the one to build a Temple to honor my name."}],[{"type":"prose","content":"But you will have a son who will be a man of peace. I will give him peace with his enemies in all the surrounding lands. His name will be Solomon, and I will give peace and quiet to Israel during his reign."}],[{"type":"prose","content":"He is the one who will build a Temple to honor my name. He will be my son, and I will be his father. And I will secure the throne of his kingdom over Israel forever.’"}],[{"type":"prose","content":"“Now, my son, may the LORD be with you and give you success as you follow his directions in building the Temple of the LORD your God."}],[{"type":"prose","content":"And may the LORD give you wisdom and understanding, that you may obey the Law of the LORD your God as you rule over Israel."}],[{"type":"prose","content":"For you will be successful if you carefully obey the decrees and regulations that the LORD gave to Israel through Moses. Be strong and courageous; do not be afraid or lose heart!"}],[{"type":"prose","content":"“I have worked hard to provide materials for building the Temple of the LORD—nearly 4,000 tons of gold, 40,000 tons of silver, and so much iron and bronze that it cannot be weighed. I have also gathered timber and stone for the walls, though you may need to add more."}],[{"type":"prose","content":"You have a large number of skilled stonemasons and carpenters and craftsmen of every kind."}],[{"type":"prose","content":"You have expert goldsmiths and silversmiths and workers of bronze and iron. Now begin the work, and may the LORD be with you!”"}],[{"type":"prose","content":"Then David ordered all the leaders of Israel to assist Solomon in this project."}],[{"type":"prose","content":"“The LORD your God is with you,” he declared. “He has given you peace with the surrounding nations. He has handed them over to me, and they are now subject to the LORD and his people."}],[{"type":"prose","content":"Now seek the LORD your God with all your heart and soul. Build the sanctuary of the LORD God so that you can bring the Ark of the LORD’s Covenant and the holy vessels of God into the Temple built to honor the LORD’s name.”"}]]