[{"header":"Instructions to Those Who Minister"},{"num":6,"verse":"All who are under the yoke as bond-servants (slaves) are to regard their own masters as worthy of honor and respect so that the name of God and the teaching [about Him] will not be spoken against. "},{"num":2,"verse":"Those who have believing masters are not to be disrespectful toward them because they are brothers [in Christ], but they should serve them even better, because those who benefit from their kindly service are believers and beloved. Teach and urge these [duties and principles]."},{"num":3,"verse":"If anyone teaches a different doctrine and does not agree with the sound words of our Lord Jesus Christ, and with the doctrine and teaching which is in agreement with godliness (personal integrity, upright behavior), "},{"num":4,"verse":"he is conceited and woefully ignorant [understanding nothing]. He has a morbid interest in controversial questions and disputes about words, which produces envy, quarrels, verbal abuse, evil suspicions, "},{"num":5,"verse":"and perpetual friction between men who are corrupted in mind and deprived of the truth, who think that godliness is a source of profit [a lucrative, money-making business—withdraw from them]. "},{"num":6,"verse":"But godliness actually is a source of great gain when accompanied by contentment [that contentment which comes from a sense of inner confidence based on the sufficiency of God]. "},{"num":7,"verse":"For we have brought nothing into the world, so [it is clear that] we cannot take anything out of it, either. "},{"num":8,"verse":"But if we have food and clothing, with these we will be content. "},{"num":9,"verse":"But those who [are not financially ethical and] crave to get rich [with a compulsive, greedy longing for wealth] fall into temptation and a trap and into many foolish and harmful desires that plunge people into ruin and destruction [leading to personal misery]. "},{"num":10,"verse":"For the love of money [that is, the greedy desire for it and the willingness to gain it unethically] is a root of all sorts of evil, and some by longing for it have wandered away from the faith and pierced themselves [through and through] with many sorrows."},{"num":11,"verse":"But as for you, O man of God, flee from these things; aim at and pursue righteousness [true goodness, moral conformity to the character of God], godliness [the fear of God], faith, love, steadfastness, and gentleness. "},{"num":12,"verse":"Fight the good fight of the faith [in the conflict with evil]; take hold of the eternal life to which you were called, and [for which] you made the good confession [of faith] in the presence of many witnesses. "},{"num":13,"verse":"I solemnly charge you in the presence of God, who gives life to all things, and [in the presence] of Christ Jesus, who made the good confession [in His testimony] before Pontius Pilate, "},{"num":14,"verse":"to keep all His precepts without stain or reproach until the appearing of our Lord Jesus Christ, "},{"num":15,"verse":"which He will bring about in His own time—He who is the blessed and only Sovereign [the absolute Ruler], the King of those who reign as kings and Lord of those who rule as lords, "},{"num":16,"verse":"He alone possesses immortality [absolute exemption from death] and lives in unapproachable light, whom no man has ever seen or can see. To Him be honor and eternal power and dominion! Amen."},{"num":17,"verse":"As for the rich in this present world, instruct them not to be conceited and arrogant, nor to set their hope on the uncertainty of riches, but on God, who richly and ceaselessly provides us with everything for our enjoyment. "},{"num":18,"verse":"Instruct them to do good, to be rich in good works, to be generous, willing to share [with others]. "},{"num":19,"verse":"In this way storing up for themselves the enduring riches of a good foundation for the future, so that they may take hold of that which is truly life."},{"num":20,"verse":"O Timothy, guard and keep safe the deposit [of godly truth] entrusted to you, turn away from worldly and godless chatter [with its profane, empty words], and the contradictions of what is falsely called “knowledge”— "},{"num":21,"verse":"which some have professed and by doing so have erred (missed the mark) and strayed from the faith."}]