[{"num":6,"verse":"All slaves who believe must give complete respect to their own masters. In this way no one will speak evil of God’s name and what we teach. "},{"num":2,"verse":"Slaves whose masters also believe should respect their masters even though their masters are also believers. As a result, believers who are slaves should serve their masters even better because those who receive the benefit of their work are believers whom they love."},{"header":"Guidelines for Living a Godly Life"},{"num":3,"verse":"Whoever teaches false doctrine and doesn’t agree with the accurate words of our Lord Jesus Christ and godly teachings "},{"num":4,"verse":"is a conceited person. He shows that he doesn’t understand anything. Rather, he has an unhealthy desire to argue and quarrel about words. This produces jealousy, rivalry, cursing, suspicion, "},{"num":5,"verse":"and conflict between people whose corrupt minds have been robbed of the truth. They think that a godly life is a way to make a profit."},{"num":6,"verse":"A godly life brings huge profits to people who are content with what they have. "},{"num":7,"verse":"We didn’t bring anything into the world, and we can’t take anything out of it. "},{"num":8,"verse":"As long as we have food and clothes, we should be satisfied."},{"num":9,"verse":"But people who want to get rich keep falling into temptation. They are trapped by many stupid and harmful desires which drown them in destruction and ruin. "},{"num":10,"verse":"Certainly, the love of money is the root of all kinds of evil. Some people who have set their hearts on getting rich have wandered away from the Christian faith and have caused themselves a lot of grief."},{"num":11,"verse":"But you, man of God, must avoid these things. Pursue what God approves of: a godly life, faith, love, endurance, and gentleness. "},{"num":12,"verse":"Fight the good fight for the Christian faith. Take hold of everlasting life to which you were called and about which you made a good testimony in front of many witnesses."},{"num":13,"verse":"In the sight of God, who gives life to everything, and in the sight of Christ Jesus, who gave a good testimony in front of Pontius Pilate, "},{"num":14,"verse":"I insist that, until our Lord Jesus Christ appears, you obey this command completely. Then you cannot be blamed for doing anything wrong. "},{"num":15,"verse":"At the right time God will make this known. God is the blessed and only ruler. He is the King of kings and Lord of lords. "},{"num":16,"verse":"He is the only one who cannot die. He lives in light that no one can come near. No one has seen him, nor can they see him. Honor and power belong to him forever! Amen."},{"num":17,"verse":"Tell those who have the riches of this world not to be arrogant and not to place their confidence in anything as uncertain as riches. Instead, they should place their confidence in God who richly provides us with everything to enjoy. "},{"num":18,"verse":"Tell them to do good, to do a lot of good things, to be generous, and to share. "},{"num":19,"verse":"By doing this they store up a treasure for themselves which is a good foundation for the future. In this way they take hold of what life really is."},{"num":20,"verse":"Timothy, guard the Good News which has been entrusted to you. Turn away from pointless discussions and the claims of false knowledge that people use to oppose ⌞the Christian faith⌟. "},{"num":21,"verse":"Although some claim to have knowledge, they have abandoned the faith."}]