[{"num":6,"verse":"All who are forced to serve as slaves should consider their masters worthy of full respect. Then people will not speak evil things against God’s name and against what we teach. "},{"num":2,"verse":"Some slaves have masters who are believers. They shouldn’t show their masters disrespect just because they are also believers. Instead, they should serve them even better. That’s because their masters are loved by them as believers. These masters are committed to caring for their slaves."},{"header":"People Who Teach Lies or Love Money"},{"num":3,"verse":"Suppose someone teaches something different than I have taught. Suppose that person doesn’t agree with the true teaching of our Lord Jesus Christ. Suppose they don’t agree with godly teaching. "},{"num":4,"verse":"Then that person is proud and doesn’t understand anything. They like to argue more than they should. They can’t agree about what words mean. All of this results in wanting what others have. It causes fighting, harmful talk, and evil distrust. "},{"num":5,"verse":"It stirs up trouble all the time among people whose minds are twisted by sin. The truth they once had has been taken away from them. They think they can get rich by being godly."},{"num":6,"verse":"You gain a lot when you live a godly life. But you must be happy with what you have. "},{"num":7,"verse":"We didn’t bring anything into the world. We can’t take anything out of it. "},{"num":8,"verse":"If we have food and clothing, we will be happy with that. "},{"num":9,"verse":"People who want to get rich are tempted. They fall into a trap. They are tripped up by wanting many foolish and harmful things. Those who live like that are dragged down by what they do. They are destroyed and die. "},{"num":10,"verse":"Love for money causes all kinds of evil. Some people want to get rich. They have wandered away from the faith. They have wounded themselves with many sorrows."},{"header":"Paul Gives a Final Command to Timothy"},{"num":11,"verse":"But you are a man of God. Run away from all these things. Try hard to do what is right and godly. Have faith, love and gentleness. Hold on to what you believe. "},{"num":12,"verse":"Fight the good fight along with all other believers. Take hold of eternal life. You were chosen for it when you openly told others what you believe. Many witnesses heard you. "},{"num":13,"verse":"God gives life to everything. Christ Jesus told the truth when he was a witness in front of Pontius Pilate. In the sight of God and Christ, I give you a command. "},{"num":14,"verse":"Obey it until our Lord Jesus Christ appears. Obey it completely. Then no one can find fault with it or you. "},{"num":15,"verse":"God will bring Jesus back at a time that pleases him. God is the blessed and only Ruler. He is the greatest King of all. He is the most powerful Lord of all. "},{"num":16,"verse":"God is the only one who can’t die. He lives in light that no one can get close to. No one has seen him. No one can see him. Honor and power belong to him forever. Amen."},{"num":17,"verse":"Command people who are rich in this world not to be proud. Tell them not to put their hope in riches. Wealth is so uncertain. Command those who are rich to put their hope in God. He richly provides us with everything to enjoy. "},{"num":18,"verse":"Command the rich to do what is good. Tell them to be rich in doing good things. They must give freely. They must be willing to share. "},{"num":19,"verse":"In this way, they will store up true riches for themselves. It will provide a firm basis for the next life. Then they will take hold of the life that really is life."},{"num":20,"verse":"Timothy, guard what God has trusted you with. Turn away from godless chatter. Stay away from opposing ideas that are falsely called knowledge. "},{"num":21,"verse":"Some people believe them. By doing that they have turned away from the faith."}]