[{"header":"Pilate’s vain efforts to save Jesus"},{"num":1,"verse":"Then Pilate took Jesus and had him flogged, and the soldiers twisted thorn-twigs into a crown and put it on his head, threw a purple robe around him and kept coming into his presence, saying, “Hail, king of the Jews!” And then they slapped him with their open hands."},{"num":4,"verse":"Then Pilate went outside again and said to them, “Look, I bring him out before you here, to show that I find nothing criminal about him at all.”"},{"num":5,"verse":"And at this Jesus came outside too, wearing the thorn crown and the purple robe. “Look,” said Pilate, “here’s the man!”"},{"num":6,"verse":"The sight of him made the chief priests and Jewish officials shout at the top of their voices, “Crucify! Crucify!” “You take him and crucify him,” retorted Pilate. “He’s no criminal as far as I can see!”"},{"num":7,"verse":"The Jews answered him, “We have a Law, and according to that Law, he must die, for he made himself out to be Son of God!”"},{"num":8,"verse":"When Pilate heard them say this, he became much more uneasy, and returned to the palace again and spoke to Jesus, “Where do you come from?”"},{"num":10,"verse":"But Jesus gave him no reply. So Pilate said to him, “Won’t you speak to me? Don’t you realise that I have the power to set you free, and I have the power to have you crucified?”"},{"num":11,"verse":"“You have no power at all against me,” replied Jesus, “except what was given to you from above. And for that reason the one who handed me over to you is even more guilty than you are.”"},{"num":12,"verse":"From that moment, Pilate tried hard to set him free but the Jews were shouting, “If you set this man free, you are no friend of Caesar! Anyone who makes himself out to be a king is anti-Caesar!”"},{"num":13,"verse":"When Pilate heard this, he led Jesus outside and sat down upon the Judgment-seat in the place called the Pavement (in Hebrew, Gabbatha). It was preparation day of the Passover and it was now getting on towards midday. Pilate said to the Jews, “Look, here’s your king!”"},{"num":15,"verse":"At which they yelled, “Take him away, take him away, crucify him!”"},{"num":15,"verse":"Am I to crucify your king? Pilate asked them. “Caesar is our king and no one else,” replied the chief priests."},{"num":16,"verse":"And at this Pilate handed Jesus over to them for crucifixion."},{"header":"The crucifixion"},{"num":16,"verse":"So they took Jesus and he went out carrying the cross himself, to a place called Skull Hill (in Hebrew, Golgotha). There they crucified him, and two others, one on either side of him with Jesus in the middle. Pilate had a placard written out and put on the cross, reading, JESUS OF NAZARETH, THE KING OF THE JEWS. This placard was read by many of the Jews because the place where Jesus was crucified was quite near Jerusalem, and it was written in Hebrew as well as in Latin and Greek. So the chief priests said to Pilate, “You should not write ‘The King of the Jews’, but ‘This man said, I am King of the Jews.’”"},{"num":22,"verse":"To which Pilate retorted, “Indeed? What I have written, I have written.”"},{"num":23,"verse":"When the soldiers had crucified Jesus, they divided his clothes between them, taking a quarter-share each. There remained his shirt, which was seamless—woven in one piece from the top to the bottom. So they said to each other, “Don’t let us tear it; let’s draw lots and see who gets it.” This happened to fulfil the scripture which says—‘They divided my garments among them, and for my clothing they cast lots’."},{"header":"Jesus provides for his mother from the cross"},{"num":25,"verse":"While the soldiers were doing this, Jesus’ mother was standing near the cross with her sister, and with them Mary, the wife of Clopas and Mary of Magdala. Jesus saw his mother and the disciple whom he loved standing by her side, and said to her, “Look, there is your son!” And then he said to the disciple, “And there is your mother!” And from that time the disciple took Mary into his own home."},{"num":28,"verse":"After this, Jesus realising that everything was now completed said (fulfilling the saying of scripture), “I am thirsty.”"},{"num":29,"verse":"There was a bowl of sour wine standing there. So they soaked a sponge in the wine, put it on a spear, and pushed it up towards his mouth. When Jesus had taken it, he cried, “It is finished!” His head fell forward, and he died."},{"header":"The body of Jesus is removed"},{"num":31,"verse":"As it was the day of preparation for the Passover, the Jews wanted to avoid the bodies being left on the crosses over the Sabbath (for that was a particularly important Sabbath), and they requested Pilate to have the men’s legs broken and the bodies removed. So the soldiers went and broke the legs of the first man and of the other who was crucified with Jesus. But when they came to him, they saw that he was already dead and they did not break his legs. But one of the soldiers pierced his side with a spear, and at once there was an outrush of blood and water. And the man who saw this is our witness: his evidence is true. (He is certain that he is speaking the truth, so that you may believe as well.) For this happened to fulfil the scripture, ‘Not one of his bones shall be broken.’"},{"num":37,"verse":"And again another scripture says—‘They shall look on him whom they pierced.’"},{"num":38,"verse":"After it was all over, Joseph (who came from Arimathaea and was a disciple of Jesus, though secretly for fear of the Jews) requested Pilate that he might take away Jesus’ body, and Pilate gave him permission. So he came and took his body down. Nicodemus also, the man who had come to him at the beginning by night, arrived bringing a mixture of myrrh and aloes, weighing about a hundred pounds. So they took his body and wound it round with linen strips with the spices, according to the Jewish custom of preparing a body for burial. In the place where he was crucified, there was a garden containing a new tomb in which nobody had yet been laid. Because it was the preparation day and because the tomb was conveniently near, they laid Jesus in this tomb."}]