[{"num":19,"verse":"Then Pilate laid open Jesus’ back with a leaded whip, "},{"num":2,"verse":"and the soldiers made a crown of thorns and placed it on his head and robed him in royal purple. "},{"num":3,"verse":"“Hail, ‘King of the Jews’!” they mocked, and struck him with their fists."},{"num":4,"verse":"Pilate went outside again and said to the Jews, “I am going to bring him out to you now, but understand clearly that I find him not guilty.”"},{"num":5,"verse":"Then Jesus came out wearing the crown of thorns and the purple robe. And Pilate said, “Behold the man!”"},{"num":6,"verse":"At sight of him the chief priests and Jewish officials began yelling, “Crucify! Crucify!”"},{"num":7,"verse":"They replied, “By our laws he ought to die because he called himself the Son of God.”"},{"num":8,"verse":"When Pilate heard this, he was more frightened than ever. "},{"num":9,"verse":"He took Jesus back into the palace again and asked him, “Where are you from?” but Jesus gave no answer."},{"num":10,"verse":"“You won’t talk to me?” Pilate demanded. “Don’t you realize that I have the power to release you or to crucify you?”"},{"num":11,"verse":"Then Jesus said, “You would have no power at all over me unless it were given to you from above. So those who brought me to you have the greater sin.”"},{"num":12,"verse":"Then Pilate tried to release him, but the Jewish leaders told him, “If you release this man, you are no friend of Caesar’s. Anyone who declares himself a king is a rebel against Caesar.”"},{"num":13,"verse":"At these words Pilate brought Jesus out to them again and sat down at the judgment bench on the stone-paved platform. "},{"num":14,"verse":"It was now about noon of the day before Passover."},{"num":15,"verse":"“Away with him,” they yelled. “Away with him—crucify him!”"},{"num":16,"verse":"Then Pilate gave Jesus to them to be crucified."},{"num":17,"verse":"So they had him at last, and he was taken out of the city, carrying his cross to the place known as “The Skull,” in Hebrew, “Golgotha.” "},{"num":18,"verse":"There they crucified him and two others with him, one on either side, with Jesus between them. "},{"num":19,"verse":"And Pilate posted a sign over him reading, “Jesus of Nazareth, the King of the Jews.” "},{"num":20,"verse":"The place where Jesus was crucified was near the city; and the signboard was written in Hebrew, Latin, and Greek, so that many people read it."},{"num":21,"verse":"Then the chief priests said to Pilate, “Change it from ‘The King of the Jews’ to ‘He said, I am King of the Jews.’”"},{"num":22,"verse":"Pilate replied, “What I have written, I have written. It stays exactly as it is.”"},{"num":23,"verse":"When the soldiers had crucified Jesus, they put his garments into four piles, one for each of them. But they said, “Let’s not tear up his robe,” for it was seamless. “Let’s throw dice to see who gets it.” This fulfilled the Scripture that says,"},{"num":25,"verse":"So that is what they did."},{"num":26,"verse":"When Jesus saw his mother standing there beside me, his close friend, he said to her, “He is your son.”"},{"num":27,"verse":"And to me he said, “She is your mother!” And from then on I took her into my home."},{"num":28,"verse":"Jesus knew that everything was now finished, and to fulfill the Scriptures said, “I’m thirsty.” "},{"num":29,"verse":"A jar of sour wine was sitting there, so a sponge was soaked in it and put on a hyssop branch and held up to his lips."},{"num":30,"verse":"When Jesus had tasted it, he said, “It is finished,” and bowed his head and dismissed his spirit."},{"num":31,"verse":"The Jewish leaders didn’t want the victims hanging there the next day, which was the Sabbath (and a very special Sabbath at that, for it was the Passover), so they asked Pilate to order the legs of the men broken to hasten death; then their bodies could be taken down. "},{"num":32,"verse":"So the soldiers came and broke the legs of the two men crucified with Jesus; "},{"num":33,"verse":"but when they came to him, they saw that he was dead already, so they didn’t break his. "},{"num":34,"verse":"However, one of the soldiers pierced his side with a spear, and blood and water flowed out. "},{"num":35,"verse":"I saw all this myself and have given an accurate report so that you also can believe. "},{"num":36,"verse":"The soldiers did this in fulfillment of the Scripture that says, “Not one of his bones shall be broken,” and, “They shall look on him whom they pierced.”"},{"num":38,"verse":"Afterwards Joseph of Arimathea, who had been a secret disciple of Jesus for fear of the Jewish leaders, boldly asked Pilate for permission to take Jesus’ body down; and Pilate told him to go ahead. So he came and took it away. "},{"num":39,"verse":"Nicodemus, the man who had come to Jesus at night, came too, bringing a hundred pounds of embalming ointment made from myrrh and aloes. "},{"num":40,"verse":"Together they wrapped Jesus’ body in a long linen cloth saturated with the spices, as is the Jewish custom of burial. "},{"num":41,"verse":"The place of crucifixion was near a grove of trees, where there was a new tomb, never used before. "},{"num":42,"verse":"And so, because of the need for haste before the Sabbath, and because the tomb was close at hand, they laid him there."}]