[{"num":19,"verse":"Pilate took Jesus and had him beaten."},{"num":2,"verse":"The soldiers made a big ring of thorns like a crown and put it on Jesus' head. They put a red gown on him."},{"num":3,"verse":"They said, `Greetings, King of the Jews!' They beat him with their hands."},{"num":4,"verse":"Then Pilate went out to the people again and said to them, `See, I bring the man before you. This is to show you that I find nothing wrong in him.'"},{"num":5,"verse":"Then Jesus came out. He had the crown of thorns on his head and had the red gown on him. Pilate said, `Here is the man!'"},{"num":6,"verse":"When the chief priests and the officers saw Jesus, they shouted, `Nail him to a cross! Nail him to a cross!' Pilate said to them, `You take him and nail him to a cross. I find nothing wrong in him.'"},{"num":7,"verse":"he leaders of the Jews answered him, `We have a law. That law says he should die, because he calls himself the Son of God.' When Pilate heard what they said, he was very much afraid."},{"num":9,"verse":"He went into the court house again and said to Jesus, `Where do you come from?' But Jesus did not answer him."},{"num":10,"verse":"Then Pilate said, `Do you not answer me? Do you not know that I have power to nail you to a cross, or to let you go free?'"},{"num":11,"verse":"Jesus said, `You would have no power over me if God did not give you power. So then, the man who gave me up to you has done something worse than you.'"},{"num":12,"verse":"After that Pilate tried to let Jesus go free. But the Jews shouted, `If you let this man free, you are not Caesar's friend! Anyone who makes himself a king is fighting against Caesar!'"},{"num":13,"verse":"When Pilate heard this, he brought Jesus out. Then Pilate sat on the bench where the judge sits. The place was called the Street of Stone. The Jews called it Gabbatha."},{"num":14,"verse":"It was about the middle of the day before the Passover Feast. Pilate said to the Jews, `See, here is your King!'"},{"num":15,"verse":"But they shouted, `Take him away! Take him away! Nail him to a cross!' Pilate said to them, `Shall I nail your King to a cross?' The chief priests answered, `Caesar is the only king we have.'"},{"num":16,"verse":"Then Pilate gave them Jesus to be nailed to a cross."},{"num":17,"verse":"They took Jesus and led him away. Jesus went out carrying his own cross. They went to a place which the Jews called Golgotha. That means `the place of the skull bone'."},{"num":18,"verse":"There they nailed Jesus to the cross. Two other people were also nailed to crosses. One was put on each side of Jesus. Jesus was put in the centre."},{"num":19,"verse":"Pilate wrote a sign and put it on the cross. He wrote, `Jesus from Nazareth, the King of the Jews.'"},{"num":20,"verse":"Many of the Jews read this sign. The place where Jesus was nailed to a cross was near the city. The sign was written in the Jewish, Greek, and Latin languages."},{"num":21,"verse":"Then the chief priests among the Jews said to Pilate, `Do not write, \"The King of the Jews,\" but write, \"This man said he is King of the Jews.\" '"},{"num":22,"verse":"Pilate answered, `What I have written I have written!'"},{"num":23,"verse":"When the soldiers had nailed Jesus to the cross, they took his clothes. They divided them into four parts and gave each soldier one part. Then they took his coat. It was not sewn together but the cloth was all made in one piece from the top to the bottom."},{"num":24,"verse":"So the soldiers said to one another, `We will not tear this. But let us gamble for it.' What the holy writings say came true. They say, `They divided my clothes among them. They gambled for my coat.' That is what the soldiers did."},{"num":25,"verse":"Near the cross of Jesus stood his mother, his mother's sister, Mary the wife of Cleophas, and Mary Magdalene."},{"num":26,"verse":"Jesus saw his mother and the disciple whom he loved standing near. He said to his mother, `Woman, see your son!'"},{"num":27,"verse":"And he said to the disciple, `See your mother!' From that time on, that disciple took her to live in his own home."},{"num":28,"verse":"Jesus now knew that everything had happened that the holy writings said. He said, `I am thirsty.'"},{"num":29,"verse":"A bowl of bad wine was there. They took something called a sponge and made it wet with the wine. Then they put it on a stick and put it to Jesus' mouth."},{"num":30,"verse":"Jesus took the wine. Then he said, `It is finished.' And he bowed his head and died."},{"num":31,"verse":"It was the day before the Sabbath day. The Jewish leaders did not want the bodies to stay on the cross on the Sabbath day because it was a big day. So they begged Pilate to break the legs of those who had been nailed to crosses. Then they could be taken away."},{"num":32,"verse":"The soldiers came and broke the legs of the one nailed to the cross on one side of Jesus. Then they broke the legs of the one on the other side of him."},{"num":33,"verse":"When they came to Jesus, they saw that he was dead already. So they did not break his legs."},{"num":34,"verse":"One of the soldiers stuck a spear into the side of Jesus' body. Right away, blood and water came out."},{"num":35,"verse":"The man who saw it told what he saw, so that you may believe. What he said is true and he knows that it is true."},{"num":36,"verse":"What the holy writings say came true. They say, `Not one of his bones shall be broken.'"},{"num":37,"verse":"They also say, `They shall look at the one into whom they stuck the spear.'"},{"num":38,"verse":"A man named Joseph, from the town of Arimathea, was a disciple of Jesus. But he did not say so because he was afraid of the leaders of the Jews. After all this had happened, he went to Pilate. He asked him to let him take Jesus' body away. Pilate let him. So he came and took his body."},{"num":39,"verse":"Nicodemus also came. He was the one who had come to Jesus at night. He brought with him a heavy bag of sweet-smelling spices called myrrh and aloes. It was mixed together."},{"num":40,"verse":"They wrapped linen cloth around the body of Jesus and put the myrrh and aloes in with the cloth. That is how Jews bury a person."},{"num":41,"verse":"There was a garden at the place where Jesus was nailed to the cross. In the garden was a new grave cut in the rock. No one had ever been laid in it."},{"num":42,"verse":"They laid Jesus' body there because it was the day before the Sabbath day, and the grave was near."}]