[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And ye shall eat old store.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "old store which hath become old. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Though they will thus multiply, there shall be abundant stores for them, which become old because it will take them so long to consume them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And bring forth the old because of the new.—Better, and remove the old on account of the new, that is, they will always have such abundant harvests that they will be obliged to remove from the barns and garners the old stock of corn, in order to make room for the new.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And bring forth the old because of the new.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and remove the old on account of the new, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that is, they will always have such abundant harvests that they will be obliged to remove from the barns and garners the old stock of corn, in order to make room for the new.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leviticus",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE OLD STORE AND THE NEWLeviticus 26:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE OLD STORE AND THE NEW",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is one of the blessings promised to obedience. No doubt it, like the other elements of that ‘prosperity’ which ‘is the blessing of the Old Testament,’ presupposes a supernatural order of things, in which material well-being was connected with moral good far more closely and certainly than we see to be the case. But the spirit and heart of the promise remain, however the form of it may have passed away. It is a picturesque way of saying that the harvest shall be more than enough for the people’s wants. All through the winter, and the spring, and the ripening summer, their granaries shall yield supplies. There will be no season of scarcity such as often occurs in countries whose communications are imperfect, just before harvest, when the last year’s crop is exhausted, and it is hard to get anything to live on till this year’s is ready. But when the new wheat comes in they will have still much of the old, and will have to ‘bring it forth’ to empty their barns, to make room for the fresh supplies which the blessing of God has sent before they were needed. The same idea of superabundant yield from the fields is given under another form in a previous verse of this chapter {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}: ‘Your threshing shall reach unto the vintage, and the vintage shall reach unto the sowing time, and ye shall eat your bread to the full’: which reminds one of the striking prophecy of Amos: ‘Behold, the days come, saith the Lord, that the plowman shall overtake the reaper, and the treader of grapes him that soweth seed.’ So rapid the growth, and so large the fruitfulness, that the gatherer shall follow close on the heels of the sower, and will not have accomplished his task before it is again time to sow. The prophet clearly has in his mind the old promise of the law, and applies it to higher matters, even to the fields white to harvest, where ‘he that soweth and he that reapeth shall rejoice together.’ In the same way we may take these words, and gather from them better promises and larger thoughts than they originally carried.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is in them a promise as to the fullness of the divine gifts, which has a far wider reach and nobler application than to the harvests and granaries of old Palestine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may take the words in that aspect, first, as containing God’s pledge that these outward gifts shall come in unbroken continuity. And have they not so come to us all, for all these long years? Has there ever been a gap left yawning? has there ever been a break in the chain of mercies and supplies? has it not rather been that ‘one post ran to meet another,’ that before one of the messengers had unladed all his budget, another’s arrival has antiquated and put aside his store? True, we are often brought very low; there may not be much in the barn but sweepings, and a few stray grains scattered over the floor. We may have but a handful of meal in the barrel, and be ready to dress it ‘that we may eat it, and die.’ But it never really comes to that. The new ever comes before the old is all eaten up; or if it be delayed even beyond that time, it comes before the hunger reaches inanition. It may be good that we should have to trust Him, even when the storehouse is empty; it may be good for us to know something of want, but that discipline comes seldom, and is never carried very far. For the most part He anticipates wants by gifts, and His good gifts overlap each other in our outward lives as slates on a roof, or scales on a fish.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We wonder at the smooth working of the machinery for feeding a great city; and how, day by day, the provisions come at the right time, and are parted out among hundreds of thousands of homes. But we seldom think of the punctual love, the perfect knowledge, the profound wisdom which cares for us all, and is always in time with its gifts. It was that quality of punctuality extended over a whole universe which seemed so wonderful to the Psalmist: ‘The eyes of all wait upon Thee, and Thou givest them their meat in due season.’ God’s machinery for distribution is perfect, and its very perfection, with the constancy of the resulting blessings, robs Him of His praise, and hinders our gratitude. By assiduity He loses admiration.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Things grown common lose their dear delight.’ ‘If in His gifts and benefits He were more sparing and close-handed,’ said Luther, ‘we should learn to be thankful.’ But let us learn it by the continuity of our joys, that we may not need to be taught it by their interruption; and let us still all tremulous anticipation of possible failure or certain loss by the happy confidence which we have a right to cherish, that His mercies will meet our needs, continuous as they are, and be strung so close together on the poor thread of our lives that no gap will be discernible in the jewelled circle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " May we not apply that same thought of the unbroken continuity of God’s gifts to the higher region of our spiritual experience? His supplies of wisdom, love, joy, peace, power, to our souls are always enough and more than enough for our wants. If ever men complain of languishing vitality in their religious emotions, or of a stinted supply of food for their truest self, it is their own fault, not His. He means that there should be no parentheses of famine in our Christian life. It is not His doing if times of torpor alternate with seasons of quick energy and joyful fullness of life. So far as He is concerned the flow is uninterrupted, and if it come to us in jets and spurts as from an intermittent well, it is because our own fault has put some obstacle to choke the channel and dam out His Spirit from our spirits. We cannot too firmly hold, or too profoundly feel, that an unbroken continuity of supplies of His grace-unbroken and bright as a sunbeam reaching in one golden shaft all the way from the sun to the earth-is His purpose concerning us. Here, in this highest region, the thought of our text is most absolutely true; for He who gives is ever pouring forth His own self for us to take, and there is no limit to our reception but our capacity and our desire; nor any reason for a moment’s break in our possession of love, righteousness, peace, but our withdrawal of our souls from beneath the Niagara of His grace. As long as we keep our poor vessels below that constant downpour they will be full. It is all our own blame if they are empty. Why should Christian people have these dismal times of deadness, these parentheses of paralysis? as if their growth must be like that of a tree with its alternations of winter sleep and summer waking? In regard to outward blessings we are, as it were, put upon rations, and ‘that He gives’ us we ‘gather.’ There He sometimes does, in love and wisdom, put us on very short allowance, and even now and then causes ‘the fields to yield no meat.’ But never is it so in the higher region. There He puts the key of the storehouse into our own hands, and we may take as much as we will, and have as much as we take. There the bread of God is given for evermore, and He wills that in uninterrupted abundance ‘the meek shall eat and be satisfied.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The source is full to overflowing, and there are no limits to the supply. The only limit is our capacity, which again is largely determined by our desire. So after all His gifts there is more yet unreceived to possess. After all His Self-revelation there is more yet unspoken to declare. Great as is the goodness which He has ‘wrought before the sons of men for them that trust in Him,’ there are far greater treasures of goodness ‘laid up’ in the deep mines of God ‘for them that fear Him.’ Bars of uncoined treasure and ingots of massy gold lie in His storehouses, to be put into circulation as soon as we need, and can use, them. Hence we have the right to look for an endless increase in our possession of God; and from the consideration of an Infinite Spirit that imparts Himself, and of finite but indefinitely expansible spirits that receive, the certainty arises of an endless life for us of growing glory; a heaven of ceaseless advance, where in constant alternation desire shall widen capacity, and capacity increase fruition, and fruition lead in, not satiety, but quickened appetite and deeper longing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we may also see in this text the prescription of a duty as well as the announcement of a promise. There is direction here as to our manner of receiving God’s gifts, as well as large assurance as to His manner of bestowing them. It is His to substitute the new for the old. It is ours gladly to accept the exchange, a task not always easy or pleasant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " No doubt there is a natural love of change deep in us all, but that is held in check by its opposite, and all poetry and human life itself are full of the sadness born of mutation. Our Lord laid bare a deep tendency, when He said, ‘No man having tasted old wine, straightway desireth new; because he saith the old is better.’ We cling to what is familiar, in the very furniture of our houses; and yet we are ever being forced to accept what is strange and new, and, like some fresh article in a room, is out of harmony with the well-worn things that we have seen standing in their corners for years. It takes some time for the raw look to wear off, and for us to ‘get used to it,’ as we say. So is it, though often for deeper reasons, in far more important things. A man, for instance, has been engaged in some kind of business for years, and at last God shows him, by clear indications, that he must turn to something else. How slow he is to see it, how reluctant to do it! How he cleaves to the ‘old store’ ! How he shrinks from clearing out the barn, to bring in the new! Or a household has been going on for many days unbroken, and at last a time comes when some of its members have to pass out into new circumstances; a son to push his way in the world, a daughter to brighten another fireside. It is hard for the parents to enter fully into the high hopes of their children, and to accept the new condition, without many vain longings for the old days that can never come back any more. So, all through our lives, wisdom and faith say, ‘Bring forth the old because of the new.’ Accept cheerfully the law of constant change under which God’s love has set us. Do not let the pleasant bonds of habit tie down your hearts so tightly to the familiar possessions that you shrink from the introduction of fresh elements. Be sure that the new comes from the same loving hand which sent the old in its season, and that change is meant to be progress. Do not confine yourselves within any mill-horse round of associations and occupations. Front the vicissitudes of life, not merely with brave patience, but with happy confidence, for they all come from Him whose love is older than your oldest blessings, and whose mercies, new every morning, express themselves afresh through every change. Welcome the new, treasure the old, and in both see the purpose of that loving Father who, Himself unchanged, changeth all things, and",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘. . .fulfils Himself in many ways,Lest one good custom should corrupt the world.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘. . .fulfils Himself in many ways,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Lest one good custom should corrupt the world.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In higher matters than these our text may give us counsel as to our duty. ‘God hath more light yet to break forth from His holy word.’ We are bound to welcome new truth, so soon as to our apprehensions it has made good its title, and not to refuse it lodgment in our minds because it needs the displacement of their old contents. In the regions of our knowledge and of our Christian life, most chiefly, are we under solemn obligations to ‘bring forth the old store because of the new’; if we would not be unfaithful to God’s great educational process that goes on through all our lives. It is often difficult to adjust the relations of our last lesson with our previous possessions. There is always a temptation to make too much of a new truth, and to fancy that it will produce more change in our whole mental furniture than it really will do. No man is less likely to come to the knowledge of the truth than he who is always deep in love with some new thought, ‘the Cynthia of the minute,’ and ever ready to barter ‘old lamps for new ones.’ But all these things admitted, still it remains true that we are here to learn, that our education is to go on all our days, and that here on earth it can only be carried out by our parting with the old store, which may have become musty by long lying in the granaries, to make room for the new, just gathered in the ripened field. The great central truths of God in Christ are to be kept for ever; but we shall come to grasp them in their fullness only by joyfully welcoming every fresh access of clearer light which falls upon them; and gladly laying aside our inadequate thoughts of God’s permanent revelation of Himself in Jesus Christ, to house and garner in heart and spirit the fuller knowledge which it may please Him to impart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the law for life is thankful enjoyment of the old store, and openness of mind and freedom of heart which permit its unreluctant surrender when newer harvests ripen. And the highest form of the promise of our text will be when we pass into another world, and its rich abundance is poured out into our laps. Blessed are they who can willingly put away the familiar blessings of earth, and stretch out, willingly emptied, expectant hands to meet the ‘new store’ of Heaven!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:1-13 This chapter contains a general enforcement of all the laws given by Moses; by promises of reward in case of obedience, on the one hand; and threatenings of punishment for disobedience, on the other. While Israel maintained a national regard to God's worship, sabbaths, and sanctuary, and did not turn aside to idolatry, the Lord engaged to continue to them temporal mercies and religious advantages. These great and precious promises, though they relate chiefly to the life which now is, were typical of the spiritual blessings made sure by the covenant of grace to all believers, through Christ. 1. Plenty and abundance of the fruits of the earth. Every good and perfect gift must be expected from above, from the Father of lights. 2. Peace under the Divine protection. Those dwell in safety, that dwell in God. 3. Victory and success in their wars. It is all one with the Lord to save by many or by few. 4. The increase of their people. The gospel church shall be fruitful. 5. The favour of God, which is the fountain of all Good. 6. Tokens of his presence in and by his ordinances. The way to have God's ordinances fixed among us, is to cleave closely to them. 7. The grace of the covenant. All covenant blessings are summed up in the covenant relation, I will be your God, and ye shall be my people; and they are all grounded upon their redemption. Having purchased them, God would own them, and never cast them off till they cast him off.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bring forth the old because of the new - Rather, clear away the old before the new; that is, in order to make room for the latter. Compare the margin reference.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. ye shall eat old store—Their stock of old corn would be still unexhausted and large when the next harvest brought a new supply.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Bring forth the old, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cast out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", throw them away, as having no occasion to spend them, or give them to the poor, or even to your cattle, that you may make way for the new corn, which also is so plentiful, that of itself will fill up your barns. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And ye shall eat old store,.... What is very old, corn of three years old, as Jarchi and Kimchi (m) interpret it; such plenty should they have that it would be so long consuming: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and bring forth the old because of the new; out of their barns and granaries, to make room for the new, which they should have great quantities of, and scarce know where to bestow them; and therefore should empty their treasures and garners of the old, and fill them with new; or they should bring them forth out of their barns into their houses, to make use of themselves, or into their markets to expose to sale, being under no temptation to withhold against a time of scarcity in order to make more of it, see Proverbs 11:26; now all these temporal blessings promised may be emblems of spiritual things, and might be so understood by such who were spiritually enlightened; as of the rain of divine grace, and the blessings of it, and of the doctrines of the Gospel, sometimes compared thereunto, Deuteronomy 32:2; and of great fruitfulness in grace and good works, and of internal peace in the minds of good men, and of their safety and security from spiritual enemies; of fulness of spiritual provisions, even of things new and old, and which are laid up for them, Sol 7:13; thus promises of a spiritual nature more manifestly follow. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and bring forth the old because of the new; out of their barns and granaries, to make room for the new, which they should have great quantities of, and scarce know where to bestow them; and therefore should empty their treasures and garners of the old, and fill them with new; or they should bring them forth out of their barns into their houses, to make use of themselves, or into their markets to expose to sale, being under no temptation to withhold against a time of scarcity in order to make more of it, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; now all these temporal blessings promised may be emblems of spiritual things, and might be so understood by such who were spiritually enlightened; as of the rain of divine grace, and the blessings of it, and of the doctrines of the Gospel, sometimes compared thereunto, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and of great fruitfulness in grace and good works, and of internal peace in the minds of good men, and of their safety and security from spiritual enemies; of fulness of spiritual provisions, even of things new and old, and which are laid up for them, Sol 7:13; thus promises of a spiritual nature more manifestly follow. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Sepher Shorash. rad.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Sepher Shorash. rad.  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And ye shall eat old store, and bring forth the old because of the new.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because of the new",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] better as mg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from before the new",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is that the yield shall be so great that what has been gathered in an earlier year must be carried out of the storehouses or barns to make way for the fresh produce.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye shall eat old store, and bring forth the old because of the new.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The provisions of the past year would be so abundant that they would have to be removed to make place for the new stores. Leviticus 26:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Notwithstanding their numerous increase, they would suffer no want of food. \"Ye shall eat that which has become old, and bring out old for new.\" Multiplicabo vos et multiplicabo simul annonam vestram, adeo ut illam prae multitudine et copia absumere non possitis, sed illam diutissime servare adeoque abjicere cogamini, novarum frugum suavitate et copia superveniente (C. a Lap.). הוציא vetustum triticum ex horreo et vinum ex cella promere (Calvin). ",
        "children": []
      }
    ]
  }
]