[{"header":"Woe to the Complacent"},{"num":6,"verse":"Alas for those being at ease in Zion, and those who feel secure on Mount Samaria, the notables of the best of the nations! The house of Israel resorts to them. "},{"num":2,"verse":"Cross over to Calneh and see, and go from there to Hamath Rabbah and go down to Gath of the Philistines. Are you better than these kingdoms, or is their territory greater than your territory? "},{"num":3,"verse":"You that put off the day of disaster and bring near a reign of violence! "},{"num":4,"verse":"Alas for those who lie on beds of ivory and lounge on their couches, and those eating young rams from the sheep and goats, and bull-calves from the middle of the animal stall. "},{"num":5,"verse":"Alas for those who sing to the tune of the harp; like David they improvise on instruments of music. "},{"num":6,"verse":"Alas for those who drink from sprinkling bowls of wine and anoint themselves with the best of olive oils and are not grieved over the ruin of Joseph. "},{"num":7,"verse":"Therefore, they shall now go into exile at the head of the exiles and the feast of lounging shall pass away."},{"header":"Yahweh Abhors Israel’s Pride"},{"num":8,"verse":"My Lord Yahweh has sworn by himself, declares Yahweh, the God of hosts: “I abhor the pride of Jacob and I hate his citadel fortresses and I will deliver the city and its fullness!” "},{"num":9,"verse":"And then if ten people remain in one house, they too will die. "},{"num":10,"verse":"And if one’s relative, who burns the body, lifts it up and brings the body out of the house and he will say to someone in the innermost part of the house, “Are there any more with you?” and he will say, “None,” then he will say, “Silence,” because we must not invoke the name of Yahweh. "},{"num":11,"verse":"Look, Yahweh is going to command and the great house will be destroyed to bits and the little house to pieces. "},{"num":12,"verse":"Do horses run on rocks, or does one plow the sea with oxen? But you have turned justice into poison and the fruit of righteousness into wormwood! "},{"num":13,"verse":"You who rejoice over Lo-Debar, who say, “Have we not taken Karnaim for ourselves by our strength?” "},{"num":14,"verse":"Indeed, I am going to raise up against you a nation, O house of Israel, declares Yahweh, the God of hosts. And they shall oppress you from Lebo-hamath up to the wadi of the Arabah."}]