[{"header":"Remember the Lord’s Provisions"},{"num":8,"verse":"“Be careful to observe every command that I’m instructing you today, in order that you may live, increase, and enter and take possession of the land that the Lord promised by an oath to your ancestors. "},{"num":2,"verse":"Remember how the Lord your God led you all the way these 40 years in the desert to humble and test you in order to make known what was in your heart—whether or not you would keep his commands. "},{"num":3,"verse":"He humbled you, causing you to be hungry, yet he fed you with manna that neither you nor your ancestors had known, in order to teach you that human beings are not to live by food alone—instead human beings are to live by every word that proceeds from the mouth of the Lord."},{"num":4,"verse":"“The clothes you wore did not wear out, nor did your feet blister during these 40 years. "},{"num":5,"verse":"Be convinced in your heart that as a father disciplines his son, so the Lord your God disciplines you. "},{"num":6,"verse":"Observe the commands of the Lord your God by walking in his ways and by fearing him, "},{"num":7,"verse":"because the Lord your God is bringing you to a good land—a land with rivers and deep springs flowing to the valleys and hills. "},{"num":8,"verse":"It’s a land filled with wheat, barley, vines, fig trees, and pomegranates. It’s a land filled with olive oil and honey— "},{"num":9,"verse":"a land without scarcity. You’ll eat food in it and lack nothing. It’s a land where its rocks are iron and you can dig copper from its mountains.”"},{"header":"Remember the Source of Blessings"},{"num":10,"verse":"“When you have eaten and are satisfied, bless the Lord your God for the good land that he has given you. "},{"num":11,"verse":"Be careful! Otherwise, you will forget the Lord your God by failing to keep his commands, ordinances, and statutes that I’m commanding you this day. "},{"num":12,"verse":"Otherwise, when you eat and are satisfied, when you have built beautiful houses and lived in them, "},{"num":13,"verse":"when your cattle and oxen have multiplied, and when your silver and gold have increased, "},{"num":14,"verse":"then you will become arrogant. You’ll neglect the Lord your God, "},{"num":15,"verse":"who brought you out of the land of Egypt—from the house of slavery—and who led you through the vast and dangerous desert—that parched land without water—with its poisonous snakes and scorpions. He brought water out of solid rock for you "},{"num":16,"verse":"and fed you in the desert with manna that neither you nor your ancestors had known to humble and test you so that things may go well with you later. "},{"num":17,"verse":"You may say to yourselves, ‘I have become wealthy by my own strength and by my own ability.’ "},{"num":18,"verse":"But remember the Lord your God, because he is the one who gives you the ability to produce wealth, in order to confirm his covenant that he promised by an oath to your ancestors, as is the case today. "},{"num":19,"verse":"If you neglect the Lord your God, follow other gods, and serve and worship them, I testify to you today that you will certainly be destroyed. "},{"num":20,"verse":"Just like the nations whom the Lord destroyed before you, so will you be destroyed, because you did not listen to the voice of the Lord your God.”"}]