[{"header":"The Promised Land to Be Taken"},{"num":8,"verse":"“Be careful to do all that I am telling you today. Then you will live and have many children, and go in to own the land the Lord promised to give to your fathers. "},{"num":2,"verse":"You will remember all the way the Lord your God led you in the desert these forty years, so you would not have pride, and how He tested you to know what was in your heart to see if you would obey His Laws or not. "},{"num":3,"verse":"He let you be hungry which helped you to not have pride. Then He fed you with bread from heaven which you and your fathers had not known. He did this to make you understand that man does not live by bread alone. But man lives by everything that comes out of the mouth of the Lord. "},{"num":4,"verse":"Your clothes did not wear out, and your feet did not get sore during these forty years. "},{"num":5,"verse":"So know in your heart that the Lord your God was punishing you just as a man punishes his son. "},{"num":6,"verse":"Keep the Laws of the Lord your God. Walk in His ways, and fear Him. "},{"num":7,"verse":"For the Lord your God is bringing you into a good land, a land of rivers and wells of water, flowing into valleys from hills. "},{"num":8,"verse":"It is a land of grains, vines, fig trees, fruit, olive oil and honey. "},{"num":9,"verse":"It is a land where you will have enough food to eat and not have to do without, a land where stones are iron. And you can make brass from what you dig out of its hills. "},{"num":10,"verse":"When you have eaten and are filled, you will honor and thank the Lord your God for the good land He has given you."},{"num":11,"verse":"“Be careful not to forget the Lord your God by not keeping all His Laws which I am telling you today. "},{"num":12,"verse":"When you have eaten and are filled, and have built good houses to live in, "},{"num":13,"verse":"and when your cattle and flocks become many, and you get much silver and gold, and have many things for your own, "},{"num":14,"verse":"be careful not to become proud. Do not forget the Lord your God Who brought you out of the land of Egypt, out of the house where you were servants. "},{"num":15,"verse":"He led you through the big desert that brought fear with its poisonous snakes and scorpions and thirsty ground where there was no water. He brought you water out of hard rock. "},{"num":16,"verse":"In the desert He fed you bread from heaven, which your fathers did not know about. He did this so you would not have pride and that He might test you. It was for your good in the end. "},{"num":17,"verse":"Be careful not to say in your heart, ‘My power and strong hand have made me rich.’ "},{"num":18,"verse":"But remember the Lord your God. For it is He Who is giving you power to become rich. By this He may keep His agreement which He promised to your fathers, as it is this day. "},{"num":19,"verse":"If you ever forget the Lord your God and go to other gods to worship and work for them, I tell you today that you will be destroyed for sure. "},{"num":20,"verse":"You will be destroyed like the nations the Lord destroys before you, because you would not listen to the voice of the Lord your God."}]