[{"header":"The Genealogy of Jesus the Messiah"},{"num":1,"verse":"The record of the genealogy of Jesus the Messiah, the son of David, the son of Abraham:"},{"num":2,"verse":"Abraham fathered Isaac, Isaac fathered Jacob, and Jacob fathered Judah and his brothers."},{"num":3,"verse":"Judah fathered Perez and Zerah by Tamar, Perez fathered Hezron, and Hezron fathered Ram."},{"num":4,"verse":"Ram fathered Amminadab, Amminadab fathered Nahshon, and Nahshon fathered Salmon."},{"num":5,"verse":"Salmon fathered Boaz by Rahab, Boaz fathered Obed by Ruth, and Obed fathered Jesse."},{"num":6,"verse":"Jesse fathered David the king."},{"num":7,"verse":"Solomon fathered Rehoboam, Rehoboam fathered Abijah, and Abijah fathered Asa."},{"num":8,"verse":"Asa fathered Jehoshaphat, Jehoshaphat fathered Joram, and Joram fathered Uzziah."},{"num":9,"verse":"Uzziah fathered Jotham, Jotham fathered Ahaz, and Ahaz fathered Hezekiah."},{"num":10,"verse":"Hezekiah fathered Manasseh, Manasseh fathered Amon, and Amon fathered Josiah."},{"num":11,"verse":"Josiah fathered Jeconiah and his brothers, at the time of the deportation to Babylon."},{"num":12,"verse":"After the deportation to Babylon: Jeconiah fathered Shealtiel, and Shealtiel fathered Zerubbabel."},{"num":13,"verse":"Zerubbabel fathered Abihud, Abihud fathered Eliakim, and Eliakim fathered Azor."},{"num":14,"verse":"Azor fathered Zadok, Zadok fathered Achim, and Achim fathered Eliud."},{"num":15,"verse":"Eliud fathered Eleazar, Eleazar fathered Matthan, and Matthan fathered Jacob."},{"num":16,"verse":"Jacob fathered Joseph the husband of Mary, by whom Jesus was born, who is called the Messiah."},{"num":17,"verse":"So all the generations from Abraham to David are fourteen generations; from David to the deportation to Babylon, fourteen generations; and from the deportation to Babylon to the Messiah, fourteen generations."},{"header":"Conception and Birth of Jesus"},{"num":18,"verse":"Now the birth of Jesus the Messiah was as follows: when His mother Mary had been betrothed to Joseph, before they came together she was found to be pregnant by the Holy Spirit."},{"num":19,"verse":"And her husband Joseph, since he was a righteous man and did not want to disgrace her, planned to send her away secretly."},{"num":20,"verse":"But when he had thought this over, behold, an angel of the Lord appeared to him in a dream, saying, “Joseph, son of David, do not be afraid to take Mary as your wife; for the Child who has been conceived in her is of the Holy Spirit."},{"num":21,"verse":"She will give birth to a Son; and you shall name Him Jesus, for He will save His people from their sins.”"},{"num":22,"verse":"Now all this took place so that what was spoken by the Lord through the prophet would be fulfilled:"},{"num":23,"verse":"“Behold, the virgin will conceive and give birth to a Son, and they shall name Him Immanuel,” which translated means, “God with us.”"},{"num":24,"verse":"And Joseph awoke from his sleep and did as the angel of the Lord commanded him, and took Mary as his wife,"},{"num":25,"verse":"but kept her a virgin until she gave birth to a Son; and he named Him Jesus."}]