[{"num":2,"verse":"He who dashes in pieces [that is, the king of Medo-Babylon] is come up before your face [Nineveh]. Keep the fortress and ramparts manned, watch the road, gird your loins, collect and fortify all your strength and power mightily."},{"num":2,"verse":"For the Lord restores the excellency of Jacob as the excellency of [ancient] Israel, for plunderers have plundered them and emptied them out and [outrageously] destroyed their vine branches."},{"num":3,"verse":"The shields of the mighty men [of Media and Babylon] are [dyed] red; the valiant men are [clothed] in dyed scarlet. The chariots blaze with fire of steel on the day of his preparation [for battle], and the officers’ horses prance like a cypress forest [reeling in the wind]."},{"num":4,"verse":"The chariots rage in confusion in the streets; they run to and fro [in wild terror] in the broad ways. They flash with steel [making them appear like torches]; they rush [in various directions] like forked lightnings."},{"num":5,"verse":"[The Assyrian leader] remembers and summons his bravest men; they stumble in their march. They hasten to the city’s wall, and their movable defense shelter is prepared and set up."},{"num":6,"verse":"The gates or dams of the rivers [surrounding and guarding Nineveh] are opened and the [imperial] palace [of sun-dried brick] is dissolved [by the torrents] and is in dismay."},{"num":7,"verse":"It is decreed. She [Nineveh] is stripped and removed, and her maids are lamenting and moaning like doves [softly for fear], beating upon their breasts [and hearts]."},{"num":8,"verse":"And Nineveh, like a standing pool are her waters and [her inhabitants] are fleeing away! Stand! Stand [firm! a few cry], but no one looks back or causes them to return."},{"num":9,"verse":"Take the spoil of silver; take the spoil of gold! For there is no end of the treasure, the glory and wealth of all the precious furnishings."},{"num":10,"verse":"Emptiness! Desolation! Utter waste! Hearts faint and knees smite together, and anguish is in all loins, and the faces of all grow pale!"},{"num":11,"verse":"Where is the den of the lions which was the feeding place of the young lions, where the lion and the lioness walked, and the lion’s whelp, and none made them afraid?"},{"num":12,"verse":"The lion tore in pieces enough for his whelps and strangled [prey] for his lionesses; he filled his caves with prey and his dens with what he had seized and carried off."},{"num":13,"verse":"Behold, I am against you [Nineveh], says the Lord of hosts, and I will burn your chariots in the smoke, and the sword shall devour your young lions. And I will cut off your prey from the earth, and the voice of your messengers shall no more be heard."}]