[{"num":2,"verse":"He that dasheth in pieces is come up against thee: keep the fortress, watch the way, make thy loins strong, fortify thy power mightily. "},{"num":2,"verse":"For Jehovah restoreth the excellency of Jacob, as the excellency of Israel; for the emptiers have emptied them out, and destroyed their vine-branches. "},{"num":3,"verse":"The shield of his mighty men is made red, the valiant men are in scarlet: the chariots flash with steel in the day of his preparation, and the cypress spears are brandished. "},{"num":4,"verse":"The chariots rage in the streets; they rush to and fro in the broad ways: the appearance of them is like torches; they run like the lightnings. "},{"num":5,"verse":"He remembereth his nobles: they stumble in their march; they make haste to the wall thereof, and the mantelet is prepared. "},{"num":6,"verse":"The gates of the rivers are opened, and the palace is dissolved. "},{"num":7,"verse":"And it is decreed: she is uncovered, she is carried away; and her handmaids moan as with the voice of doves, beating upon their breasts."},{"num":8,"verse":"But Nineveh hath been from of old like a pool of water: yet they flee away. Stand, stand, they cry; but none looketh back. "},{"num":9,"verse":"Take ye the spoil of silver, take the spoil of gold; for there is no end of the store, the glory of all goodly furniture. "},{"num":10,"verse":"She is empty, and void, and waste; and the heart melteth, and the knees smite together, and anguish is in all loins, and the faces of them all are waxed pale. "},{"num":11,"verse":"Where is the den of the lions, and the feeding-place of the young lions, where the lion and the lioness walked, the lion’s whelp, and none made them afraid? "},{"num":12,"verse":"The lion did tear in pieces enough for his whelps, and strangled for his lionesses, and filled his caves with prey, and his dens with ravin. "},{"num":13,"verse":"Behold, I am against thee, saith Jehovah of hosts, and I will burn her chariots in the smoke, and the sword shall devour thy young lions; and I will cut off thy prey from the earth, and the voice of thy messengers shall no more be heard."}]