[{"num":2,"verse":"He describeth the victories of the Chaldeans against the Assyrians."},{"num":1,"verse":"The destroyer is come before thy face: keep the munition: look to the way: make thy loins strong: increase thy strength mightily."},{"num":2,"verse":"For the Lord hath turned away the glory of Jacob, as the glory of Israel: for the emptiers have emptied them out, and marred their vine branches."},{"num":3,"verse":"The shield of his mighty men is made red, the valiant men are in scarlet: the chariots shall be as in the fire and flames in the day of his preparation, and the fir trees shall tremble."},{"num":4,"verse":"The chariots shall rage in the streets: they shall run to and fro in the highways: they shall seem like lamps: they shall shoot like the lightning."},{"num":5,"verse":"He shall remember his strong men: they shall stumble as they go: they shall make haste to the walls thereof, and the defense shall be prepared."},{"num":6,"verse":"The gates of the rivers shall be opened, and the palace shall melt."},{"num":7,"verse":"And Huzzab the Queen shall be led away captive, and her maids shall lead her as with the voice of doves, smiting upon their breasts."},{"num":8,"verse":"But Nineveh is of old like a pool of water: yet they shall flee away. Stand, stand, shall they cry: but none shall look back."},{"num":9,"verse":"Spoil ye the silver, spoil the gold: for there is none end of the store and glory of all the pleasant vessels."},{"num":10,"verse":"She is empty and void and waste, and the heart melteth, and the knees smite together, and sorrow is in all loins, and the faces of them all gather blackness."},{"num":11,"verse":"Where is the dwelling of the lions, and the pasture of the lion’s whelps? where the lion and the lioness waked, and the lion’s whelp, and none made them afraid."},{"num":12,"verse":"The lion did tear in pieces enough for his whelps, and worried for his lioness, and filled his holes with prey, and his dens with spoil."},{"num":13,"verse":"Behold, I come unto thee saith the Lord of hosts, and I will burn her chariots in the smoke, and the sword shall devour thy young lions, and I will cut off thy spoil from the earth, and the voice of thy messengers shall no more be heard."}]