[{"num":3,"verse":"Some time later King Achashverosh began to single out Haman the son of Hamdata the Agagi for advancement; eventually he gave him precedence over all his fellow officers. "},{"num":2,"verse":"All the king’s servants at the King’s Gate would kneel and bow down before Haman, because the king had so ordered. But Mordekhai would neither kneel nor bow down to him. "},{"num":3,"verse":"The king’s servants at the King’s Gate asked Mordekhai, “Why don’t you obey the king’s order?” "},{"num":4,"verse":"But after they had confronted him a number of times without his paying attention to them, they told Haman, in order to find out whether Mordekhai’s explanation that he was a Jew would suffice to justify his behavior. "},{"num":5,"verse":"Haman was furious when he saw that Mordekhai was not kneeling and bowing down to him. "},{"num":6,"verse":"However, on learning what people Mordekhai belonged to, it seemed to him a waste to lay hands on Mordekhai alone. Rather, he decided to destroy all of Mordekhai’s people, the Jews, throughout the whole of Achashverosh’s kingdom."},{"num":7,"verse":"In the first month, the month of Nisan, in the twelfth year of Achashverosh, they began throwing pur (that is, they cast lots) before Haman every day and every month until the twelfth month, which is the month of Adar. "},{"num":8,"verse":"Then Haman said to Achashverosh, “There is a particular people scattered and dispersed among the peoples in all the provinces of your kingdom. Their laws are different from those of every other people; moreover, they don’t observe the king’s laws. It doesn’t befit the king to tolerate them. "},{"num":9,"verse":"If it please the king, have a decree written for their destruction; and I will hand over 330 tons of silver to the officials in charge of the king’s affairs to deposit in the royal treasury.”"},{"num":10,"verse":"The king took his signet ring from his hand and gave it to Haman the son of Hamdata the Agagi, the enemy of the Jews. "},{"num":11,"verse":"The king said to Haman, “The money is given to you, and the people too, to do with as seems good to you.”"},{"num":12,"verse":"The king’s secretaries were summoned on the thirteenth day of the first month. They wrote down all Haman’s orders to the king’s army commanders and governors in all the provinces and to the officials of every people, to each province in its own script and to each people in their own language; everything was written in the name of King Achashverosh and sealed with the king’s signet ring. "},{"num":13,"verse":"Letters were sent by courier to all the royal provinces “to destroy, kill and exterminate all Jews, from young to old, including small children and women, on a specific day, the thirteenth day of the twelfth month, the month of Adar, and to seize their goods as plunder.” "},{"num":14,"verse":"A copy of the document to be issued as a decree in every province was to be publicly proclaimed to all the peoples, so that they would be ready for that day. "},{"num":15,"verse":"At the king’s order the runners went out quickly, and the decree was issued in Shushan the capital. Then the king and Haman sat down for a drink together, but the city of Shushan was thrown into confusion."}]