[{"header":"Haman Plots to Destroy the Jews"},{"num":3,"verse":"After these things King Ahasuerus praised Haman the son of Hammedatha the Agagite, and promoted him, and set his seat above all the officials who were with him. "},{"num":2,"verse":"All the king’s servants, when they were at the king’s gate, bowed or paid homage to Haman since the king had commanded it. Mordecai, however, never bowed or paid homage."},{"num":3,"verse":"So the king’s servants tending the king’s gate said to Mordecai, “Why are you transgressing the king’s commandment?” "},{"num":4,"verse":"Though they spoke to him daily, he never listened to them, so they reported it to Haman to see if the words of Mordecai would stand, for Mordecai had told them that he was a Jew."},{"num":5,"verse":"When Haman saw that Mordecai neither bowed nor paid him homage, he was filled with rage. "},{"num":6,"verse":"But he disdained to lay hands on only Mordecai, since they had told him of the people of Mordecai. So Haman sought to destroy all the Jews throughout the whole kingdom of Ahasuerus."},{"num":7,"verse":"In the first month, which is the month Nisan, in the twelfth year of King Ahasuerus, they cast Pur (that is, cast lots) before Haman daily, and each month, until the twelfth month, which is the month Adar, to determine the time."},{"num":8,"verse":"Then Haman said to King Ahasuerus, “There exists a scattered people dispersed among the other peoples in all the provinces of your kingdom. Their laws are different from all others, and they are not complying with the king’s laws, so there may not be a suitable reason for the king to allow them to exist. "},{"num":9,"verse":"If it pleases the king, may it be written that they are to be destroyed, and may there be ten thousand talents of silver deposited into the king’s treasuries so that I may distribute it to the hands of those doing the work.”"},{"num":10,"verse":"The king took his signet ring from his hand and gave it to Haman, the son of Hammedatha the Agagite, the enemy of the Jews. "},{"num":11,"verse":"The king said to Haman, “The silver has been granted to you, as have the people, so do with each as it pleases you.”"},{"num":12,"verse":"Then the king’s scribes were summoned on the thirteenth day of the first month, and a decree was written just as Haman had commanded to the king’s satraps and to the governors over each province and to the officials of all peoples and to every province according to its own script, and to every people in their language. It was written in the name of King Ahasuerus and sealed with the king’s signet ring. "},{"num":13,"verse":"The letters were sent by mounted couriers into all the king’s provinces to cause the destruction, slaughter, and annihilation of all Jews, both young and old, little children and women, in one day, the thirteenth day of the twelfth month, which is the month Adar, and even to plunder their possessions. "},{"num":14,"verse":"A copy of the document, issued as law in every province, was proclaimed, calling for all people to be ready for the day."},{"num":15,"verse":"The couriers went out, being hastened by the king’s command. At the citadel of Susa, when the decree was issued, the king and Haman sat down to drink, but the city of Susa was in uproar."}]