[{"num":1,"verse":"I am Malachi. And this is the message that the Lord gave me for Israel."},{"header":"The Lord’s Love for Israel"},{"num":2,"verse":"Israel, I, the Lord, have loved you. And yet you ask in what way have I loved you. Don’t forget that Esau was the brother of your ancestor Jacob, but I chose Jacob "},{"num":3,"verse":"instead of Esau. And I turned Esau’s hill country into a barren desert where jackals roam. "},{"num":4,"verse":"Esau’s descendants may say, “Although our nation Edom is in ruins, we will rebuild.”"},{"num":5,"verse":"Israel, when you see this, you will shout, “The Lord’s great reputation reaches beyond our borders.”"},{"header":"Judgment against Priests"},{"num":6,"verse":"I, the Lord All-Powerful, have something to say to you priests. Children respect their fathers, and servants respect their masters. I am your father and your master, so why don’t you respect me? You priests have insulted me, and now you ask, “How did we insult you?”"},{"num":7,"verse":"You embarrass me by offering worthless food on my altar. Then you ask, “How have we embarrassed you?” You have done it by saying, “What’s so great about the Lord’s altar?”"},{"num":8,"verse":"But isn’t it wrong to offer animals that are blind, crippled, or sick? Just try giving those animals to your governor. That certainly wouldn’t please him or make him want to help you. "},{"num":9,"verse":"I am the Lord God All-Powerful, and you had better try to please me. You have sinned. Now see if I will have mercy on any of you."},{"num":10,"verse":"I wish someone would lock the doors of my temple, so you would stop wasting time building fires on my altar. I am not pleased with you priests, and I refuse to accept any more of your offerings. "},{"num":11,"verse":"From dawn until dusk my name is praised by every nation on this earth, as they burn incense and offer the proper sacrifices to me. "},{"num":12,"verse":"But even you priests insult me by saying, “There’s nothing special about the Lord’s altar, and these sacrifices are worthless.”"},{"num":13,"verse":"You get so disgusted that you even make vulgar signs at me. And for an offering, you bring stolen animals or those that are crippled or sick. Should I accept these? "},{"num":14,"verse":"Instead of offering the acceptable animals you have promised, you bring me those that are unhealthy. I will punish you for this, because I am the great King, the Lord All-Powerful, and I am worshiped by nations everywhere."}]