[{"header":"Jesus Appoints Twelve Apostles(A)"},{"num":10,"verse":"Then Jesus called his twelve disciples to him and gave them authority over unclean spirits, so that they could drive them out and heal every disease and every illness. "},{"num":2,"verse":"These are the names of the twelve apostles: first, Simon (who is called Peter) and his brother Andrew; James, the son of Zebedee, and his brother John; "},{"num":3,"verse":"Philip and Bartholomew; Thomas and Matthew the tax collector; James, the son of Alphaeus, and Thaddaeus; "},{"num":4,"verse":"Simon the Cananaean and Judas Iscariot, who later betrayed Jesus."},{"header":"Jesus Sends Out the Twelve Disciples(B)"},{"num":5,"verse":"These were the Twelve whom Jesus sent out after he had given them these instructions: “Don’t turn on to the road that leads to the unbelievers, and don’t enter Samaritan towns. "},{"num":6,"verse":"Instead, go to the lost sheep of the nation of Israel. "},{"num":7,"verse":"As you go, make this announcement: ‘The kingdom from heaven is near!’ "},{"num":8,"verse":"Heal the sick, raise the dead, cleanse lepers, drive out demons."},{"num":9,"verse":"Don’t take any gold, silver, or copper in your moneybags, "},{"num":10,"verse":"or a traveling bag for the trip, or an extra shirt, or sandals, or a walking stick, because a worker deserves his food."},{"num":11,"verse":"“Whatever town or village you enter, find out who is receptive in it and stay there until you leave. "},{"num":12,"verse":"As you enter the house, greet its occupants. "},{"num":13,"verse":"If the household is receptive, let your blessing of peace come on it. But if it isn’t receptive, let your blessing of peace return to you. "},{"num":14,"verse":"If no one welcomes you or listens to your words, as you leave that house or town, shake its dust off your feet. "},{"num":15,"verse":"I tell all of you with certainty, it will be more bearable for the region of Sodom and Gomorrah on the day of judgment than for that town!”"},{"header":"Future Persecutions(C)"},{"num":16,"verse":"“Pay attention, now! I am sending you out like sheep among wolves. So be as cunning as serpents and as innocent as doves. "},{"num":17,"verse":"Watch out for people who will hand you over to the local councils and whip you in their synagogues. "},{"num":18,"verse":"You will be brought before governors and kings because of me, to testify to them and to unbelievers. "},{"num":19,"verse":"When they hand you over, don’t worry about how you are to speak or what you are to say, because in that hour what you are to say will be given to you. "},{"num":20,"verse":"It won’t be you speaking, but the Spirit of your Father speaking through you."},{"num":21,"verse":"“Brother will hand brother over for execution, and a father his child. Children will rebel against parents and have them put to death. "},{"num":22,"verse":"You will be hated by everyone because of my name. But the person who endures to the end will be saved. "},{"num":23,"verse":"So when they persecute you in one town, flee to the next, because I tell all of you with certainty that you will not have gone through the towns of Israel before the Son of Man comes."},{"num":24,"verse":"“A disciple is not above his teacher, and a slave is not above his master. "},{"num":25,"verse":"It is enough for a disciple to be like his teacher and a slave to be like his master. If they have called the head of the house Beelzebul, how much more will they do the same to those of his household!”"},{"header":"Fear God(D)"},{"num":26,"verse":"“So never be afraid of them, because there is nothing hidden that will not be revealed, and nothing secret that will not be made known. "},{"num":27,"verse":"What I tell you in darkness you must speak in the daylight, and what is whispered in your ear you must shout from the housetops. "},{"num":28,"verse":"Stop being afraid of those who kill the body but can’t kill the soul. Instead, be afraid of the one who can destroy both body and soul in hell."},{"num":29,"verse":"“Two sparrows are sold for a penny, aren’t they? Yet not one of them will fall to the ground without your Father’s permission. "},{"num":30,"verse":"Indeed, even the hairs on your head have all been counted! "},{"num":31,"verse":"So stop being afraid. You are worth more than a bunch of sparrows.”"},{"header":"Acknowledging the Messiah(E)"},{"num":32,"verse":"“Therefore, everyone who acknowledges me before people I, too, will acknowledge before my Father in heaven. "},{"num":33,"verse":"But whoever denies me before people I, too, will deny before my Father in heaven.”"},{"header":"Not Peace, but Division(F)"},{"num":34,"verse":"“Do not think that I came to bring peace on earth. I did not come to bring peace but a sword! "},{"num":35,"verse":"I came to turn"},{"header":"The Cost of Discipleship(G)"},{"num":37,"verse":"“The one who loves his father or mother more than me isn’t worthy of me, and the one who loves a son or daughter more than me isn’t worthy of me. "},{"num":38,"verse":"The one who doesn’t take up his cross and follow me isn’t worthy of me. "},{"num":39,"verse":"The one who finds his life will lose it, and the one who loses his life because of me will find it.”"},{"header":"Rewards(H)"},{"num":40,"verse":"“The one who receives you receives me, and the one who receives me receives the one who sent me. "},{"num":41,"verse":"The one who receives a prophet as a prophet will receive a prophet’s reward, and the one who receives a righteous person as a righteous person will receive a righteous person’s reward. "},{"num":42,"verse":"I tell all of you with certainty, whoever gives even a cup of cold water to one of these little ones because he is a disciple will never lose his reward.”"}]