[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(42) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Forty years.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The reign of Solomon was thus of the same length as that of his father. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The coincidence is curious; but the accurate historical character of the whole narrative forbids the idea that the numbers given are merely round numbers, signifying long duration. Josephus gives eighty years—either by error in his Hebrew text, or perhaps by confusing together the duration of the two reigns.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "NOTE.—The insertion in the LXX. version, found in the Vatican MS. after 1Kings 12:24, runs as follows :—",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "NOTE.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The insertion in the LXX. version, found in the Vatican MS. after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 12:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", runs as follows :—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“And there was a man of Mount Ephraim, a servant of Solomon, and his name was Jeroboam; and his mother’s name was Sarira, a woman who was a harlot. And Solomon made him taskmaster [literally, “master of the staff,” or “scourge”] over the burdens [forced labours] of the house of Joseph; and he built for Solomon Sarira, which is in Mount Ephraim; and he had three hundred chariots. He it was who built the citadel [the “Millo”], by the labours of the house of Ephraim, and completed the fortification of the city of David. And he was exalting himself to seek the kingdom. And Solomon sought to put him to death; so he feared, and stole away to Sousakim [Shishak], king of Egypt, and was with him till the death of Solomon. And Jeroboam heard in Egypt that Solomon was dead, and he spake in the ears of Sousakim, king of Egypt, saying, Send me away, and I will go back to my own land. And Sousakim said to him, Ask of me a request, and I will give it thee. And he gave to Jeroboam Ano, the elder sister of his own wife Thekemina [Tahpenes] to be his wife. She was great among the daughters of the king, and bare to Jeroboam Abias [Abijah] his son. And Jeroboam said to Sousakim, Send me really away, and I will go back. And Jeroboam went forth from Egypt, and came to the land of Sarira, in Mount Ephraim, and there gathered together to him the whole strength of Ephraim. And Jeroboam built there a fortress.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Then follows, with variations of detail, the story of the sickness of Abijah, the visit of Jeroboam’s wife to Ahijah, and the message of judgment; corresponding to 1Kings 14:1-18. The narrative then continues thus:—",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then follows, with variations of detail, the story of the sickness of Abijah, the visit of Jeroboam’s wife to Ahijah, and the message of judgment; corresponding to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 14:1-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The narrative then continues thus:—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“ And Jeroboam went his way to Shechem, in Mount Ephraim, and gathered together there the tribes of Israel; and Rehoboam, the son of Solomon, went up there. And the word of the Lord came to Shemaiah, the Enlamite, saying. Take to thyself a new garment, which has never been in water, and tear it in ten pieces; and thou shalt give them to Jeroboam, and shalt say to him, Take thee ten pieces, to clothe thyself therewith. And Jeroboam took them; and Shemaiah said, These things saith the Lord, signifying the ten tribes of Israel.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The whole concludes with an account, given with some characteristic variations, of the remonstrance with Rehoboam, the rebellion, and the prohibition by Shemaiah of the intended attack of Rehoboam, corresponding to 1Kings 12:1-24.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The whole concludes with an account, given with some characteristic variations, of the remonstrance with Rehoboam, the rebellion, and the prohibition by Shemaiah of the intended attack of Rehoboam, corresponding to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 12:1-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This half-independent version of the history is interesting, but obviously far inferior in authority to the Hebrew text. The incidents fit less naturally into each other; the warning of Ahijah as to the destruction of the house of Jeroboam is obviously out of place; and by the ascription to Shemaiah of the prophecy of Jeroboam’s royalty, the striking coincidence of the authorship of the two predictions of prosperity and disaster is lost. The record of Shishak’s intercourse with Jeroboam is apparently imitated from the history of Hadad at the court of the earlier Pharaoh; and the circumstances of Jeroboam’s assumption of royal pretensions are improbable. Josephus, moreover, ignores this version of the story altogether; nor is it found in any other version. Its origin is unknown, and its growth curious enough. But it does not seem to throw much fresh light on the history.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 11:42-43",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 11:42-43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The time that Solomon reigned — was forty years — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His reign was as long as his father’s, but not his life: sin shortened his days. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Solomon slept with his fathers — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This expression is promiscuously used concerning good and bad, and signifies only, that they died as their fathers did. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And was buried in the city of David his father — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus concludes the history of this great man; without any the least mention of his repentance, or of his bringing forth any of the proper fruits of repentance, such as pulling down the high places he had built for the worship of idols, and abandoning his idolatrous wives and concubines. Many Jews and Christians, however, think it extremely probable that he was awakened to a sense of his sin and misery by means of the message which God sent him, as recorded ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that he humbled himself before him, and became a true penitent from that time. They even judge that this is put out of dispute by the book of Ecclesiastes, written after his fall, as, they say, is evident, not only from the unanimous testimony of the Hebrew writers, but also from the whole strain of that book, which was manifestly composed long after he had finished all his works, and after he had liberally drunk of all sorts of sensual pleasures, and sadly experienced the bitter effects of the love of women. Now in this book he appears greatly to lament his own folly and madness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 7:25-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and warns others to take heed of the like evil courses, and to fear God and keep his commandments, in consideration of the judgment to come, chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They think it probable, therefore, that as David wrote Psalms 51., so Solomon wrote this book, as a public testimony and profession of his repentance. On the other hand, many are of opinion, that the silence of the divine historian on this subject is an insuperable objection to all this, and that if he had truly repented, so considerable a circumstance of his life would not have been omitted, and that we should, at least, have been informed of his abolishing all the monuments of his idolatry, and those of his wives and concubines. Perhaps, as Dr. Dodd observes, “this is one of those questions which will for ever be a field of controversy, as we have no certain guide from the Scripture to direct us.” We may, however, safely conclude, that if Solomon did repent, yet as the sacred writer has not recorded that he did, but suffered the important circumstance to remain doubtful, he intended to leave a blot upon his memory, that all posterity might have before their eyes an awful example of human weakness, even in a man of the greatest endowments; and might learn thereby to watch and pray lest they should enter into temptation; and to beware of the beginnings and infatuations of vice, since even Solomon was not secure against its delusions; and, once unhappily immersed in it, perhaps, was never disengaged from it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:41-43 Solomon's reign was as long as his father's, but his life was not so. Sin shortened his days. If the world, with all its advantages, could satisfy the soul, and afford real joy, Solomon would have found it so. But he was disappointed in all, and to warn us, has left this record of all earthly enjoyments, Vanity and vexation of spirit. The New Testament declares that one greater than Solomon is come to reign over us, and to possess the throne of his father David. May we not see something of Christ's excellency faintly represented to us in this figure?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Josephus gave Solomon a reign of 80 years, either because he wished to increase the glory of his country's greatest king, or through his having a false reading in his copy of the Septuagint Version. It is, no doubt, remarkable that the three successive kings, Saul, David, and Solomon, should have each reigned forty years ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but such numerical coincidences occur from time to time in exact history. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40. Shishak—He harbored and encouraged the rebellious refugee, and was of a different dynasty from the father-in-law of Solomon.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the time that Solomon reigned in Jerusalem, over all Israel, was forty years. The same says Eupolemus (z), an Heathen writer, who makes him to live but fifty two years; which is the common tradition of the Jews, who suppose he was but twelve years of age when he began to reign; which is to be confuted from the age of his son Rehoboam, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Josephus (a), on the other hand, makes him to live to too great an age, who says that he reigned eighty years, and lived to ninety four. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Apud Euseb. Praepar. Evangel. l. 9. c. 34. (a) Antiqu. l. 8. c. 7. sect. 8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Apud Euseb. Praepar. Evangel. l. 9. c. 34. (a) Antiqu. l. 8. c. 7. sect. 8. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the time that Solomon reigned in Jerusalem over all Israel was forty years.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forty years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same length of reign as that of Saul and David. If Solomon’s accession were 1015 b.c., his death took place in 975 b. c. Josephus gives ‘eighty years’ as the length of the reign. But this agrees with no other record, and must be regarded as a mistake. King Solomon was not more than 60 years old, if so much, when he died.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 42.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] that ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Solomon reigned in Jerusalem over all Israel was forty years.",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Solomon reigned in Jerusalem over all Israel was forty years.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " [Josephus, here as elsewhere, doubles the figure, making his reign to have lasted ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "eighty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " years. It is somewhat remarkable, but affords no just ground for suspicion, that each of the first three kings of Israel should have reigned just forty years. \"Such numerical coincidences occur in exact history. Saosduchinus, Chiniladanus, and Nabopolassar, three consecutive kings of Babylon, reigned each twenty-one years\" (Rawlinson).] 1 Kings 11:42",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Conclusion of the history of Solomon. - Notice of the original works, in which further information can be found concerning his acts and his wisdom (see the Introduction); the length of his reign, viz., forty years; his death, burial, and successor. Solomon did not live to a very great age, since he was not more than twenty years old when he ascended the throne. -  Whether Solomon turned to the Lord again with all his heart, a question widely discussed by the older commentators (see Pfeifferi Dubia vex. p. 435; Buddei hist. eccl. ii. p. 273ff.), cannot be ascertained from the Scriptures. If the Preacher Koheleth) is traceable to Solomon so far as the leading thoughts are concerned, we should find in this fact an evidence of his conversion, or at least a proof that at the close of his life Solomon discovered the vanity of all earthly possessions and aims, and declared the fear of God to be the only abiding good, with which a man can stand before the judgment of God. ",
        "children": []
      }
    ]
  }
]