[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 The earth is called upon, with all that are therein, to hear the prophet. God's holy temple will not protect false professors. Neither men of high degree, as the mountains, nor men of low degree, as the valleys, can secure themselves or the land from the judgments of God. If sin be found in God's people he will not spare them; and their sins are most provoking to him, for they are most reproaching. When we feel the smart of sin, it behoves us to seek what is the sin we smart for. Persons and places most exalted, are most exposed to spiritual diseases. The vices of leaders and rulers shall be surely and sorely punished. The punishment answers the sin. What they gave to idols, never shall prosper, nor do them any good. What is got by one lust, is wasted on another.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For, behold, the Lord comth forth - that is, (as we now say,) \"is coming forth.\" Each day of judgment, and the last also, are ever drawing nigh, noiselessly as the nightfall, but unceasingly. \"Out of His Place.\" Dionysius: \"God is hidden from us, except when He sheweth Himself by His Wisdom or Power of Justice or Grace, as Isaiah saith, 'Verily, Thou art a God who hidest Thyself' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".\" He seemeth to be absent, when He doth not visibly work either in the heart within, or in judgments without; to the ungodly and unbelieving He is absent, \"far above out of their sight\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", when He does not avenge their scoffs, their sins, their irreverence. Again He seemeth to go forth, when His Power is felt. Dionysius: \"Whence it is said, 'Bow Thy heavens, O Lord, and come down' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the Lord saith of Sodom, 'I will go down now and see, whether they have done altogether according to the cry of it, which is come unto Me' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, the Place of the Infinite God is God Himself. For the Infinite sustaineth Itself, nor doth anything out of Itself contain It. God dwelleth also in light unapproachable ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When then Almighty God doth not manifest Himself, He abideth, as it were, in 'His own Place.' When He manifests His Power or Wisdom or Justice by their effects, He is said 'to go forth out of His Place,' that is, out of His hiddenness. Again, since the Nature of God is Goodness, it is proper and co-natural to Him, to be propitious, have mercy and spare. In this way, the Place of God is His mercy. When then He passeth from the sweetness of pity to the rigor of equity, and, on account of our sins, sheweth Himself severe (which is, as it were, alien from Him) He goeth forth out of His Place.\" Jerome: \"For He who is gentle and gracious, and whose Nature it is to have mercy, is constrained, on your account, to take the seeming of hardness, which is not His.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He comes invisibly now, in that it is He who punisheth, through whatever power or will of man He useth; He shews forth His Holiness through the punishment of unholiness. But the words, which are image-language now, shall be most exactly fulfilled in the end, when, in the Person of our Lord, He shall come visibly to judge the world. Jerome, Theoph.: \"In the Day of Judgment, Christ 'shall come down,' according to that Nature which He took, 'from His Place,' the highest heavens, and shall cast down the proud things of this world.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And will come down - Not by change of place, or in Himself, but as felt in the punishment of sin; and tread upon the high places of the earth; to bring down the pride of those (see Amos 4:13; Job 9:8) who  \"being lifted up in their own conceit and lofty, sinning through pride and proud through sin, were yet created out of earth. For why is earth and ashes proud?\" (Ecclesiasticus 10:9). What seems mightiest and most firm, is unto God less than is to man the dust under his feet. The high places were also the special scenes of an unceasing idolatry. \"God treadeth in the good and humble, in that He dwelleth, walketh, feasteth in their hearts 2 Corinthians 6:16; Revelation 3:20. But He treadeth upon the proud and the evil, in that He casteth them down, despiseth, condemneth them.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And will come down - Not by change of place, or in Himself, but as felt in the punishment of sin; and tread upon the high places of the earth; to bring down the pride of those (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 4:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") who  \"being lifted up in their own conceit and lofty, sinning through pride and proud through sin, were yet created out of earth. For why is earth and ashes proud?\" (Ecclesiasticus 10:9). What seems mightiest and most firm, is unto God less than is to man the dust under his feet. The high places were also the special scenes of an unceasing idolatry. \"God treadeth in the good and humble, in that He dwelleth, walketh, feasteth in their hearts ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But He treadeth upon the proud and the evil, in that He casteth them down, despiseth, condemneth them.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. tread upon the high places of the earth—He shall destroy the fortified heights (compare De 32:13; 33:29) [Grotius].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For, behold; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is great reason for my earnestness with all people, and therefore once more I advise you to consider it well. Behold, attend to what is said. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord cometh forth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who is Judge himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 50:1,4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 50:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whose holy majesty you have provoked to displeasure, who is a jealous God, and hath an almighty power to dash his enemies into pieces. He cometh forth as a judge prepared to hear, determine, and punish. Now when God, who is in all places at all times, is said to come forth, it is not to be meant of his leaving a place where he was, to come to a place where before he was not; but it is to be understood of his discovering his presence by some effects of it, which before in that place were not, discovered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out of his place; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " heaven, the place of his glorious throne. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Come down; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " show by the effects of his power, justice, and wisdom that he is more eminently present there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Tread upon; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " trample under foot, stain, abase, and break. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The high places of the earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all that is high, excellent, and matter of your glorying, whether the flourishing state of your kingdoms, or the power of your kings, or strength of your fortresses, temples, and altars, or cities and palaces. In that day the haughtiness of man shall be laid low, and the pride of man shall be brought down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 2:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Your sins will procure this to you, O Samaria and Jerusalem, of which God is my witness I have plainly told you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For, behold, the Lord cometh out of his place,.... Out of heaven, the place of the house of his Shechinah or Majesty, as the Targum; where his throne is prepared; where he keeps his court, and displays his glory; from whence he removes, not by local motion, since he is everywhere; but by some manifest exertion of his power, either on the behalf of his people, or in taking vengeance on his and their enemies; or on them sinning against him, in which sense it is probably to be understood. It signifies not change of place, but of his dispensations; going out of his former customary method into another; removing, as Jarchi has it, from the throne of mercies to the throne of judgment; doing not acts of mercy, in which he delights, but exercising judgment, his strange work. So the Cabalistic writers (q) observe on the passage, that ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"it cannot be understood of place properly taken, according to Isaiah 40:12; for God is the place of the world, not the world his place; hence our wise men so expound the text, he cometh forth out of the measure of mercy, and goes into the measure of justice;'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"it cannot be understood of place properly taken, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for God is the place of the world, not the world his place; hence our wise men so expound the text, he cometh forth out of the measure of mercy, and goes into the measure of justice;'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "or property of it. Some understand this of his leaving the temple at Jerusalem, and giving it up into the hands of the Chaldeans; but the former sense is best: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and will come down, and tread upon the high places of the earth; which are his footstool; Samaria and Jerusalem, built on mountains, and all other high towers and fortified places, together with men of high looks and haughty countenances, who exalt themselves like mountains, and swell with pride: these the Lord can easily subdue and humble, bring low and tread down like the mire of the street; perhaps there may be an allusion to the high places where idols were worshipped; and which were the cause of the Lord's wrath and vengeance, and of his coming forth, in this unusual way, in his providences. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Kabala Denudata, par. 1. p. 408. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) Kabala Denudata, par. 1. p. 408. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For, behold, the LORD cometh forth out of his place, and will come {c} down, and tread upon the high places of the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For, behold, the LORD cometh forth out of his place, and will come ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " down, and tread upon the high places of the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Meaning by this that God will come to judgment against the strong cities and strongholds.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cometh forth out of his place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Two persons may use the same expressions in very different senses. Heathen poets imagined that divine beings ‘came forth’ and mingled in the strife of mortals; the prophets adopt the same language as the symbol of the working of a spiritual Deity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Here follows a grand description, in figurative language, of the course of Divine judgment, and of God's awful majesty and resistless power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Out of his place.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is as though the sins of Israel had roused him to action. God is hidden except when he displays his power in judgment and mercy (see note on Zechariah 14:3). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will come down.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " An anthropomorphic expression, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The high places.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As though descending from heaven, God first came upon the tops of the mountains (see note on Amos 4:13; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The phrase would imply God's absolute sovereignty over the universe. Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The heading in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has been explained in the introduction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:2-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " form the introduction to the prophet's address. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Hear, all ye nations: observe, O earth, and that which fills it: and let the Lord Jehovah be a witness against you, the Lord out of His holy palace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For, behold, Jehovah cometh forth from His place, and cometh down, and marcheth over the high places of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the mountains will melt under Him, and the valleys split, like wax before the fire, like water poured out upon a slope.\" The introductory words, \"Hear, ye nations all,\" are taken by Micah from his earlier namesake the son of Imlah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As the latter, in his attack upon the false prophets, called all nations as witnesses to confirm the truth of his prophecy, so does Micah the Morashite commence his prophetic testimony with the same appeal, so as to announce his labours at the very outset as a continuation of the activity of his predecessor who had been so zealous for the Lord. As the son of Imlah had to contend against the false prophets as seducers of the nation, so has also the Morashtite (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and as the former had to announce to both kingdoms the judgment that would come upon them on account of their sins, so has also the latter; and he does it by frequently referring to the prophecy of the elder Micah, not only by designating the false prophets as those who walk after the rūăch and lie, sheqer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which recals to mind the rūăch sheqer of the prophets of Ahab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:22-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but also in his use of the figures of the horn of iron in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (compare the horns of iron of the false prophet Zedekiah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and of the smiting upon the cheek in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ‛Ammı̄m kullâm does not mean all the tribes of Israel; still less does it mean warlike nations. ‛Ammı̄m never has the second meaning, and the first it has only in the primitive language of the Pentateuch. But here both these meanings are precluded by the parallel ארץ וּמלאהּ; for this expression invariably signifies the whole earth, with that which fills it, except in such a case as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where 'erets is restricted to the land of Israel by the preceding hâ'ârets, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is so restricted by the suffix 'artsâh. The appeal to the earth and its fulness is similar to the appeals to the heaven and the earth in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All nations, yea the whole earth, and all creatures upon it, are to hear, because the judgment which the prophet has to announce to Israel affects the whole earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the judgment upon Israel being connected with the judgment upon all nations, or forming a portion of that judgment. In the second clause of the verse, \"the Lord Jehovah be witness against you,\" it is doubtful who is addressed in the expression \"against you.\" The words cannot well be addressed to all nations and to the earth, because the Lord only rises up as a witness against the man who has despised His word and transgressed His commandments. For being a witness is not equivalent to witnessing or giving testimony by words, - say, for example, by the admonitory and corrective address of the prophet which follows, as C. B. Michaelis supposes, - but refers to the practical testimony given by the Lord in the judgment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff), as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now, although the Lord is described as the Judge of the world in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., He only comes to execute judgment upon Israel. Consequently we must refer the words \"to you\" to Israel, or rather to the capitals Samaria and Jerusalem mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the suffix simply refers to the Nineveh mentioned in the heading, to which there has been no further allusion in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:2-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This view is also favoured by the fact that Micah summons all nations to hear his word, in the same sense as his earlier namesake in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What the prophet announces in word, the Lord will confirm by deed, - namely, by executing the predicted judgment, - and indeed \"the Lord out of His holy temple,\" i.e., the heaven where He is enthroned (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the Lord will rise up from thence, and striding over the high places of the earth, i.e., as unbounded Ruler of the world (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), will come down in fire, so that the mountains melt before Him, that is to say, as Judge of the world. The description of this theophany is founded upon the idea of a terrible storm and earthquake, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The mountains melt (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with the streams of water, which discharge themselves from heaven (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the valleys split with the deep channels cut out by the torrents of water. The similes, \"like wax,\" etc. (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and \"like water,\" etc., are intended to express the complete dissolution of mountains and valleys. The actual facts answering to this description are the destructive influences exerted upon nature by great national judgments. ",
        "children": []
      }
    ]
  }
]