[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Samaria as an heap of the field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Samaria was to be reduced to what it had been before the days of Ahab; the palatial city of the kings of the northern kingdom should return to the normal condition of a vineyard, which it had before Shemer sold it to Omri. The fruitfulness of its vines suggests one cause of its ruin. “Woe to the crown of pride, to the drunkards of Ephraim, whose glorious beauty is a fading flower, which are on the head of the fat valleys of them that are overcome with wine” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 1:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore I will make Samaria as a heap — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A heap of ruins. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And as plantings of a vineyard — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As in planting vineyards men dig the earth, and cast it up in hillocks, so shall they make this city. The Vulgate reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make Samaria as a heap of stones in a field, when a vineyard is planted. I will pour down the stones thereof, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The stones of it shall be tumbled down, from the lofty eminence on which it is situated, into the valley beneath, and shall leave the foundations thereof naked and bare. All this, and what follows, was fulfilled by Shalmaneser, who made a conquest of Samaria. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all the graven images thereof — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whether made of gold, silver, brass, wood, or stone; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be beaten to pieces — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Shall be pulled out of their chapels, shrines, or repositories, by their conquering enemies, and shall be trampled upon and broken, either out of contempt, or that the rich materials of which they are made may be carried away. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all the hires thereof shall be burned with fire — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The rich gifts, given for the honour and service of the idols by the deceived idolaters, shall be consumed. This seems to be spoken of the gifts sent to their temple by the Assyrians, whose worship they imitated. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For she gathered it of the hire of a harlot, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — She got it by the gifts of idolaters, and it shall return to those idolaters again.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 The earth is called upon, with all that are therein, to hear the prophet. God's holy temple will not protect false professors. Neither men of high degree, as the mountains, nor men of low degree, as the valleys, can secure themselves or the land from the judgments of God. If sin be found in God's people he will not spare them; and their sins are most provoking to him, for they are most reproaching. When we feel the smart of sin, it behoves us to seek what is the sin we smart for. Persons and places most exalted, are most exposed to spiritual diseases. The vices of leaders and rulers shall be surely and sorely punished. The punishment answers the sin. What they gave to idols, never shall prosper, nor do them any good. What is got by one lust, is wasted on another.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore - (literally, \"And\") I will make Samaria as an heap of the field, and as plantings of a vineyard Jerome: \"The order of the sin was the order or the punishment.\" Samaria's sins were the earliest, the most obstinate, the most unbroken, bound up with its being as a state. On it then God's judgments should first fall. It was a crown of pride ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", resting on the head of the rich valleys, out of which it rose. Its soil is still rich . \"The whole is now cultivated in terraces\" , \"to the summits\" . Probably, since the sides of hills, open to the sun, were chosen for vineyards, it had been a vineyard, before Shemer sold it to Omri ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What it had been, that it was again to be. Its inhabitants cast forth, its houses and gorgeous palaces were to become heaps of stones, gathered out ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to make way for cultivation, or to become the fences of the vegetation, which should succeed to man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is scarce a sadder natural sight than the fragments of human habitation, tokens of man's labor or his luxury, amid the rich beauty of nature when man himself is gone. For they are tracks of sin and punishment, man's rebellion and God's judgment, man's unworthiness of the good natural gifts of God. A century or two ago, travelers  \"speak of the ground (the site of Samaria) as strewed with masses of ruins.\" Now these too are gone. : \"The stones of the temples and palaces of Samaria have been carefully removed from the rich soil, thrown together in heaps, built up in the rude walls of terraces, and rolled down into the valley below.\" : \"About midway of the ascent, the hill is surrounded by a narrow terrace of woodland like a belt. Higher up too are the marks of slighter terraces, once occupied perhaps by the streets of the ancient city.\" Terrace-cultivation has succeeded to the terraced streets once thronged by the busy, luxurious, sinful, population.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I will pour down the stones thereof into the valley - Of which it was the crest, and which it now proudly surveyed. God Himself would cause it to be poured down (he uses the word which he had just used of the vehemence of the cataract Micah 1:4). : \"The whole face of this part of the hill suggests the idea that the, buildings of the ancient city had been thrown down from the brow of the hill. Ascending to the top, we went round the whole summit, and found marks of the same process everywhere.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will pour down the stones thereof into the valley - Of which it was the crest, and which it now proudly surveyed. God Himself would cause it to be poured down (he uses the word which he had just used of the vehemence of the cataract ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). : \"The whole face of this part of the hill suggests the idea that the, buildings of the ancient city had been thrown down from the brow of the hill. Ascending to the top, we went round the whole summit, and found marks of the same process everywhere.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And I will discover the foundations thereof - The desolation is entire; not one stone left upon another. Yet the very words of threatening contain hope. It was to be not a heap only, but the plantings of a vineyard. The heaps betoken ruin; the vineyard, fruitfulness cared for by God. Destroyed, as what it was, and turned upside down, as a vineyard by the share, it should become again what God made it and willed it to be. It should again become a rich valley, but in outward desolation. Its splendid palaces, its idol temples, its houses of joy, should be but heaps and ruins, which are cleared away out of a vineyard, as only choking it. It was built in rebellion and schism, loose and not held together, like a heap of stones, having no cement of love, rent and torn in itself, having been torn both from God and His worship. It could be remade only by being wholly unmade. Then should they who believed be branches grafted in Him who said, \"I am the Vine, ye are the branches\" John 15:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will discover the foundations thereof - The desolation is entire; not one stone left upon another. Yet the very words of threatening contain hope. It was to be not a heap only, but the plantings of a vineyard. The heaps betoken ruin; the vineyard, fruitfulness cared for by God. Destroyed, as what it was, and turned upside down, as a vineyard by the share, it should become again what God made it and willed it to be. It should again become a rich valley, but in outward desolation. Its splendid palaces, its idol temples, its houses of joy, should be but heaps and ruins, which are cleared away out of a vineyard, as only choking it. It was built in rebellion and schism, loose and not held together, like a heap of stones, having no cement of love, rent and torn in itself, having been torn both from God and His worship. It could be remade only by being wholly unmade. Then should they who believed be branches grafted in Him who said, \"I am the Vine, ye are the branches\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 15:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. Samaria's punishment is mentioned first, as it was to fall before Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as an heap of the field—(Mic 3:12). Such a heap of stones and rubbish as is gathered out of fields, to clear them (Ho 12:11). Palestine is of a soil abounding in stones, which are gathered out before the vines are planted (Isa 5:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as plantings of a vineyard—as a place where vines are planted. Vineyards were cultivated on the sides of hills exposed to the sun. The hill on which Samaria was built by Omri, had been, doubtless, planted with vines originally; now it is to be reduced again to its original state (1Ki 16:24).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "pour down—dash down the stones of the city into the valley beneath. A graphic picture of the present appearance of the ruins, which is as though \"the buildings of the ancient city had been thrown down from the brow of the hill\" [Scottish Mission of Inquiry, pp. 293,294].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "discover the foundations—destroy it so utterly as to lay bare its foundations (Eze 13:14). Samaria was destroyed by Shalmaneser.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for these sins of Samaria, and the kingdom of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will make; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not by an immediate hand from heaven, but by the Assyrians under the conduct of Shalmaneser, they shall do it as my servants, saith the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Samaria as a heap of the field; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " much like ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 25:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; that beautiful city shall be made, and so left, as a ruinous heap in the field. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And as plantings of a vineyard:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in planting vineyards, they did dig up the earth, and cast it up in hillocks, cast out all the stones; so shall they make this city. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will pour down the stones thereof into the valley:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the city was built on a high hill, and a deep valley beneath it; now when it was sacked by the Assyrians, they pulled down the buildings, and cast the stones thereof into that valley; so God did by them throw down the stones of Samaria. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And I will discover the foundations thereof; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " raze the walls, fortresses, and public buildings of this city to the very foundations of it, nor leave one stone upon another, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 24:2 Luke 19:44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " desolation upon Samaria for her sin such a desolation as shall not leave the least footsteps of Samaria in the place where once it stood. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore I will make Samaria as an heap of the field, and as plantings of a vineyard,.... As a field ploughed, and laid in heaps; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or as stones gathered out of a field, and out of a vineyard planted, and laid in a heap; so should this city become a heap of stones and rubbish, being utterly demolished; and this being done according to the will of God, and through his instigation of Shalmaneser king of Assyria to it, and by his providence succeeding his army that besieged it, is said to be done by him. With this agrees the Vulgate Latin version, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I will make Samaria as a heap of stones in a field, when a vineyard is planted;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "see Isaiah 5:2; for the city, being destroyed, cannot be compared to the plants of a vineyard set in good order, beautiful and thriving; but, as to heaps of stones in a field, so to such in a vineyard; or to hillocks raised up there for the plants of vines; and if the comparison is to plants themselves, it must be to withered ones, that are good for nothing. The note of similitude as is not in the text; and the words may be read without it, \"I will make Samaria an heap of the field, plantings of a vineyard\" (t); that is, it shall be ploughed up, and made a heap of; turned into a field, and vines planted on it; for which its situation was very proper, being on a hill where vines used to be planted, and so should no more be inhabited as a city: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for the city, being destroyed, cannot be compared to the plants of a vineyard set in good order, beautiful and thriving; but, as to heaps of stones in a field, so to such in a vineyard; or to hillocks raised up there for the plants of vines; and if the comparison is to plants themselves, it must be to withered ones, that are good for nothing. The note of similitude as is not in the text; and the words may be read without it, \"I will make Samaria an heap of the field, plantings of a vineyard\" (t); that is, it shall be ploughed up, and made a heap of; turned into a field, and vines planted on it; for which its situation was very proper, being on a hill where vines used to be planted, and so should no more be inhabited as a city: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will pour down the stones thereof into the valley; the stones of the buildings and walls of the city, which, being on a hill, when pulled down, rolled into the valley; and with as much swiftness and force as waters run down a steep place, as in Micah 1:4; where the same word is used as here: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will pour down the stones thereof into the valley; the stones of the buildings and walls of the city, which, being on a hill, when pulled down, rolled into the valley; and with as much swiftness and force as waters run down a steep place, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where the same word is used as here: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will discover the foundations thereof; which should be fused up, and left bare; not one stone should be upon another; so that there should be no traces and footsteps of the city remaining, and it should be difficult to know the place where it stood. This is expressive of the total desolation and utter destruction of it: this was not accomplished by Shalmaneser when he took it; for though he carried captive the inhabitants thereof, he put others in their room; but this was entirely fulfilled, not by Jonathan Maccabeus, though he is said (u) to besiege it, and level it with the ground; but by John Hyrcanus; and the account of the destruction of it by him, as given by Josephus (w), exactly answers to this prophecy, and, to Hosea 13:16; where its desolation is also predicted; he says that Hyrcanus, having besieged it a year, took it; and, not content with this only, he utterly destroyed it, making brooks to run through it; and by digging it up, so that it fell into holes and caverns, insomuch that there were no signs nor traces of the city left. It was indeed afterwards rebuilt by Gabinius the Roman proconsul of Syria, and restored by Augustus Caesar to Herod, who adorned and fortified it, and called it by the name of Sebaste, in honour of Augustus (x); though Benjamin of Tudela pretends that Ahab's palace might be discerned there in his time, or the place known where it was, which is not likely; excepting this, his account is probable. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will discover the foundations thereof; which should be fused up, and left bare; not one stone should be upon another; so that there should be no traces and footsteps of the city remaining, and it should be difficult to know the place where it stood. This is expressive of the total desolation and utter destruction of it: this was not accomplished by Shalmaneser when he took it; for though he carried captive the inhabitants thereof, he put others in their room; but this was entirely fulfilled, not by Jonathan Maccabeus, though he is said (u) to besiege it, and level it with the ground; but by John Hyrcanus; and the account of the destruction of it by him, as given by Josephus (w), exactly answers to this prophecy, and, to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where its desolation is also predicted; he says that Hyrcanus, having besieged it a year, took it; and, not content with this only, he utterly destroyed it, making brooks to run through it; and by digging it up, so that it fell into holes and caverns, insomuch that there were no signs nor traces of the city left. It was indeed afterwards rebuilt by Gabinius the Roman proconsul of Syria, and restored by Augustus Caesar to Herod, who adorned and fortified it, and called it by the name of Sebaste, in honour of Augustus (x); though Benjamin of Tudela pretends that Ahab's palace might be discerned there in his time, or the place known where it was, which is not likely; excepting this, his account is probable. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"From Luz (he says (y)) is one day's journey to Sebaste, which is Samaria; and still there may be perceived there the palace of Ahab king of Israel; and it is a fortified city on a very high hill, and in it are fountains; and is a land of brooks of water, and gardens, orchards, vineyards, and olive yards;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but, since his time, it is become more ruinous. Mr. Maundrell, who some years ago was upon the spot, gives a fuller account of it; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"this great city (he says (z)) is now wholly converted into gardens; and all the tokens that remain, to testify that there has ever been such a place, are only on the north side, a large square piazza, encompassed with pillars; and, on the east, some poor remains of a great church, said to be built by the Empress Helena, over the place where St. John Baptist was both imprisoned and beheaded.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So say others (a), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the remains of Sebaste, or the ancient Samaria, though long ago laid in ruinous heaps, and a great part of it turned into ploughed land and garden ground, do still retain some monuments of its ancient grandeur, and of those noble edifices in it, with which King Herod caused it to be adorned;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and then mention the large square piazza on the north, and the church on the east. It was twelve miles from Dothaim, and as many from Merran, and four from Atharoth, according to Eusebius (b); and was, as Josephus (c) says, a day's journey from Jerusalem. Sichem, called by the Turks Naplus, is now the metropolis of the country of Samaria; Samaria, or Sebaste, being utterly destroyed, as says Petrus a Valle (d), a traveller in those parts. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t)    \"in acervum agri, in plantationem, vel plantationes vinae\", Pagninus, Montanus, Tigurine version, Cocceius; as Junius & Tremellius, Piscator, Burkius. (u) Paschale Chronicon, p. 181. apud Reland. Palestina Illustrata, tom. 2. l. 3. p. 980. (w) Antiqu. l. 13. c. 10. sect. 3.((x) Ibid. l. 14. c. 5. sect. 3. &. l. 15. c. 7. sect. 3. & c. 8. sect. 5. (y) Itinerarium, p. 38. (z) Journey from Aleppo, &c. p. 59. Ed. 7. (a) Universal History, vol. 2. p. 439. (b) In voc. Dothaim, &c. (c) Antiqu. l. 15. c. 8. sect. 5. (d) Epist. 14. Morino apud Antiqu. Eccles. Oriental. p. 166. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t)    \"in acervum agri, in plantationem, vel plantationes vinae\", Pagninus, Montanus, Tigurine version, Cocceius; as Junius & Tremellius, Piscator, Burkius. (u) Paschale Chronicon, p. 181. apud Reland. Palestina Illustrata, tom. 2. l. 3. p. 980. (w) Antiqu. l. 13. c. 10. sect. 3.((x) Ibid. l. 14. c. 5. sect. 3. &. l. 15. c. 7. sect. 3. & c. 8. sect. 5. (y) Itinerarium, p. 38. (z) Journey from Aleppo, &c. p. 59. Ed. 7. (a) Universal History, vol. 2. p. 439. (b) In voc. Dothaim, &c. (c) Antiqu. l. 15. c. 8. sect. 5. (d) Epist. 14. Morino apud Antiqu. Eccles. Oriental. p. 166. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore I will make Samaria as an heap of the field, and as plantings of a vineyard: and I will pour down the stones thereof into the valley, and I will discover the foundations thereof.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a heap",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "into a heap",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. into ruins).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as plantings of a vineyard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "into the plantings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. Samaria should remain so long in ruins, that vineyards should be laid out upon it (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘the fat valley of those who are smitten down with wine’).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will pour down the stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Samaria standing on a hill (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). “There is every appearance of the ancient buildings having been destroyed, and their materials cast down from the brow of the hill, in order to clear the ground for cultivation; masses of stone are thus seen hanging on the steep sides of the hill, accidentally stopped in the progress of their descent by the rude dykes and terraces separating the fields.” “The materials of the ruins … are piled up in large heaps, or used in the construction of rude stone fences; many of these heaps of stone are seen in the plains at the foot of the hill.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Journal of a Deputation sent to the East by the Malta Prot. College",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vol. ii. p. 425.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "discover",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. lay bare.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will make.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This prophecy, therefore, was delivered before the destruction of Samaria in the fourth year of Hezekiah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As an heap of the field;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into a heap of the field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", like a heap of stones gathered off a cultivated field (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἰς ὀπωροφυλάκιον ἀγροῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the hut of a fruit watcher.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As plantings of a vineyard;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into the plantings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into mere terraces for vines. Such shall be the utter ruin of the city, that on its site vines shall be planted. The prophet here uses a description of complete destruction which is a regular formula in Assyrian inscriptions, where we read of cities being made into \"a rubbish heap and a field.\" The expression occurs, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in a monument of Tiglath-Pileser (see Schrader, 'Keilinschr.,' p. 449). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will pour down the stones thereof into the valley",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Samaria stood on a hilly platform (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with a sheer descent on every side, and when it was overthrown its stones were hurled into the valley surrounding it, as may be seen to this day. \"When we looked down,\" says Tristram ('Land of Israel,' p. 136), \"at the gaunt columns rising out of the little terraced fields, and the vines clambering up the sides of the hill once covered by the palaces of proud Samaria, who could help recalling the prophecy of Micah? Not more literally have the denunciations on Tyre or on Babylon been accomplished. What though Sebaste rose, under Herod, to a pitch of greater splendour than even old Samaria, the effort was in vain, and the curse has been fully accomplished. In the whole range of prophetic history, I know of no fulfilment more startling to the eyewitness in its accuracy than this.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will discover;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "will lay bare",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 137:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Micah 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This judicial interposition on the part of God is occasioned by the sin of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"For the apostasy of Jacob (is) all this, and for the sins of the house of Israel. Who is Jacob's apostasy? is it not Samaria? And who Judah's high places? is it not Jerusalem? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore I make Samaria into a stone-heap of the field, into plantations of vines; and I pour her stones into the valley, and I will lay bare her foundations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And all her stone images will be beaten to pieces, and all her lovers' gifts be burned with fire, and all her idols will I make into a waste: for she has gathered them of prostitute's hire, and to prostitute's hire shall they return.\" \"All this\" refers to the coming of Jehovah to judgment announced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This takes place on account of the apostasy and the sins of Israel. ב (for) used to denote reward or wages, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jacob and Israel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are synonymous, signifying the whole of the covenant nation, as we may see from the fact that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jacob and not Israel is the epithet applied to the ten tribes in distinction from Judah. מי, who? - referring to the author. The apostasy of Israel originates with Samaria; the worship on the high places with Jerusalem. The capitals of the two kingdoms are the authors of the apostasy, as the centres and sources of the corruption which has spread from them over the kingdoms. The allusion to the bâmōth of the illegal worship of the high places, which even the most godly kings were unable to abolish (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), shows, moreover, that פּשׁע denotes that religious apostasy from Jehovah which was formally sanctioned in the kingdom of the ten tribes by the introduction of the calf-worship. But because this apostasy commenced in the kingdom of the ten tribes, the punishment would fall upon this kingdom first, and Samaria would be utterly destroyed. Stone-heaps of the field and vineyard plantations harmonize badly, in Hitzig's view: he therefore proposes to alter the text. But there is no necessity for this. The point of comparison is simply that Samaria will be so destroyed, that not a single trace of a city will be left, and the site thereof will become like a ploughed field or plain. השּׂדה is added to עי, a heap of ruins or stones, to strengthen it. Samaria shall become like a heap, not of ruins of building stones, but of stones collected from the field. למטּעי כרם, i.e., into arable land upon which you can plant vineyards. The figure answers to the situation of Samaria upon a hill in a very fruitful region, which was well adapted for planting vineyards (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The situation of the city helps to explain the casting of its stones into the valley. Laying bare the foundations denotes destruction to the very foundation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 137:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On the destruction of the city all its idols will be annihilated. Pesı̄lı̄m, idols, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not wooden idols, however, to which the expression yukkattū, smitten to pieces, would not apply, but stone idols, from pâsal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By the lovers' gifts ('ethnân, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we are to understand, not \"the riches of the city or their possessions, inasmuch as the idolaters regarded their wealth and prosperity as a reward from their gods, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "\" (Rashi, Hitzig, and others), but the temple gifts, \"gifts suspended in the temples and sacred places in honour of the gods\" (Rosenmller), by which the temple worship with its apparatus were maintained; so that by 'ethnân we may understand the entire apparatus of religious worship. For the parallelism of the clauses requires that the word should be restricted to this. עצבּים are also idolatrous images. \"To make them into a waste,\" i.e., not only to divest them of their ornament, but so utterly to destroy them that the place where they once stood becomes waste. The next clause, containing the reason, must not be restricted to the ‛ătsabbı̄m, as Hitzig supposes, but refers to the two clauses of the first hemistich, so that pesı̄lı̄m and ‛ătsabbı̄m are to be supplied as objects to qibbâtsâh (she gathered), and to be regarded as the subject to yâshūbhū (shall return). Samaria gathered together the entire apparatus of her idolatrous worship from prostitute's gifts (the wages of prostitution), namely, through gifts presented by the idolaters. The acquisition of all this is described as the gain of prostitute's wages, according to the scriptural view that idolatry was spiritual whoredom. There is no ground for thinking of literal wages of prostitution, or money which flowed into the temples from the voluptuous worship of Aphrodite, because Micah had in his mind not literal (heathenish) idolatry, but simply the transformation of the Jehovah-worship into idolatry by the worship of Jehovah under the symbols of the golden calves. These things return back to the wagers of prostitution, i.e., they become this once more (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") by being carried away by the enemies, who conquer the city and destroy it, and being applied to their idolatrous worship. On the capture of cities, the idols and temple treasures were carried away (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]