[{"header":"After the Exile"},{"num":9,"verse":"All Israel was registered in the genealogies that are written in the Book of the Kings of Israel. But Judah was exiled to Babylon because of their unfaithfulness. "},{"num":2,"verse":"The first to live in their towns on their own property again were Israelites, priests, Levites, and temple servants."},{"num":22,"verse":"The total number of those chosen to be gatekeepers at the thresholds was 212. They were registered by genealogy in their villages. David and Samuel the seer had appointed them to their trusted positions. "},{"num":23,"verse":"So they and their sons were assigned to the gates of the Lord’s temple, which had been the tent-temple. "},{"num":24,"verse":"The gatekeepers were on the four sides: east, west, north, and south. "},{"num":25,"verse":"Their relatives came from their villages at fixed times to be with them seven days, "},{"num":26,"verse":"but the four chief gatekeepers, who were Levites, were entrusted with the rooms and the treasuries of God’s temple. "},{"num":27,"verse":"They spent the night in the vicinity of God’s temple, because they had guard duty and were in charge of opening it every morning."},{"num":28,"verse":"Some of them were in charge of the utensils used in worship. They would count them when they brought them in and when they took them out. "},{"num":29,"verse":"Others were put in charge of the furnishings and all the utensils of the sanctuary, as well as the fine flour, wine, oil, incense, and spices. "},{"num":30,"verse":"Some of the priests’ sons mixed the spices. "},{"num":31,"verse":"A Levite called Mattithiah, the firstborn of Shallum the Korahite, was entrusted with baking the bread. "},{"num":32,"verse":"Some of the Kohathites’ relatives were responsible for preparing the rows of the bread of the Presence every Sabbath."},{"num":33,"verse":"The singers, the heads of the Levite families, stayed in the temple chambers and were exempt from other tasks because they were on duty day and night. "},{"num":34,"verse":"These were the heads of the Levite families, chiefs according to their genealogies, and lived in Jerusalem."},{"header":"Saul’s Family"}]