[{"header":"Inhabitants of Jerusalem after the Exile"},{"num":9,"verse":"So all Israel was enrolled by genealogies; and these are written in the Book of the Kings of Israel. And Judah was taken into exile in Babylon because of their unfaithfulness. "},{"num":2,"verse":"Now the first to dwell again in their possessions in their cities were Israel, the priests, the Levites, and the temple servants. "},{"num":3,"verse":"And some of the people of Judah, Benjamin, E′phraim, and Manas′seh dwelt in Jerusalem: "},{"num":4,"verse":"Uthai the son of Ammi′hud, son of Omri, son of Imri, son of Bani, from the sons of Perez the son of Judah. "},{"num":5,"verse":"And of the Shi′lonites: Asai′ah the first-born, and his sons. "},{"num":6,"verse":"Of the sons of Zerah: Jeu′el and their kinsmen, six hundred and ninety. "},{"num":7,"verse":"Of the Benjaminites: Sallu the son of Meshul′lam, son of Hodavi′ah, son of Hassenu′ah, "},{"num":8,"verse":"Ibne′iah the son of Jero′ham, Elah the son of Uzzi, son of Michri, and Meshul′lam the son of Shephati′ah, son of Reu′el, son of Ibni′jah; "},{"num":9,"verse":"and their kinsmen according to their generations, nine hundred and fifty-six. All these were heads of fathers’ houses according to their fathers’ houses."},{"header":"Priestly Families"},{"num":10,"verse":"Of the priests: Jedai′ah, Jehoi′arib, Jachin, "},{"num":11,"verse":"and Azari′ah the son of Hilki′ah, son of Meshul′lam, son of Zadok, son of Merai′oth, son of Ahi′tub, the chief officer of the house of God; "},{"num":12,"verse":"and Adai′ah the son of Jero′ham, son of Pashhur, son of Malchi′jah, and Ma′asai the son of Ad′i-el, son of Jah′zerah, son of Meshul′lam, son of Meshil′lemith, son of Immer; "},{"num":13,"verse":"besides their kinsmen, heads of their fathers’ houses, one thousand seven hundred and sixty, very able men for the work of the service of the house of God."},{"header":"Levitical Families"},{"num":14,"verse":"Of the Levites: Shemai′ah the son of Hasshub, son of Azri′kam, son of Hashabi′ah, of the sons of Merar′i; "},{"num":15,"verse":"and Bakbak′kar, Heresh, Galal, and Mattani′ah the son of Mica, son of Zichri, son of Asaph; "},{"num":16,"verse":"and Obadi′ah the son of Shemai′ah, son of Galal, son of Jedu′thun, and Berechi′ah the son of Asa, son of Elka′nah, who dwelt in the villages of the Netoph′athites."},{"num":17,"verse":"The gatekeepers were: Shallum, Akkub, Talmon, Ahi′man, and their kinsmen (Shallum being the chief), "},{"num":18,"verse":"stationed hitherto in the king’s gate on the east side. These were the gatekeepers of the camp of the Levites. "},{"num":19,"verse":"Shallum the son of Ko′re, son of Ebi′asaph, son of Korah, and his kinsmen of his fathers’ house, the Ko′rahites, were in charge of the work of the service, keepers of the thresholds of the tent, as their fathers had been in charge of the camp of the Lord, keepers of the entrance. "},{"num":20,"verse":"And Phin′ehas the son of Elea′zar was the ruler over them in time past; the Lord was with him. "},{"num":21,"verse":"Zechari′ah the son of Meshelemi′ah was gatekeeper at the entrance of the tent of meeting. "},{"num":22,"verse":"All these, who were chosen as gatekeepers at the thresholds, were two hundred and twelve. They were enrolled by genealogies in their villages. David and Samuel the seer established them in their office of trust. "},{"num":23,"verse":"So they and their sons were in charge of the gates of the house of the Lord, that is, the house of the tent, as guards. "},{"num":24,"verse":"The gatekeepers were on the four sides, east, west, north, and south; "},{"num":25,"verse":"and their kinsmen who were in their villages were obliged to come in every seven days, from time to time, to be with these; "},{"num":26,"verse":"for the four chief gatekeepers, who were Levites, were in charge of the chambers and the treasures of the house of God. "},{"num":27,"verse":"And they lodged round about the house of God; for upon them lay the duty of watching, and they had charge of opening it every morning."},{"num":28,"verse":"Some of them had charge of the utensils of service, for they were required to count them when they were brought in and taken out. "},{"num":29,"verse":"Others of them were appointed over the furniture, and over all the holy utensils, also over the fine flour, the wine, the oil, the incense, and the spices. "},{"num":30,"verse":"Others, of the sons of the priests, prepared the mixing of the spices, "},{"num":31,"verse":"and Mattithi′ah, one of the Levites, the first-born of Shallum the Ko′rahite, was in charge of making the flat cakes. "},{"num":32,"verse":"Also some of their kinsmen of the Ko′hathites had charge of the showbread, to prepare it every sabbath."},{"num":33,"verse":"Now these are the singers, the heads of fathers’ houses of the Levites, dwelling in the chambers of the temple free from other service, for they were on duty day and night. "},{"num":34,"verse":"These were heads of fathers’ houses of the Levites, according to their generations, leaders, who lived in Jerusalem."},{"header":"The Family of King Saul"},{"num":35,"verse":"In Gibeon dwelt the father of Gibeon, Je-i′el, and the name of his wife was Ma′acah, "},{"num":36,"verse":"and his first-born son Abdon, then Zur, Kish, Ba′al, Ner, Nadab, "},{"num":37,"verse":"Gedor, Ahi′o, Zechari′ah, and Mikloth; "},{"num":38,"verse":"and Mikloth was the father of Shim′e-am; and these also dwelt opposite their kinsmen in Jerusalem, with their kinsmen. "},{"num":39,"verse":"Ner was the father of Kish, Kish of Saul, Saul of Jonathan, Mal′chishu′a, Abin′adab, and Eshba′al; "},{"num":40,"verse":"and the son of Jonathan was Mer′ib-ba′al; and Mer′ib-ba′al was the father of Micah. "},{"num":41,"verse":"The sons of Micah: Pithon, Melech, Tah′re-a, and Ahaz; "},{"num":42,"verse":"and Ahaz was the father of Jarah, and Jarah of Al′emeth, Az′maveth, and Zimri; and Zimri was the father of Moza. "},{"num":43,"verse":"Moza was the father of Bin′e-a; and Repha′iah was his son, Ele-a′sah his son, Azel his son. "},{"num":44,"verse":"Azel had six sons and these are their names: Azri′kam, Bo′cheru, Ish′mael, She-ari′ah, Obadi′ah, and Hanan; these were the sons of Azel."}]