[{"num":21,"verse":"And David cometh in to Nob, unto Ahimelech the priest, and Ahimelech trembleth at meeting David, and saith to him, `Wherefore [art] thou thyself alone, and no man with thee?'"},{"num":2,"verse":"And David saith to Ahimelech the priest, `The king hath commanded me a matter, and he saith unto me, Let no man know anything of the matter about which I am sending thee, and which I have commanded thee; and the young men I have caused to know at such and such a place;"},{"num":3,"verse":"and now, what is there under thy hand? five loaves give into my hand, or that which is found.'"},{"num":4,"verse":"And the priest answereth David, and saith, `There is no common bread under my hand, but there is holy bread; if the youths have been kept only from women.'"},{"num":5,"verse":"And David answereth the priest, and saith to him, `Surely, if women have been restrained from us as heretofore in my going out, then the vessels of the young men are holy, and it [is] a common way: and also, surely to-day it is sanctified in the vessel.'"},{"num":6,"verse":"And the priest giveth to him the holy thing, for there was no bread there except the bread of the Presence which is turned aside from the presence of Jehovah to put hot bread in the day of its being taken away."},{"num":7,"verse":"And there [is] a man of the servants of Saul on that day detained before Jehovah, and his name [is] Doeg the Edomite, chief of the shepherds whom Saul hath."},{"num":8,"verse":"And David saith to Ahimelech, `And is there not here under thy hand spear or sword? for neither my sword nor my vessels have I taken in my hand, for the matter of the king was urgent.'"},{"num":9,"verse":"And the priest saith, `The sword of Goliath the Philistine, whom thou didst smite in the valley of Elah, lo, it is wrapt in a garment behind the ephod, if it thou dost take to thyself, take; for there is none other save it in this [place].' And David saith, `There is none like it -- give it to me.'"},{"num":10,"verse":"And David riseth and fleeth on that day from the face of Saul, and cometh in unto Achish king of Gath;"},{"num":11,"verse":"and the servants of Achish say unto him, `Is not this David king of the land? is it not of this one they sing in dances, saying, `Saul smote among his thousands, and David among his myriads?'"},{"num":12,"verse":"And David layeth these words in his heart, and is exceedingly afraid of the face of Achish king of Gath,"},{"num":13,"verse":"and changeth his behaviour before their eyes, and feigneth himself mad in their hand, and scribbleth on the doors of the gate, and letteth down his spittle unto his beard."},{"num":14,"verse":"And Achish saith unto his servants, `Lo, ye see a man acting as a madman; why do ye bring him in unto me?"},{"num":15,"verse":"A lack of madmen [have] I, that ye have brought in this one to act as a madman by me! doth this one come in unto my house?'"}]