[{"header":"A Story About Ten Girls"},{"num":25,"verse":"“At that time God’s kingdom will be like ten girls who went to wait for the bridegroom. They took their lamps with them."},{"num":2,"verse":"Five of the girls were foolish, and five were wise."},{"num":3,"verse":"The foolish girls took their lamps with them, but they did not take extra oil for the lamps."},{"num":4,"verse":"The wise girls took their lamps and more oil in jars."},{"num":5,"verse":"When the bridegroom was very late, the girls could not keep their eyes open, and they all fell asleep."},{"num":6,"verse":"“At midnight someone announced, ‘The bridegroom is coming! Come and meet him!’"},{"num":7,"verse":"“Then all the girls woke up. They made their lamps ready."},{"num":8,"verse":"But the foolish girls said to the wise girls, ‘Give us some of your oil. The oil in our lamps is all gone.’"},{"num":9,"verse":"“The wise girls answered, ‘No! The oil we have might not be enough for all of us. But go to those who sell oil and buy some for yourselves.’"},{"num":10,"verse":"“So the foolish girls went to buy oil. While they were gone, the bridegroom came. The girls who were ready went in with the bridegroom to the wedding feast. Then the door was closed and locked."},{"num":11,"verse":"“Later, the other girls came. They said, ‘Sir, sir! Open the door to let us in.’"},{"num":12,"verse":"“But the bridegroom answered, ‘Certainly not! I don’t even know you.’"},{"num":13,"verse":"“So always be ready. You don’t know the day or the time when the Son of Man will come."},{"header":"A Story About Three Servants(A)"},{"num":14,"verse":"“At that time God’s kingdom will also be like a man leaving home to travel to another place for a visit. Before he left, he talked with his servants. He told his servants to take care of his things while he was gone."},{"num":15,"verse":"He decided how much each servant would be able to care for. The man gave one servant five bags of money. He gave another servant two bags. And he gave a third servant one bag. Then he left."},{"num":16,"verse":"The servant who got five bags went quickly to invest the money. Those five bags of money earned five more."},{"num":17,"verse":"It was the same with the servant who had two bags. That servant invested the money and earned two more."},{"num":18,"verse":"But the servant who got one bag of money went away and dug a hole in the ground. Then he hid his master’s money in the hole."},{"num":19,"verse":"“After a long time the master came home. He asked the servants what they did with his money."},{"num":20,"verse":"The servant who got five bags brought that amount and five more bags of money to the master. The servant said, ‘Master, you trusted me to care for five bags of money. So I used them to earn five more.’"},{"num":21,"verse":"“The master answered, ‘You did right. You are a good servant who can be trusted. You did well with that small amount of money. So I will let you care for much greater things. Come and share my happiness with me.’"},{"num":22,"verse":"“Then the servant who got two bags of money came to the master. The servant said, ‘Master, you gave me two bags of money to care for. So I used your two bags to earn two more.’"},{"num":23,"verse":"“The master answered, ‘You did right. You are a good servant who can be trusted. You did well with a small amount of money. So I will let you care for much greater things. Come and share my happiness with me.’"},{"num":24,"verse":"“Then the servant who got one bag of money came to the master. The servant said, ‘Master, I knew you were a very hard man. You harvest what you did not plant. You gather crops where you did not put any seed."},{"num":25,"verse":"So I was afraid. I went and hid your money in the ground. Here is the one bag of money you gave me.’"},{"num":26,"verse":"“The master answered, ‘You are a bad and lazy servant! You say you knew that I harvest what I did not plant and that I gather crops where I did not put any seed."},{"num":27,"verse":"So you should have put my money in the bank. Then, when I came home, I would get my money back. And I would also get the interest that my money earned.’"},{"num":28,"verse":"“So the master told his other servants, ‘Take the one bag of money from that servant and give it to the servant who has ten bags."},{"num":29,"verse":"Everyone who uses what they have will get more. They will have much more than they need. But people who do not use what they have will have everything taken away from them.’"},{"num":30,"verse":"Then the master said, ‘Throw that useless servant outside into the darkness, where people will cry and grind their teeth with pain.’"},{"header":"The Son of Man Will Judge All People"},{"num":31,"verse":"“The Son of Man will come again with divine greatness, and all his angels will come with him. He will sit as king on his great and glorious throne."},{"num":32,"verse":"All the people of the world will be gathered before him. Then he will separate everyone into two groups. It will be like a shepherd separating his sheep from his goats."},{"num":33,"verse":"He will put the sheep on his right and the goats on his left."},{"num":34,"verse":"“Then the king will say to the godly people on his right, ‘Come, my Father has great blessings for you. The kingdom he promised is now yours. It has been prepared for you since the world was made."},{"num":35,"verse":"It is yours because when I was hungry, you gave me food to eat. When I was thirsty, you gave me something to drink. When I had no place to stay, you welcomed me into your home."},{"num":36,"verse":"When I was without clothes, you gave me something to wear. When I was sick, you cared for me. When I was in prison, you came to visit me.’"},{"num":37,"verse":"“Then the godly people will answer, ‘Lord, when did we see you hungry and give you food? When did we see you thirsty and give you something to drink?"},{"num":38,"verse":"When did we see you with no place to stay and welcome you into our home? When did we see you without clothes and give you something to wear?"},{"num":39,"verse":"When did we see you sick or in prison and care for you?’"},{"num":40,"verse":"“Then the king will answer, ‘The truth is, anything you did for any of my people here, you also did for me.’"},{"num":41,"verse":"“Then the king will say to the evil people on his left, ‘Get away from me. God has already decided that you will be punished. Go into the fire that burns forever—the fire that was prepared for the devil and his angels."},{"num":42,"verse":"You must go away because when I was hungry, you gave me nothing to eat. When I was thirsty, you gave me nothing to drink."},{"num":43,"verse":"When I had no place to stay, you did not welcome me into your home. When I was without clothes, you gave me nothing to wear. When I was sick and in prison, you did not care for me.’"},{"num":44,"verse":"“Then those people will answer, ‘Lord, when did we see you hungry or thirsty? When did we see you without a place to stay? Or when did we see you without clothes or sick or in prison? When did we see any of this and not help you?’"},{"num":45,"verse":"“The king will answer, ‘The truth is, anything you refused to do for any of my people here, you refused to do for me.’"},{"num":46,"verse":"“Then these evil people will go away to be punished forever. But the godly people will go and enjoy eternal life.”"}]