[{"num":25,"verse":"“ At  that  time tote the ho kingdom basileia of ho heaven ouranos will  be  like homoioō ten deka virgins parthenos who hostis took lambanō · ho their heautou torches lampas and  went exerchomai out  to eis meet hypantēsis the ho bridegroom nymphios. "},{"num":2,"verse":"Now de five pente of ek them autos were eimi foolish mōros and kai five pente were  wise phronimos. "},{"num":3,"verse":"For gar when  the ho foolish mōros took lambanō · ho their autos torches lampas,  they  did  not ou take lambanō oil elaion with meta them heautou. "},{"num":4,"verse":"But de the ho wise phronimos took lambanō oil elaion in en · ho containers angeion along  with meta · ho their heautou torches lampas. "},{"num":5,"verse":"Now de since  the ho bridegroom nymphios was  slow chronizō in  coming ,  they  all pas became  drowsy nystazō and kai fell  asleep katheudō. "},{"num":6,"verse":"But de at mesos midnight nyx there  was ginomai a  shout kraugē, ‘ Look idou,  the ho bridegroom nymphios!  Come exerchomai out  to eis meet apantēsis him autos.’ "},{"num":7,"verse":"Then tote all pas those ekeinos virgins parthenos woke egeirō up  · ho and kai prepared kosmeō · ho their heautou torches lampas. "},{"num":8,"verse":"The ho · de foolish mōros said legō to  the ho wise phronimos, ‘ Give didōmi us hēmeis some ek of ho your hymeis oil elaion,  because hoti · ho our hēmeis torches lampas are  going sbennymi out .’ "},{"num":9,"verse":"But de the ho wise phronimos answered apokrinomai,  saying legō, ‘ Perhaps mēpote there  will  not ou mē be  enough arkeō for  both  us hēmeis and kai you hymeis, so  go poreuō rather mallon to pros the ho dealers pōleō and kai buy agorazō some  for  yourselves heautou.’ "},{"num":10,"verse":"And de while  they autos were  away aperchomai buying agorazō it,  the ho bridegroom nymphios came erchomai and kai the ho virgins  who  were  ready hetoimos went eiserchomai in  with meta him autos to eis the ho wedding gamos feast ,  and kai the ho door thura was  shut kleiō. "},{"num":11,"verse":"Later hysteros · de the ho other loipos virgins parthenos came erchomai,  · kai saying legō, ‘ Sir kyrios!  Sir kyrios!  Open anoigō the  door  for  us hēmeis.’ "},{"num":12,"verse":"But de he ho replied apokrinomai,  saying legō, ‘ I  tell legō you hymeis the  truth amēn,  I  do  not ou know oida you hymeis!’ "},{"num":13,"verse":"Therefore oun stay grēgoreō alert ,  because hoti you  know oida neither ou the ho day hēmera nor oude the ho hour hōra. "},{"num":14,"verse":"“ For gar the kingdom of heaven  is  like hōsper a  man anthrōpos about  to  leave  on  a  long  trip apodēmeō, who  called kaleō in  · ho his idios servants  and kai entrusted paradidōmi his autos money hyparchō to  them autos.  · ho"},{"num":15,"verse":"· kai To  one hos he  gave didōmi five pente talents talanton,  to  another hos two dyo,  to  another hos one heis— to  each hekastos according kata to  · ho his idios ability dynamis.  Then kai he  went  on  his  journey apodēmeō. "},{"num":16,"verse":"The ho one  who  had  received lambanō · ho five pente talents talanton went poreuō immediately and  put ergazomai his autos money to work  and kai gained kerdainō another allos five pente. "},{"num":17,"verse":"Likewise hōsautōs the ho one who had  the ho two dyo gained kerdainō another allos two dyo. "},{"num":18,"verse":"But de the ho servant  who  had  received lambanō the ho one heis talent  went aperchomai out  and  dug oryssō a  hole  in  the  ground gē and kai hid kryptō his autos master’ s kyrios · ho money argyrion.  · ho"},{"num":19,"verse":"Now de after meta a  long polys time chronos the ho master kyrios of ho those ekeinos servants  returned erchomai and kai settled synairō accounts logos with meta them autos. "},{"num":20,"verse":"· kai The ho one  who  had  received lambanō the ho five pente talents talanton came proserchomai and  brought prospherō another allos five pente,  saying legō, ‘ Master kyrios,  you  entrusted paradidōmi five pente talents talanton to  me egō;  look ide,  I  have  gained kerdainō five pente more allos.’ "},{"num":21,"verse":"His autos master kyrios said phēmi to  him autos,  · ho ‘Well done,  good agathos and kai faithful pistos servant.  You  have  been eimi trustworthy pistos in epi a  few oligos things ;  I  will  put kathistēmi you sy in  charge kathistēmi of epi many polys things .  Enter eiserchomai into eis the ho joy chara of ho your sy master kyrios.’ "},{"num":22,"verse":"· de The ho one who had received  the ho two dyo talents talanton also kai came proserchomai,  saying legō, “ Master kyrios,  you  entrusted paradidōmi two dyo talents talanton to  me egō.  Look ide,  I  have  gained kerdainō two dyo more allos.’ "},{"num":23,"verse":"His autos master kyrios said phēmi to  him autos,  · ho ‘Well done,  good agathos and kai faithful pistos servant.  You  have  been eimi trustworthy pistos in epi a  few oligos things ;  I  will  put kathistēmi you sy in  charge kathistēmi of epi many polys things .  Enter eiserchomai into eis the ho joy chara of ho your sy master kyrios.’ "},{"num":24,"verse":"Then de the ho one  who  had  received lambanō the ho one heis talent talanton also kai came proserchomai,  saying legō, ‘ Master kyrios,  I  knew ginōskō that hoti you  were eimi an  unscrupulous sklēros man anthrōpos,  reaping therizō where hopou you  have  not ou sown speirō and kai gathering synagō where hothen you  scattered  no ou seed diaskorpizō; "},{"num":25,"verse":"and kai being  afraid phobeomai,  I  went aperchomai off  and  hid kryptō · ho your sy talent talanton in en the ho ground gē.  Look ide,  you  have echō what ho is  yours sos.’ "},{"num":26,"verse":"But de his autos master kyrios answered apokrinomai · ho him autos,  saying legō, ‘ You  wicked ponēros and kai lazy oknēros servant!  You  knew oida that hoti I  reap therizō where hopou I  have  not ou sown speirō and kai gather synagō where hothen I  scattered  no ou seed diaskorpizō? "},{"num":27,"verse":"Then oun you sy ought dei to  have  deposited ballō · ho my egō money argyrion with  the ho bankers trapezitēs,  and kai at  my  return erchomai I egō would an have  recovered komizō what ho was  mine emos plus syn interest tokos! "},{"num":28,"verse":"So oun take airō the ho talent talanton away  from apo him autos,  and kai give didōmi it  to  the ho one  who  has echō the ho ten deka talents talanton. "},{"num":29,"verse":"For gar to ho everyone pas who  has echō will  more  be  given didōmi,  and kai he  will  have  an  abundance perisseuō;  but de from  him ho who  has echō not mē,  even kai what hos he  has echō will  be  taken airō from apo him autos. "},{"num":30,"verse":"And kai throw ekballō the ho worthless achreios servant  into eis the ho outer exōteros darkness skotos,  · ho where ekei there  will  be eimi · ho weeping klauthmos and kai · ho gnashing brygmos of ho teeth odous.’ "},{"num":31,"verse":"“ When hotan · de the ho Son hyios of ho Man anthrōpos comes erchomai in en · ho his autos glory doxa,  and kai all pas the ho angels angelos with meta him autos,  then tote he  will  sit kathizō on epi his autos glorious doxa throne thronos. "},{"num":32,"verse":"· kai All pas the ho nations ethnos will  be  gathered synagō before emprosthen him autos,  and kai he  will  separate aphorizō the  people autos one  from apo another allēlōn as hōsper a ho shepherd poimēn separates aphorizō the ho sheep probaton from apo the ho goats eriphos; "},{"num":33,"verse":"and kai he  will  place histēmi the ho sheep probaton on ek his autos right dexios,  and de the ho goats eriphion on ek the  left euōnymos. "},{"num":34,"verse":"Then tote the ho King basileus will  say legō to  those ho on ek his autos right dexios, ‘ Come deute,  you  who ho are  blessed eulogeō by ho my egō Father patēr;  inherit klēronomeō the ho kingdom basileia prepared hetoimazō for  you hymeis from apo the  foundation katabolē of  the  world kosmos. "},{"num":35,"verse":"For gar I  was  hungry peinaō and kai you  gave didōmi me egō food esthiō,  I  was  thirsty dipsaō and kai you  gave potizō me egō drink ,  I  was eimi a  stranger xenos and kai you  invited synagō me egō in , "},{"num":36,"verse":"I was  naked gymnos and kai you  clothed periballō me egō,  I  was  sick astheneō and kai you  took episkeptomai care  of  me egō,  I  was eimi in en prison phylakē and kai you  visited erchomai me egō.’ "},{"num":37,"verse":"Then tote the ho righteous dikaios will  answer apokrinomai him autos,  saying legō, ‘ Lord kyrios,  when pote did we see  you sy hungry peinaō and kai feed trephō you,  or ē thirsty dipsaō and kai give potizō you  drink ? "},{"num":38,"verse":"And de when pote did we see  you sy a  stranger xenos and kai invite synagō you  in ,  or ē naked gymnos and kai clothe periballō you? "},{"num":39,"verse":"And de when pote did we see  you sy sick astheneō or ē in en prison phylakē and kai visit erchomai pros you sy?’ "},{"num":40,"verse":"And kai the ho King basileus will  answer apokrinomai them autos,  saying legō, ‘ I  tell legō you hymeis the  truth amēn,  insofar  as epi you  did poieō it  to  one heis of  the ho least elachistos of  these houtos · ho my egō brothers adelphos,  you  did poieō it  to  me egō.’ "},{"num":41,"verse":"“ Then tote he  will  say legō · kai to  those ho on ek his  left euōnymos, ‘ Depart poreuō from apo me egō,  you ho cursed kataraomai ones ,  to eis the ho eternal aiōnios fire pyr · ho · ho prepared hetoimazō for  the ho devil diabolos and kai · ho his autos angels angelos. "},{"num":42,"verse":"For gar I  was  hungry peinaō and kai you  gave didōmi me egō no ou food esthiō,  I  was  thirsty dipsaō and kai you  gave  me egō no ou drink potizō, "},{"num":43,"verse":"I  was eimi a  stranger xenos and kai you  did  not ou invite synagō me egō in ,  naked gymnos and kai you  did  not ou clothe periballō me egō,  sick asthenēs and kai in en prison phylakē and kai you  did  not ou visit episkeptomai me egō.’ "},{"num":44,"verse":"Then tote they autos also kai will  answer apokrinomai,  saying legō, ‘ Lord kyrios,  when pote did we see  you sy hungry peinaō or ē thirsty dipsaō or ē a  stranger xenos or ē naked gymnos or ē sick asthenēs or ē in en prison phylakē and kai did  not ou help diakoneō you sy?’ "},{"num":45,"verse":"Then tote he  will  answer apokrinomai them autos,  saying legō, ‘ I  tell legō you hymeis the  truth amēn,  insofar  as epi you  did  not ou do poieō it  to  one heis of  the ho least elachistos of  these houtos,  you  did poieō not oude do poieō it  to  me egō.’ "},{"num":46,"verse":"And kai these houtos will  depart aperchomai to eis eternal aiōnios punishment kolasis,  but de the ho righteous dikaios to eis eternal aiōnios life zōē.” "}]