[{"num":33,"verse":"5 Elihu accuseth Job of ignorance. 14 He showeth that God hath divers means to instruct man and to draw him from sin. 19, 29 He afflicteth man and suddenly delivereth him. 26 Man being delivered giveth thanks to God."},{"num":1,"verse":"Wherefore, Job, I pray thee, hear my talk, and hearken unto all my words."},{"num":2,"verse":"Behold now, I have opened my mouth: my tongue hath spoken in my mouth."},{"num":3,"verse":"My words are in the uprightness of mine heart, and my lips shall speak pure knowledge."},{"num":4,"verse":"The Spirit of God hath made me, and the breath of the Almighty hath given me life."},{"num":5,"verse":"If thou canst give me answer, prepare thyself and stand before me."},{"num":6,"verse":"Behold, I am according to thy wish in God’s stead: I am also formed of the clay."},{"num":7,"verse":"Behold, my terror shall not fear thee, neither shall mine hand be heavy upon thee."},{"num":8,"verse":"Doubtless thou hast spoken in mine ears, and I have heard the voice of thy words."},{"num":9,"verse":"I am clean, without sin: I am innocent and there is none iniquity in me."},{"num":10,"verse":"Lo, he hath found occasions against me, and counted me for his enemy."},{"num":11,"verse":"He hath put my feet in the stocks, and looketh narrowly unto all my paths."},{"num":12,"verse":"Behold, in this hast thou not done right: I will answer thee, that God is greater than man."},{"num":13,"verse":"Why dost thou strive against him? for he doth not give account of all his matters."},{"num":14,"verse":"For God speaketh once or twice, and one seeth it not."},{"num":15,"verse":"In dreams and visions of the night, when sleep falleth upon men, and they sleep upon their beds,"},{"num":16,"verse":"Then he openeth the ears of men, even by their corrections, which he had sealed,"},{"num":17,"verse":"That he might cause man to turn away from his enterprise, and that he might hide the pride of man,"},{"num":18,"verse":"And keep back his soul from the pit, and that his life should not pass by the sword."},{"num":19,"verse":"He is also stricken with sorrow upon his bed, and the grief of his bones is sore,"},{"num":20,"verse":"So that his life causeth him to abhor bread, and his soul dainty meat."},{"num":21,"verse":"His flesh faileth that it cannot be seen, and his bones which were not seen, clatter."},{"num":22,"verse":"So his soul draweth to the grave, and his life to the buriers."},{"num":23,"verse":"If there be a messenger with him, or an interpreter, one of a thousand to declare unto man his righteousness,"},{"num":24,"verse":"Then will he have mercy upon him, and will say, Deliver him, that he go not down into the pit: for I have received a reconciliation."},{"num":25,"verse":"Then shall his flesh be as fresh as a child’s, and shall return as in the days of his youth."},{"num":26,"verse":"He shall pray unto God, and he will be favorable unto him, and he shall see his face with joy: for he will render unto man his righteousness."},{"num":27,"verse":"He looketh upon men, and if one say, I have sinned, and perverted righteousness, and it did not profit me,"},{"num":28,"verse":"He will deliver his soul from going into the pit, and his life shall see the light."},{"num":29,"verse":"Lo, all these things will God work twice or thrice with a man,"},{"num":30,"verse":"That he may turn back his soul from the pit, to be illuminated in the light of the living."},{"num":31,"verse":"Mark well, O Job, and hear me: keep silence and I will speak."},{"num":32,"verse":"If there be matter, answer me, and speak: for I desire to justify thee."},{"num":33,"verse":"If thou hast not, hear me: hold thy tongue, and I will teach thee wisdom."}]