[{"num":33,"verse":"Therefore, Job, hear thou my speeches, and harken (to) all my words."},{"num":2,"verse":"Lo! I have opened my mouth, (and) my tongue shall speak in my cheeks."},{"num":3,"verse":"Of simple heart be my words, and my lips shall speak clean sentence. (My words be from a sincere heart, and my lips shall speak clear sentences.)"},{"num":4,"verse":"The spirit of God made me, and the breathing of Almighty God quickened me."},{"num":5,"verse":"If thou mayest, answer thou to me, and stand thou against my face."},{"num":6,"verse":"Lo! God made me as and thee; and also I am formed of the same clay. (Lo! God hath made me like he did thee; and I am also formed out of the same clay.)"},{"num":7,"verse":"Nevertheless my miracle, that is, (the) knowing given of God, either by (a) miracle, to me, make thee not afeared, and mine eloquence be not grievous to thee. (But let not my miracle, that is, the knowledge given to me by God, by a miracle, make thee afraid, and let not my eloquence be grievous, or heavy, to thee.)"},{"num":8,"verse":"Thou saidest in mine hearing, and I heard the voice of thy words, (saying,)"},{"num":9,"verse":"I am clean, and without guilt, and unwemmed (and without blemish, or without fault), and wickedness is not in me."},{"num":10,"verse":"For God found quarrels in me, therefore he deemed me (an) enemy to himself. (But for God found quarrels with me, and so he judged me as an enemy to himself.)"},{"num":11,"verse":"He hath set my feet in a stock (He hath put my feet in the stocks); he kept (watch over) all my paths."},{"num":12,"verse":"Therefore this thing it is, in which thou art not made just (And so it is this in which thou art wrong); I shall answer to thee, that God is more than man."},{"num":13,"verse":"Thou, Job, strivest against God, that not at all thy words [he] answered to thee. (Thou, Job, complainest against God, for he answered not any of thy words to thee.)"},{"num":14,"verse":"God speaketh once, and the second time he rehearseth not the same thing. (For God speaketh once, and he repeateth not the same thing a second time.)"},{"num":15,"verse":"God speaketh by a dream in the vision of (the) night, when sleep falleth on men, and when they sleep in their bed. (God speaketh in a dream in the vision of the night, when sleep falleth on men, and they sleep in their beds.)"},{"num":16,"verse":"Then he openeth the ears of men, and he teacheth them, and teacheth prudence, or discipline;"},{"num":17,"verse":"(so) that he turn away a man from these things which he made, and deliver him from pride;"},{"num":18,"verse":"and that he deliver his soul from corruption, and his life, that it go not into sword. (and so that he deliver his soul from corruption, and that he die not by the sword.)"},{"num":19,"verse":"Also God blameth a man by sorrow in his bed, and he maketh all the bones of him for to wax rotten. (And God correcteth a person by sending sickness to him in his bed, and he maketh all his bones to grow rotten.)"},{"num":20,"verse":"Bread is made abominable to him in his life, and the meat, that before was to him desirable, loathed to his soul after. (And so for him, bread is made abominable, and the food, which he desired before, is now loathed by his soul.)"},{"num":21,"verse":"His flesh shall fail for rot, and his bones, that were covered, shall be made naked."},{"num":22,"verse":"His soul shall nigh to corruption, and his life to things bringing death."},{"num":23,"verse":"If an angel, one of a thousand, is speaking for him, that he show the equity of man, (Now if an angel, one of thousands, speaketh for man, to declare what he hath done right,)"},{"num":24,"verse":"(then) God shall have mercy on him, and shall say, Deliver thou him, that he go not down into corruption; I have found in what thing I shall do mercy to him."},{"num":25,"verse":"His flesh is wasted with torments; turn he again to the days of his young waxing age. (His flesh hath been wasted by torments; return he now to the days of his youth.)"},{"num":26,"verse":"He shall beseech God, and he shall be quemeful to him; and he shall see his face in perfect joy, and he shall yield to man his rightfulness. (He shall beseech God, and he shall be merciful to him; and he shall see his face with perfect joy, and God shall make all things right for him.)"},{"num":27,"verse":"He shall behold (other) men, and he shall say, I have sinned, and verily I have trespassed; and I have not received, as I was worthy. (If he shall look at other men, and he shall say, I have sinned, and truly I have trespassed; and I have not received, what I was worthy to receive;)"},{"num":28,"verse":"Forsooth he hath delivered his soul, that it should not go into perishing, but that he living should see light. (then he hath saved his soul, so that he shall not perish, but that in living he shall see the light.)"},{"num":29,"verse":"Lo! God worketh all these things in three times by all men; (Lo! God worketh all these things many times for all people;)"},{"num":30,"verse":"that he again-call their souls from corruption, and enlighten them in the light of living men. (so that he call back their souls from corruption, and enlighten them with the light of the living.)"},{"num":31,"verse":"Job, take heed, and hear thou me, and be thou still, while I speak (and listen to me, while I speak)."},{"num":32,"verse":"But if thou hast ready what thou shalt speak, answer thou to me, speak; for I will, that thou appear just (for I desire, that thou be justified, or proven right)."},{"num":33,"verse":"That if thou hast not, hear thou me (But if thou hast not, listen thou to me); be thou still, and I shall teach thee wisdom."}]