[{"header":"Daniel’s Vision by the Tigris River"},{"num":10,"verse":"During the third year that Cyrus was the king of Persia, these things were shown to Daniel. (Daniel’s other name is Belteshazzar.) They are true, but very hard to understand. Daniel understood them because they were explained to him in a vision."},{"num":2,"verse":"At that time I, Daniel, was very sad for three weeks."},{"num":3,"verse":"During those three weeks, I didn’t eat any fancy food; I didn’t eat any meat or drink any wine. I didn’t put any oil on my head. I didn’t do any of these things for three weeks."},{"num":4,"verse":"On the 24th day of the first month of the year, I was standing beside the great Tigris River."},{"num":5,"verse":"While I was standing there, I looked up and I saw a man standing in front of me. He was wearing linen clothes. He wore a belt made of pure gold around his waist."},{"num":6,"verse":"His body was like a smooth, shiny stone. His face was bright like lightning. His eyes were like flames of fire. His arms and feet were shiny like polished brass. His voice was loud like a crowd of people."},{"num":7,"verse":"I, Daniel, was the only one who saw the vision. The men with me didn’t see the vision, but they were still afraid. They were so afraid that they ran away and hid."},{"num":8,"verse":"So I was left alone. I was watching this vision, and it made me afraid. I lost my strength. My face turned white like a dead person’s face, and I was helpless."},{"num":9,"verse":"Then I heard the man in the vision talking. As I listened to his voice, I fell into a deep sleep, with my face on the ground."},{"num":10,"verse":"Then a hand touched me. When that happened, I got on my hands and knees. I was so afraid that I was shaking."},{"num":11,"verse":"The man in the vision said to me, “Daniel, God loves you very much. Think very carefully about the words I will speak to you. Stand up; I have been sent to you.” And when he said this, I stood up. I was still shaking because I was afraid."},{"num":12,"verse":"Then the man in the vision started talking again. He said, “Daniel, do not be afraid. From the very first day you decided to get wisdom and to be humble in front of God, he has been listening to your prayers. I came to you because you have been praying."},{"num":13,"verse":"But the prince of Persia has been fighting against me for 21 days. Then Michael, one of the most important princes, came to help me because I was stuck there with the king of Persia."},{"num":14,"verse":"Now I have come to you, Daniel, to explain to you what will happen to your people in the future. The vision is about a time in the future.”"},{"num":15,"verse":"While the man was talking to me, I bowed low with my face toward the ground. I could not speak."},{"num":16,"verse":"Then the one who looked like a man touched my lips. I opened my mouth and started to speak. I said to the one standing in front of me, “Sir, I am upset and afraid because of what I saw in the vision. I feel helpless."},{"num":17,"verse":"Sir, I am Daniel your servant. How can I talk with you? My strength is gone and it is hard for me to breathe.”"},{"num":18,"verse":"The one who looked like a man touched me again. When he touched me, I felt better."},{"num":19,"verse":"Then he said, “Daniel, don’t be afraid. God loves you very much. Peace be with you. Be strong now, be strong.”"},{"num":20,"verse":"So then he said, “Daniel, do you know why I have come to you? Soon I must go back to fight against the prince of Persia. When I go, the prince of Greece will come."},{"num":21,"verse":"But Daniel, before I go, I must first tell you what is written in the Book of Truth. No one stands with me against those evil angels except Michael, the prince over your people."}]