[{"header":"Daniel’s Vision of a Man"},{"num":10,"verse":"During Cyrus’ third year as king of Persia, Daniel learned about these things. (Daniel’s other name is Belteshazzar.) The message was true. It was about a great war. But Daniel understood it, because it was explained to him in a vision."},{"num":2,"verse":"At that time I, Daniel, was very sad for three weeks. "},{"num":3,"verse":"I did not eat any fancy food. I did not eat any meat or drink any wine. I did not use any perfumed oil. I did not do any of these things for three weeks."},{"num":4,"verse":"On the twenty-fourth day of the first month, I was standing beside the great Tigris River. "},{"num":5,"verse":"While standing there, I looked up. And I saw a man dressed in linen clothes. A belt made of fine gold was wrapped around his waist. "},{"num":6,"verse":"His body was like shiny yellow quartz. His face was bright like lightning, and his eyes were like fire. His arms and legs were shiny like polished bronze. His voice sounded like the roar of a crowd."},{"num":7,"verse":"I, Daniel, was the only person who saw the vision. The men with me did not see it. But they were badly frightened. They were so afraid they ran away and hid. "},{"num":8,"verse":"So I was left alone, watching this great vision. I lost my strength. My face turned white like a dead person, and I was helpless. "},{"num":9,"verse":"Then I heard the man in the vision speaking. As I listened, I fell into a deep sleep. My face was on the ground."},{"num":10,"verse":"Then a hand touched me and set me on my hands and knees. I was so afraid that I was shaking. "},{"num":11,"verse":"The man in the vision said to me, “Daniel, God loves you very much. Think very carefully about the words I will speak to you. Stand up because I have been sent to you.” And when he said this, I stood up. I was still shaking."},{"num":12,"verse":"Then the man said to me, “Daniel, do not be afraid. Some time ago you decided to try to get understanding. You wanted to be humble before God. Since that time God has listened to you. And I came to you because you have been praying. "},{"num":13,"verse":"But the prince of Persia has been fighting against me for 21 days. Then Michael, one of the most important angels, came to help me. He came because I had been left there with the king of Persia. "},{"num":14,"verse":"Now I have come to you, Daniel. I will explain to you what will happen to your people. The vision is about a time in the future.”"},{"num":15,"verse":"While he was speaking to me, I bowed facedown. I could not speak. "},{"num":16,"verse":"Then one who looked like a man touched my lips. I opened my mouth and started to speak. I said to the one standing in front of me, “Master, I am upset and afraid. It is because of what I saw in the vision. I feel helpless. "},{"num":17,"verse":"Master, I am Daniel your servant. How can I talk with you! My strength is gone, and it is hard for me to breathe.”"},{"num":18,"verse":"The one who looked like a man touched me again. And he gave me strength. "},{"num":19,"verse":"He said, “Daniel, don’t be afraid. God loves you very much. Peace be with you. Be strong now, be strong.”"},{"num":20,"verse":"So then he said, “Daniel, do you know why I have come to you? Soon I must go back to fight against the prince of Persia. When I go, the prince of Greece will come. "},{"num":21,"verse":"But before I go, I must first tell you what is written in the Book of Truth. No one stands with me against them except Michael. He is the angel ruling over your people."}]