[{"header":"Israel’s Suffering and Deliverance[a]"},{"header":"Chapter 10"},{"num":1,"verse":"Vision of the Hellenistic Wars. In the third year of Cyrus, king of Persia, a revelation was given to Daniel, who had been given the name Belteshazzar. The revelation, which dealt with a great conflict, was valid, and its meaning was disclosed to him in a vision."},{"num":2,"verse":"At that time I, Daniel, had been mourning for three weeks."},{"num":3,"verse":"I refrained from eating any choice food, abstaining from consuming meat or wine, and I did not anoint myself until those three weeks had passed."},{"num":4,"verse":"On the twenty-fourth day of the first month, as I stood on the bank of the great river, the Tigris,"},{"num":5,"verse":"I looked up and saw a man dressed in linen, with a belt of pure gold around his waist."},{"num":6,"verse":"His body was like beryl, his face shone like lightning, and his eyes were like fiery torches. His arms and his feet gleamed like burnished bronze, and the sound of his voice was like the roar of a multitude."},{"num":7,"verse":"I, Daniel, was the only one who saw this vision. Those who were with me did not see the vision, but they were seized with such great fear that they fled and hid themselves."},{"num":8,"verse":"Thus I was left alone to behold this great vision. My strength drained away, and I was powerless, as my face turned deathly pale."},{"num":9,"verse":"Then I heard the sound of his voice and as I did so I fell into a trance with my face to the ground."},{"num":10,"verse":"The Mission of the Angel Gabriel. But then I felt a hand touch me, and as I trembled I was raised to my hands and knees."},{"num":11,"verse":"He said, “Daniel, you are greatly loved. Pay close attention to the words that I am about to speak to you. Stand up now, for I have been sent to you.” And when he said this to me, I stood up trembling."},{"num":12,"verse":"Then he continued, “Do not be afraid, Daniel, for from the first day that you resolved to gain understanding and to humble yourself before God, your prayer was heard. It is because of your resolve that I have come to you."},{"num":13,"verse":"The prince of the kingdom of Persia thwarted me for twenty-one days, but finally Michael, one of the chief princes, came to help me. I left him there to confront the prince of the kingdom of Persia,"},{"num":14,"verse":"and I have come to explain to you what will happen to your people in the final days. For there is yet a further vision for those days.”"},{"num":15,"verse":"While he was speaking these words to me, I prostrated myself on the ground and was speechless."},{"num":16,"verse":"Then someone who looked like a man touched my lips. I opened my mouth and said to the person standing before me, “My lord, anguish has overcome me at this vision, and I no longer have any further strength."},{"num":17,"verse":"How can I, my lord’s servant, speak to you now that I have no strength left in me and my breath fails me?”"},{"num":18,"verse":"The one who looked like a man touched me again and strengthened me, saying,"},{"num":19,"verse":"“Do not be afraid, greatly beloved. You have been specially chosen. Peace be with you. Have courage and be strong.”"},{"num":20,"verse":"As he spoke to me, I once again felt strong, and I said, “Speak, my lord, for you have strengthened me.”"}]