[{"header":"Daniel’s Vision of a Man"},{"num":10,"verse":"During Cyrus’ third year as king of Persia, Daniel, whose name was Belteshazzar, received a vision about a great war. It was a true message that Daniel understood."},{"num":2,"verse":"At that time I, Daniel, had been very sad for three weeks. "},{"num":3,"verse":"I did not eat any fancy food or meat, or drink any wine, or use any perfumed oil for three weeks."},{"num":4,"verse":"On the twenty-fourth day of the first month, I was standing beside the great Tigris River. "},{"num":5,"verse":"While standing there, I looked up and saw a man dressed in linen clothes with a belt of fine gold wrapped around his waist. "},{"num":6,"verse":"His body was like shiny yellow quartz. His face was bright like lightning, and his eyes were like fire. His arms and legs were shiny like polished bronze, and his voice sounded like the roar of a crowd."},{"num":7,"verse":"I, Daniel, was the only person who saw the vision. The men with me did not see it, because they were so frightened that they ran away and hid. "},{"num":8,"verse":"So I was left alone, watching this great vision. I lost my strength, my face turned white like a dead person, and I was helpless. "},{"num":9,"verse":"Then I heard the man in the vision speaking. As I listened, I fell into a deep sleep with my face on the ground."},{"num":10,"verse":"Then a hand touched me and set me on my hands and knees. I was so afraid that I was shaking. "},{"num":11,"verse":"The man in the vision said to me, “Daniel, God loves you very much. Think carefully about the words I will speak to you, and stand up, because I have been sent to you.” When he said this, I stood up, but I was still shaking."},{"num":12,"verse":"Then the man said to me, “Daniel, do not be afraid. Some time ago you decided to get understanding and to humble yourself before your God. Since that time God has listened to you, and I have come because of your prayers. "},{"num":13,"verse":"But the prince of Persia has been fighting against me for twenty-one days. Then Michael, one of the most important angels, came to help me, because I had been left there with the king of Persia. "},{"num":14,"verse":"Now I have come to explain to you what will happen to your people, because the vision is about a time in the future.”"},{"num":15,"verse":"While he was speaking to me, I bowed facedown and could not speak. "},{"num":16,"verse":"Then one who looked like a man touched my lips, so I opened my mouth and started to speak. I said to the one standing in front of me, “Master, I am upset and afraid because of what I saw in the vision. I feel helpless. "},{"num":17,"verse":"Master, how can I, your servant, talk with you? My strength is gone, and it is hard for me to breathe.”"},{"num":18,"verse":"The one who looked like a man touched me again and gave me strength. "},{"num":19,"verse":"He said, “Daniel, don’t be afraid. God loves you very much. Peace be with you. Be strong now; be courageous.”"},{"num":20,"verse":"Then he said, “Daniel, do you know why I have come to you? Soon I must go back to fight against the prince of Persia. When I go, the prince of Greece will come, "},{"num":21,"verse":"but I must first tell you what is written in the Book of Truth. No one stands with me against these enemies except Michael, the angel ruling over your people."}]