[{"header":"Daniel’s Special Dream by the Tigris River"},{"num":10,"verse":"In the third year that Cyrus was the king of Persia, some news was made known to Daniel (who was called Belteshazzar). The news was true and it was about a battle. He received understanding of the news in a special dream."},{"num":2,"verse":"In those days, I, Daniel, had been full of sorrow for three weeks. "},{"num":3,"verse":"I did not eat any fine food, and no meat or wine came into my mouth. And I did not use any oil at all, until the three weeks were finished. "},{"num":4,"verse":"On the twenty-fourth day of the first month, I was standing by the side of the wide Tigris River. "},{"num":5,"verse":"I looked up and saw a certain man dressed in linen. Around him was a belt of fine gold. "},{"num":6,"verse":"His body was like shining stone. His face looked like lightning. His eyes were like fire. His arms and feet were like shining brass. And his voice was like the noise of many people. "},{"num":7,"verse":"I, Daniel, was the only one who saw the special dream. The men who were with me did not see it. But they were filled with much fear, and ran away to hide themselves. "},{"num":8,"verse":"So I was left alone and saw this special dream. I had no strength left. My skin color turned white as if I were dead, and there was no strength left in me. "},{"num":9,"verse":"Then I heard the sound of his words. And as soon as I heard him speak, I fell into a deep sleep with my face to the ground."},{"header":"The Future for Persia and Greece"},{"num":10,"verse":"Then a hand touched me and I shook with fear on my hands and knees. "},{"num":11,"verse":"And he said to me, “O Daniel, you who are loved very much, understand what I am about to tell you, and stand up. For I have now been sent to you.” When he said this to me, I stood up shaking in fear. "},{"num":12,"verse":"Then he said to me, “Do not be afraid, Daniel. Since the first day that you set your mind on understanding and getting rid of your pride before your God, your words were heard. And I have come because of your words. "},{"num":13,"verse":"But the ruler of Persia stood against me for twenty-one days. Then Michael, one of the leading princes of honor, came to help me, because I had been left there with the king of Persia. "},{"num":14,"verse":"Now I have come to help you understand what will happen to your people in the last days. For the special dream is about the days yet to come.” "},{"num":15,"verse":"When he had said this to me, I turned my face toward the ground and could not speak. "},{"num":16,"verse":"Then one who looked like a man touched my lips, and I opened my mouth and spoke. I said to him who was standing in front of me, “O my lord, pain has come to me because of the special dream, and I have no strength left. "},{"num":17,"verse":"How can I, your servant, talk with you, my lord? My strength is gone and no breath is left in me.”"},{"num":18,"verse":"Then the one who looked like a man touched me again and gave me strength. "},{"num":19,"verse":"He said, “O man who is loved very much, do not be afraid. May peace be with you. Be strong and have strength of heart.” And when he had spoken to me, I received strength, and said, “May my lord speak, for you have given me strength.” "},{"num":20,"verse":"He said, “Do you understand why I have come to you? Soon I will return to fight against the ruler of Persia. And when I go, the ruler of Greece will come. "},{"num":21,"verse":"But first I will tell you what is written in the Book of Truth. (No one helps me against these rulers except Michael, your leading angel."}]