[{"header":"Jacob establishes worship at Bethel"},{"num":35,"verse":"God said to Jacob, “Get up, go to Bethel, and live there. Build an altar there to the God who appeared to you when you ran away from your brother Esau.”"},{"num":2,"verse":"Jacob said to his household and to everyone who was with him, “Get rid of the foreign gods you have with you. Clean yourselves and change your clothes."},{"num":3,"verse":"Then let’s rise and go up to Bethel so that I can build an altar there to the God who answered me when I was in trouble and who has been with me wherever I’ve gone.”"},{"num":4,"verse":"So they gave Jacob all of the foreign gods they had, as well as the rings in their ears, and Jacob buried them under the terebinth at Shechem."},{"num":5,"verse":"When they set out, God made all of the surrounding cities fearful so that they didn’t pursue Jacob’s sons."},{"num":6,"verse":"Jacob and all of the people with him arrived in Luz, otherwise known as Bethel, in the land of Canaan."},{"num":7,"verse":"He built an altar there and named the place El-bethel, because God had revealed himself to him there when he ran away from his brother."},{"num":8,"verse":"Rebekah’s nurse Deborah died and was buried at Bethel under the oak, and Jacob named it Allon-bacuth."},{"num":9,"verse":"God appeared to Jacob again, while he was on his way back from Paddan-aram, and blessed him."},{"num":10,"verse":"God said to him, “Your name is Jacob, but your name will be Jacob no longer. No, your name will be Israel.” And he named him Israel."},{"num":11,"verse":"God said to him, “I am El Shaddai. Be fertile and multiply. A nation, even a large group of nations, will come from you; kings will descend from your own children."},{"num":12,"verse":"The land I gave to Abraham and to Isaac, I give to you; and I will give the land to your descendants after you.”"},{"num":13,"verse":"Then God ascended, leaving him alone in the place where he spoke to him."},{"num":14,"verse":"So Jacob set up a sacred pillar, a stone pillar, at the place God spoke to him. He poured an offering of wine on it and then poured oil over it."},{"num":15,"verse":"Jacob named the place Bethel where God spoke to him."},{"header":"Benjamin’s birth and Rachel’s death"},{"num":16,"verse":"They left Bethel, and when they were still some distance from Ephrath, Rachel went into hard labor."},{"num":17,"verse":"During her difficult labor, the midwife said to her, “Don’t be afraid. You have another son.”"},{"num":18,"verse":"As her life faded away, just before she died, she named him Ben-oni, but his father named him Benjamin."},{"num":19,"verse":"Rachel died and was buried near the road to Ephrath, that is, Bethlehem."},{"num":20,"verse":"Jacob set up a pillar on her grave. It’s the pillar on Rachel’s tomb that’s still there today."},{"num":21,"verse":"Israel continued his trip and pitched his tent farther on near the tower of Eder."},{"header":"Jacob’s family"},{"num":22,"verse":"While Israel stayed in that place, Reuben went and slept with Bilhah his father’s secondary wife, and Israel heard about it."},{"num":23,"verse":"The sons of Leah were Reuben, Jacob’s oldest son, and Simeon, Levi, Judah, Issachar, and Zebulun."},{"num":24,"verse":"The sons of Rachel were Joseph and Benjamin."},{"num":25,"verse":"The sons of Bilhah, Rachel’s servant, were Dan and Naphtali."},{"num":26,"verse":"The sons of Zilpah, Leah’s servant, were Gad and Asher. These were Jacob’s sons born to him in Paddan-aram."},{"header":"Isaac’s death"},{"num":27,"verse":"Jacob came to his father Isaac at Mamre, that is, Kiriath-arba. This is Hebron, where Abraham and Isaac lived as immigrants."},{"num":28,"verse":"At the age of 180 years,"},{"num":29,"verse":"Isaac took his last breath and died. He was buried with his ancestors after a long, satisfying life. His sons Esau and Jacob buried him."}]