[{"header":"Jacob Moves to Bethel"},{"num":35,"verse":"Then God said to Jacob, “Arise, go up to Bethel and live there, and make an altar there to God, who appeared to you when you fled from your brother Esau.”"},{"num":2,"verse":"So Jacob said to his household and to all who were with him, “Remove the foreign gods which are among you, and purify yourselves and change your garments;"},{"num":3,"verse":"and let’s arise and go up to Bethel, and I will make an altar there to God, who answered me on the day of my distress and has been with me wherever I have gone.”"},{"num":4,"verse":"So they gave Jacob all the foreign gods which they had and the rings which were in their ears, and Jacob hid them under the oak which was near Shechem."},{"num":5,"verse":"As they journeyed, there was a great terror upon the cities which were around them, and they did not pursue the sons of Jacob."},{"num":6,"verse":"So Jacob came to Luz (that is, Bethel), which is in the land of Canaan, he and all the people who were with him."},{"num":7,"verse":"Then he built an altar there, and called the place El-bethel, because there God had revealed Himself to him when he fled from his brother."},{"num":8,"verse":"Now Deborah, Rebekah’s nurse, died, and she was buried below Bethel under the oak; and it was named Allon-bacuth."},{"header":"Jacob Is Named Israel"},{"num":9,"verse":"Then God appeared to Jacob again when he came from Paddan-aram, and He blessed him."},{"num":10,"verse":"God said to him,"},{"num":11,"verse":"God also said to him,"},{"num":13,"verse":"Then God went up from him at the place where He had spoken with him."},{"num":14,"verse":"So Jacob set up a memorial stone in the place where He had spoken with him, a memorial of stone, and he poured out a drink offering on it; he also poured oil on it."},{"num":15,"verse":"And Jacob named the place where God had spoken with him, Bethel."},{"num":16,"verse":"Then they journeyed on from Bethel; but when there was still some distance to go to Ephrath, Rachel began to give birth and she suffered severe difficulties in her labor."},{"num":17,"verse":"And when she was suffering severe difficulties in her labor, the midwife said to her, “Do not fear, for you have another son!”"},{"num":18,"verse":"And it came about, as her soul was departing (for she died), that she named him Ben-oni; but his father called him Benjamin."},{"num":19,"verse":"So Rachel died and was buried on the way to Ephrath (that is, Bethlehem)."},{"num":20,"verse":"And Jacob set up a memorial stone over her grave; that is the memorial stone of Rachel’s grave to this day."},{"num":21,"verse":"Then Israel journeyed on and pitched his tent beyond the tower of Eder."},{"header":"The Sons of Israel"},{"num":22,"verse":"And it came about, while Israel was living in that land, that Reuben went and slept with his father’s concubine Bilhah, and Israel heard about it."},{"num":23,"verse":"the sons of Leah were Reuben, Jacob’s firstborn, then Simeon, Levi, Judah, Issachar, and Zebulun;"},{"num":24,"verse":"the sons of Rachel were Joseph and Benjamin;"},{"num":25,"verse":"and the sons of Bilhah, Rachel’s female slave, were Dan and Naphtali;"},{"num":26,"verse":"and the sons of Zilpah, Leah’s female slave, were Gad and Asher. These were the sons of Jacob who were born to him in Paddan-aram."},{"num":27,"verse":"Jacob came to his father Isaac at Mamre of Kiriath-arba (that is, Hebron), where Abraham and Isaac had resided."},{"num":28,"verse":"Now the days of Isaac were 180 years."},{"num":29,"verse":"Then Isaac breathed his last and died, and was gathered to his people, an old man of ripe age; and his sons Esau and Jacob buried him."}]