[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What have I done?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The whole address of David to Saul is intensely reverent, even loving. The conspicuous trophy of his late “night raid” was in his hand; we can imagine the first rays of the morning sun lighting up the glittering royal spear grasped by David. Saul could not help recognising that at least the son of Jesse sought not his life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:13-20 David reasoned seriously and affectionately with Saul. Those who forbid our attendance on God's ordinances, do what they can to estrange us from God, and to make us heathens. We are to reckon that which exposes us to sin the greatest injury that can be done us. If the Lord stirred thee up against me, either in displeasure to me, taking this way to punish me for my sins against him, or in displeasure to thee, if it be the effect of that evil spirit from the Lord which troubles thee; let Him accept an offering from us both. Let us join in seeking peace, and to be reconciled with God by sacrifice.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This incidental testimony to Abner's great eminence as a warrior is fully borne out by David's dirge at Abner's death ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:31-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as well as by his whole history. At the same time David's bantering tone in regard to Abner, coupled with what he says in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", makes it proable that David attributed Saul's persecution of him in some degree to Abner. Abner would be likely to dread a rival in the young conqueror of Judah (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. David said to Abner, Art not thou a valiant man: … wherefore then hast thou not kept thy lord the king?—The circumstance of David having penetrated to the center of the encampment, through the circular rows of the sleeping soldiers, constituted the point of this sarcastic taunt. This new evidence of David's moderation and magnanimous forbearance, together with his earnest and kindly expostulation, softened the obduracy of Saul's heart.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said, wherefore doth my lord thus pursue after his servant?.... Suggesting that it was both below him to do it, and against his interest; for David was his servant, and he would gladly have continued in his service, and done his business, but he drove him from it, and pursued him as a traitor, when he had not been guilty of any offence to his knowledge: and therefore puts the following questions: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for what have I done? or what evil is in mine hand? what crime had he committed, that he was pursued after this manner, and his life sought for? what had he done worthy of death? having a clear conscience, he could boldly ask these questions. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for what have I done? or what evil is in mine hand? what crime had he committed, that he was pursued after this manner, and his life sought for? what had he done worthy of death? having a clear conscience, he could boldly ask these questions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said, Wherefore doth my lord thus pursue after his servant? for what have I done? or what evil is in mine hand?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] With David’s speech here compare that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. Here he affirms his innocence indirectly by challenging Saul to give his reasons for persecuting him: there he appeals directly to his having spared Saul’s life as a proof of his loyalty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Saul heard David's voice (for he could hardly have seen David, as the occurrence took place before daybreak, at the latest when the day began to dawn), and David had made himself known to the king in reply to his inquiry, David said, \"Why doth my lord pursue his servant? for what have I done, and what evil is in my hand?\" He then gave him the well-meant advice, to seek reconciliation for his wrath against him, and not to bring upon himself the guilt of allowing David to find his death in a foreign land. The words, \"and now let my lord the king hear the saying of his servant,\" serve to indicate that what follows is important, and worthy of laying to heart. In his words, David supposes two cases as conceivable causes of Saul's hostility: (1) if Jehovah hath stirred thee up against me; (2) if men have done so. In the first case, he proposes as the best means of overcoming this instigation, that He (Jehovah) should smell an offering. The Hiphil ירח only means to smell, not to cause to smell. The subject is Jehovah. Smelling a sacrifice is an anthropomorphic term, used to denote the divine satisfaction (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The meaning of the words, \"let Jehovah smell sacrifice,\" is therefore, \"let Saul appease the wrath of God by the presentation of acceptable sacrifices.\" What sacrifices they are which please God, is shown in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:18-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and it is certainly not by accident merely that David uses the word minchah, the technical expression in the law for the bloodless sacrifice, which sets forth the sanctification of life in good works. The thought to which David gives utterance here, namely, that God instigates a man to evil actions, is met with in other passages of the Old Testament. It not only lies at the foundation of the words of David in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Hengstenberg on Psalms), but is also clearly expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 24:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Jehovah instigates David to number the people, and where this instigation is described as a manifestation of the anger of God against Israel; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., where David says, with regard to Shimei, that God had bade him curse him. These passages also show that God only instigates those who have sinned against Him to evil deeds; and therefore that the instigation consists in the fact that God impels sinners to manifest the wickedness of their hearts in deeds, or furnishes the opportunity and occasion for the unfolding and practical manifestation of the evil desire of the heart, that the sinner may either be brought to the knowledge of his more evil ways and also to repentance, through the evil deed and its consequences, or, if the heart should be hardened still more by the evil deed, that it may become ripe for the judgment of death. The instigation of a sinner to evil is simply one peculiar way in which God, as a general rule, punishes sins through sinners; for God only instigates to evil actions such as have drawn down the wrath of God upon themselves in consequence of their sin. When David supposes the fact that Jehovah has instigated Saul against him, he acknowledges, implicitly at least, that he himself is a sinner, whom the Lord may be intending to punish, though without lessening Saul's wrong by this indirect confession.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The second supposition is: \"if, however, children of men\" (sc., have instigated thee against me); in which case \"let them be cursed before the Lord; for they drive me now (this day) that I dare not attach myself to the inheritance of Jehovah (i.e., the people of God), saying, Go, serve other gods.\" The meaning is this: They have carried it so far now, that I am obliged to separate from the people of God, to fly from the land of the Lord, and, because far away from His sanctuary, to serve other gods. The idea implied in the closing words was, that Jehovah could only be worshipped in Canaan, at the sanctuary consecrated to Him, because it was only there that He manifested himself to His people, and revealed His face or gracious presence (vid., Psalm 42:2-3; Psalm 84:11; Psalm 143:6.). \"We are not to understand that the enemies of David were actually accustomed to use these very words, but David was thinking of deeds rather than words\" (Calvin).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The second supposition is: \"if, however, children of men\" (sc., have instigated thee against me); in which case \"let them be cursed before the Lord; for they drive me now (this day) that I dare not attach myself to the inheritance of Jehovah (i.e., the people of God), saying, Go, serve other gods.\" The meaning is this: They have carried it so far now, that I am obliged to separate from the people of God, to fly from the land of the Lord, and, because far away from His sanctuary, to serve other gods. The idea implied in the closing words was, that Jehovah could only be worshipped in Canaan, at the sanctuary consecrated to Him, because it was only there that He manifested himself to His people, and revealed His face or gracious presence (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). \"We are not to understand that the enemies of David were actually accustomed to use these very words, but David was thinking of deeds rather than words\" (Calvin).",
            "children": []
          }
        ]
      }
    ]
  }
]