[{"header":"Saul Saves Jabesh Gilead"},{"num":11,"verse":"Nahash the Ammonite went and set up camp against Jabesh Gilead. So all the men of Jabesh said to Nahash, “Make a treaty with us, and we will serve you.” "},{"num":2,"verse":"Nahash the Ammonite said to them, “On this condition I will make a treaty with you: I will gouge out the right eye of every one of you in order to dishonor all Israel.”"},{"num":3,"verse":"The elders of Jabesh said to him, “Give us seven days, so that we can send messengers throughout all the borders of Israel. Then, if there is no one to rescue us, we will come out to you.” "},{"num":4,"verse":"When the messengers came to Gibeah of Saul and spoke these words in the hearing of the people, all the people cried out and wept loudly."},{"num":5,"verse":"Just then Saul came in from the field, following the oxen. Saul asked, “What has upset the people? Why are they weeping?” So they told him about the words of the men of Jabesh."},{"num":6,"verse":"When Saul heard those words, the Spirit of God rushed upon him with power, and his anger burned intensely. "},{"num":7,"verse":"He took a yoke of oxen and cut them to pieces and sent the pieces throughout all the borders of Israel in the hands of messengers who said, “This is what will be done to the oxen of anyone who does not turn out to follow Saul and Samuel.” The dread of the Lord fell on the people, and they turned out as one man. "},{"num":8,"verse":"Saul counted them in Bezek. The men of Israel totaled three hundred thousand and the men of Judah thirty thousand."},{"num":9,"verse":"They said to the messengers who had come, “Tell the men of Jabesh Gilead, ‘Tomorrow, by the time the sun is hot, you will be rescued.’”"},{"num":10,"verse":"So the men of Jabesh said, “Tomorrow we will come out to you, and you can do with us whatever seems good to you.”"},{"num":11,"verse":"On the next day, Saul split the army into three divisions. They broke into the middle of the Ammonite camp during the last watch before morning and struck them down until the heat of the day. Those who survived were so scattered that no two of them were left together."},{"num":12,"verse":"Then the people said to Samuel, “Who was it who said, ‘Shall Saul reign over us?’ Hand those men over to us, so we can put them to death!”"},{"num":13,"verse":"But Saul said, “No one shall be put to death today, because today the Lord has rescued Israel.”"},{"num":14,"verse":"Then Samuel said to the people, “Come! Let’s go to Gilgal and confirm the kingship there.” "},{"num":15,"verse":"So all the people went to Gilgal, and they made Saul king in the presence of the Lord there at Gilgal. There they sacrificed fellowship offerings before the Lord, and Saul and all the men of Israel held a great celebration there."}]