[{"header":"Saul Defeats the Ammonites"},{"num":11,"verse":"About a month later King Nahash of Ammon led his army against the town of Jabesh in the territory of Gilead and besieged it. The men of Jabesh said to Nahash, “Make a treaty with us, and we will accept you as our ruler.”"},{"num":2,"verse":"Nahash answered, “I will make a treaty with you on one condition: I will put out everyone's right eye and so bring disgrace on all Israel.”"},{"num":3,"verse":"The leaders of Jabesh said, “Give us seven days to send messengers throughout the land of Israel. If no one will help us, then we will surrender to you.”"},{"num":4,"verse":"The messengers arrived at Gibeah, where Saul lived, and when they told the news, the people started crying in despair. "},{"num":5,"verse":"Saul was just then coming in from the field with his oxen, and he asked, “What's wrong? Why is everyone crying?” They told him what the messengers from Jabesh had reported. "},{"num":6,"verse":"When Saul heard this, the spirit of God took control of him, and he became furious. "},{"num":7,"verse":"He took two oxen, cut them in pieces, and had messengers carry the pieces throughout the land of Israel with this warning: “Whoever does not follow Saul and Samuel into battle will have this done to his oxen!”"},{"num":8,"verse":"Saul gathered them at Bezek: there were 300,000 from Israel and 30,000 from Judah. "},{"num":9,"verse":"They said to the messengers from Jabesh, “Tell your people that before noon tomorrow they will be rescued.” When the people of Jabesh received the message, they were overjoyed "},{"num":10,"verse":"and said to Nahash, “Tomorrow we will surrender to you, and you can do with us whatever you wish.”"},{"num":11,"verse":"That night Saul divided his men into three groups, and at dawn the next day they rushed into the enemy camp and attacked the Ammonites. By noon they had slaughtered them. The survivors scattered, each man running off by himself."},{"num":12,"verse":"Then the people of Israel said to Samuel, “Where are the people who said that Saul should not be our king? Hand them over to us, and we will kill them!”"},{"num":13,"verse":"But Saul said, “No one will be put to death today, for this is the day the Lord rescued Israel.” "},{"num":14,"verse":"And Samuel said to them, “Let us all go to Gilgal and once more proclaim Saul as our king.” "},{"num":15,"verse":"So they all went to Gilgal, and there at the holy place they proclaimed Saul king. They offered fellowship sacrifices, and Saul and all the people of Israel celebrated the event."}]