[{"header":"Saul Wins the Battle over the Ammonites"},{"num":11,"verse":"Then Nahash the Ammonite came and his soldiers set up their tents around Jabesh-gilead. All the men of Jabesh said to Nahash, “Make an agreement with us, and we will work for you.” "},{"num":2,"verse":"But Nahash the Ammonite said to them, “I will make an agreement with you only if I may cut out the right eye of every one of you. This way I will put all Israel to shame.” "},{"num":3,"verse":"The leaders of Jabesh said to him, “Let us alone for seven days, so we may send men with news through the land of Israel. Then, if there is no one to save us, we will give ourselves up to you.” "},{"num":4,"verse":"The men came to Gibeah of Saul and told the news to the people. And all the people cried with a loud voice."},{"num":5,"verse":"Now Saul was coming from the field behind the cattle, and he said, “What troubles the people? Why are they crying?” So they told him the news the men had brought from Jabesh. "},{"num":6,"verse":"The Spirit of God came upon Saul with power when he heard this news, and he became very angry. "},{"num":7,"verse":"He took two bulls and cut them in pieces and sent them through the land of Israel with the men who had brought the news, saying, “This will be done to the bulls of those who will not come out after Saul and Samuel.” The fear of the Lord came upon the people, and they all came out together. "},{"num":8,"verse":"Saul numbered them at Bezek. There were 300,000 men of Israel, and 30,000 men of Judah. "},{"num":9,"verse":"They said to the men who had brought the news, “Tell the men of Jabesh-gilead that tomorrow, by the time the sun is hot, you will have help.” So the men went and told the news to the men of Jabesh, and they were glad. "},{"num":10,"verse":"Then the men of Jabesh said, “Tomorrow we will give ourselves up to you. And you may do to us whatever you think is good.” "},{"num":11,"verse":"The next morning, Saul put the people in three groups. They came among the tents early in the morning and killed the Ammonites until the heat of the day. Those who were left alive were divided, so that no two of them stayed together."},{"num":12,"verse":"Then the people said to Samuel, “Who is it that said, ‘Should Saul rule over us?’ Bring the men, that we may put them to death.” "},{"num":13,"verse":"But Saul said, “No man will be put to death this day. For today the Lord has saved Israel.”"},{"num":14,"verse":"Samuel said to the people, “Come, let us go to Gilgal and make it the place for the king.” "},{"num":15,"verse":"So all the people went to Gilgal. There they made Saul king before the Lord, in Gilgal. There they gave peace gifts to the Lord. And there Saul and all the men of Israel were filled with much joy."}]