[{"num":19,"verse":"The burden of Egypt. Lo! the Lord shall ascend on a light cloud, and he shall enter into Egypt; and the simulacra of Egypt shall be moved from his face, and the heart of Egypt shall fail in the midst thereof. (The burden of Egypt. Lo! the Lord shall ride upon a swift moving cloud, and he shall enter into Egypt; and the idols of Egypt shall tremble before him, and the heart, or the courage, of Egypt shall fail in its midst.)"},{"num":2,"verse":"And I shall make (some) Egyptians to run together against (other) Egyptians, and a man shall fight against his brother, and a man against his friend, a city against a city, and a realm against a realm (and a kingdom against a kingdom)."},{"num":3,"verse":"And the spirit of Egypt shall be broken in the entrails thereof, and I shall cast down the counsel thereof; and they shall ask their simulacra (and they shall ask their idols), and their false diviners, and their men that have unclean spirits speaking in the womb, and their diviners by sacrifices made on altars to fiends."},{"num":4,"verse":"And I shall betake Egypt into the hand of cruel lords, and a strong king shall be lord of them, saith the Lord God of hosts. (And I shall deliver Egypt into the hands of cruel lords, or cruel masters, and a strong king shall be lord over them, saith the Lord God of hosts.)"},{"num":5,"verse":"And [the] water of the sea shall wax dry, and the flood shall be desolate, and shall be dried. (And the water of the River shall grow dry, yea the River shall become desolate, and dried up.)"},{"num":6,"verse":"And the floods shall fail, and the strands of the fields shall be made thin, and shall be dried; a reed and spire shall fade (away). (And the rivers shall fail, and the streams of the fields shall be made shallow, and shall be dried up; the reed and the bulrush shall fade away.)"},{"num":7,"verse":"The bottom of water shall be made naked, and streams from their well(s); and the moist place of all seed shall be dried, it shall wax dry, and it shall not be. (The bottom of the waters shall be uncovered, yea, of all the streams from the wells; and all the seeds on the river banks shall dry up, yea, they shall grow dry, and they shall be no more.)"},{"num":8,"verse":"And [the] fishers shall mourn, and all that cast hook into the flood shall wail; and they that spread abroad a net on the face of waters shall fade (away). (And the fishermen shall mourn, and all who cast a hook into the River shall wail; and they who spread abroad a net upon the face of the waters shall fade away.)"},{"num":9,"verse":"They shall be shamed, that wrought flax (who work the flax), folding and ordaining subtle things."},{"num":10,"verse":"And the water places thereof shall be dry (And the places of water there shall dry up); (and) all that made ponds to take fishes, shall be shamed."},{"num":11,"verse":"The fond princes of Tanis (The foolish leaders of Zoan), the wise counsellors of Pharaoh, gave unwise counsel; how shall ye say to Pharaoh, I am the son of wise men, the son of eld kings?"},{"num":12,"verse":"Where be now thy wise men? Tell they to thee, and show they, what the Lord of hosts thought on Egypt. (Where be thy wise men now? Tell they to thee, and show they, what the Lord of hosts thought about Egypt.)"},{"num":13,"verse":"The princes of Tanis be made fools; the princes of Memphis faded; they deceived Egypt, a corner(stone) of the peoples thereof. (The leaders of Zoan be made fools; the leaders of Noph faded away; they deceived Egypt, yea, the chieftains of the peoples there.)"},{"num":14,"verse":"The Lord meddled a spirit of error in the midst thereof; and they made Egypt for to err in all his work, as a drunken man and spewing erreth. (The Lord mixed in a spirit of error in its midst; and so the leaders made Egypt to err in all its ways and works, like a drunken man who wandereth about in his own spewing, or his own vomit.)"},{"num":15,"verse":"And work shall not be to Egypt, that it make an head and tail bowing and refraining. (And there shall not be work in Egypt, not for head nor tail, nor for the palm tree or the bulrush.)"},{"num":16,"verse":"In that day Egypt shall be as (weak as) women, and they shall be astonied, and shall dread of the face of the moving of the hand of the Lord of hosts, which he moved on it. (On that day the Egyptians shall become as weak as women, and they shall be astonished, and they shall fear the moving of the hand of the Lord of hosts, which he shall move against them.)"},{"num":17,"verse":"And the land of Judah shall be to Egypt into dread; each that shall think on it, shall dread of the face of the counsel of the Lord of hosts, which he thought on it. (And the land of Judah shall be feared by the Egyptians; and everyone who shall think about it, shall fear the counsel of the Lord of hosts, which he hath thought against them.)"},{"num":18,"verse":"In that day five cities shall be in the land of Egypt, and shall speak with the tongue of Canaan, and shall swear by the Lord of hosts; the city of the sun shall be called one. (On that day five cities shall be in the land of Egypt, and they shall speak with the tongue of Canaan, and shall swear by the Lord of hosts; one shall be called The city of the sun, or Heliopolis.)"},{"num":19,"verse":"In that day the altar of the Lord shall be in the midst of the land of Egypt, and the title of the Lord shall be beside the end thereof; (On that day the altar of the Lord shall be in the midst of the land of Egypt, and the pillar of the Lord shall be there at the border;)"},{"num":20,"verse":"and it shall be into a sign and witnessing to the Lord of hosts, in the land of Egypt. For they shall cry to the Lord from the face of the troubler, and he shall send a saviour to them, and a for-fighter, that shall deliver them. (and it shall be a sign and a witness to the Lord of hosts, in the land of Egypt. And when they shall cry to the Lord in the face of the troubler, he shall send a saviour to them, a fighter for them, who shall save them.)"},{"num":21,"verse":"And the Lord shall be known of Egypt, and Egyptians shall know the Lord in that day; and they shall worship him in sacrifices and gifts, and they shall make vows to the Lord, and they shall pay. (And the Lord shall make himself known to the Egyptians, and the Egyptians shall acknowledge the Lord on that day; and they shall worship him with sacrifices and gifts, and they shall make vows to the Lord, and they shall pay them.)"},{"num":22,"verse":"And the Lord shall smite Egypt with a wound, and (then) shall make it whole; and [the] Egyptians shall turn again to the Lord, and he shall be pleased in them, and he shall make them whole. (And the Lord shall strike Egypt with a wound, and then shall make it whole; and the Egyptians shall return to the Lord, and he shall be pleased with them, and he shall make them whole.)"},{"num":23,"verse":"In that day a way shall be from Egypt into Assyrians, and Egyptians shall serve Assur; and Assur shall enter into Egypt, and Egypt into Assyrians. (On that day there shall be a highway from Egypt to Assyria, and the Assyrians shall go to Egypt, and the Egyptians shall go to Assyria, and the Egyptians shall worship with the Assyrians.)"},{"num":24,"verse":"In that day Israel shall be the third to Egypt and to Assur, the blessing in the middle of [the] earth; (On that day Israel shall be the third with Egypt and Assyria, and shall be a blessing in the middle of the world;)"},{"num":25,"verse":"whom the Lord of hosts blessed, saying, Blessed be my people of Egypt, and the work of mine hands be to Assyrians; but mine heritage be to Israel. (whom the Lord of hosts shall bless, saying, Blessed be my peoples of Egypt, and of Assyria, the work of my hands; and my inheritance Israel, yea, my possession.)"}]