[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 24:61",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:61",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And her damsels — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems then, when she went to the well for water, it was not because she had no servants at command, but because she took pleasure in these instances of humanity and industry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:54-67 Abraham's servant, as one that chose his work before his pleasure, was for hastening home. Lingering and loitering no way become a wise and good man who is faithful to his duty. As children ought not to marry without their parents' consent, so parents ought not to marry them without their own. Rebekah consented, not only to go, but to go at once. The goodness of Rebekah's character shows there was nothing wrong in her answer, though it be not agreeable to modern customs among us. We may hope that she had such an idea of the religion and godliness in the family she was to go to, as made her willing to forget her own people and her father's house. Her friends dismiss her with suitable attendants, and with hearty good wishes. They blessed Rebekah. When our relations are entering into a new condition, we ought by prayer to commend them to the blessing and grace of God. Isaac was well employed when he met Rebekah. He went out to take the advantage of a silent evening, and a solitary place, for meditation and prayer; those divine exercises by which we converse with God and our own hearts. Holy souls love retirement; it will do us good to be often alone, if rightly employed; and we are never less alone than when alone. Observe what an affectionate son Isaac was: it was about three years since his mother died, and yet he was not, till now, comforted. See also what an affectionate husband he was to his wife. Dutiful sons promise fair to be affectionate husbands; he that fills up his first station in life with honour, is likely to do the same in those that follow.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The servant's return with Rebekah. So plain an interposition of Providence admits of no refusal on the part of those who revere the Lord. Bethuel now appears as a concurring party. Laban, as the full brother of Rebekah, has a voice in the disposal of her hand; but the father only has the power to ratify the contract. The patriarch's servant first bows in acknowledgment to the Lord, who had now manifested his approval of the choice he had made, and then proceeds to distribute costly gifts to the bride, and to her brother and mother. Now at length the thankful guest partakes of the fare set before him along with his entertainers, and after the night's repose requests to be dismissed. \"A few days;\" perhaps a week or ten days. The mother and brother naturally plead for a little time to prepare for parting with Rebekah. They could not expect the servant, however, to stay months.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Inquire at her mouth.\" This is the only free choice in the matter that seems to be given to Rebekah. Her consent may have been modestly indicated, before her family ratified the contract. It is plain, however, that it was thought proper that the parents should receive and decide upon a proposal of marriage. The extent to which the maiden's inclinations would be consulted would depend very much on the custom of the country, and the intelligence and good feeling of the parents. In later times the custom became very arbitrary. Rebekah's decision shows that she concurred in the consent of her relatives. \"And her nurse.\" Her name, we learn afterward Genesis 35:8, was Deborah. The nurse accompanied the bride as her confidential adviser and faithful attendant, and died in her service; a beautiful trait of ancient manners. The blessing consists in a boundless offspring, and the upper hand over their enemies. These are indicative of a thin population, and a comparatively rude state of society. \"And her damsels.\" We here learn, again, incidentally, that Rebekah had more female attendants than her nurse.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Inquire at her mouth.\" This is the only free choice in the matter that seems to be given to Rebekah. Her consent may have been modestly indicated, before her family ratified the contract. It is plain, however, that it was thought proper that the parents should receive and decide upon a proposal of marriage. The extent to which the maiden's inclinations would be consulted would depend very much on the custom of the country, and the intelligence and good feeling of the parents. In later times the custom became very arbitrary. Rebekah's decision shows that she concurred in the consent of her relatives. \"And her nurse.\" Her name, we learn afterward ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was Deborah. The nurse accompanied the bride as her confidential adviser and faithful attendant, and died in her service; a beautiful trait of ancient manners. The blessing consists in a boundless offspring, and the upper hand over their enemies. These are indicative of a thin population, and a comparatively rude state of society. \"And her damsels.\" We here learn, again, incidentally, that Rebekah had more female attendants than her nurse.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "53. And the servant brought forth jewels of silver, and … gold—These are the usual articles, with money, that form a woman's dowry among the pastoral tribes. Rebekah was betrothed and accompanied the servant to Canaan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Rebekah arose, and her damsels,.... Her maids that were given her by her parents to wait upon her, as was usual in those times and countries: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they rode upon the camels; that Abraham's servant had brought with him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and followed the man; who rode before and directed the way; the sense is only, that she went along with him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the servant took Rebekah, and went his way; took her under his care, and to be the wife of his master's son, at the hands of her friends, and then set forward on his journey. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the servant took Rebekah, and went his way; took her under his care, and to be the wife of his master's son, at the hands of her friends, and then set forward on his journey. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Rebekah arose, and her damsels, and they rode upon the camels, and followed the man: and the servant took Rebekah, and went his way.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her damsels",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rebekah took attendants with her besides the nurse mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 24:59",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:59",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 24:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 61.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Rebekah arose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (expressive of the promptitude, celerity, and decision of her departure), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and her damsels,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - probably a company, at least two, though Laban afterwards only gave each of his daughters one (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:24, 29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and they rode upon camels",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (most likely those which Abraham's servant had brought), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and followed the man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (not in fear, but in hope): ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and the servant took",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in the sense of undertook the charge of) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Rebekah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (who, in his eyes, would now he invested with additional charms, as his young master's intended bride), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and went his way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - returning by the road he came. Genesis 24:61",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the caravan arrived in Canaan with Rebekah and her maidens, Isaac had just come from going to the well Lahai-Roi (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as he was then living in the south country; and he went towards evening (ערב לפנות, at the turning, coming on, of the evening, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the field \"to meditate.\" It is impossible to determine whether Isaac had been to the well of Hagar which called to mind the omnipresence of God, and there, in accordance with his contemplative character, had laid the question of his marriage before the Lord (Delitzsch), or whether he had merely travelled thither to look after his flocks and herds (Knobel). But the object of his going to the field to meditate, was undoubtedly to lay the question of his marriage before God in solitude. שׂוּח, meditari, is rendered \"to pray\" in the Chaldee, and by Luther and others, with substantial correctness. The caravan arrived at the time; and Rebekah, as soon as she saw the man in the field coming to meet them, sprang (נפל signifying a hasty descent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the camel to receive him, according to Oriental custom, in the most respectful manner. She then inquired the name of the man; and as soon as she heard that it was Isaac, she enveloped herself in her veil, as became a bride when meeting the bridegroom. צעיף, θέπιστρον, the cloak-like veil of Arabia (see my Archologie, 103, 5). The servant then related to Isaac the result of his journey; and Isaac conducted the maiden, who had been brought to him by God, into the tent of Sarah his mother, and she became his wife, and he loved her, and was consoled after his mother, i.e., for his mother's death. האהלה, with ה local, in the construct state, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; and in addition to that, with the article prefixed (cf. Ges. Gram. 110, 2bc). ",
        "children": []
      }
    ]
  }
]