[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(63) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To meditate.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Many Jewish commentators translate ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to pray, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and derive one of the three Jewish forms of prayer from this act of Isaac. But though the verb is rare, the substantive is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of religious meditation; and this sense well agrees with the whole character of the calm, peaceful Isaac, already marked out as the type of the Lamb dumb before His slayers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 24:63",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:63",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He went out to meditate ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(or pray) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the field at the even-tide — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Some think he expected his servants about this time, and went out on purpose to meet them. But it should seem he went out to take the advantage of a silent evening, and a solitary field, for meditation and prayer. Our walks in the field are then truly pleasant, when in them we apply ourselves to meditation and prayer: we there have a free and open prospect of the heavens above us, and the earth around us, and the hosts and riches of both, by the view of which we should be led to the contemplation of the Maker and Owner of all. Merciful providences are then doubly comfortable, when they find us in the way of our duty. It is probable Isaac was now praying for good success in this affair, and meditating upon that which was proper to encourage his hope in God concerning it; and now, when he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sets himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it were, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon his watchtower, to see what God would answer him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sees the camels coming.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 24:64-65. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:64-65",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "She lighted off her camel, and took a veil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — In token of humility, modesty, and subjection. The bride was wont to be veiled when she was introduced to her husband. Among the Arabs the women never appear in public without veils.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:54-67 Abraham's servant, as one that chose his work before his pleasure, was for hastening home. Lingering and loitering no way become a wise and good man who is faithful to his duty. As children ought not to marry without their parents' consent, so parents ought not to marry them without their own. Rebekah consented, not only to go, but to go at once. The goodness of Rebekah's character shows there was nothing wrong in her answer, though it be not agreeable to modern customs among us. We may hope that she had such an idea of the religion and godliness in the family she was to go to, as made her willing to forget her own people and her father's house. Her friends dismiss her with suitable attendants, and with hearty good wishes. They blessed Rebekah. When our relations are entering into a new condition, we ought by prayer to commend them to the blessing and grace of God. Isaac was well employed when he met Rebekah. He went out to take the advantage of a silent evening, and a solitary place, for meditation and prayer; those divine exercises by which we converse with God and our own hearts. Holy souls love retirement; it will do us good to be often alone, if rightly employed; and we are never less alone than when alone. Observe what an affectionate son Isaac was: it was about three years since his mother died, and yet he was not, till now, comforted. See also what an affectionate husband he was to his wife. Dutiful sons promise fair to be affectionate husbands; he that fills up his first station in life with honour, is likely to do the same in those that follow.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaac receives his bride. He had been at Beer-lahai-roi, the scene of the interview of Hagar with the angel of the Lord - a spot calculated to awaken thoughts of an overruling Providence. \"To meditate.\" This is a characteristic of Isaac's retiring, contemplative mood. Abraham was the active, authoritative father; Isaac was the passive, submissive son. To meditate was to hold converse with his own thoughts, to ponder on the import of that never-to-be-forgotten scene when he was laid on the altar by a father's hand, and a ram caught in the thicket became his substitute, and to pour out his soul unto the God of his salvation. In this hour of his grave reflection comes his destined bride with her faithful escort upon his view. Rebekah lights off the camel. Doubtless the conversation by the way with the elder of Abraham's house had made her aware of their approach to the residence of her future husband.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She concludes at once that this must be he, and, alighting, asks if it be. On being informed by the servant that this is his young master, she puts on the veil, which covers the head, and hangs down gracefully both behind and before. The aged servant reports the success of his mission, and presents Rebekah. Isaac brings his cousin's daughter into the apartments formerly occupied by his mother, and accepts her as his wife. The formalities of the interview, and of her presentation to Abraham as his daughter-in-law, are all untold. \"And he loved her.\" This is the first mention of the social affections. It comes in probably because Isaac had not before seen his bride, and now felt his heart drawn toward her, when she was presented to his view. All things were evidently done in the fear of God, as became those who were to be the progenitors of the seed of promise. We have here a description of the primeval marriage. It is a simple taking of a woman for a wife before all witnesses, and with suitable feelings and expression of reverence toward God, and of desire for his blessing. It is a pure and holy relation, reaching back into the realms of innocence, and fit to be the emblem of the humble, confiding, affectionate union between the Lord and his people. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Death of Abraham",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. קטוּרה  qeṭûrâh, \"Qeturah, incense.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. זמרן  zı̂mrān, \"Zimran, celebrated in song.\" יקשׁן  yāqshān, \"Joqshan, fowler.\" מדן  medān, \"Medan, judge.\" מדין  mı̂dyān, \"Midian, one who measures.\" לאבק  yı̂shbāq, \"Jishbaq, he leaves.\" שׁוּח  shûach, \"Shuach, pit.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. לטוּשׁם  leṭûshı̂ym, \"Letushim, hammered, sharpened.\" לאמים  le'umı̂ym, \"Leummim, peoples.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. עיפה  ‛êypâh, \"'Ephah, darkness.\" עפר  ‛êper, \"'Epher, dust.\" אבידע  'ǎbı̂ydā‛, \"Abida', father of knowledge.\" אלדעה  'eldā‛âh, \"Elda'ah, knowing?\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Another family is born to Abraham by Keturah, and portioned off, after which he dies and is buried.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Another family is born to Abraham by Keturah, and portioned off, after which he dies and is buried.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "53. And the servant brought forth jewels of silver, and … gold—These are the usual articles, with money, that form a woman's dowry among the pastoral tribes. Rebekah was betrothed and accompanied the servant to Canaan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To meditate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to converse with God, and with himself, by pious and profitable thoughts and ejaculations, and fervent prayers, as for other things, so particularly for God’s blessing upon this great affair, and so his prayers are eminently answered. He chooseth a solitary place, wherein he might more freely attend upon God without any interruption or distraction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in the field at the eventide; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that as he had begun the day with God, so he might close it with him, and commit himself to his protection. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 55:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Isaac went out to meditate in the field at eventide,.... Both the time and place were very proper for meditation: the place, \"in the field\": where he might view the works of nature, and be led to the Creator of them, and the praise of him, and where he might be alone, and nothing to disturb his thoughts: and the time, \"at evening\"; after the labour, care, and hurry of the day were over, and before repose at night, and when the air was cool and refreshing, and everything was assisting to, and served to compose the mind, and help thought and contemplation. Onkelos and Jonathan render the word \"to pray\", and the time and place he chose were very fit for that service; and perhaps his thoughts in prayer might be directed to, and greatly employed in desiring success to his father's servant in the business he was gone on his account, and that he might safely and speedily arrive, and if so, his prayers were quickly answered: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he lifted up his eyes, and saw, and, behold, the camels were coming; which his servant had took with him in his journey, and was now returning with them, and which Isaac knew full well. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he lifted up his eyes, and saw, and, behold, the camels were coming; which his servant had took with him in his journey, and was now returning with them, and which Isaac knew full well. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Isaac went out to {e} meditate in the field at the eventide: and he lifted up his eyes, and saw, and, behold, the camels were coming.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Isaac went out to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " meditate in the field at the eventide: and he lifted up his eyes, and saw, and, behold, the camels ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " coming.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) This was the habit of the godly fathers to meditate on God's promises, and to pray for the accomplishment of it. The custom was that the bride was brought to her husband, her head covered, a token of humbleness and purity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to meditate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A strange and poetical word to be used in this context. It has given rise to very various renderings: LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀδολεσχῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad meditandum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Aq. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁμιλῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Sym. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λαλῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Syr. Pesh. “to walk about” (so Gesenius), with a slight variation of the reading. Rashi says the word means “prayer”; Ibn Ezra, “to walk between the shrubs”; Bötticher, “to fetch brushwood.” Many modern scholars, e.g. Knobel, Ewald, Strack, and Gunkel, render “to wail,” or “lament,” comparing the use of the same word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“moan”), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 142:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“complaint”); and doubtless this rendering has the merit of agreeing with the mention of Isaac’s need of being comforted (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 24:67",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:67",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As the servant does not bring Rebekah to Abraham, there is good reason for the conjecture that Abraham’s death had occurred.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 63.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Isaac went out to meditate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לָשׂוּח",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to think (LXX., Vulgate, Murphy, Kalisch); to pray (Onkelos, Samaritan, Kimchi, Luther, Keil); to lament (Knobel, Lange); doubtless to do all three, to commune with his heart and before God; not, however, about agricultural affairs, or the improvement of his property (Knobel), but concerning his deceased mother, whom he still mourned (ver. 67), though chiefly, it is probable, anent the marriage he contemplated (Keil) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the field at the eventide.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "at the turning of the evening",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and for corresponding phrase, \"when the morning draws on,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he lifted up his eyes, and saw, and, behold, the camels were coming.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The bride's first glimpse of her intended spouse being, with artless simplicity though with dramatic picturesqueness, described in similar terms. Genesis 24:63",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the caravan arrived in Canaan with Rebekah and her maidens, Isaac had just come from going to the well Lahai-Roi (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as he was then living in the south country; and he went towards evening (ערב לפנות, at the turning, coming on, of the evening, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the field \"to meditate.\" It is impossible to determine whether Isaac had been to the well of Hagar which called to mind the omnipresence of God, and there, in accordance with his contemplative character, had laid the question of his marriage before the Lord (Delitzsch), or whether he had merely travelled thither to look after his flocks and herds (Knobel). But the object of his going to the field to meditate, was undoubtedly to lay the question of his marriage before God in solitude. שׂוּח, meditari, is rendered \"to pray\" in the Chaldee, and by Luther and others, with substantial correctness. The caravan arrived at the time; and Rebekah, as soon as she saw the man in the field coming to meet them, sprang (נפל signifying a hasty descent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the camel to receive him, according to Oriental custom, in the most respectful manner. She then inquired the name of the man; and as soon as she heard that it was Isaac, she enveloped herself in her veil, as became a bride when meeting the bridegroom. צעיף, θέπιστρον, the cloak-like veil of Arabia (see my Archologie, 103, 5). The servant then related to Isaac the result of his journey; and Isaac conducted the maiden, who had been brought to him by God, into the tent of Sarah his mother, and she became his wife, and he loved her, and was consoled after his mother, i.e., for his mother's death. האהלה, with ה local, in the construct state, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; and in addition to that, with the article prefixed (cf. Ges. Gram. 110, 2bc). ",
        "children": []
      }
    ]
  }
]