[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(65) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She took a vail, and·covered herself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Brides are usually taken to the bridegroom enveloped in a vail, which covers the whole body, and is far larger than that ordinarily worn. At the present time the bride-vail is usually red, the ordinary vail blue or white. By wrapping herself in this vail Rebekah notified that she was the bride. After marriage it was seldom worn at this early period, and so both the Egyptians and Abimelech saw Sarah’s beauty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:54-67 Abraham's servant, as one that chose his work before his pleasure, was for hastening home. Lingering and loitering no way become a wise and good man who is faithful to his duty. As children ought not to marry without their parents' consent, so parents ought not to marry them without their own. Rebekah consented, not only to go, but to go at once. The goodness of Rebekah's character shows there was nothing wrong in her answer, though it be not agreeable to modern customs among us. We may hope that she had such an idea of the religion and godliness in the family she was to go to, as made her willing to forget her own people and her father's house. Her friends dismiss her with suitable attendants, and with hearty good wishes. They blessed Rebekah. When our relations are entering into a new condition, we ought by prayer to commend them to the blessing and grace of God. Isaac was well employed when he met Rebekah. He went out to take the advantage of a silent evening, and a solitary place, for meditation and prayer; those divine exercises by which we converse with God and our own hearts. Holy souls love retirement; it will do us good to be often alone, if rightly employed; and we are never less alone than when alone. Observe what an affectionate son Isaac was: it was about three years since his mother died, and yet he was not, till now, comforted. See also what an affectionate husband he was to his wife. Dutiful sons promise fair to be affectionate husbands; he that fills up his first station in life with honour, is likely to do the same in those that follow.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaac receives his bride. He had been at Beer-lahai-roi, the scene of the interview of Hagar with the angel of the Lord - a spot calculated to awaken thoughts of an overruling Providence. \"To meditate.\" This is a characteristic of Isaac's retiring, contemplative mood. Abraham was the active, authoritative father; Isaac was the passive, submissive son. To meditate was to hold converse with his own thoughts, to ponder on the import of that never-to-be-forgotten scene when he was laid on the altar by a father's hand, and a ram caught in the thicket became his substitute, and to pour out his soul unto the God of his salvation. In this hour of his grave reflection comes his destined bride with her faithful escort upon his view. Rebekah lights off the camel. Doubtless the conversation by the way with the elder of Abraham's house had made her aware of their approach to the residence of her future husband.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She concludes at once that this must be he, and, alighting, asks if it be. On being informed by the servant that this is his young master, she puts on the veil, which covers the head, and hangs down gracefully both behind and before. The aged servant reports the success of his mission, and presents Rebekah. Isaac brings his cousin's daughter into the apartments formerly occupied by his mother, and accepts her as his wife. The formalities of the interview, and of her presentation to Abraham as his daughter-in-law, are all untold. \"And he loved her.\" This is the first mention of the social affections. It comes in probably because Isaac had not before seen his bride, and now felt his heart drawn toward her, when she was presented to his view. All things were evidently done in the fear of God, as became those who were to be the progenitors of the seed of promise. We have here a description of the primeval marriage. It is a simple taking of a woman for a wife before all witnesses, and with suitable feelings and expression of reverence toward God, and of desire for his blessing. It is a pure and holy relation, reaching back into the realms of innocence, and fit to be the emblem of the humble, confiding, affectionate union between the Lord and his people. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Death of Abraham",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. קטוּרה  qeṭûrâh, \"Qeturah, incense.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. זמרן  zı̂mrān, \"Zimran, celebrated in song.\" יקשׁן  yāqshān, \"Joqshan, fowler.\" מדן  medān, \"Medan, judge.\" מדין  mı̂dyān, \"Midian, one who measures.\" לאבק  yı̂shbāq, \"Jishbaq, he leaves.\" שׁוּח  shûach, \"Shuach, pit.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. לטוּשׁם  leṭûshı̂ym, \"Letushim, hammered, sharpened.\" לאמים  le'umı̂ym, \"Leummim, peoples.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. עיפה  ‛êypâh, \"'Ephah, darkness.\" עפר  ‛êper, \"'Epher, dust.\" אבידע  'ǎbı̂ydā‛, \"Abida', father of knowledge.\" אלדעה  'eldā‛âh, \"Elda'ah, knowing?\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Another family is born to Abraham by Keturah, and portioned off, after which he dies and is buried.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Another family is born to Abraham by Keturah, and portioned off, after which he dies and is buried.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "65. she took a veil, and covered herself—The veil is an essential part of female dress. In country places it is often thrown aside, but on the appearance of a stranger, it is drawn over the face, as to conceal all but the eyes. In a bride it was a token of her reverence and subjection to her husband.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In token of modesty, reverence, and subjection. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 20:16 1 Corinthians 11:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For she had said unto the servant,.... As soon as she saw a man walking towards them, who she thought with herself might be Isaac: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what man is this that walketh in the field to meet us? for by the course he steered, she perceived that he was coming towards them, and so concluded it must be one of the family, and probably the person she was to be married to; for otherwise, had he not by his look and motion discovered that he knew the servant, and was coming towards them, she would have took no notice of him ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the servant had said, it is my master: meaning not Abraham, but his son, who also was his master: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore she took a veil, and covered herself; both out of modesty, and as a token of subjection to him: for the veil was put on when the bride was introduced to the bridegroom, as among the Romans (x) in later times. The Arab women always have veils when they appear in public, so that their faces cannot be seen; and though in the summer months they walk abroad with less caution, yet then, upon the approach of a stranger, they put on their veils (y). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Vid. Lucan. l. 2. & Martial. Epigr. l. 2. 74. (y) See Shaw's Travels, p. 228. Tertullian. de Virgin. Veland, c. 17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Vid. Lucan. l. 2. & Martial. Epigr. l. 2. 74. (y) See Shaw's Travels, p. 228. Tertullian. de Virgin. Veland, c. 17. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For she had said unto the servant, What man is this that walketh in the field to meet us? And the servant had said, It is my master: therefore she took a vail, and covered herself.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "65",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is my master",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Referring to Isaac. The expression favours the suggestion that, according to the original version of the story, Abraham’s death had been mentioned after ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 24:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note); the servant’s master was no longer Abraham.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "took her veil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] According to Oriental custom the bride was brought veiled into the presence of the bridegroom: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 65.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For she had said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and she said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not before, but after alighting) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "unto the servant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of Abraham), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What man is this that walketh in the field to meet us?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Isaac having obviously hastened forward to give a welcome to his bride. On learning who it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "she took a veil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - \"the cloak-like veil of Arabia\" (Keil), which covers not merely the face, but, \"like a kind of large wrapper, nearly the whole form, rendering it impossible to recognize the person\" (Kalisch) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and covered herself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That married ladies did not always use the veil when traveling appears from the case of Sarah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but that brides did not discover their faces to their intended husbands until after marriage may be inferred from the case of Leah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:23, 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus modestly attired, she meekly yields herself to one whom she had never before seen, in the confident persuasion that so Jehovah willed. Genesis 24:65",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the caravan arrived in Canaan with Rebekah and her maidens, Isaac had just come from going to the well Lahai-Roi (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as he was then living in the south country; and he went towards evening (ערב לפנות, at the turning, coming on, of the evening, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the field \"to meditate.\" It is impossible to determine whether Isaac had been to the well of Hagar which called to mind the omnipresence of God, and there, in accordance with his contemplative character, had laid the question of his marriage before the Lord (Delitzsch), or whether he had merely travelled thither to look after his flocks and herds (Knobel). But the object of his going to the field to meditate, was undoubtedly to lay the question of his marriage before God in solitude. שׂוּח, meditari, is rendered \"to pray\" in the Chaldee, and by Luther and others, with substantial correctness. The caravan arrived at the time; and Rebekah, as soon as she saw the man in the field coming to meet them, sprang (נפל signifying a hasty descent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the camel to receive him, according to Oriental custom, in the most respectful manner. She then inquired the name of the man; and as soon as she heard that it was Isaac, she enveloped herself in her veil, as became a bride when meeting the bridegroom. צעיף, θέπιστρον, the cloak-like veil of Arabia (see my Archologie, 103, 5). The servant then related to Isaac the result of his journey; and Isaac conducted the maiden, who had been brought to him by God, into the tent of Sarah his mother, and she became his wife, and he loved her, and was consoled after his mother, i.e., for his mother's death. האהלה, with ה local, in the construct state, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; and in addition to that, with the article prefixed (cf. Ges. Gram. 110, 2bc). ",
        "children": []
      }
    ]
  }
]