[{"header":"Jesus Rises from Death"},{"num":16,"verse":"The day after the Sabbath day, Mary Magdalene, Mary the mother of James, and Salome bought some sweet-smelling spices to put on Jesus’ body. "},{"num":2,"verse":"Very early on that day, the first day of the week, the women were on their way to the tomb. It was soon after sunrise. "},{"num":3,"verse":"They said to each other, “There is a large stone covering the entrance of the tomb. Who will move the stone for us?”"},{"num":4,"verse":"Then the women looked and saw that the stone was already moved. The stone was very large, but it was moved away from the entrance. "},{"num":5,"verse":"The women entered the tomb and saw a young man wearing a white robe. He was sitting on the right side, and the women were afraid."},{"num":6,"verse":"But the man said, “Don’t be afraid. You are looking for Jesus from Nazareth, the one who was killed on a cross. He has risen from death. He is not here. Look, here is the place they laid him. "},{"num":7,"verse":"Now go and tell his followers and Peter, ‘Jesus is going into Galilee. He will be there before you. You will see him there as he told you before.’”"},{"num":8,"verse":"The women were confused and shaking with fear. They left the tomb and ran away. They did not tell anyone about what happened, because they were afraid."},{"header":"Some Followers See Jesus"},{"num":9,"verse":"Jesus rose from death early on the first day of the week. He showed himself first to Mary Magdalene. One time in the past, he had forced seven demons to leave Mary. "},{"num":10,"verse":"After Mary saw Jesus, she went and told his followers. They were very sad and were crying. "},{"num":11,"verse":"But Mary told them that Jesus was alive. She said that she had seen him, but the followers did not believe her."},{"num":12,"verse":"Later, Jesus showed himself to two of his followers while they were walking in the country. But Jesus did not look the same as before. "},{"num":13,"verse":"These followers went back to the others and told them what had happened. Again, the followers did not believe them."},{"header":"Jesus Talks to the Apostles"},{"num":14,"verse":"Later Jesus showed himself to the 11 followers while they were eating. He criticized them because they had little faith. They were stubborn and refused to believe those who had seen him after he had risen from death."},{"num":15,"verse":"Jesus said to the followers, “Go everywhere in the world. Tell the Good News to everyone. "},{"num":19,"verse":"After the Lord Jesus said these things to the followers, he was carried up into heaven. There, Jesus sat at the right side of God. "},{"num":20,"verse":"The followers went everywhere in the world and told the Good News to people. And the Lord helped them. The Lord proved that the Good News they told was true by giving them power to work miracles."}]