[{"header":"Controlling the Things We Say"},{"num":3,"verse":"My brothers and sisters, not many of you should be teachers. I say this because, as you know, we who teach will be judged more strictly than others."},{"num":2,"verse":"We all make many mistakes. A person who never said anything wrong would be perfect. Someone like that would be able to control their whole body too."},{"num":3,"verse":"We put bits into the mouths of horses to make them obey us. With these bits we can control their whole body."},{"num":4,"verse":"It is the same with ships. A ship is very big, and it is pushed by strong winds. But a very small rudder controls that big ship. And the one who controls the rudder decides where the ship will go. It goes where he wants it to go."},{"num":5,"verse":"It is the same with our tongue. It is a small part of the body, but it can boast about doing great things."},{"num":6,"verse":"The tongue is like a fire. It is a world of evil among the parts of our body. It spreads its evil through our whole body and starts a fire that influences all of life. It gets this fire from hell."},{"num":7,"verse":"Humans have control over every kind of wild animal, bird, reptile, and fish, and they have controlled all these things."},{"num":8,"verse":"But no one can control the tongue. It is wild and evil, full of deadly poison."},{"num":9,"verse":"We use our tongues to praise our Lord and Father, but then we curse people who were created in God’s likeness."},{"num":10,"verse":"These praises and curses come from the same mouth. My brothers and sisters, this should not happen."},{"num":11,"verse":"Do good water and bad water flow from the same spring? Of course not."},{"num":12,"verse":"My brothers and sisters, can a fig tree make olives? Or can a grapevine make figs? No, and a well full of salty water cannot give good water."},{"header":"True Wisdom"},{"num":13,"verse":"Are there any among you who are really wise and understanding? Then you should show your wisdom by living right. You should do what is good with humility. A wise person does not boast."},{"num":14,"verse":"If you are selfish and have bitter jealousy in your hearts, you have no reason to boast. Your boasting is a lie that hides the truth."},{"num":15,"verse":"That kind of “wisdom” does not come from God. That “wisdom” comes from the world. It is not spiritual. It is from the devil."},{"num":16,"verse":"Where there is jealousy and selfishness, there will be confusion and every kind of evil."},{"num":17,"verse":"But the wisdom that comes from God is like this: First, it is pure. It is also peaceful, gentle, and easy to please. This wisdom is always ready to help people who have trouble and to do good for others. This wisdom is always fair and honest."},{"num":18,"verse":"People who work for peace in a peaceful way get the blessings that come from right living."}]