[{"num":3,"verse":"¶ My brethren, make not unto yourselves many teachers, knowing that we shall receive the greater condemnation."},{"num":2,"verse":"For we all offend in many things. If any man offends not in word, the same is a perfect man, and able also to govern the whole body with restraint."},{"num":3,"verse":"Behold, we put bits (or restraint) in the horses’ mouths to persuade them, and we govern their whole body."},{"num":4,"verse":"Behold also the ships, which though they are so great are driven of fierce winds, yet they are governed with a very small rudder, wherever the governor desires."},{"num":5,"verse":"In the same manner, the tongue is a very small member and boasts of great things. Behold, how great a forest a little fire kindles!"},{"num":6,"verse":"And the tongue is a fire, a world of iniquity: so is the tongue among our members, that it defiles the whole body and sets on fire the course of our nature; and it is set on fire of hell."},{"num":7,"verse":"For every nature of beasts and of birds and of serpents and of beings in the sea may be tamed and is tamed by mankind,"},{"num":8,"verse":"but no man can tame the tongue, which is an evil that cannot be restrained and is full of deadly poison."},{"num":9,"verse":"With it we bless God, even the Father; and with it we curse men, who are made in the image of God."},{"num":10,"verse":"Out of the same mouth proceeds blessing and cursing. My brethren, these things ought not to be so."},{"num":11,"verse":"Does a fountain send forth at the same place both sweet and bitter water?"},{"num":12,"verse":"Can the fig tree, my brethren, produce olive berries? or the vine, figs? In the same manner no fountain can yield both salt water and fresh."},{"num":13,"verse":"¶ Who is wise and ready among you? let him show out of a good conversation his works in meekness of wisdom."},{"num":14,"verse":"But if ye have bitter envying and strife in your hearts, boast not and do not be liars against the truth."},{"num":15,"verse":"This wisdom is not that which descends from above, but is earthly, natural, diabolical."},{"num":16,"verse":"For where there is envy and contention, there is confusion and every perverse work."},{"num":17,"verse":"But the wisdom that is from above is first pure, then peaceable, modest, benevolent, full of mercy and of good fruits, not judgmental, unfeigned."},{"num":18,"verse":"And the fruit of righteousness is sown in peace unto those that make peace."}]