[{"header":"The Power of the Tongue"},{"num":3,"verse":"My Christian brothers, not many of you should become teachers. If we do wrong, it will be held against us more than other people who are not teachers. "},{"num":2,"verse":"We all make many mistakes. If anyone does not make a mistake with his tongue by saying the wrong things, he is a perfect man. It shows he is able to make his body do what he wants it to do. "},{"num":3,"verse":"We make a horse go wherever we want it to go by a small bit in its mouth. We turn its whole body by this. "},{"num":4,"verse":"Sailing ships are driven by strong winds. But a small rudder turns a large ship whatever way the man at the wheel wants the ship to go."},{"num":5,"verse":"The tongue is also a small part of the body, but it can speak big things. See how a very small fire can set many trees on fire. "},{"num":6,"verse":"The tongue is a fire. It is full of wrong. It poisons the whole body. The tongue sets our whole lives on fire with a fire that comes from hell. "},{"num":7,"verse":"Men can make all kinds of animals and birds and fish and snakes do what they want them to do. "},{"num":8,"verse":"But no man can make his tongue say what he wants it to say. It is sinful and does not rest. It is full of poison that kills. "},{"num":9,"verse":"With our tongue we give thanks to our Father in heaven. And with our tongue we speak bad words against men who are made like God. "},{"num":10,"verse":"Giving thanks and speaking bad words come from the same mouth. My Christian brothers, this is not right! "},{"num":11,"verse":"Does a well of water give good water and bad water from the same place? "},{"num":12,"verse":"Can a fig tree give olives or can a grape-vine give figs? A well does not give both good water and bad water."},{"header":"Wisdom from Above"},{"num":13,"verse":"Who among you is wise and understands? Let that one show from a good life by the things he does that he is wise and gentle. "},{"num":14,"verse":"If you have jealousy in your heart and fight to have many things, do not be proud of it. Do not lie against the truth. "},{"num":15,"verse":"This is not the kind of wisdom that comes from God. But this wisdom comes from the world and from that which is not Christian and from the devil. "},{"num":16,"verse":"Wherever you find jealousy and fighting, there will be trouble and every other kind of wrong-doing. "},{"num":17,"verse":"But the wisdom that comes from heaven is first of all pure. Then it gives peace. It is gentle and willing to obey. It is full of loving-kindness and of doing good. It has no doubts and does not pretend to be something it is not. "},{"num":18,"verse":"Those who plant seeds of peace will gather what is right and good."}]