[{"num":1,"verse":"Dear brothers, don’t be too eager to tell others their faults, for we all make many mistakes; and when we teachers of religion, who should know better, do wrong, our punishment will be greater than it would be for others."},{"num":3,"verse":"We can make a large horse turn around and go wherever we want by means of a small bit in his mouth. "},{"num":4,"verse":"And a tiny rudder makes a huge ship turn wherever the pilot wants it to go, even though the winds are strong."},{"num":5,"verse":"So also the tongue is a small thing, but what enormous damage it can do. A great forest can be set on fire by one tiny spark. "},{"num":6,"verse":"And the tongue is a flame of fire. It is full of wickedness, and poisons every part of the body. And the tongue is set on fire by hell itself and can turn our whole lives into a blazing flame of destruction and disaster."},{"num":7,"verse":"Men have trained, or can train, every kind of animal or bird that lives and every kind of reptile and fish, "},{"num":8,"verse":"but no human being can tame the tongue. It is always ready to pour out its deadly poison. "},{"num":9,"verse":"Sometimes it praises our heavenly Father, and sometimes it breaks out into curses against men who are made like God. "},{"num":10,"verse":"And so blessing and cursing come pouring out of the same mouth. Dear brothers, surely this is not right! "},{"num":11,"verse":"Does a spring of water bubble out first with fresh water and then with bitter water? "},{"num":12,"verse":"Can you pick olives from a fig tree, or figs from a grape vine? No, and you can’t draw fresh water from a salty pool."},{"num":13,"verse":"If you are wise, live a life of steady goodness so that only good deeds will pour forth. And if you don’t brag about them, then you will be truly wise! "},{"num":14,"verse":"And by all means don’t brag about being wise and good if you are bitter and jealous and selfish; that is the worst sort of lie. "},{"num":15,"verse":"For jealousy and selfishness are not God’s kind of wisdom. Such things are earthly, unspiritual, inspired by the devil. "},{"num":16,"verse":"For wherever there is jealousy or selfish ambition, there will be disorder and every other kind of evil."},{"num":17,"verse":"But the wisdom that comes from heaven is first of all pure and full of quiet gentleness. Then it is peace-loving and courteous. It allows discussion and is willing to yield to others; it is full of mercy and good deeds. It is wholehearted and straightforward and sincere. "},{"num":18,"verse":"And those who are peacemakers will plant seeds of peace and reap a harvest of goodness."}]