[{"header":"The Power of Your Words"},{"num":3,"verse":"My dear brothers and sisters, don’t be so eager to become a teacher in the church since you know that we who teach are held to a higher standard of judgment. "},{"num":2,"verse":"We all fail in many areas, but especially with our words. Yet if we’re able to bridle the words we say we are powerful enough to control ourselves in every way, and that means our character is mature and fully developed. "},{"num":3,"verse":"Horses have bits and bridles in their mouths so that we can control and guide their large body. "},{"num":4,"verse":"And the same with mighty ships, though they are massive and driven by fierce winds, yet they are steered by a tiny rudder at the direction of the person at the helm."},{"num":5,"verse":"And so the tongue is a small part of the body yet it carries great power! Just think of how a small flame can set a huge forest ablaze. "},{"num":6,"verse":"And the tongue is a fire! It can be compared to the sum total of wickedness and is the most dangerous part of our human body. It corrupts the entire body and is a hellish flame! It releases a fire that can burn throughout the course of human existence."},{"num":7,"verse":"For every wild animal on earth including birds, creeping reptiles, and creatures of the sea and land have all been overpowered and tamed by humans, "},{"num":8,"verse":"but the tongue is not able to be tamed. It’s a fickle, unrestrained evil that spews out words full of toxic poison! "},{"num":9,"verse":"We use our tongue to praise God our Father and then turn around and curse a person who was made in his very image! "},{"num":10,"verse":"Out of the same mouth we pour out words of praise one minute and curses the next. My brothers and sisters, this should never be!"},{"num":11,"verse":"Would you look for olives hanging on a fig tree or go to pick figs from a grapevine? Is it possible that fresh and bitter water can flow out of the same spring? So neither can a bitter spring produce fresh water."},{"header":"Wisdom from Above"},{"num":13,"verse":"If you consider yourself to be wise and one who understands the ways of God, advertise it with a beautiful, fruitful life guided by wisdom’s gentleness. Never brag or boast about what you’ve done and you’ll prove that you’re truly wise. "},{"num":14,"verse":"But if there is bitter jealousy or competition hiding in your heart, then don’t deny it and try to compensate for it by boasting and being phony. "},{"num":15,"verse":"For that has nothing to do with God’s heavenly wisdom but can best be described as the wisdom of this world, both selfish and devilish. "},{"num":16,"verse":"So wherever jealousy and selfishness are uncovered, you will also find many troubles and every kind of meanness."},{"num":17,"verse":"But the wisdom from above is always pure, filled with peace, considerate and teachable. It is filled with love and never displays prejudice or hypocrisy in any form "},{"num":18,"verse":"and it always bears the beautiful harvest of righteousness! Good seeds of wisdom’s fruit will be planted with peaceful acts by those who cherish making peace."}]