[{"header":"Hushai and Absalom"},{"num":17,"verse":"Then Ahithophel said to Absalom, “Let me choose 12,000 men, and I will leave and go after David tonight. "},{"num":2,"verse":"I will come upon him while he is tired and weak. I will fill him with fear so that all the people who are with him will run away. Then I will kill the king alone "},{"num":3,"verse":"and return all the people to you. All will return if the man you want to kill is dead. Then all the people will be at peace.” "},{"num":4,"verse":"The plan pleased Absalom and all the leaders of Israel."},{"num":5,"verse":"Then Absalom said, “Call Hushai the Archite also. Let us hear what he has to say.” "},{"num":6,"verse":"When Hushai had come to Absalom, Absalom said to him, “Ahithophel has said this. Should we do as he says? If not, tell us.” "},{"num":7,"verse":"So Hushai said to Absalom, “This time what Ahithophel has said to do is not good.” "},{"num":8,"verse":"Hushai said, “You know your father and his men. They are powerful and angry, like a bear robbed of her young ones in the field. And your father is a very able man of war. He will not stay with the people during the night. "},{"num":9,"verse":"He has now hidden himself in one of the caves, or in another place. When some of the people are killed in the first battle, whoever hears it will say, ‘There have been many people killed who follow Absalom.’ "},{"num":10,"verse":"Even the one who has strength of heart like the heart of a lion will be afraid. For all Israel knows that your father is a powerful man, and that those who are with him are men with strength of heart. "},{"num":11,"verse":"But I say that all Israel should be gathered to you, from Dan to Beersheba, as much as the sand by the sea. And you yourself should go into battle. "},{"num":12,"verse":"So we will find David wherever he is. We will fall on him like water falls on the ground in the early morning. And not he or any of the men with him will be left. "},{"num":13,"verse":"If he runs into a city, then all Israel will bring ropes to that city. We will pull it into the valley until not even a small stone is left there.” "},{"num":14,"verse":"Then Absalom and all the men of Israel said, “The words of Hushai the Archite are better than the words of Ahithophel.” In this way the Lord had planned to destroy the good leading of Ahithophel, so He might bring trouble to Absalom."},{"header":"David Is Told to Leave"},{"num":15,"verse":"Hushai said to Zadok and Abiathar the religious leaders, “This is what Ahithophel said that Absalom and the leaders of Israel should do. And this is what I have said they should do. "},{"num":16,"verse":"So be quick to send someone to tell David, ‘Do not stay the night in the desert beside the place where the Jordan is crossed. But cross over, or the king and all the people with him will be destroyed.’” "},{"num":17,"verse":"Now Jonathan and Ahimaaz were staying at Enrogel. And a woman servant would go and tell them, and they would go and tell King David. For they could not be seen coming into the city. "},{"num":18,"verse":"But a boy saw them, and told Absalom. So the two of them left in a hurry and came to the house of a man in Bahurim. He had a well in the open space in the center of his house. And they went down into it. "},{"num":19,"verse":"Then the woman took the covering and spread it over the well’s mouth, and spread grain on it, so nothing was known of it. "},{"num":20,"verse":"Then Absalom’s servants came to the woman at the house and said, “Where are Ahimaaz and Jonathan?” The woman answered, “They have crossed the river.” And after looking and not finding them, they returned to Jerusalem."},{"num":21,"verse":"When they had left, Ahimaaz and Jonathan came up out of the well and went and told King David. They said to David, “Be quick to get ready and cross over the water. For Ahithophel has told them to come against you.” "},{"num":22,"verse":"So David and all the people with him got up and crossed the Jordan. By the light of morning, not one was left who had not crossed the Jordan. "},{"num":23,"verse":"When Ahithophel saw that his words were not followed, he got onto his donkey and went home to his city. He told those of his family what they must do, and he hanged himself. So he died and was buried in his father’s grave."},{"num":24,"verse":"Then David came to Mahanaim. Absalom and all the men of Israel with him crossed the Jordan. "},{"num":25,"verse":"Absalom made Amasa captain of the army instead of Joab. Amasa was the son of a man whose name was Jithra the Israelite, who went in to Nahash’s daughter Abigal, the sister of Joab’s mother Zeruiah. "},{"num":26,"verse":"And Israel and Absalom set up their tents in the land of Gilead."},{"num":27,"verse":"When David had come to Mahanaim, he met Nahash’s son Shobi from Rabbah of the sons of Ammon, Ammiel’s son Machir from Lo-debar, and Barzillai the Gileadite from Rogelim. "},{"num":28,"verse":"They brought him beds, washing pots, dishes, grain, flour, seeds, "},{"num":29,"verse":"honey, sour milk, sheep, and cheese from the cattle, for David and his men to eat. For they said, “The people are hungry and tired and thirsty in the desert.”"}]