[{"num":22,"verse":"Then he showed me the river of the water of life. It was sparkling like crystal, and flowing from the throne of God and of the lamb "},{"num":2,"verse":"through the middle of the street of the city. On either bank of the river was growing the tree of life. It produces twelve kinds of fruit, bearing this fruit every month; and the leaves of the tree are for the healing of the nations. "},{"num":3,"verse":"Nothing accursed is there any more. Rather, the throne of God and of the lamb are in the city, and his servants will worship him; "},{"num":4,"verse":"they will see his face, and his name will be on their foreheads. "},{"num":5,"verse":"There will be no more night, and they will not need the light of a lamp or the light of the sun, because the Lord God will shine on them; and they will reign for ever and ever."},{"num":6,"verse":"‘These words’, he said to me, ‘are trustworthy and true. The Lord, the God of the spirits of the prophets, has sent his angel to show his servants what must soon take place. "},{"num":7,"verse":"Look, I am coming soon. God’s blessing on the one who keeps the words of the prophecy of this book.’"},{"header":"‘I Am Coming Soon!’"},{"num":8,"verse":"I, John, am the one who heard and saw these things. And when I heard them and saw them, I fell down to worship before the feet of the angel who showed them to me. "},{"num":9,"verse":"‘Look! Don’t do that!’ he said to me. ‘I am a fellow-servant with you, and with the other members of your prophetic family, and with those who keep the words of this book. Worship God!"},{"num":10,"verse":"‘Don’t seal up the words of the prophecy of this book,’ he added. ‘The time is near, you see. "},{"num":11,"verse":"Let the unjust go on being unjust, and the filthy go on being filthy – and let the just go on doing justice, and let the holy still be holy."},{"num":12,"verse":"‘Look! I am coming soon. I will bring my reward with me, and I will pay everyone back according to what they have done. "},{"num":13,"verse":"I am the Alpha and the Omega, the first and the last, the beginning and the end.’"},{"num":14,"verse":"God’s blessing on those who wash their clothes, so that they may have the right to eat from the tree of life and may enter the city by its gates. "},{"num":15,"verse":"But the dogs, the sorcerers, the fornicators, the murderers, the idolaters, and everyone who loves to invent lies – they will all be outside."},{"num":16,"verse":"‘I, Jesus, have sent my angel to give you this testimony for the churches. I am David’s root and offspring; I am the bright morning star.’"},{"num":17,"verse":"The spirit and the bride say, ‘Come!’ And let anyone who hears say, ‘Come!’ Let the thirsty come; let anyone who wants the water of life take it freely."},{"num":18,"verse":"I testify to everyone who hears the words of the prophecy of this book: if anyone adds to them, God will add to that person the plagues that are written in this book. "},{"num":19,"verse":"And if anyone takes away from the words of the book of this prophecy, God will take away that person’s share in the tree of life, and in the holy city, which are described in this book."},{"num":20,"verse":"The one who gives this testimony says, ‘Yes, I am coming soon!’"},{"num":21,"verse":"The grace of the Lord Jesus be with you all."}]