[{"num":22,"verse":"My heavenly guide brought me to the river of pure living waters, shimmering as brilliantly as crystal. It flowed out from the throne of God and of the Lamb, "},{"num":2,"verse":"flowing down the middle and dividing the street of the holy city. On each bank of the river stood the tree of life, firmly planted, bearing twelve kinds of fruit and producing its sweet crop every month throughout the year. And the soothing leaves that grew on the tree of life provided precious healing for the nations."},{"num":3,"verse":"No one or nothing will labor under any curse any longer. And the throne of God and of the Lamb will sit prominently in the city. God’s servants will continually serve and worship Him. "},{"num":4,"verse":"They will be able to look upon His face, and His name will be written on their foreheads. "},{"num":5,"verse":"Darkness will never again fall on this city. They will not require the light of a lamp or of the sun because the Lord God will be their illumination. By His light, they will reign throughout the ages."},{"num":8,"verse":"I, John, am the one who heard and witnessed these visions. And when I heard and witnessed them, I fell prostrate at the feet of the heavenly guide who showed them to me. "},{"num":9,"verse":"But he refused."},{"num":14,"verse":"Blessed are those who wash their garments. In the end, they have rightful access to the tree of life and will enter the city through its gates. "},{"num":15,"verse":"The dogs, the sorcerers, those who commit immoral acts, the murderers, the idolaters, and all who love and practice deception must remain outside the gates for all eternity."},{"num":18,"verse":"Beware, everyone who hears the prophetic words of this book. Know this for certain: if anyone adds to these words, God will add to that person the plagues described in this book. "},{"num":19,"verse":"And if anyone subtracts from the prophetic words of this book, God will remove that person’s access to the tree of life and to the holy city which are described in this book."},{"num":20,"verse":"The One who testifies to these realities makes this promise:"},{"num":21,"verse":"May the grace of the Lord Jesus [the Anointed One] be with all [the saints]. Amen."}]