[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:24-30, 36-43 This parable represents the present and future state of the gospel church; Christ's care of it, the devil's enmity against it, the mixture there is in it of good and bad in this world, and the separation between them in the other world. So prone is fallen man to sin, that if the enemy sow the tares, he may go his way, they will spring up, and do hurt; whereas, when good seed is sown, it must be tended, watered, and fenced. The servants complained to their master; Sir, didst thou not sow good seed in thy field? No doubt he did; whatever is amiss in the church, we are sure it is not from Christ. Though gross transgressors, and such as openly oppose the gospel, ought to be separated from the society of the faithful, yet no human skill can make an exact separation. Those who oppose must not be cut off, but instructed, and that with meekness. And though good and bad are together in this world, yet at the great day they shall be parted; then the righteous and the wicked shall be plainly known; here sometimes it is hard to distinguish between them. Let us, knowing the terrors of the Lord, not do iniquity. At death, believers shall shine forth to themselves; at the great day they shall shine forth before all the world. They shall shine by reflection, with light borrowed from the Fountain of light. Their sanctification will be made perfect, and their justification published. May we be found of that happy number.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let both grow together - They would not spoil the true wheat, and in time of harvest it would be easy to separate them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Our Saviour teaches us here:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That hypocrites and deceived persons must be expected in the church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. That this is the work of the enemy of man. They are not the work of Christianity any more than traitors are of patriotism, or counterfeiters are of the proper effect of legislating about money. They belong to the world, and hypocrisy is only one form of sin. The Christian religion never \"made\" a hypocrite, nor is there a hypocrite on the earth whose principles and practice it does not condemn.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. That all hope of removing them entirely would be vain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. That an \"attempt\" to remove them altogether would injure real Christianity, by causing excitements, discord, and hard feelings even among Christians.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. That Christ will himself separate them at the proper time. There is no doubt that it is the duty of the church to keep itself pure, and to cut off gross and manifest offenders, 1 Corinthians 5:4-5; but the Saviour refers here to those who may be \"suspected\" of hypocrisy, but against whom it cannot be proved; to those who so successfully imitate Christians as to make it difficult or impossible for man to distinguish them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "5. That Christ will himself separate them at the proper time. There is no doubt that it is the duty of the church to keep itself pure, and to cut off gross and manifest offenders, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 5:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the Saviour refers here to those who may be \"suspected\" of hypocrisy, but against whom it cannot be proved; to those who so successfully imitate Christians as to make it difficult or impossible for man to distinguish them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30, 39. Let both grow together—that is, in the visible Church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until the harvest—till the one have ripened for full salvation, the other for destruction. (See on [1292]Mt 13:39).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the time of harvest I will say to the reapers—(See on [1293]Mt 13:39).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gather ye together first the tares, and bind them in bundles to burn them—\"in the fire\" (Mt 13:40).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but gather the wheat into my barn—Christ, as the Judge, will separate the two classes (as in Mt 25:32). It will be observed that the tares are burned before the wheat is housed; in the exposition of the parable (Mt 13:41, 43) the same order is observed: and the same in Mt 25:46—as if, in some literal sense, \"with thine eyes shalt thou behold and see the reward of the wicked\" (Ps 91:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Third and Fourth Parables or Second Pair:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Mustard Seed and The Leaven (Mt 13:31-33).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The subject of both these parables, as of the first pair, is the same, but under a slight diversity of aspect, namely—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The GROWTH OF THE KINGDOM FROM THE Smallest Beginnings to Ultimate Universality.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Mustard Seed (Mt 13:31, 32).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 13:33\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let both grow together until the harvest,.... By \"the harvest\", is meant \"the end of the world\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either of the Jewish world, the dissolution of their church and state, which was near; or of a man's life, which is the end of the world to him; or rather of this present world, the system of the universe, of the material world, as to its present form and use, and of the inhabitants of it, and of time in it. Now the end of the world is compared to harvest, because the time of it is fixed and settled; though it is not known when it will be, yet it is as certain as the time of harvest; and because as that is in the summer season, in hot weather, so this will be a time of wrath, when the day of the Lord will burn like an oven; and as the harvest time is a time of hurry and labour, so will it be in the end of the world, especially with the angels, who will be gathering the elect from the four winds, and all men, to appear before the judgment seat of Christ; and as at harvest the corn is cut down, the fields cleared, and all brought home, so it will be at the end of the world; the sickle will be thrust in, and the earth reaped, the tares bound in bundles, and cast into the fire, and the wheat gathered into the garner; and as the harvest, as it falls out to be good or bad, is matter of joy or sorrow, so will the end of the world be joy to saints, who will then enter into the joy of their Lord, and be for ever with him, and sorrow to the wicked, who will then go into everlasting punishment. Until this time, wheat and tares are to \"grow\" together. The \"wheat\", or true believers, \"grow\" in the exercise of grace, as of faith, hope, love, humility, &c. and in spiritual knowledge of the will of God, of the doctrines of grace, and of Christ; which growth is owing to the dews of divine grace, to the sun of righteousness shining upon them, to the gracious influences of the blessed Spirit, and to the word and ordinances as means. The \"tares\", or nominal professors, may \"grow\" in riches, in credit, and reputation among men, and in speculative knowledge; and oftentimes so it is, that they grow worse and worse, both in doctrinal and practical wickedness: when they are ordered to \"grow together\", the meaning is, not that their growth is equal, or of the same kind, nor in the same way, nor in the same things; but this only notes the time and duration of their growth: nor is this suffered and permitted, because of any love God has unto them, or any delight in, or approbation of them; but either because they are not fully ripe for ruin; or for the exercise of the saints, and for their temporal and spiritual good; for it is entirely a tender regard to the wheat, and not to the tares, that they are ordered to grow together, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And in the time of harvest, I will say to the reapers, the angels, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And in the time of harvest, I will say to the reapers, the angels, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Let both grow together until the harvest: and in the time of harvest I will say to the reapers, Gather ye together first the tares, and bind them in bundles to burn them: but gather the wheat into my barn.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐν καιρῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] without the article, Winer, p. 118 [E. T. 147 ff.].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δήσατε αὐτὰ δεσμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] (see critical remarks): ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bind them into bundles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For this construction of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". with two accusatives, considering the resemblance between it and the root of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεσμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., comp. Kühner, II. 1, p. 274.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "explanation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the parable, which latter is different from that given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. (in answer to Holtzmann, Weiss), is furnished by Jesus Himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. It is to this effect. The visible church, up till the day of judgment, is to comprise within its pale those who are not members of the invisible church, and who shall have no part in the kingdom that is to be established. The separation is not a thing with which man is competent to deal, but must be left in the hands of the Judge. The matter is to be understood, however, in a broad and general way, so that it cannot be said at all to affect the right of individual excommunication and restoration. In regard to individuals, there remains the possibility (to which, however, the parable makes no reference whatever): “ut qui hodie sunt zizania, eras sint frumentum,” Augustine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Συλλέξατε πρῶτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": before or after cutting down the crop? Not said which; order of procedure immaterial, for now the wheat is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ripe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δήσατε εἰς δέσμας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", omitted in some MSS., is not necessary before a noun of same meaning with the verb. Fritzsche thinks the expression without preposition more elegant. Meyer also omits, with appeal to Kühner on verbs with double accusatives.—This parable embodies the great principle of bad men being tolerated for the sake of the good. It relegates to the end the judgment which the contemporaries of Jesus, including the Baptist, expected at the beginning of the Messianic kingdom (Weiss-Meyer).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Συναυξάνεσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grow together",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Growth in good and evil takes place simultaneously, sometimes in the case of individuals, and generally in that of men taken collectively; and the further that ages proceed, the more conspicuous do they both become.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ καιρῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Then it will at length be the right time to do so.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρῶτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that the godly may behold the punishment of the ungodly; the ungodly not see the glory of the godly. Thus in ch. 25, though the Judge addresses the righteous first, yet afterwards in the last verse the ungodly are banished into eternal fire before [the godly are admitted into heaven].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δέσμας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bundles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") As from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σταθμός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a standing place, station, etc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) comes ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "στάθμη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a carpenter’s rule, etc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), and from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λῦμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "physical or moral filth, etc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) comes ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λύμη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "outrage, etc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), so from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεσμὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "band",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bond",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are derived ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δέσμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bond",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δέσμη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bundle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); see Eustathius. They will have no choice: those of like kind will be joined together.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατακαῦσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to burn utterly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They will be burned, and that utterly.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Then the separation will have been effected.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συναγάγετε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "collect",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and bring.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To the reapers.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not all my servants, but they to whom such work belongs (cf. Goebel); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the angels (ver. 39). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Gather ye together;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gather up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version), because the same word (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συλλέγειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is employed as in ver. 28. This command belongs to the time after the field is reaped. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "First the tares.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The tares are to be separated and gathered together before the wheat is garnered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And hind them in bundles to burn them: but gather",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συνάγετε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This word regards rather the destination, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συλλέγειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the operation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The wheat into my barn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", notes). Matthew 13:30",
        "children": []
      }
    ]
  }
]