[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(44) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The kingdom of heaven is like unto treasure hid in a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Probably no parable in the whole series came more home to the imagination of the disciples than this. Every village had its story of men who had become suddenly rich by finding some hidden hoard that had been hastily concealed in time of war or tumult. Then, as now, there were men who lived in the expectation of finding such treasures, and every traveller who was seen searching in the ruins of an ancient town was supposed to be hunting after them. As far back as the days of Solomon such a search had become a parable for the eager pursuit of wisdom (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Now they were told to find that which answered to it in their own experience. The conduct of the man who finds the treasure, in concealing the fact of his discovery from the owner of the field, hardly corresponds with our notions of integrity, but parables—as in the case of the Unjust Steward (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the Unjust Judge (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—do not concern themselves with these questions, and it is enough if they bring out the salient points—in this case, the eagerness of the man to obtain the treasure, and the sacrifice he is ready to make for it. Jewish casuistry, in such matters, applied the maxim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Caveat emptor,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the seller rather than the buyer, and the minds of the disciples would hardly be shocked at what would seem to them a natural stroke of sharpness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the interpretation of the parable, the case described is that of a man who, not having started in the pursuit of holiness or truth, is brought by the seeming accidents of life—a chance meeting, a word spoken in season, the example of a living holiness—to the knowledge of the truth as it is in Jesus, i.e., to Christ Himself, and who, finding in Him a peace and joy above all earthly treasure, is ready to sacrifice the lower wealth in order to obtain the higher. Such, we may well believe, had been the history of the publicans and the fishermen who made up the company of the Twelve. The parable had its fulfilment in them when they, at the bidding of their Lord, “forsook all and followed Him.” Such, it need hardly be said, has been the story of thousands of the saints of God in every age of the Church’s life from that day to this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the interpretation of the parable, the case described is that of a man who, not having started in the pursuit of holiness or truth, is brought by the seeming accidents of life—a chance meeting, a word spoken in season, the example of a living holiness—to the knowledge of the truth as it is in Jesus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to Christ Himself, and who, finding in Him a peace and joy above all earthly treasure, is ready to sacrifice the lower wealth in order to obtain the higher. Such, we may well believe, had been the history of the publicans and the fishermen who made up the company of the Twelve. The parable had its fulfilment in them when they, at the bidding of their Lord, “forsook all and followed Him.” Such, it need hardly be said, has been the story of thousands of the saints of God in every age of the Church’s life from that day to this.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Matthew",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "TREASURE AND PEARLMatthew 13:44 - Matthew 13:46",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "TREASURE AND PEARL",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:46",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In this couple of parables, which are twins, and must be taken together, our Lord utilises two very familiar facts of old-world life, both of them arising from a similar cause. In the days when there were no banks and no limited liability companies, it was difficult for a man to know what to do with his little savings. In old times government meant oppression, and it was dangerous to seem to have any riches. In old days war stalked over the land, and men’s property must be portable or else concealed. So, on the one hand we find the practice of hiding away little hoards in some suitable place, beneath a rock, in the cleft of a tree, or a hole dug in the ground, and then, perhaps, the man died before he came back for his wealth. Or, again, another man might prefer to carry his wealth about with him. So he went and got jewels, easily carried, not easily noticed, easily convertible into what he might require.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And, says our Lord, these two practices, with which all the people to whom He was speaking were very much more familiar than we are, teach us something about the kingdom of God. Now, I am not going to be tempted to discuss what our Lord means by that phrase, so frequent upon His lips, ‘the kingdom of God’ or ‘of heaven.’ Suffice it to say that it means, in the most general terms, a state or order of things in which God is King, and His will supreme and sovereign. Christ came, as He tells us, to found and to extend that kingdom upon earth. A man can go into it, and it can come into a man, and the conditions on which he enters into it, and it into him, are laid down in this pair of parables. So I ask you to notice their similarities and their divergences. They begin alike and they run on alike for a little way, and then they diverge. There is a fork in the road, and they reunite at the end again. They agree in their representation of the treasure; they diverge in their explanation of the process of discovering it, and they unite at last in the final issue. So, then, we have to look at these three points.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Let me ask you to think that the true treasure for a man lies in the kingdom of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Let me ask you to think that the true treasure for a man lies in the kingdom of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is not exactly said that the treasure is the kingdom, but the treasure is found in the kingdom, and nowhere else. Let us put away the metaphor; it means that the only thing that will make us rich is loving submission to the supreme law of the God whom we love because we know that He loves us. You may put that thought into half a dozen different forms. You may say that the treasure is the blessing that comes from Christianity, or the inward wealth of a submissive heart, or may use various modes of expression, but below them all lies this one great thought, that it is laid on my heart, dear brethren, to try and lay on yours now, that, when all is said and done, the only possession that makes us rich is-is what? God Himself. For that is the deepest meaning of the treasure. And whatever other forms of expression we may use to designate it, they all come back at last to this, that the wealth of the human soul is to have God for its very own.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me run over two or three points that show us that. That treasure is the only one that meets our deepest poverty. We do not all know what that is, but whether you know it or not, dear friend, the thing that you want most is to have your sins dealt with, in the double way of having them forgiven as guilt, and in having them taken away from you as tyrants and dominators over your wills. And it is only God who can do that, ‘God in Christ reconciling the world unto Himself, not imputing their trespasses unto them,’ and giving them, by a new life which He breathes into dead souls, emancipation from the tyrants that rule over them, and thus bringing them ‘into the liberty of the glory of the sons of God.’ ‘Thou sayest that Thou art rich and increased with goods . . . and knowest not that thou art poor . . . and naked.’ Brother, until you have found out that it is only God who will save you from being bankrupt, and enable you to pay your debts, which are your duties, you do not know where your true riches are. And if you have all that men can acquire of the lower things of life, whether of what is generally called wealth or of other material benefits, and have that great indebtedness standing against you, you are but an insolvent after all. Here is the treasure that will make you rich, because it will pay your debts, and endow you with capacity enough to meet all future expenditure-viz. the possession of the forgiving and cleansing grace of God which is in Jesus Christ. If you have that, you are rich; if you do not possess it, you are poor. Now you believe that, as much as I do, most of you. Well, what do you do in consequence?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, the possession of God, who belongs to all those that are the subjects of the kingdom of God, is our true treasure, because that wealth, and that alone, meets at once all the diverse wants of the human soul. There is nothing else of which that can be said. There are a great many other precious things in this world-human loves, earthly ambitions of noble and legitimate kinds. No one but a fool will deny the convenience and the good of having a competency of this world’s possessions. But all these have this miserable defect, or rather limitation, that they each satisfy some little corner of a man’s nature, and leave all the rest, if I may so say, like the beasts in a menagerie whose turn has not yet come to be fed, yelping and growling while the keeper is at the den of another one. There is only one thing that, being applied, as it were, at the very centre, will diffuse itself, like some fragrant perfume, through the whole sphere, and fill the else scentless air with its rich and refreshing fragrance. There is but one wealth which meets the whole of human nature. You, however small you are, however insignificant people may think you, however humbly you may think of yourselves, you are so great that the whole created Universe, if it were yours, would be all too little for you. You cannot fill a bottomless bog with any number of cartloads of earth. And you know as well as I can tell you that ‘he that loveth silver shall not be satisfied with silver, nor he that loveth abundance with increase,’ and that none of the good things here below, rich and precious as many of them are, are large enough to fill, much less to expand, the limitless desires of one human heart. As the ancient Latin father said, ‘Lord, Thou hast made us for Thyself, and our heart is unquiet till it attains to Thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Closely connected with that thought, but capable of being dealt with for a moment apart, is the other, that this is our true treasure, because we have it all in one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You remember the beautiful emphasis of one of the parables in our text about the man that dissipated himself in seeking for many goodly pearls? He had secured a whole casket full of little ones. They were pearls, they were many; but then he saw one Orient pearl, and he said, ‘The one is more than the many. Let me have unity, for there is rest; whereas in multiplicity there is restlessness and change.’ The sky to-night may be filled with galaxies of stars. Better one sun than a million twinkling tininesses that fill the heavens, and yet do not scatter the darkness. Oh, brethren, to have one aim, one love, one treasure, one Christ, one God-there is the secret of blessedness. ‘Unite my heart to fear Thy name’; and then all the miseries of multiplicity, and of drawing our supplies from a multitude of separate lakes, will be at an end, when our souls are flooded from the one fountain of life that can never fail or be turbid. Thus, the unity of the treasure is the supreme excellence of the treasure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor need I remind you in more than a word of how this is our true treasure, because it is our permanent one. Nothing that can be taken from me is truly mine. Those of you who have lived in a great commercial community as long as I have done, know that it is not for nothing that sovereigns are made circular, for they roll very rapidly, and ‘riches take to themselves wings and fly away.’ We can all go back to instances of men who set their hearts upon wealth, and flaunted their little hour before us as kings of the Exchange, and were objects of adoration and of envy, and at last were left stranded in poverty. Nothing that can be stripped from you by the accidents of life, or by inevitable death, is worth calling your ‘good.’ You must have something that is intertwined with the very fibres of your being. And I, unworthy as I am, come to you, dear friends, now, with this proffer of the great gift of wealth from which ‘neither life, nor death, nor angels, nor principalities, nor powers, nor things present, nor things to come, nor height, nor depth, nor any other creature, shall be able to separate us.’ And I beseech you to ask yourselves, Is there anything worth calling wealth, except that wealth which meets my deepest need, which satisfies my whole nature, which I may have all in one, and which, if I have, I may have for ever? That wealth is the God who may be ‘the strength of your hearts and your heritage for ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now notice, secondly, the concealment of the treasure. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now notice, secondly, the concealment of the treasure.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "According to the first of our parables, the treasure was hid in a field. That is very largely local colouring, which gives veracity and vraisemblance to the fact of the story. And there has been a great deal of very unnecessary and misplaced ingenuity spent in trying to force interpretations upon every feature of the parable, which I do not intend to imitate, but I just wish to suggest one thing. Here was this man in the story, who had plodded across that field a thousand times, and knew every clod of it, and had never seen the wealth that was lying six inches below the surface. Now, that is very like some of my present hearers. God’s treasure comes to the world in a form which to a great many people veils, if it does not altogether hide, its preciousness. You have heard sermons till you are sick of sermons, and I do not wonder at it, if you have heard them and never thought of acting on them. You know all that I can tell you, most of you, about Jesus Christ, and what He has done for you, and what you should do towards Him, and your familiarity with the Word has blinded you to its spirit and its power. You have gone over the field so often that you have made a path across it, and it seems incredible to you that there should be anything worth your picking up there. Ah! dear friends, Jesus Christ, when He was here, ‘in whom were hid all the treasures of wisdom and knowledge,’ had to the men that looked upon Him ‘neither form nor comeliness that they should desire Him,’ and He was to them a stumbling-block and foolishness. And Christ’s Gospel comes among busy men, worldly men, men who are under the dominion of their passions and desires, men who are pursuing science and knowledge, and it looks to them very homely, very insignificant; they do not know what treasure is lying in it. You do not know what treasure is lying-may I venture to say it?-in these poor words of mine, in so far as they truly represent the mind and will of God. Dear brethren, the treasure is hid, but that is not because God did not wish you to see it; it is because you have made yourselves blind to its flashing brightness. ‘If our Gospel be hid, it is hid to them . . . in whom the god of this world hath blinded their eyes.’ If your whole desires are passionately set on that which Manchester recognises as the summum bonum, or, if you are living without a thought beyond this present, how can you expect to see the treasure, though it is lying there before your eyes? You have buried it, or, rather, you have made that which is its necessary envelope to be its obscuration. I pray you, look through the forms, look beneath the words of Scripture, and try and clear your eyesight from the hallucinations of the dazzling present, and you will see the treasure that is hid in the field.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Again, let me ask you to notice, further, the two ways of finding. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Again, let me ask you to notice, further, the two ways of finding.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The rustic in the first story, who, as I said, had plodded across the field a hundred times, was doing it for the hundred and first, or perhaps was at work there with his mattock or his homely plough. And, perchance, some stroke of the spade, or push of the coulter, went a little deeper than usual, and there flashed the gold, or some shower of rain came on, and washed away a little of the superincumbent soil, and laid bare the bag. Now, that is what often happens, for you have to remember that though you are not seeking God, God is always seeking you, and so the great saying comes to be true, ‘I am found of them that sought Me not.’ There have been many cases like the one of the man who, breathing out threatenings and slaughter, with no thought in his mind except to bind the disciples and bring them captive to Jerusalem, saw suddenly a light from heaven flashing down upon him, and a Voice that pulled him up in the midst of his career. Ah! it would be an awful thing if no one found Christ except those who set out to seek for Him. Like the dew on the grass ‘that waiteth not for men, nor tarrieth for the sons of men,’ He often comes to hearts that are thinking about nothing less than about Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are men and women listening to me now who did not come here with any expectation of being confronted with this message to their souls; they may have been drawn by curiosity or by a hundred other motives. If there is one such, to whom I am speaking, who has had no desires after the treasure, who has never thought that God was his only Good, who has been swallowed up in worldly things and the common affairs of life, and who now feels as if a sudden flash had laid bare the hidden wealth in the familiar Gospel, I beseech such a one not to turn away from the discovered treasure, but to make it his own. Dear friend, you may not be looking for the wealth, but Christ is looking for His lost coin. And, though it has rolled away into some dusty corner, and is lying there all unaware, I venture to say that He is seeking you by my poor words to-night, and is saying to you: ‘I counsel thee to buy of Me gold tried in the fire.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But then another class is described in the other parable of the merchantman who was seeking many goodly pearls. I suppose he may stand as a representative of a class of whom I have no doubt there are some other representatives hearing me now, namely, persons who, without yielding themselves to the claims of Christ, have been searching, honestly and earnestly, for ‘whatsoever things are lovely and of good report.’ Dear brethren, if you have been smitten by the desire to live noble lives, if you have been roused",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘To follow knowledge, like a sinking star,Beyond the furthest bounds of human thought,’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘To follow knowledge, like a sinking star,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Beyond the furthest bounds of human thought,’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "or if in any way you are going through the world with your eyes looking for something else than the world’s gross good, and are seeking for the many pearls, I beseech you to lay this truth to heart, that you will never find what you seek, until you understand that the many have not it to give you, and that the One has. And when Christ draws near to you and says, ‘Whatsoever things are lovely and of good report, whatsoever things are true, whatsoever things are venerable, if thou seekest them, take Me, and thou wilt find them all,’ I beseech you, accept Him. There are two ways of finding the treasure. It is flashed on unexpectant eyes, and it is disclosed to seeking souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, let us look at the point where the parables converge. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, let us look at the point where the parables converge.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There are two ways of finding; there is only one way of getting. The one man went and sold all that he had and bought the field. Never mind about the morality of the transaction: that has nothing to do with our Lord’s purpose. Perhaps it was not quite honest of this man to bury the treasure again, and then to go and buy the field for less than it was worth, but the point is that, however a soul is brought to see that God in Christ is all that he needs, there is only one way of getting Him, and that is, ‘sell all that thou hast.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Then it is barter, is it? Then it is salvation by works after all?’ No! To ‘sell all that thou hast’ is first, to abandon all hope of acquiring the treasure by anything that thou hast. We buy it when we acknowledge that we have nothing of our own to buy it with. Buy it ‘without money and without price’; buy it by yielding your hearts; buy it by ceasing to cling to earth and creatures, as if they were your good. That trust in Jesus Christ, which is the condition of salvation is selling ‘all that thou hast.’ Self is ‘all that thou hast.’ Abandon self and clutch Him, and the treasure is thine. But the initial act of faith has to be carried on through a life of self-denial and self-sacrifice, and the subjection of self-will, which is the hardest of all, and the submission of one’s self altogether to the kingdom of God and to its King. If we do thus we shall have the treasure, and if we do not thus we shall not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Surely it is reasonable to fling away paste pearls for real ones. Surely it is reasonable to fling away brass counters for gold coins. Surely, in all regions of life, we willingly sacrifice the second best in order to get the very best. Surely if the wealth which is in God is more precious than all besides, you have the best of the bargain, if you part with the world and yourselves and get Him. And if, on the other hand, you stick to the second best and cleave to yourselves and to this poor diurnal sphere and what it contains, then I will tell you what your epitaph will be. It is written in one of the Psalms, ‘He shall leave them in the midst of his days, and at his latter end shall be a fool.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And there is a more foolish fool still-the man who, when he has seen the treasure, flings another shovelful of earth upon it, and goes away and does not buy it, nor think anything more about it. Dear brother, do not do that, but if, by God’s help, any poor words of mine have stirred anything in your hearts of recognition of what your true wealth is, do not rest until you have done what is needful to possess it, given away yourselves, and in exchange received Christ, and in Him wealth for evermore.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 13:44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Again ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The three following parables were proposed, not to the multitude, but peculiarly to the apostles: the two former of them relate to those who receive the gospel; the third, both to those who receive, and those who preach it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The kingdom of heaven is like unto treasure hid in a field ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The kingdom of God, to be set up in the hearts of men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which is righteousness, peace, and joy in the Holy Ghost, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or the salvation of the gospel, is a treasure indeed, but a treasure which, though contained in the field of the Scriptures, is hid from the carnal part of mankind, even from the most wise and prudent of them. Many who frequently traverse this field are not aware that it contains such a treasure. But when a man, in consequence of having the eyes of his understanding opened, has discovered it, he hideth it in his heart — makes, at first, his discovery the matter of his serious meditation in private, rather than the subject of his conversation in public; or uses the greatest care and caution, and is more intent on securing the treasure to himself, than on telling to others what a discovery he has made: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and for joy thereof ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Through joy arising from the prospect of being speedily enriched; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goeth and selleth all that he hath ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Gives up all other happiness; parts with every object that has engaged, or would engage, his affection; renounces every desire, care, and pursuit, every interest and pleasure that he sees to be incompatible with his enjoyment of the salvation he seeks, or would prevent his obtaining it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and buyeth that field ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Makes himself acquainted with, and embraces by faith ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the truth as it is in Jesus, the glad tidings ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "announced thereby, and revealed in the Scriptures, and with the field obtains the treasure: for this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "law of the Spirit of life in Christ Jesus makes him free from the law of sin and death, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:44-52 Here are four parables. 1. That of the treasure hid in the field. Many slight the gospel, because they look only upon the surface of the field. But all who search the Scriptures, so as in them to find Christ and eternal life, Joh 5:39, will discover such treasure in this field as makes it unspeakably valuable; they make it their own upon any terms. Though nothing can be given as a price for this salvation, yet much must be given up for the sake of it. 2. All the children of men are busy; one would be rich, another would be honourable, another would be learned; but most are deceived, and take up with counterfeits for pearls. Jesus Christ is a Pearl of great price; in having him, we have enough to make us happy here and for ever. A man may buy gold too dear, but not this Pearl of great price. When the convinced sinner sees Christ as the gracious Saviour, all things else become worthless to his thoughts. 3. The world is a vast sea, and men, in their natural state, are like the fishes. Preaching the gospel is casting a net into this sea, to catch something out of it, for His glory who has the sovereignty of this sea. Hypocrites and true Christians shall be parted: miserable is the condition of those that shall then be cast away. 4. A skilful, faithful minister of the gospel, is a scribe, well versed in the things of the gospel, and able to teach them. Christ compares him to a good householder, who brings forth fruits of last year's growth and this year's gathering, abundance and variety, to entertain his friends. Old experiences and new observations, all have their use. Our place is at Christ's feet, and we must daily learn old lessons over again, and new ones also.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The kingdom of heaven - The gospel. The new dispensation. The offer of eternal life. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Saviour in this parable compares that kingdom to treasure hid in a field; that is, to money concealed; or more likely to a mine of silver or gold that was unknown to the owner of the field.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hideth - That is, he conceals the fact that he has found it; he does not tell of it. With a view of obtaining this, Jesus says that a man would go and sell his property and buy the field. The conduct of the man would be dishonest. It would be his duty to inform the owner of the field of the discovery. He would be really endeavoring to gain property belonging to another at far less than its real value, and the principle of real integrity would require him to inform the owner of the discovery. But Christ does not intend to vindicate his conduct. He merely states the way in which people do \"actually\" manage to obtain wealth. He states a case where a man would actually \"sacrifice his property,\" and practice diligence and watchfulness to obtain the wealth which he had discovered. The point of the parable lies in his \"earnestness,\" his anxiety, his care, and his actually obtaining it. The gospel is more valuable than such a treasure, Psalm 19:10; Proverbs 3:13-15. It is hidden from most people. When a person sees it and hears it, it is his duty to sacrifice all that hinders his obtaining it, and to seek it with the earnestness with which other people seek for gold. The truth often lies buried: it is like rich veins of ore in the sacred Scriptures; it must be searched out with diligence, and its discovery will repay a man for all his sacrifices, Luke 14:33; Philippians 3:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hideth - That is, he conceals the fact that he has found it; he does not tell of it. With a view of obtaining this, Jesus says that a man would go and sell his property and buy the field. The conduct of the man would be dishonest. It would be his duty to inform the owner of the field of the discovery. He would be really endeavoring to gain property belonging to another at far less than its real value, and the principle of real integrity would require him to inform the owner of the discovery. But Christ does not intend to vindicate his conduct. He merely states the way in which people do \"actually\" manage to obtain wealth. He states a case where a man would actually \"sacrifice his property,\" and practice diligence and watchfulness to obtain the wealth which he had discovered. The point of the parable lies in his \"earnestness,\" his anxiety, his care, and his actually obtaining it. The gospel is more valuable than such a treasure, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:13-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is hidden from most people. When a person sees it and hears it, it is his duty to sacrifice all that hinders his obtaining it, and to seek it with the earnestness with which other people seek for gold. The truth often lies buried: it is like rich veins of ore in the sacred Scriptures; it must be searched out with diligence, and its discovery will repay a man for all his sacrifices, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44. Again, the kingdom of heaven is like unto treasure hid in a field—no uncommon thing in unsettled and half-civilized countries, even now as well as in ancient times, when there was no other way of securing it from the rapacity of neighbors or marauders. (Jer 41:8; Job 3:21; Pr 2:4).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the which when a man hath found—that is, unexpectedly found.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he hideth, and for joy thereof—on perceiving what a treasure he had lighted on, surpassing the worth of all he possessed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "goeth and selleth all that he hath, and buyeth that field—in which case, by Jewish law, the treasure would become his own.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Pearl of Great Price (Mt 13:45, 46).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whatsoever belongeth to the kingdom of God, whether the word, which is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the word of the kingdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or the grace and favour of God, which he by me dispenses out under the administration of the gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is like, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, should be adjudged, esteemed, and used like as ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "treasure hid in a field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Men should do by it as they would do upon the discovery of a great sum of money, buried up in the earth, in some field not yet their own. Suppose a man had made some such discovery, what would he do? He would rejoice at it, he would hide it, he would sell all he had and buy that field. So should men do to whom there is a revelation of the gospel, and the grace thereof; they should inwardly rejoice in the revelation, and bless God for it, and, whatever it cost them, labour that they might be made partakers of that grace. Earthly possessions cannot be had without purchasing, and those who have not ready money to purchase with must raise it from the sale of something which they have; therefore our labour for the kingdom of heaven is set out under the notion of buying. But the prophet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "{Isaiah 55:1,2}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "{",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 55:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " let us know that it is a buying ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without money and without price.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " However, there is some resemblance, for as in buying and selling there is a parting with something that is ours, in exchange for something which is another’s, so in order to the obtaining of the grace of the gospel, and the kingdom of glory, to which the remission of sins leadeth, we must part with something in order to the obtaining of it. We have no ready money, nothing by us, that is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "quid pro quo, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a valuable price for Divine grace; we must therefore part with something that we have, and it is no matter what it be, which God requireth. Where this discovery is made, the soul will part with all it hath, not only its old heart, its unlawful desires and lusts, but its riches, honours, and pleasures, if it can by no other means obtain the kingdom of heaven, that it may obtain it; they are all of no value to it. Nor is it at all necessary in order to buying, that the thing parted with be of a proportionable, value. Amongst men, wedges of gold have been purchased for knives and rattles, &c; nor doth any thing we can part with, that we may obtain the kingdom of heaven, bear any better proportion; yet it is a buying, because it is what God is pleased to accept, and upon the parting with gives us this heavenly kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Again the kingdom of heaven is like unto treasure,.... By which is meant, not eternal life, the incorruptible inheritance, riches of glory, treasure in heaven; nor Christ, in whom are hid all the treasures of wisdom and knowledge, and all the riches of grace and glory; but the Gospel, which is a treasure consisting of rich truths, comparable to gold, silver, and precious stones; of the most valuable blessings, and of exceeding great, and precious promises; and reveals the riches of God, of Christ, and of the other world; and is a treasure unsearchable, solid, satisfying, and lasting: this is said to bid in a field. The Gospel was in some measure hid, under the former dispensation, from the Old Testament saints; and for a long time was hid from the Gentile world; and is entirely hid from them that are lost, who are blinded by the god of this world; and even from the elect of God themselves, before conversion: this is sometimes said to be hid in God, in his thoughts, counsels, and purposes, and in the covenant of his grace; and sometimes in Christ; who is the storehouse of truth, as well as of grace; and may be thought to be hid under the Mosaic economy, in the types and shadows of the ceremonial law: but here \"the field\" means the Scriptures, in which the Gospel lies hid; and therefore these are to be searched into for it, as men seek and search for silver and hid treasures, by digging into mines, and in the bowels of the earth: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the which when a man hath found; either with or without the use of means, purposely attended to, in order to find it; such as reading, hearing, prayer, and meditation: for sometimes the Gospel, and the spiritual saving knowledge of it, are found, and attained to, by persons accidentally, with respect to themselves, though providentially, with respect to God; when they had no desire after it, or searched for it, and thought nothing about it; though by others it is come at, in a diligent use of the above means: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he hideth; which is to be understood not in an ill sense, as the man hid his talent in a napkin, and in the earth; but in a good sense, and designs his care of it; his laying it up in his heart, that he might not lose it, and that it might not be taken away from him: anor joy thereof; for the Gospel, when rightly understood, brings good tidings of great joy, to sensible sinners, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "goeth and selleth all that he hath, and buyeth the field: which is not to be interpreted literally and properly; though a man that knows the worth and value of the Bible, rather than be without one, would part with all his worldly substance for one; but figuratively, and denotes the willingness of such souls, who are led into the glory, fulness, and excellency of the word of God, the scriptures of truth, and of the immense treasure of the Gospel therein, to part with all that has been, or is dear unto them; with their sins, and self-righteousness; with their good names and characters; their worldly substance, and life itself, for the sake of the Gospel, and their profession of it: and may also design the use of all means, to gain a larger degree of light and knowledge in the Gospel. It seems by this parable, according to the Jewish laws, that not the finder of a treasure in a field, but the owner of the field, had the propriety in it; when it should seem rather, that it ought to be divided. Such that have ability and leisure, may consult a controversy in Philostratus (l), between two persons, the buyer and seller of a field; in which, after the purchase, a treasure was found, when the seller claimed it as his; urging, that had he known of it, he would never have sold him the field: the buyer, on the other hand, insisted on its being his property; alleging that all was his which was contained in the land bought by him, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) De Vita Apollonii, lib. 2. c. 15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) De Vita Apollonii, lib. 2. c. 15. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{7} Again, the kingdom of heaven is like unto treasure hid in a field; the which when a man hath found, he hideth, and for joy thereof goeth and selleth all that he hath, and buyeth that field.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{7}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Again, the kingdom of heaven is like unto treasure hid in a field; the which when a man hath found, he hideth, and for joy thereof goeth and selleth all that he hath, and buyeth that field.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) Few men understand how great the riches of the kingdom of heaven are, and that no man can be a partaker of them but he that redeems them with the loss of all his goods.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πάλιν ὁμοία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] introduces a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "second",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " illustration of the kingdom of the Messiah, by way of continuing that instruction of the disciples which began with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ ἀγρῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the field;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the article being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "generic",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For cases of treasure—trove mentioned by Greek and Roman writers, consult Wetstein.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὃν εὑρὼν ἄνθρωπος ἔκρυψε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which some man found and hid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (again in the field), so as not to be compelled to give it up to the owner of the field, but in the hope of buying the latter, and of then being able legitimately to claim the treasure as having been found on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his own",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " property. It is mentioned by Bava Mezia f. 28, 2, that, in circumstances precisely similar, R. Emi purchased a hired field in which he had found treasure: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“ut pleno jure thesaurum possideret omnemque litium occasionem praecideret",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” Paulus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exeg. Handb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". II. p. 187, observes correctly: “That it was not necessary, either for the purposes of the parable or for the point to be illustrated, that Jesus should take into consideration the ethical questions involved in such cases.” Fritzsche says: “quem ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alibi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", credo, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "repertum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nonnemo ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "illuc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " defoderit.” But the most natural way is to regard ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὑρών",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the correlative to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κεκρυμμένῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; while, again, the behaviour here supposed would have been a proceeding as singular in its character as it would have been clearly dishonest toward the owner of the field.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ τῆς χαρᾶς αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " marks the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "causal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " relation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Kühner, II. 1, p. 366 f.), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not the genitive of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "object",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "over the treasure:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Vulgate, Erasmus, Luther, Beza, Calvin, Maldonatus, Jansen, Bengel, Kuinoel, Fritzsche), but, as the ordinary usage demands, the genitive of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "subject: on account of his joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without its being necessary in consequence to read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὑτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as looking at the matter from the standpoint of the speaker. The object is to indicate the peculiar joy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with which his lucky find inspires him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπάγει κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Present:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the picture becoming more and more animated. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "idea embodied in the parable",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to this effect: the Messianic kingdom, as being the most valuable of all possessions, can become ours only on condition that we are prepared joyfully to surrender for its sake every other earthly treasure. It is still the same idea that is presented in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:45-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with, however, this characteristic difference, that in this case the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "finding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Messiah’s kingdom is preceded by a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seeking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after blessedness generally; whereas, in the former case, it was discovered without being sought for, therefore without any previous effort having been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "put forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ζητοῦντι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] with the view of purchasing such goodly pearls from the owners of them (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 8:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and see Schoettgen).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἕνα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one, the only one of real worth;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " according to the idea contained in the parable, there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exists",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " only one such.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πέπρακε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the perfect alternating with the aorist (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἠγόρασεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the former looking back from the standpoint of the speaker to the finished act (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "everything has been sold by the merchant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the latter simply continuing the narrative (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and he bought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Kühner, II. 1, p. 144 f.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:44-53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Three other parables: the Treasure, the Pearl, the Net",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Parable of the Hid Treasure, in this Gospel only",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In ancient times, and in an unsettled country like Palestine, where there were no banks, in the modern sense, it was a common practice to conceal treasures in the ground. Even at this day the Arabs are keenly alive to the chance of finding such buried stores. The dishonesty of the purchaser must be excluded from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the parable. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unexpected",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " discovery, the consequent excitement and joy, and the eagerness to buy at any sacrifice, are the points to be observed in the interpretation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when a man hath found",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Here the kingdom of heaven presents itself unexpectedly, “Christ is found of one who sought Him not.” The woman of Samaria, the jailer at Philippi, the centurion by the Cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "selleth all that he hath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is the renunciation which is always needed for the winning of the kingdom, cp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus Paul gave up position, Matthew wealth, Barnabas lands.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "buyeth that field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Puts himself in a position to attain the kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Θησαυρῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "treasure, store",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Not of corn,[638] but of gold, gems, etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κεκρυμμένῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔκρυψε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hidden—he hid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It had escaped the notice of him who found it; then, when he found it, he concealed it from others. He hid it in the same field in which he found it. Such are the earnestness and prudence of the saints; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They find the things which are hidden; they hide them when found. The finding the treasure does not presuppose the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seeking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for it, as in the case of the pearls, which are found by diligent search.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χαρᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Spiritual joy is an incentive to deny the world.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of it) i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the treasure; or else it is an adverb.[639]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπάγει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "departeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") In the present tense, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πωλεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he sells",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγοράζει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he buys",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the preterite is put. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "state",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "act",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[640]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[638] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—B. G. V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[639] Meaning “THERE.” In which case, instead of “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " THEREOF,” the passage would be rendered “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which he has found or stored up THERE, sc. in the field.”—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[640] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὁν ἀγρὸν ἐκεῖνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with the treasure. If thou art influenced by the desire of true gain, follow this parable.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 44.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The parable of the hidden treasure found.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Matthew only. It seems probable, from ver. 51, that this and the next two parables were spoken to the disciples in private. They alone would appreciate the value of what they had found; to them alone could the warning be as yet given, that it is not sufficient to have been gathered within the gospel net. Observe in this parable that the treasure was found by chance, and it was near to the man without his knowing it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Again",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To be omitted, with the Revised Version and Westcott and Hort. Its absence (contrast vers. 45, 47) suggests that this parable is the first of a group, marked as such either by our Lord beginning with it after he had made a pause, or by merely coming first in one of the sources that the evangelist used. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The kingdom of heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ver. 24, note) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "is like unto treasure hid in a field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Hid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hidden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κεκρυμμένῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was not there by accident; it had been purposely placed there, hid by its former possessor for safety (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:18, 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Observe that, doubtless unintentionally on the part of the evangelist, the parable forms in this respect the complement to ver. 35",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "In a field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν τῷ ἀγρῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version); cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The which when a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "man hath found, he hideth;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which a man found, and hid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). For fear some one else should take it. Premature assertion would lose the man the treasure. (For a similar truth in spiritual things, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And for joy thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So also the margin of the Revised Version; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and in his joy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version) is better (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ ἀπὸ τῆς χαρᾶς αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ". Goeth and selleth all that he hath, and buyeth that field.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Goeth and selleth all that he hath, and buyeth that field.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Goeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "...  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "selleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "...  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "buyeth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All in the present tense. Our Lord in this parable (contrast ver. 46) brings the man vividly before us in each separate stage of his action. For the self-denial that is a necessary of acquiring gospel privileges, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 19:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where contrast the young man's grief with the joy spoken of here). ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Observe that, though the figure is the same as in ver. 24, the thing signified is very different. Here ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents merely that which contains the treasure, perhaps the outward profession of Christianity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "All.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Westcott and Hort omit, chiefly on the authority of the Vatican manuscript (cf. ver. 46, note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And buyeth that field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Into the morality of the action our Lord does not enter; he only illustrates his teaching by an incident that must have happened not un-frequently in a country like Palestine, which had already been the scene of so many wars. But the transaction \"was, at least, in entire accordance with Jewish law. If a man had found a treasure in loose coins among the corn, it would certainly be his, if he bought the corn. If he had found it on the ground, or in the soil, it would equally certainly belong to him, if he could claim ownership of the soil, and even if the field were not his own, unless others could ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "prove",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their right to it. The law went so far as to adjudge to the purchaser of fruits anything found among these fruits\" (Edersheim, 'Life,' 1:595). Matthew 13:44",
        "children": []
      }
    ]
  }
]