[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Stony places.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Either ground in which stones and pebbles were mingled with the soil, or, more probably, where a thin stratum of earth covered the solid rock. Here, of course, growth was rapid through the very circumstance which was afterwards fatal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-23 Jesus entered into a boat that he might be the less pressed, and be the better heard by the people. By this he teaches us in the outward circumstances of worship not to covet that which is stately, but to make the best of the conveniences God in his providence allots to us. Christ taught in parables. Thereby the things of God were made more plain and easy to those willing to be taught, and at the same time more difficult and obscure to those who were willingly ignorant. The parable of the sower is plain. The seed sown is the word of God. The sower is our Lord Jesus Christ, by himself, or by his ministers. Preaching to a multitude is sowing the corn; we know not where it will light. Some sort of ground, though we take ever so much pains with it, brings forth no fruit to purpose, while the good soil brings forth plentifully. So it is with the hearts of men, whose different characters are here described by four sorts of ground. Careless, trifling hearers, are an easy prey to Satan; who, as he is the great murderer of souls, so he is the great thief of sermons, and will be sure to rob us of the word, if we take not care to keep it. Hypocrites, like the stony ground, often get the start of true Christians in the shows of profession. Many are glad to hear a good sermon, who do not profit by it. They are told of free salvation, of the believer's privileges, and the happiness of heaven; and, without any change of heart, without any abiding conviction of their own depravity, their need of a Saviour, or the excellence of holiness, they soon profess an unwarranted assurance. But when some heavy trial threatens them, or some sinful advantage may be had, they give up or disguise their profession, or turn to some easier system. Worldly cares are fitly compared to thorns, for they came in with sin, and are a fruit of the curse; they are good in their place to stop a gap, but a man must be well armed that has much to do with them; they are entangling, vexing, scratching, and their end is to be burned, Heb 6:8. Worldly cares are great hinderances to our profiting by the word of God. The deceitfulness of riches does the mischief; they cannot be said to deceive us unless we put our trust in them, then they choke the good seed. What distinguished the good ground was fruitfulness. By this true Christians are distinguished from hypocrites. Christ does not say that this good ground has no stones in it, or no thorns; but none that could hinder its fruitfulness. All are not alike; we should aim at the highest, to bring forth most fruit. The sense of hearing cannot be better employed than in hearing God's word; and let us look to ourselves that we may know what sort of hearers we are.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Stony places - Where there was little earth, but where it was hard and rocky, so that the roots could not strike down into the earth for sufficient moisture to support the plant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When the sun became hot they of course withered away. They sprang up the sooner because there was little earth to cover them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Forthwith - Immediately. Not that they sprouted and grew any quicker or faster than the others, but they were not so long in reaching the surface. Having little root, they soon withered away.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Forthwith - Immediately. Not that they sprouted and grew any quicker or faster than the others, but they were not so long in reaching the surface. Having little root, they soon withered away.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. And he spake many things unto them in parables, saying, &c.—These parables are SEVEN in number; and it is not a little remarkable that while this is the sacred number, the first FOUR of them were spoken to the mixed multitude, while the remaining THREE were spoken to the Twelve in private—these divisions, four and three, being themselves notable in the symbolical arithmetic of Scripture. Another thing remarkable in the structure of these parables is, that while the first of the Seven—that of the Sower—is of the nature of an Introduction to the whole, the remaining Six consist of three pairs—the Second and Seventh, the Third and Fourth, and the Fifth and Sixth, corresponding to each other; each pair setting forth the same general truths, but with a certain diversity of aspect. All this can hardly be accidental.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "First Parable: The Sower (Mt 13:3-9, 18-23).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This parable may be entitled, The Effect of the Word Dependent on the State of the Heart. For the exposition of this parable, see on [1286]Mr 4:1-9, 14-20.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Reason for Teaching in Parables (Mt 13:10-17).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 13:9\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Some fell upon stony places,.... Such a place as the Jews call  a barren, stony place, a place from whence, they say, they take stones, and , and which  , \"is not fit for sowing\" (d); and such were those places and spots of ground, that some of these seeds fell upon; and design such hearers, in whom the natural hardness of their hearts continues, and who remain unbroken by the word, and are without any true sense of sin, and repentance for it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Where they had not much earth, to cover them and take root in: this is expressive of such persons who have slight convictions of sin, and awakenings of the natural conscience; some little, light, and speculative notions of the word, in the understanding and judgment; some flashes of natural affection for it, and outward expressions of delight and pleasure in it; some show of grace, and a form of godliness, but no real heart work. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And forthwith they sprung up, because they had no deepness of earth; to strike their roots downwards: and through the reflection of the heat, upon the rocks and stones, they quickly broke through the thin surface of the earth over them, and appeared above ground before the usual time of the springing up of seed: which may not only denote the immediate reception of the word by these hearers, and their quick assent to it; but their sudden and hasty profession of it, without taking due time to consider the nature and importance thereof; and the seeming cheerfulness in which they did both receive and profess it; though it was only outward and hypocritical, and more on account of the manner of preaching it, than the word itself, and through a selfish principle in them; and did not arise from any real experience of the power of it on their souls, or true spiritual pleasure in it: nor could it be otherwise, since their stony hearts were not taken away, nor hearts of flesh given them; wherefore the word had no place in them, and made no real impression on them; they remained dead in trespasses and sins; the word was not the savour of life unto life unto them, or the Spirit that giveth life; they did not become living and lively stones; they continued as insensible as ever of their state and condition by nature, of the exceeding sinfulness of sin, of the danger they were in, and of their need of Christ, and salvation by him; they were as hard, and obdurate, and as inflexible, as ever, without any real contrition for sin, or meltings of soul through the influence of the love and grace of God; and as backward as ever to submit to the righteousness of Christ, being stout hearted, and far from it; and being no more cordially willing to be subject to the sceptre of his kingdom, or to serve him in righteousness and holiness, than they ever were; for the word falling upon them, made no change in them; their hearts were as hard as ever, notwithstanding the seeming and hasty reception of it; though they did not refuse to hearken to the word externally, did not put away the shoulder, or stop their ears, yet their hearts were still like an adamant stone: nothing but the mighty power of God, and his efficacious grace, can break the rocky heart in pieces; or give an heart of flesh, a sensible, soft, and flexible one, with which a man truly repents of sin, believes in Christ, and becomes subject to him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) T. Bab. Erachin, fol. 32. 1. & Gloss. in ib. & Bava Bathra, fol. 156. 2. & Gloss. in ib. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) T. Bab. Erachin, fol. 32. 1. & Gloss. in ib. & Bava Bathra, fol. 156. 2. & Gloss. in ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Some fell upon stony places, where they had not much earth: and forthwith they sprung up, because they had no deepness of earth:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπὶ τὰ πετρώδη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", upon shallow ground, where the rock was near the surface (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ εἶχεν γῆν πολλήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stony places",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Places where the underlying rock was barely covered with earth. The hot sun striking on the thin soil and warming the rock beneath would cause the corn to spring up rapidly and then as swiftly to wither.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πετρώδη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rocky",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This expression does not indicate stones lying scattered over the field, but a continuous bed of rock under the ground, with only a slight covering of soil.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ εἶχε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") We must understand ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄλλα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the nominative plural. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πολλὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "= the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "רב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", much: it sometimes signifies too much; here, sufficiently much.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξανέτειλε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", grew up high) not merely ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνέτειλε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", sprang up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Some",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and others",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "fell upon stony",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "places",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the rocky places",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). Where the underlying rock was hardly, if at all, covered by soil. Such spots would be common in the fields of Palestine, as in those of all mountainous countries. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Where they had not much earth: and forthwith they sprang up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐξανέτειλεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They shot up quicker than the thorns in ver. 7 (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀνέβησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ". Because they had no deepness of earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Because they had no deepness of earth.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Matthew 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Stony places",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Not ground covered with loose stones, but a hard, rocky surface, covered with a thin layer of soil. ",
        "children": []
      }
    ]
  }
]