[{"num":18,"verse":"By the time David had finished speaking to Sha’ul, Y’honatan found himself inwardly drawn by David’s character, so that Y’honatan loved him as he did himself. "},{"num":2,"verse":"That day, Sha’ul took David into his service and would not let him go home to his father’s house any more. "},{"num":3,"verse":"Y’honatan made a covenant with David, because he loved him as he did himself. "},{"num":4,"verse":"Y’honatan removed the cloak he was wearing and gave it to David, his armor too, including his sword, bow and belt. "},{"num":5,"verse":"David would go out, and no matter where Sha’ul sent him, he was successful. Sha’ul put him in charge of the fighting men; all the people thought it good, and so did Sha’ul’s servants."},{"num":6,"verse":"As David and the others were returning from the slaughter of the P’lishti, the women came out of all the cities of Isra’el to meet King Sha’ul, singing and dancing joyfully with tambourines and three-stringed instruments. "},{"num":7,"verse":"In their merrymaking the women sang,"},{"num":8,"verse":"Sha’ul became very angry, because this song displeased him. He said, “They give David credit for tens of thousands, but me they give credit for only thousands. Now all he lacks is the kingdom!” "},{"num":9,"verse":"From that day on, Sha’ul viewed David with suspicion."},{"num":10,"verse":"The following day an evil spirit from God came powerfully over Sha’ul, so that he fell into a frenzy in the house. David was there, playing his lyre as on other occasions. This time Sha’ul had his spear in his hand; "},{"num":11,"verse":"and he threw the spear, thinking, “I will pin David to the wall!” But David dodged out of the way twice. "},{"num":12,"verse":"Sha’ul became afraid of David, because Adonai was with him and had left Sha’ul. "},{"num":13,"verse":"Therefore Sha’ul put him at a distance from himself by making him commander over a thousand; his goings and comings became public knowledge. "},{"num":14,"verse":"David had great success in all his ways; Adonai was with him. "},{"num":15,"verse":"When Sha’ul saw how very successful he was, he became afraid of him. "},{"num":16,"verse":"But all Isra’el and Y’hudah loved David, because they knew about all his campaigns."},{"num":17,"verse":"Sha’ul said to David, “Here is my older daughter Merav. I will give her to you as your wife; only continue displaying your courage for me, and fight Adonai’s battles.” Sha’ul was thinking, “I don’t dare touch him, so let the P’lishtim do away with him.” "},{"num":18,"verse":"David’s response to Sha’ul was, “Who am I, that I should become the king’s son-in-law? I don’t have any kind of a life, and my father’s family has no rank in Isra’el.” "},{"num":19,"verse":"However, when it was time for Merav Sha’ul’s daughter to be given to David, she was given to Adri’el the Mecholati as his wife. "},{"num":20,"verse":"But Mikhal Sha’ul’s daughter fell in love with David. They told Sha’ul, and it pleased him. "},{"num":21,"verse":"Sha’ul said, “I’ll give her to him, so that she can entrap him, and the P’lishtim can do away with him.” So Sha’ul said to David, “Today you will become my son-in-law through the second [daughter].” "},{"num":22,"verse":"Sha’ul ordered his servants to speak privately with David and say, “Look, the king is pleased with you, and all his servants like you; so become the king’s son-in-law.” "},{"num":23,"verse":"Sha’ul’s servants said this to David; but David replied, “Do you think being the king’s son-in-law is something to be treated so casually, given that I’m a poor man without social standing?” "},{"num":24,"verse":"Sha’ul’s servants reported back to him how David had responded. "},{"num":25,"verse":"Sha’ul said, “Here’s what you are to say to David: ‘The king doesn’t want any dowry; he wants a hundred foreskins of the P’lishtim, so that he can have vengeance on the king’s enemies.” For Sha’ul was hoping to have David killed by the P’lishtim. "},{"num":26,"verse":"When his servants said these words to David, it pleased David to become the king’s son-in-law. Even before the time [for him to be married], "},{"num":27,"verse":"David got up and set out, he and his men, and killed two hundred men of the P’lishtim. He brought their foreskins and gave all of them to the king in order to become the king’s son-in-law. Then Sha’ul gave him Mikhal his daughter as his wife."},{"num":28,"verse":"Sha’ul saw and understood that Adonai was with David and that Mikhal Sha’ul’s daughter loved him. "},{"num":29,"verse":"This only made Sha’ul the more afraid of David, so that Sha’ul became David’s enemy for the rest of his life."},{"num":30,"verse":"The leaders of the P’lishtim would attack; but whenever they attacked, David was more successful than any of Sha’ul’s servants; so that David acquired a great reputation."}]