[{"num":18,"verse":"And it came to pass, when he had made an end of speaking unto Sha’ul, that the nefesh Yonatan was kashur (tied together) with the nefesh Dovid, and Yonatan loved him as his own nefesh."},{"num":2,"verse":"And Sha’ul drafted him that day, and would let him return no more to the bais aviv."},{"num":3,"verse":"Then Yonatan and Dovid made a brit (covenant), because he loved him as his own nefesh."},{"num":4,"verse":"And Yonatan stripped himself of the me’il (robe) that was upon him, and gave it to Dovid, and his middah [war garments], even to his cherev, and to his keshet, and to his khagor (belt)."},{"num":5,"verse":"And Dovid went out whithersoever Sha’ul sent him, and prospered; and Sha’ul set him over the anshei hamilchamah, and he was accepted in the sight of kol HaAm, and also in the sight of the avdei Sha’ul."},{"num":6,"verse":"And it came to pass as they came, when Dovid was returned from the slaughter of the Pelishti, that the nashim came out of all towns of Yisroel, singing and dancing, to meet Sha’ul HaMelech, with tambourines, with simchah, and with cymbals."},{"num":7,"verse":"And the nashim answered one another as they played, and said, Sha’ul hath slain his alafim, and Dovid his revavot (myriads)."},{"num":8,"verse":"And Sha’ul was very angry, and the saying was displeasing in his eyes and he said, They have ascribed unto Dovid revavot, and to me they have ascribed but alafim; and what can he have more but the maluchah (kingship)?"},{"num":9,"verse":"And there was jealous suspicion in the way Sha’ul eyed Dovid from that day forward."},{"num":10,"verse":"And it came to pass on the next day, that the ruach Elohim ra’ah came upon Sha’ul, and he prophesied inside the bais; and Dovid made [kinnor] music with his yad, as at other times; and there was a khanit in the yad Sha’ul."},{"num":11,"verse":"And Sha’ul hurled the khanit; for he said, I will pin Dovid even to the wall with it. And Dovid escaped his presence twice."},{"num":12,"verse":"And Sha’ul was afraid of Dovid, because Hashem was with him, and was departed from Sha’ul."},{"num":13,"verse":"Therefore Sha’ul removed him from him, and made him his sar elef; and he went out and came in before HaAm."},{"num":14,"verse":"And Dovid was maskil (successful) in kol drakhim of him; and Hashem was with him."},{"num":15,"verse":"Wherefore when Sha’ul saw that he was maskil me’od, he was afraid of him."},{"num":16,"verse":"But kol Yisroel and Yehudah loved Dovid, because he went out and came in before them."},{"num":17,"verse":"And Sha’ul said to Dovid, Hinei bitti hagedolah Merav, her will I give thee as isha; only be thou ben chayil (valiant) for me, and fight Hashem’s milchamot. For Sha’ul said, Let not mine yad be upon him, but let the yad Pelishtim be upon him."},{"num":18,"verse":"And Dovid said unto Sha’ul, Who am I? And what is my life, or the mishpakhat avi in Yisroel, that I should be Choson to HaMelech?"},{"num":19,"verse":"But it came to pass at the time when Merav Bat Sha’ul should have been given to Dovid, that she was given as isha unto Adriel the Mecholati."},{"num":20,"verse":"And Michal Bat Sha’ul loved Dovid; and they told Sha’ul, and the thing was yashar in [Sha’ul’s] eyes."},{"num":21,"verse":"And Sha’ul said, I will give him her, that she may be a mokesh to him, and that the yad Pelishtim may be against him. Wherefore Sha’ul said to Dovid, Thou shalt this day become Choson to me by one of my two."},{"num":22,"verse":"And Sha’ul commanded his avadim, saying, Commune with Dovid privately, and say, Hinei, HaMelech hath chafetz (delight) in thee, and all his avadim love thee; now therefore be Choson to HaMelech."},{"num":23,"verse":"And the avadim of Sha’ul spoke those devarim in the ears of Dovid. And Dovid said, Seemeth it a light thing in your eyes to become Choson to HaMelech, seeing that I am a poor man, and lightly esteemed?"},{"num":24,"verse":"And the avadim of Sha’ul told him, saying, According to these words spoke Dovid."},{"num":25,"verse":"And Sha’ul said, Thus shall ye say to Dovid, HaMelech has chafetz (desire) for not any mohar (dowry, bride price) but a hundred arelot (foreskins) of the Pelishtim, to be avenged of the oyevei HaMelech. But Sha’ul schemed to make Dovid fall by the yad Pelishtim."},{"num":26,"verse":"And when his avadim told Dovid these devarim, it pleased Dovid well to be Choson of HaMelech; and the yamim [leading up to the duedate of the arelot] were not expired."},{"num":27,"verse":"Wherefore Dovid arose and went, he and his anashim, and slaughtered of the Pelishtim (Philistines) two hundred ish; and Dovid brought their arelot, and they gave them in full count to HaMelech, that he might be the Choson of HaMelech. And Sha’ul gave him Michal bitto as isha."},{"num":28,"verse":"And Sha’ul saw and knew that Hashem was with Dovid, and that Michal Bat Sha’ul loved him."},{"num":29,"verse":"And Sha’ul was yet the more afraid of Dovid; and Sha’ul became oyev to Dovid kol hayamim."},{"num":30,"verse":"Then the sarim of the Pelishtim went forth [to fight]; and it came to pass, after they went forth, that Dovid prospered [in military success] more than all the avadim (officers) of Sha’ul; so that shmo became esteemed as of good reputation."}]