[{"num":1,"verse":"After King Saul had finished his conversation with David, David met Jonathan, the king’s son, and there was an immediate bond of love between them. Jonathan swore to be his blood brother, "},{"num":4,"verse":"and sealed the pact by giving him his robe, sword, bow, and belt."},{"num":5,"verse":"He was Saul’s special assistant, and he always carried out his assignments successfully. So Saul made him commander of his troops, an appointment that was applauded by the army and general public alike. "},{"num":6,"verse":"But something had happened when the victorious Israeli army was returning home after David had killed Goliath. Women came out from all the towns along the way to celebrate and to cheer for King Saul, and were singing and dancing for joy with tambourines and cymbals."},{"num":7,"verse":"However, this was their song: “Saul has slain his thousands, and David his ten thousands!”"},{"num":8,"verse":"Of course Saul was very angry. “What’s this?” he said to himself. “They credit David with ten thousands and me with only thousands. Next they’ll be making him their king!”"},{"num":9,"verse":"So from that time on King Saul kept a jealous watch on David. "},{"num":10,"verse":"The very next day, in fact, a tormenting spirit from God overwhelmed Saul, and he began to rave like a madman. David began to soothe him by playing the harp, as he did whenever this happened. But Saul, who was fiddling with his spear, "},{"num":11,"verse":"suddenly hurled it at David, intending to pin him to the wall. But David jumped aside and escaped. This happened another time, too, for Saul was afraid of him and jealous because the Lord had left him and was now with David. "},{"num":13,"verse":"Finally Saul banned him from his presence and demoted him to the rank of captain. But the controversy put David more than ever in the public eye."},{"num":14,"verse":"David continued to succeed in everything he undertook, for the Lord was with him. "},{"num":15,"verse":"When King Saul saw this, he became even more afraid of him; but all Israel and Judah loved him, for he was as one of them."},{"num":17,"verse":"One day Saul said to David, “I am ready to give you my oldest daughter Merab as your wife. But first you must prove yourself to be a real soldier by fighting the Lord’s battles.” For Saul thought to himself, “I’ll send him out against the Philistines and let them kill him rather than doing it myself.”"},{"num":18,"verse":"“Who am I that I should be the king’s son-in-law?” David exclaimed. “My father’s family is nothing!”"},{"num":19,"verse":"But when the time arrived for the wedding, Saul married her to Adriel, a man from Meholath, instead. "},{"num":20,"verse":"In the meantime Saul’s daughter Michal had fallen in love with David, and Saul was delighted when he heard about it."},{"num":21,"verse":"“Here’s another opportunity to see him killed by the Philistines!” Saul said to himself. But to David he said, “You can be my son-in-law after all, for I will give you my youngest daughter.”"},{"num":22,"verse":"Then Saul instructed his men to say confidentially to David that the king really liked him a lot, and that they all loved him and thought he should accept the king’s proposition and become his son-in-law."},{"num":23,"verse":"But David replied, “How can a poor man like me from an unknown family find enough dowry to marry the daughter of a king?”"},{"num":24,"verse":"When Saul’s men reported this back to him, "},{"num":25,"verse":"he told them, “Tell David that the only dowry I need is one hundred dead Philistines! Vengeance on my enemies is all I want.” But what Saul had in mind was that David would be killed in the fight."},{"num":26,"verse":"David was delighted to accept the offer. So, before the time limit expired, "},{"num":27,"verse":"he and his men went out and killed two hundred Philistines and presented their foreskins to King Saul. So Saul gave Michal to him."},{"num":28,"verse":"When the king realized how much the Lord was with David and how immensely popular he was with all the people, "},{"num":29,"verse":"he became even more afraid of him and grew to hate him more with every passing day. "},{"num":30,"verse":"Whenever the Philistine army attacked, David was more successful against them than all the rest of Saul’s officers. So David’s name became very famous throughout the land."}]