[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither shall the Arabian pitch tent there . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The word “Arabian” is used in its widest extent, as including all the nomadic tribes of the Bedouin type east and north of Palestine as far as Babylon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Strabo, xvi., p. 743). Here, again, we note a literal fulfilment. The Bedouins themselves, partly because the place is desolate, partly from a superstitious horror, shrink from encamping on the site of the ancient temples and palaces, and they are left to lions and other beasts of prey. On the other hand, Joseph Wolff, the missionary, describes a strange weird scene, pilgrims of the Yezidis, or devil-worshippers, dancing and howling like dervishes amid the ruins of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 13:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It shall never be inhabited ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— After the destruction threatened shall be fully effected. This was not done immediately upon the taking of the city by Darius the Mede and Cyrus the Persian, his nephew; but was fulfilled by degrees, as is recorded by historians, and as appears at this day. It will be satisfactory to the reader to note some of the steps by which this prophecy was accomplished. “Cyrus took the city by diverting the waters of the Euphrates, which ran through the midst of it, and entering the place at night by the dry channel. The river, being never restored afterward to its proper course, overflowed the whole country, and made it little better than a great morass: this, and the great slaughter of the inhabitants, with other bad consequences of the taking of the city, was the first step to the ruin of the place. The Persian monarchs ever regarded it with a jealous eye; they kept it under, and took care to prevent its recovering its former greatness. Darius Hystaspis, not long afterward, most severely punished it for a revolt, greatly depopulated the place, lowered the walls, and demolished the gates. Xerxes destroyed the temples, and, with the rest, the great temple of Belus. The building of Seleucia on the Tigris exhausted Babylon by its neighbourhood, as well as by the immediate loss of inhabitants taken away by Seleucus to people his new city. (Strabo, lib. 16.) A king of the Parthians soon after carried away into slavery a great number of the inhabitants, and burned and destroyed the most beautiful parts of the city. Strabo says, that in his time a great part of it was a mere desert: that the Persians had partly destroyed it, and that time, and the neglect of the Macedonians while they were masters of it, had nearly completed its destruction. Jerome (on the place) says, that in his time it was quite in ruins, and that the walls served only for the enclosure of a park or forest, for the king’s hunting. Modern travellers, who have endeavoured to find the remains of it, have given but a very unsatisfactory account of their success. Upon the whole, Babylon is so utterly annihilated, that even the place where this wonder of the world stood cannot now be determined with any certainty.” — Bishop Lowth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:19-22 Babylon was a noble city; yet it should be wholly destroyed. None shall dwell there. It shall be a haunt for wild beasts. All this is fulfilled. The fate of this proud city is a proof of the truth of the Bible, and an emblem of the approaching ruin of the New Testament Babylon; a warning to sinners to flee from the wrath to come, and it encourages believers to expect victory over every enemy of their souls, and of the church of God. The whole world changes and is liable to decay. Wherefore let us give diligence to obtain a kingdom which cannot be moved; and in this hope let us hold fast that grace whereby we may serve God acceptably with reverence and godly fear.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It shall never be inhabited - This has been completely fulfilled. It is now, and has been for centuries, a scene of wide desolation, and is a heap of ruins, and there is every indication that it will continue so to be. From Rauwolff's testimony it appears, that in the sixteenth century 'there was not a house to be seen;' and now the 'eye wanders over a barren desert, in which the ruins are nearly the only indication that it had ever been inhabited. It is impossible to behold this scene and not be reminded how exactly the predictions of Isaiah and Jeremiah have been fulfilled, even in the appearance Babylon was doomed to present, \"that she should never be inhabited.\"' - (Keppel's \"Narrative,\" p. 234.) 'Babylon is spurned alike by the heel of the Ottoman, the Israelites, and the sons of Ishmael.' - (Mignan's \"Travels,\" p. 108.) 'It is a tenantless and desolate metropolis.' - (Ibid. p. 235; see Keith \"On Prophecy,\" p. 221.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither shall it be dwelt in ... - This is but another form of the expression, denoting that it shall be utterly desolate. The following testimonies of travelers will show how this accomplished: 'Ruins composed, like those of Babylon, of heaps of rubbish impregnated with nitre, cannot be cultivated.' - (Rich's \"Memoir,\" p. 16.) 'The decomposing materials of a Babylonian structure doom the earth on which they perish, to lasting sterility. On this part of the plain, both where traces of buildings are left, and where none stood, all seemed equally naked of vegetation; the whole ground appearing as if it had been washed over and over again by the coming and receding waters, until every bit of genial soil was swept away; its half-clay, half-sandy surface being left in ridgy streaks, like what is often seen on the flat shores of the sea after the retreating of the tide.' - (Sir R. K. Porter's \"Travels,\" vol. ii. p. 392.) 'The ground is low and marshy, and presents not the slightest vestige of former buildings, of any description whatever.' - (Buckingham's \"Travels,\" vol. ii. p. 278.) 'The ruins of Babylon are thus inundated so as to render many parts of them inaccessible, by converting the valleys among them into morasses.' - (Rich's \"Memoir,\" p. 13.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither shall the Arabian pitch tent there - The Arabians dwelt chiefly in tents; and were a wandering people, or engaged in traffic which was conducted in caravans traveling from place to place. The idea here is, that Babylon, so far from being occupied as a permanent residence for any people, would be unfit even for a resting place. It would be so utterly desolate, so forsaken, and so unhealthy, that the caravan would not even stop there for a night. What a charge this from its former splendor! How different from the time when it was the place of magnificent palaces, when strangers flocked to it, and when people from all nations were collected there!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither shall the shepherds ... - This is an additional image of desolation. Babylon was situated in the midst of a most fertile region. It might be supposed that, though it was to be destroyed, it would still furnish pasturage for flocks. But no, says the prophet, it shall be so utterly and entirely desolate, that it shall not even afford pasturage for them. The reasons of this are:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) that the whole region round about Babylon was laid under water by the Euphrates after the city was taken, and became a stagnant pool, and of course an unfit place for flocks; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that Babylon was reduced to an extended scene of ruins; and on those ruins - those extended wastes of broken walls, of bricks and cement - no grass would grow.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophecy has been remarkably fulfilled. It is said that the Arabs cannot be persuaded to remain there even for a night. They traverse these ruins by day without fear; but at night the superstitious dread of evil spirits deters them from remaining there. 'Captain Mignan was accompanied by six Arabs completely armed, but he \"could not induce them to remain toward night, from the apprehension of evil spirits. It is impossible to eradicate this idea from the minds of these people, who are very deeply imbued with superstition ... And when the sun sunk behind the Mujelibe, and the moon would have lighted his way among the ruins, it was with infinite regret that he obeyed the summons of his guides.\"' - (Mignan's \"Travels,\" as quoted by Keith, pp. 221, 222.) 'All the people of the country assert that it is extremely dangerous to approach the mound' (the mound in Babylon called Kasr, or Palad) 'after nightfall, on account of the multitude of evil spirits by which it is haunted.' - (Rich's \"Memoir on the Ruins of Babylon,\" p. 27.) The Joseph Wolff, speaking of his visit to Babylon, says, 'I inquired of them (the Yezeedes), whether the Arabs ever pitched their tents among the ruins of Babylon. No, said they, the Arabs believe that the ghost of Nimrod walks amidst them in the darkness, and no Arab would venture on so hazardous an experiment.' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophecy has been remarkably fulfilled. It is said that the Arabs cannot be persuaded to remain there even for a night. They traverse these ruins by day without fear; but at night the superstitious dread of evil spirits deters them from remaining there. 'Captain Mignan was accompanied by six Arabs completely armed, but he \"could not induce them to remain toward night, from the apprehension of evil spirits. It is impossible to eradicate this idea from the minds of these people, who are very deeply imbued with superstition ... And when the sun sunk behind the Mujelibe, and the moon would have lighted his way among the ruins, it was with infinite regret that he obeyed the summons of his guides.\"' - (Mignan's \"Travels,\" as quoted by Keith, pp. 221, 222.) 'All the people of the country assert that it is extremely dangerous to approach the mound' (the mound in Babylon called Kasr, or Palad) 'after nightfall, on account of the multitude of evil spirits by which it is haunted.' - (Rich's \"Memoir on the Ruins of Babylon,\" p. 27.) The Joseph Wolff, speaking of his visit to Babylon, says, 'I inquired of them (the Yezeedes), whether the Arabs ever pitched their tents among the ruins of Babylon. No, said they, the Arabs believe that the ghost of Nimrod walks amidst them in the darkness, and no Arab would venture on so hazardous an experiment.' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. Literally fulfilled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither … Arabian pitch tent—Not only shall it not be a permanent residence, but not even a temporary resting-place. The Arabs, through dread of evil spirits, and believing the ghost of Nimrod to haunt it, will not pass the night there (compare Isa 13:21).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither … shepherds—The region was once most fertile; but owing to the Euphrates being now no longer kept within its former channels, it has become a stagnant marsh, unfit for flocks; and on the wastes of its ruins (bricks and cement) no grass grows.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It shall never be inhabited, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after the destruction threatened shall be fully accomplished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither shall the Arabian, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who dwelt in tents, and wandered from place, where they could find pasture; but shall avoid this place, either because the land, once noted for great fruitfulness, is now become barren; or because the land is accursed by God, and abhorred by all men; or for fear of the wild beasts, as it follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It shall never be inhabited,.... As it has not been since its utter destruction. Pausanias (p), who lived in the times of Adrian, says, Babylon, the greatest city that ever the sun saw, that then there was nothing left of it but a wall: what is now called Babylon is a new city, and built in another place: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall it be dwelt in from generation to generation; which is the same thing repeated in other and stronger terms, for the confirmation of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall the Arabian pitch tent there; that sort of the Arabians called Scenitae, because they dwelt in tents, and moved from place to place with their flocks, for the sake of pasture; but here there should be none for them, and therefore would not pitch their tents at it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall the shepherds make their folds there; as they had used to do in the pastures adjoining to it, which were formerly exceeding good, but now would be barren and unfruitful; and as there would be no shepherds in the city, so neither would any neighbouring ones come hither, or any from distant parts; partly because of the unfruitfulness of the place, and partly through fear of wild beasts, which had their habitation there, as follows. Pliny (q) says it was reduced to a mere desert. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Arcadica sive, l. 8. p. 509. (q) Ut supra. (Nat. Hist. l. 6. c. 26.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Arcadica sive, l. 8. p. 509. (q) Ut supra. (Nat. Hist. l. 6. c. 26.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "It shall never be inhabited, neither shall it be dwelt in from generation to generation: neither shall the {o} Arabian pitch tent there; neither shall the shepherds make their fold there.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It shall never be inhabited, neither shall it be dwelt in from generation to generation: neither shall the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Arabian pitch tent there; neither shall the shepherds make their fold there.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Who used to go from country to country to find pasture for their beasts, but they will find none.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Arabian",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word seems originally to mean “dweller in the desert,” but ultimately acquired the force of a proper name (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 9:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.). The site of Babylon will be shunned even by the wandering nomad, as an accursed and “uncanny” place.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "20–22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Babylon, after its overthrow, shall be a perpetual desolation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It shall never be inhabited",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This part of the prophecy did not receive its fulfillment till many centuries had gone by. From the time of Cyrus to that of Alexander the Great, Babylon was one of the chief cities of the Persian empire. Alexander was so struck with it, and with the excellence of its situation, that he designed to make it his capital. It first began seriously to decline under the Seleucidae, who built Seleucia on the Tigris as a rival to it, and still further injured it by fixing the seat of government at Antioch. But it had still a large population in the first century after our era (Josephus, 'Ant. Jud.,' 18:9, § 8); and is mentioned as a place of some consequence in the time of Trajan (Die Cass., 68:27), and even in that of Severue (Die Cass., 75:9). But after this it went rapidly to decay. Under the Sassuntans it disappears from sight; and when Benjamin of Tudela, in the twelfth century, visited the spot, there was nothing to be seen of the mighty city but those ruins of the Kasr, or palace, which still arrest the traveler's attention. The site had become, and has ever since remained, \"without inhabitant.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither shall the Arabian pitch tent there.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A superstitious feeling prevents the Arabs from encamping on the mounds of Babylon, which are believed to be the haunts of evil spirits (Rich, 'First Memoir on Babylon,' p. 67; Ker Porter, 'Travels,' vol. 2. p. 371). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither shall the shepherds make their fold there.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The nitrous soil of the Babylonian mounds allows them to produce nothing but the coarsest and most unpalatable vegetation. The shepherds consequently do not feed their flocks on them. Isaiah 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Babel, like the cities of the Pentapolis, had now become a perpetual desert. \"She remains uninhabited for ever, and unoccupied into generation of generations; and not an Arab pitches his tent there, and shepherds do not make their folds there. And there lie beasts of the desert, and horn-owls fill their houses; and ostriches dwell there, and field-devils hop about there. And jackals howl in her castles, and wild dogs in palaces of pleasure; and her time is near to come, and her days will not be prolonged.\" The conclusion is similar to that of the prophecy against Edom, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There the certainty of the prediction, even in its most minute particulars, is firmly declared; here the nearness of the time of fulfilment. But the fulfilment did not take place so soon as the words of the prophecy might make it appear. According to Herodotus, Cyrus, the leader of the Medo-Persian army, left the city still standing, with its double ring of walls. Darius Hystaspis, who had to conquer Babylon a second time in 518 b.c., had the walls entirely destroyed, with the exception of fifty cubits. Xerxes gave the last thrust to the glory of the temple of Belus. Having been conquered by Seleucus Nicator (312), it declined just in proportion as Seleucia rose. Babylon, says Pliny, ad solitudinem rediit exhausta vicinitate Seleuciae. At the time of Strabo (born 60 b.c.) Babylon was a perfect desert; and he applies to it (16:15) the words of the poet, ἐρημία μεγάλη ̓στὶν ἡ μεγάλη πόλις. Consequently, in the passage before us the prophecy falls under the law of perspective foreshortening. But all that it foretells has been literally fulfilled. The curse that Babylon would never come to be settled in and inhabited again (a poetical expression, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 33:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), proved itself an effectual one, when Alexander once thought of making Babylon the metropolis of his empire. He was carried off by an early death. Ten thousand workmen were at that time employed for two months in simply clearing away the rubbish of the foundations of the temple of Belus (the Nimrod-tower). \"Not an Arab pitches his tent there\" (‛Arâbi, from ‛Arâbâh, a steppe, is used here for the first time in the Old Testament, and then again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; yăhēl, different from yâhēl in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is a syncopated form of יאהל, tentorium figet, according to Ges. 68, Anm. 2, used instead of the customary יאהל): this was simply the natural consequence of the great field of ruins, upon which there was nothing but the most scanty vegetation. But all kinds of beasts of the desert and waste places make their homes there instead. The list commences with ziyyim (from zi, dryness, or from ziyi, an adj. relat. of the noun zi), i.e., dwellers in the desert; the reference here is not to men, but, as in most other instances, to animals, though it is impossible to determine what are the animals particularly referred to. That ochim are horned owls (Uhus) is a conjecture of Aurivillius, which decidedly commends itself. On benoth ya‛ănâh, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 39:13-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Wetzstein connects ya‛ănâh with an Arabic word for desert; it is probably more correct, however, to connect it with the Syriac יענא, greedy. The feminine plural embraces ostriches of both sexes, just as the 'iyyim (sing. אי  equals  אוי, from 'âvâh, to howl: see Bernstein's Lex. on Kirsch's Chrestom. Syr. p. 7), i.e., jackals, are called benât āwa in Arabic, without distinction of sex (awa in this appellation is a direct reproduction of the natural voice of the animal, which is called wawi in vulgar Arabic). Tan has also been regarded since the time of Pococke and Schnurrer as the name of the jackal; and this is supported by the Syriac and Targum rendering yaruro (see Bernstein, p. 220), even more than by the Arabic name of the wolf, tinân, which only occurs here and there. אי, ibnu āwa, is the common jackal found in Hither Asia (Canis aureus vulgaris), the true type of the whole species, which is divided into at least ten varieties, and belongs to the same genus as dogs and wolves (not foxes). Tan may refer to one of these varieties, which derived its name from its distinctive peculiarity as a long-stretched animal, whether the extension was in the trunk, the snout, or the tail. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The animals mentioned, both quadrupeds (râbatz) and birds (shâcan), are really found there, on the soil of ancient Babylon. When Kerporter was drawing near to the Nimrod-tower, he saw lions sunning themselves quietly upon its walls, which came down very leisurely when alarmed by the cries of the Arabs. And as Rich heard in Bagdad, the ruins are still regarded as a rendezvous for ghosts: sâ‛ir, when contrasted with ‛attūd, signifies the full-grown shaggy buck-goat; but here se‛irim is applied to demons in the shape of goats (as in Isaiah 34:14). According to the Scriptures, the desert is the abode of unclean spirits, and such unclean spirits as the popular belief or mythology pictured to itself were se‛irim. Virgil, like Isaiah, calls them saltantes Satyros. It is remarkable also that Joseph Wolf, the missionary and traveller to Bochâra, saw pilgrims of the sect of Yezidis (or devil-worshippers) upon the ruins of Babylon, who performed strange and horrid rites by moonlight, and danced extraordinary dances with singular gestures and sounds. On seeing these ghost-like, howling, moonlight pilgrims, he very naturally recalled to mind the dancing se‛irim of prophecy (see Moritz Wagner's Reise nach Persien und dem Lande der Kurden, Bd. ii. p. 251). And the nightly howling and yelling of jackals (‛ânâh after rikkēd, as in 1 Samuel 18:6-7) produces its natural effect upon every traveller there, just as in all the other ruins of the East. These are now the inhabitants of the royal 'armenoth, which the prophet calls 'almenoth with a sarcastic turn, on account of their widowhood and desolation; these are the inhabitants of the palaces of pleasure, the luxurious villas and country-seats, with their hanging gardens. The Apocalypse, in Revelation 18:2, takes up this prophecy of Isaiah, and applies it to a still existing Babylon, which might have seen itself in the mirror of the Babylon of old.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The animals mentioned, both quadrupeds (râbatz) and birds (shâcan), are really found there, on the soil of ancient Babylon. When Kerporter was drawing near to the Nimrod-tower, he saw lions sunning themselves quietly upon its walls, which came down very leisurely when alarmed by the cries of the Arabs. And as Rich heard in Bagdad, the ruins are still regarded as a rendezvous for ghosts: sâ‛ir, when contrasted with ‛attūd, signifies the full-grown shaggy buck-goat; but here se‛irim is applied to demons in the shape of goats (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 34:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). According to the Scriptures, the desert is the abode of unclean spirits, and such unclean spirits as the popular belief or mythology pictured to itself were se‛irim. Virgil, like Isaiah, calls them saltantes Satyros. It is remarkable also that Joseph Wolf, the missionary and traveller to Bochâra, saw pilgrims of the sect of Yezidis (or devil-worshippers) upon the ruins of Babylon, who performed strange and horrid rites by moonlight, and danced extraordinary dances with singular gestures and sounds. On seeing these ghost-like, howling, moonlight pilgrims, he very naturally recalled to mind the dancing se‛irim of prophecy (see Moritz Wagner's Reise nach Persien und dem Lande der Kurden, Bd. ii. p. 251). And the nightly howling and yelling of jackals (‛ânâh after rikkēd, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") produces its natural effect upon every traveller there, just as in all the other ruins of the East. These are now the inhabitants of the royal 'armenoth, which the prophet calls 'almenoth with a sarcastic turn, on account of their widowhood and desolation; these are the inhabitants of the palaces of pleasure, the luxurious villas and country-seats, with their hanging gardens. The Apocalypse, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", takes up this prophecy of Isaiah, and applies it to a still existing Babylon, which might have seen itself in the mirror of the Babylon of old.  ",
            "children": []
          }
        ]
      }
    ]
  }
]