[{"num":5,"verse":"Naaman, commander of the army of the king of Syria, was a great man with his master, accepted [and acceptable], because by him the Lord had given victory to Syria. He was also a mighty man of valor, but he was a leper."},{"num":2,"verse":"The Syrians had gone out in bands and had brought away captive out of the land of Israel a little maid, and she waited on Naaman’s wife."},{"num":3,"verse":"She said to her mistress, Would that my lord were with the prophet who is in Samaria! For he would heal him of his leprosy."},{"num":4,"verse":"[Naaman] went in and told his king, Thus and thus said the maid from Israel."},{"num":5,"verse":"And the king of Syria said, Go now, and I will send a letter to the king of Israel. And he departed and took with him ten talents of silver, 6,000 shekels of gold, and ten changes of raiment."},{"num":6,"verse":"And he brought the letter to the king of Israel. It said, When this letter comes to you, I will with it have sent to you my servant Naaman, that you may cure him of leprosy."},{"num":7,"verse":"When the king of Israel read the letter, he rent his clothes and said, Am I God, to kill and to make alive, that this man sends to me to heal a man of his leprosy? Just consider and see how he is seeking a quarrel with me."},{"num":8,"verse":"When Elisha the man of God heard that the king of Israel had rent his clothes, he sent to the king, asking, Why have you rent your clothes? Let Naaman come now to me and he shall know that there is a prophet in Israel."},{"num":9,"verse":"So Naaman came with his horses and chariots and stopped at Elisha’s door."},{"num":10,"verse":"Elisha sent a messenger to him, saying, Go and wash in the Jordan seven times, and your flesh shall be restored and you shall be clean."},{"num":11,"verse":"But Naaman was angry and went away and said, Behold, I thought he would surely come out to me and stand and call on the name of the Lord his God, and wave his hand over the place and heal the leper."},{"num":12,"verse":"Are not Abana and Pharpar, the rivers of Damascus, better than all the waters of Israel? May I not wash in them and be clean? So he turned and went away in a rage."},{"num":13,"verse":"And his servants came near and said to him, My father, if the prophet had bid you to do some great thing, would you not have done it? How much rather, then, when he says to you, Wash and be clean?"},{"num":14,"verse":"Then he went down and dipped himself seven times in the Jordan, as the man of God had said, and his flesh was restored like that of a little child, and he was clean."},{"num":15,"verse":"Then Naaman returned to the man of God, he and all his company, and stood before him. He said, Behold, now I know that there is no God in all the earth but in Israel. So now accept a gift from your servant."},{"num":16,"verse":"Elisha said, As the Lord lives, before Whom I stand, I will accept none. He urged him to take it, but Elisha refused."},{"num":17,"verse":"Naaman said, Then, I pray you, let there be given to me, your servant, two mules’ burden of earth. For your servant will henceforth offer neither burnt offering nor sacrifice to other gods, but only to the Lord."},{"num":18,"verse":"In this thing may the Lord pardon your servant: when my master [the king] goes into the house of [his god] Rimmon to worship there, and he leans on my hand and I bow myself in the house of Rimmon, when I bow down myself in the house of Rimmon, may the Lord pardon your servant in this thing."},{"num":19,"verse":"Elisha said to him, Go in peace. So Naaman departed from him a little way."},{"num":20,"verse":"But Gehazi, the servant of Elisha the man of God, said, Behold, my master spared this Naaman the Syrian, in not receiving from his hands what he brought. But as the Lord lives, I will run after him and get something from him."},{"num":21,"verse":"So Gehazi followed after Naaman. When Naaman saw one running after him, he lighted down from the chariot to meet him and said, Is all well?"},{"num":22,"verse":"And he said, All is well. My master has sent me to say, There have just come to me from the hill country of Ephraim two young men of the sons of the prophets. I pray you, give them a talent of silver and two changes of garments."},{"num":23,"verse":"And Naaman said, Be pleased to take two talents. And he urged him, and bound two talents of silver in two bags with two changes of garments and laid them upon two of his servants, and they bore them before Gehazi."},{"num":24,"verse":"When he came to the hill, he took them from their hands and put them in the house; and he sent the men away, and they left."},{"num":25,"verse":"He went in and stood before his master. Elisha said, Where have you been, Gehazi? He said, Your servant went nowhere."},{"num":26,"verse":"Elisha said to him, Did not my spirit go with you when the man turned from his chariot to meet you? Was it a time to accept money, garments, olive orchards, vineyards, sheep, oxen, menservants, and maidservants?"},{"num":27,"verse":"Therefore the leprosy of Naaman shall cleave to you and to your offspring forever. And Gehazi went from his presence a leper as white as snow."}]