[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 17:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 17:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Absalom and all the men of Israel said — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Being infatuated by a divine power, and given up to believe a lie. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The counsel of Hushai is better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — His advice was much better suited to Absalom’s cruelty, as well as his vanity; and seemingly to the interest of his ambition, as well as the safety of his followers, (who did not care to put any thing to the hazard of a small party,) and therefore it easily prevailed. Such is the wonderful overruling providence of God in more cases than we are aware of! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the Lord had appointed to defeat the good counsel of Ahithophel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was good politically considered; being the wisest and most effectual course to accomplish the end Absalom had in view. Be it observed here, to the comfort of all that fear God, he turns all men’s hearts as the rivers of water. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stands in the congregation of the mighty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "has an overruling hand in all counsels, and a negative voice in all resolves, and laughs at men’s projects against his children.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:1-21 Here was a wonderful effect of Divine Providence blinding Absalom's mind and influencing his heart, that he could not rest in Ahithophel's counsel, and that he should desire Hushai's advice. But there is no contending with that God who can arm a man against himself, and destroy him by his own mistakes and passions. Ahithophel's former counsel was followed, for God intended to correct David; but his latter counsel was not followed, for God meant not to destroy him. He can overrule all counsels. Whatever wisdom or help any man employs or affords, the success is from God alone, who will not let his people perish.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the dew - Like the drops of dew, in the vast number of our host, and in our irresistible and unavoidable descent upon our enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. The counsel of Hushai the Archite is better than the counsel of Ahithophel—The reasons specified being extremely plausible, and expressed in the strong hyperbolical language suited to dazzle an Oriental imagination, the council declared in favor of Hushai's advice; and their resolution was the immediate cause of the discomfiture of the rebellion, although the council itself was only a link in the chain of causation held by the controlling hand of the Lord.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Absalom and all the men of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were infatuated by a Divine power, and given up to believe lies and mistakes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord had appointed to defeat the good counsel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so it was, politically considered; being the wisest and most effectual course to accomplish Absalom’s end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Absalom and all the men of Israel said,.... That is, the elders, who before approved of the counsel of Ahithophel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 17:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the counsel of Hushai the Archite is better than the counsel of Ahithophel; it appeared to them most plausible, and most likely to be attended with success: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord had appointed to defeat the good counsel of Ahithophel; for so it was to Absalom and his party the best and wisest that could be given them; but it was the Lord's will it should be defeated, and therefore the minds of Absalom and of the elders of Israel were blinded: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to the intent that the Lord might bring evil upon Absalom; his person and cause; that his cause might be ruined, and he himself slain in battle; see Proverbs 19:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to the intent that the Lord might bring evil upon Absalom; his person and cause; that his cause might be ruined, and he himself slain in battle; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 19:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Absalom and all the men of Israel said, The counsel of Hushai the Archite is better than the counsel of Ahithophel. For the LORD had appointed to defeat the {d} good counsel of Ahithophel, to the intent that the LORD might {e} bring evil upon Absalom.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Absalom and all the men of Israel said, The counsel of Hushai the Archite ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " better than the counsel of Ahithophel. For the LORD had appointed to defeat the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " good counsel of Ahithophel, to the intent that the LORD might ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " bring evil upon Absalom.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) That counsel which seemed good at first to Absalom, 2Sa 17:4.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) For by the counsel of Hushai, he went to the battle, where he was destroyed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hushai saw that it was essential to gain time, “in order,” to quote the words of Tacitus, “to give the disaffected time to repent, and the loyal time to unite: crimes gain by hasty action, better counsels by delay.” (Tac. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i. 32.) His scheme was cleverly devised to appeal to Absalom’s vanity and love of display. It seemed safe and easy: it was a far more attractive idea for Absalom to march in person against David at the head of an immense army, than for him to let Ahithophel complete the revolution by a decisive action at once. His vanity proved his ruin. He forgot that a general levy would involve no slight delay: he forgot that the rising was by no means certain to be general, and that when the first surprise of the insurrection was over, many would return to their allegiance to David. But Absalom and his counsellors were blinded by a divinely ordered infatuation. “Quern vult Deus deperdere, dementat prius.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The counsel of Hushai is better.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It seemed safer. Nothing in it was left to chance, and Absalom, already at the head of such numbers as to be able to select from them twelve thousand picked men, saw himself, in fancy, marching forward with all Israel at his feet. As a matter of fact, he did advance with so large an army that David was saved only by the skilful strategy of Joab. Like other king makers, Ahithophel had put himself too forward. He asked for twelve thousand men to be placed under his command, that he might smite David, and so be, not only Absalom's counsellor, but also his commander-in-chief. Amasa and the other commanders would be displeased at this, and Absalom would feel that he was himself placed in a very secondary position. Ahithophel may have asked for the command solely because no one's presence would so ensure success as his own, but he wounded the vanity beth of Absalom and Amasa, and made them ready to listen to any other advice that might be offered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord had appointed;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and Jehovah had commanded to bring to nought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. So plain did it seem to the writer that Absalom's success depended upon rapid action, that nothing less than the direct interference of the Divine providence could account for the infatuation of Absalom and his counsellors. 2 Samuel 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he secured his end. Absalom and all Israel thought his advice better than that of Ahithophel; for it was intended to commend itself to Absalom and his supporters. \"The counsel appeared safe; at the same time it was full of a certain kind of boasting, which pleased the younger men\" (Clericus). All that Hushai had said about the bravery and heroism of David and his followers, was well founded. The deception lay in the assumption that all the people from Dan to Beersheba would crowd around Absalom as one man; whereas it might easily be foreseen, that after the first excitement of the revolution was over, and great calmness ensued, a large part of the nation and army would gather round David. But such a possibility as this never entered the minds of Absalom and his supporters. It was in this that the divine sentence referred to in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was seen: \"The Lord had commanded (appointed) it, to defeat the good counsel of Ahithophel, that he might bring the evil (intended) upon Absalom.\"  ",
        "children": []
      }
    ]
  }
]