[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Pitched in the land of Gilead.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Gilead is the tract of country on the east of the Jordan, extending from the land of Moab on the south to Bashan on the north, the valley of the Hieromax forming probably its northern boundary. The site of Mahanaim has not been identified, but it was almost certainly within the territory of Gilead. Absalom, however, did not actually reach Mahanaim before he met and was defeated by the forces of David.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:22-29 Ahithophel hanged himself for vexation that his counsel was not followed. That will break a proud man's heart which will not break a humble man's sleep. He thought himself in danger, concluding, that, because his counsel was not followed, Absalom's cause would fail; and to prevent a possible public execution, he does justice upon himself. Thus the breath is stopped, and the head laid low, from which nothing could be expected but mischief. Absalom chased his father. But observe how God sometimes makes up to his people that comfort from strangers, which they are disappointed of in their own families. Our King needs not our help; but he assures us, that what we do for the least of his brethren, who are sick, poor, and destitute, shall be accepted and recompensed as if done to himself",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ithra an Israelite - Or \"Jether the Ishmeelite\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Ithra\" and \"Jether\" are practically the same names. \"Israelite\" in the text is wrong. It should be either \"Ishmaelite\" or \"Jezreelite\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Abigail the daughter of Nahash - If Zeruiah and Abigail were Jesse's daughters, the only probable way of reconciling our text with 1 Chronicles 2:16-17, is to suppose that Nahash was Jesse's wife. If Zeruiah and Abigail were only sisters of David by the mother, then Nahash might be the name of her first husband. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Abigail the daughter of Nahash - If Zeruiah and Abigail were Jesse's daughters, the only probable way of reconciling our text with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 2:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is to suppose that Nahash was Jesse's wife. If Zeruiah and Abigail were only sisters of David by the mother, then Nahash might be the name of her first husband. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. Amasa—By the genealogy it appears that this captain stood in the same relation to David as Joab, both being his nephews. Of course, Amasa was Absalom's cousin, and though himself an Israelite, his father was an Ishmaelite (1Ch 2:17).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nahash—is thought by some to be another name of Jesse, or according to others, the name of Jesse's wife.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So Israel and Absalom pitched in the land of Gilead. Which belonged to the tribes of Reuben and Gad, and the half tribe of Manasseh; here the Israelites that were with Absalom encamped, in order to give battle to David and his men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So Israel and Absalom pitched in the land of Gilead.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Absalom had made Amasa captain over his army instead of Joab, who had remained true to David, and had gone with his king to Mahanaim. Amasa was the son of a man named Jithra, היּשׂראלי, who had gone in to (i.e., had seduced) Abigail, the daughter of Nahash and sister of Zeruiah, Joab's mother. He was therefore an illegitimate cousin of Joab. The description given of Jithra as ישׂראלי is very striking, since there was no reason whatever why it should be stated that Amasa's father was an Israelite. The Seventy have therefore given ὁ Ἰεζραηλίτης, i.e., sprung from Jezreel, where David's wife Ahinoam came from (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 27:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but they have done so apparently from mere conjecture. The true reading is evidently היּשׁמעאלי, an Ishmaelite, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the name is written Jether, a contracted form of Jithra. From the description given of Abigail as a daughter of Nahash and sister of Zeruiah, not of David, some of the earlier commentators have very justly concluded that Abigail and Zeruiah were only step-sisters of David, i.e., daughters of his mother by Nahash and not by Jesse. ",
        "children": []
      }
    ]
  }
]