[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Call now Hushai.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The good sense of Absalom and all the people at once approved the counsel of Ahithophel; but, at a crisis so important, Absalom sought the advice also of the other famous counsellor of his father.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 17:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 17:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then said Absalom, Call now Hushai — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A wonderful effect of Divine Providence, influencing his heart, that he could not rest in Ahithophel’s counsel, though it was so evidently wise, and approved by the general consent of his whole party; and that he should desire Hushai’s advice, though neither his reputation for wisdom was equal to Ahithophel’s, nor had he yet given any one proof of his fidelity to Absalom. But there is no contending with that God who can arm a man against himself, and destroy him by his own mistakes and passions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:1-21 Here was a wonderful effect of Divine Providence blinding Absalom's mind and influencing his heart, that he could not rest in Ahithophel's counsel, and that he should desire Hushai's advice. But there is no contending with that God who can arm a man against himself, and destroy him by his own mistakes and passions. Ahithophel's former counsel was followed, for God intended to correct David; but his latter counsel was not followed, for God meant not to destroy him. He can overrule all counsels. Whatever wisdom or help any man employs or affords, the success is from God alone, who will not let his people perish.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The man whom thou seekest - namely, David. Ahithophel means to say: \"If I can only smite David, there will be no civil war, all the people will peaceably submit.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 17",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2Sa 17:1-14. Ahithophel's Counsel Overthrown by Hushai.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-11. Moreover Ahithophel said unto Absalom—The recommendation to take prompt and decisive measures before the royalist forces could be collected and arranged, evinced the deep political sagacity of this councillor. The adoption of his advice would have extinguished the cause of David; and it affords a dreadful proof of the extremities to which the heartless prince was, to secure his ambitious objects, prepared to go, that the parricidal counsel \"pleased Absalom well, and all the elders of Israel.\" It was happily overruled, however, by the address of Hushai, who saw the imminent danger to which it would expose the king and the royal cause. He dwelt upon the warlike character and military experience of the old king—represented him and his adherents as mighty men, who would fight with desperation; and who, most probably, secure in some stronghold, would be beyond reach, while the smallest loss of Absalom's men at the outset might be fatal to the success of the conspiracy. But his dexterity was chiefly displayed in that part of his counsel which recommended a general levy throughout the country; and that Absalom should take command of it in person—thereby flattering at once the pride and ambition of the usurper. The bait was caught by the vainglorious and wicked prince.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " A wonderful effect of Divine Providence, blinding his mind, and influencing his heart, that he could not rest in Ahithophel’s counsel, though it was so evidently wise, and good, and approved by the general consent of his whole party; and that he should desire Hushai’s advice, though neither his reputation for wisdom was equal to Ahithophel’s, nor had he yet given any one proof of his fidelity to Absalom as Ahithophel had done; nor was he so fixed by his interest to him as Ahithophel was; and though there wanted not just cause to suspect him and his counsel too. But there is no contending with that God who can arm a man against himself, and destroy him by his own mistakes and passions, without any other help. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said Absalom, call now Hushai the Archite also,.... For it seems he was not at the council board at this time; whether he was as yet admitted to it is not certain: there is something very remarkable in the providence of God, to incline Absalom to have the opinion of Hushai upon this point, when the counsel of Ahithophel was so universally approved of; and Hushai also being well known to have been an intimate friend and confident of David's, and not so settled and established in the interest of Absalom, and such a sworn friend of his as Ahithophel was; this can only be ascribed to the will of God, to defeat the counsel of Ahithophel, and the wisdom of divine Providence in blinding the mind of Absalom with respect to his counsel, and inclining it to take the opinion of Hushai: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let us hear likewise what he saith; which he might say without any diffidence about the \"counsel\" given, but knowing that in the multitude of counsellors there is safety; and Hushai being a wise and good counsellor, he might hope and expect that he would give the same advice, and so strengthen and confirm it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and let us hear likewise what he saith; which he might say without any diffidence about the \"counsel\" given, but knowing that in the multitude of counsellors there is safety; and Hushai being a wise and good counsellor, he might hope and expect that he would give the same advice, and so strengthen and confirm it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then said Absalom, Call now Hushai the Archite also, and let us hear likewise what he saith.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let us hear likewise what he saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let us hear what he too has to say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as well as Ahithophel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2 Samuel 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Although this advice pleased Absalom and all the elders of Israel (present), Absalom sent for Hushai the Archite to hear his opinion. גּם־הוּא serves to strengthen the suffix in בּפיו (cf. Ewald, 311, a.). ",
        "children": []
      }
    ]
  }
]