[{"num":44,"verse":"1 The faithful remember the great mercy of God toward his people. 9 After they complain, because they feel it no more. 17 Also they allege the covenant made with Abraham, for the keeping whereof they show what grievous things they suffered. 23 Finally, they pray unto God not to contemn their affliction, seeing the same redoundeth to the contempt of his honor."},{"num":1,"verse":"We have heard with our ears, O God: our fathers have told us the works that thou hast done in their days, in the old time:"},{"num":2,"verse":"How thou hast driven out the heathen with thine hand, and planted them: how thou hast destroyed the people, and caused them to grow."},{"num":3,"verse":"For they inherited not the land by their own sword, neither did their own arm save them: but thy right hand, and thine arm, and the light of thy countenance, because thou didst favor them."},{"num":4,"verse":"Thou art my king, O God: send help unto Jacob."},{"num":5,"verse":"Through thee have we thrust back our adversaries: by thy Name have we trodden down them that rose up against us."},{"num":6,"verse":"For I do not trust in my bow, neither can my sword save me."},{"num":7,"verse":"But thou hast saved us from our adversaries, and hast put them to confusion that hate us."},{"num":8,"verse":"Therefore will we praise God continually, and will confess thy Name forever. Selah."},{"num":9,"verse":"But now thou art far off, and puttest us to confusion, and goest not forth with our armies."},{"num":10,"verse":"Thou makest us to turn back from the adversary, and they which hate us, spoil for themselves."},{"num":11,"verse":"Thou givest us as sheep to be eaten, and dost scatter us among the nations."},{"num":12,"verse":"Thou sellest thy people without gain, and dost not increase their price."},{"num":13,"verse":"Thou makest us a reproach to our neighbors, a jest and laughing stock to them that are round about us."},{"num":14,"verse":"Thou makest us a proverb among the nations, and a nodding of the head among the people."},{"num":15,"verse":"My confusion is daily before me, and the shame of my face hath covered me,"},{"num":16,"verse":"For the voice of the slanderer and rebuker, for the enemy and avenger."},{"num":17,"verse":"All this is come upon us, yet do we not forget thee, neither deal we falsely concerning thy covenant."},{"num":18,"verse":"Our heart is not turned back: neither our steps gone out of thy paths,"},{"num":19,"verse":"Albeit thou hast smitten us down into the place of dragons, and covered us with the shadow of death."},{"num":20,"verse":"If we have forgotten the Name of our God, and held up our hands to a strange god,"},{"num":21,"verse":"Shall not God search this out? for he knoweth the secrets of the heart."},{"num":22,"verse":"Surely for thy sake are we slain continually, and are counted as sheep for the slaughter."},{"num":23,"verse":"Up, why sleepest thou, O Lord? awake, be not far off forever."},{"num":24,"verse":"Wherefore hidest thou thy face? and forgettest our misery and our affliction?"},{"num":25,"verse":"For our soul is beaten down unto the dust: our belly cleaveth to the ground."},{"num":26,"verse":"Rise up for our succor, and redeem us for thy mercy’s sake."}]