[{"header":"David Sins with Bathsheba"},{"num":11,"verse":"In the spring, when the kings normally went out to war, David sent out Joab, his servants, and all the Israelites. They destroyed the Ammonites and attacked the city of Rabbah. But David stayed in Jerusalem. "},{"num":2,"verse":"One evening David got up from his bed and walked around on the roof of his palace. While he was on the roof, he saw a woman bathing. She was very beautiful. "},{"num":3,"verse":"So David sent his servants to find out who she was. A servant answered, “That woman is Bathsheba daughter of Eliam. She is the wife of Uriah the Hittite.” "},{"num":4,"verse":"So David sent messengers to bring Bathsheba to him. When she came to him, he had sexual relations with her. (Now Bathsheba had purified herself from her monthly period.) Then she went back to her house. "},{"num":5,"verse":"But Bathsheba became pregnant and sent word to David, saying, “I am pregnant.”"},{"num":6,"verse":"So David sent a message to Joab: “Send Uriah the Hittite to me.” And Joab sent Uriah to David. "},{"num":7,"verse":"When Uriah came to him, David asked him how Joab was, how the soldiers were, and how the war was going. "},{"num":8,"verse":"Then David said to Uriah, “Go home and rest.”"},{"num":9,"verse":"But Uriah did not go home. Instead, he slept outside the door of the palace as all the king’s officers did."},{"num":10,"verse":"The officers told David, “Uriah did not go home.”"},{"num":11,"verse":"Uriah said to him, “The Ark and the soldiers of Israel and Judah are staying in tents. My master Joab and his officers are camping out in the fields. It isn’t right for me to go home to eat and drink and have sexual relations with my wife!”"},{"num":12,"verse":"David said to Uriah, “Stay here today. Tomorrow I’ll send you back to the battle.” So Uriah stayed in Jerusalem that day and the next. "},{"num":13,"verse":"Then David called Uriah to come to see him, so Uriah ate and drank with David. David made Uriah drunk, but he still did not go home. That evening Uriah again slept with the king’s officers."},{"num":14,"verse":"The next morning David wrote a letter to Joab and sent it by Uriah. "},{"num":15,"verse":"In the letter David wrote, “Put Uriah on the front lines where the fighting is worst and leave him there alone. Let him be killed in battle.”"},{"num":16,"verse":"Joab watched the city and saw where its strongest defenders were and put Uriah there. "},{"num":17,"verse":"When the men of the city came out to fight against Joab, some of David’s men were killed. And Uriah the Hittite was one of them."},{"num":18,"verse":"Then Joab sent David a complete account of the war. "},{"num":19,"verse":"Joab told the messenger, “Tell King David what happened in the war. "},{"num":20,"verse":"After you finish, the king may be angry and ask, ‘Why did you go so near the city to fight? Didn’t you know they would shoot arrows from the city wall? "},{"num":21,"verse":"Do you remember who killed Abimelech son of Jerub-Besheth? It was a woman on the city wall. She threw a large stone for grinding grain on Abimelech and killed him there in Thebez. Why did you go so near the wall?’ If King David asks that, tell him, ‘Your servant Uriah the Hittite also died.’”"},{"num":22,"verse":"The messenger left and went to David and told him everything Joab had told him to say. "},{"num":23,"verse":"The messenger told David, “The men of Ammon were winning. They came out and attacked us in the field, but we fought them back to the city gate. "},{"num":24,"verse":"The archers on the city wall shot at your servants, and some of your men were killed. Your servant Uriah the Hittite also died.”"},{"num":25,"verse":"David said to the messenger, “Say this to Joab: ‘Don’t be upset about this. The sword kills everyone the same. Make a stronger attack against the city and capture it.’ Encourage Joab with these words.”"},{"num":26,"verse":"When Bathsheba heard that her husband was dead, she cried for him. "},{"num":27,"verse":"After she finished her time of sadness, David sent servants to bring her to his house. She became David’s wife and gave birth to his son, but the Lord did not like what David had done."}]