[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) The prophet is now supposed by many commentators to say that the Temple might as well be closed, as far as concerns any pleasure the Lord takes in their offerings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who is there even among you . . . doors . . . altar for nought.—Those that take the above-mentioned view of the passage would render, O that there were one among even you who would shut the doors, that ye might not light mine altar to no purpose. “To no purpose,” like δωρεάν (Galatians 2:21). The rebuke contained in this verse is, according to this interpretation, very similar to that of Isaiah 1:11-15. But the word “even,” which can only refer to “you” (Keil thinks differently), seems to us almost fatal to this interpretation. For we could only explain its use in the forced sense of: “Would that some one, among even you (who ought to be the promoters of God’s service), would (since His service has now become a mockery) shut, &c.” We are therefore inclined to retain the simple rendering of our venerable English Version. In that case, “even among you” (perhaps better, among even you) would mean: “even among you whose duty it is, and chief pleasure it ought to be, to minister unto Me,” which, in that context, so far from being forced, would be most natural.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Who is there even among you . . . doors . . . altar for nought",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".—Those that take the above-mentioned view of the passage would render, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "O that there were one among even you who would shut the doors, that ye might not light mine altar to no purpose. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "“To no purpose,” like ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "δωρεάν",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 2:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The rebuke contained in this verse is, according to this interpretation, very similar to that of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:11-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But the word “even,” which can only refer to “you” (Keil thinks differently), seems to us almost fatal to this interpretation. For we could only explain its use in the forced sense of: “Would that some one, among even you (who ought to be the promoters of God’s service), would (since His service has now become a mockery) shut, &c.” We are therefore inclined to retain the simple rendering of our venerable English Version. In that case, “even among you” (perhaps better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "among even you",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") would mean: “even among you whose duty it is, and chief pleasure it ought to be, to minister unto Me,” which, in that context, so far from being forced, would be most natural.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For nought.—Comp. the attitude of the priests in 1Samuel 2:13-16.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "For nought.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Comp. the attitude of the priests in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 2:13-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-14 We may each charge upon ourselves what is here charged upon the priests. Our relation to God, as our Father and Master, strongly obliges us to fear and honour him. But they were so scornful that they derided reproof. Sinners ruin themselves by trying to baffle their convictions. Those who live in careless neglect of holy ordinances, who attend on them without reverence, and go from them under no concern, in effect say, The table of the Lord is contemptible. They despised God's name in what they did. It is evident that these understood not the meaning of the sacrifices, as shadowing forth the unblemished Lamb of God; they grudged the expense, thinking all thrown away which did not turn to their profit. If we worship God ignorantly, and without understanding, we bring the blind for sacrifice; if we do it carelessly, if we are cold, dull, and dead in it, we bring the sick; if we rest in the bodily exercise, and do not make heart-work of it, we bring the lame; and if we suffer vain thoughts and distractions to lodge within us, we bring the torn. And is not this evil? Is it not a great affront to God, and a great wrong and injury to our own souls? In order to the acceptance of our actions with God, it is not enough to do that which, for the matter of it, is good; but we must do it from a right principle, in a right manner, and for a right end. Our constant mercies from God, make worse our slothfulness and stubbornness, in our returns of duty to God. A spiritual worship shall be established. Incense shall be offered to God's name, which signifies prayer and praise. And it shall be a pure offering. When the hour came, in which the true worshippers worshipped the Father in Spirit and in truth, then this incense was offered, even this pure offering. We may rely on God's mercy for pardon as to the past, but not for indulgence to sin in future. If there be a willing mind, it will be accepted, though defective; but if any be a deceiver, devoting his best to Satan and to his lusts, he is under a curse. Men now, though in a different way, profane the name of the Lord, pollute his table, and show contempt for his worship.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who is there even among you? - This stinginess in God's service was not confined to those offices which cost something, as the sacrifices. Not even services absolutely costless, which required only a little trouble, as that of closing the folding-doors of the temple or the outer court, or bringing the fire to consume the sacrifices, would they do without some special hire. All was mercenary and hireling service. Others have rendered it as a wish, \"who is there among you!\" i. e., would that there were one among you, who would close the doors altogether; so shall ye not kindle fire on Mine altar for nought, i. e., fruitlessly! But apart from the difficulty of the construction, it is not God's way to \"quench the smouldering flax.\" He who bids, \"Gather up the fragments that remain, that nothing be lost,\" accepts any imperfect service rather than none. He does not break off the last link, which binds man to Himself. Then, if or when God willed His service to surcease, He would do it Himself, as He did by the destruction of the temple before the captivity, or finally by the Romans. It would have been an ungodly act (such as was only done by Ahaz, perhaps the most ungodly king of Israel) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and one which especially called down His wrath ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to close the doors, and therewith to break off all sacrifice. Manasseh carried the worship of false gods into the temple itself; Ahaz, as far as in him lay, abolished the service of God. A prophet of God could not express a wish, that pious Israelites (for it is presupposed that they would do this out of zeal for God's honor) should bring the service of God to an end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He sums up with an entire rejection of them, present and future. \"I have no pleasure in you;\" it is a term of repudiation , sometimes of disgust  \"neither will I accept an offering at your hands.\" He says not simply Jeremiah 6:20, \"your burnt-offerings are not acceptable, nor your sacrifices sweet unto Me, but, I will not accept it.\" Such as they were, such they would be hereafter. God would not accept their sacrifices, but would replace them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He sums up with an entire rejection of them, present and future. \"I have no pleasure in you;\" it is a term of repudiation , sometimes of disgust  \"neither will I accept an offering at your hands.\" He says not simply ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"your burnt-offerings are not acceptable, nor your sacrifices sweet unto Me, but, I will not accept it.\" Such as they were, such they would be hereafter. God would not accept their sacrifices, but would replace them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Who … for naught—Not one even of the least priestly functions (as shutting the doors, or kindling a fire on the altar) would ye exercise without pay, therefore ye ought to fulfil them faithfully (1Co 9:13). Drusius and Maurer translate, \"Would that there were absolutely some one of you who would shut the doors of the temple (that is, of the inner court, in which was the altar of burnt offerings), and that ye would not kindle fire on My altar in vain!\" Better no sacrifices than vain ones (Isa 1:11-15). It was the duty of some of the priests to stand at the doors of the court of the altar of burnt offerings, and to have excluded blemished victims [Calvin].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Some make this verse to be a kind of wish that there were some among them that would shut up the doors of the temple, and keep out such sacrifices and sacrificers; it would be less displeasing to God, it were better not done at all that so ill done, and so long as it is so ill done God can have no pleasure in it or them. Others make it a reproof of the priests upbraided for their profane contempt of God, and for their inexcusable negligence, while they are so well paid for all their service, be it ever so little and inconsiderable, as the lighting a fire on the altar, or shutting the doors of the temple: Inexcusable dishonesty, to receive large wages, and neglect your work! ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have no pleasure in you; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I cannot be pleased with such servants and services: or it is a meiosis, I am very greatly displeased with you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither will I accept an offering at your hand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst you are thus profane and contemptuous, I will never accept your gifts, but reject you and them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who is there even among you that would shut the doors for nought?.... Either of the temple, as the Targum and Jarchi; for at each of the gates of the temple there were porters appointed in David's time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 26:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and who were paid for their service: or of the court, as Kimchi; the court of the priests where the offerings were brought. The words \"for nought\" are not, in the original text, at the end of this clause, but at the end of the next; and are by some referred to both; and by others restrained to the latter; and who give this as the sense of the words, \"who is there\", or \"would there were any among you?\" (f) any good man that would shut the doors of the temple, that so a man might not bring an abominable offering; intimating, that the priests or Levites however, who were porters, ought to shut the doors against such persons; and this way go Jarchi, Kimchi, and Abarbinel; to which the Chaldee paraphrase inclines; which is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"who is there among you that will shut the door of the house of my sanctuary, that ye may not offer on mine altar an abominable sacrifice?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but the same writers, out of an ancient book called Torath Cohanim, observe a sense that agrees with ours, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"a man says to his friend, shut this door for me, he desires nothing for it; light me this candle, he asks no reward for it; but as for you, who is there among you that will shut my doors for nought? or kindle a fire on mine altar for nought? and how much less will ye do freely those things which used to be done for reward? therefore I have no pleasure in you.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There were four and twenty porters to open and shut the doors of the mountain of the house, or the temple, and the court of women in the daytime; six on the east side; four on the north; four on the south; at Asuppim two and two, four in all; four on the west, and two at Parbar (g): here they attended in the daytime, to keep the place pure and peaceable; and there seems to have been one over all the rest, whose business was to see that the doors at evening were shut by them: in the Misnah (h) we are told that Ben Geber was appointed over the shutting of the gates, i.e. of the temple; and at night there were four and twenty guards also that kept watch; the priests kept guard in three places; in the room \"abtines\", in the room \"nitsots\", and in the fire room; and one and twenty Levites; five at the five gates of the mountain of the house, or the compass of the temple; four at the four corners within; five at the five gates of the court; and four at its four corners without; one at the chamber \"Corban\"; one at the chamber over against the vail; and another behind the most holy place; and there was one that was called the man of the mountain of the house, who every night went through every ward with torches burning before him; and he had power to beat those he found asleep in their watch, and to burn their garments (i), to which the allusion is, Revelation 16:15, and these guards, as Bartenora (k) observes, were not on account of thieves and robbers, but for the honour of the house; and these, neither the one by day, nor the other by night, did their work for nought, but had a maintenance allowed them for it: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There were four and twenty porters to open and shut the doors of the mountain of the house, or the temple, and the court of women in the daytime; six on the east side; four on the north; four on the south; at Asuppim two and two, four in all; four on the west, and two at Parbar (g): here they attended in the daytime, to keep the place pure and peaceable; and there seems to have been one over all the rest, whose business was to see that the doors at evening were shut by them: in the Misnah (h) we are told that Ben Geber was appointed over the shutting of the gates, i.e. of the temple; and at night there were four and twenty guards also that kept watch; the priests kept guard in three places; in the room \"abtines\", in the room \"nitsots\", and in the fire room; and one and twenty Levites; five at the five gates of the mountain of the house, or the compass of the temple; four at the four corners within; five at the five gates of the court; and four at its four corners without; one at the chamber \"Corban\"; one at the chamber over against the vail; and another behind the most holy place; and there was one that was called the man of the mountain of the house, who every night went through every ward with torches burning before him; and he had power to beat those he found asleep in their watch, and to burn their garments (i), to which the allusion is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and these guards, as Bartenora (k) observes, were not on account of thieves and robbers, but for the honour of the house; and these, neither the one by day, nor the other by night, did their work for nought, but had a maintenance allowed them for it: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "neither do ye kindle fire upon mine altar for nought: and this was done every morning, for though, as one of the Jewish writers says (l), fire came down, from heaven, it was ordered that they should bring of common fire; and there were three piles or rows of fire made every day upon the altar; the first was a large one, on which they offered the daily sacrifice, with the rest of the offerings; the second was on the side of it, a little one, from whence they took fire in the censer to burn incense every day; the third had no other use for it but to confirm the command concerning fire; as it is said, \"the fire shall ever be burning\", Leviticus 6:13 (m) and this fire was kindled to burn the sacrifices, the daily sacrifice, and other burnt offerings, for which they were paid out of the tithes, and other oblations; see 1 Corinthians 9:13 this was an aggravation of their negligence and carelessness about what offerings were brought and sacrificed; seeing they were so well taken care of, and such a sufficient maintenance provided for them; so that they did not the least piece of service in the temple but they were fully rewarded for it; even not so much as to shut a door, or kindle a fire; and therefore it is no wonder their conduct should be resented, as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither do ye kindle fire upon mine altar for nought: and this was done every morning, for though, as one of the Jewish writers says (l), fire came down, from heaven, it was ordered that they should bring of common fire; and there were three piles or rows of fire made every day upon the altar; the first was a large one, on which they offered the daily sacrifice, with the rest of the offerings; the second was on the side of it, a little one, from whence they took fire in the censer to burn incense every day; the third had no other use for it but to confirm the command concerning fire; as it is said, \"the fire shall ever be burning\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (m) and this fire was kindled to burn the sacrifices, the daily sacrifice, and other burnt offerings, for which they were paid out of the tithes, and other oblations; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this was an aggravation of their negligence and carelessness about what offerings were brought and sacrificed; seeing they were so well taken care of, and such a sufficient maintenance provided for them; so that they did not the least piece of service in the temple but they were fully rewarded for it; even not so much as to shut a door, or kindle a fire; and therefore it is no wonder their conduct should be resented, as follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I have no pleasure in you, saith the Lord of hosts; neither in your persons, nor in your offerings: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither will I accept an offering at your hand: the \"minchah\" or meat offering, any meat offering, particularly that which was offered morning and evening with the daily sacrifice, Exodus 29:40 and it is sometimes used particularly for the evening meat offering, 2 Kings 16:15 or rather, \"a wheat\" or \"bread offering\"; since this offering was made of fine flour, with oil poured upon it, and frankincense put upon that, Leviticus 2:1 hence mention is made of \"incense\" in the next verse Malachi 1:11; and it was either baked in an oven, or fried in a pan; and either way, when it was brought to the priest, it was burnt on the altar, and was an offering by fire to the Lord, and of a sweet savour to him, when rightly performed; and was a figure of the sacrifice of Christ, which is of a sweet smelling savour to God; and this passage respects Gospel times, as appears from the following verse Malachi 1:11, when Christ's sacrifice would be offered up, and so the oblation or meat offering made to cease, Daniel 9:27 hence God would not accept of it any more; or else because not rightly offered, as it was not when any leaven was mixed with it, or that and honey were burnt with it; signifying it should be offered with sincerity, and without hypocrisy, and other carnal lusts; and indeed no legal sacrifices were acceptable to God but such as were offered up in the faith of Christ, and with a view to his sacrifice, without trusting to, and depending upon, the outward offering, as hypocrites and carnal persons did: wherefore to this is opposed a pure \"minchah\" or meat offering in the next verse Malachi 1:11; which designs spiritual sacrifices, such as are now offered up under the Gospel dispensation; when offering and sacrifice of a ceremonial kind God desires not; he will have no more offered up; he takes no pleasure in them; they are not acceptable to him, being superseded by the sacrifice of his Son, they were types of; see Psalm 40:6 and agreeably to which passages the words may be understood, as expressing the Lord's rejection of legal sacrifices in general among the Jews, which he would have no longer continued than till the Messiah came; by whose sufferings and death the daily sacrifice was caused to cease, Daniel 9:27 when sacrifices of another kind should be offered up in the Gentile world, through every part of it, as in the following verse Malachi 1:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither will I accept an offering at your hand: the \"minchah\" or meat offering, any meat offering, particularly that which was offered morning and evening with the daily sacrifice, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and it is sometimes used particularly for the evening meat offering, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or rather, \"a wheat\" or \"bread offering\"; since this offering was made of fine flour, with oil poured upon it, and frankincense put upon that, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hence mention is made of \"incense\" in the next verse ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it was either baked in an oven, or fried in a pan; and either way, when it was brought to the priest, it was burnt on the altar, and was an offering by fire to the Lord, and of a sweet savour to him, when rightly performed; and was a figure of the sacrifice of Christ, which is of a sweet smelling savour to God; and this passage respects Gospel times, as appears from the following verse ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", when Christ's sacrifice would be offered up, and so the oblation or meat offering made to cease, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hence God would not accept of it any more; or else because not rightly offered, as it was not when any leaven was mixed with it, or that and honey were burnt with it; signifying it should be offered with sincerity, and without hypocrisy, and other carnal lusts; and indeed no legal sacrifices were acceptable to God but such as were offered up in the faith of Christ, and with a view to his sacrifice, without trusting to, and depending upon, the outward offering, as hypocrites and carnal persons did: wherefore to this is opposed a pure \"minchah\" or meat offering in the next verse ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which designs spiritual sacrifices, such as are now offered up under the Gospel dispensation; when offering and sacrifice of a ceremonial kind God desires not; he will have no more offered up; he takes no pleasure in them; they are not acceptable to him, being superseded by the sacrifice of his Son, they were types of; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 40:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and agreeably to which passages the words may be understood, as expressing the Lord's rejection of legal sacrifices in general among the Jews, which he would have no longer continued than till the Messiah came; by whose sufferings and death the daily sacrifice was caused to cease, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " when sacrifices of another kind should be offered up in the Gentile world, through every part of it, as in the following verse ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f)   \"utinam vestrum aliquis\", Gataker, Drusius. (g) Kimchi in 1 Chronicles 26.1.((h) Shekalim, c. 5. sect. 1.((i) Misn. Middot, c. 1. sect. 1, 2.((k) In Misn. ib. (l) Baal Hatturim in Lev. vi. 13. (m) Maimon. Hilchot Tamidin, c. 2. sect. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f)   \"utinam vestrum aliquis\", Gataker, Drusius. (g) Kimchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".1.((h) Shekalim, c. 5. sect. 1.((i) Misn. Middot, c. 1. sect. 1, 2.((k) In Misn. ib. (l) Baal Hatturim in Lev. vi. 13. (m) Maimon. Hilchot Tamidin, c. 2. sect. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who is there even among you {l} that would shut the doors for nought? neither do ye kindle fire on mine altar for nought. I have no pleasure in you, saith the LORD of hosts, neither will I accept an offering at your hand.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is there",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " even among you ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that would shut the doors ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for nought",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "? neither do ye kindle ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "fire",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on mine altar for nought. I have no pleasure in you, saith the LORD of hosts, neither will I accept an offering at your hand.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Because the Levites who kept the doors did not test whether the sacrifices that came in were according to the Law, God wishes that they would rather shut the doors, than to receive such as were not perfect.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. Rather, with the majority of modern commentators and with R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Oh, that there were one among you that would shut the doors, that ye might not kindle [fire on] my altar in vain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Better no sacrifices at all than such sacrifices as these. Better a Temple closed than a Temple profaned. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the doors",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] not of the Sanctuary or Temple proper (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ναός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but either of the inner court in which the altar stood, or perhaps of the whole sacred inclosure (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἱερόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "minchah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is that commonly used for vegetable, as distinguished from animal sacrifices (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Here however, as elsewhere (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it has the more general sense of offerings of any kind. The proper meaning of the word, with which this general sense most nearly accords, is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a gift",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The prophet continues his severe reprobation of the priests. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who is there even among you that would shut the doors for naught,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.? Thus rendered, the passage rebukes the mercenary spirit of the priests, who would not even shut the temple door nor kindle the altar fire unless they were paid for it; or else it means that, though all the officers of the temple were remunerated for their most trivial services, yet they were remiss in attending to their duties, and neglected the law of sacrifices. The Latin Version omits the negative in the last clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Quis est in vobis qui claudat ostia, et incendat altare meum gratuito?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The LXX., with some little variation in the reading, renders, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Διότι καὶ ἐν ὑμῖν σὐκλειθήσονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "θύραι καὶ οὐκ ἀνάψεται τὸ θυσιαστήριον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μου δωρεάν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Wherefore also among you the doors shall be shut, and my altar shall not be kindled for nothing,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God threatens that the temple services shall wholly cease. But it is best to consider the passage as continuing the sarcastic strain of the preceding verse, and saying in effect that it would be better to have no pretence of worship at all than to have it thus profaned. Translate as in the Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Oh that there were one among you that would shut the doors, that ye might not kindle fire on mine altar in vain!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The doors are those of the inner court of the temple, where the great altar stood; and the polluted sectaries is offered \"in vain,\" because it offends God rather than propitiates him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "minchah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Here not sacrifice in general, as many commentators suppose, because it would be unnatural to take the word in one sense in this verse, and in a different sense in the following, where it is confessedly used in its restricted signification. The term is applied technically to the offering of fine flour combined with off and frankincense, burnt on the altar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); though it is also occasionally used even of bloody sacrifices; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Abel's (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As liturgically employed, it denotes the unbloody offering. So in this verse we may note a kind of climax. God would not accept the victims sacrificed, no, nor even the meat offering, which was naturally pure and unpolluted, Malachi 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"O that there were one among you, who would shut the doors, that ye might not light mine altar to no purpose! I have no pleasure in you, saith Jehovah of hosts, and sacrificial offering does not please me from your hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For from the rising of the sun to the setting thereof my name is great among the nations, and in every place incense is burned and sacrifice offered, and indeed a pure sacrifice to my name; for my name is great among the nations, saith Jehovah of hosts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye desecrate it with your saying: the table of Jehovah, it is defiled, and its fruit - contemptible is its food. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye say: behold what a plague! and ye blow upon it, saith Jehovah of hosts, and ye bring hither what is robbed and the lame and the sick, and thus ye bring the sacrificial gift; shall I take pleasure in this from your hand? saith Jehovah.\" The construction מי בכם ויסגּר is to be explained in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Who is among you and he would shut,\" for \"who is there who would shut?\" and the question is to be taken as the expression of a wish, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: \"would that some one among you would shut!\" The thought is sharpened by gam, which not only belongs to בּכם, but to the whole of the clause: \"O that some one would shut,\" etc. The doors, the shutting of which is to be desired, are the folding doors of the inner court, in which the altar of burnt-offering stood; and the object of the wish is that the altar might no more be lighted up, not \"by lights which burned by the side of the altar\" (Ewald), but by the shining of the sacrificial fire which burned upon the altar. חנּם, in vain, i.e., without any object or use, for Jehovah had no pleasure in such priests or such worthless sacrifices. Minchâh here is not the meat-offering as distinguished from the slain-offering, but sacrifice generally, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Such sacrifices God does not desire, for His name proves itself to be great among all the nations of the earth, so that pure sacrifices are offered to Him in every place. This is the simple connection between ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and one in perfect harmony with the words. Koehler's objection, that such a line of argument apparently presupposes that God needs sacrifices on the part of man for His own sake, and is only in a condition to despise the sacrifices of His nation when another nation offers Him better ones, has no force, because the expression \"for His own sake,\" in the sense of \"for His sustenance or to render the perpetuation of His being possible,\" with the conclusion drawn from it, is neither to be found in the words of the text, nor in the explanation referred to. God does indeed need no sacrifices for the maintenance of His existence, and He does not demand them for this purpose, but He demands them as signs of the dependence of men upon Him, or of the recognition on the part of men that they are indebted to God for life and every other blessing, and owe Him honour, praise, and thanksgiving in return. In this sense God needs sacrifices, because otherwise He would not be God to men on earth; and from this point of view the argument that God did not want to receive the reprehensible sacrifices of the Israelitish priests, because sacrifices were offered to Him by the nations of the earth in all places, and therefore His name was and remained great notwithstanding the desecration of it on the part of Israel, was a very proper one for attacking the delusion, that God needs sacrifices for His own sustenance; a delusion which the Israelitish priests, against whom Malachi was contending, really cherished, if not in thesi, at all events in praxi, when they thought any sacrificial animal good enough for God. Koehler's assumption, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contains a subordinate parenthetical thought, and that the reason for the assertion in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not given till ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is opposed to the structure of the sentences, since it necessitates the insertion of \"although\" after כּי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is must more difficult to decide the question whether Malachi 1:11 treats of what was already occurring at the time of the prophet himself, as Hitzig, Maurer, and Koehler suppose (after the lxx, Ephr., Theod. Mops., etc.), or of that which would take place in the future through the reception of the heathen into the kingdom of God in the place of Israel, which would be rejected for a time (Cyr., Theod., Jerome, Luther, Calvin, and others, down to Hengstenberg and Schmieder). Both of these explanations are admissible on grammatical grounds; for such passages as Genesis 15:14 and Joel 3:4 show very clearly that the participle is also used for the future. If we take the words as referring to the present, they can only mean that the heathen, with the worship and sacrifices which they offer to the gods, do worship, though ignorantly yet in the deepest sense, the true and living God (Koehler). But this thought is not even expressed by the Apostle Paul in so definite or general a form, either in Romans 1:19-20, where he teaches that the heathen can discern the invisible being of God from His works, or in Acts 17:23. in his address at Athens, where he infers from the inscription upon an altar, \"to the unknown God,\" that the unknown God, whom the Athenians worshipped, is the true God who made heaven and earth. Still less is this thought contained in our verse. Malachi does not speak of an \"unknown God,\" whom all nations from the rising to the setting of the sun, i.e., over all the earth, worshipped, but says that Jehovah's name is great among the nations of the whole earth. And the name of God is only great among the Gentiles, when Jehovah has proved Himself to them to be a great God, so that they have discerned the greatness of the living God from His marvellous works and thus have learned to fear Him (cf. Zephaniah 2:11; Psalm 46:9-11; Exodus 15:11, Exodus 15:14-16). This experience of the greatness of God forms the substratum for the offering of sacrifices in every place, since this offering is not mentioned merely as the consequence of the fact that the name of Jehovah is great among the nations; but in the clause before the last, \"the latter is also expressly placed towards the former in the relation of cause to effect\" (Koehler). The idea, therefore, that the statement, that incense is burned and sacrifice offered to the name of Jehovah in every place, refers to the sacrifices which the heathen offered to their gods, is quite inadmissible. At the time of Malachi the name of Jehovah was not great from the rising to the setting of the sun, nor were incense and sacrifice offered to Him in every place, and therefore even Hitzig looks upon the expression בּכל־מקום as \"saying too much.\" Consequently we must understand the words prophetically as relating to that spread of the kingdom of God among all nations, with which the worship of the true God would commence \"in every place.\" בּכל־מקום forms an antithesis to the one place, in the temple at Jerusalem, to which the worship of God was limited during the time of the old covenant (Deuteronomy 12:5-6). מקטר is not a partic. nominasc., incense, suffimentum, for this could not signify the burnt-offering or slain-offering as distinguished from the meat-offering (minchâh), but it is a partic. verbale, and denotes not the kindling of the sacrificial flesh upon the altar, but the kindling of the incense (suffitur); for otherwise מגּשׁ would necessarily stand before מקטר, since the presentation preceded the burning upon the altar. The two participles are connected together asyndetos and without any definite subject (see Ewald, 295, a). It is true that minchâh tehōrâh does actually belong to muggâsh as the subject, but it is attached by Vav explic. in the form of an explanatory apposition: offering is presented to my name, and indeed a sacrificial gift (minchâh covering every sacrifice, as in Malachi 1:10). The emphasis rests upon tehōrâh, pure, i.e., according to the requirements of the law, in contrast to sacrifices polluted by faulty animals, such as the priests of that day were accustomed to offer.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is must more difficult to decide the question whether ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " treats of what was already occurring at the time of the prophet himself, as Hitzig, Maurer, and Koehler suppose (after the lxx, Ephr., Theod. Mops., etc.), or of that which would take place in the future through the reception of the heathen into the kingdom of God in the place of Israel, which would be rejected for a time (Cyr., Theod., Jerome, Luther, Calvin, and others, down to Hengstenberg and Schmieder). Both of these explanations are admissible on grammatical grounds; for such passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " show very clearly that the participle is also used for the future. If we take the words as referring to the present, they can only mean that the heathen, with the worship and sacrifices which they offer to the gods, do worship, though ignorantly yet in the deepest sense, the true and living God (Koehler). But this thought is not even expressed by the Apostle Paul in so definite or general a form, either in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where he teaches that the heathen can discern the invisible being of God from His works, or in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 17:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". in his address at Athens, where he infers from the inscription upon an altar, \"to the unknown God,\" that the unknown God, whom the Athenians worshipped, is the true God who made heaven and earth. Still less is this thought contained in our verse. Malachi does not speak of an \"unknown God,\" whom all nations from the rising to the setting of the sun, i.e., over all the earth, worshipped, but says that Jehovah's name is great among the nations of the whole earth. And the name of God is only great among the Gentiles, when Jehovah has proved Himself to them to be a great God, so that they have discerned the greatness of the living God from His marvellous works and thus have learned to fear Him (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:9-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:14-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This experience of the greatness of God forms the substratum for the offering of sacrifices in every place, since this offering is not mentioned merely as the consequence of the fact that the name of Jehovah is great among the nations; but in the clause before the last, \"the latter is also expressly placed towards the former in the relation of cause to effect\" (Koehler). The idea, therefore, that the statement, that incense is burned and sacrifice offered to the name of Jehovah in every place, refers to the sacrifices which the heathen offered to their gods, is quite inadmissible. At the time of Malachi the name of Jehovah was not great from the rising to the setting of the sun, nor were incense and sacrifice offered to Him in every place, and therefore even Hitzig looks upon the expression בּכל־מקום as \"saying too much.\" Consequently we must understand the words prophetically as relating to that spread of the kingdom of God among all nations, with which the worship of the true God would commence \"in every place.\" בּכל־מקום forms an antithesis to the one place, in the temple at Jerusalem, to which the worship of God was limited during the time of the old covenant (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). מקטר is not a partic. nominasc., incense, suffimentum, for this could not signify the burnt-offering or slain-offering as distinguished from the meat-offering (minchâh), but it is a partic. verbale, and denotes not the kindling of the sacrificial flesh upon the altar, but the kindling of the incense (suffitur); for otherwise מגּשׁ would necessarily stand before מקטר, since the presentation preceded the burning upon the altar. The two participles are connected together asyndetos and without any definite subject (see Ewald, 295, a). It is true that minchâh tehōrâh does actually belong to muggâsh as the subject, but it is attached by Vav explic. in the form of an explanatory apposition: offering is presented to my name, and indeed a sacrificial gift (minchâh covering every sacrifice, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The emphasis rests upon tehōrâh, pure, i.e., according to the requirements of the law, in contrast to sacrifices polluted by faulty animals, such as the priests of that day were accustomed to offer.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In Malachi 1:11 the Romish Church finds a biblical foundation for its doctrine of the bloodless sacrifice of the New Testament, i.e., the holy sacrifice of the mass (see Canones et decreta concil. Trident. sess. 22), understanding by minchâh the meat-offering as distinguished from the bloody sacrifices. But even if there were any ground for this explanation of the word, which there is not, it would furnish no support to the sacrifice of the mass, since apart from the fact that the sacrifice of the mass has a totally different meaning from the meat-offering of the Old Testament, the literal interpretation of the word is precluded by the parallel \"burning incense\" or \"frankincense.\" If burning incense was a symbol of prayer, as even Reincke admits, the \"sacrificial offering\" can only have denoted the spiritual surrender of a man to God (Romans 12:1).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Romish Church finds a biblical foundation for its doctrine of the bloodless sacrifice of the New Testament, i.e., the holy sacrifice of the mass (see Canones et decreta concil. Trident. sess. 22), understanding by minchâh the meat-offering as distinguished from the bloody sacrifices. But even if there were any ground for this explanation of the word, which there is not, it would furnish no support to the sacrifice of the mass, since apart from the fact that the sacrifice of the mass has a totally different meaning from the meat-offering of the Old Testament, the literal interpretation of the word is precluded by the parallel \"burning incense\" or \"frankincense.\" If burning incense was a symbol of prayer, as even Reincke admits, the \"sacrificial offering\" can only have denoted the spiritual surrender of a man to God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the allusion to the worship, which would be paid by all nations to the name of the Lord, there is an intimation that the kingdom of God will be taken from the Jews who despise the Lord, and given to the heathen who seek God. This intimation forms the basis for the curse pronounced in Malachi 1:14 upon the despisers of God, and shows \"that the kingdom of God will not perish, when the Lord comes and smites the land with the curse (Malachi 4:6), but that this apparent death is the way to true life\" (Hengstenberg).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the allusion to the worship, which would be paid by all nations to the name of the Lord, there is an intimation that the kingdom of God will be taken from the Jews who despise the Lord, and given to the heathen who seek God. This intimation forms the basis for the curse pronounced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " upon the despisers of God, and shows \"that the kingdom of God will not perish, when the Lord comes and smites the land with the curse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but that this apparent death is the way to true life\" (Hengstenberg).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To this allusion to the attitude which the heathen will assume towards Jehovah when He reveals His name to them, the prophet appends as an antithesis in Malachi 1:12, Malachi 1:13 a repetition of the reproof, that the priests of Israel desecrate the name of the Lord by that contempt of His name, which they display by offering faulty animals in sacrifice. Malachi 1:12 is only a repetition of the rebuke in v.7. חלּל is really equivalent to בּזה שׁם and גּאל in Malachi 1:6 and Malachi 1:7, and מגאל to נבזה in Malachi 1:7, which occurs in the last clause of Malachi 1:12 as synonymous with it. The additional words וניבו וגו serve to strengthen the opinion expressed by the priests concerning the table of the Lord. ניבו is placed at the head absolutely, and is substantially resumed in אכלו. ניב, proventus, produce, income; the suffix refers to shulchan Yehōvâh (the table of the Lord). The revenue of the table of the Lord, i.e., of the altar, consisted of the sacrifices offered upon it, which are also called its food. The assumption is an erroneous one, that the sentence contains any such thought as the following: \"The revenue drawn by the priests from the altar, i.e., the sacrificial flesh which fell to their share, was contemptible;\" according to which the priests would be represented as declaring, that they themselves could not eat the flesh of the sacrifices offered without disgust; for they could not possibly speak in this way, since it was they themselves who admitted the faulty animals. If the flesh of blind, lame, or diseased animals had been too bad for food in their estimation, they would not have admitted such animals or offered them in sacrifice (Koehler). Even in Malachi 1:13 this thought is not implied. מתּלאה is a contraction of מה־תּלאה (cf. Ges. 20, 2, a): What a weariness it is! The object, which the priests declare to be a burdensome and troublesome affair, can only be inferred from the following expression, vehippachtem 'ōthō. Hippēăch signifies here to blow away, like הפיח ב in Psalm 10:5, which is radically connected with it, i.e., to treat contemptuously. The suffix אותו does not refer to אכלו, but to שׁלחן יי. The table of Jehovah (i.e., the altar) they treat contemptuously. Consequently the service at the altar is a burden or a trouble to them, whereas this service ought to be regarded as an honour and a privilege. Jerome thinks that instead of אותו, we might read אותי, which is found in a good number of codices; and according to the Masora, אותו has found its way into the text as Tikkune Sopherim (compare the remarks at Habakkuk 1:12 on the Tikkune Sopherim). But in this case also the reading in the text is evidently original and correct. They manifest their contempt of the altar by offering in sacrifice that which has been stolen, etc. (cf. Malachi 1:8). The first הבאתם is to be understood as referring to the bringing of the animals upon the altar; and והבאתם את־המּנחה is to be interpreted thus: \"And having brought such worthless animals to the slaughter, ye then offer the sacrificial gift.\" There is indeed no express prohibition in the law against offering gâzūl, or that which has been stolen; but it was shut out from the class of admissible sacrifices by the simple fact, that robbery was to be visited with punishment as a crime. The reproof closes with the question, which is repeated from Malachi 1:8 (cf. Malachi 1:10), whether God can accept such sacrifices with pleasure. The prophet then utters the curse in the name of God upon all who offer bad and unsuitable sacrifices. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To this allusion to the attitude which the heathen will assume towards Jehovah when He reveals His name to them, the prophet appends as an antithesis in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a repetition of the reproof, that the priests of Israel desecrate the name of the Lord by that contempt of His name, which they display by offering faulty animals in sacrifice. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is only a repetition of the rebuke in v.7. חלּל is really equivalent to בּזה שׁם and גּאל in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and מגאל to נבזה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which occurs in the last clause of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as synonymous with it. The additional words וניבו וגו serve to strengthen the opinion expressed by the priests concerning the table of the Lord. ניבו is placed at the head absolutely, and is substantially resumed in אכלו. ניב, proventus, produce, income; the suffix refers to shulchan Yehōvâh (the table of the Lord). The revenue of the table of the Lord, i.e., of the altar, consisted of the sacrifices offered upon it, which are also called its food. The assumption is an erroneous one, that the sentence contains any such thought as the following: \"The revenue drawn by the priests from the altar, i.e., the sacrificial flesh which fell to their share, was contemptible;\" according to which the priests would be represented as declaring, that they themselves could not eat the flesh of the sacrifices offered without disgust; for they could not possibly speak in this way, since it was they themselves who admitted the faulty animals. If the flesh of blind, lame, or diseased animals had been too bad for food in their estimation, they would not have admitted such animals or offered them in sacrifice (Koehler). Even in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this thought is not implied. מתּלאה is a contraction of מה־תּלאה (cf. Ges. 20, 2, a): What a weariness it is! The object, which the priests declare to be a burdensome and troublesome affair, can only be inferred from the following expression, vehippachtem 'ōthō. Hippēăch signifies here to blow away, like הפיח ב in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is radically connected with it, i.e., to treat contemptuously. The suffix אותו does not refer to אכלו, but to שׁלחן יי. The table of Jehovah (i.e., the altar) they treat contemptuously. Consequently the service at the altar is a burden or a trouble to them, whereas this service ought to be regarded as an honour and a privilege. Jerome thinks that instead of אותו, we might read אותי, which is found in a good number of codices; and according to the Masora, אותו has found its way into the text as Tikkune Sopherim (compare the remarks at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on the Tikkune Sopherim). But in this case also the reading in the text is evidently original and correct. They manifest their contempt of the altar by offering in sacrifice that which has been stolen, etc. (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The first הבאתם is to be understood as referring to the bringing of the animals upon the altar; and והבאתם את־המּנחה is to be interpreted thus: \"And having brought such worthless animals to the slaughter, ye then offer the sacrificial gift.\" There is indeed no express prohibition in the law against offering gâzūl, or that which has been stolen; but it was shut out from the class of admissible sacrifices by the simple fact, that robbery was to be visited with punishment as a crime. The reproof closes with the question, which is repeated from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), whether God can accept such sacrifices with pleasure. The prophet then utters the curse in the name of God upon all who offer bad and unsuitable sacrifices. ",
            "children": []
          }
        ]
      }
    ]
  }
]