[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-5 All advantages, either as to outward circumstances, or spiritual privileges, come from the free love of God, who makes one to differ from another. All the evils sinners feel and fear, are the just recompence of their crimes, while all their hopes and comforts are from the unmerited mercy of the Lord. He chose his people that they might be holy. If we love him, it is because he has first loved us; yet we all are prone to undervalue the mercies of God, and to excuse our own offences.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I made his mountains a waste, and his heritage for the jackals of the wilderness - o",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Malachi attests the first stage of fulfillment of Joel's prophecy (Joel 3:19, vol. i. pp. 214, 215), \"Edom shall be a desolate wilderness.\" In temporal things, Esau's blessing was identical with Jacob's; \"the fatness of the earth and of the dew of heaven from above;\" and the rich soil on the terraces of its mountain-sides, though yielding nothing now except a wild beautiful vegetation, and its deep glens, attest what they once must have been, when artificially watered and cultivated. The first desolation must have been through Nebuchadnezzar , in his expedition against Egypt, when he subdued Moab and Ammon; and Edom lay in his way, as Jeremiah had foretold Jeremiah 25:9, Jeremiah 25:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Malachi attests the first stage of fulfillment of Joel's prophecy (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", vol. i. pp. 214, 215), \"Edom shall be a desolate wilderness.\" In temporal things, Esau's blessing was identical with Jacob's; \"the fatness of the earth and of the dew of heaven from above;\" and the rich soil on the terraces of its mountain-sides, though yielding nothing now except a wild beautiful vegetation, and its deep glens, attest what they once must have been, when artificially watered and cultivated. The first desolation must have been through Nebuchadnezzar , in his expedition against Egypt, when he subdued Moab and Ammon; and Edom lay in his way, as Jeremiah had foretold ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. hated—not positively, but relatively; that is, did not choose him out to be the object of gratuitous favor, as I did Jacob (compare Lu 14:26, with Mt 10:37; Ge 29:30, 31; De 21:15, 16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "laid his mountains … waste—that is, his territory which was generally mountainous. Israel was, it is true, punished by the Chaldeans, but Edom has been utterly destroyed; namely, either by Nebuchadnezzar [Rosenmuller], or by the neighboring peoples, Egypt, Ammon, and Moab [Josephus, Antiquities, 10.9,7; Maurer], (Jer 49:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dragons—jackals [Moore] (compare Isa 34:13). Maurer translates, \"Abodes of the wilderness,\" from an Arabic root \"to stop,\" or \"to abide.\" English Version is better.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I hated; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I loved not Esau or his posterity as I loved Jacob and his posterity: this not loving, comparatively, is a hating, God showed not the same kindness to the twin brothers; the one was more enriched with the fruits of God’s love, and had cause to be thankful; the other had no cause to complain, for God did him no wrong. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Esau; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " containing his posterity with him; for though the hatred or lesser love began towards Esau’s person, yet the effects of it appeared more manifestly in Esau’s posterity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His mountains and his heritage; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Mount Seir with the neighbouring mountains given to Esau ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 2:5 Joshua 24:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " for inheritance, as here it is said, and which he and his posterity did enjoy about one thousand two hundred years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Waste, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by Nebuchadnezzar’s arms five years after the sacking of Jerusalem, as foretold by Ezekiel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The people were slain or captivated, or forced to lice from the sword of the enemy, their cities taken, plundered, and burnt. It is possible that they might meet with worse usage than the Jews met with herein; however, their state seems equal, and here is no token of unequal hatred; but what follows doth manifestly discover it, for whereas Jacob’s captivity returned, and their cities were rebuilt, Esau’s never were. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For the dragons; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or jackals, or owls, for the word is so used and explained by some; or all these with dragons doleful creatures, which delight in desolate places; by which the utter desolation, and the perpetuity of the desolation, of Esau is signified. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I hated Esau,.... Or, \"rejected\" him, as the Targum; did not love him as Jacob: this was a negative, not positive hatred; it is true of him, personally considered; not only by taking away the birthright and blessing from him, which he despised; but by denying him his special grace, leaving him in his sins, and to his lusts, so that he became a profane person; shared not in the grace of God here, and had no part in the eternal inheritance with the saints in light; and likewise it is true of his posterity, as the following instances show: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and laid his mountains and his heritage waste; which, according to Grotius, was done by Nebuchadnezzar, five years after the captivity of the Jews, in fulfilment of the prophecy of Jeremiah, Jeremiah 49:7 but this was done by the Nabatheans (n): Mount Seir was the famous mountain that Esau dwelt in, Genesis 36:8 there might be more in his country; or this might have many tops, and therefore called \"mountains\"; and to this account of the waste and desolate state of this country agrees what is at present related of it, by a late traveller (o) in those parts: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and laid his mountains and his heritage waste; which, according to Grotius, was done by Nebuchadnezzar, five years after the captivity of the Jews, in fulfilment of the prophecy of Jeremiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but this was done by the Nabatheans (n): Mount Seir was the famous mountain that Esau dwelt in, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there might be more in his country; or this might have many tops, and therefore called \"mountains\"; and to this account of the waste and desolate state of this country agrees what is at present related of it, by a late traveller (o) in those parts: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if (says he) we leave Palestine and Egypt behind us, and pursue our physical observations into the land of Edom, we shall be presented with a variety of prospects, quite different from those we have lately met with in the land of Canaan, or in the field of Zoan; for we cannot here be entertained with pastures clothed with flocks, or with valleys standing thick with corn, or with brooks of water, or fountains, or depths that spring out of valleys and hills, Deuteronomy 8:7 here is no place of seed, or of figs, or of vines, or pomegranates, Numbers 20:5 but the whole is an \"evil place\", a lonesome desolate wilderness; no otherwise diversified than by plains covered with sand, and by mountains made up of naked rocks and precipices, Malachi 1:3 neither is this country ever (unless sometimes at the equinoxes) refreshed with rain; but the few hardy vegetables it produces are stunted by a perpetual drought; and the nourishment which the dews contribute to them in the night, is sufficiently impaired by the powerful heat of the sun in the day:'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"if (says he) we leave Palestine and Egypt behind us, and pursue our physical observations into the land of Edom, we shall be presented with a variety of prospects, quite different from those we have lately met with in the land of Canaan, or in the field of Zoan; for we cannot here be entertained with pastures clothed with flocks, or with valleys standing thick with corn, or with brooks of water, or fountains, or depths that spring out of valleys and hills, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " here is no place of seed, or of figs, or of vines, or pomegranates, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but the whole is an \"evil place\", a lonesome desolate wilderness; no otherwise diversified than by plains covered with sand, and by mountains made up of naked rocks and precipices, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " neither is this country ever (unless sometimes at the equinoxes) refreshed with rain; but the few hardy vegetables it produces are stunted by a perpetual drought; and the nourishment which the dews contribute to them in the night, is sufficiently impaired by the powerful heat of the sun in the day:'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Though this country seems to have been originally more fruitful, and better cultivated, as may be concluded from Genesis 27:39 but is become so through the judgments of God upon it: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Though this country seems to have been originally more fruitful, and better cultivated, as may be concluded from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but is become so through the judgments of God upon it: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for the dragons of the wilderness; so called to distinguish them from sea dragons, or the dragon fish; such as whales and crocodiles, which are sometimes expressed by the same word here used, Genesis 1:21 and these land dragons are no other than serpents of an enormous size. In the Indies they used to be distinguished into three sorts; such as were found in the mountains; such as were bred in caves, or in the flat country; and such as were found in fens and marshes. The first is the largest of all, and are covered with scales as resplendent as polished gold; these have a kind of beard hanging from their lower jaw; their eyebrows large, and very exactly arched; their aspect the most frightful that can be imagined; and their cry loud and shrill; their crest of a bright yellow; and a protuberance on their heads of the colour of a burning coal. Those of the flat country differ from the former in nothing but having their scales of a silver colour, and in their frequenting rivers, to which the former never come. Those that live in marshes and fens are of a dark colour, approaching to a black, move slowly, have no crest, or any rising on their heads (p); these creatures commonly inhabit desert places. So Diodorus Siculus (q), speaking of Ethiopia, says, it is reported that various kinds of serpents, and of an incredible size, are seen near the desert, had in places inhabited by wild beasts; and Aelianus (r) describes the dragon as dwelling in woods, and living on poisonous herbs; and preferring a desolate place to cities, and the habitations of men; and when in Scripture it is predicted of countries and cities that they shall become desolate, it is usually observed, that they shall be the dwelling places of dragons, as in Isaiah 13:22 so here it is foretold that it should be the case of Edom, as it has been, and still continues to be, as appears from the above traveller (s); who, passing through some part of this country, says of it, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the dragons of the wilderness; so called to distinguish them from sea dragons, or the dragon fish; such as whales and crocodiles, which are sometimes expressed by the same word here used, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and these land dragons are no other than serpents of an enormous size. In the Indies they used to be distinguished into three sorts; such as were found in the mountains; such as were bred in caves, or in the flat country; and such as were found in fens and marshes. The first is the largest of all, and are covered with scales as resplendent as polished gold; these have a kind of beard hanging from their lower jaw; their eyebrows large, and very exactly arched; their aspect the most frightful that can be imagined; and their cry loud and shrill; their crest of a bright yellow; and a protuberance on their heads of the colour of a burning coal. Those of the flat country differ from the former in nothing but having their scales of a silver colour, and in their frequenting rivers, to which the former never come. Those that live in marshes and fens are of a dark colour, approaching to a black, move slowly, have no crest, or any rising on their heads (p); these creatures commonly inhabit desert places. So Diodorus Siculus (q), speaking of Ethiopia, says, it is reported that various kinds of serpents, and of an incredible size, are seen near the desert, had in places inhabited by wild beasts; and Aelianus (r) describes the dragon as dwelling in woods, and living on poisonous herbs; and preferring a desolate place to cities, and the habitations of men; and when in Scripture it is predicted of countries and cities that they shall become desolate, it is usually observed, that they shall be the dwelling places of dragons, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so here it is foretold that it should be the case of Edom, as it has been, and still continues to be, as appears from the above traveller (s); who, passing through some part of this country, says of it, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"vipers, especially in the wilderness of Sin, which might be very properly called \"the inheritance of dragons\", were very dangerous and troublesome; not only our camels, but the Arabs who attended them, running every moment the risk of being bitten;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so that, according to the prediction, it is now a place for such creatures. A learned Jew (t) is of opinion, that not serpents, but jackals, are here meant, which are a sort of wild howling beasts, that live abroad in desolate places; See Gill on Micah 1:8 but whether they be the one, or the other, it makes for the same purpose, to denote what a desert place Edom would become; since it should be inhabited by such creatures to dwell in, which denotes the utter desolation made. So the Targum renders it, \"into the wasteness of the desert\"; or into a waste desert, where none but such sort of animals inhabit. The Septuagint and Syriac versions render it, \"into the houses\", or \"cottages, of the desert\": and now, though this was the case of Judea, that it was left desolate, yet it was but for a while; at the end of seventy years the Jews returned to their own land, and dwelt in it; but so did not the Edomites, as appears by the following words; which shows the regard God had to the posterity of Jacob, and not to the posterity of Esau. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so that, according to the prediction, it is now a place for such creatures. A learned Jew (t) is of opinion, that not serpents, but jackals, are here meant, which are a sort of wild howling beasts, that live abroad in desolate places; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but whether they be the one, or the other, it makes for the same purpose, to denote what a desert place Edom would become; since it should be inhabited by such creatures to dwell in, which denotes the utter desolation made. So the Targum renders it, \"into the wasteness of the desert\"; or into a waste desert, where none but such sort of animals inhabit. The Septuagint and Syriac versions render it, \"into the houses\", or \"cottages, of the desert\": and now, though this was the case of Judea, that it was left desolate, yet it was but for a while; at the end of seventy years the Jews returned to their own land, and dwelt in it; but so did not the Edomites, as appears by the following words; which shows the regard God had to the posterity of Jacob, and not to the posterity of Esau. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) See Prideanx's Connexion, par. 2. B. 3. p. 199. (o) Dr. Shaw's Travels, p. 438. Ed. 2.((p) Harris's Voyages and Travels, vol. 1. p. 474. (q) Bibliothec. l. 3. p. 169. (r) De Animal. l. 6. c. 63. (s) Dr. Shaw Travels, p. 448. Ed. 2.((t) Tanchum apud Pocock in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) See Prideanx's Connexion, par. 2. B. 3. p. 199. (o) Dr. Shaw's Travels, p. 438. Ed. 2.((p) Harris's Voyages and Travels, vol. 1. p. 474. (q) Bibliothec. l. 3. p. 169. (r) De Animal. l. 6. c. 63. (s) Dr. Shaw Travels, p. 448. Ed. 2.((t) Tanchum apud Pocock in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I {c} hated Esau, {1} and laid his mountains and his heritage waste for the dragons of the wilderness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hated Esau, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{1}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and laid his mountains and his heritage waste for the dragons of the wilderness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) For besides this the signs of my hatred appeared even when he was made servant to his younger brother, being yet in his mother's belly, and also afterward in that he was put from his birthright. Yet even now before your eyes the signs of this are evident, in that his country lies waste, and he will never return to inhabit it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Whereas you my people, whom the enemy hated more than them, are by my grace and love towards you delivered; read Ro 9:13.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the dragons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "jackals",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The unusual form of the word here (fem. instead of masc. as elsewhere) has led many to render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dwellings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δώματα ἐρήμου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Syr.). But the derivation and meaning are not satisfactory. Rather, with R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I made his mountains a desolation, and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gave ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "his heritage to the jackals of the wilderness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Unless indeed we neglect the accents and adopt a third rendering, which seems still better to preserve the parallelism, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I made his mountains a desolation, and his heritage a wilderness for jackals",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The desolation of Edom here referred to was in all probability caused by Nebuchadnezzar, in fulfilment of the prophecy of Jeremiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:17-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:3-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). See Obadiah, Introd. pp. 20, 22, in this Series.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I hated Esau.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " St. Paul quotes these words (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in order to illustrate his position, \"that the purpose of God according to election might stand, not of works, but of him that calleth.\" Even before his birth Jacob was the chosen one, and Esau, the elder, was to serve the younger. This mystery of Divine election has seemed to some to be stated so harshly that they have thought that the words of the text need to be softened, or to be modified by their explanation. Thus they give the glosses, \"I have preferred Jacob to Esau;\" \"I have loved Esau less than Jacob;\" or they have limited the terms \"love\" end \"hatred\" to the bestowing or withholding of temporal blessings; or they have affirmed that Esau was hated because God foresaw his unworthiness, and Jacob was beloved owing to his foreseen piety and faithfulness. The whole question is discussed by Augustine, 'De Div. Quint. ad Simplic.,' 1:18 (11:433). He ends by saying, \"Deus odit impietatem: in aliis etiam punit  per damnationem, in aliis adimit per justificationem.\" But Malachi is not speaking of the predestination of the one brother and the reprobation of the other; he is contrasting the histories of the two peoples represented by them; as Jerome puts it, \"In Jacob vos dilexi, in Esau Idumaeos odio habui.\" Both nations sinned; both are punished; but Israel by God's free mercy was forgiven and restored, while Edom was left in the misery which it had brought upon itself by its own iniquity. Thus is proved God's love for the Israelites (Knabenbauer). That it is of the two nations that the prophet speaks, rather than of the two brothers, is seen by what follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Laid his mountains...  waste.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " While the Israelites were repeopling and cultivating their land, and their cities were rising from their ruins, and the temple and the capital were rebuilt, Edom, which had suffered at the hand of the same enemies, had never recovered from the blow, and still lay a scene of desolation and ruin. It seems that Nebuchadnezzar attacked and conquered Edom some few years after he had taken Jerusalem. This event happened during one of his expeditions against Egypt, one of which took place in the thirty-seventh year of his reign, as we learn from a record lately deciphered (see 'Transact. of Soc. of Bibl. Archaeology,' 7:210, etc.). (For Edom and its history, see the Introduction to Obadiah.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Dragons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, jackals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δώματα ἐρήμου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"for habitations of the desert;\" Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dracones deserti",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence the Authorized Version. Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The first verse contains the heading (see the introduction), \"The burden of the word of the Lord,\" as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On massa' (burden), see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet commences his address in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by showing the love for which Israel has to thank its God, in order that on the ground of this fact he may bring to the light the ingratitude of the people towards their God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"I have loved you, saith Jehovah; and ye say, Wherein hast Thou loved us? Is not Esau a brother of Jacob? is the saying of Jehovah: and I loved Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I hated Esau, and made his mountains a waste, and his inheritance for jackals of the desert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If Edom says, We are dashed to pieces, but will build up the ruins again, thus saith Jehovah of hosts: They will build, but I will pull down: and men will call them territory of wickedness, and the people with whom Jehovah is angry for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And your eyes will see it; and ye will say, Great is Jehovah over the border of Israel.\" These four verses form neither an independent address, nor merely the first member of the following address, but the introduction and foundation of the whole book. The love which God has shown to Israel ought to form the motive and model for the conduct of Israel towards its God. אהב denotes love in its expression or practical manifestation. The question asked by the people, \"Wherein hast Thou shown us love?\" may be explained from the peculiarities of Malachi's style, and is the turn he regularly gives to his address, by way of introducing the discussion of the matter in hand, so that we are not to see in it any intention to disclose the hypocrisy of the people. The prophet proves the love of Jehovah towards Israel, from the attitude of God towards Israel and towards Edom. Jacob and Esau, the tribe-fathers of both nations, were twin brothers. It would therefore have been supposed that the posterity of both the Israelites and the Edomites would be treated alike by God. But this is not the case. Even before their birth Jacob was the chosen one; and Esau or Edom was the inferior, who was to serve his brother (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:10-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Accordingly Jacob became the heir of the promise, and Esau lost this blessing. This attitude on the part of God towards Jacob and Esau, and towards the nations springing from them, is described by Malachi in these words: I((Jehovah) have loved Jacob, and hated Esau. The verbs אהב, to love, and שׂנא, to hate, must not be weakened down into loving more and loving less, to avoid the danger of falling into the doctrine of predestination. שׂנא, to hate, is the opposite of love. And this meaning must be retained here; only we must bear in mind, that with God anything arbitrary is inconceivable, and that no explanation is given here of the reasons which determined the actions of God. Malachi does not expressly state in what the love of God to Jacob (i.e., Israel) showed itself; but this is indirectly indicated in what is stated concerning the hatred towards Edom. The complete desolation of the Edomitish territory is quoted as a proof of this hatred. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not refer to the assignment of a barren land, as Rashi, Ewald, and Umbreit suppose, but to the devastation of the land, which was only utterly waste on the western mountains; whereas it was by no means barren on the eastern slopes and valleys (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Tannōth is a feminine plural form of tan  equals  tannı̄m (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), by which, according to the Syrio-Aramaean version, we are to understand the jackal. The meaning dwelling-places, which Gesenius and others have given to tannōth, after the lxx and Peshito, rests upon a very uncertain derivation (see Roediger at Ges. Thes. p. 1511). \"For jackals of the desert:\" i.e., as a dwelling-place for these beasts of the desert (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is a disputed point when this devastation took place, and from what people it proceeded. Jahn, Hitzig, and Koehler are of opinion that it is only of the most recent date, because otherwise the Edomites would long ago have repaired the injury, which, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", does not appear to have been done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", however, simply implies that the Edomites would not succeed in the attempt to repair the injury. On the other hand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evidently contain the thought, that whereas Jacob had recovered, in consequence of the love of Jehovah, from the blow which had fallen upon it (through the Chaldaeans), Esau's territory was still lying in ruins from the same blow, in consequence of Jehovah's hatred (Caspari, Obad. p. 143). It follows from this, that the devastation of Idumaea emanated from the Chaldaeans. On the other hand, the objection that the Edomites appear to have submitted voluntarily to the Babylonians, and to have formed an alliance with them, does not say much, since neither the one nor the other can be raised even into a position of probability; but, on the contrary, we may infer with the greatest probability from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., as compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the Edomites were also subjugated by Nebuchadnezzar. Maurer's assumption, that Idumaea was devastated by the Egyptians, Ammonites, and Moabites, against whom Nebuchadnezzar marched in the fifth year after the destruction of Jerusalem, is perfectly visionary. The threat in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that if Edom attempts to rebuild its ruins, the Lord will again destroy that which is built, is equivalent to a declaration that Edom will never recover its former prosperity and power. This was soon fulfilled, the independence of the Edomites being destroyed, and their land made an eternal desert, especially from the times of the Maccabees onwards. The construction of אדום as a feminine with תּאמר may be explained on the ground that the land is regarded as the mother of its inhabitants, and stands synecdochically for the population. Men will call them (להן, the Edomites) גּבוּל רשׁעה, territory, land of wickedness, - namely, inasmuch as they will look upon the permanent devastation, and the failure of every attempt on the part of the nation to rise up again, as a practical proof that the wrath of God is resting for ever upon both people and land on account of Edom's sins.",
        "children": []
      }
    ]
  }
]