[{"header":"Greetings"},{"num":1,"verse":"From: Peter, an apostle of Jesus, the Messiah."},{"num":2,"verse":"the people chosen according to the foreknowledge of God the Father through the sanctifying action of the Spirit to be obedient to Jesus, the Messiah, and to be sprinkled with his blood."},{"header":"Our Hope and Joy are in the Messiah"},{"num":3,"verse":"Blessed be the God and Father of our Lord Jesus, the Messiah! Because of his great mercy he has granted us a new birth, resulting in an immortal hope through the resurrection of Jesus, the Messiah, from the dead "},{"num":4,"verse":"and to an inheritance kept in heaven for you that can’t be destroyed, corrupted, or changed. "},{"num":5,"verse":"Through faith you are being protected by God’s power for a salvation that is ready to be revealed at the end of this era. "},{"num":6,"verse":"You greatly rejoice in this, even though you have to suffer various kinds of trials for a little while, "},{"num":7,"verse":"so that your genuine faith, which is more valuable than gold that perishes when tested by fire, may result in praise, glory, and honor when Jesus, the Messiah, is revealed."},{"num":8,"verse":"Though you have not seen him, you love him. And even though you do not see him now, you believe in him and rejoice with an indescribable and glorious joy, "},{"num":9,"verse":"because you are receiving the goal of your faith, the salvation of your souls."},{"num":10,"verse":"Even the prophets, who prophesied about the grace that was to be yours, carefully researched and investigated this salvation. "},{"num":11,"verse":"They tried to find out what era or specific time the Spirit of the Messiah in them kept referring to when he predicted the sufferings of the Messiah and the glories that would follow. "},{"num":12,"verse":"It was revealed to them that they were not serving themselves but you in regard to the things that have now been announced to you by those who brought you the good news through the Holy Spirit sent from heaven. These are things that even the angels desire to look into."},{"header":"Be Holy"},{"num":13,"verse":"Therefore, prepare your minds for action, keep a clear head, and set your hope completely on the grace to be given you when Jesus, the Messiah, is revealed. "},{"num":14,"verse":"As obedient children, do not be shaped by the desires that used to influence you when you were ignorant. "},{"num":15,"verse":"Instead, be holy in every aspect of your life, just as the one who called you is holy. "},{"num":16,"verse":"For it is written, “You must be holy, because I am holy.”"},{"num":17,"verse":"If you call “Father” the one who judges everyone impartially according to what they have done, you must live in reverent fear as long as you are strangers in a strange land. "},{"num":18,"verse":"For you know that it was not with perishable things like silver or gold that you have been ransomed from the worthless way of life handed down to you by your ancestors, "},{"num":19,"verse":"but with the precious blood of the Messiah, like that of a lamb without blemish or defect. "},{"num":20,"verse":"On the one hand, he was foreknown before the creation of the world, but on the other hand, he was revealed at the end of time for your sake. "},{"num":21,"verse":"Through him you believe in God, who raised him from the dead and gave him glory, so that your faith and hope might be in God."},{"header":"Love One Another"},{"num":22,"verse":"Now that you have obeyed the truth and have purified your souls to love your brothers sincerely, you must love one another intensely and with a pure heart. "},{"num":23,"verse":"For you have been born again, not by a seed that perishes but by one that cannot perish—by the living and everlasting word of God. "},{"num":24,"verse":"For"}]