[{"num":8,"verse":"“At that time,” says the Lord, “they will bring out the bones of the kings and leaders of Judah, the bones of the religious leaders, the bones of the men of God, and the bones of the people of Jerusalem from their graves. "},{"num":2,"verse":"And they will spread them out to the sun, the moon, and to all the stars of heaven. For these they have loved, and served, and followed, and looked for, and worshiped. The bones will not be gathered or buried. They will be as animal waste on top of the ground. "},{"num":3,"verse":"And death will be chosen instead of life by all those who are left of this sinful family in all the places where I have driven them,” says the Lord of All."},{"header":"Sin and Its Punishment"},{"num":4,"verse":"“You will say to them, ‘This is what the Lord says: “Do men fall and not get up again? Does one turn away and not return? "},{"num":5,"verse":"Why then have the people of Jerusalem always turned away from Me? They hold on to what is false, and will not return. "},{"num":6,"verse":"I have listened and heard, but they have not said what is right. No man turned from his sinful way, saying, ‘What have I done?’ Every one turns to his own way like a horse running into battle. "},{"num":7,"verse":"Even the stork in the sky knows her times. And the turtle-dove, crane, and swallow keep the time of their coming. But My people do not know the Law of the Lord."},{"num":8,"verse":"“How can you say, ‘We are wise, and the Law of the Lord is with us’? See, the lying hand of the writers has made it into a lie. "},{"num":9,"verse":"The wise men are put to shame. They are troubled and taken. See, they have turned away from the Word of the Lord, and what kind of wisdom do they have? "},{"num":10,"verse":"So I will give their wives to others, and their fields to new owners. Because from the least to the greatest, every one is always wanting much. From the man of God to the religious leader, no one can be trusted in what he does. "},{"num":11,"verse":"They have healed the hurt of My people very little, saying, ‘Peace, peace,’ when there is no peace. "},{"num":12,"verse":"Were they ashamed because of the hated sin they had done? They were not ashamed at all. They did not even know how to turn red. So they will fall among those who fall. When I punish them, they will be put down,” says the Lord."},{"num":13,"verse":"“For sure I will take them away,” says the Lord. “There will be no grapes on the vine, and no figs on the fig tree, and the leaves will dry up. What I have given them will pass away.” "},{"num":14,"verse":"Why are we sitting here? Gather together, and let us go into the strong cities and die there. For the Lord our God has given us up to die. He has given us poison in our water to drink, for we have sinned against Him. "},{"num":15,"verse":"We waited for peace, but no good came. We waited for a time of healing, but see, there is much trouble. "},{"num":16,"verse":"The noise of his horses is heard from Dan. The whole land shakes at the sound of his war horses. For they come and destroy the land and everything that is in it, the city and those who live in it. "},{"num":17,"verse":"“For see, I am sending the worst of snakes against you, poison snakes which cannot be stopped. And they will bite you,” says the Lord."},{"num":18,"verse":"My sorrow is too much to heal. My heart is weak within me. "},{"num":19,"verse":"Listen! It is the cry of my people from a far away land: “Is the Lord not in Zion? Is her King not in her?” “Why have they made Me angry with their objects of worship, and with strange gods?” "},{"num":20,"verse":"“Gathering time is past, summer is ended, and we are not saved.” "},{"num":21,"verse":"I am hurt because my people are hurt. I am filled with sorrow, and fear has taken hold of me. "},{"num":22,"verse":"Is there no healing oil in Gilead? Is there no doctor there? Why then have my people not been healed?"}]