[[],[{"type":"prose","content":"These are the words of the Teacher, King David’s son, who ruled in Jerusalem."},{"type":"header","content":"Everything Is Meaningless"}],[{"type":"prose","content":"“Everything is meaningless,” says the Teacher, “completely meaningless!”"}],[{"type":"prose","content":"What do people get for all their hard work under the sun?"}],[{"type":"prose","content":"Generations come and generations go, but the earth never changes."}],[{"type":"prose","content":"The sun rises and the sun sets, then hurries around to rise again."}],[{"type":"prose","content":"The wind blows south, and then turns north. Around and around it goes, blowing in circles."}],[{"type":"prose","content":"Rivers run into the sea, but the sea is never full. Then the water returns again to the rivers and flows out again to the sea."}],[{"type":"prose","content":"Everything is wearisome beyond description. No matter how much we see, we are never satisfied. No matter how much we hear, we are not content."}],[{"type":"prose","content":"History merely repeats itself. It has all been done before. Nothing under the sun is truly new."}],[{"type":"prose","content":"Sometimes people say, “Here is something new!” But actually it is old; nothing is ever truly new."}],[{"type":"prose","content":"We don’t remember what happened in the past, and in future generations, no one will remember what we are doing now."},{"type":"header","content":"The Teacher Speaks: The Futility of Wisdom"}],[{"type":"prose","content":"I, the Teacher, was king of Israel, and I lived in Jerusalem."}],[{"type":"prose","content":"I devoted myself to search for understanding and to explore by wisdom everything being done under heaven. I soon discovered that God has dealt a tragic existence to the human race."}],[{"type":"prose","content":"I observed everything going on under the sun, and really, it is all meaningless—like chasing the wind."}],[{"type":"prose","content":"I said to myself, “Look, I am wiser than any of the kings who ruled in Jerusalem before me. I have greater wisdom and knowledge than any of them.”"}],[{"type":"prose","content":"So I set out to learn everything from wisdom to madness and folly. But I learned firsthand that pursuing all this is like chasing the wind."}]]