[[],[{"type":"header","content":"The Altar at Mount Ebal"},{"type":"prose","content":"Then Moses and the elders of Israel commanded the people, saying, “Keep (remember, obey) all the commandments which I am commanding you today. "}],[{"type":"prose","content":"So it shall be on the day when you cross the Jordan to [enter] the land which the  your God gives you, that you shall set up for yourself large stones and coat them with plaster (lime, whitewash). "}],[{"type":"prose","content":"You shall write on the stones all the words of this law when you cross over, so that you may go into the land which the  your God gives you, a land [of plenty] flowing with milk and honey, just as the , the God of your fathers has promised you. "}],[{"type":"prose","content":"Now when you cross the Jordan you shall set up these stones on Mount Ebal, just as I am commanding you today and coat them with plaster. "}],[{"type":"prose","content":"There you shall build an altar to the  your God, an altar of stones; you shall not use an iron tool on them. "}],[{"type":"prose","content":"You shall build the altar of the  your God with whole [uncut] stones, and offer burnt offerings on it to the  your God; "}],[{"type":"prose","content":"and you shall sacrifice peace offerings and shall eat there, and shall rejoice before the  your God. "}],[{"type":"prose","content":"And you shall write very clearly on the stones all the words of this law.”"}],[{"type":"prose","content":"Then Moses and the Levitical priests said to all Israel, “Be silent and listen, O Israel! This day you have become a people for the  your God. "}],[{"type":"prose","content":"So you shall obey the voice of the  your God, and do His commandments and statutes which I am commanding you today.”"},{"type":"header","content":"The Curses of Mount Ebal"}],[{"type":"prose","content":"Moses also commanded the people that day, saying, "}],[{"type":"prose","content":"“These [tribes] shall stand on Mount Gerizim to bless the people when you have crossed the Jordan: Simeon, Levi, Judah, Issachar, Joseph, and Benjamin. "}],[{"type":"prose","content":"These [tribes] shall stand on Mount Ebal to  the curse [for disobedience]: Reuben, Gad, Asher, Zebulun, Dan, and Naphtali. "}],[{"type":"prose","content":"The Levites shall answer with a loud voice to all the men of Israel:"}],[{"type":"prose","content":"‘Cursed is the man who makes a carved or cast image (idol), a repulsive thing to the , the work of the hands of the artisan, and sets it up in secret.’ All the people shall answer and say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who dishonors (treats with contempt) his father or his mother.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who moves his neighbor’s boundary mark.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who misleads a blind person on the road.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who distorts (perverts) the justice due to a stranger, an orphan, and a widow.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who is intimate with his father’s [former] wife, because he has violated what belongs to his father.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who is intimate with any animal.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who is intimate with his [half] sister, whether his father’s or his mother’s daughter.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who is intimate with his mother-in-law.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who strikes his neighbor in secret.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who accepts a bribe to strike down an innocent person.’ And all the people shall say, ‘Amen.’"}],[{"type":"prose","content":"‘Cursed is he who does not confirm the words of this law by doing them [keeping them, taking them to heart as the rule of his life].’ And all the people shall say, ‘Amen.’"}]]