[{"header":"The Law Written on Stones"},{"num":27,"verse":"Moses and the elders of Israel commanded the people. They said, “Keep all the commands I have given you today. "},{"num":2,"verse":"Soon you will cross the Jordan River. You will go into the land the Lord your God is giving you. On that day set up some large stones. Cover them with plaster. "},{"num":3,"verse":"When you cross over, write all the words of these teachings on them. Then you may enter the land the Lord your God is giving you. It is a land where much food grows. It is just as the Lord, the God of your ancestors, promised. "},{"num":4,"verse":"After you have crossed the Jordan River, set up these stones. Set them on Mount Ebal as I command you today. And cover them with plaster. "},{"num":5,"verse":"Build an altar of stones there to the Lord your God. But don’t use any iron tool to cut the stones. "},{"num":6,"verse":"Build the altar of the Lord your God with stones from the field. Offer burnt offerings on it to the Lord your God. "},{"num":7,"verse":"Offer fellowship offerings there. Eat them and rejoice before the Lord your God. "},{"num":8,"verse":"Then write clearly all the words of these teachings on the stones.”"},{"header":"Curses of the Law"},{"num":9,"verse":"Then Moses and the Levites, who are the priests, spoke to all Israel. They said, “Be quiet, Israel. Listen! Today you have become the people of the Lord your God. "},{"num":10,"verse":"Obey the Lord your God. Keep his commands and laws that I give you today.”"},{"num":11,"verse":"That day Moses also gave the people this command:"},{"num":12,"verse":"You will cross the Jordan River. Then these tribes must stand on Mount Gerizim to bless the people: Simeon, Levi, Judah, Issachar, Joseph and Benjamin. "},{"num":13,"verse":"And these tribes must stand on Mount Ebal to announce the curses: Reuben, Gad, Asher, Zebulun, Dan and Naphtali."},{"num":14,"verse":"The Levites will say to all the people of Israel in a loud voice:"},{"num":15,"verse":"“Anyone will be cursed who makes an idol or statue and secretly sets it up. The Lord hates idols made by man.”"},{"num":16,"verse":"“Anyone will be cursed who dishonors his father or his mother.”"},{"num":17,"verse":"“Anyone will be cursed who moves the stone that marks his neighbor’s border.”"},{"num":18,"verse":"“Anyone will be cursed who leads a blind person away from the road.”"},{"num":19,"verse":"“Anyone will be cursed who is unfair to foreigners, orphans or widows.”"},{"num":20,"verse":"“A man will be cursed who has physical relations with his father’s wife. It is a dishonor to his father.”"},{"num":21,"verse":"“Anyone will be cursed who has unnatural physical relations with an animal.”"},{"num":22,"verse":"“A man will be cursed who has physical relations with his sister. She may be his father’s daughter or his mother’s daughter.”"},{"num":23,"verse":"“A man will be cursed who has physical relations with his mother-in-law.”"},{"num":24,"verse":"“Anyone will be cursed who kills his neighbor secretly.”"},{"num":25,"verse":"“Anyone will be cursed who takes money to murder an innocent person.”"},{"num":26,"verse":"“Anyone will be cursed who does not agree with the words of these teachings and does not obey them.”"}]