[{"header":"The Altar on Mount Ebal"},{"num":27,"verse":"Then Moses and the elders of Israel commanded the people, saying: Keep all the commandments which I am commanding you today. "},{"num":2,"verse":"On the day when you cross over the Jordan into the land which the Lord your God is giving you, you must set up for yourself great stones, and cover them with plaster. "},{"num":3,"verse":"Then you must write all the words of this law on them, when you cross over, so that you may enter into the land which the Lord your God is giving you, a land flowing with milk and honey, just as the Lord God of your fathers promised you. "},{"num":4,"verse":"Therefore, when you cross over the Jordan, you shall set up these stones, which I am commanding you today, on Mount Ebal, and you shall cover them with plaster. "},{"num":5,"verse":"There you must build an altar to the Lord your God, an altar of stones. You must not use any iron tool on them. "},{"num":6,"verse":"You must build the altar of the Lord your God with whole stones, and you must offer burnt offerings on it to the Lord your God. "},{"num":7,"verse":"You must offer peace offerings and eat there, and rejoice before the Lord your God. "},{"num":8,"verse":"You must write all the words of this law very clearly on the stones."},{"num":9,"verse":"Moses and the Levitical priests spoke to all Israel, saying: Be silent and listen, O Israel. Today you have become the people of the Lord your God. "},{"num":10,"verse":"Therefore, you must obey the voice of the Lord your God and do His commandments and His statutes, which I am commanding you today."},{"num":11,"verse":"Moses commanded the people the same day, saying:"},{"num":12,"verse":"These shall stand on Mount Gerizim to bless the people when you cross over the Jordan: Simeon, Levi, Judah, Issachar, Joseph, and Benjamin. "},{"num":13,"verse":"And these must stand on Mount Ebal for the curse: Reuben, Gad, Asher, Zebulun, Dan, and Naphtali."},{"num":14,"verse":"The Levites will answer and say to all the men of Israel with a loud voice:"},{"num":15,"verse":"“Cursed is the man who makes any graven or molded image, an abomination to the Lord, the work of the hands of the craftsman, and puts it in a secret place.” And all the people shall answer and say, “Amen.”"},{"num":16,"verse":"“Cursed is he who disrespects his father or his mother.” And all the people shall say, “Amen.”"},{"num":17,"verse":"“Cursed is he who removes his neighbor’s landmark.” And all the people shall say, “Amen.”"},{"num":18,"verse":"“Cursed is he who misleads the blind man on the road.” And all the people shall say, “Amen.”"},{"num":19,"verse":"“Cursed is he who perverts justice for the foreigner, orphan, and widow.” And all the people shall say, “Amen.”"},{"num":20,"verse":"“Cursed is he who lies with his father’s wife, for he dishonors his father.” And all the people shall say, “Amen.”"},{"num":21,"verse":"“Cursed is he who lies with any kind of beast.” And all the people shall say, “Amen.”"},{"num":22,"verse":"“Cursed is he who lies with his sister, the daughter of his father, or the daughter of his mother.” And all the people shall say, “Amen.”"},{"num":23,"verse":"“Cursed is he who lies with his mother-in-law.” And all the people shall say, “Amen.”"},{"num":24,"verse":"“Cursed is he who strikes down his neighbor secretly.” And all the people shall say, “Amen.”"},{"num":25,"verse":"“Cursed is he who receives pay to slay an innocent person.” And all the people shall say, “Amen.”"},{"num":26,"verse":"“Cursed is he who does not confirm all the words of this law by doing them.” And all the people shall say, “Amen.”"}]