[{"num":12,"verse":"¶ The word of the LORD also came unto me, saying,"},{"num":2,"verse":"Son of man, thou dwellest in the midst of a rebellious house, which have eyes to see and do not see; they have ears to hear and do not hear; for they are a rebellious house."},{"num":3,"verse":"Therefore, thou son of man, prepare thee stuff for moving and move by day in their sight and thou shalt move from thy place to another place in their sight: they will not see for they are a rebellious house."},{"num":4,"verse":"And thou shalt bring forth thy stuff by day in their sight, as stuff for moving; and thou shalt go forth in the evening in their sight, as those that go forth to not return."},{"num":5,"verse":"Dig through the wall in their sight, and leave thereby."},{"num":6,"verse":"In their sight thou shalt bear it upon thy shoulders and carry it forth in the night; thou shalt cover thy face, and thou shalt not look at the land; for I have set thee for a sign unto the house of Israel."},{"num":7,"verse":"And I did so as I was commanded: I brought forth my stuff by day, as stuff for a journey, and in the evening I dug through the wall with my hand; I brought it forth in the night, and I bore it upon my shoulder in their sight."},{"num":8,"verse":"And in the morning the word of the LORD came unto me, saying,"},{"num":9,"verse":"Son of man, has not the house of Israel, the rebellious house, said unto thee, What doest thou?"},{"num":10,"verse":"Say thou unto them, Thus hath the Lord GOD said: This burden concerns the prince in Jerusalem and all the house of Israel that are among them."},{"num":11,"verse":"Say, I am your sign: like as I have done, so shall it be done unto them: when they go to another country they shall go in captivity."},{"num":12,"verse":"And the prince that is among them shall be born upon their shoulders in the night, and they shall go forth; they shall dig through the wall to carry him out thereby; he shall cover his face that he not see the land with his eyes."},{"num":13,"verse":"But I will spread my net upon him, and he shall be taken in my snare, and I will cause him to be taken to Babylon to the land of the Chaldeans; yet he shall not see it though he shall die there."},{"num":14,"verse":"And I will scatter toward every wind all that were about him to help him and all his companies; and I will draw out the sword after them."},{"num":15,"verse":"And they shall know that I am the LORD when I shall scatter them among the Gentiles and disperse them in the countries."},{"num":16,"verse":"But I will leave a few men of them from the sword, from the famine, and from the pestilence; that they may declare all their abominations among the Gentiles where they go; and they shall know that I am the LORD."},{"num":17,"verse":"¶ And the word of the LORD came to me, saying,"},{"num":18,"verse":"Son of man, eat thy bread with quaking and drink thy water with trembling and with anxiety"},{"num":19,"verse":"and say unto the people of the land, Thus hath the Lord GOD said regarding the inhabitants of Jerusalem and the land of Israel. They shall eat their bread with anxiety and drink their water with terror that her land may be desolate from all that is in it because of the violence of all those that dwell therein."},{"num":20,"verse":"And the cities that are inhabited shall be laid waste, and the land shall be desolate; and ye shall know that I am the LORD."},{"num":21,"verse":"¶ And the word of the LORD came unto me, saying,"},{"num":22,"verse":"Son of man, what is that saying that ye have in the land of Israel that saith, The days shall be prolonged, and every vision shall fail?"},{"num":23,"verse":"Tell them therefore, Thus hath the Lord GOD said: I will make this saying to cease, and they shall not repeat this as a saying in Israel but say unto them, Those days have drawn nigh, and the fulfillment of every vision."},{"num":24,"verse":"For there shall no longer be any vain vision or flattering divination within the house of Israel."},{"num":25,"verse":"Because I, the LORD, will speak, and the word that I shall speak shall come to pass; it shall no longer be prolonged, for in your days, O rebellious house, I will speak the word and will perform it, said the Lord GOD."},{"num":26,"verse":"Again the word of the LORD came to me, saying,"},{"num":27,"verse":"Son of man, behold, those of the house of Israel say, The vision that he sees is for many days to come, and he prophesies of the times that are far off."},{"num":28,"verse":"Therefore say unto them, Thus hath the Lord GOD said: All of my words shall not be prolonged any longer, but the word which I have spoken shall be done, said the Lord GOD."}]