[{"header":"David at Keilah"},{"num":23,"verse":"Someone told David, “Look, the Philistines are fighting against Keilah. They are robbing grain from the threshing floors.”"},{"num":2,"verse":"David asked the Lord, “Should I go and fight these Philistines?”"},{"num":3,"verse":"But David’s men said to him, “We’re afraid here in Judah. We will be much more afraid if we go to Keilah where the Philistine army is.”"},{"num":4,"verse":"David again asked the Lord. And the Lord answered, “Go down to Keilah. I will help you defeat the Philistines.” "},{"num":5,"verse":"So David and his men went to Keilah. They fought the Philistines and took their cattle. David killed many Philistines and saved the people of Keilah. "},{"num":6,"verse":"(Now Abiathar son of Ahimelech had brought the holy vest with him. He brought it when he came to David at Keilah.)"},{"header":"Saul Chases David"},{"num":7,"verse":"Someone told Saul that David was now at Keilah. Saul said, “God has given David to me! He has trapped himself because he has entered a town with gates and bars.” "},{"num":8,"verse":"Saul called all his army together for battle. They prepared to go down to Keilah to attack David and his men."},{"num":9,"verse":"David learned Saul was making evil plans against him. So he said to Abiathar the priest, “Bring the holy vest.” "},{"num":10,"verse":"David prayed, “Lord, God of Israel, I have heard about Saul’s plans. He is coming to Keilah to destroy the town because of me. "},{"num":11,"verse":"Will the people of Keilah give me to Saul? Will Saul come to Keilah, as I heard? Lord, God of Israel, tell me, your servant!”"},{"num":12,"verse":"Again David asked, “Will the people of Keilah give me and my men to Saul?”"},{"num":13,"verse":"So David and his men left Keilah. There were about 600 men who went with him. And they kept moving from place to place. When Saul found that David had escaped from Keilah, he did not go there."},{"num":14,"verse":"David stayed in the protected places in the desert. He also stayed in the hills of the Desert of Ziph. Every day Saul looked for David. But the Lord did not let him take David."},{"num":15,"verse":"David was at Horesh in the Desert of Ziph. He was afraid because Saul was coming to kill him. "},{"num":16,"verse":"But Saul’s son Jonathan went to David at Horesh. He helped David have stronger faith in God. "},{"num":17,"verse":"Jonathan told him, “Don’t be afraid. My father won’t touch you. You will become king of Israel, and I will be second to you. Even my father Saul knows this.” "},{"num":18,"verse":"The two of them made an agreement before the Lord. Then Jonathan went home. But David stayed at Horesh."},{"num":19,"verse":"The people from Ziph went to Saul at Gibeah. They told him, “David is hiding in our land. He’s at the protected places of Horesh. They are on the hill of Hakilah, south of Jeshimon. "},{"num":20,"verse":"Now, our king, come down anytime you want. It’s our duty to give David to you.”"},{"num":21,"verse":"Saul answered, “The Lord bless you for helping me. "},{"num":22,"verse":"Go and learn more about him. Find out where he is staying. Find out who has seen him there. I have heard that he is clever. "},{"num":23,"verse":"Find all the hiding places he uses. And come back and tell me everything. Then I’ll go with you. If David is in the area, I will find him. I will track him down among all the families in Judah.”"},{"num":24,"verse":"So they went back to Ziph ahead of Saul. David and his men were in the Desert of Maon. This was in the desert area south of Jeshimon. "},{"num":25,"verse":"Saul and his men went to look for David. But people warned David that Saul was looking for him. David then went down to a rock and stayed in the Desert of Maon. Saul heard that David had gone there. So he went after him into the Desert of Maon."},{"num":26,"verse":"Saul was going along one side of the mountain. David and his men were on the other side. They were hurrying to get away from Saul. Saul and his soldiers were closing in on David and his men. "},{"num":27,"verse":"But a messenger came to Saul. He said, “Come quickly! The Philistines are attacking our land!” "},{"num":28,"verse":"So Saul stopped chasing David and went to fight the Philistines. That is why people call this place Rock of Parting. "},{"num":29,"verse":"David left the Desert of Maon and lived in the protected places of En Gedi."}]