[{"header":"David Saves Keilah"},{"num":23,"verse":"Then they told David, “Listen, the Philistines are fighting against Keilah, and they are looting the threshing floors.” "},{"num":2,"verse":"Therefore David inquired of the Lord, saying, “Shall I go and attack these Philistines?”"},{"num":3,"verse":"The men of David said to him, “We are afraid here in Judah. How much more then, if we go down to Keilah against the armies of the Philistines?”"},{"num":4,"verse":"Then David again inquired of the Lord. And the Lord answered him and said, “Arise, go down to Keilah because I am giving the Philistines into your hand.” "},{"num":5,"verse":"Then David and his men went to Keilah. He fought with the Philistines and carried off their livestock, and he struck them with a great slaughter. So David rescued the inhabitants of Keilah. "},{"num":6,"verse":"When Abiathar the son of Ahimelek fled to David at Keilah, he came down with the ephod in his hand."},{"header":"Saul Pursues David"},{"num":7,"verse":"It was reported to Saul that David had come to Keilah. And Saul said, “God has delivered him into my hand. For he is shut in, by entering into a town that has gates and bars.” "},{"num":8,"verse":"Then Saul summoned all the people together for war, to go down to Keilah to besiege David and his men."},{"num":9,"verse":"David found out that Saul was planning evil against him. So he said to Abiathar the priest, “Bring the ephod near.” "},{"num":10,"verse":"And David said, “O Lord, God of Israel, Your servant has certainly heard that Saul seeks to come to Keilah, to destroy the city on account of me. "},{"num":11,"verse":"Will the leaders of Keilah deliver me into his hand? Will Saul come down, as Your servant has heard? O Lord, God of Israel, please tell Your servant.”"},{"num":12,"verse":"Then said David, “Will the men of Keilah deliver me and my men into the hand of Saul?”"},{"num":13,"verse":"So David and his men, which were about six hundred, arose and left Keilah. And they went wherever they could go. Now it was told Saul that David had escaped from Keilah. So he halted the expedition."},{"num":14,"verse":"And David remained in the wilderness in strongholds, and dwelled in mountains in the Wilderness of Ziph. Saul sought him every day, but God did not give him into his hand."},{"num":15,"verse":"Now David saw that Saul had come out to seek his life. And David was in the Wilderness of Ziph in Horesh. "},{"num":16,"verse":"Jonathan, the son of Saul, arose and went to David at Horesh. And he strengthened his hand in God. "},{"num":17,"verse":"He said to him, “Do not fear, for the hand of Saul my father will not find you. You will be king over Israel, and I will be next to you. Saul my father knows this.” "},{"num":18,"verse":"The two of them made a covenant before the Lord. And David stayed in Horesh, but Jonathan went to his house."},{"num":19,"verse":"Then the Ziphites went up to Saul to Gibeah saying, “Is David not hiding himself with us in strongholds in Horesh, on the hill of Hakilah, which is south of Jeshimon? "},{"num":20,"verse":"Now, O king, come down according to all the desire of your soul to come down. And our part will be to deliver him into the king’s hand.”"},{"num":21,"verse":"Saul said, “Blessed are you of the Lord. For you have had compassion on me. "},{"num":22,"verse":"Please go, make sure again. Investigate and see the place where his foot rests, and who has seen him there. For it has been said to me that he is very cunning. "},{"num":23,"verse":"So look and learn about all the hiding places where he hides himself. And come to me with certainty, and I will go with you. And it will be that if he is in the land, then I will track him throughout all the clans of Judah.”"},{"num":24,"verse":"So they arose and went to Ziph before Saul. But David and his men were in the Wilderness of Maon, in the desert south of Jeshimon. "},{"num":25,"verse":"Saul and his men went to seek him, but they told David. Therefore he came down to the Rock, and lived in the Wilderness of Maon. And when Saul heard that, he pursued after David in the Wilderness of Maon."},{"num":26,"verse":"Saul went on this side of the mountain and David and his men on that side of the mountain. And David hurried to get away from Saul. Now Saul and his men were closing in on David and his men to capture them. "},{"num":27,"verse":"But a messenger came to Saul saying, “Hurry and go! For the Philistines have invaded the land.” "},{"num":28,"verse":"So Saul returned from pursuing after David, and he went against the Philistines. Therefore they called that place the Rock of Escape. "},{"num":29,"verse":"David then went up from there and lived in the strongholds of En Gedi."}]