[{"num":23,"verse":"Then they told Dovid, saying, Hinei, the Pelishtim fight against Ke’ilah, and they rob the granot (threshing floors)."},{"num":2,"verse":"Therefore Dovid inquired of Hashem, saying, Shall I go and strike these Pelishtim? And Hashem said unto Dovid, Go, and strike the Pelishtim, and save Ke’ilah."},{"num":3,"verse":"And Anshei Dovid said unto him, Hinei, Anachnu (we) are afraid here in Yehudah; how much more then if we come to Ke’ilah against the maarkhot (military lines) of the Pelishtim?"},{"num":4,"verse":"Then Dovid inquired of Hashem yet again. And Hashem answered him and said, Arise, go down to Ke’ilah; for I will deliver the Pelishtim into thine yad."},{"num":5,"verse":"So Dovid and his anashim went to Ke’ilah, and fought with the Pelishtim, and brought away their livestock, and attacked them with a makkah gedolah (great defeat). So Dovid saved the inhabitants of Ke’ilah."},{"num":6,"verse":"And it came to pass, when Evyatar (Abiathar) Ben Achimelech fled to Dovid to Ke’ilah, that he came down with the Ephod [with oracular lot; see Ex 28,39] in his yad."},{"num":7,"verse":"And it was told Sha’ul that Dovid was come to Ke’ilah. And Sha’ul said, Elohim hath delivered him into mine yad; for he is shut in, by entering into an ir (town) that hath gates and bar."},{"num":8,"verse":"And Sha’ul called kol HaAm together for milchamah, to go down to Ke’ilah, to besiege Dovid and his anashim."},{"num":9,"verse":"And Dovid knew that Sha’ul secretly plotted ra’ah (evil, harm) against him; and he said to Evyatar (Abiathar) HaKohen, Bring here the Ephod."},{"num":10,"verse":"Then said Dovid, Hashem Elohei Yisroel, Thy eved hath certainly heard that Sha’ul seeketh to come to Ke’ilah, to destroy the ir (town) on my account."},{"num":11,"verse":"Will the Ba’alei Ke’ilah (citizens of Ke’ilah) deliver me up into his yad? Will Sha’ul come down, as Thy eved hath heard? Hashem Elohei Yisroel, tell now Thy eved. And Hashem said, He will come down."},{"num":12,"verse":"Then said Dovid, Will the Baalei Ke’ilah shut me and my anashim up into the yad Sha’ul? And Hashem said, They will deliver thee up."},{"num":13,"verse":"Then Dovid and his anashim, which were about shesh me’ot ish, arose and departed out of Ke’ilah, and went wherever they could go. And it was told Sha’ul that Dovid was escaped from Ke’ilah; and he refrained from going forth."},{"num":14,"verse":"And Dovid stayed in the midbar in metzadot (strongholds, masadas) and remained on a har in the midbar Ziph. And Sha’ul searched for him every day, but Elohim delivered him not into his yad."},{"num":15,"verse":"And Dovid saw that Sha’ul was come out to seek his nefesh: and Dovid was in the midbar Ziph at Choresh."},{"num":16,"verse":"And Yonatan Ben Sha’ul arose, and went to Dovid at Choresh, and strengthened his yad in Elohim [i.e., encouraged him in G-d]."},{"num":17,"verse":"And he said unto him, Fear not; for the yad Sha’ul Avi shall not find thee; and thou shalt be Melech over Yisroel, and I shall be mishneh (second) unto thee; and that also Sha’ul Avi knoweth."},{"num":18,"verse":"And they two made a brit (covenant) before Hashem; and Dovid stayed at Choresh, and Yonatan went to his bais."},{"num":19,"verse":"Then came up the Ziphim to Sha’ul to Giveah, saying, Doth not Dovid hide himself among us in metzadot (strongholds, masadas) at Choresh, in the hill of Chachilah, which is on the south of Yeshimon?"},{"num":20,"verse":"Now therefore, O Melech, come down according to all the desire of thy nefesh to come down; and our part shall be to deliver him into the yad HaMelech."},{"num":21,"verse":"And Sha’ul said, Berukhim atem l’Hashem (Blessed be ye of Hashem); for ye have compassion on me."},{"num":22,"verse":"Now go, prepare further, and know and see his makom where his hideouts are, and who hath seen him there; for it is told me that he dealeth very craftily."},{"num":23,"verse":"See therefore, and take knowledge of all the machavo’im (hideouts) where he hideth himself, and come ye again to me with the certainty, and I will go with you; it shall come to pass, if he be in the land, that I will search him out throughout all the thousands of Yehudah."},{"num":24,"verse":"And they arose, and went to Ziph ahead of Sha’ul; but Dovid and his anashim were in the midbar Ma’on, in the Aravah on the south of Yeshimon."},{"num":25,"verse":"Sha’ul also and his anashim went to seek him. When Dovid was told, he descended and came down to the Sela (Rock), and stayed in the midbar Ma’on. And when Sha’ul heard that, he pursued Dovid in the midbar Ma’on."},{"num":26,"verse":"And Sha’ul went on this side of the har, and Dovid and his anashim on that side of the har; and Dovid made haste to get away for fear of Sha’ul; for Sha’ul and his anashim encircled Dovid and his anashim round about to take them."},{"num":27,"verse":"But there came a malach unto Sha’ul, saying, Haste thee, and come; for the Pelishtim have invaded HaAretz."},{"num":28,"verse":"Wherefore Sha’ul returned from pursuing after Dovid, and went against the Pelishtim; therefore they called that makom Sela HaMachlekot (Rock of Escaping)."},{"num":24,"verse":"And Dovid went up from there, and dwelt in metzadot at Ein-Gedi."}]