[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:8-22 A Jew should not be held in servitude above seven years. This law they and their fathers had broken. And when there was some hope that the siege was raised, they forced the servants they had released into their services again. Those who think to cheat God by dissembled repentance and partial reformation, put the greatest cheat upon their own souls. This shows that liberty to sin, is really only liberty to have the sorest judgments. It is just with God to disappoint expectations of mercy, when we disappoint the expectations of duty. And when reformation springs only from terror, it is seldom lasting. Solemn vows thus entered into, profane the ordinances of God; and the most forward to bind themselves by appeals to God, are commonly most ready to break them. Let us look to our hearts, that our repentance may be real, and take care that the law of God regulates our conduct.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which are gone up from you - i. e., which have departed for the present, and have raised the siege. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22. I will command—Nebuchadnezzar, impelled unconsciously by a divine instigation, returned on the withdrawal of the Egyptians.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I will put it into their hearts to return, saith the Lord, and they shall come back again to the siege, and shall rise up no more till they have taken the city, and burned it with fire, and made the whole country desolate. The motions of armies are under the government of Divine Providence, they are at God’s command; when he bids them come they come, what he bids them do they do, and shall certainly effect what God hath determined. When we come to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we shall read of the fulfilling of this prophecy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, I will command, saith the Lord, and cause them to return to this city,.... The Lord of hosts, or armies, was \"Generalissimo\" of Nebuchadnezzar's army, had it at his command, and could direct if as he pleased, and order it to march and countermarch as he thought fit: it was under the direction of his providence that it departed from Jerusalem, to try the inhabitants of it; and now, by a secret instinct, he would so powerfully work upon it, and by the ordering of external causes so manage it, that it should return to Jerusalem again, and carry on the siege with redoubled rigour: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall fight against it, and take it, and burn it with fire; they fought against it by shooting arrows from their bows, casting stones from their engines, and by beating down the walls with their battering rams; with which making breaches, they entered in and took the city; and burnt the temple, palaces, and other houses, with fire; of all which see the accomplishment in Jeremiah 52:4; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall fight against it, and take it, and burn it with fire; they fought against it by shooting arrows from their bows, casting stones from their engines, and by beating down the walls with their battering rams; with which making breaches, they entered in and took the city; and burnt the temple, palaces, and other houses, with fire; of all which see the accomplishment in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will make the cities of Judah a desolation without an inhabitant: many of them were already; the king of Babylon having taken, ravaged, and plundered them before he came to Jerusalem; and whither the inhabitants of them, that escaped the sword, fled for security; and others of them, that were not, now should be made desolate upon the taking of Jerusalem, as Lachish and Azekah, Jeremiah 34:7; which should fall into the hands of the enemy, and the inhabitants thereof be forced to flee into other countries, or would be carried captive; so that they would be without any, or have but few to dwell in them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will make the cities of Judah a desolation without an inhabitant: many of them were already; the king of Babylon having taken, ravaged, and plundered them before he came to Jerusalem; and whither the inhabitants of them, that escaped the sword, fled for security; and others of them, that were not, now should be made desolate upon the taking of Jerusalem, as Lachish and Azekah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 34:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which should fall into the hands of the enemy, and the inhabitants thereof be forced to flee into other countries, or would be carried captive; so that they would be without any, or have but few to dwell in them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Behold, I will command, saith the LORD, and cause them to return to this city; and they shall fight against it, and take it, and burn it with fire: and I will make the cities of Judah a desolation without an inhabitant.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 34:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " give the real explanation of the threatening attached to the ritual of the covenant. Princes, officers of the court, priests and people, who have transgressed the covenant, shall die by the hand of the enemy, and perish ignominiously. On ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 34:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. On סריסים see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". King Zedekiah also, with his princes, his retinue, shall fall into the hand of his enemies, ay, into the hands of the Chaldeans, who have now withdrawn from Jerusalem (on עלה  see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:5-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]