[[],[{"type":"header","content":"David Flees to the Philistines"},{"type":"prose","content":"But David said in his heart, “Now I will die one day by the hand of Saul. There is nothing better for me than to escape to the land of the Philistines. Then Saul will give up searching for me inside the borders of Israel, and I will escape from his hand [once and for all].” "}],[{"type":"prose","content":"So David and the six hundred men who were with him arose and crossed over to Achish the son of Maoch, king of Gath. "}],[{"type":"prose","content":"And David lived with Achish at Gath, he and his men, each man with his household, and David with his two wives, Ahinoam the Jezreelitess, and Abigail the Carmelitess, [who was] Nabal’s widow. "}],[{"type":"prose","content":"When Saul was told that David had fled to Gath, he no longer searched for him."}],[{"type":"prose","content":"Then David said to Achish, “If I have found favor in your sight, let me be given a place [of my own] in one of the cities in the country, so that I may live there; for why should your servant live in the royal city with you?” "}],[{"type":"prose","content":"Then Achish gave David [the town of] Ziklag that day. Therefore Ziklag has belonged to the kings of Judah to this day. "}],[{"type":"prose","content":"The number of days that David lived in the country of the Philistines was a year and four months."}],[{"type":"prose","content":"Now David and his men went up and raided the Geshurites, the Girzites, and the Amalekites [the enemies of Israel that Joshua had failed to annihilate]; for they had inhabited the land from ancient times, as one comes to Shur even as far as the land of Egypt. "}],[{"type":"prose","content":"David attacked the land and did not leave a man or a woman alive, but he took the sheep, the cattle, the donkeys, the camels, and the clothing, and returned to Achish. "}],[{"type":"prose","content":"When Achish asked, “Where did you raid today?” David replied, “Against the Negev (the South country) of Judah, and against the Negev of the Jerahmeelites, and against the Negev of the Kenites.” "}],[{"type":"prose","content":"David did not leave a man or a woman alive to bring  to Gath, saying [to himself], “Otherwise they will tell about us, saying, ‘This is what David has done, and this has been his practice all the time that he has lived in the country of the Philistines.’” "}],[{"type":"prose","content":"Achish believed David, saying, “He has certainly become hated by his people in Israel; so he will always be my servant.”"}]]