[{"header":"David With the Philistines"},{"num":27,"verse":"Then David said in his heart, “Now I will perish one day by the hand of Saul. There is nothing better for me than that I should escape to the land of the Philistines. Then Saul will despair of continually seeking me within all the territory of Israel. So will I escape out of his hand.”"},{"num":2,"verse":"David arose and passed over with the six hundred men that were with him to Achish, the son of Maok, king of Gath. "},{"num":3,"verse":"And David lived with Achish at Gath, he and his men, each man with his household, even David with his two wives, Ahinoam the Jezreelitess, and Abigail the Carmelitess, Nabal’s widow. "},{"num":4,"verse":"It was reported to Saul that David had fled to Gath, so he no longer sought him."},{"num":5,"verse":"David said to Achish, “If I have now found favor in your eyes, let them give me a place in one of the cities in the countryside, that I may dwell there. For why should your servant dwell in the royal city with you?”"},{"num":6,"verse":"Then Achish gave him Ziklag that day. Therefore Ziklag has belonged to the kings of Judah to this day. "},{"num":7,"verse":"The number of days that David lived in the country of the Philistines was a year and four months."},{"num":8,"verse":"David and his men went up and invaded the Geshurites, the Girzites, and the Amalekites. For they were inhabitants of the land from of old, as you come to Shur, even to the land of Egypt. "},{"num":9,"verse":"So David would strike the land and would not leave either man or woman alive. And he would take the sheep, the cattle, the donkeys, the camels, and the garments. And then he came back to Achish."},{"num":10,"verse":"Then Achish would say, “Where have you made a raid today?” And David would say, “Against the Negev of Judah,” or “Against the Negev of the Jerahmeelites,” or “Against the Negev of the Kenites.” "},{"num":11,"verse":"Now David would leave neither a man nor a woman alive, to bring tidings to Gath, saying, “Lest they should tell on us, saying, ‘Thus David has done.’ ” This was his practice all the days which he lived in the country of the Philistines. "},{"num":12,"verse":"And Achish believed David, saying, “He has surely become a stench to his people Israel. Therefore he will be my servant forever.”"}]