[{"header":"David Among the Philistines"},{"num":27,"verse":"David thought, “Some day Saul will destroy me. So the best thing I can do is escape. I’ll go to the land of the Philistines. Then Saul will stop looking for me everywhere in Israel. His hand won’t be able to reach me.”"},{"num":2,"verse":"So David and his 600 men left Israel. They went to Achish, the king of Gath. He was the son of Maok. "},{"num":3,"verse":"David and his men made their homes in Gath near Achish. Each of David’s men had his family with him. David had his two wives with him. They were Ahinoam from Jezreel and Abigail from Carmel. Abigail was Nabal’s widow. "},{"num":4,"verse":"Saul was told that David had run away to Gath. So he didn’t look for David anymore."},{"num":5,"verse":"David said to Achish, “If you are pleased with me, give me a place in one of your country towns. I can live there. I don’t really need to live near you in the royal city.”"},{"num":6,"verse":"So on that day Achish gave David the town of Ziklag. It has belonged to the kings of Judah ever since that time. "},{"num":7,"verse":"David lived in Philistine territory for a year and four months."},{"num":8,"verse":"Sometimes David and his men would go up and attack the Geshurites. At other times they would attack the Girzites or the Amalekites. All those people had lived in the land that reached all the way to Shur and Egypt. They had been there for a long time. "},{"num":9,"verse":"When David would attack an area, he wouldn’t leave a man or woman alive. But he would take their sheep, cattle, donkeys, camels and clothes. Then he would return to Achish."},{"num":10,"verse":"Achish would ask, “Who did you attack today?” David would answer, “The people who live in the Negev Desert of Judah.” Or he would answer, “The people in the Negev Desert of Jerahmeel.” Or he would answer, “The people in the Negev Desert of the Kenites.” "},{"num":11,"verse":"David wouldn’t leave a man or woman alive to be brought back to Gath. He thought, “They might tell on us. They might tell Achish who we really attacked.” That’s what David did as long as he lived in Philistine territory. "},{"num":12,"verse":"Achish trusted David. He thought, “David’s own people, the Israelites, can’t stand him anymore. So he’ll be my servant for life.”"}]