[{"header":"Prophet against prophet"},{"num":28,"verse":"That same year, early in the rule of Judah’s King Zedekiah, in the fifth month of his fourth year, the prophet Hananiah, Azzur’s son from Gibeon, spoke to me in the Lord’s temple before the priests and all the people."},{"num":2,"verse":"He said: “The Lord of heavenly forces, the God of Israel, proclaims: I have broken the yoke of the king of Babylon."},{"num":3,"verse":"In two years I will restore to this place all of the temple equipment that Babylon’s King Nebuchadnezzar carted off to Babylon."},{"num":4,"verse":"I will also restore to this place Judah’s King Jeconiah, Jehoiakim’s son, along with all the exiles from Judah who were deported to Babylon, for I will break the yoke of the king of Babylon, declares the Lord.”"},{"num":5,"verse":"Then the prophet Jeremiah responded to Hananiah in the presence of the priests and all the people who were standing in the Lord’s temple."},{"num":6,"verse":"The prophet Jeremiah said: “Indeed. May the Lord do just as you have said! May the Lord fulfill the words that you have prophesied and bring back from Babylon the equipment of the Lord’s temple and all the exiles to this place."},{"num":7,"verse":"However, listen closely to what I have to say to you and all the people:"},{"num":8,"verse":"The prophets who came before you and me long ago prophesied war, disaster, and disease against many lands and great kingdoms."},{"num":9,"verse":"So the prophet who prophesies peace is recognized as one who is actually sent by the Lord only when that prophet’s message is fulfilled.”"},{"num":10,"verse":"Then the prophet Hananiah took hold of the yoke that was on the prophet Jeremiah’s neck and broke it."},{"num":11,"verse":"He said before all the people, “This is what the Lord says: Just as this yoke has been broken, I will break the yoke of Babylon’s King Nebuchadnezzar from the neck of all the nations within two years.” Then the prophet Jeremiah walked away."},{"num":12,"verse":"Sometime after Hananiah had broken the yoke that was on Jeremiah’s neck, the Lord told him:"},{"num":13,"verse":"Go, say to Hananiah, The Lord proclaims: You have broken a wooden yoke, but I will replace it with an iron one."},{"num":14,"verse":"The Lord of heavenly forces, the God of Israel, proclaims: I will put iron yokes on the necks of all these nations, and they will serve Babylon’s King Nebuchadnezzar; even the wild animals will be subject to him!"},{"num":15,"verse":"Then the prophet Jeremiah said to the prophet Hananiah: “Listen, Hananiah! The Lord hasn’t sent you. All you are doing is persuading these people to believe a lie."},{"num":16,"verse":"Therefore, the Lord proclaims: I’m going to send you somewhere—right off the face of the earth! Before the year ends, you will die since you have incited rebellion against the Lord.”"},{"num":17,"verse":"The prophet Hananiah died in the seventh month of that year."}]