[{"num":11,"verse":"Now Jephthah the Gileadite was a powerful soldier. But he was the son of a woman who sold the use of her body. Jephthah’s father was Gilead. "},{"num":2,"verse":"Gilead’s wife gave birth to his sons. And when his wife’s sons grew up, they drove Jephthah away. They told him, “You will not have any share in our father’s house. For you are the son of another woman.” "},{"num":3,"verse":"So Jephthah ran away from his brothers and lived in the land of Tob. Men of no worth gathered around Jephthah and went fighting and stealing with him."},{"num":4,"verse":"The time came when the men of Ammon fought against Israel. "},{"num":5,"verse":"When the men of Ammon fought against Israel, the leaders of Gilead went to get Jephthah from the land of Tob. "},{"num":6,"verse":"They said to Jephthah, “Come and be our leader, so we may fight against the men of Ammon.” "},{"num":7,"verse":"Jephthah said to the leaders of Gilead, “Did you not hate me and drive me from my father’s house? Why have you come to me now when you are in trouble?” "},{"num":8,"verse":"The leaders of Gilead said to Jephthah, “That is why we have returned to you now. So you may go with us and fight the men of Ammon. You will be the head of all the people of Gilead.” "},{"num":9,"verse":"Jephthah said to the leaders of Gilead, “If you bring me home again to fight the men of Ammon and the Lord gives them to me, will I become your head?” "},{"num":10,"verse":"The leaders of Gilead said to Jephthah, “The Lord is listening to what we say. For sure we will do as you have said.” "},{"num":11,"verse":"So Jephthah went with the leaders of Gilead. And the people made him head and leader over them. Jephthah spoke all his words before the Lord at Mizpah."},{"num":12,"verse":"Then Jephthah sent men to the king of the people of Ammon, saying, “What do you have against me? Why have you come to fight against my land?” "},{"num":13,"verse":"The king of the people of Ammon said to these men of Jephthah, “Because Israel took away my land when they came from Egypt. They took my land from the Arnon as far as the Jabbok and the Jordan. So I ask you to return this land to me in peace.” "},{"num":14,"verse":"But Jephthah sent men to the king of the people of Ammon again, "},{"num":15,"verse":"saying, “Jephthah says, ‘Israel did not take away the land of Moab or the land of the people of Ammon. "},{"num":16,"verse":"Israel came out of Egypt, went through the desert to the Red Sea, and came to Kadesh. "},{"num":17,"verse":"Then Israel sent men to the king of Edom, saying, “We ask you to let us pass through your land.” But the king of Edom would not listen. They asked the king of Moab also. But he would not let them pass through. So Israel stayed at Kadesh. "},{"num":18,"verse":"’Then Israel went through the desert and around the lands of Edom and Moab. They came to the east side of the land of Moab. There they set up their tents on the other side of the Arnon. But they did not go into the land of Moab. For the Arnon flowed along the side of Moab. "},{"num":19,"verse":"Israel sent men to Sihon king of the Amorites, the king of Heshbon, saying, “We ask you to let us pass through your land to our place.” "},{"num":20,"verse":"But Sihon did not trust Israel. He would not let them pass through his land. Sihon gathered all his people together. They set up their tents in Jahaz, and fought with Israel. "},{"num":21,"verse":"The Lord, the God of Israel, gave Sihon and all his people into the hand of Israel. They won the war against Sihon. So Israel took all the land of the Amorites, the people of that country. "},{"num":22,"verse":"They took all the land of the Amorites, from the Arnon as far as the Jabbok, and from the desert as far as the Jordan."},{"num":23,"verse":"’So the Lord, the God of Israel, drove the Amorites away from His people Israel. Now are you to take the land for your own? "},{"num":24,"verse":"Do you not keep for your own what your god Chemosh gives you? We will keep the land of the people the Lord our God drove away for us. "},{"num":25,"verse":"Are you any better than Balak the son of Zippor, king of Moab? Did he ever fight with Israel? Did he ever go to war against them? "},{"num":26,"verse":"While Israel lived in Heshbon and its towns and Aroer and its towns and in all the cities beside the Arnon for 300 years, why did you not take them again during that time? "},{"num":27,"verse":"I have not sinned against you. But you are doing wrong to me by making war against me. The Lord is the judge. May He decide today between the people of Israel and the people of Ammon.’” "},{"num":28,"verse":"But the king of the people of Ammon would not listen to what Jephthah said"},{"num":29,"verse":"The Spirit of the Lord came upon Jephthah. So he passed through Gilead and Manasseh and through Mizpah of Gilead. He went from Mizpah of Gilead to the people of Ammon. "},{"num":30,"verse":"Jephthah made a promise to the Lord and said, “You give the people of Ammon into my hand. "},{"num":31,"verse":"And I will give to the Lord whatever comes out of the doors of my house to meet me when I return in peace from the people of Ammon. I will give it to the Lord as a burnt gift.” "},{"num":32,"verse":"Then Jephthah crossed over to fight against the people of Ammon. And the Lord gave them into his hand. "},{"num":33,"verse":"He killed many of them from Aroer to Minnith, through twenty cities, as far as Abelkeramin. The people of Ammon were destroyed in front of the people of Israel."},{"header":"Jephthah’s Daughter"},{"num":34,"verse":"Then Jephthah came to his home at Mizpah. His daughter came out to meet him with music and dancing. She was his one and only child. He had no other sons or daughters. "},{"num":35,"verse":"When he saw her, he tore his clothes and said, “It is bad, my daughter! You have made me very sad. You have brought much trouble to me. For I have made a promise to the Lord, and I must keep it.” "},{"num":36,"verse":"She said to him, “My father, you have made a promise to the Lord. Do to me what you have promised you would do. Because the Lord has punished the people of Ammon, who fought against you. "},{"num":37,"verse":"But do this for me. Let me alone for two months. So I and my friends may go to the mountains and cry because I will never have a man.” "},{"num":38,"verse":"Jephthah said, “Go.” He sent her away for two months with her friends. And they cried on the mountains because she would never have a man. "},{"num":39,"verse":"She returned to her father after two months. And he did what he promised the Lord and she died without having a man. So it became the way in Israel "},{"num":40,"verse":"that the daughters of Israel went to have sorrow for the daughter of Jephthah for four days each year."}]