[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE NINTH PLAGUE.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(21-23) The ninth plague, like the third and sixth, was sent without any previous warning. It consisted in a “thick darkness,” which may have been brought about by means of the Khamsin, or “Wind of the Desert,” which frequently blows about the time of the vernal equinox, and brings with it such clouds of a fine impalpable sand that the light of the sun is obscured, and an effect produced which some travellers have compared to “the most gloomy night.” Or it may have been a shutting out of the sun’s rays by dense fog and cloud of a more ordinary character; though in that case there must have been something in the visitation very much exceeding any known instance of such darkness. “They saw not one another,” we are told, “for three days” (Exodus 10:23). The darkness was one which “might be felt” (Exodus 10:21). Such a preternatural continuance of absolutely impenetrable “blackness of darkness” would cause to any man a feeling of intense alarm and horror. To the Egyptians it would be peculiarly painful and terrible. Ra, the sun-god, was among the principal objects of their worship, especially in the Delta, where Heliopolis and Pithoni were cities dedicated to him. Darkness was a creation of Set—the Evil Principle, the destroyer of Osiris—and of Apophis, the Great Serpent, the impeder of souls in the lower world. It would have seemed to the Egyptians that Ra was dead, that Set had triumphed over his brother, that Apophis had encircled the world with his dark folds, and plunged it in eternal night. Hence Pharaoh’s early call for Moses, and permission that the people should depart, with their families (Exodus 10:24): a concession which, however, was marred by the proviso, “Only let your flocks and herds be stayed.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(21-23) The ninth plague, like the third and sixth, was sent without any previous warning. It consisted in a “thick darkness,” which may have been brought about by means of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Khamsin,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or “Wind of the Desert,” which frequently blows about the time of the vernal equinox, and brings with it such clouds of a fine impalpable sand that the light of the sun is obscured, and an effect produced which some travellers have compared to “the most gloomy night.” Or it may have been a shutting out of the sun’s rays by dense fog and cloud of a more ordinary character; though in that case there must have been something in the visitation very much exceeding any known instance of such darkness. “They saw not one another,” we are told, “for three days” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The darkness was one which “might be felt” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Such a preternatural continuance of absolutely impenetrable “blackness of darkness” would cause to any man a feeling of intense alarm and horror. To the Egyptians it would be peculiarly painful and terrible. Ra, the sun-god, was among the principal objects of their worship, especially in the Delta, where Heliopolis and Pithoni were cities dedicated to him. Darkness was a creation of Set—the Evil Principle, the destroyer of Osiris—and of Apophis, the Great Serpent, the impeder of souls in the lower world. It would have seemed to the Egyptians that Ra was dead, that Set had triumphed over his brother, that Apophis had encircled the world with his dark folds, and plunged it in eternal night. Hence Pharaoh’s early call for Moses, and permission that the people should depart, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "with their families",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): a concession which, however, was marred by the proviso, “Only let your flocks and herds be stayed.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(21) Darkness which may be felt.—Heb., one shall grasp darkness. The Authorised Version seems to give the true meaning, which is found also in the LXX. and the Vulg. The idea is an exaggeration of that instinctive feeling which makes us speak of “thick darkness.” The general voice of mankind confirms the use of the phrase.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(21) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Darkness which may be felt.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "one shall grasp darkness.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The Authorised Version seems to give the true meaning, which is found also in the LXX. and the Vulg. The idea is an exaggeration of that instinctive feeling which makes us speak of “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "thick",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " darkness.” The general voice of mankind confirms the use of the phrase.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 10:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". We may observe concerning this plague, 1st, That it was a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "total ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "darkness. We have reason to think, not only that the lights of heaven were clouded, but that all their fires and candles were put out by the damps or clammy vapours which were the cause of this darkness, for it is said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they saw not one another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2d, That it was darkness which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "might be felt; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "felt in its causes by their finger-ends, so thick were the fogs; felt in its effects, (some think,) by their eyes, which were pricked with pain, and made the more ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sore ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "by their rubbing them. Great ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pain ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is spoken of as the effect of that darkness, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which alludes to this. 3d, No doubt it was very frightful and amazing. The tradition of the Jews is, that in this darkness they were terrified by the apparition of evil spirits, or rather by dreadful sounds and murmurs which they made; and this is the plague which some think is intended, (for otherwise it is not mentioned at all here,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “He poured upon them the fierceness of his anger, by sending evil angels among them;” for to those to whom the devil has been a deceiver, he will at length be a terror. 4th, It continued ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "three days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "six nights in one; so long they were imprisoned by those ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chains of darkness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:21-29 The plague of darkness brought upon Egypt was a dreadful plague. It was darkness which might be felt, so thick were the fogs. It astonished and terrified. It continued three days; six nights in one; so long the most lightsome palaces were dungeons. Now Pharaoh had time to consider, if he would have improved it. Spiritual darkness is spiritual bondage; while Satan blinds men's eyes that they see not, he binds their hands and feet, that they work not for God, nor move toward heaven. They sit in darkness. It was righteous with God thus to punish. The blindness of their minds brought upon them this darkness of the air; never was mind so blinded as Pharaoh's, never was air so darkened as Egypt. Let us dread the consequences of sin; if three days of darkness were so dreadful, what will everlasting darkness be? The children of Israel, at the same time, had light in their dwellings. We must not think we share in common mercies as a matter of course, and therefore that we owe no thanks to God for them. It shows the particular favour he bears to his people. Wherever there is an Israelite indeed, though in this dark world, there is light, there is a child of light. When God made this difference between the Israelites and the Egyptians, who would not have preferred the poor cottage of an Israelite to the fine palace of an Egyptian? There is a real difference between the house of the wicked, which is under a curse, and the habitation of the just, which is blessed. Pharaoh renewed the treaty with Moses and Aaron, and consented they should take their little ones, but would have their cattle left. It is common for sinners to bargain with God Almighty; thus they try to mock him, but they deceive themselves. The terms of reconciliation with God are so fixed, that though men dispute them ever so long, they cannot possibly alter them, or bring them lower. We must come to the demand of God's will; we cannot expect he should condescend to the terms our lusts would make. With ourselves and our children, we must devote all our worldly possessions to the service of God; we know not what use he will make of any part of what we have. Pharaoh broke off the conference abruptly, and resolved to treat no more. Had he forgotten how often he had sent for Moses to ease him of his plagues? and must he now be bid to come no more? Vain malice! to threaten him with death, who was armed with such power! What will not hardness of heart, and contempt of God's word and commandments, bring men to! After this, Moses came no more till he was sent for. When men drive God's word from them, he justly gives them up to their own delusions.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Darkness - This infliction was specially calculated to affect the spirits of the Egyptians, whose chief object of worship was the Sun-god; and its suddenness and severity in connection with the act of Moses mark it as a preternatural withdrawal of light. Yet, it has an analogy in physical phenomena. After the vernal equinox the southwest wind from the desert blows some 50 days, not however, continuously but at intervals, lasting generally some two or three days. It fills the atmosphere with dense masses of fine sand, bringing on a darkness far deeper than that of our worst fogs in winter. The consternation of Pharaoh proves that, familiar as he may have been with the phenomenon, no previous occurrence had prepared him for its intensity and duration, and that he recognized it as a supernatural visitation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ex 10:21-29. Plague of Darkness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21-23. Stretch out thine hand toward heaven, that there may be darkness—Whatever secondary means were employed in producing it, whether thick clammy fogs and vapors, according to some; a sandstorm, or the chamsin, according to others; it was such that it could be almost perceived by the organs of touch, and so protracted as to continue for three days, which the chamsin does [Hengstenberg]. The appalling character of this calamity consisted in this, that the sun was an object of Egyptian idolatry; that the pure and serene sky of that country was never marred by the appearance of a cloud. And here, too, the Lord made a marked difference between Goshen and the rest of Egypt.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is an hyperbolical expression, such being very frequent both in Scripture and in all authors. For darkness being only a privation, cannot be properly felt, yet it might be felt in its cause, to wit, those thick and gross vapours which filled and infected the air. But the place may be rendered thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that there may be darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vau",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is sometimes used, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Micah 7:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") the darkness (i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the night, or the common and daily ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "darkness) is departed or removed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the time of the day come; for so the root from whence this word may be derived signifies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 13:22",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And to this purpose the words are rendered by the Chaldee and Syriac, and some others; and the sense is, that the darkness may continue in the day-time as well as in the night. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord said unto Moses,.... About the eleventh day of the month Abib: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "stretch out thine hand toward heaven; where the luminaries are, and from whence light comes: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that there may be darkness over the land of Egypt, even darkness which may be felt; that is, what caused it, the gross vapours and thick fogs; for otherwise darkness itself, being a privation of light, cannot be felt: Onkelos paraphrases it,\"after that the darkness of the night is removed;''so Jonathan; that it might appear to be different from that, and be much grosser. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that there may be darkness over the land of Egypt, even darkness which may be felt; that is, what caused it, the gross vapours and thick fogs; for otherwise darkness itself, being a privation of light, cannot be felt: Onkelos paraphrases it,\"after that the darkness of the night is removed;''so Jonathan; that it might appear to be different from that, and be much grosser. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD said unto Moses, Stretch out thine hand toward heaven, that there may be darkness over the land of Egypt, even darkness which may be {h} felt.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD said unto Moses, Stretch out thine hand toward heaven, that there may be darkness over the land of Egypt, even darkness ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "which",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may be ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " felt.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Because it was so thick.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stretch out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] addressed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Exo ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (both E).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even darkness which may be felt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so that one may feel darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ψηλαφητὸν σκότος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tam densae ut palpari queant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The marg. ‘feel (or grope) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " darkness’ is not favoured by the Heb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "21–27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ninth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " plague. The darkness. From E and J.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 21-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE NINTH PLAGUE. The ninth plague, like the third and the sixth, was inflicted without special warning. God had announced, after the plague of boils, that he was about to \"send all his plagues upon the heart\" of the king; and so a succession of inflictions was to be expected. The ninth plague probably followed the eighth after a very short interval. It is rightly regarded as an aggravation of a well-known natural phenomenon - the Khamsin, or \"Wind of the Desert\" which commonly visits Egypt about the time of the vernal equinox, and is accompanied by an awful and weird darkness. This is caused by the dense clouds of fine sand which the wind brings with it, which intercept the sun's light, and produce a darkness beyond that of our worst fogs, and compared by some travellers to \"the most gloomy night.\" The wind is depressing and annoying to an extreme degree. \"While it lasts no man rises from his place; men and beasts hide themselves; the inhabitants of towns and villages shut themselves up in their houses, in underground apartments, or vaults.\" It usually blows for a space of two, or at most three, days, and sometimes with great violence, though more often with only moderate force. The visitation here recorded was peculiar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In its extent, covering as it did \"all the land d Egypt;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In its intensity - \"they saw not one another\" (ver. 23) - \"darkness which may be felt\" (ver. 21); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In its circumscription, extending, as it did, to all Egypt except only the land of Goshen (ver. 23). These circumstances made Pharaoh at once recognise its heaven-sent character, and request its removal of Moses, whom he sought to persuade by conceding the departure of the Israelites with their families. He marred, however, the whole grace of this concession by a proviso that they should leave behind them their flocks and herds, viewing these as, equally with their families, a security for their return. Moses therefore indignantly rejected his offer - the flocks and the herds should go with them - he would not have a hoof left behind - they did not know what sacrifices would be required at the feast which they were about to keep, or how many (ver. 25, 26) - therefore they must take all. Pharaoh, greatly angered, forthwith broke up the conference (ver. 28), but not, as it would seem, before Moses, equally displeased, had announced the tenth plague, and the results which would follow it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 11:4-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Darkness which may be felt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Literally, \"and one shall feel, or grasp, darkness.\"  The hyperbole is no doubt extreme; but the general sentiment of mankind has approved the phrase, which exactly expresses what men feel in absolute and complete darkness. Kalisch renders, \"a darkness in which men grope.\" But the grammatical construction does not allow of this. Exodus 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ninth plague: The Darkness. - As Pharaoh's defiant spirit was not broken yet, a continuous darkness came over all the land of Egypt, with the exception of Goshen, without any previous announcement, and came in such force that the darkness could be felt. חשׁך וימשׁ: \"and one shall feel, grasp darkness.\" המשׁ: as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 16:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ψηλαφητὸν σκότος (lxx); not \"feel in the dark,\" for משׁשׁ has this meaning only in the Piel with בּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). אפלה חשׁך: darkness of obscurity, i.e., the deepest darkness. The combination of two words or synonyms gives the greatest intensity to the thought. The darkness was so great that they could not see one another, and no one rose up from his place. The Israelites alone \"had light in their dwelling-places.\" The reference here is not to the houses; so that we must not infer that the Egyptians were unable to kindle any lights even in their houses. The cause of this darkness is not given in the text; but the analogy of the other plagues, which had all of them a natural basis, warrants us in assuming, as most commentators have done, that there was the same here - that it was in fact the Chamsin, to which the lxx evidently allude in their rendering: σκότος καὶ γνόφος καὶ θύελλα. This wind, which generally blows in Egypt before and after the vernal equinox and lasts two or three days, usually rises very suddenly, and fills the air with such a quantity of fine dust and coarse sand, that the sun loses its brightness, the sky is covered with a dense veil, and it becomes so dark that \"the obscurity cause by the thickest fog in our autumn and winter days is nothing in comparison\" (Schubert). Both men and animals hide themselves from this storm; and the inhabitants of the towns and villages shut themselves up in the innermost rooms and cellars of their houses till it is over, for the dust penetrates even through well-closed windows. For fuller accounts taken from travels, see Hengstenberg (pp. 120ff.) and Robinson's Palestine i. pp. 287-289. Seetzen attributes the rising of the dust to a quantity of electrical fluid contained in the air. - The fact that in this case the darkness alone is mentioned, may have arisen from its symbolical importance. \"The darkness which covered the Egyptians, and the light which shone upon the Israelites, were types of the wrath and grace of God\" (Hengstenberg). This occurrence, in which, according to Arabian chroniclers of the middle ages, the nations discerned a foreboding of the day of judgment or of the resurrection, filled the king with such alarm that he sent for Moses, and told him he would let the people and their children go, but the cattle must be left behind. יצּג: sistatur, let it be placed, deposited in certain places under the guard of Egyptians, as a pledge of your return. Maneat in pignus, quod reversuri sitis, as Chaskuni correctly paraphrases it. But Moses insisted upon the cattle being taken for the sake of their sacrifices and burnt-offerings. \"Not a hoof shall be left behind.\" This was a proverbial expression for \"not the smallest fraction.\" Bochart gives instances of a similar introduction of the \"hoof\" into proverbial sayings by both Arabians and Romans (Hieroz. i. p. 490). This firmness on the part of Moses he defended by saying, \"We know not with what we shall serve the Lord, till we come thither;\" i.e., we know not yet what kind of animals or how many we shall require for the sacrifices; our God will not make this known to us till we arrive at the place of sacrifice. עבד with a double accusative as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to serve any one with a thing. ",
        "children": []
      }
    ]
  }
]