[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:21-29 The plague of darkness brought upon Egypt was a dreadful plague. It was darkness which might be felt, so thick were the fogs. It astonished and terrified. It continued three days; six nights in one; so long the most lightsome palaces were dungeons. Now Pharaoh had time to consider, if he would have improved it. Spiritual darkness is spiritual bondage; while Satan blinds men's eyes that they see not, he binds their hands and feet, that they work not for God, nor move toward heaven. They sit in darkness. It was righteous with God thus to punish. The blindness of their minds brought upon them this darkness of the air; never was mind so blinded as Pharaoh's, never was air so darkened as Egypt. Let us dread the consequences of sin; if three days of darkness were so dreadful, what will everlasting darkness be? The children of Israel, at the same time, had light in their dwellings. We must not think we share in common mercies as a matter of course, and therefore that we owe no thanks to God for them. It shows the particular favour he bears to his people. Wherever there is an Israelite indeed, though in this dark world, there is light, there is a child of light. When God made this difference between the Israelites and the Egyptians, who would not have preferred the poor cottage of an Israelite to the fine palace of an Egyptian? There is a real difference between the house of the wicked, which is under a curse, and the habitation of the just, which is blessed. Pharaoh renewed the treaty with Moses and Aaron, and consented they should take their little ones, but would have their cattle left. It is common for sinners to bargain with God Almighty; thus they try to mock him, but they deceive themselves. The terms of reconciliation with God are so fixed, that though men dispute them ever so long, they cannot possibly alter them, or bring them lower. We must come to the demand of God's will; we cannot expect he should condescend to the terms our lusts would make. With ourselves and our children, we must devote all our worldly possessions to the service of God; we know not what use he will make of any part of what we have. Pharaoh broke off the conference abruptly, and resolved to treat no more. Had he forgotten how often he had sent for Moses to ease him of his plagues? and must he now be bid to come no more? Vain malice! to threaten him with death, who was armed with such power! What will not hardness of heart, and contempt of God's word and commandments, bring men to! After this, Moses came no more till he was sent for. When men drive God's word from them, he justly gives them up to their own delusions.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Your flocks and your herds - Pharaoh still exacts what would of course be a complete security for their return: but the demand was wholly incompatible with the object assigned for the journey into the wilderness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24-26. Pharaoh called unto Moses, and said, Go ye, serve the Lord—Terrified by the preternatural darkness, the stubborn king relents, and proposes another compromise—the flocks and herds to be left as hostages for their return. But the crisis is approaching, and Moses insists on every iota of his demand. The cattle would be needed for sacrifice—how many or how few could not be known till their arrival at the scene of religious observance. But the emancipation of Israel from Egyptian bondage was to be complete.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou must give us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. suffer us to take of our own stock ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses said, thou must give us also sacrifices and burnt offerings,.... Sheep, rams, and goats for sacrifices, and oxen for burnt offerings; and that of his own, as Jarchi interprets it; but rather the meaning is, that besides having their little ones with them, they must be allowed also to take their cattle for sacrifices and burnt offerings: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that we may sacrifice unto the Lord our God; might have wherewith to offer up in sacrifice to him as he shall require. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that we may sacrifice unto the Lord our God; might have wherewith to offer up in sacrifice to him as he shall require. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Moses said, Thou must give us also sacrifices and burnt offerings, that we may sacrifice unto the LORD our God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou also",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The pron. is emphatic. Pharaoh, besides letting the Israelites’ cattle go, must also himself contribute to the sacrifices which will be offered. By ‘sacrifices’ (lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slaughterings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are meant the most common kind of sacrifice, called elsewhere for distinction ‘peace-offerings’ (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): they are often, esp. in the historical books, mentioned together with burnt-offerings (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ibid.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "do",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—used in a sacrificial sense, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ῥέζειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "facere",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the Ass. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "epêshu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently (the instances in the OT. have been collected by the writer in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "DB.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " s.v. Offer, Offering, No. 7, iii. 588b).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 25, 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Moses absolutely refuses the suggested compromise. He had already declared on a former occasion, \"With our young and with our old we will go; with our sons and with our daughters, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "with our flocks and with our herds",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we will go\" (ver. 9). He is not inclined to retract now, after two additional plagues, what he had demanded before them. He does not refuse, however, to set forth his reasons. The cattle must go because the feast which they are about to keep requires sacrifices- they must ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " go, because the Israelites do not as yet know what animals, or how many of each, will be required of them. The feast was a new thing, without precedent; its ritual was not yet laid down. No exact directions were to be expected, until the place was reached where God intended that it should be celebrated. Exodus 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ninth plague: The Darkness. - As Pharaoh's defiant spirit was not broken yet, a continuous darkness came over all the land of Egypt, with the exception of Goshen, without any previous announcement, and came in such force that the darkness could be felt. חשׁך וימשׁ: \"and one shall feel, grasp darkness.\" המשׁ: as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 16:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ψηλαφητὸν σκότος (lxx); not \"feel in the dark,\" for משׁשׁ has this meaning only in the Piel with בּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). אפלה חשׁך: darkness of obscurity, i.e., the deepest darkness. The combination of two words or synonyms gives the greatest intensity to the thought. The darkness was so great that they could not see one another, and no one rose up from his place. The Israelites alone \"had light in their dwelling-places.\" The reference here is not to the houses; so that we must not infer that the Egyptians were unable to kindle any lights even in their houses. The cause of this darkness is not given in the text; but the analogy of the other plagues, which had all of them a natural basis, warrants us in assuming, as most commentators have done, that there was the same here - that it was in fact the Chamsin, to which the lxx evidently allude in their rendering: σκότος καὶ γνόφος καὶ θύελλα. This wind, which generally blows in Egypt before and after the vernal equinox and lasts two or three days, usually rises very suddenly, and fills the air with such a quantity of fine dust and coarse sand, that the sun loses its brightness, the sky is covered with a dense veil, and it becomes so dark that \"the obscurity cause by the thickest fog in our autumn and winter days is nothing in comparison\" (Schubert). Both men and animals hide themselves from this storm; and the inhabitants of the towns and villages shut themselves up in the innermost rooms and cellars of their houses till it is over, for the dust penetrates even through well-closed windows. For fuller accounts taken from travels, see Hengstenberg (pp. 120ff.) and Robinson's Palestine i. pp. 287-289. Seetzen attributes the rising of the dust to a quantity of electrical fluid contained in the air. - The fact that in this case the darkness alone is mentioned, may have arisen from its symbolical importance. \"The darkness which covered the Egyptians, and the light which shone upon the Israelites, were types of the wrath and grace of God\" (Hengstenberg). This occurrence, in which, according to Arabian chroniclers of the middle ages, the nations discerned a foreboding of the day of judgment or of the resurrection, filled the king with such alarm that he sent for Moses, and told him he would let the people and their children go, but the cattle must be left behind. יצּג: sistatur, let it be placed, deposited in certain places under the guard of Egyptians, as a pledge of your return. Maneat in pignus, quod reversuri sitis, as Chaskuni correctly paraphrases it. But Moses insisted upon the cattle being taken for the sake of their sacrifices and burnt-offerings. \"Not a hoof shall be left behind.\" This was a proverbial expression for \"not the smallest fraction.\" Bochart gives instances of a similar introduction of the \"hoof\" into proverbial sayings by both Arabians and Romans (Hieroz. i. p. 490). This firmness on the part of Moses he defended by saying, \"We know not with what we shall serve the Lord, till we come thither;\" i.e., we know not yet what kind of animals or how many we shall require for the sacrifices; our God will not make this known to us till we arrive at the place of sacrifice. עבד with a double accusative as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to serve any one with a thing. ",
        "children": []
      }
    ]
  }
]