[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 11:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When it goeth well with the righteous ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— When righteous men are encouraged and advanced to places of trust and power; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the city rejoiceth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The citizens, or subjects, of that government, rejoice, because they confidently expect justice and tranquillity, and many other benefits, by their administration of public affairs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When the wicked perish, there is shouting — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A common rejoicing, partly for the just vengeance of God upon them, who had been the instruments of so much mischief; and partly for the deliverance of the people from such public grievances and burdens as had been imposed upon them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1 However men may make light of giving short weight or measure, and however common such crimes may be, they are an abomination to the Lord. 2. Considering how safe, and quiet, and easy the humble are, we see that with the lowly is wisdom. 3. An honest man's principles are fixed, therefore his way is plain. 4. Riches will stand men in no stead in the day of death. 5,6. The ways of wickedness are dangerous. And sin will be its own punishment. 7. When a godly man dies, all his fears vanish; but when a wicked man dies, his hopes vanish. 8. The righteous are often wonderfully kept from going into dangerous situations, and the ungodly go in their stead. 9. Hypocrites delude men into error and sin by artful objections against the truths of God's word. 10,11. Nations prosper when wicked men are cast down. 12. A man of understanding does not judge of others by their success. 13. A faithful man will not disclose what he is trusted with, unless the honour of God and the real good of society require it. 14. We shall often find it to our advantage to advise with others. 15. The welfare of our families, our own peace, and our ability to pay just debts, must not be brought into danger. But here especially let us consider the grace of our Lord Jesus Christ in becoming Surety even for enemies. 16. A pious and discreet woman will keep esteem and respect, as strong men keep possession of wealth. 17. A cruel, froward, ill-natured man, is vexatious to those that are, and should be to him as his own flesh, and punishes himself. 18. He that makes it his business to do good, shall have a reward, as sure to him as eternal truth can make it. 19. True holiness is true happiness. The more violent a man is in sinful pursuits, the more he hastens his own destruction. 20. Nothing is more hateful to God, than hypocrisy and double dealing, which are here signified. God delights in such as aim and act with uprightness. 21. Joining together in sin shall not protect the sinners. 22. Beauty is abused by those who have not discretion or modesty with it. This is true of all bodily endowments. 23. The wicked desire mischief to others, but it shall return upon themselves. 24. A man may grow poor by not paying just debts, not relieving the poor, not allowing needful expenses. Let men be ever so saving of what they have, if God appoints, it comes to nothing. 25. Both in temporal and spiritual things, God commonly deals with his people according to the measure by which they deal with their brethren. 26. We must not hoard up the gifts of God's bounty, merely for our own advantage. 27. Seeking mischief is here set against seeking good; for those that are not doing good are doing hurt, even to themselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Through knowledge - Better, By the knowledge of the just, shall they (i. e., the neighbors) be delivered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10, 11. The last may be a reason for the first. Together, they set forth the relative moral worth of good and bad men.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When it goeth well with the righteous, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when such men are encouraged and advanced into places of power and trust, the city rejoiceth; the citizens or subjects of that government rejoice, because they confidently expect justice and tranquillity, and many other benefits, by their administration of public affairs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is shouting; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a common rejoicing, partly for the just vengeance of God upon them who have been the instruments of so much mischief; and partly for their deliverance from such public grievances and burdens of the land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When it goeth well with the righteous, the city rejoiceth,.... As it always does, even in the worst of times; in times of public calamity and distress, and when enemies rise up on all hands; it is well with them in life, in death, and to all eternity; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but there are particular times when it goes well with them, which is matter of joy to others; when they prosper in the worm, increase in riches and honour, and are advanced to places of authority and trust; just magistrates in a city or commonwealth are a blessing, and so cause joy; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and when it goes well with them in spiritual things, they increase in gifts and grace, the humble hear of it and are glad; the city or church of God, the community of the saints, rejoice: and as it went well with them in Constantine's time, when Paganism was destroyed and persecution ceased; and at the time of the reformation, when the pure doctrines of the Gospel were revived, which were both times of joy to the city of God; so in the latter day, when the Lord's people will be righteous, the church will be the joy of many generations; and when the kingdom shall be given to the saints of the most High, and the kingdoms of the world become the Lord's and his Christ's, there will be great voices in heaven, rejoicings in the church, and a new song sung, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when the wicked perish, there is shouting; as there will be great rejoicings, shoutings, and hallelujahs, when Babylon is fallen, Revelation 18:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and when the wicked perish, there is shouting; as there will be great rejoicings, shoutings, and hallelujahs, when Babylon is fallen, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When the righteous prosper, the city {e} rejoiceth: and when the wicked perish, there is shouting.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When the righteous prosper, the city ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rejoiceth: and when the wicked perish, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shouting.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) The country is blessed, where there are godly men, and they ought to rejoice when the wicked are taken away.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The city;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " any city. Ewald would argue that such language could not be used of the capital of the Jews till the times of Asa or Jehoshaphat. But what is to prevent the sentence being taken generally of any city or community? The Vatican manuscript of the Septuagint and some others give here only the first clause, \"In the prosperity of the righteous the city succeeds,\" adding from ver. 11, \"but by the mouths of the wicked it is overthrown\" (see on ver. 4; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 58:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Proverbs 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Three proverbs follow relating to the nature of city and national life, and between them two against mockery and backbiting:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 In the prosperity of the righteous the city rejoiceth;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And if the wicked come to ruin, there is jubilation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The בּ of בּטוּב denotes the ground but not the object, as elsewhere, but the cause of the rejoicing, like the ב 10b, and in the similar proverb, Proverbs 29:2, cf. Proverbs 28:12. If it goes well with the righteous, the city has cause for joy, because it is for the advantage of the community; and if the wicked (godless) come to an end, then there is jubilation (substantival clause for תּרן), for although they are honoured in their lifetime, yet men breathe freer when the city is delivered from the tyranny and oppression which they exercised, and from the evil example which they gave. Such proverbs, in which the city (civitas) represents the state, the πόλις the πολιτεία, may, as Ewald thinks, be of earlier date than the days of an Asa or Jehoshaphat; for \"from the days of Moses and Joshua to the days of David and Solomon, Israel was a great nation, divided indeed into many branches and sections, but bound together by covenant, whose life did not at all revolve around one great city alone.\" We value such critical judgments according to great historical points of view, but confess not to understand why קריה must just be the chief city and may not be any city, and how on the whole a language which had not as yet framed the conception of the state (post-bibl. מדינה), when it would described the community individually and as a whole, could speak otherwise than of city and people. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The בּ of בּטוּב denotes the ground but not the object, as elsewhere, but the cause of the rejoicing, like the ב 10b, and in the similar proverb, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 29:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 28:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". If it goes well with the righteous, the city has cause for joy, because it is for the advantage of the community; and if the wicked (godless) come to an end, then there is jubilation (substantival clause for תּרן), for although they are honoured in their lifetime, yet men breathe freer when the city is delivered from the tyranny and oppression which they exercised, and from the evil example which they gave. Such proverbs, in which the city (civitas) represents the state, the πόλις the πολιτεία, may, as Ewald thinks, be of earlier date than the days of an Asa or Jehoshaphat; for \"from the days of Moses and Joshua to the days of David and Solomon, Israel was a great nation, divided indeed into many branches and sections, but bound together by covenant, whose life did not at all revolve around one great city alone.\" We value such critical judgments according to great historical points of view, but confess not to understand why קריה must just be the chief city and may not be any city, and how on the whole a language which had not as yet framed the conception of the state (post-bibl. מדינה), when it would described the community individually and as a whole, could speak otherwise than of city and people. ",
            "children": []
          }
        ]
      }
    ]
  }
]