[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:1-14 The same easiness of temper, which betrays some godly persons into friendship with the declared enemies of religion, renders it very dangerous to them. They will be drawn to wink at and countenance such conduct and conversation as they ought to protest against with abhorrence. Whithersoever a good man goes, he ought to take his religion with him, and not be ashamed to own it when he is with those who have no regard for it. Jehoshaphat had not left behind him, at Jerusalem, his affection and reverence for the word of the Lord, but avowed it, and endeavoured to bring it into Ahab's court. And Ahab's prophets, to please Jehoshaphat, made use of the name of Jehovah: to please Ahab, they said, Go up. But the false prophets cannot so mimic the true, but that he who has spiritual senses exercised, can discern the fallacy. One faithful prophet of the Lord was worth them all. Wordly men have in all ages been alike absurd in their views of religion. They would have the preacher fit his doctrine to the fashion of the times, and the taste of the hearers, and yet to add. Thus saith the Lord, to words that men would put into their mouths. They are ready to cry out against a man as rude and foolish, who scruples thus to try to secure his own interests, and to deceive others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Micaiah, as a true prophet of Yahweh, of course rejected the counsel offered him, which he felt to be at once wicked and foolish. Compare also the resolution of Balaam, marginal reference. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14-17. what the Lord saith unto me, that will I speak—On the way the messenger who conducted [Micaiah] to the royal presence informed him of the tenor of the prophecies already given and recommended him to agree with the rest, no doubt from the kindly motive of seeing him released from imprisonment. But Micaiah, inflexibly faithful to his divine mission as a prophet, announced his purpose to proclaim honestly whatever God should bid him. On being asked by the king, \"Shall I go against Ramoth-gilead, or shall I forbear?\" the prophet gave precisely the same answer as the previous oracles that had been consulted; but it must have been given in a sarcastic tone and in ironical mockery of their way of speaking. Being solemnly urged to give a serious and truthful answer, Micaiah then declared the visionary scene the Spirit had revealed to him;—",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " What answer God shall put into my mind and mouth; which, it seems, was not yet done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Micaiah said, as the Lord liveth,.... He swore by the living God, for the confirmation of what he was about to say: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what the Lord saith unto me, that will I speak; truly and faithfully, keeping nothing back, nor adding anything, whether it be good or evil, pleasing or displeasing; it looks as if as yet he had no instruction from the Lord what to say, and yet the vision he later declares seems to have been had by him before, 1 Kings 22:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "what the Lord saith unto me, that will I speak; truly and faithfully, keeping nothing back, nor adding anything, whether it be good or evil, pleasing or displeasing; it looks as if as yet he had no instruction from the Lord what to say, and yet the vision he later declares seems to have been had by him before, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Micaiah said, As the LORD liveth, what the LORD saith unto me, that will I speak.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what the Lord saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is ‘what my God saith.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Micaiah said, As the Lord liveth, what the Lord saith unto me, that will I speak.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [We are forcibly reminded of the answer of Balaam, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:18, 38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And we may see not only in the suggestion of this messenger, but also in Ahab's belief (ver. 8), that Micaiah could prophesy at pleasure, a striking correspondence with the ideas of Balak (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ib",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 5:6, 17). Instead of regarding the prophet as being merely the mouthpiece of Deity, he was believed in that age to have a supernatural influence with God, and to be entrusted with magical powers to shape the future, as well as to foretell it.] 1 Kings 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The messenger who fetched Micah tried on the way to persuade him to prophesy success to the king as the other prophets had done; but Micah replied with a solemn oath, that he would only speak what Jehovah said to him.",
        "children": []
      }
    ]
  }
]