[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:15-28 The greatest kindness we can do to one that is going in a dangerous way, is, to tell him of his danger. To leave the hardened criminal without excuse, and to give a useful lesson to others, Micaiah related his vision. This matter is represented after the manner of men: we are not to imagine that God is ever put upon new counsels; or that he needs to consult with angels, or any creature, about the methods he should take; or that he is the author of sin, or the cause of any man's telling or believing a lie. Micaiah returned not the blow of Zedekiah, yet, since he boasted of the Spirit, as those commonly do that know least of the Holy Spirit's operations, the true prophet left him to be convinced of his error by the event. Those that will not have their mistakes set right in time, by the word of God, will be undeceived, when it is too late, by the judgments of God. We should be ashamed of what we call trials, were we to consider what the servants of God have endured. Yet it will be well, if freedom from trouble prove not more hurtful to us; we are more easily allured and bribed into unfaithfulness and conformity to the world, than driven to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he answered him ... - Micaiah speaks the exact words of the 400 in so mocking and ironical a tone, that the king cannot mistake his meaning, or regard his answer as serious. The king's rejoinder implies that this mocking manner was familiar to Micaiah, who had used it in some former dealings with the Israelite monarch. Hence, in part, the king's strong feeling of dislike (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14-17. what the Lord saith unto me, that will I speak—On the way the messenger who conducted [Micaiah] to the royal presence informed him of the tenor of the prophecies already given and recommended him to agree with the rest, no doubt from the kindly motive of seeing him released from imprisonment. But Micaiah, inflexibly faithful to his divine mission as a prophet, announced his purpose to proclaim honestly whatever God should bid him. On being asked by the king, \"Shall I go against Ramoth-gilead, or shall I forbear?\" the prophet gave precisely the same answer as the previous oracles that had been consulted; but it must have been given in a sarcastic tone and in ironical mockery of their way of speaking. Being solemnly urged to give a serious and truthful answer, Micaiah then declared the visionary scene the Spirit had revealed to him;—",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "How many times shall I adjure thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I adjure thee again and again, that thou give over this mockery, and seriously tell me the mind of God in this matter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the king said unto him, how many times shall I adjure thee,.... Not that he had as yet adjured him at all, or not till now; but he asks him how often he must be obliged to do it; and now he adjures him once for all, that he might not be forced to repeat it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou tell me nothing but that which is true in the name of the Lord? for he observed he did not speak in the name of the Lord before, and what he said was not in a serious but ludicrous manner, and not to be regarded as truth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thou tell me nothing but that which is true in the name of the Lord? for he observed he did not speak in the name of the Lord before, and what he said was not in a serious but ludicrous manner, and not to be regarded as truth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the king said unto him, How many times shall I adjure thee that thou tell me nothing but that which is true in the name of the LORD?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How many times shall I adjure thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It would seem from this that Ahab on former occasions had consulted Micaiah, and been dissatisfied with his answers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou tell me nothing but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that which is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "true",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that thou speak unto me nothing but the truth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is very nearly the form in 2 Chron. in A.V. The Hebrew is exactly the same. And both are in R.V. made to agree.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the king said unto him How many times shall I adjure thee that thou tell me nothing but that which is true in the name of the Lord?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Rawlinson concludes from these words that \"this mocking manner was familiar to Micaiah, who had used it in some former dealing with the Israelite monarch.\" But we must remember that Ahab's words were really addressed to Jehoshaphat. He is so manifestly playing a part, that we need not assume that he is strictly truthful. His great desire evidently is to discredit Micah's predictions, which he clearly perceives, from the bitter and ironical tone of the latter, will be adverse to him.] 1 Kings 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Micah's prophecy concerning the war, and his testimony against the lying prophets. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When Micah had come into the presence of the king, he replied to his question, \"Shall we go against Ramoth?\" etc., in just the same words as the pseudo-prophets, to show the king how he would speak if he were merely guided by personal considerations, as the others were. From the verbal agreement in his reply, and probably also from the tone in which he spoke, Ahab perceived that his words were ironical, and adjured him to speak only truth in the name of Jehovah. Micah then told him what he had seen in the spirit (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"I saw all Israel scatter itself upon the mountains, as sheep that have no shepherd;\" and then added the word of the Lord: \"These have no master; let them return every one to his house in peace.\" That is to say, Ahab would fall in the war against Ramoth in Gilead, and his army scatter itself without a leader upon the mountains of Gilead, and then every one would return home, without being pursued and slain by the enemy. Whilst Zedekiyah attempted to give greater emphasis to his prophecy by symbolically transferring to Ahab's enterprise the success predicted by Moses, Micah, on the other hand, showed to the king out of the law that would really take place in the intended war, namely, that very state of things which Moses before his departure sought to avert from Israel, by the prayer that the Lord would set a man over the congregation to lead them out and in, that the congregation might not become as sheep that have no shepherd (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]