[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(21) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It should be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The definite article is explained by some, perhaps rather weakly, as simply anticipatory of the description which follows. Others take the phrase to signify “the spirit of prophecy,” a kind of emanation from the Godhead, looked upon as the medium of the prophetic inspiration, which is an expression conceivable, but certainly unprecedented. Perhaps without introducing into this passage the distinct idea of “the Satan,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the enemy, which we find in Job 1, 2; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 3:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". it may be best to interpret it by the conception, common to all religions recognising the terrible existence of evil in the world, of a spiritual power of evil (called euphemistically, “the spirit”) overruled to work out the judgments of God. The absolute subordination of such spirits of evil in every notice of them in the Old Testament precludes all danger of the monstrous dualism of so many Eastern religions. The reference of the power of divination to such spirits is found in the New Testament also. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:16-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:15-28 The greatest kindness we can do to one that is going in a dangerous way, is, to tell him of his danger. To leave the hardened criminal without excuse, and to give a useful lesson to others, Micaiah related his vision. This matter is represented after the manner of men: we are not to imagine that God is ever put upon new counsels; or that he needs to consult with angels, or any creature, about the methods he should take; or that he is the author of sin, or the cause of any man's telling or believing a lie. Micaiah returned not the blow of Zedekiah, yet, since he boasted of the Spirit, as those commonly do that know least of the Holy Spirit's operations, the true prophet left him to be convinced of his error by the event. Those that will not have their mistakes set right in time, by the word of God, will be undeceived, when it is too late, by the judgments of God. We should be ashamed of what we call trials, were we to consider what the servants of God have endured. Yet it will be well, if freedom from trouble prove not more hurtful to us; we are more easily allured and bribed into unfaithfulness and conformity to the world, than driven to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A spirit - \"The spirit \" - which some explain as \"the evil spirit\" - i. e. Satan; others as simply \"the spirit\" who should \"persuade.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18-23. Did I not tell thee that he would prophesy no good concerning me, but evil?—Since Ahab was disposed to trace this unwelcome truth to personal enmity, Micaiah proceeded fearlessly to tell the incensed monarch in full detail what had been revealed to him. The Hebrew prophets, borrowing their symbolic pictures from earthly scenes, described God in heaven as a king in His kingdom. And as earthly princes do nothing of importance without asking the advice of their counsellors, God is represented as consulting about the fate of Ahab. This prophetic language must not be interpreted literally, and the command must be viewed as only a permission to the lying spirit (Ro 11:34) [Calmet].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " An evil spirit came out of the knot or company of them, standing possibly on the left hand, and presented himself before the throne, as having something to say to the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there came forth a spirit,.... Not from the heavenly host on the right hand or the left, for they are pure and holy spirits, and impeccable, and cannot lie or deceive; but the evil spirit, Satan, the father of lies, the old deceiver, who came forth from his own place and his own company: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and stood before the Lord presented himself before him, as Satan did, Job 1:6, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and stood before the Lord presented himself before him, as Satan did, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, l will persuade him; or prevail upon him; evil spirits love to be employed in doing harm to men, they go about seeking whom they may devour. This could not be the spirit of Naboth, as the Jews say (q), seeking revenge on Ahab; that was in a state of happiness, could not move from thence, and be capable of sinning. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) T. Bab. Sanhedrin, fol. 89. 1. & 102. 2. Targum in 2 Chronicles 18.20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) T. Bab. Sanhedrin, fol. 89. 1. & 102. 2. Targum in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".20. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there came forth a spirit, and {q} stood before the LORD, and said, I will persuade him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And there came forth a spirit, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stood before the LORD, and said, I will persuade him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Here we see that though the devil is always ready to bring us to destruction, yet he has no more power than God gives him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And there came forth a spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew has ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " spirit’ as is noted on the margin of the R.V. It seems therefore to imply some definite power which imparted to prophets their gifts; the prophetic spirit. That God allowed this power to delude Ahab was because of the king’s persistence in evil. God therefore gives him over to it, and causes the prophets whom he has chosen for himself, to the rejection of Micaiah and such as he, to be the instruments of his destruction. Thus when Isaiah is sent to rebellious Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") his mission is described as of this nature. God says to him ‘Make the heart of this people fat and make their ears heavy, and shut their eyes, lest they see with their eyes, and hear with their ears, and understand with their hearts.’ In this wise and with like effect comes the spirit from God into the mouths of Ahab’s four hundred.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And there came forth a spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By some, especially of the earlier commentators, understood of the evil spirit. But the view now generally adopted (Thenius, Keil, Bahr) is that \"the spirit of prophecy\" is meant, \"the power which, going forth from God and taking possession of a man, makes him a prophet (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:6, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 19:20, 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נָביא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אִישׁ הָרוּחַ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")\" Bahr. This power is here personified], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and stood before the Lord, and said, I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [emphatic in the Hebrew] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "will persuade",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [or entice] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1 Kings 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Micah was not led astray, however, by this, but disclosed to him by a further revelation the hidden ground of the false prophecy of his 400 prophets. וגו שׁמע לכן, \"therefore, sc. because thou thinkest so, hear the word of Jehovah: I saw the Lord sit upon His throne, and all the army of heaven stand around him (עליו עמד as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) on His right hand and on His left. And the Lord said, Who will persuade Ahab to go up and fall at Ramoth in Gilead? and one spake so, the other so; and the spirit came forth (from the ranks of the rest), stood before Jehovah, and said, I will persuade him...I will go out and be a lying spirit in the mouth of all his prophets. And He (Jehovah) said, Persuade, and thou wilt also be able; go forth and do so. And now Jehovah has put a lying spirit into the mouth of all his prophets; but Jehovah (Himself) has spoken evil (through me) concerning thee.\" The vision described by Micah was not merely a subjective drapery introduced by the prophet, but a simple communication of the real inward vision by which the fact had been revealed to him, that the prophecy of those 400 prophets was inspired by a lying spirit. The spirit (הרוּח) which inspired these prophets as a lying spirit is neither Satan, nor any evil spirit whatever, but, as the definite article and the whole of the context show, the personified spirit of prophecy, which is only so far a πνεῦμα ἀκάθαρτον τῆς πλάνης (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and under the influence of Satan as it works as שׁקר רוּח in accordance with the will of God. For even the predictions of the false prophets, as we may see from the passage before us, and also from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the scriptural teaching in other passages concerning the spiritual principle of evil, were not mere inventions of human reason and fancy; but the false prophets as well as the true were governed by a supernatural spiritual principle, and, according to divine appointment, were under the influence of the evil spirit in the service of falsehood, just as the true prophets were moved by the Holy Spirit in the service of the Lord. The manner in which the supernatural influence of the lying spirit upon the false prophets is brought out in Micah's vision is, that the spirit of prophecy (רוח הנבואה) offers itself to deceive Ahab as שׁקר רוּח in the false prophets. Jehovah sends this spirit, inasmuch as the deception of Ahab has been inflicted upon him as a judgment of God for his unbelief. But there is no statement here to the effect that this lying spirit proceeded from Satan, because the object of the prophet was simply to bring out the working of God in the deception practised upon Ahab by his prophets. - The words of Jehovah, \"Persuade Ahab, thou wilt be able,\" and \"Jehovah has put a lying spirit,\" etc., are not to be understood as merely expressing the permission of God, as the fathers and the earlier theologians suppose. According to the Scriptures, God does work evil, but without therefore willing it and bringing forth sin. The prophet's view is founded upon this thought: Jehovah has ordained that Ahab, being led astray by a prediction of his prophets inspired by the spirit of lies, shall enter upon the war, that he may find therein the punishment of his ungodliness. As he would not listen to the word of the Lord in the mouth of His true servants, God had given him up (παρέδωκεν, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in his unbelief to the working of the spirits of lying. But that this did not destroy the freedom of the human will is evident from the expression תּפתּה, \"thou canst persuade him,\" and still more clearly from תּוּכל גּם, \"thou wilt also be able,\" since they both presuppose the possibility of resistance to temptation on the part of man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Zedekiah was so enraged at this unveiling of the spirit of lying by which the pseudo-prophets were impelled, that he smote Micah upon the cheek, and said (1 Kings 22:24): \"Where did the Spirit of Jehovah depart from me, to speak to thee?\" To אי־זה the Chronicles add as an explanation, הדּרך: \"by what way had he gone from me?\" (cf. 2 Kings 3:8, and Ewald, 326, a.) Zedekiah was conscious that he had not invented his prophecy himself, and therefore it was that he rose up with such audacity against Micah; but he only proved that it was not the Spirit of God which inspired him. If he had been inspired by the Spirit of the Lord, he would not have thought it necessary to try and give effect to his words by rude force, but he would have left the defence of his cause quietly to the Lord, as Micah did, who calmly replied to the zealot thus (1 Kings 22:25): \"Thou wilt see it (that the Spirit of Jehovah had departed from thee) on the day when thou shalt go from chamber to chamber to hide thyself\" (החבה for החבא, see Ges. 75, Anm. 21). This was probably fulfilled at the close of the war, when Jezebel or the friends of Ahab made the pseudo-prophets suffer for the calamitous result; although there is nothing said about this in our history, which confines itself to the main facts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Zedekiah was so enraged at this unveiling of the spirit of lying by which the pseudo-prophets were impelled, that he smote Micah upon the cheek, and said (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): \"Where did the Spirit of Jehovah depart from me, to speak to thee?\" To אי־זה the Chronicles add as an explanation, הדּרך: \"by what way had he gone from me?\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Ewald, 326, a.) Zedekiah was conscious that he had not invented his prophecy himself, and therefore it was that he rose up with such audacity against Micah; but he only proved that it was not the Spirit of God which inspired him. If he had been inspired by the Spirit of the Lord, he would not have thought it necessary to try and give effect to his words by rude force, but he would have left the defence of his cause quietly to the Lord, as Micah did, who calmly replied to the zealot thus (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): \"Thou wilt see it (that the Spirit of Jehovah had departed from thee) on the day when thou shalt go from chamber to chamber to hide thyself\" (החבה for החבא, see Ges. 75, Anm. 21). This was probably fulfilled at the close of the war, when Jezebel or the friends of Ahab made the pseudo-prophets suffer for the calamitous result; although there is nothing said about this in our history, which confines itself to the main facts.",
            "children": []
          }
        ]
      }
    ]
  }
]