[{"num":17,"verse":"In that time was a man, that was called Micah, of the hill of Ephraim. (At that time there was a man, who was called Micah, of the hill country of Ephraim.)"},{"num":2,"verse":"And he said to his mother, Lo! I have a thousand and an hundred pieces of silver, which thou separatedest to thee, and on which thou cursedest, while I heard; and those be with me. To whom she answered, Blessed be my son of the Lord. (And he said to his mother, Thou haddest a thousand and a hundred pieces of silver that were taken from thee, and I heard thou curse him who robbed thee; lo! I was the one who took them. And she quickly said, May the Lord bless my son!)"},{"num":3,"verse":"Therefore he yielded those to his mother; and she said to him, I hallowed and avowed this silver to the Lord, that my son receive (it out) of mine hand, and make (with it) a graven image and a molten image; and now I give it to thee. (And so he gave the silver back to his mother; and she said, I now hallow and vow this silver to the Lord, to protect my son from the curse, and I ask that ye, my son, have a carved idol, and a cast image, made from it; and now I give it to thee.)"},{"num":4,"verse":"Therefore he yielded to his mother; and she took two hundred pieces of (the) silver, and gave those to a workman of silver, that he should make of those a graven image and (a) molten (image), that was (to be put) in the house of Micah. (And so he gave the silver back to his mother; and she took two hundred pieces of the silver, and gave them to a craftsman of silver, so that he could make them into a carved idol, and a cast image; and they were put in Micah’s house.)"},{"num":5,"verse":"And Micah also separated a little house, or an oratory, therein to God; and made (an) ephod, and teraphim, that is, a priest’s cloak, and idols; and he filled the hand of one of his sons, and he was made a priest to him (and he consecrated, or dedicated, one of his sons, and he became his priest)."},{"num":6,"verse":"In those days was no king in Israel, but each man did that, that seemed rightful to himself. (In those days there was no king in Israel, but each person did what seemed right to himself.)"},{"num":7,"verse":"Also another young waxing man was of Bethlehem of Judah, of the kindred of Judah, and he was a deacon, and dwelled there. (And there was a young man of Bethlehem in Judah, of the tribe of Judah, and he was a Levite, and lived there.)"},{"num":8,"verse":"And he went out of the city of Bethlehem, and would be a pilgrim, wherever he found (it) profitable to himself. And when he made journey, and had come into the hill of Ephraim, and had bowed [down] a little into the house of Micah, (And he went out of the city of Bethlehem, and would be a visitor, wherever he found it profitable for himself. And when he had made a journey, and had come to the hill country of Ephraim, and had rested a little at Micah’s house,)"},{"num":9,"verse":"Micah asked him, From whence comest thou? Which answered, I am a deacon of Bethlehem of Judah, and I go, that I dwell where I may, and where I see that it is profitable to me. (Micah asked him, Where comest thou from? And he answered, I am a Levite of Bethlehem in Judah, and I go, so that I can live where I may, and where I see that it is profitable for me.)"},{"num":10,"verse":"And Micah said, Dwell thou with me, and be thou to me a father and priest; and I shall give to thee by each year ten pieces of silver, and a double clothing, and those things that be necessary to lifelode. [And] He assented, (And Micah said, Stay thou with me, and be thou a father and a priest to me; and each year I shall give thee ten pieces of silver, and thy clothes, and thy food, or sustenance. And he agreed,)"},{"num":11,"verse":"and dwelled with that man; and he was to that man as one of his sons. (and lived with that man; and he was like one of his sons to that man.)"},{"num":12,"verse":"And Micah filled his hand (And Micah consecrated, or dedicated, him), and he had the young man (become his) priest, (and abide) with him,"},{"num":13,"verse":"and he said, Now I know, that God shall do well to me, having a priest of the kin of Levi. (and he said, Now I know that God shall make things go well for me, for I have my own priest of the tribe of Levi.)"}]