[{"header":"Elijah Proclaims Famine"},{"num":17,"verse":"Now Elijah the Tishbite, one of the settlers of Gilead, said to Ahab: “As Adonai God of Israel lives, before whom I stand, there shall be no dew or rain these years, except at my word.”"},{"num":2,"verse":"Then the word of Adonai came to him saying: "},{"num":3,"verse":"“Leave this place, turn eastward, and hide yourself by the Wadi Cherith, east of the Jordan. "},{"num":4,"verse":"It will come about that you will drink from the wadi. I have also commanded the ravens to feed you there.”"},{"num":5,"verse":"So he went and did according to the word of Adonai—he went and lived by the Wadi Cherith, which is east of the Jordan. "},{"num":6,"verse":"The ravens kept bringing him bread and meat in the morning and bread and meat in the evening, and he drank from the wadi. "},{"num":7,"verse":"Then it came to pass after a while that the wadi dried up, because there was no rain in the land."},{"num":8,"verse":"Then the word of Adonai came to him saying: "},{"num":9,"verse":"“Arise, go to Zarephath of Sidon and stay there. I have just commanded a widow there to provide for you.”"},{"header":"Miracle of Flour and Oil"},{"num":10,"verse":"So he arose and went to Zarephath. Now when he came to the town gate, to his surprise, a widow was there gathering sticks. So he called her and said, “Please bring a little water in a jar that I may drink.” "},{"num":11,"verse":"As she was going to fetch it, he called her and said, “Please bring me a morsel of bread in your hand.”"},{"num":12,"verse":"So she said, “As Adonai your God lives, I have nothing baked, only a handful of flour in the jar, and a little oil in the jug. Now look, I am gathering a couple of sticks, so that I may go in and prepare it for me and my son, that we may eat it and die.”"},{"num":13,"verse":"Elijah said to her, “Fear not! Go and do as you said, but first make me a little cake from what you have there. Bring it out to me and afterwards, make some for you and for your son. "},{"num":14,"verse":"For thus says Adonai God of Israel, ‘The jar of flour shall not be exhausted nor shall the jug of oil be empty until the day Adonai sends rain on the land.’”"},{"num":15,"verse":"So she went and did according to the word of Elijah—and she and he, and her household ate for many days. "},{"num":16,"verse":"The jar of flour was not exhausted, nor did the jug of oil become empty, according to the word of Adonai which He spoke through Elijah."},{"header":"Resurrection of a Boy"},{"num":17,"verse":"After these things, it came to pass that the son of the woman, the mistress of the house fell sick, and his sickness was getting much worse until he had no breath left in him. "},{"num":18,"verse":"So she said to Elijah, “What do I have to do with you, man of God? Have you come to me to remind me of my sin and kill my son?”"},{"num":19,"verse":"He said to her, “Give me your son.” Then he took him from her arms, carried him up to the upper room where he was staying and laid him on his own bed. "},{"num":20,"verse":"He cried out to Adonai and said, “Adonai my God, have You brought such evil even on the widow with whom I am staying, by causing her son to die?” "},{"num":21,"verse":"Then he stretched himself upon the child three times. He cried out to Adonai and said, “Adonai my God, please let this child’s soul come back into his body!”"},{"num":22,"verse":"Adonai listened to the cry of Elijah, so the soul of the child came back into his body and he was revived. "},{"num":23,"verse":"Then Elijah took the child and brought him down from the upper room into the house, and gave him to his mother. Elijah said, “See! Your son is alive.”"},{"num":24,"verse":"Then the woman said to Elijah, “Now I know that you are a man of God, and that the word in your mouth is truth.”"}]