[{"header":"Chapter 18"},{"num":1,"verse":"The Potter’s Vessel. This word came to Jeremiah from the Lord: "},{"num":2,"verse":"Arise and go down to the potter’s house; there you will hear my word. "},{"num":3,"verse":"I went down to the potter’s house and there he was, working at the wheel. "},{"num":4,"verse":"Whenever the vessel of clay he was making turned out badly in his hand, he tried again, making another vessel of whatever sort he pleased. "},{"num":5,"verse":"Then the word of the Lord came to me: "},{"num":6,"verse":"Can I not do to you, house of Israel, as this potter has done?—oracle of the Lord. Indeed, like clay in the hand of the potter, so are you in my hand, house of Israel. "},{"num":7,"verse":"At one moment I may decree concerning a nation or kingdom that I will uproot and tear down and destroy it; "},{"num":8,"verse":"but if that nation against whom I have decreed turns from its evil, then I will have a change of heart regarding the evil which I have decreed. "},{"num":9,"verse":"At another moment, I may decree concerning a nation or kingdom that I will build up and plant it; "},{"num":10,"verse":"but if that nation does what is evil in my eyes, refusing to obey my voice, then I will have a change of heart regarding the good with which I planned to bless it."},{"num":11,"verse":"And now, tell this to the people of Judah and the inhabitants of Jerusalem: Thus says the Lord: Look, I am fashioning evil against you and making a plan. Return, all of you, from your evil way; reform your ways and your deeds. "},{"num":12,"verse":"But they will say, “No use! We will follow our own devices; each one of us will behave according to the stubbornness of our evil hearts!”"},{"header":"Unnatural Apostasy"},{"num":18,"verse":"Another Prayer for Vengeance. “Come,” they said, “let us devise a plot against Jeremiah, for instruction will not perish from the priests, nor counsel from the wise, nor the word from the prophets. Come, let us destroy him by his own tongue. Let us pay careful attention to his every word.”"}]