[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) The readings of the texts here differ considerably, but without any essential difference of meaning. “Being convicted by their own conscience” is probably an addition made by some copyist to explain the meaning, which is quite clear without it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Beginning at the eldest.—Literally, beginning at the elders; but our version gives the right sense, and prevents the possible mistake of understanding the word to mean the elders of the people. So “the last” should probably be taken, not of the lowest in official rank, but of the last who went out.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Beginning at the eldest.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "beginning at the elders;",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but our version gives the right sense, and prevents the possible mistake of understanding the word to mean the elders of the people. So “the last” should probably be taken, not of the lowest in official rank, but of the last who went out.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And Jesus was left alone, and the woman standing in the midst.—The scribes and Pharisees had probably stood close to Him. The woman was at some little distance, naturally shrinking from their gaze; but there is a crowd of people, including the disciples, around her, for they are in the Temple, and before this interruption He was engaged in teaching the people (John 8:2). Her accusers had “set her in the midst” (John 8:2), where she now stands. The whole scene is pictured with the minute detail of an eye-witness, who remembers how the persons were grouped, how the accusers went out one after another, and then, how Jesus was left alone, apart from the crowd, but that the others were still present.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And Jesus was left alone, and the woman standing in the midst.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The scribes and Pharisees had probably stood close to Him. The woman was at some little distance, naturally shrinking from their gaze; but there is a crowd of people, including the disciples, around her, for they are in the Temple, and before this interruption He was engaged in teaching the people (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Her accusers had “set her in the midst” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), where she now stands. The whole scene is pictured with the minute detail of an eye-witness, who remembers how the persons were grouped, how the accusers went out one after another, and then, how Jesus was left alone, apart from the crowd, but that the others were still present.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-11 Christ neither found fault with the law, nor excused the prisoner's guilt; nor did he countenance the pretended zeal of the Pharisees. Those are self-condemned who judge others, and yet do the same thing. All who are any way called to blame the faults of others, are especially concerned to look to themselves, and keep themselves pure. In this matter Christ attended to the great work about which he came into the world, that was, to bring sinners to repentance; not to destroy, but to save. He aimed to bring, not only the accused to repentance, by showing her his mercy, but the prosecutors also, by showing them their sins; they thought to insnare him, he sought to convince and convert them. He declined to meddle with the magistrate's office. Many crimes merit far more severe punishment than they meet with; but we should not leave our own work, to take that upon ourselves to which we are not called. When Christ sent her away, it was with this caution, Go, and sin no more. Those who help to save the life of a criminal, should help to save the soul with the same caution. Those are truly happy, whom Christ does not condemn. Christ's favour to us in the forgiveness of past sins should prevail with us, Go then, and sin no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Beginning at the eldest - As being conscious of more sins, and, therefore, being desirous to leave the Lord Jesus. The word \"eldest\" here probably refers not to age, but to benefit - from those who were in highest reputation to the lowest in rank. This consciousness of crime showed that the state of the public morals was exceedingly corrupt, and justified the declaration of Jesus that it was an adulterous and wicked generation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Alone - Jesus only was left with the woman, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the midst - Her accusers had gone out, and left Jesus and the woman; but it is by no means probable that the people had left them; and, as this was in the temple on a public occasion, they were doubtless surrounded still by many. This is evident from the fact that Jesus immediately John 8:12 addressed a discourse to the people present. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the midst - Her accusers had gone out, and left Jesus and the woman; but it is by no means probable that the people had left them; and, as this was in the temple on a public occasion, they were doubtless surrounded still by many. This is evident from the fact that Jesus immediately ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " addressed a discourse to the people present. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. they … convicted … went out one by one … Jesus was left alone—that is, without one of her accusers remaining; for it is added.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the woman in the midst—that is, of the remaining audience. While the trap failed to catch Him for whom it was laid, it caught those who laid it. Stunned by the unexpected home thrust, they immediately made off—which makes the impudence of those impure hypocrites in dragging such a case before the public eye the more disgusting.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This was an age of very great corruption as to men’s lives and manners, as well as to doctrine, and corruption of worship; and as other enormities of life were very common and ordinary amongst them, so it is very probable were adulteries, and that their rulers and teachers were not without great guilt. Now, see the power of conscience, when set on work by God; these accusers’ consciences were to them as a thousand witnesses; they were reproved and convicted by them, and not able to stand under the reflections of them, or to say any thing in answer to what our Saviour had said: they went away one after another; and possibly it is particularly noted that they began ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "at the eldest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because the consciences of the eldest of them charged them more deeply for more and greater sins. Jesus was left not wholly alone, for the next words tell us, that the woman was still left standing in the midst; and no doubt but his apostles were there, for they constantly attended him; and no doubt divers others were also there: but the meaning is, that he was by this means quit of the scribes’ and Pharisees’ company, who were gone out of shame, being thus convicted by their own consciences, which told them, that whatsoever this woman was, they were no fit accusers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they which heard it,.... Not all, not the disciples of Christ, nor the multitude, but the Scribes and Pharisees: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "being convicted by their own conscience; that they were not without sin, nor free from this; they had a beam in their own eye, who were so forward to observe the mote in another's; and oftentimes so it is, that those who are most forward to reprove, and bear hardest on others for their sins, are as culpable in another way, if not in the same; when sin lies at the door, and conscience is awakened and open, it is as good as a thousand witnesses; and lets in, and owns the sin which lies heavy, and makes sad work; and fills with anguish, confusion, and shame, as it did these men: who ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "went out one by one; from the temple, in as private a manner, and as unobserved as they could: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "beginning at the eldest: who might have been most culpable, or however soonest took the hint; being more wise and sagacious: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unto the last; this is wanting in the Vulgate Latin, Syriac, and Persic versions, and in two of Beza's copies, and the Basil edition: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Jesus was left alone; not by his disciples, nor the multitude, but his antagonists, who came to tempt and ensnare him: for it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the woman standing in the midst; that is, of the company as before. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the woman standing in the midst; that is, of the company as before. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they which heard it, being convicted by their own conscience, went out one by one, beginning at the eldest, even unto the last: and Jesus was left alone, and the woman standing in the midst.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐσχάτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “And they when they heard it went out one by one, beginning from the elders until the last.” [The words which truly describe the motive of this departure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ὑπὸ τῆς συνειδήσεως ἐλεγχόμενοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are deleted by Tr. W.H.R.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρεσβυτέρων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers not to the elders by office but by age. They naturally took the lead, and the younger men deferentially allowed them to pass and then followed. Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατελείφθη μόνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑστῶσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jesus was left sitting and the woman standing before Him. But only those would retire who had been concerned in the accusation: the disciples and those who had previously been listening to Him would remain.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being convicted by their own conscience",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These words are probably a gloss added by some copyist, like ‘as though He heard them not,’ added by our translators (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 8:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beginning at the eldest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beginning at the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "elders",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": but it means the elders in years, not the Elders; so that our translators have done well to avoid a literal rendering which would have been misleading. Meyer suggests that the oldest would be shrewd enough to slip away at once without compromising themselves further; certainly they would have the largest experience of life and its temptations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was left alone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not that there were no witnesses, but that they had withdrawn to a distance. The graphic precision of this verse indicates the account of an eyewitness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "standing in the midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "being",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the brutality of her accusers had placed her (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 8:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀπὸ τῶν πρεσβυτέρων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beginning with the elders",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") These had been most conscience-struck. Great was the force of Jesus’ words, [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "throwing open the inmost recesses of men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μόνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") not one of those, who had proposed the case, remaining. Others, who also were of the Pharisees, remained, as appears from comparing ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they when they heard it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  (",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "being convicted by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "their",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "own",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "conscience",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "they went out one by one.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Their conscience convinced them that the spirit of the Law is greater than its letter. The phrase expressing the action of conscience was probably an explanatory and true gloss, which accounted for the sudden change of front. It was a proof of the ally which Divine law has within the human breast. The whole crowd, rather than the humbled woman, is condemned, but self-condemned and silent. This event speaks for the moral sense which had been paralyzed rather than obliterated in this people. (The expression, \"one by one,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἱς κὰθ εἱς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἱς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is treated as indeclinable, is occasionally found in later Greek, but only once in the New Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is not in D, but in several of the codices and cursives, and it is retained in R.T.) The slow rather than simultaneous disappearance of the gang of accusers is a highly dramatic touch, and the remaining clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "beginning from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the eldest, even unto the last,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " heightens the impression. The phrase ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρεσβυτέρων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " need not refer to office, but to age, and the \"last\" need not necessarily mean the youngest, but those that were left when the most responsible men found that they had carried their question too far, and had retired. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus was left alone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so far as these accusers were concerned. The multitudes who had gathered round him were still waiting for his words (see ver. 2). This fact is involved in the substance of the narrative, whether the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pericope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " belongs to the Gospel of John or not. And ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the woman where she was,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the assembly that remained, more likely cowering in shame and mortal fear than standing brazen-faced or daring before that awful Presence. These two (\"Miseria et Misericordia,\" as said Augustine), \"Misery and Pity,\" face one another, and in the presence of a multitude of disciples and other listeners, Misery waits for Pity to speak - for perfect holiness and perfect mercy to do its will. There is One seated there who ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " without sin. He is at liberty, on his own showing, to condemn, and even to execute his fierce displeasure against a sin which he had, in his great inaugural discourse, charged upon the ill-regulated desires and evil glances of men. John 8:9",
        "children": []
      }
    ]
  }
]