[{"header":"Builders of the Wall"},{"num":3,"verse":"Eliashib the high priest and his fellow priests went to work. They rebuilt the Sheep Gate. They gave it to the Lord’s service and set its doors in place. They worked as far as the Tower of the Hundred, and they gave it to the Lord’s service. Then they went on to the Tower of Hananel. "},{"num":2,"verse":"The men of Jericho built the part of the wall next to the priests. And Zaccur son of Imri built next to them."},{"num":3,"verse":"The sons of Hassenaah rebuilt the Fish Gate. They set the boards in place. And they put its doors, bolts and bars in place. "},{"num":4,"verse":"Meremoth son of Uriah made repairs next to them. (Uriah was the son of Hakkoz.) Meshullam son of Berekiah worked next to Meremoth. (Berekiah was the son of Meshezabel.) And Zadok son of Baana worked next to Meshullam. "},{"num":5,"verse":"The men from Tekoa made repairs next to them. But the leading men of Tekoa would not work under their supervisors."},{"num":6,"verse":"Joiada son of Paseah and Meshullam son of Besodeiah repaired the Old Gate. They set its boards in place. And they put its doors, bolts and bars in place. "},{"num":7,"verse":"Next to them, men from Gibeon and Mizpah made repairs. Melatiah was from Gibeon, and Jadon was from Meronoth. These places were ruled by the governor west of the Euphrates River. "},{"num":8,"verse":"Next to them, Uzziel son of Harhaiah made repairs. He was a goldsmith. And next to him, Hananiah made repairs. He was one of the people who made perfume. These men rebuilt Jerusalem as far as the Broad Wall. "},{"num":9,"verse":"The next part of the wall was repaired by Rephaiah son of Hur. He was ruler of half of the district of Jerusalem. "},{"num":10,"verse":"Next to him, Jedaiah son of Harumaph made repairs. He worked opposite his own house. And next to him, Hattush son of Hashabneiah made repairs. "},{"num":11,"verse":"Malkijah son of Harim and Hasshub son of Pahath-Moab repaired another part of the wall. And they repaired the Tower of the Ovens. "},{"num":12,"verse":"Next to them, Shallum son of Hallohesh made repairs. He was ruler of half of the district of Jerusalem. His daughters helped him."},{"num":13,"verse":"Hanun and the people of Zanoah repaired the Valley Gate. They rebuilt it and put its doors, bolts and bars in place. They also repaired the 500 yards of the wall to the Trash Gate."},{"num":14,"verse":"Malkijah son of Recab repaired the Trash Gate. He was ruler of the district of Beth Hakkerem. He rebuilt that gate and put its doors, bolts and bars in place."},{"num":15,"verse":"Shallun son of Col-Hozeh repaired the Fountain Gate. He was ruler of the district of Mizpah. He rebuilt it and put a roof over it. And he put its doors, bolts and bars in place. He also repaired the wall of the Pool of Siloam. It is next to the King’s Garden. He repaired the wall all the way to the steps. They went down from the older part of the city. "},{"num":16,"verse":"Next to Shallun, Nehemiah son of Azbuk made repairs. He was ruler of half of the district of Beth Zur. He made repairs up to a place opposite the tombs of David. He made repairs as far as the man-made pool and the House of the Heroes."},{"num":17,"verse":"Next to him, the Levites made repairs. Some worked under Rehum son of Bani. Next to him, Hashabiah made repairs for his district. He was ruler of half of the district of Keilah. "},{"num":18,"verse":"Next to him, Binnui son of Henadad and his relatives made repairs. Binnui was the ruler of the other half of the district of Keilah. "},{"num":19,"verse":"Next to them, Ezer son of Jeshua worked. He was ruler of Mizpah. He repaired another part of the wall. He worked across from the way up to the storehouse for weapons. And he worked to the place where the wall turns. "},{"num":20,"verse":"Next to him, Baruch son of Zabbai worked very hard to repair another part of the wall. It went from the place where the wall turns to the entrance of the house of Eliashib. He was the high priest. "},{"num":21,"verse":"Next to him, Meremoth son of Uriah worked. (Uriah was the son of Hakkoz.) He repaired another part of the wall. It went from the entrance to Eliashib’s house to the far end of it."},{"num":22,"verse":"Next to him worked the priests from the surrounding area. "},{"num":23,"verse":"Next to them, Benjamin and Hasshub made repairs in front of their own house. Next to them, Azariah son of Maaseiah made repairs beside his own house. (Maaseiah was the son of Ananiah.) "},{"num":24,"verse":"Next to him, Binnui son of Henadad repaired another part of the wall. It went from Azariah’s house to the place where the wall turned. And it went to the corner. "},{"num":25,"verse":"Palal son of Uzai worked across from the place where the wall turned. And he worked by the tower on the upper palace. That is near the courtyard of the king’s guard. Next to Palal, Pedaiah son of Parosh made repairs. "},{"num":26,"verse":"The Temple servants lived on the hill of Ophel. They made repairs as far as a point opposite the Water Gate. They worked toward the east and the tower that extends from the palace. "},{"num":27,"verse":"Next to them, the men of Tekoa made repairs. They worked on the wall from the great tower that extends from the palace to the wall of Ophel."},{"num":28,"verse":"The priests made repairs above the Horse Gate. Each worked in front of his own house. "},{"num":29,"verse":"Next to them, Zadok son of Immer made repairs across from his own house. Next to him, Shemaiah son of Shecaniah made repairs. He was the guard of the East Gate. "},{"num":30,"verse":"Next to him, Hananiah son of Shelemiah and Hanun, the sixth son of Zalaph, made repairs. They worked on another part of the wall. Next to them, Meshullam son of Berekiah made repairs. It was across from where he lived. "},{"num":31,"verse":"Next to him, Malkijah made repairs. He was one of the goldsmiths. He worked as far as the house of the Temple servants and the traders. That is across from the Inspection Gate. And he worked as far as the room above the corner of the wall. "},{"num":32,"verse":"The goldsmiths and the traders made repairs on another part of the wall. It was between the room above the corner of the wall and the Sheep Gate."}]