[{"header":"A List of the People Who Repaired the Wall"},{"num":3,"verse":"Eliashib the high priest and the other priests went to work. They rebuilt the Sheep Gate. They set it apart to God. They put its doors in place. They continued to rebuild the wall up to the Tower of the Hundred. They set the tower apart to God. Then they continued to rebuild the wall all the way to the Tower of Hananel. "},{"num":2,"verse":"Some men from Jericho rebuilt the next part of the wall. And Zakkur rebuilt the next part. He was the son of Imri."},{"num":3,"verse":"The sons of Hassenaah rebuilt the Fish Gate. They laid its beams. They put in place its doors with their metal bolts and bars. "},{"num":4,"verse":"Meremoth repaired the next part of the wall. He was the son of Uriah. Uriah was the son of Hakkoz. Next to Meremoth, Meshullam made some repairs. He was the son of Berekiah. Berekiah was the son of Meshezabel. Next to Meshullam, Zadok also made some repairs. He was the son of Baana. "},{"num":5,"verse":"Some men from Tekoa repaired the next part of the wall. But their nobles refused to do any work at all. They didn’t pay any attention to the people who were in charge of the work."},{"num":6,"verse":"Joiada and Meshullam repaired the Jeshanah Gate. Joiada was the son of Paseah. Meshullam was the son of Besodeiah. Joiada and Meshullam laid the beams of the gate. They put in place its doors with their metal bolts and bars. "},{"num":7,"verse":"Next to them, some men from Gibeon and Mizpah made repairs. They included Melatiah from Gibeon and Jadon from Meronoth. Those places were under the authority of the governor of the land west of the Euphrates River. "},{"num":8,"verse":"Uzziel repaired the next part of the wall. He made his living by working with gold. He was the son of Harhaiah. Hananiah made repairs on the next part. He made his living by making perfume. So the wall of Jerusalem was made like new again all the way to the Broad Wall. "},{"num":9,"verse":"Rephaiah repaired the next part. He was the son of Hur. Rephaiah ruled over half of the territory where Jerusalem was located. "},{"num":10,"verse":"Jedaiah repaired the part of the wall that was across from his house. He was the son of Harumaph. Hattush made repairs next to Jedaiah. Hattush was the son of Hashabneiah. "},{"num":11,"verse":"Malkijah and Hasshub repaired another part of the wall. They also repaired the Tower of the Ovens. Malkijah was the son of Harim. Hasshub was the son of Pahath-Moab. "},{"num":12,"verse":"Shallum repaired the next part. His daughters helped him. He was the son of Hallohesh. Shallum ruled over the other half of the territory where Jerusalem was located."},{"num":13,"verse":"Hanun repaired the Valley Gate. Some people who lived in Zanoah helped him. They rebuilt it. They put in place its doors with their metal bolts and bars. They also repaired 1,500 feet of the wall. They repaired it all the way to the Dung Gate."},{"num":14,"verse":"Malkijah repaired the Dung Gate. He was the son of Rekab. Malkijah ruled over the territory where Beth Hakkerem was located. He rebuilt the gate. He put in place its doors with their metal bolts and bars."},{"num":15,"verse":"Shallun repaired the Fountain Gate. He was the son of Kol-Hozeh. Shallun ruled over the territory where Mizpah was located. He rebuilt the gate. He put a roof over it. And he put in place the doors of the gate with their metal bolts and bars. He also repaired the wall by the Pool of Siloam. It was near the King’s Garden. Shallun repaired the wall as far as the steps that go down from the City of David. "},{"num":16,"verse":"Next to Shallun, Nehemiah made some repairs. He was the son of Azbuk. Nehemiah ruled over half of the territory where Beth Zur was located. He repaired the wall up to the part that was across from the tombs of David. He repaired it all the way to the man-made pool and the House of the Heroes."},{"num":17,"verse":"Next to Nehemiah, some Levites made repairs. They worked under the direction of Rehum. He was the son of Bani. Next to Rehum, Hashabiah made repairs for his territory. He ruled over half of the territory where Keilah was located. "},{"num":18,"verse":"Next to him, other Levites made some repairs. They worked under the direction of Binnui. He was the son of Henadad. Binnui ruled over the other half of the territory where Keilah was located. "},{"num":19,"verse":"Next to Binnui, Ezer repaired another part of the wall. He was the son of Jeshua. Ezer ruled over Mizpah. He repaired the part across from the place that went up to the storeroom where the weapons were kept. He repaired the wall up to the angle of the wall. "},{"num":20,"verse":"Next to Ezer, Baruch worked hard to repair another part of the wall. He was the son of Zabbai. He repaired the part from the angle of the wall to the entrance to Eliashib’s house. Eliashib was the high priest. "},{"num":21,"verse":"Next to Baruch, Meremoth repaired another part. He was the son of Uriah. Uriah was the son of Hakkoz. Meremoth repaired the part from the entrance to Eliashib’s house to the end of the house."},{"num":22,"verse":"Next to Meremoth, some priests from the surrounding area made repairs. "},{"num":23,"verse":"Next to them, Benjamin and Hasshub repaired the part of the wall that was in front of their house. Next to them, Azariah repaired the part that was beside his house. He was the son of Maaseiah. Maaseiah was the son of Ananiah. "},{"num":24,"verse":"Next to Azariah, Binnui made repairs on another part. Binnui was the son of Henadad. Binnui repaired the wall from Azariah’s house to the angle and the corner. "},{"num":25,"verse":"Palal worked across from the angle. He was the son of Uzai. Palal also worked across from the tower that was part of the upper palace. It was near the courtyard of the guard. Next to him, Pedaiah made some repairs. He was the son of Parosh. "},{"num":26,"verse":"The temple servants who lived on the hill of Ophel helped Pedaiah. They repaired the wall up to the part that was across from the Water Gate. It was toward the east and the palace tower. "},{"num":27,"verse":"Next to the temple servants, the men from Tekoa repaired another part. They made repairs from the large palace tower to the wall of Ophel."},{"num":28,"verse":"The priests made repairs above the Horse Gate. Each priest repaired the part of the wall that was in front of his own house. "},{"num":29,"verse":"Next to them, Zadok made repairs across from his house. He was the son of Immer. Next to Zadok, Shemaiah made some repairs. He was the son of Shekaniah. Shemaiah guarded the East Gate. "},{"num":30,"verse":"Next to him, Hananiah and Hanun repaired another part of the wall. Hananiah was the son of Shelemiah. Hanun was the sixth son of Zalaph. Next to Hananiah and Hanun, Meshullam made some repairs. He was the son of Berekiah. Meshullam repaired the part that was across from where he lived. "},{"num":31,"verse":"Next to him, Malkijah made some repairs. He made his living by working with gold. He repaired the wall up to the house of the temple servants and the traders. It was across from the Inspection Gate. He also repaired the wall as far as the room above the corner. "},{"num":32,"verse":"The traders and those who made their living by working with gold made some repairs. They repaired the wall from the room above the corner to the Sheep Gate."}]