[{"num":5,"verse":"Concerning the times and the seasons, brothers, you have no need that I write to you. "},{"num":2,"verse":"For you know perfectly that the day of the Lord will come like a thief in the night. "},{"num":3,"verse":"When they say, “Peace and safety!” then sudden destruction will come upon them as labor upon a woman with child, and they shall not escape."},{"num":4,"verse":"But you, brothers, are not in darkness so that this Day should overtake you as a thief. "},{"num":5,"verse":"You are all the sons of light and the sons of the day. We are not of the night nor of darkness. "},{"num":6,"verse":"Therefore let us not sleep as others do. But let us be alert and sober. "},{"num":7,"verse":"For those who sleep, sleep at night, and those who get drunk, are drunk at night. "},{"num":8,"verse":"But let us, who are of the day, be sober, putting on the breastplate of faith and love, and as a helmet, the hope of salvation. "},{"num":9,"verse":"For God has not appointed us to wrath, but to obtain salvation by our Lord Jesus Christ, "},{"num":10,"verse":"who died for us, so that whether we are awake or asleep, we should live together with Him. "},{"num":11,"verse":"So comfort yourselves together, and edify one another, just as you are doing."},{"header":"Final Exhortations and Greetings"},{"num":12,"verse":"We ask you, brothers, to acknowledge those who labor among you, and are appointed over you in the Lord, and instruct you. "},{"num":13,"verse":"Esteem them very highly in love for their work’s sake. And be at peace among yourselves. "},{"num":14,"verse":"Now we exhort you, brothers, warn those who are unruly, comfort the faint-hearted, support the weak, and be patient toward everyone. "},{"num":15,"verse":"See that no one renders evil for evil to anyone. But always seek to do good to one another and to all."},{"num":16,"verse":"Rejoice always. "},{"num":17,"verse":"Pray without ceasing. "},{"num":18,"verse":"In everything give thanks, for this is the will of God in Christ Jesus concerning you."},{"num":19,"verse":"Do not quench the Spirit. "},{"num":20,"verse":"Do not despise prophecies. "},{"num":21,"verse":"Examine all things. Firmly hold onto what is good. "},{"num":22,"verse":"Abstain from all appearances of evil."},{"num":23,"verse":"May the very God of peace sanctify you completely. And I pray to God that your whole spirit, soul, and body be preserved blameless unto the coming of our Lord Jesus Christ. "},{"num":24,"verse":"Faithful is He who calls you, who also will do it."},{"num":25,"verse":"Brothers, pray for us. "},{"num":26,"verse":"Greet all the brothers with a holy kiss. "},{"num":27,"verse":"I command you by the Lord that this letter be read to all the holy brothers."},{"num":28,"verse":"The grace of our Lord Jesus Christ be with you. Amen."}]