[{"header":"The Day of the Lord Is Coming"},{"num":5,"verse":"Brothers and sisters, we don’t have to write to you about times and dates. "},{"num":2,"verse":"You know very well how the day of the Lord will come. It will come like a thief in the night. "},{"num":3,"verse":"People will be saying that everything is peaceful and safe. Then suddenly they will be destroyed. It will happen like birth pains coming on a pregnant woman. None of the people will escape."},{"num":4,"verse":"Brothers and sisters, you are not in darkness. So that day should not surprise you as a thief would. "},{"num":5,"verse":"All of you are children of the light. You are children of the day. We don’t belong to the night. We don’t belong to the darkness. "},{"num":6,"verse":"So let us not be like the others. They are asleep. Instead, let us be wide awake and in full control of ourselves. "},{"num":7,"verse":"Those who sleep, sleep at night. Those who get drunk, get drunk at night. "},{"num":8,"verse":"But we belong to the day. So let us control ourselves. Let us put on our chest the armor of faith and love. Let us put on the hope of salvation like a helmet. "},{"num":9,"verse":"God didn’t choose us to receive his anger. He chose us to receive salvation because of what our Lord Jesus Christ has done. "},{"num":10,"verse":"Jesus died for us. Some will be alive when he comes. Others will be dead. Either way, we will live together with him. "},{"num":11,"verse":"So encourage one another with the hope you have. Build each other up. In fact, that’s what you are doing."},{"header":"Final Teachings"},{"num":12,"verse":"Brothers and sisters, we ask you to accept the godly leaders who work hard among you. They care for you in the Lord. They correct you. "},{"num":13,"verse":"Have a lot of respect for them. Love them because of what they do. Live in peace with one another. "},{"num":14,"verse":"Brothers and sisters, we are asking you to warn certain people. These people don’t want to work. Instead, they make trouble. We are also asking you to encourage those who have lost hope. Help those who are weak. Be patient with everyone. "},{"num":15,"verse":"Make sure that no one pays back one wrong act with another. Instead, always try to do what is good for each other and for everyone else."},{"num":16,"verse":"Always be joyful. "},{"num":17,"verse":"Never stop praying. "},{"num":18,"verse":"Give thanks no matter what happens. God wants you to thank him because you believe in Christ Jesus."},{"num":19,"verse":"Don’t try to stop what the Holy Spirit is doing. "},{"num":20,"verse":"Don’t treat prophecies as if they weren’t important. "},{"num":21,"verse":"But test all prophecies. Hold on to what is good. "},{"num":22,"verse":"Say no to every kind of evil."},{"num":23,"verse":"God is the God who gives peace. May he make you holy through and through. May your whole spirit, soul and body be kept free from blame. May you be without blame from now until our Lord Jesus Christ comes. "},{"num":24,"verse":"The God who has chosen you is faithful. He will do all these things."},{"num":25,"verse":"Brothers and sisters, pray for us."},{"num":26,"verse":"Greet all God’s people with a holy kiss."},{"num":27,"verse":"While the Lord is watching, here is what I command you. Have this letter read to all the brothers and sisters."},{"num":28,"verse":"May the grace of our Lord Jesus Christ be with you."}]