[{"num":5,"verse":"But as to the times and the seasons, brethren, you have no need to have anything written to you. "},{"num":2,"verse":"For you yourselves know well that the day of the Lord will come like a thief in the night. "},{"num":3,"verse":"When people say, “There is peace and security,” then sudden destruction will come upon them as travail comes upon a woman with child, and there will be no escape. "},{"num":4,"verse":"But you are not in darkness, brethren, for that day to surprise you like a thief. "},{"num":5,"verse":"For you are all sons of light and sons of the day; we are not of the night or of darkness. "},{"num":6,"verse":"So then let us not sleep, as others do, but let us keep awake and be sober. "},{"num":7,"verse":"For those who sleep sleep at night, and those who get drunk are drunk at night. "},{"num":8,"verse":"But, since we belong to the day, let us be sober, and put on the breastplate of faith and love, and for a helmet the hope of salvation. "},{"num":9,"verse":"For God has not destined us for wrath, but to obtain salvation through our Lord Jesus Christ, "},{"num":10,"verse":"who died for us so that whether we wake or sleep we might live with him. "},{"num":11,"verse":"Therefore encourage one another and build one another up, just as you are doing."},{"header":"Final Exhortations, Greetings, and Benediction"},{"num":12,"verse":"But we beseech you, brethren, to respect those who labor among you and are over you in the Lord and admonish you, "},{"num":13,"verse":"and to esteem them very highly in love because of their work. Be at peace among yourselves. "},{"num":14,"verse":"And we exhort you, brethren, admonish the idle, encourage the fainthearted, help the weak, be patient with them all. "},{"num":15,"verse":"See that none of you repays evil for evil, but always seek to do good to one another and to all. "},{"num":16,"verse":"Rejoice always, "},{"num":17,"verse":"pray constantly, "},{"num":18,"verse":"give thanks in all circumstances; for this is the will of God in Christ Jesus for you. "},{"num":19,"verse":"Do not quench the Spirit, "},{"num":20,"verse":"do not despise prophesying, "},{"num":21,"verse":"but test everything; hold fast what is good, "},{"num":22,"verse":"abstain from every form of evil."},{"num":23,"verse":"May the God of peace himself sanctify you wholly; and may your spirit and soul and body be kept sound and blameless at the coming of our Lord Jesus Christ. "},{"num":24,"verse":"He who calls you is faithful, and he will do it."},{"num":25,"verse":"Brethren, pray for us."},{"num":26,"verse":"Greet all the brethren with a holy kiss."},{"num":27,"verse":"I adjure you by the Lord that this letter be read to all the brethren."},{"num":28,"verse":"The grace of our Lord Jesus Christ be with you."}]