[{"num":10,"verse":"My soul is weary of my life: I will give free course to my complaint; I will speak in the bitterness of my soul."},{"num":2,"verse":"I will say unto +God, Do not condemn me; shew me wherefore thou strivest with me."},{"num":3,"verse":"Doth it please thee to oppress, that thou shouldest despise the work of thy hands, and shine upon the counsel of the wicked?"},{"num":4,"verse":"Hast thou eyes of flesh? or seest thou as man seeth?"},{"num":5,"verse":"Are thy days as the days of a mortal? are thy years as a man's days,"},{"num":6,"verse":"That thou searchest after mine iniquity, and inquirest into my sin;"},{"num":7,"verse":"Since thou knowest that I am not wicked, and that there is none that delivereth out of thy hand?"},{"num":8,"verse":"Thy hands have bound me together and made me as one, round about; yet dost thou swallow me up!"},{"num":9,"verse":"Remember, I beseech thee, that thou hast made me as clay, and wilt bring me into dust again."},{"num":10,"verse":"Hast thou not poured me out as milk, and curdled me like cheese?"},{"num":11,"verse":"Thou hast clothed me with skin and flesh, and knit me together with bones and sinews;"},{"num":12,"verse":"Thou hast granted me life and favour, and thy care hath preserved my spirit;"},{"num":13,"verse":"And these things didst thou hide in thy heart; I know that this was with thee."},{"num":14,"verse":"If I sinned, thou wouldest mark me, and thou wouldest not acquit me of mine iniquity."},{"num":15,"verse":"If I were wicked, woe unto me! and righteous, I will not lift up my head, being [so] full of shame, and beholding mine affliction;—"},{"num":16,"verse":"And it increaseth: thou huntest me as a fierce lion; and ever again thou shewest thy marvellous power upon me."},{"num":17,"verse":"Thou renewest thy witnesses before me and increasest thy displeasure against me; successions [of evil] and a time of toil are with me."},{"num":18,"verse":"And wherefore didst thou bring me forth out of the womb? I had expired, and no eye had seen me."},{"num":19,"verse":"I should be as though I had not been; I should have been carried from the womb to the grave."},{"num":20,"verse":"Are not my days few? cease then and let me alone, that I may revive a little,"},{"num":21,"verse":"Before I go, and never to return,—to the land of darkness and the shadow of death;"},{"num":22,"verse":"A land of gloom, as darkness itself; of the shadow of death, without any order, where the light is as thick darkness."}]