[{"num":10,"verse":"1 Job is weary of his life, and setteth out his fragility before God. 20 He desireth him to stay his hand. 22 A description of death."},{"num":1,"verse":"My soul is cut off though I live: I will leave my complaint upon myself, and will speak in the bitterness of my soul."},{"num":2,"verse":"I will say unto God, Condemn me not: show me, wherefore thou contendest with me."},{"num":3,"verse":"Thinkest thou it good to oppress me, and to cast off the labor of thine hands, and to favor the counsel of the wicked?"},{"num":4,"verse":"Hast thou carnal eyes? or dost thou see as man seeth?"},{"num":5,"verse":"Are thy days as man’s days? or thy years as the time of man,"},{"num":6,"verse":"That thou inquirest of mine iniquity, and searchest out my sin?"},{"num":7,"verse":"Thou knowest that I cannot do wickedly: for none can deliver me out of thine hand."},{"num":8,"verse":"Thine hands have made me, and fashioned me wholly round about, and wilt thou destroy me?"},{"num":9,"verse":"Remember, I pray thee, that thou hast made me as the clay, and wilt thou bring me into dust again?"},{"num":10,"verse":"Hast thou not poured me out as milk? and turned me to curds like cheese?"},{"num":11,"verse":"Thou hast clothed me with skin and flesh, and joined me together with bones and sinews."},{"num":12,"verse":"Thou hast given me life, and grace: and the visitation hath preserved my spirit."},{"num":13,"verse":"Though thou hast hid these things in thine heart, yet I know that it is so with thee."},{"num":14,"verse":"If I have sinned, then thou wilt straightly look unto me, and wilt not hold me guiltless of mine iniquity."},{"num":15,"verse":"If I have done wickedly, woe unto me: if I have done righteously, I will not lift up mine head, being full of confusion, because I see mine affliction."},{"num":16,"verse":"But let it increase: hunt thou me as a lion: return and show thyself marvelous upon me."},{"num":17,"verse":"Thou renewest thy plagues against me, and thou increasest thy wrath against me: changes and armies of sorrows are against me."},{"num":18,"verse":"Wherefore then hast thou brought me out of the womb? Oh that I had perished, and that none eye had seen me!"},{"num":19,"verse":"And that I were as I had not been, but brought from the womb to the grave!"},{"num":20,"verse":"Are not my days few? let him cease, and leave off from me, that I may take a little comfort,"},{"num":21,"verse":"Before I go and shall not return, even to the land of darkness and shadow of death:"},{"num":22,"verse":"Into a land, I say, dark as darkness itself, and into the shadow of death, where is none order, but the light is there as darkness."}]