[{"header":"Job Keeps On Talking"},{"num":10,"verse":"“I hate my life. I will be free in my complaining. I will show how bitter I am in my soul when I speak. "},{"num":2,"verse":"I will say to God, ‘Do not say that I am guilty and punish me. Let me know why You work against me. "},{"num":3,"verse":"Do You think it is right for You to make it hard for me, to turn away from the work of Your hands and favor the plans of the sinful? "},{"num":4,"verse":"Do You have eyes of flesh? Do You see as a man sees? "},{"num":5,"verse":"Are Your days as the days of man, or Your years as man’s years, "},{"num":6,"verse":"that You should look for my wrong-doing and my sin? "},{"num":7,"verse":"You know that I am not guilty, yet there is no one who can take me away from Your hand."},{"num":8,"verse":"‘Your hands put me together and made me, and now would You destroy me? "},{"num":9,"verse":"Remember that You have made me as clay. Would You turn me into dust again? "},{"num":10,"verse":"Did You not pour me out like milk and make me become hard like cheese? "},{"num":11,"verse":"You have given me clothing of skin and flesh, and have tied me together with bones and cord. "},{"num":12,"verse":"You have given me life and loving-kindness. Your care has kept my spirit alive. "},{"num":13,"verse":"Yet You have hidden these things in Your heart. I know that this is in Your thoughts. "},{"num":14,"verse":"If I sin, You would see me, and would not free me from my guilt. "},{"num":15,"verse":"If I am sinful, it would be bad for me! If I am right and good, I cannot lift my head for I am filled with shame and see all my trouble. "},{"num":16,"verse":"If I would lift up my head, You would hunt me like a lion. Again You would show Your power against me. "},{"num":17,"verse":"You would send new ones who would speak against me, and become more angry with me. You would send me more and more trouble."},{"num":18,"verse":"‘Why then did You let me be born? If only I had died and no one had seen me! "},{"num":19,"verse":"I should have been as if I had never lived, carried from my mother to the grave.’ "},{"num":20,"verse":"Are not my days few? Leave me alone, that I may find a little comfort "},{"num":21,"verse":"before I go to a place from which I will not return. I will go to the land of darkness and shadow. "},{"num":22,"verse":"It is the land of complete darkness and shadow and trouble, where the light is darkness.”"}]