[{"num":3,"verse":"Finally the actual construction of the Temple began. Its location was in Jerusalem at the top of Mount Moriah, where the Lord had appeared to Solomon’s father, King David, and where the threshing floor of Ornan the Jebusite had been. David had selected it as the site for the Temple. "},{"num":2,"verse":"The actual construction began on the seventeenth day of April in the fourth year of King Solomon’s reign."},{"num":3,"verse":"The foundation was ninety feet long and thirty feet wide. "},{"num":4,"verse":"A covered porch ran along the entire thirty-foot width of the Temple, with the inner walls and ceiling overlaid with pure gold! The roof was 180 feet high."},{"num":5,"verse":"The main part of the Temple was paneled with cypress wood, plated with pure gold, and engraved with palm trees and chains. "},{"num":6,"verse":"Beautiful jewels were inlaid into the walls to add to the beauty; the gold, by the way, was of the best, from Parvaim. "},{"num":7,"verse":"All the walls, beams, doors, and thresholds throughout the Temple were plated with gold, with Guardian Angels engraved on the walls."},{"num":8,"verse":"Within the Temple, at one end, was the most sacred room—the Holy of Holies—thirty feet square. This too was overlaid with the finest gold, valued at millions of dollars. "},{"num":9,"verse":"Twenty-six-ounce gold nails were used. The upper rooms were also plated with pure gold."},{"num":10,"verse":"Within the innermost room, the Holy of Holies, Solomon placed two sculptured statues of Guardian Angels and plated them with gold. "},{"num":11,"verse":"They stood on the floor facing the outer room, with wings stretched wing tip to wing tip across the room, from wall to wall. "},{"num":14,"verse":"Across the entrance to this room he placed a veil of blue and crimson finespun linen, decorated with Guardian Angels."},{"num":15,"verse":"At the front of the Temple were two pillars 52½ feet high, topped by a 7½-foot capital flaring out to the roof. "},{"num":16,"verse":"He made chains and placed them on top of the pillars, with 100 pomegranates attached to the chains. "},{"num":17,"verse":"Then he set up the pillars at the front of the Temple, one on the right and the other on the left. And he gave them names: Jachin (the one on the right), and Boaz (the one on the left)."}]