[{"header":"Solomon Builds the Temple in Jerusalem"},{"num":3,"verse":"Then Solomon began to build the House of Adonai in Jerusalem on Mount Moriah—where Adonai appeared to his father David—at the place that David prepared on the threshing floor of Ornan the Jebusite. "},{"num":2,"verse":"He began to build on the second day of the second month in the fourth year of his reign. "},{"num":3,"verse":"Now the foundation Solomon laid for the building of the House of God was 60 cubits long and 20 cubits wide, according to the old standard. "},{"num":4,"verse":"The porch in front of the House along its width was 20 cubits and its height was 120 cubits, and the inside was overlaid with pure gold. "},{"num":5,"verse":"He paneled the main hall with cypress wood, which he overlaid with fine gold and embossed on it palm trees and chains. "},{"num":6,"verse":"He adorned the House with precious stones and the gold he used was gold from Parvaim. "},{"num":7,"verse":"Furthermore He overlaid the beams, thresholds, walls and doors of the House with gold and carved cheruvim on the walls."},{"num":8,"verse":"He made the Holy of Holies, its length corresponding to the width of the House—20 cubits long and 20 cubits wide. He overlaid it with 600 talents of fine gold. "},{"num":9,"verse":"The weight of the nails was fifty shekels of gold. He also overlaid the upper rooms with gold. "},{"num":10,"verse":"Next he made two sculptured cheruvim in the Holy of Holies and overlaid them with gold. "},{"num":11,"verse":"The wingspan of the cheruvim was 20 cubits. One wing of the first cheruv was five cubits long and touched the wall of the House, while the other wing, also five cubits long, touched the wing of the other cheruv. "},{"num":12,"verse":"Similarly, one wing of the second cheruv was five cubits long and touched the wall of the House, while the other wing, also five cubits long, touched the wing of the other cheruv. "},{"num":13,"verse":"Thus the wingspan of these cheruvim was 20 cubits. They stood on their feet facing the main hall. "},{"num":14,"verse":"Furthermore, he made the veil of blue, purple, crimson yarn and fine linen with cheruvim worked into it."},{"num":15,"verse":"In the front of the House he made two pillars 35 cubits high, each with a capital on the top measuring five cubits. "},{"num":16,"verse":"He made interwoven chains for the inner Sanctuary and put them on top of the pillars. He also made 100 pomegranates and attached them to the chains. "},{"num":17,"verse":"He erected the pillars in front of the Temple, one to the south and the other to the north. The one to the south he named Jachin and the one to the north Boaz."}]