[{"header":"Jesus’ Authority Is Questioned"},{"num":20,"verse":"One day, as Jesus was teaching the people in the temple courts and preaching the good news, the chief priests and experts in the law came to him with the elders. "},{"num":2,"verse":"They asked him, “Tell us by what authority you are doing these things. Or who is the one who gave you this authority?”"},{"num":3,"verse":"He answered them, “I will also ask you one question. Tell me: "},{"num":4,"verse":"the baptism of John—was it from heaven or from men?”"},{"num":5,"verse":"They discussed it with one another, saying, “If we say, ‘From heaven,’ he will say, ‘Why did you not believe him?’ "},{"num":6,"verse":"But if we say, ‘From men,’ all the people will stone us, for they are convinced that John was a prophet.” "},{"num":7,"verse":"So they answered that they did not know where it was from."},{"num":8,"verse":"Jesus said to them, “Neither am I going to tell you by what authority I am doing these things.”"},{"header":"The Parable of the Wicked Tenants"},{"num":9,"verse":"He began to tell the people this parable: “A man planted a vineyard, leased it to some tenant farmers, and went away on a journey for a long time. "},{"num":10,"verse":"When it was the right time, he sent a servant to the tenants to collect his share of the fruit of the vineyard. But the tenant farmers beat the servant and sent him away empty-handed. "},{"num":11,"verse":"The man went ahead and sent yet another servant, but they also beat him, treated him shamefully, and sent him away empty-handed. "},{"num":12,"verse":"He then sent yet a third. They also wounded him and threw him out. "},{"num":13,"verse":"The owner of the vineyard said, ‘What should I do? I will send my son, whom I love. Perhaps they will respect him.’"},{"num":14,"verse":"“But when the tenant farmers saw him, they talked it over with one another. They said, ‘This is the heir. Let’s kill him, so that the inheritance will be ours.’ "},{"num":15,"verse":"They threw him out of the vineyard and killed him. So what will the owner of the vineyard do to them? "},{"num":16,"verse":"He will come and destroy those tenant farmers and give the vineyard to others.”"},{"num":17,"verse":"But he looked at them and said, “Then what about this that is written:"},{"num":18,"verse":"“Everyone who falls on that stone will be broken to pieces, and it will crush the one on whom it falls.”"},{"num":19,"verse":"That very hour the chief priests and the experts in the law began looking for a way to lay hands on him, because they knew he had spoken this parable against them. But they were afraid of the people."},{"header":"Paying Taxes to Caesar"},{"num":20,"verse":"They watched him carefully and sent spies, who pretended to be sincere, so that they could trap Jesus in something he said, and then deliver him up to the power and authority of the governor. "},{"num":21,"verse":"They questioned him, “Teacher, we know that you say and teach what is right and show no partiality to anyone, but you teach the way of God on the basis of the truth. "},{"num":22,"verse":"Is it right for us to pay taxes to Caesar or not?”"},{"num":23,"verse":"But he was aware of their deceit and said to them, "},{"num":24,"verse":"“Show me a denarius. Whose image and inscription are on it?”"},{"num":25,"verse":"He said to them, “Then give to Caesar the things that are Caesar’s, and to God the things that are God’s.”"},{"num":26,"verse":"They were not able to trap him in what he said in the presence of the people. They were amazed at his answer and became silent."},{"header":"The God of the Living"},{"num":27,"verse":"Some of the Sadducees (who say there is no resurrection) came to him. "},{"num":28,"verse":"They asked him a question, “Teacher, Moses wrote for us that if a man’s brother dies leaving a wife but no children, his brother should take the wife and raise up children for his brother. "},{"num":29,"verse":"So there were seven brothers. The first took a wife and died childless. "},{"num":30,"verse":"The second took her as a wife, "},{"num":31,"verse":"and so did the third, and in the same way the seven died and left no children. "},{"num":32,"verse":"Finally the woman died too. "},{"num":33,"verse":"So in the resurrection, whose wife will she be? For the seven had her as a wife.”"},{"num":34,"verse":"Jesus said to them, “The people of this age marry and are given in marriage. "},{"num":35,"verse":"But those who are considered worthy to experience that age and the resurrection from the dead neither marry nor are given in marriage. "},{"num":36,"verse":"In fact, they cannot die any more, for they are like the angels. They are sons of God, because they are sons of the resurrection."},{"num":37,"verse":"“Even Moses showed in the account about the burning bush that the dead are raised, when he called the Lord: ‘The God of Abraham, the God of Isaac, and the God of Jacob.’ "},{"num":38,"verse":"He is not the God of the dead, but of the living, for all are alive to him.”"},{"num":39,"verse":"Some of the experts in the law answered, “Teacher, you have spoken well.” "},{"num":40,"verse":"Then they no longer dared to ask him anything."},{"header":"David’s Son and David’s Lord"},{"num":41,"verse":"Jesus said to them, “How is it that they say that the Christ is David’s son? "},{"num":42,"verse":"David himself says in the book of Psalms:"},{"num":44,"verse":"“So David calls him ‘Lord.’ Then how is he his son?”"},{"header":"Beware"},{"num":45,"verse":"While all the people were listening, Jesus said to his disciples, "},{"num":46,"verse":"“Beware of the experts in the law, who like to walk around in long robes and love greetings in the marketplaces, the best seats in the synagogues, and the places of honor at banquets. "},{"num":47,"verse":"They devour widows’ houses and offer long prayers to look good. They will receive greater condemnation.”"}]