[[],[{"type":"header","content":"The Authority of Jesus Challenged"},{"type":"prose","content":"One day, as Jesus was teaching the people in the temple and preaching the gospel, the chief priests and the scribes with the elders came up"}],[{"type":"prose","content":"and said to him, “Tell us by what authority you do these things, or who it is that gave you this authority.”"}],[{"type":"prose","content":"He answered them, "}],[{"type":"prose","content":"And they discussed it with one another, saying, “If we say, ‘From heaven,’ he will say, ‘Why did you not believe him?’"}],[{"type":"prose","content":"But if we say, ‘From man,’ all the people will stone us to death, for they are convinced that John was a prophet.”"}],[{"type":"prose","content":"So they answered that they did not know where it came from."}],[{"type":"prose","content":"And Jesus said to them, "},{"type":"header","content":"The Parable of the Wicked Tenants"}],[{"type":"prose","content":"And he began to tell the people this parable:  When they heard this, they said, “Surely not!”"}],[{"type":"prose","content":"But he looked directly at them and said, "},{"type":"header","content":"Paying Taxes to Caesar"}],[{"type":"prose","content":"The scribes and the chief priests sought to lay hands on him at that very hour, for they perceived that he had told this parable against them, but they feared the people."}],[{"type":"prose","content":"So they watched him and sent spies, who pretended to be sincere, that they might catch him in something he said, so as to deliver him up to the authority and jurisdiction of the governor."}],[{"type":"prose","content":"So they asked him, “Teacher, we know that you speak and teach rightly, and show no partiality, but truly teach the way of God."}],[{"type":"prose","content":"Is it lawful for us to give tribute to Caesar, or not?”"}],[{"type":"prose","content":"But he perceived their craftiness, and said to them, They said, “Caesar's.”"}],[{"type":"prose","content":"He said to them, "}],[{"type":"prose","content":"And they were not able in the presence of the people to catch him in what he said, but marveling at his answer they became silent."},{"type":"header","content":"Sadducees Ask About the Resurrection"}],[{"type":"prose","content":"There came to him some Sadducees, those who deny that there is a resurrection,"}],[{"type":"prose","content":"and they asked him a question, saying, “Teacher, Moses wrote for us that if a man's brother dies, having a wife but no children, the man must take the widow and raise up offspring for his brother."}],[{"type":"prose","content":"Now there were seven brothers. The first took a wife, and died without children."}],[{"type":"prose","content":"And the second"}],[{"type":"prose","content":"and the third took her, and likewise all seven left no children and died."}],[{"type":"prose","content":"Afterward the woman also died."}],[{"type":"prose","content":"In the resurrection, therefore, whose wife will the woman be? For the seven had her as wife.”"}],[{"type":"prose","content":"And Jesus said to them, "}],[{"type":"prose","content":"Then some of the scribes answered, “Teacher, you have spoken well.”"}],[{"type":"prose","content":"For they no longer dared to ask him any question."},{"type":"header","content":"Whose Son Is the Christ?"}],[{"type":"prose","content":"But he said to them, "},{"type":"header","content":"Beware of the Scribes"}],[{"type":"prose","content":"And in the hearing of all the people he said to his disciples,"}]]