[{"header":"The Question of Jesus’ Authority(A)"},{"num":20,"verse":"One day, as He taught the people in the temple and preached the gospel, the chief priests and the scribes with the elders came up to Him, "},{"num":2,"verse":"and said to Him, “Tell us, by what authority are You doing these things? Who is he who gave You this authority?”"},{"num":3,"verse":"He answered them, “I will also ask you one thing. Answer Me: "},{"num":4,"verse":"Was the baptism of John from heaven or from men?”"},{"num":5,"verse":"They debated with themselves, saying, “If we say, ‘From heaven,’ He will say, ‘Why then did you not believe him?’ "},{"num":6,"verse":"But if we say, ‘From men,’ all the people will stone us, for they are persuaded that John was a prophet.”"},{"num":7,"verse":"So they answered that they did not know where it was from."},{"num":8,"verse":"Jesus said to them, “Neither will I tell you by what authority I do these things.”"},{"header":"The Parable of the Vineyard and the Vinedressers(B)"},{"num":9,"verse":"He began to tell the people this parable: “A man planted a vineyard, and leased it to vinedressers, and went to a distant country for a long time. "},{"num":10,"verse":"At harvest time he sent a servant to the vinedressers so they might give him some fruit of the vineyard. But the vinedressers beat him and sent him away empty-handed. "},{"num":11,"verse":"Again, he sent another servant. But they beat him also, and treated him shamefully, and sent him away empty-handed. "},{"num":12,"verse":"Once again, he sent a third. And they wounded him also and drove him out."},{"num":13,"verse":"“Then the owner of the vineyard said, ‘What shall I do? I will send my beloved son. Perhaps they will respect him when they see him.’"},{"num":14,"verse":"“But when the vinedressers saw him, they debated among themselves, saying, ‘This is the heir. Come, let us kill him, that the inheritance may be ours.’ "},{"num":15,"verse":"So they drove him out of the vineyard and killed him."},{"num":16,"verse":"He will come and kill these vinedressers and will give the vineyard to others.”"},{"num":17,"verse":"He looked at them and said, “What then is this that is written:"},{"num":18,"verse":"Whoever falls on that stone will be broken. But he on whom it falls will be crushed to powder.”"},{"num":19,"verse":"The chief priests and the scribes tried to lay their hands on Him that same hour, but they feared the people. For they perceived that He had told this parable against them."},{"header":"The Question of Paying Taxes(C)"},{"num":20,"verse":"They watched Him and sent out spies who pretended to be righteous men, that they might seize Him in His words to hand Him over to the power and authority of the governor. "},{"num":21,"verse":"So they asked Him, “Teacher, we know that You speak and teach rightly. And You do not show partiality, but You truly teach the way of God. "},{"num":22,"verse":"Is it lawful for us to pay taxes to Caesar, or not?”"},{"num":23,"verse":"He perceived their craftiness and said to them, “Why do you test Me? "},{"num":24,"verse":"Show Me a denarius. Whose image and inscription does it have?”"},{"num":25,"verse":"He said to them, “Then render to Caesar what is Caesar’s, and to God what is God’s.”"},{"num":26,"verse":"They could not catch Him in His words before the people. And they marveled at His answer and were silent."},{"header":"The Question About the Resurrection(D)"},{"num":27,"verse":"Some of the Sadducees, who deny that there is any resurrection, came to Him and asked Him, "},{"num":28,"verse":"“Teacher, Moses wrote for us that if a man’s brother dies, having a wife but no children, then this man should take the wife and raise up children for his brother. "},{"num":29,"verse":"Now there were seven brothers. The first took a wife and died childless. "},{"num":30,"verse":"The second took her as wife, and he died childless. "},{"num":31,"verse":"And then the third took her, and in like manner, all seven died and left no children. "},{"num":32,"verse":"Last of all, the woman died also. "},{"num":33,"verse":"Therefore in the resurrection whose wife will she be? For the seven had her as a wife.”"},{"num":34,"verse":"Jesus answered them, “The sons of this age marry and are given in marriage. "},{"num":35,"verse":"But those who are counted worthy to attain that age, and the resurrection from the dead, neither marry nor are given in marriage. "},{"num":36,"verse":"For they cannot die any more, for they are equal to the angels and are the sons of God, being sons of the resurrection. "},{"num":37,"verse":"Now, at the bush, even Moses pointed out that the dead are raised when he called the Lord ‘the God of Abraham, and the God of Isaac, and the God of Jacob.’ "},{"num":38,"verse":"For He is not the God of the dead, but of the living. For to Him all live.”"},{"num":39,"verse":"Some of the scribes said, “Teacher, You have spoken well.” "},{"num":40,"verse":"After that they dared not ask Him any question at all."},{"header":"The Question About David’s Son(E)"},{"num":41,"verse":"Then Jesus said to them, “How do they say that Christ is David’s Son? "},{"num":42,"verse":"David himself says in the Book of Psalms,"},{"num":44,"verse":"David therefore calls Him ‘Lord.’ How is He then his Son?”"},{"header":"The Denouncing of the Scribes(F)"},{"num":45,"verse":"Then as all the people heard, He said to His disciples, "},{"num":46,"verse":"“Beware of the scribes who desire to walk in long robes and who love greetings in the marketplaces and the prominent seats in the synagogues and the seats of honor at banquets, "},{"num":47,"verse":"who devour widows’ houses and for a pretense make long prayers. They will receive greater condemnation.”"}]