[[],[{"type":"header","content":"Jesus’ Authority Questioned"},{"type":"prose","content":"On one of the days while He was teaching the people in the temple and preaching the gospel, the chief priests and the scribes with the elders confronted ,"}],[{"type":"prose","content":"and they declared, saying to Him, “Tell us by what authority You are doing these things, or who is the one who gave You this authority?”"}],[{"type":"prose","content":"But He replied to them, "}],[{"type":"prose","content":"They discussed among themselves, saying, “If we say, ‘From heaven,’ He will say, ‘Why did you not believe him?’"}],[{"type":"prose","content":"But if we say, ‘From men,’ all the people will stone us to death, since they are convinced that John was a prophet.”"}],[{"type":"prose","content":"And  they answered that they did not know where  from."}],[{"type":"prose","content":"And Jesus said to them, "},{"type":"header","content":"Parable of the Vine-growers"}],[{"type":"prose","content":"But He began to tell the people this parable:  However, when they heard , they said, “May it never happen!”"}],[{"type":"prose","content":"But Jesus looked at them and said, "},{"type":"poetry","content":""},{"type":"header","content":"Paying Taxes to Caesar"}],[{"type":"prose","content":"The scribes and the chief priests tried to lay hands on Him that very hour, and  they feared the people; for they were aware that He had spoken this parable against them."}],[{"type":"prose","content":"And  they watched Him closely, and sent spies who pretended to be righteous, in order that they might catch Him in  statement, so that they  hand Him over to the jurisdiction and authority of the governor."}],[{"type":"prose","content":"And  questioned Him, saying, “Teacher, we know that You speak and teach correctly, and You are not partial to anyone, but You teach the way of God on the basis of truth."}],[{"type":"prose","content":"Is it permissible for us to pay taxes to Caesar, or not?”"}],[{"type":"prose","content":"But He saw through their trickery and said to them, They said, “Caesar’s.”"}],[{"type":"prose","content":"And He said to them, "}],[{"type":"prose","content":"And they were unable to catch Him in a statement in the presence of the people; and they were amazed at His answer, and said nothing."},{"type":"header","content":"Is There a Resurrection?"}],[{"type":"prose","content":"Now some of the Sadducees (who maintain that there is no resurrection) came to Him,"}],[{"type":"prose","content":"and they questioned Him, saying, “Teacher, Moses wrote for us that if a man’s brother dies, leaving a wife, and he is childless, that his brother is to marry the wife and raise up children for his brother."}],[{"type":"prose","content":"So then, there were seven brothers; and the first took a wife and died childless;"}],[{"type":"prose","content":"and the second"}],[{"type":"prose","content":"and the third married her; and in the same way all seven died, leaving no children."}],[{"type":"prose","content":"Finally the woman also died."}],[{"type":"prose","content":"Therefore, in the resurrection, which one’s wife does the woman become? For all seven married her.”"}],[{"type":"prose","content":"Jesus said to them, "}],[{"type":"prose","content":"Some of the scribes answered and said, “Teacher, You have spoken well.”"}],[{"type":"prose","content":"For they did not have the courage to question Him any longer about anything."}],[{"type":"prose","content":"But He said to them, "},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"prose","content":"And while all the people were listening, He said to the disciples,"}]]