[{"header":"The Authority of Jesus Is Questioned"},{"num":20,"verse":"One day Jesus was teaching the people in the temple courtyard. He was announcing the good news to them. The chief priests and the teachers of the law came up to him. The elders came with them. "},{"num":2,"verse":"“Tell us by what authority you are doing these things,” they all said. “Who gave you this authority?”"},{"num":3,"verse":"Jesus replied, “I will also ask you a question. Tell me, "},{"num":4,"verse":"was John’s baptism from heaven? Or did it come from people?”"},{"num":5,"verse":"They talked to one another about it. They said, “If we say, ‘From heaven,’ he will ask, ‘Why didn’t you believe him?’ "},{"num":6,"verse":"But if we say, ‘From people,’ all the people will throw stones at us and kill us. They believe that John was a prophet.”"},{"num":7,"verse":"So they answered Jesus, “We don’t know where John’s baptism came from.”"},{"num":8,"verse":"Jesus said, “Then I won’t tell you by what authority I am doing these things either.”"},{"header":"The Story of the Renters"},{"num":9,"verse":"Jesus went on to tell the people a story. “A man planted a vineyard,” he said. “He rented it out to some farmers. Then he went away for a long time. "},{"num":10,"verse":"At harvest time he sent a slave to the renters. They were supposed to give him some of the fruit of the vineyard. But the renters beat the slave. Then they sent him away with nothing. "},{"num":11,"verse":"So the man sent another slave. They beat that one and treated him badly. They also sent him away with nothing. "},{"num":12,"verse":"The man sent a third slave. The renters wounded him and threw him out."},{"num":13,"verse":"“Then the owner of the vineyard said, ‘What should I do? I have a son, and I love him. I will send him. Maybe they will respect him.’"},{"num":14,"verse":"“But when the renters saw the son, they talked the matter over. ‘This is the one who will receive all the owner’s property someday,’ they said. ‘Let’s kill him. Then everything will be ours.’ "},{"num":15,"verse":"So they threw him out of the vineyard. And they killed him."},{"num":16,"verse":"He will come and kill them. He will give the vineyard to others.”"},{"num":17,"verse":"Jesus looked right at them and said, “Here is something I want you to explain the meaning of. It is written,"},{"num":18,"verse":"Everyone who falls on that stone will be broken to pieces. But the stone will crush anyone it falls on.”"},{"num":19,"verse":"The teachers of the law and the chief priests looked for a way to arrest Jesus at once. They knew he had told that story against them. But they were afraid of the people."},{"header":"Is It Right to Pay the Royal Tax to Caesar?"},{"num":20,"verse":"The religious leaders sent spies to keep a close watch on Jesus. The spies pretended to be sincere. They hoped they could trap Jesus with something he would say. Then they could hand him over to the power and authority of the governor. "},{"num":21,"verse":"So the spies questioned Jesus. “Teacher,” they said, “we know that you speak and teach what is right. We know you don’t favor one person over another. You teach the way of God truthfully. "},{"num":22,"verse":"Is it right for us to pay taxes to Caesar or not?”"},{"num":23,"verse":"Jesus saw they were trying to trick him. So he said to them, "},{"num":24,"verse":"“Show me a silver coin. Whose picture and words are on it?”"},{"num":25,"verse":"He said to them, “Then give back to Caesar what belongs to Caesar. And give back to God what belongs to God.”"},{"num":26,"verse":"They were not able to trap him with what he had said there in front of all the people. Amazed by his answer, they became silent."},{"header":"Marriage When the Dead Rise"},{"num":27,"verse":"The Sadducees do not believe that people rise from the dead. Some of them came to Jesus with a question. "},{"num":28,"verse":"“Teacher,” they said, “Moses wrote for us about a man’s brother who dies. Suppose the brother leaves a wife but has no children. Then the man must marry the widow. He must provide children to carry on his dead brother’s name. "},{"num":29,"verse":"There were seven brothers. The first one married a woman. He died without leaving any children. "},{"num":30,"verse":"The second one married her. "},{"num":31,"verse":"And then the third one married her. One after another, the seven brothers married her. They all died. None left any children. "},{"num":32,"verse":"Finally, the woman died too. "},{"num":33,"verse":"Now then, when the dead rise, whose wife will she be? All seven brothers were married to her.”"},{"num":34,"verse":"Jesus replied, “People in this world get married. And their parents give them to be married. "},{"num":35,"verse":"But it will not be like that when the dead rise. Those who are considered worthy to take part in the world to come won’t get married. And their parents won’t give them to be married. "},{"num":36,"verse":"They can’t die anymore. They are like the angels. They are God’s children. They will be given a new form of life when the dead rise. "},{"num":37,"verse":"Remember the story of Moses and the burning bush. Even Moses showed that the dead rise. The Lord said to him, ‘I am the God of Abraham. I am the God of Isaac. And I am the God of Jacob.’ (Exodus 3:6) "},{"num":38,"verse":"He is not the God of the dead. He is the God of the living. In his eyes, everyone is alive.”"},{"num":39,"verse":"Some of the teachers of the law replied, “You have spoken well, teacher!” "},{"num":40,"verse":"And no one dared to ask him any more questions."},{"header":"Whose Son Is the Messiah?"},{"num":41,"verse":"Jesus said to them, “Why do people say that the Messiah is the son of David? "},{"num":42,"verse":"David himself says in the Book of Psalms,"},{"num":44,"verse":"David calls him ‘Lord.’ So how can he be David’s son?”"},{"header":"Warning Against the Teachers of the Law"},{"num":45,"verse":"All the people were listening. Jesus said to his disciples, "},{"num":46,"verse":"“Watch out for the teachers of the law. They like to walk around in long robes. They love to be greeted with respect in the market. They love to have the most important seats in the synagogues. They also love to have the places of honor at banquets. "},{"num":47,"verse":"They take over the houses of widows. They say long prayers to show off. God will punish these men very much.”"}]