[[],[{"type":"header","content":"The Authority of Jesus Challenged"},{"type":"prose","content":"One day as Jesus was teaching the people and preaching the Good News in the Temple, the leading priests, the teachers of religious law, and the elders came up to him."}],[{"type":"prose","content":"They demanded, “By what authority are you doing all these things? Who gave you the right?”"}],[{"type":"prose","content":" he replied."}],[],[{"type":"prose","content":"They talked it over among themselves. “If we say it was from heaven, he will ask why we didn’t believe John."}],[{"type":"prose","content":"But if we say it was merely human, the people will stone us because they are convinced John was a prophet.”"}],[{"type":"prose","content":"So they finally replied that they didn’t know."}],[{"type":"prose","content":"And Jesus responded, "},{"type":"header","content":"Parable of the Evil Farmers"}],[{"type":"prose","content":"Now Jesus turned to the people again and told them this story: "}],[],[],[],[],[],[{"type":"prose","content":" Jesus asked."}],[{"type":"prose","content":"“How terrible that such a thing should ever happen,” his listeners protested."}],[{"type":"prose","content":"Jesus looked at them and said, "}],[],[{"type":"prose","content":"The teachers of religious law and the leading priests wanted to arrest Jesus immediately because they realized he was telling the story against them—they were the wicked farmers. But they were afraid of the people’s reaction."},{"type":"header","content":"Taxes for Caesar"}],[{"type":"prose","content":"Watching for their opportunity, the leaders sent spies pretending to be honest men. They tried to get Jesus to say something that could be reported to the Roman governor so he would arrest Jesus."}],[{"type":"prose","content":"“Teacher,” they said, “we know that you speak and teach what is right and are not influenced by what others think. You teach the way of God truthfully."}],[{"type":"prose","content":"Now tell us—is it right for us to pay taxes to Caesar or not?”"}],[{"type":"prose","content":"He saw through their trickery and said,"}],[{"type":"prose","content":"“Caesar’s,” they replied."}],[{"type":"prose","content":" he said, "}],[{"type":"prose","content":"So they failed to trap him by what he said in front of the people. Instead, they were amazed by his answer, and they became silent."},{"type":"header","content":"Discussion about Resurrection"}],[{"type":"prose","content":"Then Jesus was approached by some Sadducees—religious leaders who say there is no resurrection from the dead."}],[{"type":"prose","content":"They posed this question: “Teacher, Moses gave us a law that if a man dies, leaving a wife but no children, his brother should marry the widow and have a child who will carry on the brother’s name."}],[{"type":"prose","content":"Well, suppose there were seven brothers. The oldest one married and then died without children."}],[{"type":"prose","content":"So the second brother married the widow, but he also died."}],[{"type":"prose","content":"Then the third brother married her. This continued with all seven of them, who died without children."}],[{"type":"prose","content":"Finally, the woman also died."}],[{"type":"prose","content":"So tell us, whose wife will she be in the resurrection? For all seven were married to her!”"}],[{"type":"prose","content":"Jesus replied, "}],[],[],[],[],[{"type":"prose","content":"“Well said, Teacher!” remarked some of the teachers of religious law who were standing there."}],[{"type":"prose","content":"And then no one dared to ask him any more questions."},{"type":"header","content":"Whose Son Is the Messiah?"}],[{"type":"prose","content":"Then Jesus presented them with a question.  he asked, "}],[],[],[{"type":"prose","content":"Then, with the crowds listening, he turned to his disciples and said,"}],[],[]]