[{"num":20,"verse":"And it happened in one of those days, as he taught the people in the temple and preached the gospel, the high priests and the scribes came with the elders "},{"num":2,"verse":"and spoke to him, saying, Tell us by what authority you do these things. Or who is it that gave you this authority? "},{"num":3,"verse":"He answered and said to them, I also will ask you a question, and answer me. "},{"num":4,"verse":"The baptism of John: was it from heaven, or of men?"},{"num":5,"verse":"And they thought within themselves, saying, If we say from heaven, he will say, Why then did you not believe him? "},{"num":6,"verse":"But if we say of men, all the people will stone us, because they are persuaded that John is a prophet. "},{"num":7,"verse":"And they answered that they did not know where it was from."},{"num":8,"verse":"And Jesus said to them, Neither will I tell you by what authority I do these things."},{"num":9,"verse":"Then he began and put forth to the people this similitude: A certain man planted a vineyard and let it out to farmers, and went himself into a far country for a great season. "},{"num":10,"verse":"And when the time came, he sent a servant to his tenants, so that they would give him some of the fruits of the vineyard. But the tenants beat him, and sent him away empty-handed. "},{"num":11,"verse":"And again he sent yet another servant. And they beat him and grievously used him also, and sent him away empty-handed. "},{"num":12,"verse":"Moreover he sent a third too, and him they wounded and cast out."},{"num":13,"verse":"Then said the lord of the vineyard, What shall I do? I will send my dear son; him perhaps they will respect, when they see him. "},{"num":14,"verse":"But when the farmers saw him, they thought in themselves, saying, This is the heir; come, let us kill him so that the inheritance can be ours. "},{"num":15,"verse":"And they cast him out of the vineyard and killed him. Now, what will the lord of the vineyard do to them? "},{"num":16,"verse":"He will come and destroy these farmers, and will let out his vineyard to others."},{"num":17,"verse":"And he looked upon them and said, What then does this mean that is written: The stone that the builders refused, the same is made the head cornerstone; "},{"num":18,"verse":"whosoever stumbles at that stone will be broken, but on whomever it falls, it will grind him to powder?"},{"num":19,"verse":"And the high priests and the scribes in that same hour went about to lay hands on him, but they feared the people. For they perceived that he had spoken this similitude against them."},{"num":20,"verse":"And they watched him, and sent forth spies who would pretend to be sincere, to take him in his words, and to deliver him to the power and authority of the governor. "},{"num":21,"verse":"And they asked him, saying, Teacher, we know that you say and teach right, and do not consider any man’s degree, but teach the way of God truly. "},{"num":22,"verse":"Is it lawful for us to pay tribute to Caesar, or no?"},{"num":23,"verse":"He perceived their craftiness and said to them, Why do you bait me? "},{"num":24,"verse":"Show me a denarius. Whose image and superscription does it have?"},{"num":25,"verse":"And he said to them, Give then to Caesar that which belongs to Caesar, and to God that which belongs to God."},{"num":26,"verse":"And they could not reprove his saying before the people. But they marvelled at his answer, and held their peace."},{"num":27,"verse":"Then there came to him certain of the Sadducees, who deny that there is any resurrection. "},{"num":28,"verse":"And they asked him, saying, Teacher, Moses wrote to us that if any man’s brother dies, leaving a wife but no issue, then his brother should take his wife and raise up seed for his brother. "},{"num":29,"verse":"There were seven brethren, and the first took a wife, and died without children. "},{"num":30,"verse":"And the second took the wife, but he died childless. "},{"num":31,"verse":"And the third took her, and so on likewise the rest of the seven, leaving no children behind them, and died. "},{"num":32,"verse":"Last of all, the woman died also. "},{"num":33,"verse":"Now at the resurrection, whose wife will she be of the brothers? For seven had her as wife."},{"num":34,"verse":"Jesus answered and said to them, The children of this world marry and are married, "},{"num":35,"verse":"but those who will be made worthy to enjoy that world, and the resurrection from death, neither marry, nor are married, "},{"num":36,"verse":"nor yet can die any more. For they are like the angels, and are the sons of God, inasmuch as they are the children of the resurrection. "},{"num":37,"verse":"And that the dead shall rise again, even Moses signified in his account of the bush, when he calls the Lord the God of Abraham, and the God of Isaac, and the God of Jacob. "},{"num":38,"verse":"For he is not the God of the dead, but of the living. For all live in him."},{"num":39,"verse":"Then certain of the Pharisees answered and said, Teacher, you have well said. "},{"num":40,"verse":"And after that they dared not ask him any question at all."},{"num":41,"verse":"Then he said to them, How is it they say that Christ is David’s son? "},{"num":42,"verse":"And David himself says in the book of the Psalms, The Lord said to my Lord, Sit on my right hand, "},{"num":43,"verse":"till I make your enemies your footstool. "},{"num":44,"verse":"Seeing David calls him Lord, how is he then his son?"},{"num":45,"verse":"Then, in the hearing of all the people, Jesus said to his disciples, "},{"num":46,"verse":"Beware of the scribes, who desire to go around in long clothing, and love greetings in the markets, the highest seats in the synagogues, and the places of honour at feasts; "},{"num":47,"verse":"who devour widows’ houses, and that under a colour of long praying. The same shall receive greater damnation."}]