[{"num":20,"verse":"And it came about on one of the yamim Rebbe, Melech HaMoshiach was saying shiurim to HaAm (the People) in the Beis Hamikdash and was preaching the Besuras HaGeulah, the Rashei Hakohanim and the Sofrim with the Ziknei HaAm stood by;"},{"num":2,"verse":"They spoke, saying to him, Tell us by what shlita (authority) you do these things, or who is the one having given to you this shlita?"},{"num":3,"verse":"In reply, Rebbe, Melech HaMoshiach said to them, I will also confront you will a she’elah, and you tell me:"},{"num":4,"verse":"The tevilah of teshuva of Yochanan—was it from Shomayim or from Bnei Adam?"},{"num":5,"verse":"And they reasoned to themselves saying, If we say, from Shomayim, he will say, why did you not believe him?"},{"num":6,"verse":"But if we say, from Bnei Adam, HaAm (the People) all will subject us to sequilah (stoning), for HaAm Yisroel are all convinced that Yochanan is a navi."},{"num":7,"verse":"And they answered that they did not have daas of the origin of the tevilah of teshuva of Yochanan."},{"num":8,"verse":"And Rebbe Melech HaMoshiach said to them, Neither am I telling you by what shlita (authority) I do these things."},{"num":9,"verse":"And he began to tell this mashal to HaAm Yisroel. A certain ish planted a kerem and leased it to koremim (vine keepers) and he went away for a long time. [YESHAYAH 5:1-7]"},{"num":10,"verse":"And in season he sent to the koremim (vine keepers) an eved (servant) that from the pri of the kerem they will give to him. But the koremim (vine keepers) sent the eved away empty, having beaten him."},{"num":11,"verse":"And he proceeded to send another eved. But him also, when they had beaten and dishonored him, they sent him away empty."},{"num":12,"verse":"And he proceeded to send an eved shlishi (a third servant). And also this one, having wounded, they threw out."},{"num":13,"verse":"And the Adon of the kerem, said, What should I do? I will send Beni Ahuvi. Perhaps this one they will respect."},{"num":14,"verse":"But having seen him, the koremim (vine keepers) were reasoning with one another saying, This one is the Bechor, the heir. Let us kill him, that the bechorah may become ours."},{"num":15,"verse":"And having driven him outside the kerem, they killed him. What then will the Baal HaKerem do to them?"},{"num":16,"verse":"He will come and will destroy these koremim (vine keepers) and will give the kerem to others. And having heard this, HaAm Yisroel said, Chas vShalom!"},{"num":17,"verse":"But having looked at them, Rebbe, Melech HaMoshiach said, What then is this which has been written: EVEN MAASU HAYTAH LEROSH PINAH (The Stone they rejected became the capstone)? [TEHILLIM 118:22]"},{"num":18,"verse":"Everyone having fallen upon that even (stone) will be DAKU (broken into pieces, DANIEL 2:34), and upon whomever it falls, it will crush him [YESHAYAH 8:14,15; DANIEL 2:34f]."},{"num":19,"verse":"And the Sofrim and the Rashei Hakohenim sought to lay their hands upon him in the same hour, but they were afraid of HaAm Yisroel, for they knew that he spoke this mashal (parable) against them."},{"num":20,"verse":"And having watched carefully, they sent spies pretending themselves to be tzaddikim, that they might catch him in his dvar, so as to deliver him to the rulers and the manhigim under the Moshel (Governor)."},{"num":21,"verse":"And they set a she’elah (question) before him, saying, Rabbi, we have daas that you speak beemes in the shiurim you say and you show no deference toward anyone, but on the basis of HaEmes you give torah about HaDerech Hashem."},{"num":22,"verse":"Is it mutar for us to pay tax to Caesar or not?"},{"num":23,"verse":"But having noticed the ORMAH (cunning, craftiness, BERESHIS 3:1) in their manner, Rebbe, Melech HaMoshiach said to them,"},{"num":24,"verse":"Show me a denarius. Whose demut (likeness) has it? And whose inscription? And they said, Caesar’s."},{"num":25,"verse":"And he said to them, Then give the things of Caesar to Caesar and the things of Hashem to Hashem."},{"num":26,"verse":"And they were not able to catch him in his dvar before the people and, having been mishpoyel (marveled) at his teshuva (answer), they were silent."},{"num":27,"verse":"And some of the Tzedukim—the Tzedukim are the ones speaking against the Techiyas HaMesim, who say there is none—approached Rebbe, Melech HaMoshiach. They set a she’elah (question) before him,"},{"num":28,"verse":"Saying, Rabbi, Moshe Rabbenu laid it down in writing to us, if someone’s ach dies and has an isha, and UVEN EIN LO (and there is no son to him), that he should take the almanah of his ach and he should raise up a zera (seed) to his ach. [Dt 25:5]"},{"num":29,"verse":"Now there were shiva achim. And the first took an isha, and died UVEN EIN LO (and there is no son to him)."},{"num":30,"verse":"And the second took her to be his isha, and he died childless."},{"num":31,"verse":"And the third took her; and likewise also the seventh did not leave behind a ben and they all died."},{"num":32,"verse":"And lemaskana (finally) the isha died."},{"num":33,"verse":"The isha, then, in the Techiyas HaMesim, of which of them does she become the wife? For shiva had her as isha (wife)."},{"num":34,"verse":"And Rebbe Melech HaMoshiach said to them, The banim of the Olam Hazeh marry and are given in marriage:"},{"num":35,"verse":"But the ones having been considered worthy to attain to the Olam HaBah and the Techiyas HaMesim neither marry nor are given in marriage."},{"num":36,"verse":"For neither is it possible any longer for them to die, for they are like malachim and they are bnei haElohim, being bnei haTechiyas HaMesim."},{"num":37,"verse":"But that the Mesim are made to stand up alive, even Moshe revealed at the burning bush, as he calls Adonoi ELOHEI AVRAHAM ELOHEI YITZCHAK VELOHEI YAAKOV. [SHEMOT 3:6]"},{"num":38,"verse":"But Hashem is not the G-d of Mesim but is Elohei HaChayyim, for to Hashem all are alive."},{"num":39,"verse":"And, in reply, some of the Sofrim said, Rabbi, you spoke well."},{"num":40,"verse":"For no longer were they daring to set a she’elah (question) before him regarding anything."},{"num":41,"verse":"And he said to them, How do they say that the Rebbe Melech HaMoshiach is to be [merely] Dovid’s ben?"},{"num":42,"verse":"For Dovid himself says in the book of Tehillim, NEUM HASHEM LADONI: SHEV LIMINI,"},{"num":43,"verse":"AD ASHIT OYVECHA L’RAGLECHA. [TEHILLIM 110:1]"},{"num":44,"verse":"Therefore, if Dovid calls him Adon, how is he [merely] ben Dovid?"},{"num":45,"verse":"In the hearing of all the people, Rebbe, Melech HaMoshiach said to his talmidim,"},{"num":46,"verse":"Beware of the Sofrim (Rabbonim), the ones wanting to strut around in long kaftans and loving [obsequious] Birkat Shalom greetings in the marketplaces and the rashei hamoshavot (chief seats) in the shuls and the places of kavod at seudos tishen,"},{"num":47,"verse":"Which devour the batim (houses) of the almanot (widows) and for the sake of appearance daven lengthy tefillos (prayers): the same shall receive greater damnation."}]