[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE PUBLICANS’ FRIEND",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SECRET OF GLADNESSMark 2:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SECRET OF GLADNESS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This part of our Lord’s answer to the question put by John’s disciples as to the reason for the omission of the practice of fasting by His followers. The answer is very simple. It is-’My disciples do not fast because they are not sad.’ And the principle which underlies the answer is a very important one. It is this: that all outward forms of religion, appointed by man, ought only to be observed when they correspond to the feeling and disposition of the worshipper. That principle cuts up all religious formalism by the very roots. The Pharisee said: ‘Fasting is a good thing in itself, and meritorious in the sight of God.’ The modern Pharisee says the same about many externals of ritual and worship; Jesus Christ says, ‘No! The thing has no value except as an expression of the feeling of the doer.’ Our Lord did not object to fasting; He expressly approved of it as a means of spiritual power. But He did object to the formal use of it or of any outward form. The formalist’s form, whether it be the elaborate ritual of the Catholic Church, or the barest Nonconformist service, or the silence of a Friends’ meeting-house, is rigid, unbending, and cold, like an iron rod. The true Christian form is elastic, like the stem of a palm-tree, which curves and sways and yields to the wind, and has the sap of life in it. If any man is sad, let him fast; ‘if any man is merry, let him sing psalms.’ Let his ritual correspond to his spiritual emotion and conviction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the point which I wish to consider now is not so much this, as the representation that is given here of the reason why fasting was incongruous with the condition and disposition of the disciples. Jesus says: ‘We are more like a wedding-party than anything else. Can the children of the bridechamber fast as long as the bridegroom is with them?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The ‘children of the bridechamber’ is but another name for those who were called the ‘friends’ or companions ‘of the bridegroom.’ According to the Jewish wedding ceremonial it was their business to conduct the bride to the home of her husband, and there to spend seven days in festivity and rejoicing, which were to be so entirely devoted to mirth and feasting that the companions of the bridegroom were by the Talmudic ritual absolved even from prayer and from worship, and had for their one duty to rejoice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And that is the picture that Christ holds up before the disciples of the ascetic John as the representation of what He and His friends were most truly like. Very unlike our ordinary notion of Christ and His disciples as they walked the earth! The presence of the Bridegroom made them glad with a strange gladness, which shook off sorrow as the down on a sea-bird’s breast shakes off moisture, and leaves it warm and dry, though it floats amidst boundless seas. I wish now to meditate on this secret of imperviousness to sorrow arising from the felt presence of the Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are three subjects for consideration arising from the words of my text: The Bridegroom; the presence of the Bridegroom; the joy of the Bride-groom’s presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Now with regard to the first, a very few words will suffice.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Now with regard to the first, a very few words will suffice. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The first thing that strikes me is the singular appropriateness and the delicate, pathetic beauty in the employment of this name by Christ in the existing circumstances. Who was it that had first said: ‘He that hath the bride is the bridegroom, but the friend of the bridegroom that standeth by and heareth him, rejoiceth greatly because of the bridegroom’s voice. This my joy therefore is fulfilled’? Why, it was the master of these very men who were asking the question. John’s disciples came and said, ‘Why do not your disciples fast?’ and our Lord reminded them of their own teacher’s words, when he said, ‘The friend of the bridegroom can only be glad.’ And so He would say to them, ‘In your master’s own conception of what I am, and of the joy that comes from My presence, you have an answer to your question. He might have taught you who I am, and why it is that the men that stand around Me are glad.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But this is not all. We cannot but connect this name with a whole circle of ideas found in the Old Testament, especially with that most familiar and almost stereotyped figure which represents the union between Israel and Jehovah, under the emblem of the marriage bond. The Lord is the ‘husband’; and the nation whom He has loved and redeemed and chosen for Himself, is the ‘wife’; unfaithful and forgetful, often requiting love with indifference and protection with unthankfulness, and needing to be put away, and debarred of the society of the husband who still yearns for her; but a wife still, and in the new time to be joined to Him by a bond that shall never be broken and a better covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so Christ lays His hand upon all that old history and says, ‘It is fulfilled here in Me.’ A familiar note in Old Testament Messianic prophecy too is caught and echoed here, especially that grand marriage ode of the forty-fifth psalm, in which he must be a very prosaic or very deeply prejudiced reader who hears nothing more than the shrill wedding greetings at the marriage of some Jewish king with a foreign princess. Its bounding hopes and its magnificent sweep of vision are a world too wide for such interpretation. The Bridegroom of that psalm is the Messiah, and the Bride is the Church.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I need only refer in a sentence to what this indicates of Christ’s self-consciousness. What must He, who takes this name as His own, have thought Himself to be to the world, and the world to Him? He steps into the place of the Jehovah of the Old Testament, and claims as His own all these great and wonderful prophecies. He promises love, protection, communion, the deepest, most mystical union of spirit and heart with Himself; and He claims quiet, restful confidence in His love, absolute, loving obedience to His authority, reliance upon His strong hand and loving heart, and faithful cleaving to Him. The Bridegroom of humanity, the Husband of the world, if it will only turn to Him, is Christ Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. But a word as to the presence of the Bridegroom.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. But a word as to the presence of the Bridegroom. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It might seem as if this text condemned us who love an unseen and absent Lord to exclusion from the joy which is made to depend on His presence. Are we in the dreary period when ‘the Bridegroom is taken away’ and fasting appropriate? Surely not. The time of mourning for an absent Christ was only three days; the law for the years of the Church’s history between the moment when the uplifted eyes of the gazers lost Him in the symbolic cloud and the moment when He shall come again is, ‘Lo, I am with you alway.’ The absent Christ is the present Christ. He is really with us, not as the memory or the influence of the example of the dead may be said to remain, not as the spirit of a teacher may be said to abide with his school of followers. We say that Christ has gone up on high and sits on ‘the right hand of God.’ The right hand of God is His active power. Where is ‘the right hand of God’? It is wherever His divine energy works. He that sits at the right hand of God is thereby declared to be wherever the divine energy is in operation, and to be Himself the wielder of that divine Power. I believe in a local abode of the glorified human body of Jesus Christ now, but I believe likewise that all through God’s universe, and eminently in this world, which He has redeemed, Christ is present, in His consciousness of its circumstances, and in the activity of His influence, and in whatsoever other incomprehensible and unspeakable mode Omnipresence belongs to a divine Person. So that He is with us most really, though the visible, bodily Form is no longer by our sides.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That Presence which survives, which is true for us here to-day, may be a far better and more blessed and real thing than the presence of the mere bodily Form in which He once dwelt. We may have lost something by His going away in visible form; I doubt whether we have. We have lost the manifestation of Him to the sense, but we have gained the manifestation of Him to the spirit. And just as the great men, who are only men, need to die and go away in order to be measured in their true magnitude and understood in their true glory; just as when a man is in amongst the mountains, he cannot tell which peak is the dominant one, but when he gets away a little space across the sea and looks back, distance helps to measure magnitude and reveal the sovereign summit which towers above all the rest, so, looking back across the ages with the foreground between us and Him of the history of the Christian Church ever since, and noticing how other heights have sunk beneath the waves and have been wrapped in clouds and have disappeared behind the great round of the earth, we can tell how high this One is; and know better than they knew who it is that moves amongst men in ‘the form of a servant,’ even the Bridegroom of the Church and of the world. ‘It is expedient for you that I go away,’ and Christ is, or ought to be, nearer to us to-day in all that constitutes real nearness, in our apprehension of His essential character, in our reception of His holiest influences, than He ever was to them who walked beside Him on the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, brethren, that presence is of no use at all to us unless we daily try to realise it. He was with these men whether they would or no. Whether they thought about Him or no, there He was; and just because His presence did not at all depend upon their spiritual condition, it was a lower kind of presence than that which you and I have now, and which depends altogether on our realising it by the turning of our hearts to Him, and by the daily contemplation of Him amidst all our bustle and struggle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do you, as you go about your work, feel His nearness and try to keep the feeling fresh and vivid, by occupying heart and mind with Him, by referring everything to His supreme control? By trusting yourselves utterly and absolutely in His hand, and gathering round you, as it were, the sweetness of His love by meditation and reflection, do you try to make conscious to yourselves your Lord’s presence with you? If you do, that presence is to you a blessed reality; if you do not, it is a word that means nothing and is of no help, no stimulus, no protection, no satisfaction, no sweetness whatever to you. The children of the Bridegroom are glad only when, and as, they know that the Bridegroom is with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now a word, last of all, about the joy of the Bridegroom’s presence.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now a word, last of all, about the joy of the Bridegroom’s presence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "What was it that made these humble lives so glad when Christ was with them, filling them with strange new sweetness and power? The charm of personal character, the charm of contact with one whose lips were bringing to them fresh revelations of truth, fresh visions of God, whose whole life was the exhibition of a nature beautiful, and noble, and pure, and tender, and sweet, and loving, beyond anything they had ever seen before.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah! brethren, there is no joy in the world like that of companionship, in the freedom of perfect love, with one who ever keeps us at our best, and brings the treasures of ever fresh truth to the mind, as well as beauty of character to admire and imitate. That is one of the greatest gifts that God gives, and is a source of the purest joy that we can have. Now we may have all that and much more in Jesus Christ. He will be with us if we do not drive Him away from us, as the source of our purest joy, because He is the all-sufficient Object of our love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! you men and women who have been wearily seeking in the world for love that cannot change, for love that cannot die and leave you; you who have been made sad for life by irrevocable losses, or sorrowful in the midst of your joy by the anticipated certain separation which is to come, listen to this One who says to you: ‘I will never leave thee, and My love shall be round thee for ever’; and recognise this, that there is a love which cannot change, which cannot die, which has no limits, which never can be cold, which never can disappoint, and therefore, in it, and in His presence, there is unending gladness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He is with us as the source of our joy, because He is the Lord of our lives, and the absolute Commander of our wills. To have One present with us whose loving word it is delight to obey, and who takes upon Himself all responsibility for the conduct of our lives, and leaves us only the task of doing what we are bid-that is peace, that is gladness, of such a kind as none else in the world gives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He is with us as the ground of perfect joy, because He is the adequate object of all our desires, and the whole of the faculties and powers of a man will find a field of glad activity in leaning upon Him, and realising His presence. Like the Apostle whom the old painters loved to represent lying with his happy head on Christ’s heart, and his eyes closed in a tranquil rapture of restful satisfaction, so if we have Him with us and feel that He is with us, our spirits may be still, and in the great stillness of fruition of all our wishes and fulfilment of all our needs, may know a joy that the world can neither give nor take away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He is with us as the source of endless gladness, in that He is the defence and protection for our souls. And as men live in a victualled fortress, and care not though the whole surrounding country may be swept bare of all provision, so when we have Christ with us we may feel safe, whatsoever befalls, and ‘in the days of famine we shall be satisfied.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He is with us as the source of our perfect joy, because His presence is the kindling of every hope that fills the future with light and glory. Dark or dim at the best, trodden by uncertain shapes, casting many a deep shadow over the present, that future lies, unless we see it illumined by Christ, and have Him by our sides. But if we possess His companionship, the present is but the parent of a more blessed time to come; and we can look forward and feel that nothing can touch our gladness, because nothing can touch our union with our Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, dear brethren, from all these thoughts and a thousand more which I have no time to dwell upon, comes this one great consideration, that the joy of the presence of the Bridegroom is the victorious antagonist of all sorrow and mourning. ‘Can the children of the bridechamber mourn, while the bridegroom is with them?’ The answer sometimes seems to be, ‘Yes, they can.’ Our own hearts, with their experience of tears, and losses, and disappointments, seem to say: ‘Mourning is possible, even whilst He is here. We have our own share, and we sometimes think, more than our share, of the ills that flesh is heir to.’ And we have, over and above them, in the measure in which we are Christians, certain special sources of sorrow and trial, peculiar to ourselves alone; and the deeper and truer our Christianity the more of these shall we have. But notwithstanding all that, what will the felt presence of the Bridegroom do for these griefs that will come? Well, it will limit them, for one thing; it will prevent them from absorbing the whole of our nature. There will always be a Goshen in which there is ‘light in the dwelling,’ however murky may be the darkness that wraps the land. There will always be a little bit of soil above the surface, however weltering and wide may be the inundation that drowns our world. There will always be a dry and warm place in the midst of the winter, a kind of greenhouse into which we may get from out of the tempest and fog. The joy of the Bridegroom’s presence will last through the sorrow, like a spring of fresh water welling up in the midst of the sea. We may have the salt and the sweet waters mingling in our lives, not sent forth by one fountain, but flowing in one channel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our joy will sometimes be made sweeter and more wonderful by the very presence of the mourning and the pain. Just as the pillar of cloud, that glided before the Israelites through the wilderness, glowed into a pillar of fire as the darkness deepened, so, as the outlook around becomes less and less cheery and bright, and the night falls thicker and thicker, what seemed to be but a thin, grey, wavering column in the blaze of the sunlight will gather warmth and brightness at the heart of it when the midnight comes. You cannot see the stars at twelve o’clock in the day; you have to watch for the dark hours ere heaven is filled with glory. And so sorrow is often the occasion for the full revelation of the joy of Christ’s presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Why have so many Christian men so little joy in their lives? Because they look for it in all sorts of wrong places, and seek to wring it out of all sorts of sapless and dry things. ‘Do men gather grapes of thorns?’ If you fling the berries of the thorn into the winepress, will you get sweet sap out of them? That is what you are doing when you take gratified earthly affections, worldly competence, fulfilled ambitions, and put them into the press, and think that out of these you can squeeze the wine of gladness. No! No! brethren, dry and sapless and juiceless they all are. There is one thing that gives a man worthy, noble, eternal gladness, and that is the felt presence of the Bridegroom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Why have so many Christians so little joy in their lives? A religion like that of John’s disciples and that of the Pharisees is a poor affair. A religion of which the main features are law and restriction and prohibition, cannot be joyful. And there are a great many people who call themselves Christians, and have just religion enough to take the edge off worldly pleasures, and yet have not enough to make fellowship with Christ a gladness for them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a cry amongst us for a more cheerful type of religion. I re-echo the cry, but I am afraid that I do not mean by it quite the same thing that some of my friends do. A more cheerful type of Christianity means to many of us a type of Christianity that will interfere less with our amusements; a more indulgent doctor that will prescribe a less rigid diet than the old Puritan type used to do. Well, perhaps they went too far; I do not care to deny that. But the only cheerful Christianity is a Christianity that draws its gladness from deep personal experience of communion with Jesus Christ. There is no way of men being religious and happy except being profoundly religious, and living very near their Master, and always trying to cultivate that spirit of communion with Him which shall surround them with the sweetness and the power of His felt presence. We do not want Pharisaic fasting, but we do want that the reason for not fasting shall not be that Christians like eating better, but that their religion must be joyful because they have Christ with them, and therefore cannot choose but sing, as a lark cannot choose but carol. ‘Religion has no power over us, but as it is our happiness,’ and we shall never make it our happiness, and therefore never know its beneficent control, until we lift it clean out of the low region of outward forms and joyless service, into the blessed heights of communion with Jesus Christ, ‘Whom having not seen we love.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I would that Christian people saw more plainly that joy is a duty, and that they are bound to make efforts to obey the command, ‘Rejoice in the Lord always,’ no less than to keep other precepts. If we abide in Christ, His joy ‘will abide in us, and our joy will be full.’ We shall have in our hearts a fountain of true joy which will never be turbid with earthly stains, nor dried up by heat, nor frozen by cold. If we set the Lord always before us our days may be at once like the happy hours of the ‘children of the bridechamber,’ bright with gladness and musical with song; and also saved from the enervation that sometimes comes from joy, because they are also like the patient vigils of the servants who ‘wait for the Lord, when He shall return from the wedding.’ So strangely blended of fruition and hope, of companionship and solitude, of feasting and watching, is the Christian life here, until the time comes when His friends go in with the Bridegroom to the banquet, and drink for ever of the new joy of the kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:18-22 Strict professors are apt to blame all that do not fully come up to their own views. Christ did not escape slanders; we should be willing to bear them, as well as careful not to deserve them; but should attend to every part of our duty in its proper order and season.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:15-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mr 2:18-22. Discourse on Fasting. ( = Mt 9:14-17; Lu 5:33-39).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on [1409]Lu 5:33-39.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 2:18\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus said unto them,.... Both to John's disciples and the Pharisees, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "can the children of the bride chamber fast, while the bridegroom is with them? Suggesting that he was the bridegroom, as John their master had called him, John 3:29, and that his disciples were the children of the bride chamber; and that it was very unsuitable for them, and very unreasonable to desire them to fast at such a time, and under such a character: wherefore the answer returned by Christ himself to the question is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "can the children of the bride chamber fast, while the bridegroom is with them? Suggesting that he was the bridegroom, as John their master had called him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and that his disciples were the children of the bride chamber; and that it was very unsuitable for them, and very unreasonable to desire them to fast at such a time, and under such a character: wherefore the answer returned by Christ himself to the question is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "as long as they have the bridegroom with them, they cannot fast: all which the Syriac version expresses by  \"no\": see Gill on Matthew 9:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as long as they have the bridegroom with them, they cannot fast: all which the Syriac version expresses by  \"no\": see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus said unto them, Can the children of the bridechamber fast, while the bridegroom is with them? as long as they have the bridegroom with them, they cannot fast.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ δύνανται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.: the question answers itself, and is allowed to do so in Mt. and Lk. Mk. at the expense of style answers it formally in the negative.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅσον χρόνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. For all this the Syriac Vulgate has a simple ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the children of the bridechamber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. the friends and companions of the bridegroom, who accompanied him to the house of the bride for the marriage. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the bridegroom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He reminds the disciples of John of the image under which their own great Master had spoken of Him as the Bridegroom (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), at the sound of Whose voice he rejoiced.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The Bridegroom here is Christ, because he espoused the human nature, and, through it, the Church to himself in his holy incarnation. This holy union he began by his grace on earth, and he will consummate it gloriously with his elect in heaven, when \"the marriage of the Lamb shall have come, and his wife shall have made herself ready.\" Hence John the Baptist calls himself the friend of the Bridegroom, that is, of Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The sons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "υἱοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of the bridechamber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are the special friends of the Bridegroom, those who are admitted into the closest fellowship with him. The expression is a Hebraism, like \"the children of disobedience,\" and many other similar forms of expression. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So long, then, as the bridegroom is with them they cannot fast. But the days will come when the bridegroom shall be taken away from them, and then shall they fast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is as though our Lord said, \"It is not surprising that they should not care to fast as long as they enjoy my presence; but when I am taken from thegn, then shall they fast.\" Mark 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Children of the bride-chamber (υἱοὶ τοῦ νυμφῶνος)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "More correctly as Rev., sons. It is noteworthy that Christ twice uses a figure drawn from marriage in his allusions to John the Baptist, the ascetic. Compare John 3:29. The sons of the bride-chamber are different from the groomsmen. They are the guests invited to the bridal. The scene is laid in Galilee, where groomsmen were not customary, as in Judaea. Hence there is no mention of them in the account of the marriage at Cana. In Judaea there were at every marriage two groomsmen or friends of the bridegroom. See on John 3:29. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "More correctly as Rev., sons. It is noteworthy that Christ twice uses a figure drawn from marriage in his allusions to John the Baptist, the ascetic. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sons of the bride-chamber are different from the groomsmen. They are the guests invited to the bridal. The scene is laid in Galilee, where groomsmen were not customary, as in Judaea. Hence there is no mention of them in the account of the marriage at Cana. In Judaea there were at every marriage two groomsmen or friends of the bridegroom. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]