[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Borne of four.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The number of the bearers is given by St. Mark only.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 2:3-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:3-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they come, bringing one sick of the palsy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which was borne of four ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— One at each corner of the sofa or couch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when they could not come nigh unto him for the press ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The great crowd of people collected together, and feared a delay might lose so precious an opportunity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they uncovered the roof ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Of the apartment where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which was a room that had no chamber over it, the houses in the East being low, having generally a ground floor only, or one upper story. This house also, like other houses in that country, had doubtless a flat roof with a battlement round it, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and a kind of trap-door, by which persons within could come out upon it to walk and take the air, or perform their devotions. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) This door, when shut, lying even with the roof, made a part of it, and was probably well fastened to secure the house against thieves. The bearers therefore of the paralytic, prevented from bringing him in at the door by the crowd, bear him up by some other stair to the roof of this room, and finding this trap-door fastened below, were obliged to break it open before they could get entrance; and probably also, in order to let down the sick man and his couch, to make the opening wider, which they might do, either by removing the frame of the trap-door, or some of the tiles adjoining to it, with the laths supporting them; all which Mark fitly expresses by the words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "απεστε γαδαν την στεγην οπου ην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "και",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εξορυξαντες χαλωσι τον κραββατον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they took up the covering, and having broken, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pulled up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, as much of the frame or adjoining tiles as was necessary, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they let down the couch, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which they held by the corners, or by ropes fastened to the corners of it, and so placed him before Jesus while he was preaching to the people who were within, and to as many of those who stood without in the court as could hear.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Some think a more satisfactory interpretation of this passage may be given by referring to Dr. Shaw’s account of the houses in the East. “They are built,” he says, “round a paved court, into which the entrance from the street is through a gateway, or passage-room, furnished with benches, and sufficiently large to be used in receiving visits, or transacting business. The stairs, which lead to the roof, are never placed on the outside of the house in the street, but usually in the gateway or passage-room to the court, and sometimes at the entrance within the court. This court is called in Arabic, the middle of the house, and answers to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the midst, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in Luke. It is customary to fix cords from the parapet-walls (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the flat roofs across this court, and upon them to expand a veil or covering, as a shelter from the heat. In this area, probably, our Saviour taught. The paralytic was brought upon the roof by making a way through the crowd to the stairs in the gateway, or by the terraces of the adjoining houses. They rolled back the veil, and let the sick man down over the parapet-wall of the roof into the area or court of the house before Jesus.” This interpretation, however, seems hardly consistent with the original expressions used by Mark and Luke: particularly the latter, who says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δια των κεραμων καθηκαν αυτον συν τω κλινιδιω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They let him down through the tiling with his couch.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-12 It was this man's misery that he needed to be so carried, and shows the suffering state of human life; it was kind of those who so carried him, and teaches the compassion that should be in men, toward their fellow-creatures in distress. True faith and strong faith may work in various ways; but it shall be accepted and approved by Jesus Christ. Sin is the cause of all our pains and sicknesses. The way to remove the effect, is to take away the cause. Pardon of sin strikes at the root of all diseases. Christ proved his power to forgive sin, by showing his power to cure the man sick of the palsy. And his curing diseases was a figure of his pardoning sin, for sin is the disease of the soul; when it is pardoned, it is healed. When we see what Christ does in healing souls, we must own that we never saw the like. Most men think themselves whole; they feel no need of a physician, therefore despise or neglect Christ and his gospel. But the convinced, humbled sinner, who despairs of all help, excepting from the Saviour, will show his faith by applying to him without delay.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See this miracle explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:2-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Palsy - See the notes at Matthew 4:24.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Palsy - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Borne of four - Carried upon a couch Matthew 9:2 by four men.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Borne of four - Carried upon a couch ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by four men.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. And they come unto him—that is, towards the house where He was.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bringing one sick of the palsy—\"lying on a bed\" (Mt 9:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which was borne of four—a graphic particular of Mark only.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 2:1\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they came unto him,.... A considerable body of people, townsmen, friends, and relations of the person after mentioned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bringing one sick of the palsy, which was borne of four; carried by four men upon their shoulders, as if he was a dead carcass; so weak and enfeebled was he by his disease, that he could not walk, or be otherwise brought; or rather upon a bed, which four men, at the four comers of it, carried in their hands; and so the Ethiopic version renders it, \"four men carried him on a bed\"; and certain it is, by what follows, that he was brought upon a bed. This man's case appears to be a very bad one, and what seems to be incurable by the art of medicine: it was not a slight touch of the palsy, but a general one, which had deprived him of motion and sensation. The palsy is a disease, whereby the body, or some of its parts, lose their motion, and sometimes their sensation or feeling: the causes of it are an impeded influx of the nervous spirits into the villi, or the muscles, or of the arterious blood into their vessels; which may happen from some fault either in the brain, the nerves, muscles, or their vessels. The palsy is said to be \"perfect\", or complete, when there is a privation of motion and sensation at the same time; \"imperfect\", when one of the two is destroyed, the other remaining. The palsy again is either \"universal, lateral\", or \"partial\". The \"universal\" palsy, called also \"paraplegia\", or \"paraplexia\", is a general immobility of all the muscles that receive nerves from the cerebrum, or cerebellum, except those of the head--its cause is usually supposed to reside in the ventricles of the brain, or in the root of the spinal marrow.--The \"lateral\" palsy, called also \"hemiplegia\", is the same disease with the \"paraplegia\", only that it affects but one side of the body. Its cause is the same, only restrained to one side of the brain, or spinal marrow. The \"partial\" palsy is where some particular part, or member, alone is affected; as, for instance, where the motion of the arm, or leg, is destroyed (z). Now this man's disease seems to be the perfect and general palsy, which affects the whole body, or the \"paraplegia\", which reaches every part but the head; whereby all sense, as well as motion, are destroyed, and sometimes only one of them: but in this case it seems as if both of them were lost: that he was motionless, is clear from his being carried by four persons; and it looks as if he had lost his feeling, since he is not said to be grievously tormented, as the centurion's servant is said to be, Matthew 8:6, whose disease seems to have been of the partial or imperfect kind; or however, though it deprived him of motion, yet not of sensation; his might be a kind of scorbutic palsy. This man is an emblem of a sinner in a state of nature, who is insensible of his condition, of the exceeding sinfulness of sin, of his danger and misery to which he is exposed, of his lost and undone state, of the necessity of the new birth, and of the need of salvation by Jesus Christ; and who, as he is destitute of spiritual life, can have no spiritual motion to come to Christ for life and salvation, or any spiritual strength and activity to move in, or perform any thing that is spiritually good: and as the friends of this man took him, and brought him to Christ, and laid him down before him, hoping he might receive a cure from him, though from what appears, it was unasked by him, as he did; so it becomes the friends and relations of unregenerate persons, who have received the grace of God themselves, and are in a sound and safe estate, to be concerned for them; to bring them under the means of grace, where they may be brought to a sense of their sins, and to a comfortable view of the free and full forgiveness of them, as this man: and this should be done, even though there may be difficulties in the accomplishment of it, as there were in this case, as is manifest from what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "bringing one sick of the palsy, which was borne of four; carried by four men upon their shoulders, as if he was a dead carcass; so weak and enfeebled was he by his disease, that he could not walk, or be otherwise brought; or rather upon a bed, which four men, at the four comers of it, carried in their hands; and so the Ethiopic version renders it, \"four men carried him on a bed\"; and certain it is, by what follows, that he was brought upon a bed. This man's case appears to be a very bad one, and what seems to be incurable by the art of medicine: it was not a slight touch of the palsy, but a general one, which had deprived him of motion and sensation. The palsy is a disease, whereby the body, or some of its parts, lose their motion, and sometimes their sensation or feeling: the causes of it are an impeded influx of the nervous spirits into the villi, or the muscles, or of the arterious blood into their vessels; which may happen from some fault either in the brain, the nerves, muscles, or their vessels. The palsy is said to be \"perfect\", or complete, when there is a privation of motion and sensation at the same time; \"imperfect\", when one of the two is destroyed, the other remaining. The palsy again is either \"universal, lateral\", or \"partial\". The \"universal\" palsy, called also \"paraplegia\", or \"paraplexia\", is a general immobility of all the muscles that receive nerves from the cerebrum, or cerebellum, except those of the head--its cause is usually supposed to reside in the ventricles of the brain, or in the root of the spinal marrow.--The \"lateral\" palsy, called also \"hemiplegia\", is the same disease with the \"paraplegia\", only that it affects but one side of the body. Its cause is the same, only restrained to one side of the brain, or spinal marrow. The \"partial\" palsy is where some particular part, or member, alone is affected; as, for instance, where the motion of the arm, or leg, is destroyed (z). Now this man's disease seems to be the perfect and general palsy, which affects the whole body, or the \"paraplegia\", which reaches every part but the head; whereby all sense, as well as motion, are destroyed, and sometimes only one of them: but in this case it seems as if both of them were lost: that he was motionless, is clear from his being carried by four persons; and it looks as if he had lost his feeling, since he is not said to be grievously tormented, as the centurion's servant is said to be, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 8:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whose disease seems to have been of the partial or imperfect kind; or however, though it deprived him of motion, yet not of sensation; his might be a kind of scorbutic palsy. This man is an emblem of a sinner in a state of nature, who is insensible of his condition, of the exceeding sinfulness of sin, of his danger and misery to which he is exposed, of his lost and undone state, of the necessity of the new birth, and of the need of salvation by Jesus Christ; and who, as he is destitute of spiritual life, can have no spiritual motion to come to Christ for life and salvation, or any spiritual strength and activity to move in, or perform any thing that is spiritually good: and as the friends of this man took him, and brought him to Christ, and laid him down before him, hoping he might receive a cure from him, though from what appears, it was unasked by him, as he did; so it becomes the friends and relations of unregenerate persons, who have received the grace of God themselves, and are in a sound and safe estate, to be concerned for them; to bring them under the means of grace, where they may be brought to a sense of their sins, and to a comfortable view of the free and full forgiveness of them, as this man: and this should be done, even though there may be difficulties in the accomplishment of it, as there were in this case, as is manifest from what follows. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Chambers's Cyclopaedia, in the word \"palsy\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Chambers's Cyclopaedia, in the word \"palsy\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they come unto him, bringing one sick of the palsy, which was borne of four.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔρχονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": historic present with lively effect. The arrival creates a stir.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φέροντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this may mean more than the four who actually carried the sick man (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπὸ τεσσάρων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), friends accompanying. The bearers might be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "servants",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Schanz).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "borne of four",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Notice the pictorial definiteness of the Evangelist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὑπὸ τεσσαρων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by four",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He was then fall grown, though not far advanced in years: comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [implying he was not old].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 3, 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they come, bringing unto him a man sick of the palsy, borne of four",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here again the minuteness of detail is very observable. It is also interesting to notice how the three writers of the synoptic Gospels supplement and illustrate one another. St. Matthew gives the outline, St. Mark and St. Luke fill up the picture. St. Luke (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") tells us how they sought means to bring the paralytic into Christ's presence. They carried him on his bed up the flight of steps outside the house, and reaching to the roof; and then both St. Mark and St. Luke tell us how, having first removed a portion of the tiling and broken up the roof, they then let him down through the opening thus made into the midst before Jesus. The chamber into which he was thus abruptly lowered was most probably what is elsewhere called the \"upper chamber,\" a large central room, convenient for the purpose of addressing both those who filled it and also the crowd that thronged the outer court below. Mark 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Borne of four",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A detail peculiar to Mark. ",
        "children": []
      }
    ]
  }
]