[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Why doth this man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .?—The better MSS. give, “Why doth this Man thus speak? He blasphemeth.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-12 It was this man's misery that he needed to be so carried, and shows the suffering state of human life; it was kind of those who so carried him, and teaches the compassion that should be in men, toward their fellow-creatures in distress. True faith and strong faith may work in various ways; but it shall be accepted and approved by Jesus Christ. Sin is the cause of all our pains and sicknesses. The way to remove the effect, is to take away the cause. Pardon of sin strikes at the root of all diseases. Christ proved his power to forgive sin, by showing his power to cure the man sick of the palsy. And his curing diseases was a figure of his pardoning sin, for sin is the disease of the soul; when it is pardoned, it is healed. When we see what Christ does in healing souls, we must own that we never saw the like. Most men think themselves whole; they feel no need of a physician, therefore despise or neglect Christ and his gospel. But the convinced, humbled sinner, who despairs of all help, excepting from the Saviour, will show his faith by applying to him without delay.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Their faith - Their confidence or belief that he could heal them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Son - Literally, \"child.\" The Hebrews used the words \"son\" and \"child\" with a great latitude of signification. They were applied to children, to grandchildren, to adopted children, to any descendants, to disciples, followers, young people, and to dependents. See the notes at Matthew 1:1. In this place it denotes affection or kindness. It was a word of consolation - an endearing appellation, applied by the Saviour to the sick man to show his \"compassion,\" to inspire confidence, and to assure him that he would heal him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Son - Literally, \"child.\" The Hebrews used the words \"son\" and \"child\" with a great latitude of signification. They were applied to children, to grandchildren, to adopted children, to any descendants, to disciples, followers, young people, and to dependents. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this place it denotes affection or kindness. It was a word of consolation - an endearing appellation, applied by the Saviour to the sick man to show his \"compassion,\" to inspire confidence, and to assure him that he would heal him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We never saw it on this fashion - Literally, \"We never saw it so.\" We never saw anything like this. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We never saw it on this fashion - Literally, \"We never saw it so.\" We never saw anything like this. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. Why doth this man thus speak blasphemies? who can forgive sins but God only?—In this second question they expressed a great truth. (See Isa 43:25; Mic 7:18; Ex 34:6, 7, &c.). Nor was their first question altogether unnatural, though in our Lord's sole case it was unfounded. That a man, to all appearances like one of themselves, should claim authority and power to forgive sins, they could not, on the first blush of it, but regard as in the last degree startling; nor were they entitled even to weigh such a claim, as worthy of a hearing, save on supposition of resistless evidence afforded by Him in support of the claim. Accordingly, our Lord deals with them as men entitled to such evidence, and supplies it; at the same time chiding them for rashness, in drawing harsh conclusions regarding Himself.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 2:1\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Why doth this man thus speak blasphemies?.... They took Christ to be a mere man, and reasoned with themselves, that he must be a blasphemer, in assuming that to himself, which was peculiar to God: they seem astonished at his words, and wonder at his arrogance, and to be filled with indignation and resentment at him; saying, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who can forgive sins but God only? this was a generally received maxim with them, and a very just one. The Chaldee paraphrase of Job 14:4, runs thus; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who can forgive sins but God only? this was a generally received maxim with them, and a very just one. The Chaldee paraphrase of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", runs thus; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"who can give a pure man out of a man that is defiled with sins, but God, who alone is he,  , \"that can pardon him?\"'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They even deny that Metatron, so they call the angel in Exodus 23:20, of whom they say, that his name is as the name of his master, has a power of forgiving sins; for which reason the Israelites rejected him as a messenger (i). They were right in saying, that none but God could forgive sin, against whom it is committed; but wrong in charging Christ with blasphemy on this account; because he is truly God, as well as man, as his omniscience and omnipotence hereafter manifested, did abundantly show. That no mere creature can forgive sin, is certain: good men may, and ought to forgive one another, and even their very enemies; but then they can only forgive sin as an injury done to themselves, not as committed against God. The ministers of the Gospel may be said to remit sins ministerially, or declaratively, by preaching the doctrine of pardon, declaring, that such as believe in Christ shall receive the remission of sins; but for any man to assume such a power to himself, as to grant pardons and indulgences, to absolve from sins, is anti-christian, as the pope of Rome does; in which he takes that to himself, which is peculiar to God; so that he, as God, sitteth in the temple of God, showing himself that he is God, 2 Thessalonians 2:4. Nor can any man procure the forgiveness of his sins by any thing he has, or can do; not by his riches, which will not profit in a day of wrath, they being not a sufficient ransom price for a man's self, or any of his brethren and friends; nor by his repentance, for though this, and remission of sins, go together in grace and experience, yet repentance is not the cause of remission of sins, but rather the effect of remission applied; nor by his faith, for faith does not procure, but receives this blessing: and much less by good works, for then the forgiveness of sins would not be according to the riches of grace; and a man would be saved by his works, since a principal part of salvation lies in the pardon of sin; and besides the blood of Christ would be shed in vain. That God only can forgive sin, is evident, because it is against him, and him only, that men sin: sin is a transgression of his law, a contrariety to his nature, and a contradiction of his will, an affront to his justice and holiness, a contempt of him, who is the lawgiver, that is able to save and to destroy; it is of the nature of a debt, which he only can loose from. Moreover, if there were any besides himself that could forgive sin, he would have one equal with him, and like unto him; whereas, \"who is a God like unto thee, that pardoneth iniquity?\" Micah 7:18. This is a prerogative peculiar to him, which he challenges to himself: \"I even I am he that blotteth out thy transgressions\", Isaiah 43:25, but then this is common to all the three divine persons in the Godhead, Father, Son, and Spirit. The Father, he has prepared this grace in his own heart; for the moving cause of it, is his sovereign grace and mercy; he has promised and secured it in the covenant of his grace; he set forth, and sent forth his Son to obtain it, by the shedding of his blood, that so his justice might he satisfied; and it is for Christ's sake he forgives all trespasses. The Son of God is concerned in it: as man, his blood was, shed for it; and that being the blood, not of a mere man, but of him that is God, as well as man, it was effectual to that purpose; it is in his name that it is preached, and he is exalted as a Saviour to give it; and as the advocate of his people he calls for it, and requires it; and as he is truly and properly God, he has equal power to bestow it, and apply it as his Father. The holy Spirit, as he makes men sensible of their need of it, he shows it to them, and their interest in it; he sprinkles the blood of Christ upon their consciences, and declares them pardoned through it; he bears witness of the truth of it to them, and seals it up unto them; so that it is wholly of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They even deny that Metatron, so they call the angel in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of whom they say, that his name is as the name of his master, has a power of forgiving sins; for which reason the Israelites rejected him as a messenger (i). They were right in saying, that none but God could forgive sin, against whom it is committed; but wrong in charging Christ with blasphemy on this account; because he is truly God, as well as man, as his omniscience and omnipotence hereafter manifested, did abundantly show. That no mere creature can forgive sin, is certain: good men may, and ought to forgive one another, and even their very enemies; but then they can only forgive sin as an injury done to themselves, not as committed against God. The ministers of the Gospel may be said to remit sins ministerially, or declaratively, by preaching the doctrine of pardon, declaring, that such as believe in Christ shall receive the remission of sins; but for any man to assume such a power to himself, as to grant pardons and indulgences, to absolve from sins, is anti-christian, as the pope of Rome does; in which he takes that to himself, which is peculiar to God; so that he, as God, sitteth in the temple of God, showing himself that he is God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Nor can any man procure the forgiveness of his sins by any thing he has, or can do; not by his riches, which will not profit in a day of wrath, they being not a sufficient ransom price for a man's self, or any of his brethren and friends; nor by his repentance, for though this, and remission of sins, go together in grace and experience, yet repentance is not the cause of remission of sins, but rather the effect of remission applied; nor by his faith, for faith does not procure, but receives this blessing: and much less by good works, for then the forgiveness of sins would not be according to the riches of grace; and a man would be saved by his works, since a principal part of salvation lies in the pardon of sin; and besides the blood of Christ would be shed in vain. That God only can forgive sin, is evident, because it is against him, and him only, that men sin: sin is a transgression of his law, a contrariety to his nature, and a contradiction of his will, an affront to his justice and holiness, a contempt of him, who is the lawgiver, that is able to save and to destroy; it is of the nature of a debt, which he only can loose from. Moreover, if there were any besides himself that could forgive sin, he would have one equal with him, and like unto him; whereas, \"who is a God like unto thee, that pardoneth iniquity?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This is a prerogative peculiar to him, which he challenges to himself: \"I even I am he that blotteth out thy transgressions\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but then this is common to all the three divine persons in the Godhead, Father, Son, and Spirit. The Father, he has prepared this grace in his own heart; for the moving cause of it, is his sovereign grace and mercy; he has promised and secured it in the covenant of his grace; he set forth, and sent forth his Son to obtain it, by the shedding of his blood, that so his justice might he satisfied; and it is for Christ's sake he forgives all trespasses. The Son of God is concerned in it: as man, his blood was, shed for it; and that being the blood, not of a mere man, but of him that is God, as well as man, it was effectual to that purpose; it is in his name that it is preached, and he is exalted as a Saviour to give it; and as the advocate of his people he calls for it, and requires it; and as he is truly and properly God, he has equal power to bestow it, and apply it as his Father. The holy Spirit, as he makes men sensible of their need of it, he shows it to them, and their interest in it; he sprinkles the blood of Christ upon their consciences, and declares them pardoned through it; he bears witness of the truth of it to them, and seals it up unto them; so that it is wholly of God. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) T. Bab. Sanhedrin, fol. 38. 2. & Gloss. in ib. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) T. Bab. Sanhedrin, fol. 38. 2. & Gloss. in ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Why doth this man thus speak blasphemies? who can forgive sins but God only?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τί οὗτος οὕτω λάλει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βλασφημεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This reading of [9] [10] [11] [12] is far more life-like than that of the T. R., which exemplifies the tendency of copyists to smooth down into commonplace whatever is striking and original = why does this person thus speak? He blasphemes. The words suggest a gradual intensification of the fault-finding mood: first a general sense of surprise, then a feeling of impropriety, then a final advance to the thought: why, this is blasphemy! It was nothing of the kind. What Jesus had said did not necessarily amount to more than a declaration of God’s willingness to forgive sin to the penitent. They read the blasphemy into it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[9] Codex Sinaiticus (sæc. iv.), now at St. Petersburg, published in facsimile type by its discoverer, Tischendorf, in 1862.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[10] Codex Vaticanus (sæc. iv.), published in photographic facsimile in 1889 under the care of the Abbate Cozza-Luzi.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[11] Codex Bezae",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[12] Codex Regius--eighth century, represents an ancient text, and is often in agreement with א and B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blasphemies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] for the claim to forgive sins implied a distinct equality with God in respect to one of His most incommunicable attributes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mark 2:7",
        "children": []
      }
    ]
  }
]