[{"num":16,"verse":"Now Sarai Avram’s wife had not borne him a child. But she had an Egyptian slave-girl named Hagar; "},{"num":2,"verse":"so Sarai said to Avram, “Here now, Adonai has kept me from having children; so go in and sleep with my slave-girl. Maybe I’ll be able to have children through her.” Avram listened to what Sarai said."},{"num":3,"verse":"It was after Avram had lived ten years in the land of Kena‘an that Sarai Avram’s wife took Hagar the Egyptian, her slave-girl, and gave her to Avram her husband to be his wife. "},{"num":4,"verse":"Avram had sexual relations with Hagar, and she conceived. But when she became aware that she was pregnant, she looked on her mistress with contempt. "},{"num":5,"verse":"Sarai said to Avram, “This outrage being done to me is your fault! True, I gave my slave-girl to you to sleep with; but when she saw that she was pregnant, she began holding me in contempt. May Adonai decide who is right — I or you!” "},{"num":6,"verse":"However, Avram answered Sarai, “Look, she’s your slave-girl. Deal with her as you think fit.” Then Sarai treated her so harshly that she ran away from her."},{"num":7,"verse":"The angel of Adonai found her by a spring in the desert, the spring on the road to Shur, "},{"num":8,"verse":"and said, “Hagar! Sarai’s slave-girl! Where have you come from, and where are you going?” She answered, “I’m running away from my mistress Sarai.” "},{"num":9,"verse":"The angel of Adonai said to her, “Go back to your mistress, and submit to her authority.” "},{"num":10,"verse":"The angel of Adonai said to her, “I will greatly increase your descendants; there will be so many that it will be impossible to count them.” "},{"num":11,"verse":"The angel of Adonai said to her, “Look, you are pregnant, and you will give birth to a son. You are to call him Yishma‘el [God pays attention] because Adonai has paid attention to your misery. "},{"num":12,"verse":"He will be a wild donkey of a man, with his hand against everyone and everyone’s hand against him, living his life at odds with all his kinsmen.”"},{"num":13,"verse":"So she named Adonai who had spoken with her El Ro’i [God of seeing], because she said, “Have I really seen the One who sees me [and stayed alive]?” "},{"num":14,"verse":"This is why the well has been called Be’er-Lachai-Ro’i [well of the one who lives and sees]; it lies between Kadesh and Bered."},{"num":15,"verse":"Hagar bore Avram a son, and Avram called the son whom Hagar had borne Yishma‘el. "},{"num":16,"verse":"Avram was 86 years old when Hagar bore Yishma‘el to Avram."}]