[{"num":21,"verse":"After these things Jesus manifested himself again to the disciples at the sea of Tiberias. And he manifested [himself] thus."},{"num":2,"verse":"There were together Simon Peter, and Thomas called Didymus, and Nathanael who was of Cana of Galilee, and the [sons] of Zebedee, and two others of his disciples."},{"num":3,"verse":"Simon Peter says to them, I go to fish. They say to him, We also come with thee. They went forth, and went on board, and that night took nothing."},{"num":4,"verse":"And early morn already breaking, Jesus stood on the shore; the disciples however did not know that it was Jesus."},{"num":5,"verse":"Jesus therefore says to them, Children, have ye anything to eat? They answered him, No."},{"num":6,"verse":"And he said to them, Cast the net at the right side of the ship and ye will find. They cast therefore, and they could no longer draw it, from the multitude of fishes."},{"num":7,"verse":"That disciple therefore whom Jesus loved says to Peter, It is the Lord. Simon Peter therefore, having heard that it was the Lord, girded his overcoat [on him] (for he was naked), and cast himself into the sea;"},{"num":8,"verse":"and the other disciples came in the small boat, for they were not far from the land, but somewhere about two hundred cubits, dragging the net of fishes."},{"num":9,"verse":"When therefore they went out on the land, they see a fire of coals there, and fish laid on it, and bread."},{"num":10,"verse":"Jesus says to them, Bring of the fishes which ye have now taken."},{"num":11,"verse":"Simon Peter went up and drew the net to the land full of great fishes, a hundred and fifty-three; and though there were so many, the net was not rent."},{"num":12,"verse":"Jesus says to them, Come [and] dine. But none of the disciples dared inquire of him, Who art thou? knowing that it was the Lord."},{"num":13,"verse":"Jesus comes and takes the bread and gives it to them, and the fish in like manner."},{"num":14,"verse":"This is already the third time that Jesus had been manifested to the disciples, being risen from among [the] dead."},{"num":15,"verse":"When therefore they had dined, Jesus says to Simon Peter, Simon, [son] of Jonas, lovest thou me more than these? He says to him, Yea, Lord; thou knowest that I am attached to thee. He says to him, Feed my lambs."},{"num":16,"verse":"He says to him again a second time, Simon, [son] of Jonas, lovest thou me? He says to him, Yea, Lord; thou knowest that I am attached to thee. He says to him, Shepherd my sheep."},{"num":17,"verse":"He says to him the third time, Simon, [son] of Jonas, art thou attached to me? Peter was grieved because he said to him the third time, Art thou attached to me? and said to him, Lord, thou knowest all things; thou knowest that I am attached to thee. Jesus says to him, Feed my sheep."},{"num":18,"verse":"Verily, verily, I say to thee, When thou wast young, thou girdedst thyself, and walkedst where thou desiredst; but when thou shalt be old, thou shalt stretch forth thy hands, and another shall gird thee, and bring thee where thou dost not desire."},{"num":19,"verse":"But he said this signifying by what death he should glorify God. And having said this, he says to him, Follow me."},{"num":20,"verse":"Peter, turning round, sees the disciple whom Jesus loved following, who also leaned at supper on his breast, and said, Lord, who is it that delivers thee up?"},{"num":21,"verse":"Peter, seeing him, says to Jesus, Lord, and what [of] this [man]?"},{"num":22,"verse":"Jesus says to him, If I will that he abide until I come, what [is that] to thee? Follow thou me."},{"num":23,"verse":"This word therefore went out among the brethren, That disciple does not die. And Jesus did not say to him, He does not die; but, If I will that he abide until I come, what [is that] to thee?"},{"num":24,"verse":"This is the disciple who bears witness concerning these things, and who has written these things; and we know that his witness is true."},{"num":25,"verse":"And there are also many other things which Jesus did, the which if they were written one by one, I suppose that not even the world itself would contain the books written."}]