[{"num":21,"verse":"After meta this houtos Jesus Iēsous again palin revealed phaneroō himself heautou · ho to  his ho disciples mathētēs by epi the ho Sea thalassa of ho Tiberias Tiberias,  and de he  revealed phaneroō himself  in  this  way houtōs. "},{"num":2,"verse":"Gathered  there  together homou were eimi Simon Simōn Peter Petros,  · kai Thomas Thōmas · ho ( called legō the  Twin Didymos),  · kai Nathanael Nathanaēl · ho of apo Cana Kana in ho Galilee Galilaia,  · kai the ho sons  of ho Zebedee Zebedaios,  and kai two dyo more allos of ek · ho his autos disciples mathētēs. "},{"num":3,"verse":"Simon Simōn Peter Petros said legō to  them autos, “ I  am  going hypagō fishing halieuō.”  They  said legō to  him autos, “ We hēmeis will  go erchomai · kai with syn you sy.” So  they  went exerchomai out  and kai got embainō into eis the ho boat ploion,  but kai that ekeinos · ho night nyx they  caught piazō nothing oudeis. "},{"num":4,"verse":"Now de when  morning prōia had  dawned ēdē,  there  stood histēmi Jesus Iēsous on eis the ho shore aigialos,  but mentoi the ho disciples mathētēs did  not ou realize oida that hoti it  was eimi Jesus Iēsous. "},{"num":5,"verse":"So oun Jesus Iēsous called legō to  them autos,  · ho “ Boys paidion,  you  have echō not mē caught  any tis fish prosphagion, have you?”  They  called apokrinomai back  to  him autos, “ No ou.” "},{"num":6,"verse":"He ho · de said legō to  them autos, “ Cast ballō your ho net diktyon to eis the ho right dexios side meros of  the ho boat ploion and kai you  will  catch heuriskō some.”  So oun they  cast ballō it there,  and kai then  they  were ischuō not ouketi able ischuō to haul in the  net autos,  because apo of  the ho large plēthos number  of ho fish ichthus. "},{"num":7,"verse":"Then oun · ho that ekeinos disciple mathētēs whom hos Jesus Iēsous loved agapaō · ho said legō to ho Peter Petros, “ It  is eimi the ho Lord kyrios!”  When  Simon Simōn Peter Petros heard akouō that hoti it  was eimi the ho Lord kyrios,  he  tucked  in diazōnnymi his ho outer ependytēs garment  ( for gar he  was eimi wearing  nothing gymnos underneath ),  and kai jumped ballō heautou into eis the ho sea thalassa. "},{"num":8,"verse":"But de the ho other allos disciples mathētēs came erchomai with  the ho boat ploiarion,  pulling syrō the ho net diktyon full  of ho fish ichthus,  for gar they  were eimi not ou far makran from apo · ho land gē,  no  more  than hōs a  hundred  yards pēchus. "},{"num":9,"verse":"When hōs they  had  come apobainō ashore eis ho,  · ho they  saw blepō a  charcoal anthrakia fire  ready keimai with kai fish opsarion lying epikeimai on  it,  and kai bread artos. "},{"num":10,"verse":"Jesus Iēsous said legō to  them autos,  · ho “ Bring pherō some apo of  the ho fish opsarion that hos you  have  just nyn caught piazō.” "},{"num":11,"verse":"So oun Simon Simōn Peter Petros went anabainō aboard  and kai dragged  the ho net diktyon ashore eis ho,  · ho full mestos of  large megas fish ichthus,  one  hundred hekaton and  fifty-three pentēkonta treis of them;  and kai although  there  were eimi so tosoutos many ,  the ho net diktyon was  not ou torn schizō. "},{"num":12,"verse":"Jesus Iēsous said legō to  them autos,  · ho “ Come deute and  have  breakfast aristaō.”  Now de none oudeis of  the ho disciples mathētēs ventured tolmaō to  ask exetazō him autos, “ Who tis are eimi you sy?”  for  they  knew oida it  was eimi the ho Lord kyrios. "},{"num":13,"verse":"Jesus Iēsous came erchomai and kai took lambanō the ho bread artos and kai gave didōmi it  to  them autos,  and kai the ho fish opsarion as  well homoiōs. "},{"num":14,"verse":"This houtos was  now ēdē the  third triton time  that  Jesus Iēsous was  revealed phaneroō to  his ho disciples mathētēs after  he  had  been  raised egeirō from ek the  dead nekros. "},{"num":15,"verse":"When hote they  had  finished aristaō breakfast ,  Jesus Iēsous said legō to ho Simon Simōn Peter Petros,  · ho “ Simon Simōn, son  of  John Iōannēs,  do  you  love agapaō me egō more polys than  these houtos others do?”  He  said legō to  him autos, “ Yes nai,  Lord kyrios,  you sy know oida that hoti I  love phileō you sy.” Jesus  said legō to  him autos, “ Take boskō care  of  · ho my egō lambs arnion.” "},{"num":16,"verse":"He  said legō to  him autos again palin, a  second deuteros time , “ Simon Simōn, son  of  John Iōannēs,  do  you  love agapaō me egō?”  He  said legō to  him autos, “ Yes nai,  Lord kyrios,  you sy know oida that hoti I  love phileō you sy.” Jesus  said legō to  him autos, “ Look poimainō after  · ho my egō sheep probaton.” "},{"num":17,"verse":"He  said legō to  him autos the ho third triton time , “ Simon Simōn, son  of  John Iōannēs,  do  you  love phileō me egō?”  Peter Petros was  distressed lypeō · ho that hoti Jesus  had  asked legō him autos for  the ho third triton time , “ Do  you  love phileō me egō?”  · kai He  said legō to  him autos, “ Lord kyrios,  you sy know oida everything pas;  you sy know ginōskō that hoti I  love phileō you sy.”  Jesus Iēsous said legō to  him autos,  · ho “ Take boskō care  of  · ho my egō sheep probaton. "},{"num":18,"verse":"I  tell legō you sy the  solemn  truth amēn,  when hote you  were eimi young neos,  you  used  to  fasten zōnnymi on  your seautou clothes  and kai go peripateō wherever hopou you  wanted thelō,  but de when hotan you  grow gēraskō old ,  you  will  stretch ekteinō out  · ho your sy hands cheir,  and kai someone  else allos will  fasten  on  your sy clothes zōnnymi and kai take pherō you  where hopou you  do  not ou want thelō to go.” "},{"num":19,"verse":"Now de he  said legō this houtos to  indicate sēmainō by  what  kind poios of  death thanatos Peter  would  glorify doxazō · ho God theos.  And kai after  saying legō this houtos he  told legō him autos, “ Follow akoloutheō me egō!” "},{"num":20,"verse":"Peter Petros turned epistrephō · ho and  saw blepō following akoloutheō them  the ho disciple mathētēs whom hos Jesus Iēsous loved agapaō,  · ho the one  who hos · kai at en the ho supper deipnon had  leaned anapiptō back  against epi · ho Jesus stēthos autos and kai said legō, “ Master kyrios,  who tis is eimi it  that ho will  betray paradidōmi you sy?” "},{"num":21,"verse":"So oun when  Peter Petros saw  him houtos,  · ho he  said legō to ho Jesus Iēsous, “ Lord kyrios,  and de what  about tis him houtos?” "},{"num":22,"verse":"Jesus Iēsous replied legō,  · ho “ If ean I  should  want thelō him autos to  remain menō alive  until heōs I  come erchomai back,  what tis concern  is that  to pros you sy?  You sy are to  follow akoloutheō me egō!” "},{"num":23,"verse":"So oun this houtos word logos spread exerchomai · ho among eis the ho believers adelphos that hoti · ho this ekeinos disciple mathētēs would  not ou die apothnēskō.  But de Jesus Iēsous did  not ou say legō to  him autos · ho that hoti he  would  not ou die apothnēskō,  but alla rather , “ If ean I  should  want thelō him autos to  remain menō alive  until heōs I  come erchomai back,  what tis concern  is that  to pros you sy?” "},{"num":24,"verse":"This houtos is eimi the ho disciple mathētēs who ho is  bearing martyreō witness  about peri these houtos things  and kai who ho wrote graphō these houtos things ,  and kai we  know oida that hoti his autos witness martyria is eimi true alēthēs.  · ho"},{"num":25,"verse":"Now de there  are eimi many polys other allos things  which hos Jesus Iēsous did poieō · ho as  well kai;  if ean they  were  written graphō down  one  after kata the  other heis,  I  imagine oiomai that  not oude even  the ho world kosmos itself autos could  contain chōreō the  books biblion that ho would  be  written graphō. "}]