[{"header":"Chapter 21"},{"num":1,"verse":"Jesus Appears to Seven Disciples. Some time later, Jesus once again revealed himself to his disciples at the Sea of Tiberias, in the following manner."},{"num":2,"verse":"Simon Peter, Thomas called the Twin, Nathanael from Cana in Galilee, the sons of Zebedee, and two other disciples were gathered together."},{"num":3,"verse":"Simon Peter said to them, “I am going out to fish.” The others replied, “We will go with you.” They set off and got into the boat, but that night they caught nothing."},{"num":4,"verse":"Shortly after daybreak, Jesus was standing on the shore, but the disciples did not realize that it was Jesus."},{"num":5,"verse":"Jesus called out, “Children, have you caught anything?” When they answered, “No,”"},{"num":6,"verse":"he said to them, “Cast the net over the right side of the boat and you will find something.” They did so, and they were unable to haul the net on board because of the great number of fish."},{"num":7,"verse":"Then the disciple whom Jesus loved said to Peter, “It is the Lord.” When Simon Peter heard him say that it was the Lord, he wrapped his outer garment around him, for he had taken it off, and jumped into the sea."},{"num":8,"verse":"The other disciples came in the boat, towing the net full of fish, for they were not far from land, only about one hundred yards."},{"num":9,"verse":"When they came ashore, they saw a charcoal fire there, with fish on it, and bread."},{"num":10,"verse":"Jesus said to them, “Bring some of the fish you have just caught.”"},{"num":11,"verse":"Simon Peter went on board and dragged the net ashore, full of large fish, one hundred and fifty-three of them. Even though there were so many, the net was not torn."},{"num":12,"verse":"Jesus then said to them, “Come and have breakfast.” None of the disciples dared to ask him, “Who are you?” because they knew that it was the Lord."},{"num":13,"verse":"Jesus then came forward, took the bread, and gave it to them, and likewise the fish."},{"num":14,"verse":"This was now the third time that Jesus revealed himself to his disciples after his resurrection from the dead."},{"num":15,"verse":"Jesus and Peter. When they had finished breakfast, Jesus said to Simon Peter, “Simon, son of John, do you love me more than these?” He replied, “Yes, Lord, you know that I love you.” Jesus said to him, “Feed my lambs.”"},{"num":16,"verse":"Jesus said to him again, “Simon, son of John, do you love me?” He replied, “Yes, Lord, you know that I love you.” Jesus said to him, “Tend my sheep.”"},{"num":17,"verse":"Jesus said to him a third time, “Simon, son of John, do you love me?” Peter was hurt that Jesus had asked him a third time, “Do you love me?” “Lord,” he said to him, “you know everything. You know that I love you.” Jesus said to him, “Feed my sheep."},{"num":19,"verse":"He said this to indicate the kind of death by which Peter would glorify God. After this, he said to him, “Follow me.”"},{"num":20,"verse":"The Beloved Disciple. Peter looked around and saw the disciple whom Jesus loved following them—the one who had reclined next to Jesus at the supper and had asked, “Lord, who is it that will betray you?”"},{"num":21,"verse":"When Peter saw him, he said to Jesus, “Lord, what about him?”"},{"num":22,"verse":"Jesus replied, “If it should be my will that he remain until I come, how does that concern you? Follow me!”"},{"num":23,"verse":"The saying then spread among the brethren that this disciple would not die. However, Jesus had not said to Peter, “He will not die,” but, “If it should be my will that he remain until I come, how does that concern you?”"},{"num":24,"verse":"Signature of the Redactors. This is the disciple who testifies to these things and has written them, and we know that his testimony is true."},{"num":25,"verse":"But there are also many other things that Jesus did; and if every one of them was recorded, I do not think the world itself could contain the books that would be written."}]