[{"header":"The risen Jesus and Peter"},{"num":1,"verse":"Later on, Jesus showed himself again to his disciples on the shore of Lake Tiberias, and he did it in this way. Simon Peter, Thomas (called the Twin), Nathanael from Cana in Galilee, the sons of Zebedee and two other disciples were together, when Simon Peter said, “I’m going fishing.” “All right,” they replied, “we’ll go with you.” So they went out and got into the boat and during the night caught nothing at all. But just as dawn began to break, Jesus stood there on the beach, although the disciples had no idea that it was Jesus."},{"num":5,"verse":"“Have you caught anything, lads?” Jesus called out to them. “No,” they replied."},{"num":6,"verse":"“Throw the net on the right side of the boat,” said Jesus, “and you’ll have a catch.” So they threw out the net and found that they were now not strong enough to pull it in because it was so full of fish! At this, the disciple that Jesus loved said to Peter, “It is the Lord!”"},{"num":7,"verse":"Hearing this, Peter slipped on his clothes, for he had been naked, and plunged into the sea. The other disciples followed in the boat, for they were only about a hundred yards from the shore, dragging in the net full of fish. When they had landed, they saw that a charcoal fire was burning, with a fish placed on it, and some bread. Jesus said to them, “Bring me some of the fish you’ve just caught.” So Simon Peter got into the boat and hauled the net ashore full of large fish, one hundred and fifty-three altogether. But in spite of the large number the net was not torn."},{"num":12,"verse":"Then Jesus said to them, “Come and have your breakfast.” None of the disciples dared to ask him who he was; they knew it was the Lord."},{"num":13,"verse":"Jesus went and took the bread and gave it to them and gave them all fish as well. This is already the third time that Jesus showed himself to his disciples after his resurrection from the dead."},{"num":15,"verse":"When they had finished breakfast Jesus said to Simon Peter, “Simon, son of John, do you love me more than these others?” “Yes, Lord,” he replied, “you know that I am your friend.”"},{"num":16,"verse":"“Then feed my lambs,” returned Jesus. Then he said for the second time, “Simon, son of John, do you love me?” “Yes, Lord,” returned Peter. “You know that I am your friend.”"},{"num":17,"verse":"“Then care for my sheep,” replied Jesus. Then for the third time, Jesus spoke to him and said, “Simon, son of John, are you my friend?” Peter was deeply hurt because Jesus’ third question to him was “Are you my friend?”, and he said, “Lord, you know everything. You know that I am your friend!”"},{"num":18,"verse":"“Then feed my sheep,” Jesus said to him. “I tell you truly, Peter, that when you were younger, you used to dress yourself and go where you liked, but when you are an old man, you are going to stretch out your hands and someone else will dress you and take you where you do not want to go.”"},{"num":19,"verse":"(He said this to show the kind of death—by crucifixion—by which Peter was going to honour God.) Then Jesus said to him, “You must follow me.”"},{"num":20,"verse":"Then Peter turned round and noticed the disciple whom Jesus loved following behind them. (He was the one who had his head on Jesus’ shoulder at supper and had asked, “Lord, who is the one who is going to betray you?”) So he said, “Yes, Lord, but what about him?”"},{"num":22,"verse":"“If it is my wish,” returned Jesus, “for him to stay until I come, is that your business, Peter? You must follow me.”"},{"num":23,"verse":"This gave rise to the saying among the brothers that this disciple would not die. Yet, of course, Jesus did not say, “He will not die,”, but simply, “If it is my wish for him to stay until I come, is that your business?”"},{"header":"All the above was written by an eye-witness"},{"num":24,"verse":"Now it is this same disciple who is hereby giving his testimony to these things and has written them down. We know that his witness is reliable. Of course, there are many other things which Jesus did, and I suppose that if each one were written down in detail, there would not be room in the whole world for all the books that would have to be written."}]