[{"num":21,"verse":"There was one other time when Jesus appeared to the disciples—this time by the Sea of Tiberias. This is how it happened: "},{"num":2,"verse":"Simon Peter, Thomas (the Twin), Nathanael (the Galilean from Cana), the sons of Zebedee, and two other disciples were together."},{"num":4,"verse":"As day was breaking, Jesus was standing on the beach; but they did not know it was Jesus."},{"num":7,"verse":"The disciple loved by Jesus turned to Peter and said:"},{"num":8,"verse":"The rest of the disciples followed him, bringing in the boat and dragging in their net full of fish. They were close to the shore, fishing only about 100 yards out. "},{"num":9,"verse":"When they arrived on shore, they saw a charcoal fire laid with fish on the grill. He had bread too."},{"num":11,"verse":"Simon Peter went back to the boat to unload the fish from the net. He pulled 153 large fish from the net. Despite the number of the fish, the net held without a tear."},{"num":13,"verse":"Jesus took the bread and gave it to each of them, and then He did the same with the fish. "},{"num":14,"verse":"This was the third time the disciples had seen Jesus since His death and resurrection. "},{"num":15,"verse":"They finished eating breakfast."},{"num":16,"verse":"Jesus asked him a second time . . ."},{"num":19,"verse":"Jesus said all this to indicate the kind of death by which Peter would glorify God. After this conversation, Jesus said,"},{"num":20,"verse":"Peter turned around to see the disciple loved by Jesus following the two of them, the same disciple who leaned back on Jesus’ side during their supper and asked, “Lord, who is going to betray You?”"},{"num":23,"verse":"It is from this exchange with Jesus that some thought this disciple would not die. But Jesus never said that. He said, “If I choose for him to remain till I return, what difference will this make to you?” "},{"num":24,"verse":"That very same disciple is the one offering this truthful account written just for you. "},{"num":25,"verse":"There are so many other things that Jesus said and did; and if these accounts were also written down, the books could not be contained in the entire cosmos."}]