[[],[{"type":"header","content":"Five Kings Attack Gibeon"},{"type":"prose","content":"When Adoni-zedek king of Jerusalem heard that Joshua had captured Ai, and had utterly destroyed it—as he had done to Jericho and its king, so he had done to Ai and its king—and that the residents of Gibeon had made peace with Israel and were [living] among them, "}],[{"type":"prose","content":"he [and his people] feared greatly, because Gibeon was a great city, like one of the royal cities, and because it was greater than Ai, and all its men were mighty. "}],[{"type":"prose","content":"So Adoni-zedek king of Jerusalem sent  to Hoham king of Hebron, and to Piram king of Jarmuth, to Japhia king of Lachish, and to Debir king of Eglon, saying, "}],[{"type":"prose","content":"“Come up to me and help me, and let us attack Gibeon [with a combined army], because it has made peace with Joshua and with the sons (people) of Israel.” "}],[{"type":"prose","content":"Then the five kings of the Amorites, the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon, gathered together and went up, they with all their armies, and they camped by Gibeon and fought against it."}],[{"type":"prose","content":"So the men of Gibeon sent  to Joshua at the camp in Gilgal, saying, “Do not abandon your servants; come up to us quickly and save us and help us, for all [five of] the kings of the Amorites who live in the hill country have assembled against us.” "}],[{"type":"prose","content":"So Joshua went up from Gilgal, he and all the people of war with him, and all the men of valor. "}],[{"type":"prose","content":"The  said to Joshua, “Do not fear them, because I have given them into your hand; not one of them shall stand before you.” "}],[{"type":"prose","content":"So Joshua came upon them suddenly, [surprising them] by marching [uphill] all night from Gilgal. "}],[{"type":"prose","content":"And the  caused them to panic  be confused before Israel, and He struck them dead in a great slaughter at Gibeon, and chased them along the way that goes up to Beth-horon and struck them as far as Azekah and Makkedah. "}],[{"type":"prose","content":"As they fled before Israel, while they were at the descent of Beth-horon, the  threw down large stones [of hail] from heaven on them as far as Azekah, and they died. More [Amorites] died because of the hailstones than those whom the sons of Israel killed with the sword."}],[{"type":"prose","content":"Then Joshua spoke to the  on the day when the  handed over the Amorites to the sons of Israel, and Joshua said in the sight of Israel,Is it not written in the Book of Jashar? So the sun stood still in the middle of the sky and was in no hurry to go down for about a whole day. "}],[{"type":"prose","content":"There has not been a day like that before it or after it, when the  listened to (heeded) the voice of a man; for the  was fighting for Israel."}],[{"type":"prose","content":"Then Joshua and all Israel with him returned to the camp at Gilgal."},{"type":"header","content":"Victory at Makkedah"}],[{"type":"prose","content":"Now these five [Amorite] kings fled and hid themselves in the cave at Makkedah. "}],[{"type":"prose","content":"And Joshua was told, “The five kings have been found and are hidden in the cave at Makkedah.” "}],[{"type":"prose","content":"Joshua said, “Roll large stones against the mouth of the cave, and assign men by it to guard them, "}],[{"type":"prose","content":"but do not stay there yourselves; pursue your enemies and attack them from the rear. Do not allow them to enter their cities, for the  your God has given them into your hand.” "}],[{"type":"prose","content":"Now when Joshua and the sons of Israel had finished striking the Amorites dead in a very great defeat, until they were wiped out, and the surviving remnant among them had entered the fortified cities, "}],[{"type":"prose","content":"all the people returned to the camp to Joshua at Makkedah in peace. No one uttered a [threatening] word against any of the sons of Israel."}],[{"type":"prose","content":"Then Joshua said, “Open the mouth of the cave and bring out to me those five [Amorite] kings from the cave.” "}],[{"type":"prose","content":"They did so, and brought these five [Amorite] kings out of the cave to him—the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon. "}],[{"type":"prose","content":"When they brought these kings out to Joshua, Joshua called for all the men of Israel, and told the commanders of the men of war who had gone with him, “Come up close, put your feet on the necks of these kings.” So they came forward and put their feet on the necks [of the five kings]. "}],[{"type":"prose","content":"Joshua said to them, “Do not fear or be dismayed (intimidated)! Be strong and courageous, for this is what the  will do to all your enemies against whom you [are about to] fight.” "}],[{"type":"prose","content":"Then afterward Joshua struck them [with his sword] and put them to death, and he hung them on five trees; and they hung on the trees until evening. "}],[{"type":"prose","content":"At sunset Joshua gave a command, and they took the bodies down from the trees and threw them into the cave where the kings had hidden themselves, and placed large stones over the mouth of the cave, [where they remain] to this very day."}],[{"type":"prose","content":"Now Joshua captured Makkedah on that day, and struck it and its king with the edge of the sword; he utterly destroyed it and everyone who was in it. He left no survivor. So he did to the king of Makkedah just as he had done to the king of Jericho."},{"type":"header","content":"Joshua’s Conquest of Southern Canaan"}],[{"type":"prose","content":"Then Joshua and all Israel with him went on from Makkedah to Libnah, and fought against Libnah. "}],[{"type":"prose","content":"The  gave it also along with its king into the hands of Israel, and Joshua struck it and every person who was in it with the edge of the sword. He left no survivor in it. So he did to the king of Libnah just as he had done to the king of Jericho."}],[{"type":"prose","content":"And Joshua and all Israel with him moved on from Libnah to Lachish, and they camped by it and fought against it. "}],[{"type":"prose","content":"The  gave Lachish into the hands of Israel; and Joshua captured it on the second day, and struck it and every person who was in it with the edge of the sword, just as he had done to Libnah."}],[{"type":"prose","content":"Then Horam king of Gezer went up to help Lachish, and Joshua struck him and his people down until he had left him no survivor."}],[{"type":"prose","content":"And Joshua and all Israel with him went on from Lachish to Eglon, and they camped by it and fought against it. "}],[{"type":"prose","content":"They captured it on that day and struck it with the edge of the sword; and on that day he utterly destroyed every person who was in it, just as he had done to Lachish."}],[{"type":"prose","content":"Then Joshua and all Israel with him went up from Eglon to Hebron, and they fought against it "}],[{"type":"prose","content":"and captured it and struck it and its king and all its cities and all the persons who were in it with the edge of the sword. He left no survivor, just as he had done to Eglon. He utterly destroyed it and every person who was in it."}],[{"type":"prose","content":"Then Joshua and all Israel with him returned to Debir, and fought against it. "}],[{"type":"prose","content":"He captured it with its king and all its cities, and they struck them with the edge of the sword, and utterly destroyed every person who was in it. He left no survivor. Just as he had done to Hebron, so Joshua did to Debir and its king, as he had done also to Libnah and its king."}],[{"type":"prose","content":"So Joshua struck all the land, the hill country, the Negev (South country) and the lowland and the slopes [that descend to the Dead Sea] and all their kings. He left no survivor, but he utterly destroyed all who breathed, just as the , the God of Israel, had commanded. "}],[{"type":"prose","content":"Joshua struck them from Kadesh-barnea even as far as Gaza, and all the country of Goshen even as far as Gibeon. "}],[{"type":"prose","content":"Joshua captured all these kings and their land at one time, because the , the God of Israel, fought for Israel. "}],[{"type":"prose","content":"So Joshua and all Israel with him returned to the camp at Gilgal."}]]