[[],[],[{"type":"header","content":"The Five Kings"},{"type":"prose","content":"It wasn’t long before My-Master-Zedek king of Jerusalem heard that Joshua had taken Ai and destroyed it and its king under a holy curse, just as he had done to Jericho and its king. He also learned that the people of Gibeon had come to terms with Israel and were living as neighbors. He and his people were alarmed: Gibeon was a big city—as big as any with a king and bigger than Ai—and all its men were seasoned fighters."}],[{"type":"prose","content":"Adoni-Zedek king of Jerusalem sent word to Hoham king of Hebron, Piram king of Jarmuth, Japhia king of Lachish, and Debir king of Eglon: “Come and help me. Let’s attack Gibeon; they’ve joined up with Joshua and the People of Israel.”"}],[{"type":"prose","content":"So the five Amorite (Western) kings—the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon—combined their armies and set out to attack Gibeon."}],[{"type":"prose","content":"The men of Gibeon sent word to Joshua camped at Gilgal, “Don’t let us down now! Come up here quickly! Save us! Help us! All the Amorite kings who live up in the hills have ganged up on us.”"}],[{"type":"prose","content":"So Joshua set out from Gilgal, his whole army with him—all those tough soldiers!  told him, “Don’t give them a second thought. I’ve put them under your thumb—not one of them will stand up to you.”"}],[{"type":"prose","content":"Joshua marched all night from Gilgal and took them by total surprise.  threw them into total confusion before Israel, a major victory at Gibeon. Israel chased them along the ridge to Beth Horon and fought them all the way down to Azekah and Makkedah. As they ran from the People of Israel, down from the Beth Horon ridge and all the way to Azekah,  pitched huge stones on them out of the sky and many died. More died from the hailstones than the People of Israel killed with the sword."}],[{"type":"prose","content":"The day  gave the Amorites up to Israel, Joshua spoke to , with all Israel listening:"},{"type":"poetry","content":"“Stop, Sun, over Gibeon;"},{"type":"poetry","content":"Halt, Moon, over Aijalon Valley.”"},{"type":"poetry","content":"And Sun stopped,"},{"type":"poetry","content":"Moon stood stock still"},{"type":"poetry","content":"Until he defeated his enemies."}],[{"type":"prose","content":"(You can find this written in the Book of Jashar.) The sun stopped in its tracks in mid sky; just sat there all day. There’s never been a day like that before or since— took orders from a human voice! Truly,  fought for Israel."}],[{"type":"prose","content":"Then Joshua returned, all Israel with him, to the camp at Gilgal."}],[{"type":"prose","content":"Meanwhile the five kings had hidden in the cave at Makkedah. Joshua was told, “The five kings have been found, hidden in the cave at Makkedah.”"}],[{"type":"prose","content":"Joshua said, “Roll big stones against the mouth of the cave and post guards to keep watch. But don’t you hang around—go after your enemies. Cut off their retreat. Don’t let them back into their cities.  has given them to you.”"}],[{"type":"prose","content":"Joshua and the People of Israel then finished them off, total devastation. Only a few got away to the fortified towns. The whole army then returned intact to the camp and to Joshua at Makkedah. There was no criticism that day from the People of Israel!"}],[{"type":"prose","content":"Then Joshua said, “Open the mouth of the cave and bring me those five kings.”"}],[{"type":"prose","content":"They did it. They brought him the five kings from the cave: the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon."}],[{"type":"prose","content":"When they had them all there in front of Joshua, he called up the army and told the field commanders who had been with him, “Come here. Put your feet on the necks of these kings.”They stepped up and put their feet on their necks."}],[{"type":"prose","content":"Joshua told them, “Don’t hold back. Don’t be timid. Be strong! Be confident! This is what  will do to all your enemies when you fight them.”"}],[{"type":"prose","content":"Then Joshua struck and killed the kings. He hung them on five trees where they remained until evening. At sunset Joshua gave the command. They took them down from the trees and threw them into the cave where they had hidden. They put large stones at the mouth of the cave. The kings are still in there."}],[{"type":"header","content":"No Survivors"},{"type":"prose","content":"That same day Joshua captured Makkedah, a massacre that included the king. He carried out the holy curse. No survivors. Makkedah’s king got the same treatment as Jericho’s king."}],[{"type":"prose","content":"Joshua, all Israel with him, moved on from Makkedah to Libnah and fought against Libnah.  gave Libnah to Israel. They captured city and king and massacred the lot. No survivors. Libnah’s king got the same treatment as Jericho’s king."}],[{"type":"prose","content":"Joshua, all Israel with him, moved on from Libnah to Lachish. He set up camp nearby and attacked.  gave Lachish to Israel. Israel took it in two days and killed everyone. He carried out the holy curse, the same as with Libnah."}],[{"type":"prose","content":"Horam, king of Gezer, arrived to help Lachish. Joshua attacked him and his army until there was nothing left of them. No survivors."}],[{"type":"prose","content":"Joshua, all Israel with him, moved on from Lachish to Eglon. They set up camp and attacked. They captured it and killed everyone, carrying out the holy curse, the same as they had done with Lachish."}],[{"type":"prose","content":"Joshua, all Israel with him, went up from Eglon to Hebron. He attacked and captured it. They killed everyone, including its king, its villages, and their people. No survivors, the same as with Eglon. They carried out the holy curse on city and people."}],[{"type":"prose","content":"Then Joshua, all Israel with him, turned toward Debir and attacked it. He captured it, its king, and its villages. They killed everyone. They put everyone and everything under the holy curse. No survivors. Debir and its king got the same treatment as Hebron and its king, and Libnah and its king.* * *"}],[{"type":"prose","content":"Joshua took the whole country: hills, desert, foothills, and mountain slopes, including all kings. He left no survivors. He carried out the holy curse on everything that breathed, just as , the God of Israel, had commanded. Joshua’s conquest stretched from Kadesh Barnea to Gaza and from the entire region of Goshen to Gibeon. Joshua took all these kings and their lands in a single campaign because , the God of Israel, fought for Israel."}],[{"type":"prose","content":"Then Joshua, all Israel with him, went back to the camp at Gilgal.* * *"}]]