[{"header":"Sun Stands Still"},{"num":10,"verse":"Now it came to pass that Adoni-zedek king of Jerusalem heard that Joshua had taken Ai, and had utterly destroyed it—just as he had done to Jericho and its king, so he had done to Ai and its king—and that the inhabitants of Gibeon had made peace with Israel and remained among them. "},{"num":2,"verse":"So he feared greatly, because Gibeon was a large city, as one of the royal cities—in fact, larger than Ai—and all its men were mighty. "},{"num":3,"verse":"Therefore Adoni-zedek king of Jerusalem sent word to Hoham king of Hebron, Piram king of Jarmuth, Japhia king of Lachish and Debir king of Eglon saying: "},{"num":4,"verse":"“Come up and help me! Let’s attack Gibeon, for it has made peace with Joshua and Bnei-Yisrael.” "},{"num":5,"verse":"So the five kings of the Amorites—the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish and the king of Eglon—gathered themselves and went up, they and all their armies, camped against Gibeon and attacked it."},{"num":6,"verse":"Then the men of Gibeon sent word to Joshua in camp at Gilgal saying: “Don’t abandon your servants! Come up to us quickly and save us! Help us, for all the kings of the Amorites living in the hill country have gathered against us.” "},{"num":7,"verse":"So Joshua went up from Gilgal, he and all the people of war with him and all the mighty men of valor."},{"num":8,"verse":"Adonai said to Joshua, “Do not fear them, for I have given them into your hand. Not one of them will stand before you.” "},{"num":9,"verse":"So Joshua came upon them suddenly by marching all night from Gilgal. "},{"num":10,"verse":"Adonai threw them into confusion before Israel, defeated them with a crushing defeat at Gibeon, chased them by the road that goes up to Beth-horon, and struck them as far as Azekah and Makkedah. "},{"num":11,"verse":"While they were fleeing before Israel down the descent of Beth-horon, Adonai cast down great stones from heaven on them all the way to Azekah so they died—more of them died from the hailstones than those Bnei-Yisrael killed with the sword."},{"num":12,"verse":"Then Joshua spoke to Adonai, on the day Adonai gave the Amorites over to Bnei-Yisrael, and said in the eyes of Israel:"},{"num":13,"verse":"So the sun stood still and the moon stopped until the nation took vengeance on its enemies. (Is it not written in the Book of Jashar?) Thus the sun halted in the middle of the sky, and did not hurry to go down for about a full day. "},{"num":14,"verse":"There was no day like that before it or after it, when Adonai listened to the voice of a man. For Adonai fought for Israel."},{"num":15,"verse":"Then Joshua and all Israel with him returned to the camp at Gilgal. "},{"num":16,"verse":"Now these five kings fled and hid themselves in the cave at Makkedah. "},{"num":17,"verse":"So it was reported to Joshua, “The five kings are found hidden in the cave at Makkedah.” "},{"num":18,"verse":"Joshua said, “Roll large stones onto the mouth of the cave, assign men over it to guard them, "},{"num":19,"verse":"but don’t stay there yourselves. Chase after your enemies and attack them at the rear. Don’t let them enter their cities, for Adonai your God has given them into your hand.”"},{"num":20,"verse":"So it was that Joshua and Bnei-Yisrael finished striking them with a very great slaughter until they were wiped out, though some of their survivors escaped into the fortified cities. "},{"num":21,"verse":"Then all the people returned safely to Joshua in the camp at Makkedah. No one dared sharpen his tongue against Bnei-Yisrael."},{"num":22,"verse":"Then Joshua said, “Open the mouth of the cave and bring out those five kings to me from the cave.” "},{"num":23,"verse":"So they did so, and brought out those five kings to him from the cave—the kings of Jerusalem, Hebron, Jarmuth, Lachish and Eglon. "},{"num":24,"verse":"When they brought out those kings to Joshua, Joshua summoned all the men of Israel and said to the chiefs of the men of war who had gone with him, “Come forward and put your feet on the necks of these kings.” So they came forward and put their feet on their necks. "},{"num":25,"verse":"Then Joshua said to them, “Never fear or be dismayed. Chazak! Be strong! For thus will Adonai do to all your enemies whom you will fight.” "},{"num":26,"verse":"After this, Joshua struck them and put them to death, then hanged them on five trees, and they remained hanging on the trees until evening. "},{"num":27,"verse":"It came about at sunset that Joshua commanded that they be taken down from the trees and thrown into the cave where they had hidden themselves. Then they placed large stones at the mouth of the cave which are there to this very day."},{"num":28,"verse":"On that day Joshua captured Makkedah and struck it and its king with the edge of the sword, putting it and every single soul in it under a ban of destruction, leaving no survivors. So he did to the king of Makkedah as he had done to the king of Jericho. "},{"num":29,"verse":"Then Joshua and all Israel with him passed on from Makkedah to Libnah and fought against Libnah. "},{"num":30,"verse":"Adonai also gave it with its king into the hand of Israel. So he struck it and every single soul in it with the edge of the sword, leaving no survivors in it. So he did to its king as he had done to the king of Jericho."},{"num":31,"verse":"Then Joshua and all Israel with him passed on from Libnah to Lachish, camped against it and fought against it. "},{"num":32,"verse":"Adonai delivered Lachish into the hand of Israel, so he captured it on the second day, and struck it and every single soul in it with the edge of the sword, just as he had done to Libnah. "},{"num":33,"verse":"Then Horam king of Gezer came up to help Lachish, but Joshua defeated him and his people until he had left him no survivors."},{"num":34,"verse":"Then Joshua and all Israel with him passed on from Lachish to Eglon, camped against it and fought against it. "},{"num":35,"verse":"They captured it on that day and struck it and every single soul in it with the edge of the sword, putting them under the ban that day, just as he had done to Lachish."},{"num":36,"verse":"Then Joshua and all Israel with him went up from Eglon to Hebron, and they fought against it. "},{"num":37,"verse":"They captured it and struck it, its king, all its towns, and every single soul that was in it with the edge of the sword, leaving no survivors, just as he had done to Eglon, putting it and every single soul in it under the ban."},{"num":38,"verse":"Then Joshua and all Israel with him turned back to Debir and fought against it. "},{"num":39,"verse":"He captured it and its king, and all its towns, struck them with the edge of the sword and put every single soul in it under the ban, leaving no survivors. Just as he had done to Hebron, so he did to Debir and its king, as he had also done to Libnah and its king."},{"num":40,"verse":"So Joshua conquered the entire country—the hill country, the Negev, the lowland and the slopes—with all their kings. He left no survivors, but he put everything that breathed under the ban, just as Adonai God of Israel had commanded. "},{"num":41,"verse":"Thus Joshua defeated them from Kadesh-barnea to Gaza, all the country of Goshen as far as Gibeon. "},{"num":42,"verse":"Thus Joshua captured all those kings and their lands at a single stroke, because Adonai God of Israel fought for Israel. "},{"num":43,"verse":"Then Joshua and all Israel with him returned to the camp at Gilgal."}]