[{"num":10,"verse":"And when Adonizedek, king of Jerusalem, had heard these things, that is, that Joshua had taken Ai, and had destroyed it; for as Joshua had done to Jericho and to the king thereof, so he did to Ai and to the king thereof; and that (the) men of Gibeon had fled (over) to Israel, and were bound in peace with them (and had made a covenant with them),"},{"num":2,"verse":"Adonizedek dreaded greatly (Adonizedek greatly feared); for Gibeon was a great city, and one of the king’s cities, and greater than the city of Ai, and all the fighters thereof were most strong."},{"num":3,"verse":"Therefore Adonizedek, king of Jerusalem, sent to Hoham, king of Hebron, and to Piram, king of Jarmuth, and to Japhia, king of Lachish, and to Debir, king of Eglon, and said,"},{"num":4,"verse":"Ascend ye to me, and help me (Come ye up to me, and help me), (so) that we (can) fight against Gibeon, for it was yielded to Joshua, and to the sons of Israel."},{"num":5,"verse":"Therefore (the) five kings of (the) Amorites, the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, (and) the king of Eglon, were gathered (together), and ascended together with their hosts; and setted tents against Gibeon (and pitched their tents opposite Gibeon), and fought against it."},{"num":6,"verse":"Soothly the dwellers of the city of Gibeon sent to Joshua, that dwelled then in tents at Gilgal, and said to him, Withdraw not thine hands from the help of thy servants; go up soon, and deliver us, and [bring] help; for all the kings of Amorites, that dwelled in the hilly places, came together against us. (And the inhabitants of the city of Gibeon sent to Joshua, who then lived in the camp at Gilgal, and said to him, Do not thou withdraw thy hands from helping thy slaves; come up soon, and help us, and rescue us; for all the kings of the Amorites, who live in the hill country, have come up together against us.)"},{"num":7,"verse":"And Joshua went up from Gilgal, (he) and all the host of fighters with him, the most strong men."},{"num":8,"verse":"And the Lord said to Joshua, Dread thou not them (Do not thou fear them), for I have given them into thine hands; and none of them shall be able to against-stand thee."},{"num":9,"verse":"Therefore Joshua felled suddenly on them, and went up all that night from Gilgal; (And so Joshua fell suddenly upon them, after going up all that night from Gilgal;)"},{"num":10,"verse":"and the Lord troubled them from the face of Israel, and all-brake (them) with great vengeance in Gibeon. And Joshua pursued them by the way of the ascending of Bethhoron, and smote till to Azekah and Makkedah. (and the Lord confounded them before the Israelites, and destroyed them with great vengeance in Gibeon. And Joshua pursued them by way of the ascent to Bethhoron, and struck them down unto Azekah and Makkedah.)"},{"num":11,"verse":"And when they fled the sons of Israel, and were in the going down of Bethhoron, the Lord sent great stones upon them from heaven, till they came to Azekah; and many more were dead by the hailstones, than they which the sons of Israel killed with sword. (And when they fled from the Israelites, and were on the descent from Bethhoron, the Lord sent great hailstones upon them from the heavens, until they came to Azekah; and many more died from the hailstones, than they whom the Israelites killed with their swords.)"},{"num":12,"verse":"Then Joshua spake to the Lord, in the day in which he betook Amorites in the sight of the sons of Israel; and Joshua said before the people, Sun, be thou not moved against Gibeon, and the moon, against the valley of Ajalon. (And Joshua spoke to the Lord, on the day in which he delivered the Amorites into the hands of the Israelites; and Joshua said before the people, Sun, stand thou still over Gibeon, and Moon, stand thou still over the Ajalon Valley.)"},{"num":13,"verse":"And the sun and the moon stood, unto the time the folk of God had venged themselves of their enemies. Whether this is not written in the book of just men? And so the sun stood in the midst of heaven, and it hasted not to go down in the space of a day; (And so the sun and the moon stood still, until the time that the people of God had avenged themselves upon their enemies. Is this not written in the Book of Jashar? And so the sun stood still in the midst of the heavens, and it hastened not to go down in the space of a day;)"},{"num":14,"verse":"so long a day was not before and afterward (there was never so long a day, before or afterward); for the Lord obeyed to the voice of a man, and he fought for Israel."},{"num":15,"verse":"And Joshua turned again, with all Israel, into the tents of Gilgal. (And then Joshua, and all Israel, returned to their tents in Gilgal.)"},{"num":16,"verse":"For the five kings fled, and hid themselves in the den of the city of Makkedah. (But those five kings had escaped, and hid themselves in the cave at Makkedah.)"},{"num":17,"verse":"And it was told to Joshua, that the five kings were found hid in the den of the city of Makkedah. (And Joshua was told that the five kings were found hiding in the cave of Makkedah.)"},{"num":18,"verse":"And Joshua commanded to fellows, and said, Wallow ye great stones to the mouth of the den, and put ye witting men, that shall keep the (en)closed kings; (And Joshua commanded to his men, and said, Roll ye some great stones to the mouth of the cave, and put ye some able men there who shall keep the kings enclosed;)"},{"num":19,"verse":"soothly do not ye stand, but pursue ye the enemies, and slay ye all the last of (the) fleers; and suffer ye not them to enter into the strongholds of their cities (and do not allow them to enter into the strongholds of their cities), the which enemies your Lord God hath betaken in(to) your hands."},{"num":20,"verse":"Then when the adversaries were beaten with great vengeance, and were almost wasted unto the death, they that might flee Israel, entered into the strengthened cities. (And so when their adversaries were beaten with a great vengeance, and were almost destroyed unto the death, the few who escaped from the Israelites, entered into their strengthened cities.)"},{"num":21,"verse":"And all the host turned again whole, and in whole number to Joshua, into Makkedah, where the tents were then; and no man was hardy to grouch against the sons of Israel (and no one was fool-hardy enough to grumble against the Israelites)."},{"num":22,"verse":"And Joshua commanded, and said, Open ye the mouth of the den (Open ye the mouth of the cave), and bring forth to me the five kings that be hid(den) therein."},{"num":23,"verse":"And the servants did, as it was commanded to them; and they brought forth to Joshua the five kings from the den; the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon."},{"num":24,"verse":"And when they were led out to Joshua, he called all the men of Israel, and said to the princes of the host, that were with him, Go ye, and set your feet on the necks of these kings. And when they had gone, and treaded the necks of the kings subject to their feet (And when they had come, and put their feet on the necks of those kings),"},{"num":25,"verse":"again Joshua said to Israel, Do not ye dread, neither be ye afeared, be ye comforted, and be ye strong; for so the Lord shall do to all your enemies, against which ye shall fight. (Joshua said to the people of Israel, Fear ye not, nor be ye afraid, but be ye encouraged, and be ye strong; for so shall the Lord do to all of your enemies, whom ye shall fight against.)"},{"num":26,"verse":"And Joshua smote those kings (And Joshua struck those kings), and killed them, and he hanged them (up) on five trees; and they were hanged unto the eventide."},{"num":27,"verse":"And when the sun went down, he commanded to fellows, that they should put them down from the gibbets; and when they were put down, they casted forth them into the den, in which they were hid; and they putted great stones on the mouth thereof, which stones dwell till to [the] present time. (And when the sun went down, he commanded to his men, that they should take them down from the gallows, or the trees; and when they had taken them down, they threw them forth into the cave in which they were hidden; and they put great stones on the mouth of it, which stones remain there unto this present time.)"},{"num":28,"verse":"In the same day, Joshua took Makkedah, and smote by the sharpness of sword, and killed the king thereof, and all the dwellers thereof; he left not therein, namely, (any) little relics; and he did to the king of Makkedah, as he had done to the king of Jericho. (On the same day, Joshua took Makkedah, and struck it with the sharpness of their swords, and killed its king, and all of its inhabitants; he left nothing of value, or any remnant, there; and so he did to the king of Makkedah, as he had done to the king of Jericho.)"},{"num":29,"verse":"And Joshua passed (forth) with all Israel from Makkedah into Libnah, and he fought against it,"},{"num":30,"verse":"which city the Lord betook, with the king thereof, in the hand of Israel; and men of Israel smote that city by the sharpness of sword, and all the dwellers thereof, and they left not therein anything of value, or relics; and they did to the king of Libnah as they had done to the king of Jericho. (which city the Lord delivered, with its king, into the hands of the Israelites; and the men of Israel struck that city, and all its inhabitants, with the sharpness of their swords, and they left nothing of value, or any remnant, there; and so they did to the king of Libnah as they had done to the king of Jericho.)"},{"num":31,"verse":"From Libnah, Joshua passed (forth) with all Israel, into Lachish; and when the host was ordained by compass, he fought against it."},{"num":32,"verse":"And the Lord betook Lachish in the hand of the sons of Israel; and Joshua took Lachish in the second day, and smote (it) by the sharpness of sword, and each man, that was therein, as he had done to Libnah. (And the Lord delivered Lachish into the hands of the Israelites; and Joshua took Lachish on the second day, and struck it with the sharpness of their swords, and killed every person who was there, as he had done in Libnah.)"},{"num":33,"verse":"In that time (At that time), Horam, king of Gezer, went up to help Lachish; whom Joshua smote, with all his people, till to [the] death."},{"num":34,"verse":"And Joshua passed from Lachish into Eglon, and compassed it, and overcame it in the same day; (And then Joshua went forth from Lachish into Eglon, and surrounded it, and overcame it on the same day;)"},{"num":35,"verse":"and he smote by the sharpness of sword all men that were therein, (as) by all things that he had done to Lachish. (and he struck all who were there with the sharpness of their swords, just as he had done in Lachish.)"},{"num":36,"verse":"Also Joshua went up with all Israel from Eglon into Hebron, and he fought against Hebron,"},{"num":37,"verse":"and he took (it), and smote it by the sharpness of (the) sword; and the king thereof, and all the cities of that country, and all men that dwelled therein; he left not any things of value, or relics, therein (he left nothing of value, or any remnant, there); as he had done to Eglon so he did also to Hebron, and wasted by (the) sword all things that were therein."},{"num":38,"verse":"From thence Joshua turned (again) into Debir, and took, and wasted it; (From there Joshua returned to Debir, and took it, and destroyed it;)"},{"num":39,"verse":"and he smote by (the) sharpness of (the) sword the king thereof, and all the towns about it; and he left not any things of value, or relics, therein (and he left nothing of value, or any remnant, there); as he had done to Hebron, and to Libnah, and to their kings, so he did to Debir, and to the king thereof."},{"num":40,"verse":"And so Joshua smote all the land of the hills, and of the south, and of the field, and Ashdod, with their kings; he left not therein any relics, (or anything of value), but he killed all thing(s) that might breath, as the Lord God of Israel commanded to him; (And so Joshua struck down all the people of the hill country, and of the lands of the south, and of the plains, and of the springs, and all their kings; he left nothing of value, or any remnant, there, but he killed everything that lived, as the Lord God of Israel commanded to him;)"},{"num":41,"verse":"from Kadeshbarnea unto Gaza, and all the land of Goshen, unto Gibeon,"},{"num":42,"verse":"Joshua took, and wasted with one fierceness all the kings, and their countries; for the Lord God of Israel fought for him. (Joshua took, and destroyed all the kings, and their lands, with one fierceness; for the Lord God of Israel fought for Israel.)"},{"num":43,"verse":"And Joshua turned again with all Israel to the place of (their) tents in Gilgal. (And then Joshua returned with all the Israelites to their camp in Gilgal.)"}]