[[],[{"type":"header","content":"Gideon’s Three Hundred Chosen Men"},{"type":"prose","content":"Then Jerubbaal (that is, Gideon) and all the people who were with him got up early, and camped beside the spring of Harod; and the camp of Midian was on the north side of them by the hill of Moreh in the valley."}],[{"type":"prose","content":"And the LORD said to Gideon, “The people who are with you are too many for Me to hand Midian over to them, otherwise Israel would become boastful, saying, ‘My own power has saved me.’"}],[{"type":"prose","content":"Now therefore come, proclaim in the hearing of the people, saying, ‘Whoever is afraid and worried, is to return and leave Mount Gilead.’” So twenty-two thousand from the people returned, but ten thousand remained."}],[{"type":"prose","content":"Then the LORD said to Gideon, “The people are still too many; bring them down to the water and I will test them for you there. So it shall be that he of whom I say to you, ‘This one shall go with you,’ he shall go with you; but everyone of whom I say to you, ‘This one shall not go with you,’ he shall not go.”"}],[{"type":"prose","content":"So he brought the people down to the water. Then the LORD said to Gideon, “You shall put everyone who laps the water with his tongue as a dog laps in one group, and everyone who kneels down to drink .”"}],[{"type":"prose","content":"Now the number of those who lapped, putting their hand to their mouth, was three hundred men; but all the rest of the people kneeled down to drink water."}],[{"type":"prose","content":"And the LORD said to Gideon, “I will save you with the three hundred men who lapped, and will hand the Midianites over to you; so have all the  people go, each man to his home.”"}],[{"type":"prose","content":"So the three hundred men took the people’s provisions and their trumpets in their hands. And Gideon dismissed all the  men of Israel, each to his tent, but retained the three hundred men; and the camp of Midian was below him in the valley."}],[{"type":"prose","content":"Now on the same night it came about that the LORD said to him, “Arise, go down against the camp, for I have handed it over to you."}],[{"type":"prose","content":"But if you are afraid to go down, go with Purah your servant down to the camp,"}],[{"type":"prose","content":"so that you will hear what they say; and afterward you will have the courage to go down against the camp.” So he went down with Purah his servant to the outposts of the army that was in the camp."}],[{"type":"prose","content":"Now the Midianites, the Amalekites, and all the people of the east were lying in the valley as numerous as locusts; and their camels were without number, as numerous as the sand on the seashore."}],[{"type":"prose","content":"When Gideon came, behold, a man was relating a dream to his friend. And he said, “Behold, I had a dream; a loaf of barley bread was tumbling into the camp of Midian, and it came to the tent and struck it so that it fell, and turned it upside down so that the tent collapsed.”"}],[{"type":"prose","content":"And his friend replied, “This is nothing other than the sword of Gideon the son of Joash, a man of Israel; God has handed over to him Midian and all the camp.”"}],[{"type":"prose","content":"When Gideon heard the account of the dream and its interpretation, he bowed in worship. Then he returned to the camp of Israel and said, “Arise, for the LORD has handed over to you the camp of Midian!”"}],[{"type":"prose","content":"And he divided the three hundred men into three units, and he put trumpets and empty pitchers into the hands of all of them, with torches inside the pitchers."}],[{"type":"prose","content":"Then he said to them, “Look at me and do likewise. And behold, when I come to the outskirts of the camp, do as I do."}],[{"type":"prose","content":"When I and all who are with me blow the trumpet, then you also blow the trumpets around the entire camp and say, ‘For the LORD and for Gideon!’”"}],[{"type":"header","content":"Confusion of the Enemy"},{"type":"prose","content":"So Gideon and the hundred men who were with him came to the outskirts of the camp at the beginning of the middle night watch, when they had just posted the watch; and they blew the trumpets and smashed the pitchers that were in their hands."}],[{"type":"prose","content":"When the three units blew the trumpets and broke the pitchers, they held the torches in their left hands and the trumpets in their right hands for blowing, and shouted, “A sword for the LORD and for Gideon!”"}],[{"type":"prose","content":"And each stood in his place around the camp; and all the army ran, crying out as they fled."}],[{"type":"prose","content":"And when they blew the three hundred trumpets, the LORD set the sword of one against another even throughout the entire army; and the army fled as far as Beth-shittah toward Zererah, as far as the edge of Abel-meholah, by Tabbath."}],[{"type":"prose","content":"And the men of Israel were summoned from Naphtali, Asher, and all Manasseh, and they pursued Midian."}],[{"type":"prose","content":"Then Gideon sent messengers throughout the hill country of Ephraim, saying, “Come down against Midian and take control of the waters ahead of them, as far as Beth-barah and the Jordan.” So all the men of Ephraim were summoned, and they took control of the waters as far as Beth-barah and the Jordan."}],[{"type":"prose","content":"And they captured the two leaders of Midian, Oreb and Zeeb, and they killed Oreb at the rock of Oreb, and they killed Zeeb at the wine press of Zeeb, while they pursued Midian; and they brought the heads of Oreb and Zeeb to Gideon from across the Jordan."}]]