[{"num":25,"verse":"Therefore Festus, having arrived in the Province, after shloshah yamim went up from Caesarea to Yerushalayim,"},{"num":2,"verse":"Where the Rashei Hakohanim and manhigim of the Yehudim explained to Festus the charges keneged Rav Sha’ul, and they were begging him,"},{"num":3,"verse":"Asking a favor from him, that Festus might summon Rav Sha’ul to Yerushalayim, while at the same time they were forming a kesher to kill him along the way."},{"num":4,"verse":"Festus answered that Rav Sha’ul was to be kept in Caesarea and that Festus himself intended quickly to go there."},{"num":5,"verse":"\"Therefore, those in authority among you,\" Festus says, \"should come down with me, and if there is anything in the wrong about Rav Sha’ul, then let them bring charges against him.\""},{"num":6,"verse":"And having stayed with them no more than shmonah or asarah yamim, Festus went down to Caesarea; the next day he sat on the Kes HaMishpat and ordered Rav Sha’ul to be brought in."},{"num":7,"verse":"When Rav Sha’ul came in, the Judeans who had come down from Yerushalayim stood around him and brought serious charges keneged (against) him, which they were not able to prove."},{"num":8,"verse":"Rav Sha’ul defended himself, saying, \"Neither keneged the Torah nor keneged the Beis Hamikdash nor keneged Caesar have I done anything wrong.\""},{"num":9,"verse":"But Festus, wishing to grant the Judeans a favor, said in reply to Rav Sha’ul, \"Do you want to go up to Yerushalayim to be judged by me there concerning these things?\""},{"num":10,"verse":"And Rav Sha’ul said, \"I am standing before the Kes HaMishpat of Caesar, where it is necessary for me to be tried. I have done no wrong to my Jewish people, as you also have da’as very well."},{"num":11,"verse":"\"Now if I have done wrong and am worthy of mavet, I am not trying to escape the penalty. But if there is nothing to the charges these bring against me, no one is able to hand me over to them. Therefore, I appeal to Caesar.\""},{"num":12,"verse":"Then Festus, having talked with his council, answered, \"To Caesar you have appealed, to Caesar you will go.\""},{"num":13,"verse":"After several yamim had passed, Agrippa HaMelech and Bernice arrived in Caesarea, having paid their respects to Festus."},{"num":14,"verse":"And while they were spending many yamim there, Festus laid out to the Melech the things with respect to Rav Sha’ul, saying, \"There is a man here who was left behind in the beis hasohar by Felix."},{"num":15,"verse":"\"When I went to Yerushalayim, the Rashei Hakohanim and the Zekenim of the Yehudim informed me about this man, requesting keneged him a sentence of condemnation."},{"num":16,"verse":"\"I answered them that it violated Roman law to hand over any man before the accused met face to face with his accusers and had an opportunity for a hitstaddekut (defense) concerning the accusation."},{"num":17,"verse":"\"Therefore, they were assembled here; I allowed no delay, and on the next day, I sat down on the Kes HaMishpat and ordered the man brought in."},{"num":18,"verse":"\"But when the accusers stood up, no charge were they bringing of any crimes I was expecting."},{"num":19,"verse":"\"Instead it was an internal matter having to do with questions regarding Orthodox Judaism, and certain disagreements they had with Rav Sha’ul, and regarding a certain Yehoshua who was deceased, but whom Rav Sha’ul asserted was alive."},{"num":20,"verse":"\"Since I was not qualified to investigate these religious questions, I was saying he might wish to go to Yerushalayim and there to be judged concerning these things."},{"num":21,"verse":"\"But Rav Sha’ul appealed that he be kept in custody for the decision of Caesar, so I ordered him to be kept until I send him to Caesar.\""},{"num":22,"verse":"And Agrippa said to Festus, \"I was desiring also myself to hear Rav Sha’ul.\" Then Festus says, \"Tomorrow you will hear him.\""},{"num":23,"verse":"Then on the next day Agrippa and Bernice came with great pomp and entered into the auditorium along with both the military tribunes and the chashuve anashim of Caesarea. And Festus the Moshel gave orders to have Rav Sha’ul brought in."},{"num":24,"verse":"And Festus says, \"Agrippa HaMelech and all here present with us, you see this man about whom K’lal Yisroel has petitioned me, both in Yerushalayim and here, shouting that he is no longer fit to live."},{"num":25,"verse":"\"But I found he has done nothing worthy of mavet, and when he appealed to Caesar, I decided to send him."},{"num":26,"verse":"\"But I have nothing definite to write to our sovereign; therefore, I especially brought him before you, O Agrippa HaMelech, so that, after you have examined him, I may have something I may write."},{"num":27,"verse":"\"For it seems unreasonable to me sending a prisoner and not having charges to report against him.\""}]