[{"num":25,"verse":"Three days after Festus arrived in Caesarea to take over his new responsibilities, he left for Jerusalem, "},{"num":2,"verse":"where the chief priests and other Jewish leaders got hold of him and gave him their story about Paul. "},{"num":3,"verse":"They begged him to bring Paul to Jerusalem at once. (Their plan was to waylay and kill him.) "},{"num":4,"verse":"But Festus replied that since Paul was at Caesarea and he himself was returning there soon, "},{"num":5,"verse":"those with authority in this affair should return with him for the trial."},{"num":6,"verse":"Eight or ten days later he returned to Caesarea and the following day opened Paul’s trial."},{"num":7,"verse":"On Paul’s arrival in court the Jews from Jerusalem gathered around, hurling many serious accusations which they couldn’t prove. "},{"num":8,"verse":"Paul denied the charges: “I am not guilty,” he said. “I have not opposed the Jewish laws or desecrated the Temple or rebelled against the Roman government.”"},{"num":9,"verse":"Then Festus, anxious to please the Jews, asked him, “Are you willing to go to Jerusalem and stand trial before me?”"},{"num":10,"verse":"But Paul replied, “No! I demand my privilege of a hearing before the emperor himself. You know very well I am not guilty. If I have done something worthy of death, I don’t refuse to die! But if I am innocent, neither you nor anyone else has a right to turn me over to these men to kill me. I appeal to Caesar.”"},{"num":12,"verse":"Festus conferred with his advisors and then replied, “Very well! You have appealed to Caesar, and to Caesar you shall go!”"},{"num":13,"verse":"A few days later King Agrippa arrived with Bernice for a visit with Festus. "},{"num":14,"verse":"During their stay of several days Festus discussed Paul’s case with the king. “There is a prisoner here,” he told him, “whose case was left for me by Felix. "},{"num":15,"verse":"When I was in Jerusalem, the chief priests and other Jewish leaders gave me their side of the story and asked me to have him killed. "},{"num":16,"verse":"Of course I quickly pointed out to them that Roman law does not convict a man before he is tried. He is given an opportunity to defend himself face-to-face with his accusers."},{"num":17,"verse":"“When they came here for the trial, I called the case the very next day and ordered Paul brought in. "},{"num":18,"verse":"But the accusations made against him weren’t at all what I supposed they would be. "},{"num":19,"verse":"It was something about their religion and about someone called Jesus who died, but Paul insists is alive! "},{"num":20,"verse":"I was perplexed as to how to decide a case of this kind and asked him whether he would be willing to stand trial on these charges in Jerusalem. "},{"num":21,"verse":"But Paul appealed to Caesar! So I ordered him back to jail until I could arrange to get him to the emperor.”"},{"num":22,"verse":"“I’d like to hear the man myself,” Agrippa said."},{"num":23,"verse":"So the next day, after the king and Bernice had arrived at the courtroom with great pomp, accompanied by military officers and prominent men of the city, Festus ordered Paul brought in."},{"num":24,"verse":"Then Festus addressed the audience: “King Agrippa and all present,” he said, “this is the man whose death is demanded both by the local Jews and by those in Jerusalem! "},{"num":25,"verse":"But in my opinion he has done nothing worthy of death. However, he appealed his case to Caesar, and I have no alternative but to send him. "},{"num":26,"verse":"But what shall I write the emperor? For there is no real charge against him! So I have brought him before you all, and especially you, King Agrippa, to examine him and then tell me what to write. "},{"num":27,"verse":"For it doesn’t seem reasonable to send a prisoner to the emperor without any charges against him!”"}]