[{"header":"Israel Refuses to Follow Rehoboam"},{"num":10,"verse":"Rehoboam went to the city of Shechem. All the Israelites had gone there to make him king. "},{"num":2,"verse":"Jeroboam heard about it. He was the son of Nebat. Jeroboam was in Egypt at that time. He had gone there for safety. He wanted to get away from King Solomon. But now he returned from Egypt. "},{"num":3,"verse":"So the people sent for Jeroboam. He and all the people went to Rehoboam. They said to him, "},{"num":4,"verse":"“Your father put a heavy load on our shoulders. But now make our hard work easier. Make the heavy load on us lighter. Then we’ll serve you.”"},{"num":5,"verse":"Rehoboam answered, “Come back to me in three days.” So the people went away."},{"num":6,"verse":"Then King Rehoboam asked the elders for advice. They had served his father Solomon while he was still living. Rehoboam asked them, “What advice can you give me? How should I answer these people?”"},{"num":7,"verse":"They replied, “Be kind to them. Please them. Give them what they are asking for. Then they’ll always serve you.”"},{"num":8,"verse":"But Rehoboam didn’t accept the advice the elders gave him. He asked for advice from the young men who had grown up with him and were now serving him. "},{"num":9,"verse":"He asked them, “What’s your advice? How should I answer these people? They said to me, ‘Make the load your father put on our shoulders lighter.’ ”"},{"num":10,"verse":"The young men who had grown up with him gave their answer. They replied, “The people have said to you, ‘Your father put a heavy load on our shoulders. Make it lighter.’ Now tell them, ‘My little finger is stronger than my father’s legs. "},{"num":11,"verse":"My father put a heavy load on your shoulders. But I’ll make it even heavier. My father beat you with whips. But I’ll beat you with bigger whips.’ ”"},{"num":12,"verse":"Three days later Jeroboam and all the people returned to Rehoboam. That’s because the king had said, “Come back to me in three days.” "},{"num":13,"verse":"The king answered them in a mean way. He didn’t accept the advice of the elders. "},{"num":14,"verse":"Instead, he followed the advice of the young men. He said, “My father put a heavy load on your shoulders. But I’ll make it even heavier. My father beat you with whips. But I’ll beat you with bigger whips.” "},{"num":15,"verse":"So the king didn’t listen to the people. That’s because God had planned it that way. What the Lord had said through Ahijah came true. Ahijah had spoken the Lord’s message to Jeroboam, the son of Nebat. Ahijah was from Shiloh."},{"num":16,"verse":"All the Israelites saw that the king refused to listen to them. So they answered the king. They said,"},{"num":17,"verse":"But Rehoboam still ruled over the Israelites who were living in the towns of Judah."},{"num":18,"verse":"Adoniram was in charge of those who were forced to work hard for King Rehoboam. The king sent him out among the Israelites. But they killed Adoniram by throwing stones at him. Rehoboam was able to get away in his chariot. He escaped to Jerusalem. "},{"num":19,"verse":"Israel has refused to follow the royal family of David to this day."}]