[{"header":"Rehoboam Rules"},{"num":10,"verse":"Then Rehoboam went to Shechem. All Israel had come to Shechem to make him king. "},{"num":2,"verse":"When Jeroboam the son of Nebat heard about it, he returned from Egypt. For Jeroboam had run to Egypt to get away from King Solomon. "},{"num":3,"verse":"And the people sent for him. Jeroboam and all Israel came to Rehoboam and said, "},{"num":4,"verse":"“Your father gave us a heavy load to carry. So now make our work easier than your father made us work. Do not let our load be as heavy as the one he put on us. And we will work for you.” "},{"num":5,"verse":"Rehoboam said to them, “Come to me again in three days.” So the people left."},{"num":6,"verse":"Then King Rehoboam spoke with the leaders who had served his father Solomon while he was still alive. He said, “Tell me, how do you think I should answer these people?” "},{"num":7,"verse":"They said to him, “If you will be kind to these people and please them and speak good words to them, they will be your servants forever.” "},{"num":8,"verse":"But Rehoboam would not listen to the wise words of the leaders. He spoke with the young men who grew up with him and served him. "},{"num":9,"verse":"He said to them, “Tell me, how do you think I should answer these people who have said to me, ‘Do not let our load be as heavy as the one your father put on us’?” "},{"num":10,"verse":"The young men who grew up with him said to him, “Say this to the people who said to you, ‘Your father made our load heavy, but you make it easier for us.’ Tell them, ‘My little finger is bigger around than my father’s body! "},{"num":11,"verse":"My father gave you a heavy load. I will add to your load. My father punished you with whips. But I will punish you with scorpions.’”"},{"num":12,"verse":"So Jeroboam and all the people came to Rehoboam on the third day, as the king had told them, saying, “Return to me on the third day.” "},{"num":13,"verse":"The king answered them with strong words. King Rehoboam did not listen to the wise words of the leaders. "},{"num":14,"verse":"Instead he listened to the words of the young men. And he said to them, “My father made your load heavy, but I will add to it. My father punished you with whips, but I will punish you with scorpions.” "},{"num":15,"verse":"So the king did not listen to the people. God made this happen so that He might make His Word come true which He spoke through Ahijah the Shilonite to Jeroboam the son of Nebat."},{"num":16,"verse":"All Israel saw that the king did not listen to them. So the people said to the king, “What share do we have in David? We have no share in the son of Jesse. Every man to your tents, O Israel! Now look to your own house, David!” So all Israel left and went to their tents. "},{"num":17,"verse":"But Rehoboam ruled over the people of Israel who lived in the cities of Judah. "},{"num":18,"verse":"Then King Rehoboam sent Hadoram, the man who made the people work. But the people of Israel killed him with stones. So King Rehoboam got on his war-wagon in a hurry, to go to Jerusalem. "},{"num":19,"verse":"Israel has been against the family of David to this day."}]