[[],[{"type":"header","content":"John the Baptizer"}],[{"type":"prose","content":"The good news of Jesus Christ—the Message!—begins here, following to the letter the scroll of the prophet Isaiah."},{"type":"poetry","content":"Watch closely: I’m sending my preacher ahead of you;"},{"type":"poetry","content":"He’ll make the road smooth for you."},{"type":"poetry","content":"Thunder in the desert!"},{"type":"poetry","content":"Prepare for God’s arrival!"},{"type":"poetry","content":"Make the road smooth and straight!"}],[{"type":"prose","content":"John the Baptizer appeared in the wild, preaching a baptism of life-change that leads to forgiveness of sins. People thronged to him from Judea and Jerusalem and, as they confessed their sins, were baptized by him in the Jordan River into a changed life. John wore a camel-hair habit, tied at the waist with a leather belt. He ate locusts and wild field honey."}],[{"type":"prose","content":"As he preached he said, “The real action comes next: The star in this drama, to whom I’m a mere stagehand, will change your life. I’m baptizing you here in the river, turning your old life in for a kingdom life. His baptism—a holy baptism by the Holy Spirit—will change you from the inside out.”"}],[{"type":"prose","content":"At this time, Jesus came from Nazareth in Galilee and was baptized by John in the Jordan. The moment he came out of the water, he saw the sky split open and God’s Spirit, looking like a dove, come down on him. Along with the Spirit, a voice: “You are my Son, chosen and marked by my love, pride of my life.”"},{"type":"header","content":"God’s Kingdom Is Here"}],[{"type":"prose","content":"At once, this same Spirit pushed Jesus out into the wild. For forty wilderness days and nights he was tested by Satan. Wild animals were his companions, and angels took care of him."}],[{"type":"prose","content":"After John was arrested, Jesus went to Galilee preaching the Message of God: “Time’s up! God’s kingdom is here. Change your life and believe the Message.”"}],[{"type":"prose","content":"Passing along the beach of Lake Galilee, he saw Simon and his brother Andrew net-fishing. Fishing was their regular work. Jesus said to them, “Come with me. I’ll make a new kind of fisherman out of you. I’ll show you how to catch men and women instead of perch and bass.” They didn’t ask questions. They dropped their nets and followed."}],[{"type":"prose","content":"A dozen yards or so down the beach, he saw the brothers James and John, Zebedee’s sons. They were in the boat, mending their fishnets. Right off, he made the same offer. Immediately, they left their father Zebedee, the boat, and the hired hands, and followed."},{"type":"header","content":"Confident Teaching"}],[{"type":"prose","content":"Then they entered Capernaum. When the Sabbath arrived, Jesus lost no time in getting to the meeting place. He spent the day there teaching. They were surprised at his teaching—so forthright, so confident—not quibbling and quoting like the religion scholars."}],[{"type":"prose","content":"Suddenly, while still in the meeting place, he was interrupted by a man who was deeply disturbed and yelling out, “What business do you have here with us, Jesus? Nazarene! I know what you’re up to! You’re the Holy One of God, and you’ve come to destroy us!”"}],[{"type":"prose","content":"Jesus shut him up: “Quiet! Get out of him!” The afflicting spirit threw the man into spasms, protesting loudly—and got out."}],[{"type":"prose","content":"Everyone there was spellbound, buzzing with curiosity. “What’s going on here? A new teaching that does what it says? He shuts up defiling, demonic spirits and tells them to get lost!” News of this traveled fast and was soon all over Galilee."}],[{"type":"prose","content":"Directly on leaving the meeting place, they came to Simon and Andrew’s house, accompanied by James and John. Simon’s mother-in-law was sick in bed, burning up with fever. They told Jesus. He went to her, took her hand, and raised her up. No sooner had the fever left than she was up fixing dinner for them."}],[{"type":"prose","content":"That evening, after the sun was down, they brought sick and evil-afflicted people to him, the whole city lined up at his door! He cured their sick bodies and tormented spirits. Because the demons knew his true identity, he didn’t let them say a word."},{"type":"header","content":"The Leper"}],[{"type":"prose","content":"While it was still night, way before dawn, he got up and went out to a secluded spot and prayed. Simon and those with him went looking for him. They found him and said, “Everybody’s looking for you.”"}],[{"type":"prose","content":"Jesus said, “Let’s go to the rest of the villages so I can preach there also. This is why I’ve come.” He went to their meeting places all through Galilee, preaching and throwing out the demons."}],[{"type":"prose","content":"A leper came to him, begging on his knees, “If you want to, you can cleanse me.”"}],[{"type":"prose","content":"Deeply moved, Jesus put out his hand, touched him, and said, “I want to. Be clean.” Then and there the leprosy was gone, his skin smooth and healthy. Jesus dismissed him with strict orders: “Say nothing to anyone. Take the offering for cleansing that Moses prescribed and present yourself to the priest. This will validate your healing to the people.” But as soon as the man was out of earshot, he told everyone he met what had happened, spreading the news all over town. So Jesus kept to out-of-the-way places, no longer able to move freely in and out of the city. But people found him, and came from all over."}]]