[[],[{"type":"header","content":"Preaching of John the Baptist"},{"type":"prose","content":"The beginning of the gospel of Jesus Christ, the Son of God,"}],[{"type":"prose","content":"just as it is written in Isaiah the prophet:"},{"type":"poetry","content":"“, I  ,"},{"type":"poetry","content":";"}],[{"type":"poetry","content":" ,"},{"type":"poetry","content":"‘,"},{"type":"poetry","content":"!’”"}],[{"type":"prose","content":"John the Baptist appeared in the wilderness, preaching a baptism of repentance for the forgiveness of sins."}],[{"type":"prose","content":"And all the country of Judea was going out to him, and all the people of Jerusalem; and they were being baptized by him in the Jordan River, confessing their sins."}],[{"type":"prose","content":"John was clothed with camel’s hair and  a leather belt around his waist, and his diet was locusts and wild honey."}],[{"type":"prose","content":"And he was preaching, saying, “After me One is coming who is mightier than I, and I am not fit to bend down and untie the straps of His sandals."}],[{"type":"prose","content":"I baptized you with water; but He will baptize you with the Holy Spirit.”"}],[{"type":"header","content":"The Baptism of Jesus"},{"type":"prose","content":"In those days Jesus came from Nazareth in Galilee and was baptized by John in the Jordan."}],[{"type":"prose","content":"And immediately coming up out of the water, He saw the heavens opening, and the Spirit, like a dove, descending upon Him;"}],[{"type":"prose","content":"and a voice came from the heavens: “You are My beloved Son; in You I am well pleased.”"}],[{"type":"prose","content":"And immediately the Spirit *brought Him out into the wilderness."}],[{"type":"prose","content":"And He was in the wilderness for forty days, being tempted by Satan; and He was with the wild animals, and the angels were serving Him."}],[{"type":"header","content":"Jesus Preaches in Galilee"},{"type":"prose","content":"Now after John was taken into custody, Jesus came into Galilee, preaching the gospel of God,"}],[{"type":"prose","content":"and saying, "}],[{"type":"prose","content":"As He was going along the Sea of Galilee, He saw Simon and Andrew, the brother of Simon, casting a net in the sea; for they were fishermen."}],[{"type":"prose","content":"And Jesus said to them, "}],[{"type":"prose","content":"Immediately they left their nets and followed Him."}],[{"type":"prose","content":"And going on a little farther, He saw James the son of Zebedee, and his brother John, who were also in the boat mending the nets."}],[{"type":"prose","content":"Immediately He called them; and they left their father Zebedee in the boat with the hired men, and went away to follow Him."}],[{"type":"prose","content":"They *went into Capernaum; and immediately on the Sabbath  entered the synagogue and  to teach."}],[{"type":"prose","content":"And they were amazed at His teaching; for He was teaching them as  having authority, and not as the scribes."}],[{"type":"prose","content":"Just then there was a man in their synagogue with an unclean spirit; and he cried out,"}],[{"type":"prose","content":"saying, “What business do you have with us, Jesus of Nazareth? Have You come to destroy us? I know who You are: the Holy One of God!”"}],[{"type":"prose","content":"And Jesus rebuked him, saying, "}],[{"type":"prose","content":"After throwing him into convulsions and crying out with a loud voice, the unclean spirit came out of him."}],[{"type":"prose","content":"And they were all amazed, so they debated among themselves, saying, “What is this? A new teaching with authority! He commands even the unclean spirits, and they obey Him.”"}],[{"type":"prose","content":"Immediately the news about Him spread everywhere into all the surrounding region of Galilee."}],[{"type":"header","content":"Crowds Healed"},{"type":"prose","content":"And immediately after they left the synagogue, they entered the house of Simon and Andrew, with James and John."}],[{"type":"prose","content":"Now Simon’s mother-in-law was lying sick with a fever; and they immediately *spoke to Jesus about her."}],[{"type":"prose","content":"And He came to her and raised her up, taking  the hand, and the fever left her, and she served them."}],[{"type":"prose","content":"Now when evening came, after the sun had set, they  bringing to Him all who were ill and those who were demon-possessed."}],[{"type":"prose","content":"And the whole city had gathered at the door."}],[{"type":"prose","content":"And He healed many who were ill with various diseases, and cast out many demons; and He would not permit the demons to speak, because they knew who He was."}],[{"type":"prose","content":"And in the early morning, while it was still dark, Jesus got up, left , and went away to a secluded place, and prayed there ."}],[{"type":"prose","content":"Simon and his companions eagerly searched for Him;"}],[{"type":"prose","content":"and they found Him and *said to Him, “Everyone is looking for You.”"}],[{"type":"prose","content":"He *said to them, "}],[{"type":"prose","content":"And He went into their synagogues preaching throughout Galilee, and casting out the demons."}],[{"type":"prose","content":"And a man with leprosy *came to Jesus, imploring Him and kneeling down, and saying to Him, “If You are willing, You can make me clean.”"}],[{"type":"prose","content":"Moved with compassion,  reached out with His hand and touched him, and *said to him, "}],[{"type":"prose","content":"And immediately the leprosy left him, and he was cleansed."}],[{"type":"prose","content":"And He sternly warned him and immediately sent him away,"}],[{"type":"prose","content":"and He *said to him, "}],[{"type":"prose","content":"But he went out and began to proclaim it freely and to spread the news around, to such an extent that Jesus could no longer publicly enter a city, but stayed out in unpopulated areas; and they were coming to Him from everywhere."}]]