[[],[{"type":"header","content":"John the Baptist Prepares the Way"},{"type":"prose","content":"This is the Good News about Jesus the Messiah, the Son of God. It began"}],[{"type":"prose","content":"just as the prophet Isaiah had written:"}],[{"type":"prose","content":"This messenger was John the Baptist. He was in the wilderness and preached that people should be baptized to show that they had repented of their sins and turned to God to be forgiven."}],[{"type":"prose","content":"All of Judea, including all the people of Jerusalem, went out to see and hear John. And when they confessed their sins, he baptized them in the Jordan River."}],[{"type":"prose","content":"His clothes were woven from coarse camel hair, and he wore a leather belt around his waist. For food he ate locusts and wild honey."}],[{"type":"prose","content":"John announced: “Someone is coming soon who is greater than I am—so much greater that I’m not even worthy to stoop down like a slave and untie the straps of his sandals."}],[{"type":"prose","content":"I baptize you with water, but he will baptize you with the Holy Spirit!”"}],[{"type":"header","content":"The Baptism and Temptation of Jesus"},{"type":"prose","content":"One day Jesus came from Nazareth in Galilee, and John baptized him in the Jordan River."}],[{"type":"prose","content":"As Jesus came up out of the water, he saw the heavens splitting apart and the Holy Spirit descending on him like a dove."}],[{"type":"prose","content":"And a voice from heaven said, “You are my dearly loved Son, and you bring me great joy.”"}],[{"type":"prose","content":"The Spirit then compelled Jesus to go into the wilderness,"}],[{"type":"prose","content":"where he was tempted by Satan for forty days. He was out among the wild animals, and angels took care of him."}],[{"type":"prose","content":"Later on, after John was arrested, Jesus went into Galilee, where he preached God’s Good News."}],[{"type":"prose","content":" he announced. "}],[{"type":"header","content":"The First Disciples"},{"type":"prose","content":"One day as Jesus was walking along the shore of the Sea of Galilee, he saw Simon and his brother Andrew throwing a net into the water, for they fished for a living."}],[{"type":"prose","content":"Jesus called out to them, "}],[{"type":"prose","content":"And they left their nets at once and followed him."}],[{"type":"prose","content":"A little farther up the shore Jesus saw Zebedee’s sons, James and John, in a boat repairing their nets."}],[{"type":"prose","content":"He called them at once, and they also followed him, leaving their father, Zebedee, in the boat with the hired men."}],[{"type":"header","content":"Jesus Casts Out an Evil Spirit"},{"type":"prose","content":"Jesus and his companions went to the town of Capernaum. When the Sabbath day came, he went into the synagogue and began to teach."}],[{"type":"prose","content":"The people were amazed at his teaching, for he taught with real authority—quite unlike the teachers of religious law."}],[{"type":"prose","content":"Suddenly, a man in the synagogue who was possessed by an evil spirit cried out,"}],[{"type":"prose","content":"“Why are you interfering with us, Jesus of Nazareth? Have you come to destroy us? I know who you are—the Holy One of God!”"}],[{"type":"prose","content":"But Jesus reprimanded him.  he ordered."}],[{"type":"prose","content":"At that, the evil spirit screamed, threw the man into a convulsion, and then came out of him."}],[{"type":"prose","content":"Amazement gripped the audience, and they began to discuss what had happened. “What sort of new teaching is this?” they asked excitedly. “It has such authority! Even evil spirits obey his orders!”"}],[{"type":"prose","content":"The news about Jesus spread quickly throughout the entire region of Galilee."}],[{"type":"header","content":"Jesus Heals Many People"},{"type":"prose","content":"After Jesus left the synagogue with James and John, they went to Simon and Andrew’s home."}],[{"type":"prose","content":"Now Simon’s mother-in-law was sick in bed with a high fever. They told Jesus about her right away."}],[{"type":"prose","content":"So he went to her bedside, took her by the hand, and helped her sit up. Then the fever left her, and she prepared a meal for them."}],[{"type":"prose","content":"That evening after sunset, many sick and demon-possessed people were brought to Jesus."}],[{"type":"prose","content":"The whole town gathered at the door to watch."}],[{"type":"prose","content":"So Jesus healed many people who were sick with various diseases, and he cast out many demons. But because the demons knew who he was, he did not allow them to speak."}],[{"type":"header","content":"Jesus Preaches in Galilee"},{"type":"prose","content":"Before daybreak the next morning, Jesus got up and went out to an isolated place to pray."}],[{"type":"prose","content":"Later Simon and the others went out to find him."}],[{"type":"prose","content":"When they found him, they said, “Everyone is looking for you.”"}],[{"type":"prose","content":"But Jesus replied, "}],[{"type":"prose","content":"So he traveled throughout the region of Galilee, preaching in the synagogues and casting out demons."}],[{"type":"header","content":"Jesus Heals a Man with Leprosy"},{"type":"prose","content":"A man with leprosy came and knelt in front of Jesus, begging to be healed. “If you are willing, you can heal me and make me clean,” he said."}],[{"type":"prose","content":"Moved with compassion, Jesus reached out and touched him.  he said. "}],[{"type":"prose","content":"Instantly the leprosy disappeared, and the man was healed."}],[{"type":"prose","content":"Then Jesus sent him on his way with a stern warning:"}],[],[{"type":"prose","content":"But the man went and spread the word, proclaiming to everyone what had happened. As a result, large crowds soon surrounded Jesus, and he couldn’t publicly enter a town anywhere. He had to stay out in the secluded places, but people from everywhere kept coming to him."}]]