[{"num":1,"verse":"The Gospel of Jesus Christ, the Son of God begins with the fulfilment of this prophecy of Isaiah—‘Behold, I send my messenger before your face, who will prepare your way before you’. ‘The voice of one crying in the wilderness: Prepare the way of the Lord, make his paths straight’."},{"num":4,"verse":"For John came and began to baptise men in the desert, proclaiming baptism as the mark of a complete change of heart and of the forgiveness of sins. All the people of the Judean countryside and everyone in Jerusalem went out to him in the desert and received his baptism in the river Jordan, publicly confessing their sins."},{"num":6,"verse":"John himself was dressed in camel-hair, with a leather belt round his waist, and he lived on locusts and wild honey. The burden of his preaching was, “There is someone coming after me who is stronger than I—indeed I am not good enough to kneel down and undo his shoes. I have baptised you with water, but he will baptise you with the Holy Spirit.”"},{"header":"The arrival of Jesus"},{"num":9,"verse":"It was in those days that Jesus arrived from the Galilean village of Nazareth and was baptised by John in the Jordan. All at once, as he came up out of the water, he saw the heavens split open, and the Spirit coming down upon him like a dove. A voice came out of Heaven, saying, “You are my dearly-beloved Son, in whom I am well pleased!”"},{"num":12,"verse":"Then the Spirit sent him out at once into the desert, and there he remained for forty days while Satan tempted him. During this time no one was with him but wild animals, and only the angels were there to care for him."},{"header":"Jesus begins to preach the gospel, and to call men to follow him"},{"num":14,"verse":"It was after John’s arrest that Jesus came into Galilee, proclaiming the Gospel of God, saying, “The time has come at last—the kingdom of God has arrived. You must change your hearts and minds and believe the good news.”"},{"num":16,"verse":"As he walked along the shore of the Lake of Galilee, he saw two fishermen, Simon and his brother Andrew, casting their nets into the water. “Come and follow me, and I will teach you to catch men!” he cried."},{"num":18,"verse":"At once they dropped their nets, and followed him."},{"num":19,"verse":"Then he went a little further along the shore and saw James the son of Zebedee, aboard a boat with his brother John, overhauling their nets. At once he called them, and they left their father Zebedee in the boat with the hired men, and went off after him."},{"header":"Jesus begins healing the sick"},{"num":21,"verse":"They arrived at Capernaum, and on the Sabbath day Jesus walked straight into the synagogue and began teaching. They were amazed at his way of teaching, for he taught with the ring of authority—quite unlike the scribes. All at once, a man in the grip of an evil spirit appeared in the synagogue shouting out, “What have you got to do with us, Jesus from Nazareth? Have you come to kill us? I know who you are—you’re God’s holy one!”"},{"num":25,"verse":"But Jesus cut him short and spoke sharply, “Hold your tongue and get out of him!”"},{"num":26,"verse":"At this the evil spirit convulsed the man, let out a loud scream and left him. Everyone present was so astounded that people kept saying to each other, “What on earth has happened? This new teaching has authority behind it. Why he even gives his orders to evil spirits and they obey him!”"},{"num":28,"verse":"And his reputation spread like wild-fire through the whole Galilean district."},{"num":29,"verse":"Then he got up and went straight from the synagogue to the house of Simon and Andrew, accompanied by James and John. Simon’s mother-in-law was in bed with a high fever, and they lost no time in telling Jesus about her. He went up to her, took her hand and helped her to her feet. The fever left her, and she began to see to their needs."},{"num":32,"verse":"Late that evening, after sunset, they kept bringing to him all who were sick or troubled by evil spirits. The whole population of the town gathered round the doorway. And he healed great numbers of people who were suffering from various forms of disease. In many cases he expelled evil spirits; but he would not allow them to say a word, for they knew perfectly well who he was."},{"header":"He retires for private prayer"},{"num":35,"verse":"Then, in the early morning, while it was still dark, Jesus got up, left the house and went off to a deserted place, and there he prayed. Simon and his companions went in search of him, and when they found him, they said, “Everyone is looking for you.”"},{"num":38,"verse":"“Then we will go somewhere else, to the neighbouring towns,” he replied, “so that I may give my message there too—that is why I have come.”"},{"num":39,"verse":"So he continued preaching in their synagogues and expelling evil spirits throughout the whole of Galilee."},{"header":"Jesus cures leprosy"},{"num":40,"verse":"Then a leper came to Jesus, knelt in front of him and appealed to him, “If you want to, you can make me clean.”"},{"num":41,"verse":"Jesus was filled with pity for him, and stretched out his hand and placed it on the leper, saying, “Of course I want to—be clean!”"},{"num":42,"verse":"At once the leprosy left him and he was quite clean. Jesus sent him away there and then with the strict injunction, “Mind you say nothing at all to anybody. Go straight off and show yourself to the priest, and make the offerings for your cleansing which Moses prescribed, as public proof of your recovery.”"},{"num":45,"verse":"But he went off and began to talk a great deal about it in public, spreading his story far and wide. Consequently, it became impossible for Jesus to show his face in the towns and he had to stay outside in lonely places. Yet the people still came to him from all quarters."}]