[{"num":13,"verse":"On that day the Book of Moses was read while the people were listening. They heard the passage that no Ammonite or Moabite should ever be admitted into God’s assembly. "},{"num":2,"verse":"(After all, they didn’t welcome the Israelites with food and water. Instead, they hired Balaam to curse the Israelites. But our God turned the curse into a blessing.) "},{"num":3,"verse":"After the people heard this Teaching, they separated the non-Israelites from the Israelites."},{"num":4,"verse":"Even before this, the priest Eliashib, who was related to Tobiah and had been put in charge of the storerooms of our God’s temple, "},{"num":5,"verse":"had provided a large room for Tobiah. Previously, this room had been used to store grain offerings, incense, utensils, a tenth of all the grain harvested, new wine, and olive oil. These things belonged by law to the Levites, singers, and gatekeepers. The contributions for the priests had also been stored there."},{"header":"Nehemiah Evicts Tobiah from the Temple"},{"num":6,"verse":"While all of this was taking place, I wasn’t in Jerusalem. In the thirty-second year of King Artaxerxes’ reign in Babylon, I returned to the king. Later, I asked the king for permission to return. "},{"num":7,"verse":"I went to Jerusalem and discovered the evil thing Eliashib had done by providing Tobiah with a room in God’s temple. "},{"num":8,"verse":"I was furious. So I threw all of Tobiah’s household goods out of the room. "},{"num":9,"verse":"Then I told them to cleanse the rooms, and I put back in there the utensils from God’s temple, the offerings, and the incense."},{"header":"Nehemiah Ensures That the Levites Receive Their Portion of the Offerings"},{"num":10,"verse":"I learned that the Levites had not been given their portions. So each of the Levites and singers, who conducted the worship ⌞in the temple⌟, had left for their own fields. "},{"num":11,"verse":"I reprimanded the leaders. “Why is God’s temple being neglected?” I asked. So I brought the Levites back together and put them back in their places of service. "},{"num":12,"verse":"Then all Judah brought a tenth of all the grain harvested, new wine, and olive oil to the storerooms. "},{"num":13,"verse":"I appointed the following men to be in charge of the storerooms: Shelemiah the priest, Zadok the scribe, and Pedaiah the Levite, and I appointed Hanan, son of Zaccur and grandson of Mattaniah to help them. Since they could be trusted, I made them responsible for distributing ⌞the portions⌟ to their relatives."},{"num":14,"verse":"⌞Nehemiah prayed,⌟ “Remember me for what I have done, my God, and don’t wipe out the good things that I have done for your temple and for the worship that is held there.”"},{"header":"Nehemiah Ensures That No Work Is Done on the Day of Rest"},{"num":15,"verse":"In those days I saw people in Judah stomping grapes in the winepresses on the day of rest—a holy day. I saw them bringing in loads of wine, grapes, figs, and every other kind of load. They piled the loads on donkeys and brought them into Jerusalem on the day of rest. I warned them about selling food on that day. "},{"num":16,"verse":"People from Tyre who lived in Jerusalem were bringing in fish and all kinds of goods. They were selling them on the day of rest—a holy day, to the people of Judah, even in Jerusalem. "},{"num":17,"verse":"I reprimanded the nobles of Judah and asked them, “What is this evil thing you’re doing? How dare you treat the day of rest—a holy day, as unholy! "},{"num":18,"verse":"Isn’t this what your ancestors did, with the results that our God brought all these evils on us and on this city? Now you’re making him even more angry with Israel by treating the day of rest—a holy day, as unholy.”"},{"num":19,"verse":"Before the day of rest—a holy day, when the gates of Jerusalem were cleared of traffic, I ordered the doors to be shut and not to be reopened until after the day of rest. I stationed some of my men by the gates to make sure that no loads could be brought in on the day of rest. "},{"num":20,"verse":"Once or twice merchants and those who sell all kinds of goods spent the night outside Jerusalem. "},{"num":21,"verse":"I warned them. “Why are you spending the night in front of the wall?” I asked them. “If you do it again, I’ll arrest you.” After that, they no longer came on the day of rest—a holy day. "},{"num":22,"verse":"Then I told the Levites to cleanse themselves and guard the gates to keep the day of rest holy."},{"header":"Nehemiah Dissolves Marriages to Foreigners"},{"num":23,"verse":"In those days I saw some Jews who had married women from Ashdod, Ammon, and Moab. "},{"num":24,"verse":"Half their children spoke the language of Ashdod or one of the other languages, but they couldn’t understand the language of Judah well enough to speak it. "},{"num":25,"verse":"So I reprimanded those Jews, cursed them, beat some of them, and pulled out their hair. I made them swear by God: “We won’t allow our daughters to marry their sons, and we won’t allow their daughters to marry us or our sons.” "},{"num":26,"verse":"I said, “Wasn’t it because of marriages like these that King Solomon of Israel sinned? There wasn’t a king like him among all nations. God loved him, and God made him king of all Israel. But his non-Israelite wives led him to sin. "},{"num":27,"verse":"Should we follow your example, commit such a serious crime against our God, and be unfaithful to him by marrying non-Israelite women?”"},{"num":28,"verse":"Even one of Joiada’s sons was a son-in-law of Sanballat from Beth Horon. (Joiada was the son of the chief priest Eliashib.) I chased Joiada’s son away from me."},{"num":29,"verse":"⌞Nehemiah prayed,⌟ “Remember them, my God, because they have contaminated the priestly office and the promise  you made to the priests and Levites.”"},{"num":30,"verse":"So I cleansed them from everything that was foreign. I assigned duties to the priests and Levites. Each one had his own assignment. "},{"num":31,"verse":"I also arranged for delivering wood at regular times and for bringing the first produce to be harvested."}]