[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Knoweth afar off.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "recognises from afar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From His exaltation Jehovah looks down alike on the lowly and on the proud, but it is to show a gracious interest in the former, while the latter are merely marked as persons to be kept at a distance. “Lowliness and humility are the court dress of God; he who wears them will please Him well.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 138:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 138:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Though the Lord be high — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And neither need any of his creatures, nor can be benefited by them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet hath he respect unto the lowly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Unto such as are mean and obscure in the world; to me, a poor contemptible shepherd, whom he hath preferred before great princes; and to such as are little in their own eyes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But the proud he knoweth afar off — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But, as for the great men of the world, who are lifted up in pride, he looks upon them, as they do upon others, with scorn and contempt, and keeps them at a great distance, as disdaining to admit them into his presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "138:6-8 Though the Lord is high, yet he has respect to every lowly, humbled sinner; but the proud and unbelieving will be banished far from his blissful presence. Divine consolations have enough in them to revive us, even when we walk in the midst of troubles. And God will save his own people that they may be revived by the Holy Spirit, the Giver of life and holiness. If we give to God the glory of his mercy, we may take to ourselves the comfort. This confidence will not do away, but quicken prayer. Whatever good there is in us, it is God works in us both to will and to do. The Lord will perfect the salvation of every true believer, and he will never forsake those whom he has created anew in Christ Jesus unto good works.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Though the Lord be high - This might be rendered \"For lofty is Yahweh - and the humble he sees - and the proud he knows from afar.\" The idea is, that God - so high and exalted - sees and knows all of every rank among people. The mind of the psalmist had been impressed with a sense of the greatness and majesty of God, but (as if it might be said that one so great could not regard man, so humble and insignificant) he adds, that the fact of God's exaltation does not prevent his noticing the affairs of people: that the lowly in life need not fear lest they should be overlooked; the proud need not hope that they will escape the notice of his eye.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet hath he respect unto the lowly - Those in humble life; the obscure; the unknown. It does not mean here that he has any special favor toward them, but merely that he sees them. Their low and obscure condition does not prevent his observing them, and they need have no fear that he will overlook them, or that they will be forgotten. Compare the notes at James 4:6; notes at 1 Peter 5:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet hath he respect unto the lowly - Those in humble life; the obscure; the unknown. It does not mean here that he has any special favor toward them, but merely that he sees them. Their low and obscure condition does not prevent his observing them, and they need have no fear that he will overlook them, or that they will be forgotten. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But the proud - Those of lofty rank, and of lofty feelings; the haughty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He knoweth afar off - From afar. Though he is exalted - though he is in heaven - yet he is not so far removed but that he sees them, and knows them altogether. Distance from him is no protection for them; nor can the wicked hope to escape notice from the fact that God reigns over distant worlds. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He knoweth afar off - From afar. Though he is exalted - though he is in heaven - yet he is not so far removed but that he sees them, and knows them altogether. Distance from him is no protection for them; nor can the wicked hope to escape notice from the fact that God reigns over distant worlds. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6, 7. On this general principle of God's government (Isa 2:11; 57:15; 66:2), he relies for God's favor in saving him, and overthrowing his enemies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "knoweth afar off—their ways and deserts (Ps 1:6).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "knoweth afar off—their ways and deserts (Ps 1:6).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6 Though the Lord be high, yet hath he respect unto the lowly: but the proud he knoweth afar off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 Though I walk in the midst of trouble, thou wilt revive me, thou shalt stretch forth thine hand against the wrath of mine enemies, and thy right hand shall save me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8 The Lord will perfect that which concerneth me: thy mercy, O Lord, endureth for ever - forsake not the works of thine own hands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 138:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 138:6",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Though the Lord be high.\" In greatness, dignity, and power, Jehovah is higher than the highest. His nature is high above the comprehension of his creatures, and his glory even exceeds the loftiest soarings of imagination. \"Yet hath he respect unto the lowly.\" He views them with pleasure, thinks of them with care, listens to their prayers, and protects them from evil. Because they think little of themselves he thinks much of them. They reverence him, and he respects them. They are low in their own esteem, and he makes them high in his esteem. \"But the proud he knoweth afar off.\" He does not need to come near them in order to discover their utter vanity: a glance from afar reveals to him their emptiness and offensiveness. He has no fellowship with them, but views them from a distance; he is not deceived, but knows the truth about them, despite their blustering; he has no respect unto them, but utterly abhors them. To a Cain's sacrifice, a Pharaoh's promise, a Rabshakeh's threat, and a Pharisee's prayer, the Lord has no respect. Nebuchadnezzar, when far off from God, cried, \"Behold this great Babylon which I have builded;\" but the Lord knew him, and sent him grazing with cattle. Proud men boast loudly of their culture and \"the freedom of thought,\" and even dare to criticize their Maker: but he knows them from afar, and will keep them at arm's length in this life, and shut them up in hell in the next.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 138:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 138:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Though I walk in the midst of trouble, thou wilt revive me.\" If I am walking there now, or shall be doing so in years to come, I have no cause for fear; for God is with me, and will give me new life. When we are somewhat in trouble it is bad enough, but it is worse to penetrate into the centre of that dark continent and traverse its midst: yet in such a case the believer makes progress, for he walks; he keeps to a quiet pace, for he does no more than walk; and he is not without the best of company, for his God is near to pour fresh life into him. It is a happy circumstance that, if God be away at any other time, yet he is pledged to be with us in trying hours: \"when thou passest through the rivers I will be with thee.\" He is in a blessed condition who can confidently use the language of David, m \"thou wilt revive me.\" He shall not make his boast of God in vain: he shall be kept alive, and made more alive than ever. How often has the Lord quickened us by our sorrows! Are they not his readiest means of exciting to fulness of energy the holy life which dwells within us? If we receive reviving, we need not regret affliction. When God revives us, trouble will never harm us. \"Thou shalt stretch forth thine hand against the wrath of mine enemies, and thy right hand shall save me.\" This is the fact which would revive fainting David. Our foes fall when the Lord comes to deal with them; he makes short work of the enemies of his people, - with one hand he routs them. His wrath soon quenches their wrath; his hand stays their hand. Adversaries may be many, and malicious, and mighty; but our glorious Defender has only to stretch out his arm and their armies vanish. The sweet singer rehearses his assurance of salvation, and sings of it in the ears of the Lord, addressing him with this confident language. He will be saved, - saved dexterously, decidedly, divinely; he has no doubt about it. God's right hand cannot forget its cunning; Jerusalem is his chief joy, and he will defend his own elect.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 138:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 138:8",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord will perfect that which concerneth me.\" All my interests are safe in Jehovah's hands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The work which his goodness began,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The arm of his strength will complete;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His promise is yea and Amen,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And never was forfeited yet.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God is concerned in all that concerns his servants. He will see to it that none of their precious things shall fail of completion; their life, their strength, their hopes, their graces, their pilgrimage, shall each and all be perfected. Jehovah himself will see to this; and therefore it is most sure. \"Thy mercy, O Lord, endureth for ever.\" The refrain of the former Psalm is in his ears, and he repeats it as his own personal conviction and consolation. The first clause of the verse is the assurance of faith, and this second one reaches to the full assurance of understanding. God's work in us will abide unto perfection because God's mercy towards us thus abideth. \"Forsake not the works of thine own hands.\" Our confidence does not cause us to live without prayer, but encourages us to pray all the more. Since we have it written upon our hearts that God will perfect his work in us, and we see it also written in Scripture that his mercy changeth not, we with holy earnestness entreat that we may not be forsaken. If there be anything good in us, it is the work of God's own hands: will he leave it? Why has he wrought so much in us if he means to give us up? - it will be a sheer waste of effort. He who has gone so far will surely persevere with us to the end. Our hope for the final perseverance of the believer lies in the final perseverance of the believer's God. If the Lord begins to build, and does not finish, it will not be to his honour. He will have a desire to the work of his hands, for he knows what it has cost him already, and he will not throw away a vessel upon which he has expended so much of labour and skill. Therefore do we praise him with our whole heart, even in the presence of those who depart from his Holy Word, and set up another God and another gospel; which are not another, but there be some that trouble us. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unto the lowly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unto such as are mean and obscure in the world; to me, a poor contemptible shepherd, whom he hath preferred before great princes, and to such as are little in their own eyes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But the proud he knoweth afar off; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but for the great men of the world, who are lifted up in pride, he looks upon them as they do upon others, with scorn and contempt, and at a great distance, as disdaining to admit them into his presence. But the words may be, and by divers interpreters are, rendered otherwise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he who is high",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the lofty one from afar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (i.e. from his high and holy place, even the highest heavens, where he dwells, notwithstanding that distance,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doth know them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will own them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So this is the repetition of the former sentence, as is very usual in this book. And this seems best to suit, as with the foregoing, so also with the following words, and thus all will be understood of one and the same sort of persons. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Though the Lord be high,.... Above all the earth, and all the nations of it, and the highest of men in it; above the heavens, and the angels there, who are his creatures and at his command; above all the blessings and praises of his saints: the perfect knowledge of him is so high as not to be attained; and his thoughts and ways are higher than ours, as the heavens are higher than the earth; he is indeed the most High, higher than the highest; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 113:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". According to Arama, here begins the song, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the kings of the earth shall sing in the ways of the Lord?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yet hath he respect unto the lowly; for good, as the Targum; that are low in their own eyes, humbled under a sense of sin, convinced, of the insufficiency of their own righteousness to justify them, and made to submit to the righteousness of Christ; ascribe the whole of their salvation to the free grace of God; patiently and quietly bear every afflictive providence; think the worst of themselves, and the best of others; and, being the followers of the lowly Jesus, learn of him, imitate him, and become like unto him: these the Lord has a gracious respect unto; he looks upon them with a look of love; he has respect to their persons in Christ, and to their sacrifices for his sake, which are those of a broken and contrite heart; he regards their prayers, though low and destitute, and gives more grace unto them; yea, he condescends to dwell with them, and in due time highly exalts them; see Isaiah 57:15. David may have in view his own low state and condition as a shepherd, in which he was when the Lord took him, and raised him to the throne of Israel; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yet hath he respect unto the lowly; for good, as the Targum; that are low in their own eyes, humbled under a sense of sin, convinced, of the insufficiency of their own righteousness to justify them, and made to submit to the righteousness of Christ; ascribe the whole of their salvation to the free grace of God; patiently and quietly bear every afflictive providence; think the worst of themselves, and the best of others; and, being the followers of the lowly Jesus, learn of him, imitate him, and become like unto him: these the Lord has a gracious respect unto; he looks upon them with a look of love; he has respect to their persons in Christ, and to their sacrifices for his sake, which are those of a broken and contrite heart; he regards their prayers, though low and destitute, and gives more grace unto them; yea, he condescends to dwell with them, and in due time highly exalts them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". David may have in view his own low state and condition as a shepherd, in which he was when the Lord took him, and raised him to the throne of Israel; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "but the proud he knoweth afar off; the Targum adds, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"to destroy them:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "such who are proud of themselves and what they have; of their wisdom and knowledge, of their strength or beauty, of their wealth and riches; or of their righteousness and holiness; of the purity and goodness of their hearts, and power of their free will, they vainly think themselves possessed of; and despise others below them in these things, or the practice of them: these the Lord takes notice of, and looks upon them at a distance with scorn and contempt; nor will he admit them to nearness to him, nay, opposes himself to them, and sooner or later abases them; see Proverbs 3:34. The Septuagint and Vulgate Latin versions render it, \"high things he knoweth afar off\"; things too high for creatures, that are out of their reach; he sees and knows all persons and things, whether in heaven or in earth. Others render them, \"and the high One knoweth afar off\" (u); knows the lowly, owns and acknowledges them for his own; takes care of them, provides for them, and protects them: and then the sense is the same with the preceding clause. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "such who are proud of themselves and what they have; of their wisdom and knowledge, of their strength or beauty, of their wealth and riches; or of their righteousness and holiness; of the purity and goodness of their hearts, and power of their free will, they vainly think themselves possessed of; and despise others below them in these things, or the practice of them: these the Lord takes notice of, and looks upon them at a distance with scorn and contempt; nor will he admit them to nearness to him, nay, opposes himself to them, and sooner or later abases them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint and Vulgate Latin versions render it, \"high things he knoweth afar off\"; things too high for creatures, that are out of their reach; he sees and knows all persons and things, whether in heaven or in earth. Others render them, \"and the high One knoweth afar off\" (u); knows the lowly, owns and acknowledges them for his own; takes care of them, provides for them, and protects them: and then the sense is the same with the preceding clause. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) So Pagninus; \"quamvis\", Junius & Tremellius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) So Pagninus; \"quamvis\", Junius & Tremellius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Though the LORD be high, yet hath he respect unto the lowly: but the proud he knoweth {e} afar off.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Though the LORD ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " high, yet hath he respect unto the lowly: but the proud he knoweth ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " afar off.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Distance of place cannot hinder God to show mercy to his, and so judge the wicked though they think that he is far off.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For though Jehovah is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "high, yet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he seeth ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the lowly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Exalted as He is, Jehovah never loses sight of the lowly, and in due time raises them up (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 113:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.): and the haughty ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he knoweth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from afar; no distance hides them from His eye, and they cannot escape the punishment they deserve. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; and for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Though the Lord be high, yet hath he respect unto the lowly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Notwithstanding all God's glory and greatness, he condescends to look upon the lowly, to consider their needs, and to supply them (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hence David feels sure that he will not be overlooked (see vers. 7, 8). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But the proud he knoweth afar off",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God keeps proud men at a distance, does not draw near to them, much less make his abode with them, but leaves them to themselves until they are ripe for punishment. Psalm 138:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There are two things for which the poet gives thanks to God: He has answered him in the days of trouble connected with his persecution by Saul and in all distresses; and by raising him to the throne, and granting him victory upon victory, and promising him the everlasting possession of the throne, He has filled him with a proud courage, so that lofty feeling has taken up its abode in his soul, which was formerly fearful about help. Just as רהב signifies impetuosity, vehemence, and then also a monster, so הרהיב signifies both to break in upon one violently and overpowerlingly (Sol 6:5; cf. Syriac arheb, Arabic arhaba, to terrify), and to make any one courageous, bold, and confident of victory. בּנפשׁי עז forms a corollary to the verb that is marked by Mugrash or Dech: so that in my soul there was עז, i.e., power, viz., a consciousness of power (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The thanksgiving, which he, the king of the promise, offers to God on account of this, will be transmitted to all the kings of the earth when they shall hear (שׁמעוּ in the sense of a fut. exactum) the words of His mouth, i.e., the divine אמרה, and they shall sing of (שׁיר with בּ, like דּבּר בּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", שׂיח בּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and frequently, הלּל בּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", הזכּיר בּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the like) the ways of the God of the history of salvation, they shall sing that great is the glory of Jahve. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 138:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tells us by what means He has so super-gloriously manifested Himself in His leadings of David. He has shown Himself to be the Exalted One who is His all-embracing rule does not leave the lowly (cf. David's confessions in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 131:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") unnoticed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 113:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but on the contrary makes him the especial object of His regard; and on the other hand even from afar (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He sees through (ידע as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the lofty one who thinks himself unobserved and conducts himself as if he were answerable to no higher being (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In correct texts וגבה has Mugrash, and ממרחק Mercha. The form of the fut. Kal יידע is formed after the analogy of the Hiphil forms ייליל in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently, and ייטיב in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 24:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; probably the word is intended to be all the more emphatic, inasmuch as the first radical, which disappears in ידע, is thus in a certain measure restored.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Greek imperfects with the double (syllabic and temporal) augment, as ἑώρων, ἀνέῳγον, are similar. Chajuǵ also regards the first Jod in these forms as the preformative and the second as the radical, whereas Abulwald, Gramm. ch. xxvi. p. 170, explains the first as a prosthesis and the second as the preformative. According to the view of others, e.g., of Kimchi, יידע might be fut. Hiph. weakened from יהדע (יהידיע), which, apart from the unsuitable meaning, assumes a change of consonants that is all the more inadmissible as ידע itself springs from ודע. Nor is it to be supposed that יידע is modified from יידע (Luzzatto, 197), because it is nowhere written יידע.) ",
        "children": []
      }
    ]
  }
]