[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 44:29-30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:29-30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And this shall be a sign unto you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Signs are usually antecedent to the thing signified, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but here, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the word is taken, in a larger sense, for a circumstance that should attend the thing signified. It may be observed, however, that although the destruction of these Jews, and that of Pharaoh, were things immediately following each other, yet the latter was in order before the other. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will give Pharaoh-hophra into the hand of his enemies — Pharaoh ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was a name common, in ancient times, to all the kings of Egypt; but several of them had some additional epithet to distinguish them from the rest. Thus the predecessor of this king was called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pharaoh- nechoh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pharaoh-hophra ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "appears to have been the same that is called by profane authors ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apries; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and his unfortunate end, in exact conformity with this prediction, is particularly related by Herodotus, lib. 2. cap. 169, and by Diodorus Siculus, lib. 1. p. 43. “His subjects rebelling, he sent Amasis, one of his generals, to reduce them to their duty; but no sooner had Amasis begun to make his speech than they fixed a helmet on his head, and proclaimed him king. Amasis accepted the title, and confirmed the Egyptians in their rebellion; and the greater part of the nation declaring for him, Apries was obliged to retire into Upper Egypt; and the country, being thus weakened by intestine war, was attacked and easily overcome by Nebuchadnezzar, who, on quitting it, left Amasis his viceroy. After Nebuchadnezzar’s departure, Apries marched against Amasis, but, being defeated at Memphis, was taken prisoner, carried to Sais, and strangled in his own palace; thus verifying this prophecy.” See Rollin’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ancient Hist., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vol. 1., and Bishop Newton on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prophecies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vol. 1. p. 362. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44:20-30 Whatever evil comes upon us, it is because we have sinned against the Lord; we should therefore stand in awe, and sin not. Since they were determined to persist in their idolatry, God would go on to punish them. What little remains of religion were among them, would be lost. The creature-comforts and confidences from which we promise ourselves most, may fail as soon as those from which we promise ourselves least; and all are what God makes them, not what we fancy them to be. Well-grounded hopes of our having a part in the Divine mercy, are always united with repentance and obedience.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Literally, \"And fugitives from the sword (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 44:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") shall return from the land of Egypt to the land of Judah, mere of number, i. e., so few that they can be counted: and all the remnant of Jadah that are going etc.\" So unendurable shall be their sufferings in Egypt, that the men now abandoning Judaea in the hope of finding an asylum there shall be glad to return like runaways from a lost battle.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whose words ... - Whose word shall stand, from Me or from them, i. e., the one prediction, that their descent into Egypt would be their ruin, which they denied.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Whose words ... - Whose word shall stand, from Me or from them, i. e., the one prediction, that their descent into Egypt would be their ruin, which they denied.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29. this … sign unto you—The calamity of Pharaoh-hophra (see on [970]Jer 44:30) shall be a sign to you that as he shall fall before his enemy, so you shall subsequently fall before Nebuchadnezzar (Mt 24:8) [Grotius]. Calvin makes the \"sign\" to be simultaneous with the event signified, not antecedent to it, as in Ex 3:12. The Jews believed Egypt impregnable, so shut in was it by natural barriers. The Jews being \"punished in this place\" will be a sign that their view is false, and God's threat true. He calls it \"a sign unto you,\" because God's prediction is equivalent to the event, so that they may even now take it as a sign. When fulfilled it would cease to be a sign to them: for they would be dead.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Signs are usually antecedent to the thing signified, but the word is taken in a larger notion in this place, for that which should attend the thing signified by it, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 3:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; besides, though their destruction and the destruction of Pharaoh-hophra were things immediately following one another, yet the latter was in order before the other. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And this shall be a sign unto you, saith the Lord, that I will punish you in this place,.... In Egypt, as before threatened; and what follows is a confirming sign that so it would be; and which, when observed by some, gave the hint to them to make their escape; though others, being hardened in their idolatry, impenitence, and unbelief, continued, and perished: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that ye may know that my words shall surely stand against you for evil; which sign, when they should see, they might assure themselves that the threatenings of evil to them would certainly be accomplished, as sure as they saw the sign given, which is as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that ye may know that my words shall surely stand against you for evil; which sign, when they should see, they might assure themselves that the threatenings of evil to them would certainly be accomplished, as sure as they saw the sign given, which is as follows: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And this shall be a sign unto you, saith the LORD, that I will punish you in this place, that ye may know that my words shall surely stand against you for evil:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And this shall be the sign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It has been inferred, but unnecessarily, from the close correspondence of these ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vv",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". with the above piece of history that these two verses are an interpolation made after the event. Pharaoh Hophra (the Greek Apries) reigned from b.c. 589 to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 570, when he was overthrown by the troops whom he had sent against Cyrene, and who had mutinied (Herod. II. 152 ff.). Amasis succeeded him and handed him over to the Egyptians, who strangled him seven years later (Herod. II. 161–163, 169).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A sign;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the sign.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jeremiah 44:29",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In confirmation of this threatening, the Lord gives them another sign which, when it is fulfilled, will let them know that the destruction announced to them shall certainly befall them. The token consists in the giving up of King Hophra into the hand of his enemies. As certainly as this shall take place, so certainly shall the extermination of the Jews in Egypt ensue. The name חפרע is rendered Οὐάφρις in Manetho, in the classical writers  ̓Απρίης, Apris, who, according to Herodotus (ii. 161), reigned twenty-five years, but nineteen according to Manetho (cf. Boeckh, Manetho, etc., p. 341ff.). His death took place in the year 570 b.c. This date is reached by a comparison of the following facts: - Cambyses conquered Egypt in the year 525; and in the preceding year Amasis had died, after a reign of forty-four years (Herod. iii. 10). Hence Amasis - who took Apris prisoner, and gave him up to the common people, who killed him (Herod. ii.-161-163, 169) - must have commenced his reign in the year 570. On the death of Apris, or Hophra, cf. the explanation given on p. 353f., where we have shown that the words, \"I will give him into the hand of his enemies, and of those who seek his life,\" when compared with what is said of Zedekiah, \"into the hand of Nebuchadnezzar his enemy,\" do not require us to assume that Hophra was killed by Nebuchadnezzar, and can very well be harmonized with the notice of Herodotus regarding the death of this king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hitzig and Graf have taken objection to this sign given by Jeremiah, and regard Jeremiah 44:29, Jeremiah 44:30 as a spurious vaticinium ex eventu, the work of another hand. The reasons they urge are, that it is scarcely possible Jeremiah could have lived till 570; that Jeremiah 44:29. would be the only place where Jeremiah offered such a criterion; and that, even as it is, these verses contain nothing original, but, by their stiff and lifeless parallelism, are easily seen to be an artificial conclusion. Of these three arguments, the last can prove nothing, since it is merely a subjective opinion on an aesthetic point. The second, again, rather declares for than against the genuineness. For \"if it were not Jeremiah's usual, elsewhere, to offer some criterion, then such an interpolation would have been all the more carefully avoided\" (Ngelsbach). Of course we do not find any other signs of this kind in Jeremiah; but it does not follow from this that he could not offer such a thing in a special case. Yet the ground taken up by Ngelsbach, as sufficient to establish this position, seems quite untenable, viz., that the announcement of the fate in store for the king must have been the answer of the true God to the presumptuous boast of Apris, mentioned by Herodotus, \"that even God could not dethrone him, so firmly did he think he was established:\" this view of the matter seems too remote from the object of Jeremiah's address. And finally, the first-named objection receives importance only on the supposition that \"an event which was intended to serve as אות, a sign or criterion, must be something that was to happen immediately, or within a brief appointed period of time, so that a person might be able, from the occurrence of the one, to conclude that what had been foretold about a later period would as certainly take place\" (Graf). But there are no sufficient grounds for this hypothesis. If no definite time be fixed for the occurrence of this sign, then it may not appear till a considerable time afterwards, and yet be a pledge for the occurrence of what was predicted for a still later period. That Jeremiah 54ed till the year 570 is certainly not inconceivable, but it is not likely that he uttered the prophecy now before us at the advanced age of nearly eighty years. Now, if his address is allowed to be a real prophecy, and not a mere vaticinium ex eventu, as Hitzig, looking from his dogmatic standpoint, considers it, then it must have been uttered before the year 570; but whether this was two, or five, or ten years before, makes no material difference. The address itself contains nothing to justify the assumption of Graf, that it is closely connected with the prophecy in Jeremiah 43:8-13, and with the warning against the migration into Egypt, Jeremiah 42. That the Jews spoken of had not been long in Egypt, cannot be inferred from Jeremiah 44:8, Jeremiah 44:12, and Jeremiah 44:18; on the contrary, the fact that they had settled down in different parts of Egypt, and had assembled at Pathros for a festival, shows that they had been living there for a considerable time before. Nor does it follow, from the statement in Jeremiah 44:14 that they longed to return to Judah, that they had gone to Egypt some months before. The desire to return into the land of their fathers remains, in a measure, in the heart of the Jew even at the present day. After all, then, no valid reason can be assigned for doubting the genuineness of these verses.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hitzig and Graf have taken objection to this sign given by Jeremiah, and regard ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a spurious vaticinium ex eventu, the work of another hand. The reasons they urge are, that it is scarcely possible Jeremiah could have lived till 570; that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". would be the only place where Jeremiah offered such a criterion; and that, even as it is, these verses contain nothing original, but, by their stiff and lifeless parallelism, are easily seen to be an artificial conclusion. Of these three arguments, the last can prove nothing, since it is merely a subjective opinion on an aesthetic point. The second, again, rather declares for than against the genuineness. For \"if it were not Jeremiah's usual, elsewhere, to offer some criterion, then such an interpolation would have been all the more carefully avoided\" (Ngelsbach). Of course we do not find any other signs of this kind in Jeremiah; but it does not follow from this that he could not offer such a thing in a special case. Yet the ground taken up by Ngelsbach, as sufficient to establish this position, seems quite untenable, viz., that the announcement of the fate in store for the king must have been the answer of the true God to the presumptuous boast of Apris, mentioned by Herodotus, \"that even God could not dethrone him, so firmly did he think he was established:\" this view of the matter seems too remote from the object of Jeremiah's address. And finally, the first-named objection receives importance only on the supposition that \"an event which was intended to serve as אות, a sign or criterion, must be something that was to happen immediately, or within a brief appointed period of time, so that a person might be able, from the occurrence of the one, to conclude that what had been foretold about a later period would as certainly take place\" (Graf). But there are no sufficient grounds for this hypothesis. If no definite time be fixed for the occurrence of this sign, then it may not appear till a considerable time afterwards, and yet be a pledge for the occurrence of what was predicted for a still later period. That ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "ed till the year 570 is certainly not inconceivable, but it is not likely that he uttered the prophecy now before us at the advanced age of nearly eighty years. Now, if his address is allowed to be a real prophecy, and not a mere vaticinium ex eventu, as Hitzig, looking from his dogmatic standpoint, considers it, then it must have been uttered before the year 570; but whether this was two, or five, or ten years before, makes no material difference. The address itself contains nothing to justify the assumption of Graf, that it is closely connected with the prophecy in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 43:8-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and with the warning against the migration into Egypt, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That the Jews spoken of had not been long in Egypt, cannot be inferred from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; on the contrary, the fact that they had settled down in different parts of Egypt, and had assembled at Pathros for a festival, shows that they had been living there for a considerable time before. Nor does it follow, from the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that they longed to return to Judah, that they had gone to Egypt some months before. The desire to return into the land of their fathers remains, in a measure, in the heart of the Jew even at the present day. After all, then, no valid reason can be assigned for doubting the genuineness of these verses.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "On the fulfilment of these threatenings Ngelsbach remarks: \"Every one must be struck on finding that, in Jeremiah 44, the extermination of the Jews who dwelt in Egypt is predicted; while some centuries later, the Jews in Egypt were very numerous, and that country formed a central point for the Jewish exiles (cf. Herzog, Real-Encycl. xvii. S. 285). Alexander the Great found so many Jews in Egypt, that he peopled with Jews, in great measure, the city he had founded and called after himself (cf. Herzog, i. S. 235). How did these Jews get to Egypt? Whence the great number of Jews whom Alexander found already in Egypt? I am inclined to think that we must consider them, for the most part, as the descendants of those who had come into the country with Jeremiah. But, according to this view of the matter, Jeremiah's prophecy has not been fulfilled.\" Ngelsbach therefore thinks we must assume that idolatrous worship, through time, almost entirely ceased among the exiled Jews in Egypt as it did among those in Babylon, and that the Lord then, in return, as regards the penitents, repented of the evil which He had spoken against them (Jeremiah 26:13, Jeremiah 26:19). But this whole explanation is fundamentally wrong, since the assertion, that Alexander the Great found so many Jews in Egypt, that with them mainly he peopled the city of Alexandria which he had founded, is contrary to historic testimony. In Herzog (Real-Encycl. i. S. 235), to which Ngelsbach refers for proof on the point, nothing of the kind is to be found, but rather the opposite, viz., the following: \"Soon after the foundation of Alexandria by Alexander the Great, this city became not merely the centre of Jewish Hellenism in Egypt, but generally speaking the place of union between Oriental and Occidental Jews. The external condition of the Jews of Alexandria must, on the whole, be characterized as highly prosperous. The first Jewish settlers had, indeed, been compelled by Alexander the Great to take up their residence in the city (Josephus, Antt. xv. 3. 1); so, too, were other Jews, by Ptolemy I. or Lagi (ibid. xii. 2. 4). But both of these monarchs granted them the same rights and privileges as the Macedonians, including Greek citizenship; and in consequence of the extremely advantageous position of the city, it speedily increased in importance. A still larger number, therefore, soon went thither of their own accord, and adopted the Greek language.\" In this account, the quotation from Josephus, Antt. xv. 3. 1, is certainly incorrect; for neither is there in that passage any testimony borne to the measures attributed to Alexander, nor are there any other historical testimonies given from antiquity. But as little can we find any proofs that Alexander the Great found so many Jews in Egypt that he could, to a large extent, people with them the city he had founded. It is merely testified by Josephus (Antt. xi. 8. 5), and by Hecataeus in Josephus (contra Ap. i. 22; p. 457, ed. Haverc.), that Alexander had Jewish soldiers in his army; it is further evident, from a notice in Josephus, de bell. Jud. ii. 18. 7, contra Ap. ii. 4) cf. Curtius Rufus, iv. 8), that the newly founded city, even under Alexander, immediately after it was commenced, and still more under Ptolemy Lagi (cf. Josephus, Antt. xii. 1, and Hecataeus in Jos. contra Ap. i. 22, p. 455), attracted a constantly increasing multitude of Jewish immigrants. This same Ptolemy, after having subdued Phoenicia and Coele-Syria in the year 320, and taken Jerusalem also, it would seem, by a stratagem on a Sabbath day, transported many captives and hostages out of the whole country into Egypt; many, too, must have been sold at that time as slaves to the inhabitants of such a wealthy country as Egypt: see a statement in the book of Aristeas, at the end of Havercamp's edition of Josephus, ii. p. 104. In the same place, and in Josephus' Antt. xii. 1, Ptolemy is said to have armed 30,000 Jewish soldiers, placed them as garrisons in the fortresses, and granted them all the rights of Macedonian citizens (ἰσοπολιτεία). Ewald well says, History of the People of Israel, vol. iv. of second edition, p. 254: \"When we further take into consideration, that, in addition to all other similar disasters which had previously befallen them, many Jews were removed to Egypt (especially by Ochus, after Egypt had been reconquered), we can easily explain how Ptolemy Philadelphus can be said to have liberated 100,000 Egyptian Jews. Aristeas' Book, p. 105.\" This much, at least, is proved by these various notices, - that, in order to understand how such a vast increase took place in the number of the Jews in Egypt, we do not need to regard them as the descendants of those who removed thither with Jeremiah, and so to question the fulfilment of the prophecy now before us. Jeremiah does not, of course, threaten with destruction all those Jews who live in Egypt, but only those who at that time went thither against the divine will, and there persevered in their idolatry. We do not know how great may have been the number of these immigrants, but they could hardly exceed two thousand, - perhaps, indeed, there were not so many. All these, as had been foretold them, may have perished in the conquest of Egypt by the Chaldeans, and afterwards, through the sword, famine, and pestilence; for the myriads of Jews in Egypt at the time of Ptolemy Lagi could easily have removed thither during the period of 250 years intermediate between the immigration in Jeremiah's time and the foundation of Alexandria, partly as prisoners and slaves, partly through voluntary settlement. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the fulfilment of these threatenings Ngelsbach remarks: \"Every one must be struck on finding that, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the extermination of the Jews who dwelt in Egypt is predicted; while some centuries later, the Jews in Egypt were very numerous, and that country formed a central point for the Jewish exiles (cf. Herzog, Real-Encycl. xvii. S. 285). Alexander the Great found so many Jews in Egypt, that he peopled with Jews, in great measure, the city he had founded and called after himself (cf. Herzog, i. S. 235). How did these Jews get to Egypt? Whence the great number of Jews whom Alexander found already in Egypt? I am inclined to think that we must consider them, for the most part, as the descendants of those who had come into the country with Jeremiah. But, according to this view of the matter, Jeremiah's prophecy has not been fulfilled.\" Ngelsbach therefore thinks we must assume that idolatrous worship, through time, almost entirely ceased among the exiled Jews in Egypt as it did among those in Babylon, and that the Lord then, in return, as regards the penitents, repented of the evil which He had spoken against them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But this whole explanation is fundamentally wrong, since the assertion, that Alexander the Great found so many Jews in Egypt, that with them mainly he peopled the city of Alexandria which he had founded, is contrary to historic testimony. In Herzog (Real-Encycl. i. S. 235), to which Ngelsbach refers for proof on the point, nothing of the kind is to be found, but rather the opposite, viz., the following: \"Soon after the foundation of Alexandria by Alexander the Great, this city became not merely the centre of Jewish Hellenism in Egypt, but generally speaking the place of union between Oriental and Occidental Jews. The external condition of the Jews of Alexandria must, on the whole, be characterized as highly prosperous. The first Jewish settlers had, indeed, been compelled by Alexander the Great to take up their residence in the city (Josephus, Antt. xv. 3. 1); so, too, were other Jews, by Ptolemy I. or Lagi (ibid. xii. 2. 4). But both of these monarchs granted them the same rights and privileges as the Macedonians, including Greek citizenship; and in consequence of the extremely advantageous position of the city, it speedily increased in importance. A still larger number, therefore, soon went thither of their own accord, and adopted the Greek language.\" In this account, the quotation from Josephus, Antt. xv. 3. 1, is certainly incorrect; for neither is there in that passage any testimony borne to the measures attributed to Alexander, nor are there any other historical testimonies given from antiquity. But as little can we find any proofs that Alexander the Great found so many Jews in Egypt that he could, to a large extent, people with them the city he had founded. It is merely testified by Josephus (Antt. xi. 8. 5), and by Hecataeus in Josephus (contra Ap. i. 22; p. 457, ed. Haverc.), that Alexander had Jewish soldiers in his army; it is further evident, from a notice in Josephus, de bell. Jud. ii. 18. 7, contra Ap. ii. 4) cf. Curtius Rufus, iv. 8), that the newly founded city, even under Alexander, immediately after it was commenced, and still more under Ptolemy Lagi (cf. Josephus, Antt. xii. 1, and Hecataeus in Jos. contra Ap. i. 22, p. 455), attracted a constantly increasing multitude of Jewish immigrants. This same Ptolemy, after having subdued Phoenicia and Coele-Syria in the year 320, and taken Jerusalem also, it would seem, by a stratagem on a Sabbath day, transported many captives and hostages out of the whole country into Egypt; many, too, must have been sold at that time as slaves to the inhabitants of such a wealthy country as Egypt: see a statement in the book of Aristeas, at the end of Havercamp's edition of Josephus, ii. p. 104. In the same place, and in Josephus' Antt. xii. 1, Ptolemy is said to have armed 30,000 Jewish soldiers, placed them as garrisons in the fortresses, and granted them all the rights of Macedonian citizens (ἰσοπολιτεία). Ewald well says, History of the People of Israel, vol. iv. of second edition, p. 254: \"When we further take into consideration, that, in addition to all other similar disasters which had previously befallen them, many Jews were removed to Egypt (especially by Ochus, after Egypt had been reconquered), we can easily explain how Ptolemy Philadelphus can be said to have liberated 100,000 Egyptian Jews. Aristeas' Book, p. 105.\" This much, at least, is proved by these various notices, - that, in order to understand how such a vast increase took place in the number of the Jews in Egypt, we do not need to regard them as the descendants of those who removed thither with Jeremiah, and so to question the fulfilment of the prophecy now before us. Jeremiah does not, of course, threaten with destruction all those Jews who live in Egypt, but only those who at that time went thither against the divine will, and there persevered in their idolatry. We do not know how great may have been the number of these immigrants, but they could hardly exceed two thousand, - perhaps, indeed, there were not so many. All these, as had been foretold them, may have perished in the conquest of Egypt by the Chaldeans, and afterwards, through the sword, famine, and pestilence; for the myriads of Jews in Egypt at the time of Ptolemy Lagi could easily have removed thither during the period of 250 years intermediate between the immigration in Jeremiah's time and the foundation of Alexandria, partly as prisoners and slaves, partly through voluntary settlement. ",
            "children": []
          }
        ]
      }
    ]
  }
]