[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will give them an heart to know me . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Of this also the history of the return gives at least a partial proof. Whatever other faults might be growing up, they never again fell into the apostasy from the true faith in God, which up to the time of the exile had been their besetting sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall be my people . . .—The prophet clearly remembers and reproduces the promise of Hosea 2:23.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They shall be my people . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The prophet clearly remembers and reproduces the promise of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-10 Good and bad figs represent the Jews in captivity, and those who remain in their own land.   - The prophet saw two baskets of figs set before the temple, as offerings of first-fruits. The figs in one basket were very good, those in the other basket very bad. What creature viler than a wicked man? and what more valuable than a godly man? This vision was to raise the spirits of those gone into captivity, by assuring them of a happy return; and to humble and awaken the proud and secure spirits of those yet in Jerusalem, by assuring them of a miserable captivity. The good figs represents the pious captives. We cannot determine as to God's love or hatred by what is before us. Early suffering sometimes proves for the best. The sooner the child is corrected, the better effect the correction is likely to have. Even this captivity was for their good; and God's intentions never are in vain. By afflictions they were convinced of sin, humbled under the hand of God, weaned from the world, taught to pray, and turned from sins, particularly from idolatry. God promises that he will own them in captivity. The Lord will own those who are his, in all conditions. God assures them of his protection in trouble, and a glorious deliverance in due time. When our troubles are sanctified to us, we may be sure that they will end well. They shall return to him with their whole heart. Thus they should have liberty to own him for their God, to pray to him, and expect blessings from him. The bad figs were Zedekiah and those of his party yet in the land. These should be removed for their hurt, and forsaken of all mankind. God has many judgments, and those that escape one, may expect another, till they are brought to repent. Doubtless, this prophecy had its fulfilment in that age; but the Spirit of prophecy may here look forward to the dispersion of the unbelieving Jews, in all the nations of the earth. Let those who desire blessings from the Lord, beg that he will give them a heart to know him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Acknowledge ... for their good - Specially their spiritual good. Put a comma after Chaldaeans.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. (Jer 30:22; 31:33; 32:38). Their conversion from idolatry to the one true God, through the chastening effect of the Babylonish captivity, is here expressed in language which, in its fulness, applies to the more complete conversion hereafter of the Jews, \"with their whole heart\" (Jer 29:13), through the painful discipline of their present dispersion. The source of their conversion is here stated to be God's prevenient grace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they shall return—Repentance, though not the cause of pardon, is its invariable accompaniment: it is the effect of God's giving a heart to know Him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Under the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "know me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here (as in many other texts) comprehended faith, love, obedience, all those motions of the soul which rationally should follow a right comprehending of God in men’s knowledge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall be my people, and I will be their God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will be a God in covenant with them; as I will fulfil what I have promised them, so they shall do what is their duty to me. For, or when, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after that they shall return to me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not feignedly, but with their heart; not partially, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "with their whole heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is promised as an effect of special grace, not of the mere good inclination of their natural wills, for so the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will give",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the beginning of the verse, must be understood, otherwise God gives such a heart no more to one man than another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will give them an heart to know me, that I am the Lord,.... God, gracious and merciful, slow to anger, abundant in goodness and truth, pardoning iniquity, transgression, and sin; the unchangeable Jehovah; the everlasting I AM; a covenant keeping God; faithful and true to his promises; able and willing to perform them; and does all things well and wisely; and was their Lord and God. This knowledge designs not the first knowledge of the Lord, but an increase of it; and not head knowledge, but heart knowledge; a knowledge of God, joined with love and affection to him, high esteem, and approbation of him; and including communion with him, and an open profession and acknowledgment of him: and it is an appropriating knowledge also; a knowing him for themselves, and as their own; and such a knowledge or heart to know the Lord is a pure gift of his, and without which none can have it: and it may be observed, that in captivity it was given them; afflictions were the means of it; and happy it is when hereby men come to have a knowledge of God, and to be better acquainted with him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 92:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall be my people, and I will be their God; that is, it shall appear that they are so, by the above blessings of grace and goodness bestowed upon them; the Lord hereby owning them for his people, and they hereby coming to know that he is their God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for, or \"when\" (e). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall return unto me with their whole heart; affectionately, sincerely, and unfeignedly. It supposes that they had backslidden from God, his ways and worship; but now should return by sincere repentance to him, and to his worship, and obedience to his commands; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for they shall return to my worship with their whole heart;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all this will have an entire accomplishment in the latter day, when the Jews will be converted and turn to the Lord, and fear him and his goodness. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e)   \"quum reversi fuerint ad me\", Junius & Tremellius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e)   \"quum reversi fuerint ad me\", Junius & Tremellius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will give them {c} an heart to know me, that I am the LORD: and they shall be my people, and I will be their God: for they shall return to me with their whole heart.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will give them ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an heart to know me, that I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD: and they shall be my people, and I will be their God: for they shall return to me with their whole heart.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Which declares that man of himself can know nothing till God gives the heart and understanding.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an heart to know me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] They shall be restored in a spiritual sense also, purified in heart by their adversity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jeremiah 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The interpretation of the symbol. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 24:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Like the good figs, the Lord will look on the captives in Chaldea for good (\"for good\" belongs to the verb \"look on them\"). The point of resemblance is: as one looks with pleasure on good figs, takes them and keeps them, so will I bestow my favour on Judah's captives. Looking on them for good is explained, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : the Lord will set His eye on them, bring them back into their land and build them up again. With \"build them,\" etc., cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The building and planting of the captives is not to consist solely in the restoration of their former civil well-being, but will be a spiritual regeneration of the people. God will give them a heart to know Him as their God, so that they may be in truth His people, and He their God. \"For they will return,\" not: when they return (Ew., Hitz.). The turning to the Lord cannot be regarded as the condition of their receiving favour, because God will give them a heart to know Him; it is the working of the knowledge of the Lord put in their hearts. And this is adduced to certify the idea that they will then be really the Lord's people. ",
        "children": []
      }
    ]
  }
]