[{"header":"The Israelites Punish the Tribe of Benjamin"},{"num":20,"verse":"Then all the Israelites came out. They came from the whole land between Dan and Beersheba. They also came from the land of Gilead. All of them gathered together in front of the Lord at Mizpah. "},{"num":2,"verse":"The leaders of all the tribes of Israel came. They took their places among the people of God gathered together. There were 400,000 men carrying swords. "},{"num":3,"verse":"The tribe of Benjamin heard that the Israelites had gone up to Mizpah. The Israelites said, “Tell us how this awful thing happened.”"},{"num":4,"verse":"So the Levite spoke. He was the husband of the woman who had been murdered. He said, “I and my concubine went to Gibeah in Benjamin. We spent the night there. "},{"num":5,"verse":"During the night the men of Gibeah came after me. They surrounded the house. They were planning to kill me. They raped my concubine, and she died. "},{"num":6,"verse":"I took my concubine and cut her into pieces. I sent one piece to each part of Israel’s territory. I did it because the men of Gibeah had done a very terrible thing in Israel. "},{"num":7,"verse":"All you men of Israel, speak up now. Tell me what you have decided to do.”"},{"num":8,"verse":"All the men got up together. They said, “None of us will go home. Not one of us will return to his house. "},{"num":9,"verse":"Here is what we’ll do to Gibeah. We’ll cast lots to tell us how to attack the city. "},{"num":10,"verse":"We’ll take ten men out of every 100 from all the tribes of Israel. We’ll take 100 from every 1,000. We’ll take 1,000 from every 10,000. The men we take will get supplies for the army. Then the army will go to Gibeah in Benjamin. They’ll give Gibeah exactly what they should get because of the terrible thing they did in Israel.” "},{"num":11,"verse":"So all the men of Israel came together to fight against the city."},{"num":12,"verse":"The tribes of Israel sent people to carry a message through the whole tribe of Benjamin. They said, “What about this awful crime that was committed among you? "},{"num":13,"verse":"Hand over to us those evil men of Gibeah. We’ll put them to death. In that way we’ll get rid of those evil people.”"},{"num":14,"verse":"They came together at Gibeah from their towns. They came to fight against the other Israelites. "},{"num":15,"verse":"Right away the people of Benjamin gathered together 26,000 men from their towns. They were carrying swords. These men were added to the 700 capable young men from Gibeah. "},{"num":16,"verse":"Among all these men there were 700 who were left-handed. Each of them could sling a stone at a hair and not miss."},{"num":17,"verse":"Israel gathered 400,000 men together. They were carrying swords. All of them were trained for battle. That number didn’t include the tribe of Benjamin."},{"num":18,"verse":"The Israelites went up to Bethel. There they asked God, “Who should go up first and fight against the people of Benjamin?”"},{"num":19,"verse":"The next morning the Israelites got up. They set up camp near Gibeah. "},{"num":20,"verse":"The Israelites went out to fight against the men of Benjamin. They took up their battle positions against them at Gibeah. "},{"num":21,"verse":"The men of Benjamin came out of Gibeah. They killed 22,000 Israelites on the field of battle that day. "},{"num":22,"verse":"But the Israelites cheered one another on. They again took up their positions in the places where they had been the first day. "},{"num":23,"verse":"The Israelites went and wept in front of the Lord until evening. They asked the Lord, “Should we go up again to fight against the men of Benjamin? They are our fellow Israelites.”"},{"num":24,"verse":"The Israelites came near the men of Benjamin on the second day. "},{"num":25,"verse":"The men of Benjamin came out from Gibeah to oppose them. That time they killed 18,000 more Israelites. All the men who died had been carrying swords."},{"num":26,"verse":"Then all the Israelites, the whole army, went up to Bethel. They sat there and wept in front of the Lord. They didn’t eat anything that day until evening. Then they brought burnt offerings and friendship offerings to the Lord. "},{"num":27,"verse":"Again the Israelites spoke to the Lord. In those days the ark of the covenant of God was there. "},{"num":28,"verse":"Phinehas was serving as priest at the ark. He was the son of Eleazar. Eleazar was the son of Aaron. The Israelites asked, “Should we go up again to fight against the men of Benjamin? They are our fellow Israelites.”"},{"num":29,"verse":"Then Israel hid some men and had them wait all around Gibeah. "},{"num":30,"verse":"They went up to fight against the men of Benjamin on the third day. They took up their positions against Gibeah, just as they had done before. "},{"num":31,"verse":"The men of Benjamin came out to fight against them. They were drawn away from the city. They began to wound and kill the Israelites just as they had done before. About 30 men fell in battle. They fell in the open fields and on the roads. One of the roads led to Bethel. The other led to Gibeah. "},{"num":32,"verse":"The men of Benjamin said, “We’re winning the battle over them, just as we did before.” But the men of Israel said, “Let’s pull back. Let’s draw them away from the city to the roads.”"},{"num":33,"verse":"All the men of Israel moved away from their places. They took up new battle positions at Baal Tamar. The men who had been hiding charged out. They came from west of Gibeah. "},{"num":34,"verse":"Then 10,000 of Israel’s capable young men attacked Gibeah. The men of Benjamin didn’t realize they were about to be destroyed. The fighting was very heavy. "},{"num":35,"verse":"The Lord helped Israel win the battle over Benjamin. On that day the Israelites struck down 25,100 men of Benjamin. All the men who died had been carrying swords. "},{"num":36,"verse":"Then the men of Benjamin saw that they had lost the battle."},{"num":37,"verse":"Suddenly those men who had been hiding rushed into Gibeah. They spread out. Then they killed everyone in the city with their swords. "},{"num":38,"verse":"The Israelites had made a plan with those who had been hiding. They had told them to send up a large cloud of smoke from the city. "},{"num":39,"verse":"Then the Israelites would turn around and attack."},{"num":40,"verse":"But a large cloud of smoke began to go up from the city. The men of Benjamin turned around. They saw the the whole city going up in smoke. "},{"num":41,"verse":"Then the Israelites turned around and attacked them. The men of Benjamin were terrified. They realized they were going to be destroyed. "},{"num":42,"verse":"So they ran away from the men of Israel. They ran toward the desert. But they couldn’t escape the battle. Other Israelites came out of the towns. There they struck down the men of Benjamin. "},{"num":43,"verse":"Here’s how it happened. The Israelites had surrounded them. They had chased them and easily caught up with them east of Gibeah. "},{"num":44,"verse":"So 18,000 men of Benjamin fell in battle. All of them were brave fighters. "},{"num":45,"verse":"Some men of Benjamin turned back. They ran toward the desert to the rock of Rimmon. As they did, the Israelites struck down 5,000 of them along the roads. They kept chasing the men of Benjamin all the way to Gidom. Along the way they struck down 2,000 more."},{"num":46,"verse":"On that day 25,000 men of Benjamin fell in battle. They had been carrying swords. All of them were brave fighters. "},{"num":47,"verse":"But 600 of them turned back. They ran into the desert to the rock of Rimmon. They stayed there for four months. "},{"num":48,"verse":"The men of Israel went back to Benjamin. In all the towns they killed the people with their swords. They even killed the animals. So they killed everything they found. They set on fire all the towns they came to."}]