[{"num":20,"verse":"All the people of Israel from Dan to Beersheba, including the people who dwelt beyond the Jordan River in Gilead, gathered as one before the Eternal at Mizpah. "},{"num":2,"verse":"The leaders of every tribe, of all the tribes of Israel, presented themselves to the assembly, to the 400,000 soldiers armed for war. "},{"num":3,"verse":"(And the people of Benjamin heard that the other tribes had gathered at Mizpah.)"},{"num":11,"verse":"So all the people of Israel gathered against Gibeah, united in their judgment, intent on action."},{"num":12,"verse":"The tribes of Israel sent messengers throughout the land of Benjamin."},{"num":14,"verse":"The Benjaminites gathered together, out of their towns, to Gibeah to go to battle against the rest of Israel. "},{"num":15,"verse":"They gathered a force of 26,000 armed men, in addition to the men of Gibeah, all of them worthy fighting men. Seven hundred of these were left-handed warriors who could sling a stone so accurately that they could hit any target, no matter how small."},{"num":17,"verse":"Opposing them were the forces of Israel, 400,000 warriors strong."},{"num":18,"verse":"The people of Israel went up to Bethel to ask of the True God who should press the first day’s attack."},{"num":19,"verse":"The people of Israel rose up in the morning and encamped against Gibeah, "},{"num":20,"verse":"where they went into battle against the warriors of Benjamin. "},{"num":21,"verse":"That first day the warriors of Benjamin came out of Gibeah and won a great victory, striking down 22,000 warriors of Israel."},{"num":23,"verse":"The people of Israel presented themselves before the Eternal and wept until evening came. They laid before Him the question:"},{"num":22,"verse":"The warriors of Israel took courage and drew up their battle lines where they had been at the beginning of the fight on the first day. "},{"num":24,"verse":"In obedience to God, for a second day the Israelites advanced against the Benjaminites. But the warriors of Benjamin came out of Gibeah, struck down 18,000 warriors of Israel, and won another great victory."},{"num":26,"verse":"So all the people of Israel, all the warriors, went back to Bethel to weep before the Eternal. They fasted until evening came, and then they offered sacrifices and burnt offerings before the Eternal. "},{"num":27,"verse":"Again the Israelites questioned the Eternal (for in those days, the covenant chest was still with them, "},{"num":28,"verse":"and the priest Phinehas, son of Eleazar, son of Aaron, ministered before it.)"},{"num":29,"verse":"So the warriors of Israel changed their strategy and secretly stationed warriors around Gibeah, ready to ambush the Benjaminites. "},{"num":30,"verse":"The third day they lined up as before and went into battle against Gibeah. "},{"num":31,"verse":"When the warriors of Benjamin came out, they were drawn away from the city. As before, they began to draw blood, striking down their foes along the main roads (one of which goes to Bethel, the other back to Gibeah) as well as in the open country. About 30 men of Israel fell, "},{"num":32,"verse":"and the warriors of Benjamin thought they would succeed again."},{"num":33,"verse":"So the majority of Israelite troops pulled back to a line at Baal-tamar, while the hidden group waiting in ambush rushed out of their hiding place on the plain in Maareh-geba. "},{"num":34,"verse":"Then 10,000 of the hardiest Israelite warriors rushed against Gibeah. The battle was a fierce one, and the warriors of Benjamin did not realize that their end was near. "},{"num":35,"verse":"For the Eternal defeated Benjamin that day before the people of Israel, who killed 25,100 of them, almost all their men at arms. "},{"num":36,"verse":"Then the people of Benjamin realized their crushing defeat."},{"num":38,"verse":"Their plan was that when the ambushers sent a cloud of smoke from the city, "},{"num":39,"verse":"the main force would turn on the pursuing warriors of Benjamin, thinking that since they had already slain 30 men and the warriors of Israel were retreating, they were going to be victorious over them again."},{"num":40,"verse":"But the Benjaminites were surprised. The Israelite warriors who entered Gibeah sent up a towering column of smoke; and the warriors of Benjamin turned around to see their refuge, the entire city, burning! "},{"num":41,"verse":"The main force of Israel turned and began attacking fiercely, and the warriors of Benjamin lost heart, for their doom was upon them. "},{"num":42,"verse":"They ran from the warriors of Israel toward the wilderness, but they were caught, both from behind and by the victorious soldiers emerging from the ruined Gibeah."},{"num":44,"verse":"and 18,000 courageous warriors fell. "},{"num":45,"verse":"Of those who turned and fled in the direction of the wilderness to the rock of Rimmon, 5,000 of those were slain on the main road and another 2,000 were pursued as far as Gidom. "},{"num":46,"verse":"So in all, the people of Benjamin suffered the loss of 25,000 fighting men, all of them courageous warriors."},{"num":47,"verse":"Six hundred of them survived; they had fled to the rock of Rimmon, where they remained for four months. "},{"num":48,"verse":"In the meantime, the warriors of Israel had done their best to destroy the people of Benjamin, killing them, destroying their livestock, and burning every city and town they encountered."}]