[{"header":"Isaiah’s Message to Hezekiah"},{"num":19,"verse":"When King Hezekiah heard this, he tore his clothes and put on sackcloth. Then he went into the House of the Lord. "},{"num":2,"verse":"He sent Eliakim the palace administrator, Shebna the secretary, and the elders of the priests, dressed in sackcloth, to Isaiah the prophet, the son of Amoz."},{"num":3,"verse":"They said to him, “This is what Hezekiah says. Today is a day of distress and rebuke and humiliation because children have come to the point of birth, but there is no strength to deliver them. "},{"num":4,"verse":"Perhaps the Lord your God will hear all the words of the herald, whom his lord, the king of Assyria, sent to mock the living God, and he will rebuke him for the words which the Lord your God has heard, and you will lift up a prayer on behalf of the remnant who are left.”"},{"num":5,"verse":"When the servants of King Hezekiah went to Isaiah, "},{"num":6,"verse":"Isaiah said to them, “Say this to your lord: This is what the Lord says. Do not be afraid of these words which you heard, with which the lackeys of the king of Assyria blasphemed me. "},{"num":7,"verse":"See, I am going to put him into such a frame of mind that when he hears a certain report, he will return to his country, and I will make him fall by the sword in his own land.”"},{"header":"Hezekiah’s Prayer"},{"num":8,"verse":"Because the herald heard that the king of Assyria had withdrawn from Lachish, he went back and found the king fighting against Libnah. "},{"num":9,"verse":"For he had heard this report about Tirhakah king of Cush: “Watch out! He has come out to fight with you.” So he again sent messengers to Hezekiah "},{"num":10,"verse":"to say this to Hezekiah king of Judah: “Don’t let your God, whom you trust, deceive you, saying, ‘Jerusalem will not be given into the hand of the king of Assyria.’ "},{"num":11,"verse":"Listen, you have heard what the kings of Assyria did to all the lands which they completely destroyed. And you expect to be saved? "},{"num":12,"verse":"Did the gods of the nations which my fathers destroyed save them—Gozen and Haran and Rezeph and the people of Eden, who are in Tel Assar? "},{"num":13,"verse":"Where is the king of Hamath and the king of Arpad and the king of the city of Sepharvaim, and Hena and Ivvah?”"},{"num":14,"verse":"Hezekiah took the letter from the hand of the messengers and read it. Then he went up to the House of the Lord, and Hezekiah spread it out before the Lord. "},{"num":15,"verse":"Then Hezekiah prayed before the Lord:"},{"header":"God’s Answer to Hezekiah"},{"num":20,"verse":"Then Isaiah son of Amoz sent a message to Hezekiah:"},{"header":"The Destruction of Sennacherib"},{"num":35,"verse":"That night, the angel of the Lord went out and struck down one hundred eighty-five thousand men in the camp of Assyria. When it was time to wake up in the morning, there they were—all the dead bodies! "},{"num":36,"verse":"Then Sennacherib king of Assyria broke camp and returned and lived in Nineveh. "},{"num":37,"verse":"One day when he was worshipping in the house of his god Nisrok, his sons Adrammelek and Sharezer killed him with the sword. They fled to the land of Ararat, and his son Esarhaddon became king in his place."}]