[{"header":"Chapter 19"},{"num":1,"verse":"Hezekiah and Isaiah. When King Hezekiah heard this, he tore his garments, covered himself with sackcloth, and went into the house of the Lord. "},{"num":2,"verse":"He sent Eliakim, the master of the palace, Shebnah the scribe, and the elders of the priests, covered with sackcloth, to tell the prophet Isaiah, son of Amoz, "},{"num":3,"verse":"“Thus says Hezekiah:"},{"num":4,"verse":"Perhaps the Lord, your God, will hear all the words of the commander, whom his lord, the king of Assyria, sent to taunt the living God, and will rebuke him for the words which the Lord, your God, has heard. So lift up a prayer for the remnant that is here.” "},{"num":5,"verse":"When the servants of King Hezekiah had come to Isaiah, "},{"num":6,"verse":"he said to them, “Tell this to your lord: Thus says the Lord: Do not be frightened by the words you have heard, by which the deputies of the king of Assyria have blasphemed me. "},{"num":7,"verse":"I am putting in him such a spirit that when he hears a report he will return to his land. I will make him fall by the sword in his land.”"},{"num":8,"verse":"When the commander, on his return, heard that the king of Assyria had withdrawn from Lachish, he found him besieging Libnah."},{"num":9,"verse":"Sennacherib, Hezekiah, and Isaiah. The king of Assyria heard a report: “Tirhakah, king of Ethiopia, has come out to fight against you.” Again he sent messengers to Hezekiah to say: "},{"num":10,"verse":"“Thus shall you say to Hezekiah, king of Judah: Do not let your God in whom you trust deceive you by saying, ‘Jerusalem will not be handed over to the king of Assyria.’ "},{"num":11,"verse":"You, certainly, have heard what the kings of Assyria have done to all the lands: they put them under the ban! And are you to be rescued? "},{"num":12,"verse":"Did the gods of the nations whom my fathers destroyed deliver them—Gozan, Haran, Rezeph, or the Edenites in Telassar? "},{"num":13,"verse":"Where are the king of Hamath, the king of Arpad, or the kings of the cities Sepharvaim, Hena and Ivvah?”"},{"num":14,"verse":"Hezekiah took the letter from the hand of the messengers and read it; then he went up to the house of the Lord, and spreading it out before the Lord, "},{"num":15,"verse":"Hezekiah prayed in the Lord’s presence: “Lord, God of Israel, enthroned on the cherubim! You alone are God over all the kingdoms of the earth. It is you who made the heavens and the earth. "},{"num":16,"verse":"Incline your ear, Lord, and listen! Open your eyes, Lord, and see! Hear the words Sennacherib has sent to taunt the living God. "},{"num":17,"verse":"Truly, O Lord, the kings of Assyria have laid waste the nations and their lands. "},{"num":18,"verse":"They gave their gods to the fire—they were not gods at all, but the work of human hands—wood and stone, they destroyed them. "},{"num":19,"verse":"Therefore, Lord, our God, save us from this man’s power, that all the kingdoms of the earth may know that you alone, Lord, are God.”"},{"num":20,"verse":"Then Isaiah, son of Amoz, sent this message to Hezekiah: “Thus says the Lord, the God of Israel, to whom you have prayed concerning Sennacherib, king of Assyria: I have listened! "},{"num":21,"verse":"This is the word the Lord has spoken concerning him:"},{"num":32,"verse":"“Therefore, thus says the Lord about the king:"},{"num":35,"verse":"That night the angel of the Lord went forth and struck down one hundred and eighty-five thousand men in the Assyrian camp. Early the next morning, there they were, dead, all those corpses! "},{"num":36,"verse":"So Sennacherib, the king of Assyria, broke camp, departed, returned home, and stayed in Nineveh."},{"num":37,"verse":"When he was worshiping in the temple of his god Nisroch, his sons Adrammelech and Sharezer struck him down with the sword and fled into the land of Ararat. His son Esarhaddon reigned in his place."}]