[{"header":"Isaiah Prophesies That Jerusalem Will Be Saved"},{"num":19,"verse":"When King Hezekiah heard what the field commander had said, he tore his clothes. He put on the rough clothing people wear when they’re sad. Then he went into the Lord’s temple. "},{"num":2,"verse":"Hezekiah sent Eliakim, who was in charge of the palace, to Isaiah the prophet. Isaiah was the son of Amoz. Hezekiah also sent to Isaiah the leading priests and Shebna the secretary. All of them were wearing the same rough clothing. "},{"num":3,"verse":"They told Isaiah, “Hezekiah says, ‘Today we’re in great trouble. The Lord is warning us. He’s bringing shame on us. Sometimes babies come to the moment when they should be born. But their mothers aren’t strong enough to allow them to be born. Today we are like those mothers. We aren’t strong enough to save ourselves. "},{"num":4,"verse":"Perhaps the Lord your God will hear everything the field commander has said. His master, the king of Assyria, has sent him to make fun of the living God. Maybe the Lord your God will punish him for what he has heard him say. So pray for the remaining people who are still alive here.’ ”"},{"num":5,"verse":"King Hezekiah’s officials came to Isaiah. "},{"num":6,"verse":"Then Isaiah said to them, “Tell your master, ‘The Lord says, “Do not be afraid of what you have heard. The officers of the king of Assyria have spoken evil things against me. "},{"num":7,"verse":"Listen! I will send him news from his own country. It will make him want to return home. There I will have him killed by a sword.” ’ ”"},{"num":8,"verse":"The field commander heard that the king of Assyria had left Lachish. So the commander pulled his troops back from Jerusalem. He went to join the king. He found out that the king was fighting against Libnah."},{"num":9,"verse":"During that time Sennacherib received a report. He was told that Tirhakah was marching out to fight against him. Tirhakah was the king of Cush. Sennacherib sent messengers again to Hezekiah with a letter. Sennacherib said, "},{"num":10,"verse":"“Tell Hezekiah, the king of Judah, ‘Don’t let the god you depend on trick you. He says, “Jerusalem will not be handed over to the king of Assyria.” But don’t believe him. "},{"num":11,"verse":"I’m sure you have heard about what the kings of Assyria have done to all the other countries. They have destroyed them completely. So do you think you will be saved? "},{"num":12,"verse":"The kings who ruled before me destroyed many nations. Did the gods of those nations save them? Did the gods of Gozan, Harran or Rezeph save them? What about the gods of the people of Eden who were in Tel Assar? "},{"num":13,"verse":"Where is the king of Hamath? Where is the king of Arpad? Where are the kings of Lair, Sepharvaim, Hena and Ivvah?’ ”"},{"header":"Hezekiah’s Prayer"},{"num":14,"verse":"When Hezekiah received the letter from the messengers, he read it. Then he went up to the Lord’s temple. There he spread the letter out in front of the Lord. "},{"num":15,"verse":"Hezekiah prayed to the Lord. He said, “Lord, you are the God of Israel. You sit on your throne between the cherubim. You alone are God over all the kingdoms on earth. You have made heaven and earth. "},{"num":16,"verse":"Listen, Lord. Hear us. Open your eyes, Lord. Look at the trouble we’re in. Listen to what Sennacherib is saying. You are the living God. And he dares to make fun of you!"},{"num":17,"verse":"“Lord, it’s true that the kings of Assyria have completely destroyed many nations and their lands. "},{"num":18,"verse":"They have thrown the statues of the gods of those nations into the fire. And they have destroyed them. That’s because they weren’t really gods at all. They were nothing but statues made out of wood and stone. They were made by human hands. "},{"num":19,"verse":"Lord our God, save us from the power of Sennacherib. Then all the kingdoms of the earth will know that you alone are the Lord. You alone are God.”"},{"header":"Isaiah Prophesies That Sennacherib Will Fall From Power"},{"num":20,"verse":"Isaiah sent a message to Hezekiah. Isaiah was the son of Amoz. Isaiah said, “The Lord is the God of Israel. The Lord says, ‘I have heard your prayer about Sennacherib, the king of Assyria.’ "},{"num":21,"verse":"Here is the message the Lord has spoken against him. The Lord says,"},{"num":29,"verse":"The Lord said, “Hezekiah, here is a miraculous sign for you."},{"num":32,"verse":"“Here is a message from me about the king of Assyria. The Lord says,"},{"num":35,"verse":"That night the angel of the Lord went into the camp of the Assyrians. He put to death 185,000 people there. The people of Jerusalem got up the next morning and looked out at the camp. There were all the dead bodies! "},{"num":36,"verse":"So Sennacherib, the king of Assyria, took the army tents down. Then he left. He returned to Nineveh and stayed there."},{"num":37,"verse":"One day Sennacherib was worshiping in the temple of his god Nisrok. His sons Adrammelek and Sharezer killed him with their swords. Then they escaped to the land of Ararat. Esarhaddon became the next king after his father Sennacherib."}]