[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The grace of the Lord Jesus Christ . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is not without a special significance that the Epistle which has been, almost to the very close, the most agitated and stormy of all that came from St. Paul’s pen, should end with a benediction which, as being fuller than any other found in the New Testament, was adopted from a very early period in the liturgies of many Eastern churches, such as Antioch, Cæsarea, and Jerusalem (Palmer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Origines. Liturg.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i. 251). It may be noted that it did not gain its present position in the Prayer Book of the Church of England till the version of A.D. 1662, not having appeared at all till A.D. 1559, and then only at the close of the Litany.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The order of the names of the three Divine Persons is itself significant. Commonly, the name of the Father precedes that of the Son, as, e.g., in 2Corinthians 1:2; Romans 1:7; 1Corinthians 1:3. Here the order is inverted, as though in the Apostle’s thoughts there was no “difference or inequality” between them, the question of priority being determined by the sequence of thought, and not by any essential distinction. To those who trace that sequence here there will seem sufficient reason for the order which we actually find. St. Paul had spoken of the comfort brought to his own soul by the words which he heard in vision from the lips of the Lord Jesus, “My grace is sufficient for thee” (2Corinthians 12:9). He had spoken of that grace as showing itself in self-abnegation for the sake of man (2Corinthians 8:9). What more natural than that the first wish of his heart for those who were dear to him should be that that grace might be with them, working on them and assimilating them to itself? But the “favour,” or “grace,” which thus flowed through Christ was derived from a yet higher source. It was the love of God in Christ reconciling the world unto Himself (2Corinthians 5:18-20), the love of the Eternal Father that was thus manifested in the “grace” of the Son. Could he separate those divine acts from that of Him whom he knew at once as the Spirit of God and the Spirit of Christ? (Romans 8:9-14; 1Corinthians 2:11; 1Corinthians 6:11; Galatians 4:6.) Was it not through their participation, their fellowship in that Spirit (the phrase meets us again in Philippians 2:1) shedding down the love of God in their hearts (Romans 5:5) that the grace of Christ and the love of the Father were translated from the region of abstract thoughts or mere empty words into the realities of a living experience?[60]",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The order of the names of the three Divine Persons is itself significant. Commonly, the name of the Father precedes that of the Son, as, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "e.g.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here the order is inverted, as though in the Apostle’s thoughts there was no “difference or inequality” between them, the question of priority being determined by the sequence of thought, and not by any essential distinction. To those who trace that sequence here there will seem sufficient reason for the order which we actually find. St. Paul had spoken of the comfort brought to his own soul by the words which he heard in vision from the lips of the Lord Jesus, “My ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "grace",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is sufficient for thee” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). He had spoken of that ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "grace",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as showing itself in self-abnegation for the sake of man (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). What more natural than that the first wish of his heart for those who were dear to him should be that that grace might be with them, working on them and assimilating them to itself? But the “favour,” or “grace,” which thus flowed through Christ was derived from a yet higher source. It was the love of God in Christ reconciling the world unto Himself (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 5:18-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the love of the Eternal Father that was thus manifested in the “grace” of the Son. Could he separate those divine acts from that of Him whom he knew at once as the Spirit of God and the Spirit of Christ? (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:9-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Was it not through their participation, their fellowship in that Spirit (the phrase meets us again in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") shedding down the love of God in their hearts (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that the grace of Christ and the love of the Father were translated from the region of abstract thoughts or mere empty words into the realities of a living experience?",
            "children": []
          },
          {
            "element": "span",
            "class": "note",
            "text": "[60]",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "[60] The note, added by some unknown transcriber, though having no shadow of authority, is, probably, in this instance, as has been shown in the Notes on 2Corinthians 8:16-22, a legitimate inference from the data furnished by the Epistle.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "[60] The note, added by some unknown transcriber, though having no shadow of authority, is, probably, in this instance, as has been shown in the Notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 8:16-22",
            "children": []
          },
          {
            "element": "span",
            "class": "note",
            "text": ", a legitimate inference from the data furnished by the Epistle.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And so the Epistle ends, not, we may imagine, if we may once picture to ourselves the actual genesis of the letter, without a certain sense of relief and of repose. It had been a hard and difficult task to dictate it. The act of dictation had been broken by the pauses of strong emotion or physical exhaustion. The Apostle had had to say things that went against the grain, of which he could not feel absolutely sure that they were the right things to say. (See Note on 2Corinthians 11:17.) And now all is done. He can look forward to coming to the Corinthian Church, not with a rod, but in love and in the spirit of meekness (1Corinthians 4:21). What the actual result of that visit was we do not know in detail, but there are at least no traces of disappointment in the tone of the Epistle to the Romans, which was written during that visit. He has been welcomed with a generous hospitality (Romans 16:23). He has not been dis-appointed in the collection for the saints (Romans 15:26) either in Macedonia or Achaia. If we trace a reminiscence of past conflicts in the warning against those who cause divisions (Romans 16:18), it is rather with the calmness of one who looks back on a past danger than with the bitterness of the actual struggle.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And so the Epistle ends, not, we may imagine, if we may once picture to ourselves the actual ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "genesis",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the letter, without a certain sense of relief and of repose. It had been a hard and difficult task to dictate it. The act of dictation had been broken by the pauses of strong emotion or physical exhaustion. The Apostle had had to say things that went against the grain, of which he could not feel absolutely sure that they were the right things to say. (See Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Corinthians 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) And now all is done. He can look forward to coming to the Corinthian Church, not with a rod, but in love and in the spirit of meekness (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). What the actual result of that visit was we do not know in detail, but there are at least no traces of disappointment in the tone of the Epistle to the Romans, which was written during that visit. He has been welcomed with a generous hospitality (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 16:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). He has not been dis-appointed in the collection for the saints (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 15:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") either in Macedonia or Achaia. If we trace a reminiscence of past conflicts in the warning against those who cause divisions (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 16:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), it is rather with the calmness of one who looks back on a past danger than with the bitterness of the actual struggle.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:11-14 Here are several good exhortations. God is the Author of peace and Lover of concord; he hath loved us, and is willing to be at peace with us. And let it be our constant aim so to walk, that separation from our friends may be only for a time, and that we may meet in that happy world where parting will be unknown. He wishes that they may partake all the benefits which Christ of his free grace and favour has purchased; the Father out of his free love has purposed; and the Holy Ghost applies and bestows.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The grace of the Lord Jesus Christ - see the note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 16:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This verse contains what is usually called the apostolic benediction - the form which has been so long, and which is almost so universally used, in dismissing religious assemblies. It is properly a prayer, and it is evident that the optative εἴῃ  eiē, \"May the grace,\" etc., is to be supplied. It is the expression of a desire that the favors here referred to may descend on all for whom they are thus invoked.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the love of God - May the love of God toward you be manifest. This must refer especially to the Father, as the Son and the Holy Spirit are mentioned in the other members of the sentence. The \"love of God\" here referred to is the manifestation of his goodness and favor in the pardon of sin, in the communication of his grace, in the comforts and consolations which he imparts to his people, in all that constitutes an expression of love. The love of God brings salvation; imparts comfort; pardons sin; sanctifies the soul; fills the heart with joy and peace; and Paul here prays that all the blessings which are the fruit of that love may be with them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the communion of the Holy Ghost - compare note, 1 Corinthians 10:16. The word \"communion\" (κοινωνία  koinōnia) means properly participation, fellowship, or having anything in common; Acts 2:42; Romans 15:26; 1 Corinthians 1:9; 1 Corinthians 10:16; 2 Corinthians 6:14; 2 Corinthians 8:4; 2 Corinthians 9:13; Galatians 2:9; Ephesians 3:9; 1 John 1:3. This is also a wish or prayer of the apostle Paul; and the desire is either that they might partake of the views and feelings of the Holy Spirit; that is, that they might have fellowship with him; or that they might all in common partake of the gifts and graces which the Spirit of God imparts. He gives love, joy, peace, long-suffering, gentleness, goodness, faith Galatians 5:22, as well as miraculous endowments; and Paul prays that these things might be imparted freely to all the church in common, that all might participate in them; all might share them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the communion of the Holy Ghost - compare note, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word \"communion\" (κοινωνία  koinōnia) means properly participation, fellowship, or having anything in common; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 15:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This is also a wish or prayer of the apostle Paul; and the desire is either that they might partake of the views and feelings of the Holy Spirit; that is, that they might have fellowship with him; or that they might all in common partake of the gifts and graces which the Spirit of God imparts. He gives love, joy, peace, long-suffering, gentleness, goodness, faith ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as well as miraculous endowments; and Paul prays that these things might be imparted freely to all the church in common, that all might participate in them; all might share them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Amen - This word is missing, says Clarke, in almost every ms. of any authority. It was however early affixed to the Epistle.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In regard to this closing verse of the Epistle, we may make the following remarks:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) It is a prayer; and if it is a prayer addressed to God, it is no less so to the Lord Jesus and to the Holy Spirit. If so, it is right to offer worship to the Lord Jesus and to the Holy Spirit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) there is a distinction in the divine nature; or there is the existence of what is usually termed three persons in the Godhead. If not. why are they mentioned in this manner? If the Lord Jesus is not divine and equal with the Father, why is he mentioned in this connection? How strange it would be for Paul, an inspired man, to pray in the same breath, \"the grace of a man or an angel\" and \"the love of God\" be with you! And if the \"Holy Spirit\" be merely an influence of God or an attribute of God, how strange to pray that the \"love of God\" and the participation or fellowship of an \"influence of God,\" or an \"attribute of God\" might be with them!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) the Holy Spirit is a person, or has a distinct personality. He is not an attribute of God, nor a mere divine influence. How could prayer be addressed to an attribute, or an influence? But here, nothing can be plainer than that there were favors which the Holy Spirit, as an intelligent and conscious agent, was expected to bestow. And nothing can be plainer than that they were favors in some sense distinct from those which were conferred by the Lord Jesus, and by the Father. Here is a distinction of some kind as real as that between the Lord Jesus and the Father; here are favors expected from him distinct from those conferred by the Father and the Son; and there is, therefore, here all the proof that there can be, that there is in some respects a distinction between the persons here referred to and that the Holy Spirit is an intelligent, conscious agent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) the Lord Jesus is not inferior to the Father, that is, he has an equality with God. If he were not equal, how could he be mentioned, as he here is, as bestowing favors like God, and especially why is he mentioned first? Would Paul, in invoking blessings, mention the name of a mere man or an angel before that of the eternal God?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) the passage, therefore, furnishes a proof of the doctrine of the Trinity that has not yet been answered, and, it is believed, cannot be. On the supposition that there are three persons in the adorable Trinity, united in essence and yet distinct in some respects, all is plain and clear. But on the supposition that, the Lord Jesus is a mere man, an angel, or an archangel, and that the Holy Spirit is an attribute, or an influence from God, how unintelligible, confused, strange does all become! That Paul, in the solemn close of the Epistle, should at the same time invoke blessings from a mere creature, and from God, and from an attribute, surpasses belief. But that he should invoke blessings from him who was the equal with the Father, and from the Father himself, and from the Sacred Spirit sustaining the same rank, and in like manner imparting important blessings, is in accordance with all that we should expect, and makes all harmonious and appropriate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) nothing could be a more proper close of the Epistle; nothing is a more appropriate close of public worship, than such an invocation. It is a prayer to the ever-blessed God, that all the rich influences which he gives as Father, Son, and Holy Spirit, may be imparted; that all the benefits which God confers in the interesting relations in which he makes himself known to us may descend and bless us. What more appropriate prayer can be offered at the close of public worship? How seriously should it be pronounced, as a congregration is about to separate, perhaps to come together no more! With what solemnity should all join in it, and how devoutly should all pray, as they thus separate, that these rich and inestimable blessings may rest upon them! With hearts uplifted to God it should be pronounced and heard; and every worshiper should leave the sanctuary deeply feeling that what he most needs as he leaves the place of public worship; as he travels on the journey of life; as he engages in its duties or meets its trials; as he looks at the grave and eternity, is the grace of the Lord Jesus Christ, the love of God, and the blessings which the Holy Spirit imparts in renewing, and sanctifying, and comforting His people. What more appropriate prayer than this for the writer and reader of these notes! May that blessing rest alike upon us, though we may be strangers in the flesh, and may those divine and heavenly influences guide us alike to the same everlasting kingdom of glory.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In regard to the subscription at the end of this Epistle, it may be observed, that it is missing in a great part of the most ancient mss., and is of no authority whatever; see the notes at the end of the Epistle to the Romans, and 1 Corinthians.  this case, however, this subscription is in the main correct, since there is evidence that it was written from Macedonia, and not improbably from Philippi. See the introduction to this Epistle. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In regard to the subscription at the end of this Epistle, it may be observed, that it is missing in a great part of the most ancient mss., and is of no authority whatever; see the notes at the end of the Epistle to the Romans, and 1 Corinthians.  this case, however, this subscription is in the main correct, since there is evidence that it was written from Macedonia, and not improbably from Philippi. See the introduction to this Epistle. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. The benediction which proves the doctrine of the Divine Trinity in unity. \"The grace of Christ\" comes first, for it is only by it we come to \"the love of God\" the Father (Joh 14:6). The variety in the order of Persons proves that \"in this Trinity none is afore or after other\" [Athanasian Creed].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "communion—joint fellowship, or participation, in the same Holy Ghost, which joins in one catholic Church, His temple, both Jews and Gentiles. Whoever has \"the fellowship of the Holy Ghost,\" has also \"the grace of our Lord Jesus Christ,\" and \"the love of God\"; and vice versa. For the three are inseparable, as the three Persons of the Trinity itself [Chrysostom]. The doctrine of the Trinity was not revealed clearly and fully till Christ came, and the whole scheme of our redemption was manifested in Him, and we know the Holy Three in One more in their relations to us (as set forth summarily in this benediction), than in their mutual relations to one another (De 29:29).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Amen—omitted in the oldest manuscripts. Probably added subsequently for the exigencies of public joint worship.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The free love of our ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lord Jesus Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shown in the application of his redemption; that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which floweth from him as the Fountain of grace, or cometh by him as the Mediator between God and man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " actual ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "love of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that good-will by which God the Father embraceth creatures in Christ, and for his sake; and all the gracious communications of the Holy Spirit of God, (by which he strengtheneth, quickeneth, or comforteth the souls of God’s people), ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "be with you all.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Whether you value me or not, I heartily wish you well, and all the best things. In this text is an eminent proof of the Trinity, all the Persons being distinctly named in it (as in the commission about baptism). The apostle calleth the Father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Son, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he attributeth ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the Father; (moved by which he sent his only begotten Son into the world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 3:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the Son, who loved us freely, and died for the fellowship or ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "communion of the Holy Ghost, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by whom the Father and Son communicate their love and grace to the saints. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Amen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here used as a particle of wishing or desiring the thing before mentioned; it is the same with: Let it so be. Whether added by the apostle, or subjoined by the church of Corinth, upon the reading this Epistle among them, (as some think), is not material. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The second",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (epistle) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to the Corinthians was written from Philippi, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "( a city) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of Macedonia, by Titus and Lucas.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If the subscriptions to the apostolical Epistles were parts of the text and holy writ, we have it here determined, who that other brother was, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Corinthians 8:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 8:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", sent along with Titus to carry this letter, and the benevolence of the churches of Macedonia. But it is observed, that even in this subscription there is a certain evidence, that the subscriptions of the Epistles are no part of canonical writ; for in some Greek copies it is said to be sent by Paul and Timothy; whereas Paul was the writer of it, not the messenger, and in Macedonia when it was sent; and Timothy is joined with him in the writing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Corinthians 1:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 1:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The grace of the Lord Jesus Christ.... Meaning either the love of Christ; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is the same with that of his Father's, is as early, and of the same nature, being a love of complacency and delight; and which, as it is without beginning, will be without end. This is the ground and foundation of all he has done and underwent for his people; of his becoming their surety; of his incarnation, obedience, sufferings, and death in their room and stead; an interest in which, though they always have, yet they have not always an abiding sense of it with them, which is what the apostle here prays for: or else by the grace of Christ is meant the fulness of grace that is in him as Mediator; which is desired to be with the saints as the object of their trust and dependence; to be strong in, draw living water with joy out of, receive and derive daily from; not forsake it, and hew out broken cisterns, but continually apply to, and make use of it, as the fountain of gardens, the well of living waters, and streams from Lebanon; to be with them as a supply to their wants, to furnish them with every thing they stand in need of, and to enable them to do his will and work: or else the redeeming grace of Christ is particularly designed, and the intent of the petition is, that they might see their interest in it, and in all the branches of it; as that they were redeemed by his blood from sin, law, and wrath, had all their sins expiated and forgiven through his sacrifice, and were justified from all things by his righteousness. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the love of God; the Father, as the Arabic version adds very justly, as to the sense, though it is not in the text; meaning the love of God to his people, which is eternal, from everlasting to everlasting, free and undeserved, special and peculiar, is dispensed in a sovereign way, is unchangeable, abides for ever, is the source and spring of all the blessings both of grace and glory. Now when this is entreated to be with all the saints, it does not suppose that it is ever from them, or that it can be taken away from them, but whereas they may be without a comfortable sense of it, and a view of interest in it, the apostle prays, that in this respect it might be with them; that they might be directed into it, have it shed abroad in their hearts, and they be rooted and grounded in it, and comprehend for themselves the height, and depth, and length, and breadth of it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the communion of the Holy Ghost; either a larger communication of the gifts and graces of the Spirit of God, called \"the supply of the Spirit\", Philippians 1:19 necessary to carry on the good work of grace, and perform it to the end; or else that communion and fellowship which the Spirit of God leads the saints into with the Father, by shedding abroad his love in their hearts, and with the Son, by taking of the things of Christ, and showing them to them; and also that nearness which the spirits of believers have with the Spirit of God, when he witnesses to their spirits that they are the children of God, becomes the earnest of the inheritance in their hearts, and seals them up unto the day of redemption: all which is requested by the apostle, to ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the communion of the Holy Ghost; either a larger communication of the gifts and graces of the Spirit of God, called \"the supply of the Spirit\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 1:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " necessary to carry on the good work of grace, and perform it to the end; or else that communion and fellowship which the Spirit of God leads the saints into with the Father, by shedding abroad his love in their hearts, and with the Son, by taking of the things of Christ, and showing them to them; and also that nearness which the spirits of believers have with the Spirit of God, when he witnesses to their spirits that they are the children of God, becomes the earnest of the inheritance in their hearts, and seals them up unto the day of redemption: all which is requested by the apostle, to ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "be, says he, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with you all; or \"with your company\", or \"congregations\", as the Arabic version reads it, with all the saints; for their interest in the love of the Father, in the grace of the Son, and in the favour of the Spirit, is the same, whatever different sense and apprehensions they may have thereof. This passage contains no inconsiderable proof of a trinity of persons in the Godhead, to whom distinct things are here ascribed, and of them asked, equal objects of prayer and worship. \"Amen\" is by way of assent and confirmation, and as expressive of faith in the petitions, and of earnest desire to have them fulfilled. According to the subscription at the end of this epistle, it was written by the apostle when he was at Philippi, a city of Macedonia, and transcribed by Titus and Lucas, and by them sent or carried to the Corinthians; which seems to be agreeable to what is suggested in the epistle itself, though these subscriptions are not to he depended upon. The Syriac version only mentions Luke; and some copies read, by Titus, Barnabas, and Luke. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with you all; or \"with your company\", or \"congregations\", as the Arabic version reads it, with all the saints; for their interest in the love of the Father, in the grace of the Son, and in the favour of the Spirit, is the same, whatever different sense and apprehensions they may have thereof. This passage contains no inconsiderable proof of a trinity of persons in the Godhead, to whom distinct things are here ascribed, and of them asked, equal objects of prayer and worship. \"Amen\" is by way of assent and confirmation, and as expressive of faith in the petitions, and of earnest desire to have them fulfilled. According to the subscription at the end of this epistle, it was written by the apostle when he was at Philippi, a city of Macedonia, and transcribed by Titus and Lucas, and by them sent or carried to the Corinthians; which seems to be agreeable to what is suggested in the epistle itself, though these subscriptions are not to he depended upon. The Syriac version only mentions Luke; and some copies read, by Titus, Barnabas, and Luke. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The grace of the Lord Jesus Christ, and the love of God, and the communion of the Holy Ghost, be with you all. Amen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The grace of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is the fullest form of any of the benedictions given by St Paul, and it comes fitly at the end of the harshest of his Epistles. It must be regarded as the overflowing of a loving heart, conscious of the severity of the language the Apostle has been compelled to use, yet deeply penetrated with a sense of its necessity for the well-being of the flock. The benediction is invoked upon all, the slanderers and gainsayers, the seekers after worldly wisdom, the hearkeners to false doctrine, as well as the faithful and obedient disciples. In regard to its form. we may remark that it was the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "favour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Jesus Christ in condescending to visit us, through which we received the revelation of the love of God, and that it was through that love that we received the gift of the Holy Spirit, to dwell in our hearts by faith, and thus to knit us into one body in Christ. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "communion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fellowship",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a rendering familiar to us through the Prayer Book, being that of Tyndale and Cranmer) see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The form of this benediction has always been regarded as a proof of the essential unity and equality of Father, Son and Holy Ghost.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The grace of our Lord,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. This is the only place where the full apostolic benediction occurs, and is alone sufficient to prove the doctrine of the Trinity. St. Paul seems to feel that the fullest benediction is needed at the close of the severest letter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With you all.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word \"all\" is here introduced with special tenderness and graciousness. Some have sinned before; some have not repented; yet he has for them all one prayer and one blessing and one \"seal of holy apostolic love? The superscription, though of no authority, may here correctly state that the letter was written at Philippi, and conveyed thence to Corinth by Titus and (possibly) Luke (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:16-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These are the last recorded words addressed by St. Paul to the Corinthian Church. The results produced by the letter and by his visit of three months (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:2, 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") were probably satisfactory, for we hear no more of any troubles at Corinth during his lifetime, and the spirit in which he writes the letter to the Romans from Corinth seems to have been unwontedly calm. He had been kindly welcomed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the collection, about which he had been so anxious, seems to have fully equalled his expectations, for as we know (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he conveyed it to Jerusalem in person with the delegates of the Churches. We gain a subsequent glimpse of the Corinthian Church. Some thirty-five years later, when a letter, which is still extant, was addressed to them by St. Clement of Rome, they were still somewhat inclined to be turbulent, disunited, and sceptical (see 'Ep. ad Corinthians,' 3, 4, 13, 14, 37, etc.); but still there are some marked signs of improvement. About A.D.  they were visited by Hegesippus (Eusebius, 'Hist. Eccl.,' 4:22), who spoke very favourably of them, especially of their obedience and liberality. Their bishop, Dionysius, was at that time exercising a widespread influence (Eusebius 'Hist. Eccl.,' 4:23). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 2 Corinthians 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The grace, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The most complete benediction of the Pauline epistles. In most of the epistles the introductory benedictions are confined to grace and peace. In the pastoral epistles mercy is added. In the closing benedictions uniformly grace.",
        "children": []
      }
    ]
  }
]