[{"header":"Elisha and the Floating Ax Head"},{"num":6,"verse":"The disciples of the prophets said to Elisha, “The place where we’re staying is too small for us. "},{"num":2,"verse":"Let’s go to the Jordan River. Each of us can get some logs and make a place for us to live there.”"},{"num":3,"verse":"Then one of the disciples asked, “Won’t you please come with us?”"},{"num":4,"verse":"So he went with them. They came to the Jordan River and began to cut down trees. "},{"num":5,"verse":"As one of them was cutting down a tree, the ax head fell into the water. He cried out, “Oh no, master! It was borrowed!”"},{"num":6,"verse":"The man of God asked, “Where did it fall?” When he showed Elisha the place, Elisha cut off a piece of wood. He threw it into the water at that place and made the ax head float. "},{"num":7,"verse":"Elisha said, “Pick it up.” The disciple reached for it and picked it up."},{"header":"The Aramean Army Is Struck with Blindness"},{"num":8,"verse":"Whenever the king of Aram was fighting against Israel, he asked for advice from his officers about where they were to camp."},{"num":9,"verse":"So the man of God would send a message to the king of Israel, “Be careful not to go by that place. The Arameans are hiding there.” "},{"num":10,"verse":"Then the king of Israel would send someone to the place that the man of God told him about. Elisha warned them so that they would be on their guard. He did this repeatedly."},{"num":11,"verse":"The king of Aram was very angry about this. He called his officers and asked them, “Won’t you tell me who among us is ⌞a spy⌟ for the king of Israel?”"},{"num":12,"verse":"One of his officers answered, “No one, Your Majesty. Elisha, the prophet in Israel, tells the king of Israel everything you say—even what you say in your bedroom.”"},{"num":13,"verse":"The king said, “Find out where he is. Then I will send men to capture him.”"},{"num":14,"verse":"So the king sent horses and chariots and a large fighting unit there. They came at night and surrounded the city."},{"num":15,"verse":"When the servant of the man of God got up in the morning and went outside, he saw troops, horses, and chariots surrounding the city. Elisha’s servant asked, “Master, what should we do?”"},{"num":16,"verse":"Elisha answered, “Don’t be afraid. We have more forces on our side than they have on theirs.” "},{"num":17,"verse":"Then Elisha prayed, “Lord, please open his eyes so that he may see.” The Lord opened the servant’s eyes and let him see. The mountain around Elisha was full of fiery horses and chariots."},{"num":18,"verse":"As the Arameans came down to get him, Elisha prayed to the Lord, “Please strike these people with blindness.” The Lord struck them with blindness, as Elisha had asked. "},{"num":19,"verse":"Elisha told them, “This isn’t the way! This isn’t the city. Follow me, and I will lead you to the man you’re looking for.” So he led them into Samaria. "},{"num":20,"verse":"When they came into Samaria, Elisha said, “Lord, open the eyes of these men, and let them see.” The Lord opened their eyes and let them see that they were in the middle of Samaria."},{"num":21,"verse":"When the king of Israel saw them, he asked Elisha, “Master, should I kill them? Should I kill them?”"},{"num":22,"verse":"Elisha answered, “Don’t kill them. Do you kill everyone you take captive in combat? Give them food and water. Let them eat and drink. Then let them go back to their master.”"},{"num":23,"verse":"So the king prepared a great feast for them. They ate and drank, and then he sent them back to their master. After this, Aramean troops didn’t raid Israel’s territory anymore."},{"header":"The Aramean Army Blockades Samaria"},{"num":24,"verse":"Later King Benhadad of Aram assembled his whole army. They went to Samaria and blockaded it. "},{"num":25,"verse":"The shortages caused by the blockade of Samaria became so severe that a donkey’s head sold for two pounds of silver and a half-pint of dove  manure for two ounces of silver."},{"num":26,"verse":"As the king of Israel was walking on the city wall, a woman cried to him, “Help me, Your Majesty!”"},{"num":27,"verse":"He answered, “If the Lord doesn’t help you, how can I help you? I can’t give you something from the threshing floor  or the winepress.” "},{"num":28,"verse":"Then the king asked her, “What’s the matter?”"},{"num":29,"verse":"So we boiled my son and ate him. The next day I told her, ‘Give up your son. We’ll eat him,’ but she hid her son.”"},{"num":30,"verse":"When the king heard the woman say this, he tore his clothes ⌞in distress⌟. As he was walking on the city wall, the people saw that he was wearing sackcloth under his clothes. "},{"num":31,"verse":"He said, “May God strike me dead if the head of Elisha, son of Shaphat, stays on his ⌞body⌟ today.”"},{"num":32,"verse":"Elisha was sitting in his home with the ⌞city’s⌟ leaders. The king had sent one of his men ahead of him ⌞to Elisha’s house⌟. But before the messenger arrived, Elisha asked the leaders, “Do you see how this murderer has sent someone to tear off my head? When the messenger comes, close the door. Hold it shut because the king will be following him.”"},{"num":33,"verse":"While he was still talking to them, the messenger arrived. He said to Elisha, “This severe famine is from the Lord. Why should I wait any longer for the Lord ⌞to help us⌟?”"}]