[{"num":6,"verse":"The students of the prophets spoke to Elisha."},{"num":4,"verse":"Elisha traveled with them, and they cut down trees when they arrived at the Jordan. "},{"num":5,"verse":"While one of the students was cutting down a tree, the iron of the ax broke off and dropped into the river."},{"num":8,"verse":"Aram’s king had waged war against Israel. He gave instructions to those who served him: “I want my war camp at this particular place.” "},{"num":9,"verse":"The man of God sent a message to Israel’s king."},{"num":10,"verse":"Israel’s king passed this warning on to those in the place the man of God had told him about. Elisha’s warning saved Israel’s king more than a few times. "},{"num":11,"verse":"Aram’s king became greatly angered by this. He gathered his servants together."},{"num":14,"verse":"So Aram’s king dispatched a great army of warriors, along with many horses and chariots, and they encircled the city of Dothan at night."},{"num":15,"verse":"The servant of the man of God woke up early and went outside. There he saw a great army, along with many horses and chariots, encircling Dothan."},{"num":18,"verse":"When the enemy approached Elisha, he prayed."},{"num":21,"verse":"The king of Israel saw them."},{"num":23,"verse":"Israel’s king had the table set and offered the Arameans a great feast. After they ate and drank, Israel’s king told them to leave. They returned to their own master, and the Arameans stopped sending raiding parties into Israel."},{"num":24,"verse":"Later, Ben-hadad, Aram’s king, assembled his army and surrounded Samaria. "},{"num":25,"verse":"There was already a famine in Samaria. Aram’s king surrounded Samaria for so long that, within Samaria, a donkey head cost two pounds of silver and two cups of dove’s dung cost two ounces of silver."},{"num":26,"verse":"Once when Israel’s king was walking on the wall, a woman yelled up to him."},{"num":30,"verse":"When the king heard of this horror, he ripped his clothes. Since he was walking on the wall, everyone who looked up saw that he was wearing sackcloth underneath."},{"num":32,"verse":"Meanwhile Elisha was resting in his house with the elders. The king had sent a messenger to him; but before the messenger arrived at Elisha’s house, Elisha knew what would happen."},{"num":33,"verse":"While Elisha was telling the elders these things, the messenger arrived."}]