[{"num":10,"verse":"The mishle (proverbs) of Sh’lomo. A ben chacham maketh glad an av, but a ben kesil is the grief of his em."},{"num":2,"verse":"Otzarot resha profit nothing, but tzedakah (righteousness) saveth from mavet."},{"num":3,"verse":"Hashem will not suffer the nefesh of the tzaddik to famish, but He thwarteth the craving of the resha’im."},{"num":4,"verse":"He becometh poor that dealeth with a negligent palm, but the yad of the diligent maketh wealth."},{"num":5,"verse":"He that gathereth in kayitz is a ben maskil (son of wisdom), but he that sleepeth in katzir (harvest) is a ben that causeth shame."},{"num":6,"verse":"Brakhot are upon the head of the tzaddik, but chamas covereth the peh (mouth) of the resha’im."},{"num":7,"verse":"The memory of the tzaddik is as bracha, but the shem resha’im shall rot."},{"num":8,"verse":"The chacham lev will receive mitzvot, but one with foolish sfatayim (lips) shall be thrust down."},{"num":9,"verse":"He that walketh uprightly walketh securely, but he that perverteth his drakhim shall be known."},{"num":10,"verse":"He that winketh with the ayin causeth trouble, but one with foolish sfatayim shall come to ruin."},{"num":11,"verse":"The peh (mouth) of a tzaddik is a Makor Chayyim, but chamas covereth the peh (mouth) of the resha’im."},{"num":12,"verse":"Sin’ah (hatred) stirreth up medanim (dissensions), but ahavah covereth all peysha’im."},{"num":13,"verse":"In the sfatayim (lips) of him that hath understanding chochmah is found, but a shevet (rod) is for the back of him that is devoid of lev [understanding]."},{"num":14,"verse":"Chachamim treasure up da’as (knowledge); but the peh (mouth) of the foolish is near destruction."},{"num":15,"verse":"The oisher’s wealth is his strong city; the destruction of the poor ones is their poverty."},{"num":16,"verse":"The wage of the tzaddik leadeth to Chayyim; the wage of the rashah is for chattat [Ro 6:23]."},{"num":17,"verse":"He is in the orach (path) of Chayyim that is shomer over musar, but he that abandoneth tokhakhat (reproof) goes astray."},{"num":18,"verse":"He that hideth sin’ah with sfatayim sheker, and he that uttereth a slander, is a kesil (fool)."},{"num":19,"verse":"In the multitude of devarim there wanteth not sin, but he that restraineth his sfatayim (lips) is maskil (wise)."},{"num":20,"verse":"The lashon of the tzaddik is as choice kesef; the lev of the resha’im is of little worth."},{"num":21,"verse":"The sfatayim (lips) of the tzaddik feed rabbim (many), but fools die for lack of lev [of chochmah]."},{"num":22,"verse":"The Birkat Hashem, it maketh wealthy, and He addeth no sorrow with it."},{"num":23,"verse":"It is as sport to a kesil to do zimmah (evil design), but an ish tevunah (man of understanding) hath chochmah."},{"num":24,"verse":"What the rashah dreads, it shall come upon him, but the ta’avat tzaddikim shall be granted."},{"num":25,"verse":"As the whirlwind passeth, so is the rashah no more, but the tzaddik is a yesod olam (an everlasting foundation)."},{"num":26,"verse":"As chometz to the teeth, and as smoke to the eyes, so is the atzel (sluggard, lazy one) to them that send him."},{"num":27,"verse":"The Yirat Hashem prolongeth yamim; but the shanot of the resha’im shall be cut short."},{"num":28,"verse":"The prospect of the tzaddikim shall be simchah, but the tikveh of the resha’im shall perish."},{"num":29,"verse":"The Derech Hashem is maoz to the blameless, but destruction shall be to the workers of iniquity."},{"num":30,"verse":"The tzaddik shall never be removed, but the resha’im shall not inhabit Eretz."},{"num":31,"verse":"The peh (mouth) of the tzaddik bringeth forth chochmah, but the lashon tahpukhot (tongue of perversion, distortion) shall be cut off."},{"num":32,"verse":"The sfatayim (lips) of the tzaddik know what is ratzon (acceptable), but the peh (mouth) of the resha’im speaketh tahpukhot (perversity)."}]