[[],[{"type":"prose","content":"Proverbs of Solomon. A wise son causeth a father to rejoice, And a foolish son [is] an affliction to his mother."}],[{"type":"prose","content":"Treasures of wickedness profit not, And righteousness delivereth from death."}],[{"type":"prose","content":"Jehovah causeth not the soul of the righteous to hunger, And the desire of the wicked He thrusteth away."}],[{"type":"prose","content":"Poor [is] he who is working -- a slothful hand, And the hand of the diligent maketh rich."}],[{"type":"prose","content":"Whoso is gathering in summer [is] a wise son, Whoso is sleeping in harvest [is] a son causing shame."}],[{"type":"prose","content":"Blessings [are] for the head of the righteous, And the mouth of the wicked cover doth violence."}],[{"type":"prose","content":"The remembrance of the righteous [is] for a blessing, And the name of the wicked doth rot."}],[{"type":"prose","content":"The wise in heart accepteth commands, And a talkative fool kicketh."}],[{"type":"prose","content":"Whoso is walking in integrity walketh confidently, And whoso is perverting his ways is known."}],[{"type":"prose","content":"Whoso is winking the eye giveth grief, And a talkative fool kicketh."}],[{"type":"prose","content":"A fountain of life [is] the mouth of the righteous, And the mouth of the wicked cover doth violence."}],[{"type":"prose","content":"Hatred awaketh contentions, And over all transgressions love covereth."}],[{"type":"prose","content":"In the lips of the intelligent is wisdom found, And a rod [is] for the back of him who is lacking understanding."}],[{"type":"prose","content":"The wise lay up knowledge, and the mouth of a fool [is] near ruin."}],[{"type":"prose","content":"The wealth of the rich [is] his strong city, The ruin of the poor [is] their poverty."}],[{"type":"prose","content":"The wage of the righteous [is] for life, The increase of the wicked for sin."}],[{"type":"prose","content":"A traveller to life [is] he who is keeping instruction, And whoso is forsaking rebuke is erring."}],[{"type":"prose","content":"Whoso is covering hatred with lying lips, And whoso is bringing out an evil report is a fool."}],[{"type":"prose","content":"In the abundance of words transgression ceaseth not, And whoso is restraining his lips [is] wise."}],[{"type":"prose","content":"The tongue of the righteous [is] chosen silver, The heart of the wicked -- as a little thing."}],[{"type":"prose","content":"The lips of the righteous delight many, And fools for lack of heart die."}],[{"type":"prose","content":"The blessing of Jehovah -- it maketh rich, And He addeth no grief with it."}],[{"type":"prose","content":"To execute inventions [is] as play to a fool, And wisdom to a man of understanding."}],[{"type":"prose","content":"The feared thing of the wicked it meeteth him, And the desire of the righteous is given."}],[{"type":"prose","content":"As the passing by of a hurricane, So the wicked is not, And the righteous is a foundation age-during."}],[{"type":"prose","content":"As vinegar to the teeth, And as smoke to the eyes, So [is] the slothful to those sending him."}],[{"type":"prose","content":"The fear of Jehovah addeth days, And the years of the wicked are shortened."}],[{"type":"prose","content":"The hope of the righteous [is] joyful, And the expectation of the wicked perisheth."}],[{"type":"prose","content":"The way of Jehovah [is] strength to the perfect, And ruin to workers of iniquity."}],[{"type":"prose","content":"The righteous to the age is not moved, And the wicked inhabit not the earth."}],[{"type":"prose","content":"The mouth of the righteous uttereth wisdom, And the tongue of frowardness is cut out."}],[{"type":"prose","content":"The lips of the righteous know a pleasing thing, And the mouth of the wicked perverseness!"}]]