[{"num":21,"verse":"Then the princes of the families of Levi came to Eleazar the priest, and to Josue the son of Nun, and to the princes of the kindreds of all the tribes of the children of Israel:"},{"num":2,"verse":"And they spoke to them in Silo in the land of Chanaan, and said: The Lord commanded by the hand of Moses, that cities should be given us to dwell in, and their suburbs to feed our cattle."},{"num":3,"verse":"And the children of Israel gave out of their possessions according to the commandment of the Lord, cities and their suburbs."},{"num":4,"verse":"And the lot came out for the family of Caath of the children of Aaron the priest out of the tribes of Juda, and of Simeon, and of Benjamin, thirteen cities."},{"num":5,"verse":"And to the rest of the children of Caath, that is, to the Levites, who remained, out of the tribes of Ephraim, and of Dan, and the half tribe of Manasses, ten cities."},{"num":6,"verse":"And the lot came out to the children of Gerson, that they should take of the tribes of Issachar and of Aser and of Nephtali, and of the half tribe of Manasses in Basan, thirteen cities."},{"num":7,"verse":"And to the sons of Merari by their kindreds, of the tribes of Ruben and or Cad and of Zabulon, twelve cities."},{"num":8,"verse":"And the children of Israel gave to the Levites the cities and their suburbs, as the Lord commanded by the hand of Moses, giving to every one by lot."},{"num":9,"verse":"Of the tribes of the children of Juda and of Simeon Josue gave cities: whose names are these,"},{"num":10,"verse":"To the sons of Aaron, of the families of Caath of the race of Levi (for the first lot came out for them)"},{"num":11,"verse":"The city of Arbe the father of Enac, which is called Hebron, in the mountain of Juda, and the suburbs thereof round about."},{"num":12,"verse":"But the fields and the villages thereof he had given to Caleb the son of Jephone for his possession."},{"num":13,"verse":"He gave therefore to the children of Aaron the priest, Hebron a city of refuge, and the suburbs thereof: and Lobna with the suburbs thereof,"},{"num":14,"verse":"And Jether and Estemo,"},{"num":15,"verse":"And Holon, and Dabir,"},{"num":16,"verse":"And Ain, and Jeta, and Bethsames, with their suburbs: nine cities out of the two tribes, as hath been said."},{"num":17,"verse":"And out of the tribe of the children of Benjamin, Gabaon, and Gabae,"},{"num":18,"verse":"And Anathoth and Almon, with their suburbs: four cities."},{"num":19,"verse":"All the cities together of the children of Aaron the priest, were thirteen, with their suburbs."},{"num":20,"verse":"And to the rest of the families of the children of Caath of the race of Levi was given this possession."},{"num":21,"verse":"Of the tribe of Ephraim, Sichem one of the cities of refuge, with the suburbs thereof in mount Ephraim, and Cater,"},{"num":22,"verse":"And Cibsaim, and Beth-horon, with their suburbs, four cities."},{"num":23,"verse":"And of the tribe of Dan, Eltheco and Gabathon,"},{"num":24,"verse":"And Aialon and Gethremmon, with their suburbs, four cities."},{"num":25,"verse":"And of the half tribe of Manasses, Thanac and Gethremmon, with their suburbs, two cities."},{"num":26,"verse":"All the cities were ten, with their suburbs, which were given to the children of Caath, of the inferior degree."},{"num":27,"verse":"To the children of Gerson also of the race of Levi out of the half tribe of Manasses, Gaulon in Basan, one of the cities of refuge, and Bosra, with their suburbs, two cities."},{"num":28,"verse":"And of the tribe of Issachar, Cesion, and Dabereth,"},{"num":29,"verse":"And Jaramoth, and Engannim, with their suburbs, four cities."},{"num":30,"verse":"And of the tribe of Aser, Masal and Abdon,"},{"num":31,"verse":"And Helcath, and Rohob, with their suburbs, four cities."},{"num":32,"verse":"Of the tribe also of Nephtali, Cedes in Galilee, one of the cities of refuge: and Hammoth Dor, and Carthan, with their suburbs, three cities."},{"num":33,"verse":"All the cities of the families of Gerson, were thirteen, with their suburbs."},{"num":34,"verse":"And to the children of Merari, Levites of the inferior degree, by their families were given of the tribe of Zabulon, Jecnam and Cartha,"},{"num":35,"verse":"And Damna and Naalol, four cities with their suburbs;"},{"num":36,"verse":"Of the tribe of Ruben beyond the Jordan over against Jericho, Bosor in the wilderness, one of the cities of refuge, Miser and Jaser and Jethson and Mephaath, four cities with their suburbs."},{"num":37,"verse":"Of the tribe of Gad, Ramoth in Galaad, one of the cities of refuge, and Manaim and Hesebon and Jaser, four cities with their suburbs."},{"num":38,"verse":"All the cities of the children of Merari by their families and kindreds, were twelve."},{"num":39,"verse":"So all the cities of the Levites within the possession of the children of Israel were forty-eight,"},{"num":40,"verse":"With their suburbs, each distributed by the families."},{"num":41,"verse":"And the Lord God gave to Israel all the land that he had sworn to give to their fathers: and they possessed it and dwelt in it."},{"num":42,"verse":"And he gave them peace from all nations round about: and none of their enemies durst stand against them, but were brought under their dominion."},{"num":43,"verse":"Not so much as one word, which he had promised to perform unto them, was made void, but all came to pass."}]