[{"header":"Chapter 21"},{"num":1,"verse":"The Levitical Cities. Now the leaders of the ancestral clans of the Levites came to Eleazar, the priest, Joshua, the son of Nun, and the leaders of the ancestral tribes of the Israelites"},{"num":2,"verse":"at Shiloh in the land of Canaan and they said to them, “The Lord commanded through Moses that you give us cities in which we can live and have pastures for our cattle.”"},{"num":3,"verse":"So the Israelites gave the Levites cities and pastures out of their own inheritance as the Lord had commanded."},{"num":4,"verse":"The first lot chosen was for the Kohathites, divided according to its families. Now the Levites were the descendants of Aaron the priest, and they were allotted thirteen cities out of the inheritance of the tribes of Judah, Simeon, and Benjamin."},{"num":5,"verse":"The rest of the descendants of Kohath were allotted ten cities from the inheritance of the clans of the tribes of Ephraim, Dan, and one of the halves of the tribe of Manasseh."},{"num":6,"verse":"The descendants of Gershom were allotted thirteen cities from the inheritance of the clans of the tribes of Issachar, Asher, Naphtali, and the half of the tribe of Manasseh that was living in Bashan."},{"num":7,"verse":"The descendants of Merari, divided according to its families, were allotted twelve cities from the inheritance of the tribes of Reuben, Gad, and Zebulun."},{"num":8,"verse":"This is how the Israelites gave the Levites their cities with their pastures, just as the Lord had commanded through Moses."},{"num":9,"verse":"These are the names of the cities that were given from the tribe of the Judahites and the tribe of the Simeonites."},{"num":10,"verse":"(These cities were given to the descendants of Aaron who came from the Kohathite clan because their lot was the first chosen.)"},{"num":11,"verse":"They were given Kiriath-arba (that is, Hebron; Arba was the forefather of Anak) and its surrounding pastures in the hill country of Judah,"},{"num":12,"verse":"but the fields belonging to the city and the towns surrounding it had already been given to Caleb, the son of Jephunneh, as his possession."},{"num":13,"verse":"So the descendants of Aaron the priest were given Hebron (which was a city of refuge for someone who had killed another person) and its pastures, Libnah and its pastures,"},{"num":14,"verse":"Jattir and its pastures, Eshtemoa and its pastures,"},{"num":15,"verse":"Holon and its pastures, Debir and its pastures,"},{"num":16,"verse":"Ain and its pastures, Juttah and its pastures, and Beth-shemesh and its pastures. Thus, there were nine cities from those two tribes."},{"num":17,"verse":"From the tribe of Benjamin they were given Gibeon and its pastures, Geba and its pastures,"},{"num":18,"verse":"Anathoth and its pastures, and Almon and its pastures. Thus, there were four cities."},{"num":19,"verse":"In total, there were thirteen cities with their pastures for the descendants of Aaron the priest."},{"num":20,"verse":"Cities of the Other Kohathites. As for the rest of the Kohathite families of the Levites, these Kohathites were allotted cities out of the inheritance of Ephraim."},{"num":21,"verse":"In the hill country of Ephraim they were given Shechem (which was a city of refuge for someone who had killed another person) and its pastures, Gezer and its pastures,"},{"num":22,"verse":"Kibzaim with its pastures, and Beth-horon with its pastures. Thus, there were four cities."},{"num":23,"verse":"From the tribe of Dan they were given Elteke and its pastures, Gibbethon and its pastures,"},{"num":24,"verse":"Aijalon with its pastures, and Gath-rimmon with its pastures. Thus, there were four cities."},{"num":25,"verse":"From one of the halves of the tribe of Manasseh they were given Taanach with its pastures, and Gath-rimmon with its pastures. Thus, there were two cities."},{"num":26,"verse":"In total, there were ten cities with their pastures that were given to the rest of the Kohathites."},{"num":27,"verse":"The Cities of the Gershonites. The Levite’s clans of the Gershonites were given from the other half-tribe of Manasseh, Golan in Bashan (which was a city of refuge for someone who had killed another) and its pastures, and Ashtaroth and its pastures. Thus, there were two cities."},{"num":28,"verse":"From the tribe of Issachar they were given Kishion and its pastures, Daberath and its pastures,"},{"num":29,"verse":"Jarmuth and its pastures, and En-gannim and its pastures. Thus, there were four cities."},{"num":30,"verse":"From the tribe of Asher they were given Mishal with its pastures, Abdon with its pastures,"},{"num":31,"verse":"Helkath with its pastures, and Rehob with its pastures. Thus, there were four cities."},{"num":32,"verse":"From the tribe of Naphtali they were given Kedesh in Galilee (which was a city of refuge for someone who had killed another) and its pastures, Hammath and its pastures, and Kartan and its pastures. Thus, there were three cities."},{"num":33,"verse":"In total, there were thirteen cities with their pastures for the Gershonite families."},{"num":34,"verse":"The Cities of the Merarites. The Merarite families (the rest of the Levites) were given from the tribe of Zebulun, Jokneam with its pastures, Kartah with its pastures,"},{"num":35,"verse":"Dimnah with its pastures, and Nahalal with its pastures. Thus, there were four cities."},{"num":36,"verse":"From the tribe of Reuben they were given Bezer with its pastures, Jahaz with its pastures,"},{"num":37,"verse":"Kedemoth with its pastures, and Mephaath and its pastures. Thus, there were four cities."},{"num":38,"verse":"From the tribe of Gad they were given Ramoth in Gilead (which was a city of refuge for someone who had killed another) and its pastures, Mahanaim and its pastures,"},{"num":39,"verse":"Heshbon and its pastures, and Jazer with its pastures. Thus, there were four cities."},{"num":40,"verse":"In total, there were twelve cities allotted to the families of the Merarites (the rest of the Levites)."},{"num":41,"verse":"In all, there were forty-eight cities together with their pastures for the Levites within the land in the possession of the Israelites."},{"num":42,"verse":"Each of these cities has pastures surrounding it; this was true of all of the cities."},{"num":43,"verse":"Thus the Lord gave Israel the entire land that he had promised to give to their fathers. They took possession of it and dwelt there."},{"num":44,"verse":"The Lord then gave them rest on every side, just as he had promised their fathers. Not one of their enemies could stand up to them. The Lord had delivered all of their enemies into their hands."},{"num":45,"verse":"None of the good things that the Lord had promised to the house of Israel failed to take place. It all came true."}]