[{"num":21,"verse":"It was at this time that the heads of the leaders of the Levites came before the priest Eleazar and Joshua, son of Nun, and the other leaders of the tribes of the Israelites "},{"num":2,"verse":"at Shiloh in the land of Canaan."},{"num":3,"verse":"So in obedience to the Eternal’s command, the Israelites allotted to the Levites towns with their surrounding pasturelands, from out of their inheritances, "},{"num":4,"verse":"and lots were drawn for the clans of the descendants of Kohath. To those Levites who were descendants of Aaron the priest went 13 towns from the tribes of Judah, Simeon, and Benjamin. "},{"num":5,"verse":"The other descendants of Kohath were given 10 towns from the clans of the tribes of Ephraim and Dan and the half-tribe of Manasseh. "},{"num":6,"verse":"The descendants of Gershon were allotted 13 towns from the clans of the tribes of Issachar, Asher, Naphtali, and the half-tribe of Manasseh that lived in Bashan. "},{"num":7,"verse":"The descendants of Merari and their clans were granted 12 towns from the tribes of Reuben, Gad, and Zebulun. "},{"num":8,"verse":"This, then, was the land granted by drawing lots for the Levites, by the other people of Israel as the Eternal had commanded through Moses—these towns with their surrounding pastures. "},{"num":9,"verse":"From the tribes of the Judahites and the Simeonites came the following towns mentioned by name, "},{"num":10,"verse":"which were granted to the descendants of Aaron, of the clans of the descendants of Kohath who were Levites, since they were chosen first: "},{"num":11,"verse":"the city of Kiriath-arba (Arba was the father of Anak), that is Hebron, in the highlands of Judah, as well as the pasturelands around it. "},{"num":12,"verse":"The fields and villages of the town had already been granted to Caleb, son of Jephunneh, for his inheritance."},{"num":13,"verse":"So to the descendants of Aaron the priest they gave Hebron, the city of refuge for a slayer, and Libnah; Jattir, Eshtemoa, Holon, Debir, Ain, Juttah, and Beth-shemesh, all with their villages—9 cities with their pastures given by these two tribes."},{"num":17,"verse":"These cities were given by the tribe of Benjamin: Gibeon, Geba, Anathoth, and Almon, all with their villages—4 cities. So the cities granted to the descendants of Aaron—the priests—totaled 13, with their pastures and their villages."},{"num":20,"verse":"As for the remaining clans of the people of Kohath of the Levites, the cities allotted to them were given by the tribe of Ephraim: Shechem (the city of refuge in the highlands of Ephraim) Gezer, Kibzaim, and Beth-horon, all with their villages—4 cities with their pastures. "},{"num":23,"verse":"Out of the tribe of Dan they were given Elteke, Gibbethon, Aijalon, and Gath-rimmon, all with their pasturelands—4 cities. "},{"num":25,"verse":"And out of the half-tribe of Manasseh they received Taanach with its villages and Gath-rimmon with its villages and their pastures—2 cities. "},{"num":26,"verse":"So the cities given to the clans of the rest of the Kohathites totaled 10, with their pasturelands."},{"num":27,"verse":"The Gershonites, another of the clans of the Levites, received from the half-tribe of Manasseh: Golan in Bashan (the city of refuge), with its villages and pastures, and Beeshterah with its villages and pastures—2 cities. "},{"num":28,"verse":"From the tribe of Issachar they received Kishion, Daberath, Jarmuth, and En-gannim, all with their villages—4 cities."},{"num":30,"verse":"From the tribe of Asher came Mishal, Abdon, Helkath, and Rehob, all with their villages and pastures—4 cities. "},{"num":32,"verse":"From the tribe of Naphtali: Kedesh in Galilee (the city of refuge), Hammoth-dor, and Kartan, all with their villages and their pastures—3 cities. "},{"num":33,"verse":"In all, the cities granted to the clans of the Gershonites totaled 13, along with their villages and their pastures."},{"num":34,"verse":"The rest of the Levites—the clans of the Merarites—received from the tribe of Zebulun: Jokneam, Kartah, Dimnah, and Nahalal, all with their villages and pastures—4 cities. "},{"num":36,"verse":"From the tribe of Reuben they were given Bezer, Jahzah, Kedemoth, and Mephaath, all with their villages and their pastures—4 cities. "},{"num":38,"verse":"From the tribe of Gad: Ramoth in Gilead (the city of refuge), Mahanaim, Heshbon, and Jazer, all with their villages and their pastures—4 cities in all. "},{"num":40,"verse":"So the cities of the Merarite clans, that is, the remaining clans of Levi, totaled 12. "},{"num":41,"verse":"The Levites were granted 48 cities, each with villages around them and the pasturelands, within the holdings of the Israelites. "},{"num":42,"verse":"So it was that they received these cities, their villages, and their pastures."},{"num":43,"verse":"That is how the Eternal gave to the people of Israel all the land He had promised to their ancestors; and when they had taken possession of the land, the Israelites settled upon it. "},{"num":44,"verse":"So He gave them rest from war on every side as He had sworn to their ancestors; none of their enemies still stood against them, for the Eternal had delivered them all into their hands. "},{"num":45,"verse":"Not a single one of all the good promises that He had made to the house of Israel went unfulfilled; all of them came to pass."}]