[{"header":"The Death of Moses"},{"num":34,"verse":"Sometime later, Moses left the lowlands of Moab. He went up Mount Pisgah to the peak of Mount Nebo, which is across the Jordan River from Jericho. The Lord showed him all the land as far north as Gilead and the town of Dan. "},{"num":2,"verse":"He let Moses see the territories that would soon belong to the tribes of Naphtali, Ephraim, Manasseh, and Judah, as far west as the Mediterranean Sea. "},{"num":3,"verse":"The Lord also showed him the land in the south, from the valley near the town of Jericho, known as The City of Palm Trees, down to the town of Zoar."},{"num":4,"verse":"The Lord said, “Moses, this is the land I was talking about when I solemnly promised Abraham, Isaac, and Jacob that I would give land to their descendants. I have let you see it, but you will not cross the Jordan and go in.”"},{"num":5,"verse":"And so, Moses the Lord’s servant died there in Moab, just as the Lord had said. "},{"num":6,"verse":"The Lord buried him in a valley near the town of Beth-Peor, but even today no one knows exactly where. "},{"num":7,"verse":"Moses was a hundred twenty years old when he died, yet his eyesight was still good, and his body was strong."},{"num":8,"verse":"The people of Israel stayed in the lowlands of Moab, where they mourned and grieved thirty days for Moses, as was their custom."},{"header":"Joshua Becomes the Leader of Israel"},{"num":9,"verse":"Before Moses died, he had placed his hands on Joshua, and the Lord had given Joshua wisdom. The Israelites paid attention to what Joshua said and obeyed the commands that the Lord had given Moses."},{"header":"Moses Was a Great Prophet"},{"num":10,"verse":"There has never again been a prophet in Israel like Moses. The Lord spoke face to face with him "},{"num":11,"verse":"and sent him to perform powerful miracles in the presence of the king of Egypt and his entire nation. "},{"num":12,"verse":"No one else has ever had the power to do such great things as Moses did for everyone to see."}]