[[],[{"type":"header","content":"The Triumphs of Faith"},{"type":"prose","content":"Now faith is the assurance (title deed, confirmation) of things hoped for (divinely guaranteed), and the evidence of things not seen [the conviction of their reality—faith comprehends as fact what cannot be experienced by the physical senses]. "}],[{"type":"prose","content":"For by this [kind of] faith the men of old gained [divine] approval."}],[{"type":"prose","content":"By faith [that is, with an inherent trust and enduring confidence in the power, wisdom and goodness of God] we understand that the worlds (universe, ages) were framed  created [formed, put in order, and equipped for their intended purpose] by the word of God, so that what is seen was not made out of things which are visible. "}],[{"type":"prose","content":"By faith Abel offered to God a more acceptable sacrifice than Cain, through which it was testified of him that he was righteous (upright, in right standing with God), and God testified by accepting his gifts. And though he died, yet through [this act of] faith he still speaks. "}],[{"type":"prose","content":"By faith [that pleased God] Enoch was caught up  taken to heaven so that he would not have a glimpse of death; AND HE WAS NOT FOUND BECAUSE GOD HAD TAKEN HIM; for even before he was taken [to heaven], he received the testimony [still on record] that he had walked with God  pleased Him. "}],[{"type":"prose","content":"But without faith it is impossible to [walk with God and] please Him, for whoever comes [near] to God must [necessarily] believe that God exists and that He rewards those who [earnestly and diligently] seek Him. "}],[{"type":"prose","content":"By faith [with confidence in God and His word] Noah, being warned  about events not yet seen, in reverence prepared an ark for the salvation of his family. By this [act of obedience] he condemned the world and became an heir of the righteousness which comes by faith."}],[{"type":"prose","content":"By faith Abraham, when he was called [by God], obeyed by going to a place which he was to receive as an inheritance; and he went, not knowing where he was going. "}],[{"type":"prose","content":"By faith he lived as a foreigner in the promised land, as in a strange , living in tents [as nomads] with Isaac and Jacob, who were fellow heirs of the same promise. "}],[{"type":"prose","content":"For he was [waiting expectantly and confidently] looking forward to the city which has foundations, [an eternal, heavenly city] whose architect and builder is God. "}],[{"type":"prose","content":"By faith even Sarah herself received the ability to conceive [a child], even [when she was long] past the normal age for it, because she considered Him who had given her the promise to be reliable  true [to His word]. "}],[{"type":"prose","content":"So from one man, though he was [physically] as good as dead, were born  AS THE STARS OF HEAVEN IN NUMBER, AND INNUMERABLE AS THE SAND ON THE SEASHORE."}],[{"type":"prose","content":"All these died in faith [guided and sustained by it], without receiving the [tangible fulfillment of God’s] promises, only having seen (anticipated) them and having welcomed them from a distance, and having acknowledged that they were strangers and exiles on the earth. "}],[{"type":"prose","content":"Now those who say such things make it clear that they are looking for a country of their own. "}],[{"type":"prose","content":"And if they had been thinking of that  from which they departed [as their true home], they would have had [a continuing] opportunity to return. "}],[{"type":"prose","content":"But the truth is that they were longing for a better country, that is, a heavenly one. For that reason God is not ashamed [of them or] to be called their God [even to be surnamed their God—the God of Abraham, Isaac, and Jacob]; for He has prepared a city for them."}],[{"type":"prose","content":"By faith Abraham, when he was tested [that is, as the testing of his faith was still in progress], offered up Isaac, and he who had received the promises [of God] was ready to sacrifice his only son [of promise]; "}],[{"type":"prose","content":"to whom it was said, “THROUGH ISAAC YOUR DESCENDANTS SHALL BE CALLED.” "}],[{"type":"prose","content":"For he considered [it reasonable to believe] that God was able to raise  even from among the dead. [Indeed, in the sense that he was prepared to sacrifice Isaac in obedience to God] Abraham did receive him back [from the dead] figuratively speaking. "}],[{"type":"prose","content":"By faith Isaac blessed Jacob and Esau [believing what God revealed to him], even regarding things to come. "}],[{"type":"prose","content":"By faith Jacob, as he was dying, blessed each of the sons of Joseph, and bowed in worship,  on the top of his staff. "}],[{"type":"prose","content":"By faith Joseph, when he was dying, referred to [the promise of God for] the exodus of the sons of Israel [from Egypt], and gave instructions concerning [the burial of] his bones [in the land of the promise]."}],[{"type":"prose","content":"By faith Moses, after his birth, was hidden for three months by his parents, because they saw he was a beautiful  divinely favored child; and they were not afraid of the king’s (Pharaoh’s) decree. "}],[{"type":"prose","content":"By faith Moses, when he had grown up, refused to be called the son of Pharaoh’s daughter, "}],[{"type":"prose","content":"because he preferred to endure the hardship of the people of God rather than to enjoy the passing pleasures of sin. "}],[{"type":"prose","content":"He considered the reproach of the Christ [that is, the rebuke he would suffer for his faithful obedience to God] to be greater wealth than all the treasures of Egypt; for he looked ahead to the reward [promised by God]. "}],[{"type":"prose","content":"By faith he left Egypt, being unafraid of the wrath of the king; for he endured [steadfastly], as seeing Him who is unseen. "}],[{"type":"prose","content":"By faith he kept the Passover and the sprinkling of the blood [on the doorposts], so that the destroyer of the firstborn would not touch them (the firstborn of Israel). "}],[{"type":"prose","content":"By faith the people [of Israel] crossed the Red Sea as though  through dry land; but when the Egyptians attempted it they were drowned."}],[{"type":"prose","content":"By faith the walls of Jericho fell down after they had been encircled for seven days [by Joshua and the sons of Israel]. "}],[{"type":"prose","content":"By faith Rahab the prostitute was not destroyed along with those who were disobedient, because she had welcomed the spies [sent by the sons of Israel] in peace."}],[{"type":"prose","content":"And what more shall I say? For time will fail me if I tell of Gideon, Barak, Samson, Jephthah, of David and Samuel and the prophets, "}],[{"type":"prose","content":"who by faith [that is, with an enduring trust in God and His promises] subdued kingdoms, administered justice, obtained promised blessings, closed the mouths of lions, "}],[{"type":"prose","content":"extinguished the power of [raging] fire, escaped the edge of the sword, out of weakness were made strong, became mighty  unbeatable in battle, putting enemy forces to flight. "}],[{"type":"prose","content":"Women received back their dead by resurrection; and others were tortured [to death], refusing to accept release [offered on the condition of denying their faith], so that they would be resurrected to a better life; "}],[{"type":"prose","content":"and others experienced the trial of mocking and scourging [amid torture], and even chains and imprisonment. "}],[{"type":"prose","content":"They were stoned [to death], they were sawn in two, they were lured with tempting offers [to renounce their faith], they were put to death by the sword; they went about wrapped in the skins of sheep and goats, utterly destitute, oppressed, cruelly treated "}],[{"type":"prose","content":"people of whom the world was not worthy, wandering in deserts and mountains and [living in] caves and holes in the ground."}],[{"type":"prose","content":"And all of these, though they gained [divine] approval through their faith, did not receive [the fulfillment of] what was promised, "}],[{"type":"prose","content":"because God had us in mind  had something better for us, so that they [these men and women of authentic faith] would not be made perfect [that is, completed in Him] apart from us."}]]