[{"header":"Faith"},{"num":11,"verse":"Now faith is being sure we will get what we hope for. It is being sure of what we cannot see. "},{"num":2,"verse":"God was pleased with the men who had faith who lived long ago."},{"num":3,"verse":"Through faith we understand that the world was made by the Word of God. Things we see were made from what could not be seen."},{"num":4,"verse":"Because Abel had faith, he gave a better gift in worship to God than Cain. His gift pleased God. Abel was right with God. Abel died, but by faith he is still speaking to us."},{"num":5,"verse":"Because Enoch had faith, he was taken up from the earth without dying. He could not be found because God had taken him. The Holy Writings tell how he pleased God before he was taken up. "},{"num":6,"verse":"A man cannot please God unless he has faith. Anyone who comes to God must believe that He is. That one must also know that God gives what is promised to the one who keeps on looking for Him."},{"num":7,"verse":"Because Noah had faith, he built a large boat for his family. God told him what was going to happen. His faith made him hear God speak and he obeyed. His family was saved from death because he built the boat. In this way, Noah showed the world how sinful it was. Noah became right with God because of his faith in God."},{"num":8,"verse":"Because Abraham had faith, he obeyed God when God called him to leave his home. He was to go to another country that God promised to give him. He left his home without knowing where he was going. "},{"num":9,"verse":"His faith in God kept him living as a stranger in the country God had promised to him. Isaac and Jacob had received the same promise. They all lived in tents together. "},{"num":10,"verse":"Abraham was looking to God and waiting for a city that could not be moved. It was a city planned and built by God."},{"num":11,"verse":"Because Sarah had faith, she was able to have a child long after she was past the age to have children. She had faith to believe that God would do what He promised. "},{"num":12,"verse":"Abraham was too old to have children. But from this one man came a family with as many in it as the stars in the sky and as many as the sand by the sea."},{"num":13,"verse":"These people all died having faith in God. They did not receive what God had promised to them. But they could see far ahead to all the things God promised and they were glad for them. They knew they were strangers here. This earth was not their home. "},{"num":14,"verse":"People who say these things show they are looking for a country of their own. "},{"num":15,"verse":"They did not think about the country they had come from. If they had, they might have gone back. "},{"num":16,"verse":"But they wanted a better country. And so God is not ashamed to be called their God. He has made a city for them."},{"num":17,"verse":"Because Abraham had faith, when he was tested, he gave his son Isaac as a gift on the altar in worship. God had made a promise to Abraham that He would give him a son. And yet Abraham was willing to give his only son as a gift on the altar in worship. "},{"num":18,"verse":"God had said to Abraham, “Your family will come from Isaac.”  "},{"num":19,"verse":"Abraham believed God was able to bring Isaac back to life again. And so it may be said that Abraham did receive him back from death."},{"num":20,"verse":"Because Isaac had faith, he said that good would come to Jacob and Esau in the future. "},{"num":21,"verse":"Because Jacob had faith, he said that good would come to each of Joseph’s sons as he was dying. He used his walking stick to hold him up as he prayed to God."},{"num":22,"verse":"Because Joseph had faith, he spoke of the Jews leaving the country of Egypt. He was going to die soon, and he told them to bury his body in the country where they were going."},{"num":23,"verse":"Because of faith, Moses, after he was born, was hidden by his parents for three months. They saw that he was a beautiful child. They were not afraid of the king when he said that all baby boys should be killed."},{"num":24,"verse":"Because Moses had faith, he would not be called the son of Pharaoh’s daughter when he grew up. "},{"num":25,"verse":"He chose to suffer with God’s people instead of having fun doing sinful things for awhile. "},{"num":26,"verse":"Any shame that he suffered for Christ was worth more than all the riches in Egypt. He kept his eyes on the reward God was going to give him."},{"num":27,"verse":"Because Moses had faith, he left Egypt. He was not afraid of the king’s anger. Moses did not turn from the right way but kept seeing God in front of him. "},{"num":28,"verse":"Because Moses had faith, he told all the Jews to put blood over their doors. Then the angel of death would pass over their houses and not kill their oldest sons."},{"num":29,"verse":"Because the Jews had faith, they went through the Red Sea as if they were on dry ground. But when the people of Egypt tried to go through, they were all killed by the water."},{"num":30,"verse":"Because the Jews had faith, the walls of the city of Jericho fell down after the Jews had walked around the city for seven days. "},{"num":31,"verse":"Because Rahab had faith, she was kept from being killed along with those who did not obey God. She was a woman who sold the use of her body. But she helped the men who had come in secret to look over the country."},{"header":"There Were Many More Who Had Faith in God"},{"num":32,"verse":"What more should I say? There is not enough time to tell of Gideon and of Barak and of Samson and of Jephthah and of David and of Samuel and of the early preachers. "},{"num":33,"verse":"It was because these people had faith that they won wars over other countries. They were good leaders. They received what God promised to them. They closed the mouths of lions "},{"num":34,"verse":"and stopped fire that was burning. They got away from being killed with swords. They were made strong again after they had been weak and sick. They were strong in war. They made fighting men from other countries run home. "},{"num":35,"verse":"It was because some women had faith that they received their dead back to life. Others chose to be beaten instead of being set free, because they would not turn against God. In this way, they would be raised to a better life. "},{"num":36,"verse":"Others were talked against. Some were beaten. Some were put in chains and in prison. "},{"num":37,"verse":"They were killed by stones being thrown at them. People were cut in pieces. They were tested. They were killed with swords. They wore skins of sheep and goats and had nothing they could call their own. They were hungry and sick. Everyone was bad to them. "},{"num":38,"verse":"They walked around in deserts and in mountains. They looked for caves and holes in the earth to live in. They were too good for this world. "},{"num":39,"verse":"It was because of their faith that God was pleased with them. But they did not receive what God had promised. "},{"num":40,"verse":"God had planned something better for us. These men could not be made perfect without us."}]