[{"header":"What Faith Really Means"},{"num":11,"verse":"What then is faith? It is what gives assurance to our hopes; it is what gives us conviction about things we can’t see. "},{"num":2,"verse":"It is what the men and women of old were famous for. "},{"num":3,"verse":"It is by faith that we understand that the worlds were formed by God’s word; in other words, that the visible world was not made from visible things."},{"num":4,"verse":"It was by faith that Abel offered a better sacrifice to God than Cain. That earned him the testimony that he was in the right, since God himself bore witness in relation to his gifts. Through faith, he still speaks, even though he’s dead. "},{"num":5,"verse":"It was by faith that Enoch was taken up so that he wouldn’t see death; nobody could find him, because God took him up. Before he was taken up, you see, it had been said of him that ‘he had pleased God’. "},{"num":6,"verse":"And without faith it’s impossible to please God; for those who come to worship God must believe that he really does exist, and that he rewards those who seek him."},{"header":"Faith and the Future: Noah, Abraham, Sarah"},{"num":7,"verse":"It was by faith that Noah, who had been warned by God about things that were not yet seen, took the warning seriously and built an ark to save his household. He thus put the rest of the world in the wrong, and became heir to the righteous standing which accords with faith."},{"num":8,"verse":"It was by faith that Abraham, when God called him, obeyed and went out to a place where he was to receive an inheritance. Off he went, not knowing where he was going. "},{"num":9,"verse":"It was by faith that he stayed in the promised land as a stranger, living in tents with Isaac and Jacob, who were joint heirs of the same promise. "},{"num":10,"verse":"He was looking ahead, you see, to the city which has foundations, the city of which God is the designer and builder."},{"num":11,"verse":"It was by faith that Sarah herself, who was barren, received the ability to conceive a child even when long past the right age, since she considered that God, who had promised, was trustworthy. "},{"num":12,"verse":"Thus it came about that from one man, and him more or less dead, there was born a family as many as the stars of heaven in number, as uncountable as the sand on the seashore."},{"header":"Faith that Looks Beyond Death"},{"num":13,"verse":"All these people died in faith. They hadn’t received the promise, but they had seen it from far off, and had greeted it, and had recognized that they were strangers and wanderers in the land. "},{"num":14,"verse":"People who say that sort of thing, you see, make it clear that they are looking for a homeland. "},{"num":15,"verse":"Had they been thinking of the place from which they had set out, they would have had plenty of opportunity to go back to it. "},{"num":16,"verse":"But as it was they were longing for a better place, a heavenly one. That’s why God is not ashamed to be called ‘their God’, since he has prepared a city for them."},{"num":17,"verse":"It was by faith that Abraham, when he was put to the test, offered up Isaac; yes, Abraham, who had received the promise, was in the very act of offering up his only son, "},{"num":18,"verse":"the one about whom it had been said that ‘In Isaac shall your family be named’. "},{"num":19,"verse":"He reckoned that God was capable of raising him even from the dead; and, in one sense, he did indeed receive him back from there."},{"num":20,"verse":"It was by faith in the things that were to come that Isaac blessed Jacob and Esau. "},{"num":21,"verse":"It was by faith that, when Jacob was dying, he blessed the two sons of Joseph, and ‘worshipped, leaning on the top of his staff’. "},{"num":22,"verse":"It was by faith that, when Joseph was coming to the end, he spoke about the Exodus of the children of Israel, and gave instructions concerning his own bones."},{"header":"Faith and the Future: Moses and the Exodus"},{"num":23,"verse":"It was by faith that, when Moses was born, he was hidden for three months by his parents. They saw that the child was beautiful, and they weren’t afraid of the king’s orders. "},{"num":24,"verse":"It was by faith that Moses, when he grew up, refused to be called the son of Pharaoh’s daughter, "},{"num":25,"verse":"preferring to suffer hardship along with God’s people than to enjoy the short-term pleasures of sin. "},{"num":26,"verse":"He reckoned that reproach suffered for the Messiah was worth more than all the treasures of Egypt; he was looking ahead to the reward."},{"num":27,"verse":"It was by faith that he left Egypt, without fear of Pharaoh’s anger; he kept the invisible one constantly before his eyes. "},{"num":28,"verse":"It was by faith that he kept the Passover and the sprinkling of blood, so that the Destroyer of the firstborn wouldn’t touch them. "},{"num":29,"verse":"It was by faith that they crossed the Red Sea as though they were on dry ground, while the Egyptians, when they tried to do the same, were drowned. "},{"num":30,"verse":"It was by faith that the walls of Jericho fell down after they had been encircled for seven days. "},{"num":31,"verse":"It was by faith that the prostitute Rahab was not destroyed along with those who didn’t believe; she had welcomed the spies in peace."},{"header":"Faith and the Future: The Great Crowd"},{"num":32,"verse":"What more can I say, then? I’ve run out of time to tell you about Gideon, Barak, Samson, Jephthah, David, Samuel and the prophets. "},{"num":33,"verse":"It was through faith that they overcame kingdoms, put justice into practice, received promises, shut the mouths of lions, "},{"num":34,"verse":"quenched the power of fire, escaped the edge of the sword, were strong where they had been weak, became powerful in battle, and sent foreign armies packing. "},{"num":35,"verse":"Women received their dead by resurrection; others were tortured, not accepting release, so that they might receive a better resurrection. "},{"num":36,"verse":"Others again experienced painful derision and flogging, and even chains and imprisonment; "},{"num":37,"verse":"they were stoned, they were sawn in two, they were put to the sword, they went about in sheepskins or goat-hides, they were destitute, they were persecuted, they were ill-treated – "},{"num":38,"verse":"the world didn’t deserve them! – and they wandered in deserts and mountains, in caves and holes in the ground."},{"num":39,"verse":"All these people gained a reputation for their faith; but they didn’t receive the promise. "},{"num":40,"verse":"God was providing something better for us, so that they wouldn’t reach perfection without our doing so as well."}]