[{"num":11,"verse":"Now Emunah is the substance of things for which we have tikvah. Emunah is the conviction of things not seen."},{"num":2,"verse":"For by Emunah have our Zekenim been given approval."},{"num":3,"verse":"By Emunah we have binah Shomayim v’ha’Aretz found their \"barah\" from the Dvar Hashem, so that not from anything visible has what we see come into being. [TEHILLIM 33:6]"},{"num":4,"verse":"By Emunah Hevel (Abel) offered to Hashem a korban that was a mincha tovah than that of Kayin. Through this he was given approval that he was a tzaddik, Hashem bearing solemn eidus (testimony) to his matanot; and by his Emunah, Hevel, though niftar (deceased), still speaks."},{"num":5,"verse":"By Emunah Chanoch was taken up, was translated, not to see mavet, V’EINENNU KI LAKACH OTO ELOHIM (\"and he was not, because G-d took him [up]\" Gn 5:24). Before Chanoch was raptured in his aliyah l’Shomayim, he received solemn eidus (testimony) that he had been pleasing to Hashem."},{"num":6,"verse":"And without Emunah it is impossible to please Hashem. For it is necessary for the one making a kiruv approach to Hashem to have Emunah in the fact that yesh Elohim (G-d is there), and that Elohim gives sachar (reward) to those who seek him with zerizut."},{"num":7,"verse":"By Emunah Noach, having been warned about the things not yet visible to the eye of flesh, and being an ish of yirat Shomayim, built the Teva (Ark) for the Geulah of the Beis HaNoach. By his Emunah he condemned the Olam Hazeh and he became the yoresh (heir) of the Tzedek Hashem that is credited to Emunah. [Gn 15:6; Hab 2:4]"},{"num":8,"verse":"By Emunah Avraham Avinu, when he was called to go out to a place which he was about to receive as a nachalah (inheritance), responded with mishma’at (obedience), and he went out, not having da’as of where he was going."},{"num":9,"verse":"By Emunah he made aliyah to HA’ARETZ ASHER DIBER (\"the land that He promised\" DEVARIM 9:28), Ha’aretz haHavtacha (the Promised Land), as in an eretz zarah (a strange land), living in oholim (tents), as did Yitzchak and Ya’akov, the fellow yorshim (heirs) of the same havtachah (promise);"},{"num":10,"verse":"For Avraham Avinu was looking forward to HaIr (The City) having a yesod Olam (eternally firm foundation), whose Planner and Builder is Hashem."},{"num":11,"verse":"By Emunah also Sarah, herself barren, received the ability to found a posterity, and she did so even beyond the normal age, als (since) she considered ne’eman (faithful) the One having given the Havtachah (promise);"},{"num":12,"verse":"therefore, also, from one man were born [DEVARIM 26:5] and indeed this man was kimat (practically, as good as) dead many, as numerous as HAKOKHAVIM in HASHOMAYIM and as innumerable as the sand ASHER AL SEFAT (\"that is on the seashore”). [BERESHIS 15:5; 22:17]"},{"num":13,"verse":"Yet all of these became niftarim (deceased) in Emunah, not having received the havtachot (promises), but having seen them and, as it were, they gave the havtachot a \"Baruch Habah!\" welcome from a distance, and they made the Ani Ma’amin hoda’ah (confession) that they were GERIM [\"strangers\" Ps 39:13(12)] and TOSHAVIM (\"sojourners\") in the Golus of the Olam Hazeh."},{"num":14,"verse":"For those saying such things make it clear that they are searching for an Eretz Moshav."},{"num":15,"verse":"And if they were remembering ha’aretz from which they made aliyah, they would have had an opportunity to make yerida (to descend back, return)."},{"num":16,"verse":"But, as it is, they aspire for something better, an Eretz HaAvot b’Shomayim; therefore, Hashem is not ashamed to be called \"Ehoheihem;\" for he prepared for them an Ir Kodesh."},{"num":17,"verse":"By Emunah Avraham Avinu, when he underwent nisayon, offered up the Akedas HaYitzchak; and he who had received the Havtachot (Promises) was offering as a korban his Ben Yechid. [Yn 3:16]"},{"num":18,"verse":"This was Avraham Avinu, about whom it was said KI VEYITZCHAK YIKARE LECHA ZERA (\"In Yitzchak will be called your seed\" BERESHIS 21:12)."},{"num":19,"verse":"Avraham Avinu considered that Hashem was able to bring about the Techiyas HaMesim, from which he also received back Yitzchak as a tipus (type, pattern)."},{"num":20,"verse":"By Emunah Yitzchak invoked brachot with respect to future events on Ya’akov and Esav."},{"num":21,"verse":"By Emunah Ya’akov, as he was dying, gave a bracha to each of the banim of Yosef and V’YISHTAKHU YISROEL (\"And Yisroel worshiped\" BERESHIS 47:31)."},{"num":22,"verse":"By Emunah Yosef, as he was dying, dermohn (made mention) of the Yetzi’at Bnei Yisroel (the Going Out, the Exodus of Bnei Yisroel) and he gave instructions concerning his ATZMOT (bones, BERESHIS 50:25)."},{"num":23,"verse":"By Emunah, Moshe Rabbeinu, when he was born, was hidden SHELOSHA CHODESHIM [SHEMOT 2:2) because they saw he was a yeled TOV (SHEMOT 2:2) and they had no pachad (terror) at the king’s decree."},{"num":24,"verse":"By Emunah, Moshe Rabbeinu, when he had grown, refused to be called the son of Pharaoh’s daughter;"},{"num":25,"verse":"Chosing rather to endure redifah (persecution) with the Am Hashem than to enjoy the ephemeral ta’anugot (pleasures) of averos for a season."},{"num":26,"verse":"For Moshe Rabbeinu considered abuse and tzoros for the sake of Rebbe, Melech HaMoshiach greater osher (riches) than the otzar (treasure) of Mitzrayim (Egypt), for he had respect unto the recompense of the sachar (reward)."},{"num":27,"verse":"By Emunah, Moshe Rabbeinu departed from Mitzrayim (Egypt), not having pachad (fear) of the ka’as (anger) of the king, for he persevered as seeing the One who is unseen."},{"num":28,"verse":"By Emunah, Moshe Rabbeinu kept Pesach and the sprinkling of the dahm [on the mezuzot, SHEMOT 12:22], for fear that the Destroyer of the Bechorim might destroy them."},{"num":29,"verse":"By Emunah, they went through the Yam Suf as through YABASHAH (dry ground, BERESHIS 1:10); and those of Mitzrayim (Egypt), when they attempted it, were drowned. [MICHOH 7:19]"},{"num":30,"verse":"By Emunah, the walls of Yericho fell down, after they had been encircled for shivat yamim."},{"num":31,"verse":"By Emunah, Rachav the Zonah did not perish along with the ones without mishma’at (obedience), after she gave the kabbalat panim to the spies b’shalom (YEHOSHUA 2:9)."},{"num":32,"verse":"And what more shall I say? For the time will fail me if I tell of Gid’on, Barak, Shimshon, Yiftach, Dovid, Shmuel and the Nevi’im,"},{"num":33,"verse":"Who by Emunah conquered mamlechot (kingdoms), worked tzedek (righteousness), obtained havtachot (promises), shut the mouths of arayot (lions),"},{"num":34,"verse":"Quenched the power of eish (fire), escaped from the edge of the cherev (sword), out of weakness found strength, became mighty in milchamah (war), put to flight tzive’ot zarim (armies of the aliens)."},{"num":35,"verse":"Nashim received back their mesim restored to Chayyim; and others were tortured to death al kiddush ha-Shem, not accepting their release, in order that they might obtain a better Techiyas HaMesim;"},{"num":36,"verse":"And others underwent the nisayon of cruel mockings and scourgings, also the sharsherot (chains) and the beis hasohar."},{"num":37,"verse":"They were killed by seqilah (stoning), they were sawn in two, they were murdered by the cherev, they went about in sheepskins, in goatskins, being nitzrach (needy) and destitute, oppressed, under redifot (persecutions),"},{"num":38,"verse":"those of whom the Olam Hazeh was not worthy, wandering in deserts and mountains and caves of the earth."},{"num":39,"verse":"And all these, having Hashem’s commendation through their Emunah, did not receive the havtachah (promise),"},{"num":40,"verse":"Hashem having foreseen something better for us, so that, apart from us, they should not be made shleimut."}]