[{"num":11,"verse":"If people believe God, then they know they have the things they hope to get. It is the proof of things we do not see."},{"num":2,"verse":"There were people long ago believed God. He said they were good because they believed him."},{"num":3,"verse":"We believe in God, so that is how we know that God made the world by his word. The things we see were made out of things that cannot be seen."},{"num":4,"verse":"Because Abel believed God, he made a sacrifice that pleased God more than the one Cain made. Because Abel believed God, God showed that he was good. God was pleased with his gifts. Abel died. But because he believed God, he still speaks to us through his faith."},{"num":5,"verse":"Because Enoch believed God, he was taken up into heaven without dying. The people could not find him because God had taken him. Before he was taken up, the holy writings say that he pleased God."},{"num":6,"verse":"If a person does not believe God, he cannot please him. Anyone who comes to God must believe that God is real. And he must believe that God will bless those who try to find him. God will reward a person, if he really tries to find God."},{"num":7,"verse":"God told Noah about things that would happen. These things had never happened before. Noah believed God; he respected God. He built a big house on a boat, and so his family was saved [from the big flood]. By believing God he showed that the other people were wrong. He was put right with God because he believed."},{"num":8,"verse":"God called Abraham to go away to a place which he would have as his own. Because Abraham believed God, he obeyed him. He went even though he did not know where he was to go."},{"num":9,"verse":"Because he believed God, he lived like a stranger in the land God promised him. He lived in tents with Isaac and Jacob. They had the same promise he had."},{"num":10,"verse":"Abraham was looking for a city which will last for ever. It was the city God planned and made."},{"num":11,"verse":"Sarah also believed God, and she was able to have a baby even though she was too old to have children. But she trusted God to do what he had promised."},{"num":12,"verse":"Abraham was too old to be a father, but a great nation was born from that one man. They are as many as the stars in the sky and as the sands on the seaside. No man can count them."},{"num":13,"verse":"These people all died still believing God. They did not get the things God had promised them. But they saw them far away and were glad to see them. They said they did not belong to this world, but were only travelling in it."},{"num":14,"verse":"People who say such things mean they are looking for a country which will be their own."},{"num":15,"verse":"If they had wanted the country they left behind, they could have gone back to it."},{"num":16,"verse":"But now they want a better country. They want a place in heaven. That is why God wants to be called their God. He has made a city ready for them."},{"num":17,"verse":"Abraham believed God when he was tested. The test was to give Isaac as a sacrifice. Abraham gave up his only son, even though God had made a promise to him about Isaac."},{"num":18,"verse":"God had said to Abraham, `Isaac's children will be called your family.'"},{"num":19,"verse":"Abraham said in his heart that God could bring Isaac back to life. And so it was just as if he did get his son back."},{"num":20,"verse":"Isaac believed God. He gave Jacob and Esau blessings that were to come."},{"num":21,"verse":"Jacob believed God. When he was dying, he blessed Joseph's two sons. He leaned on his walking stick as he worshipped God."},{"num":22,"verse":"Joseph believed God. When he died, he remembered God's promise and talked about the time the people of Israel would leave Egypt. He told them what to do with his bones when they left Egypt."},{"num":23,"verse":"The father and mother of Moses believed God. When he was born, they hid him for three months because they saw that he was a very nice baby. They were not afraid of the king's orders."},{"num":24,"verse":"Moses believed God. When he was grown up, he did not want to be called the son of Pharaoh's daughter."},{"num":25,"verse":"He chose to have troubles along with God's people. He thought that was better than the fun which he could have living a wrong life. The fun would last only for a short time."},{"num":26,"verse":"He thought it was better to take shame, as Christ did, than to be a rich man in Egypt. He was looking for God's blessings."},{"num":27,"verse":"He believed God and left Egypt. He was not afraid of the king's anger. He was strong because he saw the one who cannot be seen."},{"num":28,"verse":"He believed God and obeyed his law about the Passover Feast, and put blood on the door posts. He did this so that the angel who killed the oldest sons of the Egyptians, would pass over. Then he would not kill the oldest sons in the families of the Jews."},{"num":29,"verse":"The people believed God and went through the Red Sea on dry land. When the people of Egypt tried to do that, they were drowned."},{"num":30,"verse":"The people believed God and walked around the walls of the city of Jericho for seven days. The walls fell down."},{"num":31,"verse":"Rahab was a woman who used her body wrongly for sex to get money. But she believed in God, so she did not die with the people who did not believe in God. This was when the men came to spy out her country. She took them into her house in peace."},{"num":32,"verse":"What more should I say? I do not have time to tell about Gideon, Barak, Samson, Jephthah, David, Samuel, and the prophets."},{"num":33,"verse":"Men believed God and were able to win over other nations. They made people do what was right. They got what God promised them. They were not eaten by lions."},{"num":34,"verse":"The big, hot fire did not burn them. They got away from men who wanted to kill them with long knives or swords. They were weak, but they became strong. They became very strong to fight. They drove away the armies of their enemies."},{"num":35,"verse":"Women had children who died and were raised to life again. Some people allowed themselves to be beaten to death. They would not go free because they wanted to rise again to a better life."},{"num":36,"verse":"Others were laughed at and beaten very hard. They were even tied with chains and put into prison."},{"num":37,"verse":"They were killed with stones. They were tested. They were cut in pieces. They were killed with swords. They walked about wearing skins of sheep and goats. They were very poor. They were treated very badly. They were punished."},{"num":38,"verse":"They were really too good to be in this world. They walked about in the desert and in the mountains, and in the holes in the hills and in the holes among the rocks on the earth."},{"num":39,"verse":"All of these people had good things said about them because they believed God. But they did not get what God had promised."},{"num":40,"verse":"God planned something better. They will be made perfect but only with us."}]