[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 12:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the roe-buck — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As common or unhallowed food. They might eat of such cattle as were appointed for sacrifices, no less than of those not so appointed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The unclean — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Because there was no holiness in such meat for which the unclean might be excluded from it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:5-32 The command to bring ALL the sacrifices to the door of the tabernacle, was now explained with reference to the promised land. As to moral service, then, as now, men might pray and worship every where, as they did in their synagogues. The place which God would choose, is said to be the place where he would put his name. It was to be his habitation, where, as King of Israel, he would be found by all who reverently sought him. Now, under the gospel, we have no temple or altar that sanctifies the gift but Christ only: and as to the places of worship, the prophets foretold that in every place the spiritual incense should be offered, Mal 1:11. Our Saviour declared, that those are accepted as true worshippers, who worship God in sincerity and truth, without regard either to this mountain or Jerusalem, Joh 4:21. And a devout Israelite might honour God, keep up communion with him, and obtain mercy from him, though he had no opportunity of bringing a sacrifice to his altar. Work for God should be done with holy joy and cheerfulness. Even children and servants must rejoice before God; the services of religion are to be a pleasure, and not a task or drudgery. It is the duty of people to be kind to their ministers, who teach them well, and set them good examples. As long as we live, we need their assistance, till we come to that world where ordinances will not be needed. Whether we eat or drink, or whatever we do, we are commanded to do all to the glory of God. And we must do all in the name of the Lord Jesus Christ, giving thanks to the Father through him. They must not even inquire into the modes and forms of idolatrous worship. What good would it do them to know those depths of Satan? And our inward satisfaction will be more and more, as we abound in love and good works, which spring from faith and the in-dwelling Spirit of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If the place ... - Rather, \"Because, or since, the place will be too far from thee.\" The permission given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is repeated, and the reason of it assigned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22-28. Even as the roebuck and the hart is eaten, so shalt thou eat them, &c.—Game when procured in the wilderness had not been required to be brought to the door of the tabernacle. The people were now to be as free in the killing of domestic cattle as of wild animals. The permission to hunt and use venison for food was doubtless a great boon to the Israelites, not only in the wilderness, but on their settlement in Canaan, as the mountainous ranges of Lebanon, Carmel, and Gilead, on which deer abounded in vast numbers, would thus furnish them with a plentiful and luxuriant repast.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the roebuck and the hart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as common or unhallowed food, though they be of the same kind with the sacrifices which are offered to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The unclean and the clean shall eat of them alike, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because there was no holiness in such meat for which the unclean might be excluded from it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Even as the roebuck and the hart is eaten,.... Which were not only clean creatures, as before observed, but were commonly and frequently eaten, there being plenty of them in those parts: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so thou shalt eat them; their oxen and calves, their sheep and lambs, their goats and their kids: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the unclean and the clean shall eat of them alike; no difference being to be made on that account, with respect to common food; See Gill on Deuteronomy 12:15 which all alike might partake of, notwithstanding any ceremonial uncleanness that any might be attended with. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the unclean and the clean shall eat of them alike; no difference being to be made on that account, with respect to common food; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which all alike might partake of, notwithstanding any ceremonial uncleanness that any might be attended with. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Even as the roebuck and the hart is eaten, so thou shalt eat them: the unclean and the clean shall eat of them alike.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Only the flesh that was slaughtered was to be eaten as the hart and the roebuck (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., was not to be made into a sacrifice. יחדּו, together, i.e., the one just the same as the other, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without the clean necessarily eating along with the unclean. ",
        "children": []
      }
    ]
  }
]