[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye shall not do after all the things that we do here this day.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Another precept strongly marked with the condition of Israel in the wilderness. It has been too much overlooked by recent commentators that the law of Moses has a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prophetic side. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was given to him and to Israel at a time when they were not in a position to keep it. It was the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "law of the land ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which God would give them. In many ways its observance depended on the completion of the conquest of the land, and upon the quietness of the times in which they lived. This prophetic aspect was certainly not unrecognised by the Jews, or they would not (for example) have neglected to dwell in booths at the Feast of Tabernacles from the time of Joshua to Nehemiah. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "note",
        "text": "[2][2] And compare the curious position of the Jaw in Leviticus which required them to dwell in booths. It occurs as an appendix outside the regular laws of that festival (Leviticus 23:37-43).Benson CommentaryDeuteronomy 12:8. That we do here — Where the inconvenience of the place, and the uncertainty of their abode, would not permit exact order in sacrifices, and feasts, and ceremonies, which therefore God was then pleased to dispense with; but, saith he, he will not do so there. Right in his own eyes — Not that universal liberty was given to all persons to worship how they listed: but in many things their unsettled condition gave opportunity to do so.Matthew Henry's Concise Commentary12:5-32 The command to bring ALL the sacrifices to the door of the tabernacle, was now explained with reference to the promised land. As to moral service, then, as now, men might pray and worship every where, as they did in their synagogues. The place which God would choose, is said to be the place where he would put his name. It was to be his habitation, where, as King of Israel, he would be found by all who reverently sought him. Now, under the gospel, we have no temple or altar that sanctifies the gift but Christ only: and as to the places of worship, the prophets foretold that in every place the spiritual incense should be offered, Mal 1:11. Our Saviour declared, that those are accepted as true worshippers, who worship God in sincerity and truth, without regard either to this mountain or Jerusalem, Joh 4:21. And a devout Israelite might honour God, keep up communion with him, and obtain mercy from him, though he had no opportunity of bringing a sacrifice to his altar. Work for God should be done with holy joy and cheerfulness. Even children and servants must rejoice before God; the services of religion are to be a pleasure, and not a task or drudgery. It is the duty of people to be kind to their ministers, who teach them well, and set them good examples. As long as we live, we need their assistance, till we come to that world where ordinances will not be needed. Whether we eat or drink, or whatever we do, we are commanded to do all to the glory of God. And we must do all in the name of the Lord Jesus Christ, giving thanks to the Father through him. They must not even inquire into the modes and forms of idolatrous worship. What good would it do them to know those depths of Satan? And our inward satisfaction will be more and more, as we abound in love and good works, which spring from faith and the in-dwelling Spirit of Christ.Barnes' Notes on the BibleMoses points out that heretofore they had not observed the prescribed order in their worship, because during their migratory life in the wilderness it had been impossible to do so. During their wanderings there were doubtless times when the tabernacle was not set up for days together, and when the daily sacrifice Numbers 28:3, together with many other ordinances, were necessarily omitted (compare Joshua 5:5). This consideration must be carefully borne in mind throughout Deuteronomy. It illustrates the necessity for a repetition of very much of the Sinaitic legislation, and suggests the reason why some parts are so urgently reiterated and impressed, while others are left unnoticed. Moses now warns the people that as they were about to quit their unsettled mode of life, God's purpose of choosing for Himself a place to set His Name there would be executed, and the whole of the sacred ritual would consequently become obligatory. The \"rest and safety\" of Canaan is significantly laid down Deuteronomy 12:10-11 as the indispensable condition and basis for an entire fulfillment of the Law: the perfection of righteousness coinciding thus with the cessation of wanderings, dangers, and toils. Jamieson-Fausset-Brown Bible Commentary7. there ye shall eat before the Lord—of the things mentioned (De 12:6); but of course, none of the parts assigned to the priests before the Lord—in the place where the sanctuary should be established, and in those parts of the Holy City which the people were at liberty to frequent and inhabit.Matthew Poole's Commentary Here;  where the inconveniency of the place, and the uncertainty of our abode in and removal from several places, would not permit exact order in sacrifices, and feasts, and ceremonies, which therefore God was pleased then to dispense with; but, saith he, he will not do so there. Every man whatsoever is right in his own eyes;  not that universal liberty was given to all persons to worship whom and how they listed, but that in many things their unsettled condition gave every one opportunity to do so if he thought good. Gill's Exposition of the Entire BibleYe shall not do after all the things that we do here,.... In the wilderness, where they had no abiding, but were continually removing from place to place, and could not always observe punctually and precisely the exact order and time of their sacrifices and other things, nor offer them at any certain place, and many were doubtless neglected by them; see Amos 5:25. every man whatsoever is right in his own eyes; that did he, brought the above things when and where he pleased; not that there was no regard had to the laws and rules given, as if there was no priest in Israel; but they were not so exactly in all circumstances conformed to as they would be obliged to when they came into the land of Canaan, and had a certain place to bring their offerings to; so some in Aben Ezra observe, that one would give the firstling, another not, because it depended on the land, or was what they were obliged to only when they came into the land of Canaan; see Exodus 13:11 but he thinks the sense is, that they did not all fear God, and so did not do their duty. Geneva Study BibleYe shall not do after all the things that we do {f} here this day, every man whatsoever is right in his own eyes.(f) Not that they sacrificed after their fantasies, but that God would be served more purely in the land of Canaan.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "[2]",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "[2] And compare the curious position of the Jaw in Leviticus which required them to dwell in booths. It occurs as an appendix outside the regular laws of that festival (Leviticus 23:37-43).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "That we do here — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Where the inconvenience of the place, and the uncertainty of their abode, would not permit exact order in sacrifices, and feasts, and ceremonies, which therefore God was then pleased to dispense with; but, saith he, he will not do so there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Right in his own eyes — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Not that universal liberty was given to all persons to worship how they listed: but in many things their unsettled condition gave opportunity to do so.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "12:5-32 The command to bring ALL the sacrifices to the door of the tabernacle, was now explained with reference to the promised land. As to moral service, then, as now, men might pray and worship every where, as they did in their synagogues. The place which God would choose, is said to be the place where he would put his name. It was to be his habitation, where, as King of Israel, he would be found by all who reverently sought him. Now, under the gospel, we have no temple or altar that sanctifies the gift but Christ only: and as to the places of worship, the prophets foretold that in every place the spiritual incense should be offered, Mal 1:11. Our Saviour declared, that those are accepted as true worshippers, who worship God in sincerity and truth, without regard either to this mountain or Jerusalem, Joh 4:21. And a devout Israelite might honour God, keep up communion with him, and obtain mercy from him, though he had no opportunity of bringing a sacrifice to his altar. Work for God should be done with holy joy and cheerfulness. Even children and servants must rejoice before God; the services of religion are to be a pleasure, and not a task or drudgery. It is the duty of people to be kind to their ministers, who teach them well, and set them good examples. As long as we live, we need their assistance, till we come to that world where ordinances will not be needed. Whether we eat or drink, or whatever we do, we are commanded to do all to the glory of God. And we must do all in the name of the Lord Jesus Christ, giving thanks to the Father through him. They must not even inquire into the modes and forms of idolatrous worship. What good would it do them to know those depths of Satan? And our inward satisfaction will be more and more, as we abound in love and good works, which spring from faith and the in-dwelling Spirit of Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Moses points out that heretofore they had not observed the prescribed order in their worship, because during their migratory life in the wilderness it had been impossible to do so. During their wanderings there were doubtless times when the tabernacle was not set up for days together, and when the daily sacrifice ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", together with many other ordinances, were necessarily omitted (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This consideration must be carefully borne in mind throughout Deuteronomy. It illustrates the necessity for a repetition of very much of the Sinaitic legislation, and suggests the reason why some parts are so urgently reiterated and impressed, while others are left unnoticed. Moses now warns the people that as they were about to quit their unsettled mode of life, God's purpose of choosing for Himself a place to set His Name there would be executed, and the whole of the sacred ritual would consequently become obligatory. The \"rest and safety\" of Canaan is significantly laid down ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the indispensable condition and basis for an entire fulfillment of the Law: the perfection of righteousness coinciding thus with the cessation of wanderings, dangers, and toils. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "7. there ye shall eat before the Lord—of the things mentioned (De 12:6); but of course, none of the parts assigned to the priests before the Lord—in the place where the sanctuary should be established, and in those parts of the Holy City which the people were at liberty to frequent and inhabit.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Here; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " where the inconveniency of the place, and the uncertainty of our abode in and removal from several places, would not permit exact order in sacrifices, and feasts, and ceremonies, which therefore God was pleased then to dispense with; but, saith he, he will not do so there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Every man whatsoever is right in his own eyes; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not that universal liberty was given to all persons to worship whom and how they listed, but that in many things their unsettled condition gave every one opportunity to do so if he thought good. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Ye shall not do after all the things that we do here,.... In the wilderness, where they had no abiding, but were continually removing from place to place, and could not always observe punctually and precisely the exact order and time of their sacrifices and other things, nor offer them at any certain place, and many were doubtless neglected by them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "every man whatsoever is right in his own eyes; that did he, brought the above things when and where he pleased; not that there was no regard had to the laws and rules given, as if there was no priest in Israel; but they were not so exactly in all circumstances conformed to as they would be obliged to when they came into the land of Canaan, and had a certain place to bring their offerings to; so some in Aben Ezra observe, that one would give the firstling, another not, because it depended on the land, or was what they were obliged to only when they came into the land of Canaan; see Exodus 13:11 but he thinks the sense is, that they did not all fear God, and so did not do their duty. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Ye shall not do after all the things that we do {f} here this day, every man whatsoever is right in his own eyes.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(f) Not that they sacrificed after their fantasies, but that God would be served more purely in the land of Canaan.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8–12. Second Statement of the Law of the Single Sanctuary",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "With a different preface from the first, contrasting Israel’s duty after settlement to concentrate on the one altar, not with the practice of the Canaanites, but with that of Israel itself in the time of the wanderings: for the rest substantially the same as the first statement, and like it in the Pl. address, with one doubtful transition to Sg.: see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:8",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye shall not do after all the things that we do here this day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] That is in the time of Moses the speaker, and in Moab; but with reference (as the following ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vv",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". indicate) to the ritual practice of Israel during the whole forty years preceding their settlement. There may, however, be also here a reflection of the religious practice of the writer’s own time (Oettli).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every man whatsoever is right in his own eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So with regard to the multiplication of local shrines after the settlement in Canaan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But if Israel and even Moses—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "!—worshipped, where every man thought good, what are we to make of P’s account of the institution of the Tabernacle at Sinai, and of its use during the rest of the forty years and of P’s rigorous and exact laws (e.g. Leviticus 17) concerning the ritual? Obviously P either did not exist when D’s law of the one altar was written, or was unknown to its author. Amos agrees with D. His challenge to Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "did ye bring unto Me sacrifices and offerings in the wilderness forty years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? expects a negative answer in support of his polemic against all sacrifice. Jeremiah’s report of a word of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I spake not unto your fathers in the day that I brought them out of the land of Egypt concerning burnt offerings or sacrifices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is also indicative of the non-existence of P in the 7th century; and though it continues to give expression to the essential contents of the deuteronomic covenant in deuteronomic language it is difficult to reconcile it with such a law as is now before us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:9",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ye are not as yet come to the rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] The present irregular form of Israel’s worship is excused by their unsettled, wandering condition. It was then inevitable, but if so what becomes of P’s central sanctuary in the wilderness and his rigorous laws for the ritual? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (deuteronomic); there the erection of the Temple marks the close of Israel’s struggles for possession of the land: cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the inheritance which the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "your",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "is about to give you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But probably ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be read with Sam. and some LXX codd. (most read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our God giveth you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). At the same time ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inheritance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is elsewhere used with passages in the Sg. address: if the Sg. be retained here the clause must be a later insertion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:10",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when ye go over Jordan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The usual phrase with the Pl., see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is Sg.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "causeth you to inherit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "giveth you rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:11",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " f. where the expressions are the same or similar; only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cause his name to dwell there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "put his name there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",); ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "am about to command you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "firstlings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "freewill offerings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are omitted; and for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "choice vows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all the choice of your vows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—ambiguous, and either only the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "choicest of the things you have vowed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in which case the form of the law is a modification of the other, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the choice things, your vows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". More probable is the former. Of the contrary opinion is Bertholet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:12",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Deuteronomy 12:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " : ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " found there is here omitted; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your households",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is defined as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sons, daughters, bondmen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bondmaids",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Levite within your gates",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (+ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stranger, fatherless, widow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stranger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Levite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "household",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Levite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou, Levite and stranger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Wives are not mentioned, for they are included in those to whom the law is addressed; a significant fact. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Levite within your gates",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the only instance of the phrase with the Pl. address, see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 12:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the family or local minister of the ritual, who is deprived of the means of subsistence by the disestablishment of the rural shrines, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and hath no portion nor inheritance with you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", no land of his own: see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and further under ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 8-10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - In the wilderness, while leading a nomadic life, no certain place could be appointed to them for the observance of sacred rites; each man did in that matter as suited his own convenience. But after they were settled in Canaan it should no longer be so; a certain order and fixed locality should be determined for their worship and service; when they had passed over Jordan the Lord would give them rest from all their enemies, and then all irregularity and arbitrariness in the matter of worship must cease, and all their gifts arid offerings must be brought to the place which Jehovah their God should choose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye dwell in safety",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dwell securely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not only safe from assault, but without fear or anxiety (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Deuteronomy 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thither they were to take all their sacrificial gifts, and there they were to celebrate their sacrificial meals. The gifts are classified in four pairs: (1) the sacrifices intended for the altar, burnt-offerings and slain-offerings being particularly mentioned as the two principal kinds, with which, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., meat-offerings and drink-offerings were to be associated; (2) \"your tithes and every heave-offering of your hand.\" By the tithes we are to understand the tithes of field-produce and cattle, commanded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 27:30-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:21-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which were to be brought to the sanctuary because they were to be offered to the Lord, as was the case under Hezekiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 31:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That the tithes mentioned here should be restricted to vegetable tithes (of corn, new wine, and oil), is neither allowed by the general character of the expression, nor required by the context. For instance, although, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a portion of the vegetable tithe was to be applied to the sacrificial meals, there is no ground whatever for supposing that all the sacrifices and consecrated gifts mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were offerings of this kind, and either served as sacrificial meals, or had such meals connected with them. Burnt-offerings, for example, were not associated in any way with the sacrificial meals. The difficulty, or as some suppose \"the impossibility,\" of delivering all the tithes from every part of the land at the place of the sanctuary, does not warrant us in departing from the simple meaning of Moses' words in the verse before us. The arrangement permitted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with reference to the so-called second tithe, - viz., that if the sanctuary was too far off, the tithe might be sold at home, and whatever was required for the sacrificial meals might be bought at the place of the sanctuary with the money so obtained, - might possibly have been also adopted in the case of the other tithe. At all events, the fact that no reference is made to such cases as these does not warrant us in assuming the opposite. As the institution of tithes generally did not originate with the law of Moses, but is presupposed as a traditional and well-known custom, - all that is done being to define them more precisely, and regulate the way in which they should be applied, - Moses does not enter here into any details as to the course to be adopted in delivering them, but merely lays down the law that all the gifts intended for the Lord were to be brought to Him at His sanctuary, and connects with this the further injunction that the Israelites were to rejoice there before the Lord, that is to say, were to celebrate their sacrificial meals at the place of His presence which He had chosen. - The gifts, from which the sacrificial meals were prepared, are not particularized here, but are supposed to be already known either form the earlier laws or from tradition. From the earlier laws we learn that the whole of the flesh of the burnt-offerings was to be consumed upon the altar, but that the flesh of the slain-offerings, except in the case of the peace-offerings, was to be applied to the sacrificial meals, with the exception of the fat pieces, and the wave-breast and heave-shoulder. With regard to the tithes, it is stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:21-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that Jehovah had given them to the Levites as their inheritance, and that they were to give the tenth part of them to the priests. In the laws contained in the earlier books, nothing is said about the appropriation of any portion of the tithes to sacrificial meals. Yet in Deuteronomy this is simply assumed as a customary thing, and not introduced as a new commandment, when the law is laid down (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), that they were not to eat the tithe of corn, new wine, and oil within their gates (in the towns of the land), any more than the first-born of oxen and sheep, but only at the place of the sanctuary chosen by the Lord; and that if the distance was too great for the whole to be transported thither, they were to sell the tithes and firstlings at home, and then purchase at the sanctuary whatever might be required for the sacrificial meals. From these instructions it is very apparent that sacrificial meals were associated with the delivery of the tithes and firstlings to the Lord, to which a tenth part of the corn, must, and oil was applied, as well as the flesh of the first-born of edible cattle. This tenth formed the so-called second tithe (δευτέραν δεκάτην, Tob. 1:7), which is mentioned here for the first time, but not introduced as a new rule or an appendix to the former laws. It is rather taken for granted as a custom founded upon tradition, and brought into harmony with the law relating to the oneness of the sanctuary and worship.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The arguments employed by De Wette and Vater against this arrangement with regard to the vegetable tithe, which is established beyond all question by the custom of the Jews themselves, have been so fully met by Hengstenberg (Dissertations, ii. 334ff.), that Riehm has nothing to adduce in reply, except the assertion that in Deuteronomy 18, where the revenues of the priests and Levites are given, there is nothing said about the tithe, and the tithe of the tithe, and also that the people would have been overburdened by a second tithe. But, apart from the fact that argumenta e silentio generally do not prove much, the first assertion rests upon the erroneous assumption that in Deuteronomy 18 all the revenues of the priests are given separately; whereas Moses confines himself to this general summary of the revenues of the priests and Levites enumerated singly in Numbers 18, \"The firings of Jehovah shall be the inheritance of the tribe of Levi, these they shall eat,\" and then urges upon the people in Numbers 18:3-5 an addition to the revenues already established. The second objection is refuted by history. For if in later times, when the people of Israel had to pay very considerable taxes to the foreign kings under whose rule they were living, they could give a second tenth of the fruits of the ground in addition to the priests' tithe, as we may see from Tobit 1:7, such a tax could not have been too grievous a burden for the nation in the time of its independence; to say nothing of the fact that this second tenth belonged in great part to the donors themselves, since it was consumed in sacrificial meals, to which only poor and needy persons were invited, and therefore could not be regarded as an actual tax.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The arguments employed by De Wette and Vater against this arrangement with regard to the vegetable tithe, which is established beyond all question by the custom of the Jews themselves, have been so fully met by Hengstenberg (Dissertations, ii. 334ff.), that Riehm has nothing to adduce in reply, except the assertion that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the revenues of the priests and Levites are given, there is nothing said about the tithe, and the tithe of the tithe, and also that the people would have been overburdened by a second tithe. But, apart from the fact that argumenta e silentio generally do not prove much, the first assertion rests upon the erroneous assumption that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all the revenues of the priests are given separately; whereas Moses confines himself to this general summary of the revenues of the priests and Levites enumerated singly in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"The firings of Jehovah shall be the inheritance of the tribe of Levi, these they shall eat,\" and then urges upon the people in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an addition to the revenues already established. The second objection is refuted by history. For if in later times, when the people of Israel had to pay very considerable taxes to the foreign kings under whose rule they were living, they could give a second tenth of the fruits of the ground in addition to the priests' tithe, as we may see from Tobit 1:7, such a tax could not have been too grievous a burden for the nation in the time of its independence; to say nothing of the fact that this second tenth belonged in great part to the donors themselves, since it was consumed in sacrificial meals, to which only poor and needy persons were invited, and therefore could not be regarded as an actual tax.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The heave-offerings of your hand,\" which are mentioned again in Malachi 3:8 along with the tithes, are not to be restricted to the first-fruits, as we may see from Ezekiel 20:40, where the terumoth are mentioned along with the first-fruits. We should rather understand them as being free gifts of love, which were consecrated to the Lord in addition to the legal first-fruits and tithes without being actual sacrifices, and which were then applied to sacrificial meals. - The other gifts were (3) נדרים and נדבות, sacrifices which were offered partly in consequence of vows and partly of their own free will (see at Leviticus 23:38, compared with Leviticus 7:16; Leviticus 22:21, and Numbers 15:3; Numbers 29:39); and lastly (4), \"firstlings of your herds and of your flocks,\" viz., those commanded in Exodus 13:2, Exodus 13:12., and Numbers 18:15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"The heave-offerings of your hand,\" which are mentioned again in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " along with the tithes, are not to be restricted to the first-fruits, as we may see from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the terumoth are mentioned along with the first-fruits. We should rather understand them as being free gifts of love, which were consecrated to the Lord in addition to the legal first-fruits and tithes without being actual sacrifices, and which were then applied to sacrificial meals. - The other gifts were (3) נדרים and נדבות, sacrifices which were offered partly in consequence of vows and partly of their own free will (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 29:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and lastly (4), \"firstlings of your herds and of your flocks,\" viz., those commanded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "According to Exodus 13:15, the Israelites were to sacrifice the firstlings to the Lord; and according to Numbers 13:8. they belonged to the holy gifts, which the Lord assigned to the priests for their maintenance, with the more precise instructions in Deuteronomy 12:17, Deuteronomy 12:18, that the first-born of oxen, sheep, and goats were not to be redeemed, but being holy were to be burned upon the altar in the same manner as the shelamim, and that the flesh was to belong to the priests, like the wave-breast and right leg of the shelamim. These last words, it is true, are not to be understood as signifying that the only portions of the flesh of the firstlings which were to be given to the priest were the wave-breast and heave-leg, and that the remainder of the flesh was to be left to the offerer to be applied to a sacrificial meal (Hengstenberg); but they state most unequivocally that the priest was to apply the flesh to a sacrificial meal, like the wave-breast and heave-leg of all the peace-offerings, which the priest was not even allowed to consume with his own family at home, like ordinary flesh, but to which the instructions given for all the sacrificial meals were applicable, namely, that \"whoever was clean in the priest's family\" might eat of it (Numbers 18:11), and that the flesh was to be eaten on the day when the sacrifice was offered (Leviticus 7:15), or at the latest on the following morning, as in the case of the votive offering (Leviticus 7:16), and that whatever was left was to be burnt. These instructions concerning the flesh of the firstlings to be offered to the Lord no more prohibit the priest from allowing the persons who presented the firstlings to take part in the sacrificial meals, or handing over to them some portion of the flesh which belonged to himself to hold a sacrificial meal, than any other law does; on the contrary, the duty of doing this was made very plain by the fact that the presentation of firstlings is described as ליהוה זבח in Exodus 13:15, in the very first of the general instructions for their sanctification, since even in the patriarchal times the זבח was always connected with a sacrificial meal in which the offerer participated. Consequently it cannot be shown that there is any contradiction between Deuteronomy and the earlier laws with regard to the appropriation of the first-born. The command to bring the firstlings of the sacrificial animal, like all the rest of the sacrifices, to the place of His sanctuary which the Lord would choose, and to hold sacrificial meals there with the tithes of corn, new wine, and oil, and also with the firstlings of the flocks, and herds, is given not merely to the laity of Israel, but to the whole of the people, including the priests and Levites, without the distinction between the tribe of Levi and the other tribes, established in the earlier laws, being even altered, much less abrogated. The Israelites were to bring all their sacrificial gifts to the place of the sanctuary to be chosen by the Lord, and there, not in all their towns, they were to eat their votive and free-will offerings in sacrificial meals. This, and only this, is what Moses commands the people both here in Deuteronomy 12:7 and Deuteronomy 12:17, Deuteronomy 12:18, and also in Deuteronomy 14:22. and Deuteronomy 15:19.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Israelites were to sacrifice the firstlings to the Lord; and according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". they belonged to the holy gifts, which the Lord assigned to the priests for their maintenance, with the more precise instructions in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that the first-born of oxen, sheep, and goats were not to be redeemed, but being holy were to be burned upon the altar in the same manner as the shelamim, and that the flesh was to belong to the priests, like the wave-breast and right leg of the shelamim. These last words, it is true, are not to be understood as signifying that the only portions of the flesh of the firstlings which were to be given to the priest were the wave-breast and heave-leg, and that the remainder of the flesh was to be left to the offerer to be applied to a sacrificial meal (Hengstenberg); but they state most unequivocally that the priest was to apply the flesh to a sacrificial meal, like the wave-breast and heave-leg of all the peace-offerings, which the priest was not even allowed to consume with his own family at home, like ordinary flesh, but to which the instructions given for all the sacrificial meals were applicable, namely, that \"whoever was clean in the priest's family\" might eat of it (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that the flesh was to be eaten on the day when the sacrifice was offered (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or at the latest on the following morning, as in the case of the votive offering (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that whatever was left was to be burnt. These instructions concerning the flesh of the firstlings to be offered to the Lord no more prohibit the priest from allowing the persons who presented the firstlings to take part in the sacrificial meals, or handing over to them some portion of the flesh which belonged to himself to hold a sacrificial meal, than any other law does; on the contrary, the duty of doing this was made very plain by the fact that the presentation of firstlings is described as ליהוה זבח in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the very first of the general instructions for their sanctification, since even in the patriarchal times the זבח was always connected with a sacrificial meal in which the offerer participated. Consequently it cannot be shown that there is any contradiction between Deuteronomy and the earlier laws with regard to the appropriation of the first-born. The command to bring the firstlings of the sacrificial animal, like all the rest of the sacrifices, to the place of His sanctuary which the Lord would choose, and to hold sacrificial meals there with the tithes of corn, new wine, and oil, and also with the firstlings of the flocks, and herds, is given not merely to the laity of Israel, but to the whole of the people, including the priests and Levites, without the distinction between the tribe of Levi and the other tribes, established in the earlier laws, being even altered, much less abrogated. The Israelites were to bring all their sacrificial gifts to the place of the sanctuary to be chosen by the Lord, and there, not in all their towns, they were to eat their votive and free-will offerings in sacrificial meals. This, and only this, is what Moses commands the people both here in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 14:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: If, therefore, the supposed discrepancies between the law of Deuteronomy and that of Exodus and Leviticus concerning the tithes and firstlings vanish into mere appearance when the passages in Deuteronomy are correctly explained, the conclusions to which Riehm comes (pp. 43ff.), - viz., that in Deuteronomy the tithes and firstlings are no longer the property of the priests and Levites, and that all the laws concerning the redemption and sale of them are abrogated there-are groundless assertions, founded upon the unproved and unfounded assumption, that Deuteronomy was intended to contain a repetition of the whole of the earlier law.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Rejoice in all that your hand has acquired.\" The phrase יד משׁלח (cf. Deuteronomy 12:18; Deuteronomy 15:10; Deuteronomy 23:21; Deuteronomy 28:8, Deuteronomy 28:20) signifies that to which the hand is stretched out, that which a man undertakes (synonymous with מעשׂה), and also what a man acquires by his activity: hence Isaiah 11:14, יד משׁלוח, what a man appropriates to himself with his hand, or takes possession of. אשׁר before בּרכך is dependent upon ידכם משׁלה, and בּרך is construed with a double accusative, as in Genesis 49:25. The reason for these instructions is given in Deuteronomy 12:8, Deuteronomy 12:9, namely, that this had not hitherto taken place, but that up to this day every one had done what he thought right, because they had not yet come to the rest and to the inheritance which the Lord was about to give them. The phrase, \"whatsoever is right in his own eyes,\" is applied to actions performed according to a man's own judgment, rather than according to the standard of objective right and the law of God (cf. Judges 17:6; Judges 21:25). The reference is probably not so much to open idolatry, which was actually practised, according to Leviticus 17:7; Numbers 25:1; Ezekiel 20:16-17; Amos 5:25-26, as to acts of illegality, for which some excuse might be found in the circumstances in which they were placed when wandering through the desert, - such, for example, as the omission of the daily sacrifice when the tabernacle was not set up, and others of a similar kind.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Rejoice in all that your hand has acquired.\" The phrase יד משׁלח (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 15:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") signifies that to which the hand is stretched out, that which a man undertakes (synonymous with מעשׂה), and also what a man acquires by his activity: hence ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", יד משׁלוח, what a man appropriates to himself with his hand, or takes possession of. אשׁר before בּרכך is dependent upon ידכם משׁלה, and בּרך is construed with a double accusative, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The reason for these instructions is given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", namely, that this had not hitherto taken place, but that up to this day every one had done what he thought right, because they had not yet come to the rest and to the inheritance which the Lord was about to give them. The phrase, \"whatsoever is right in his own eyes,\" is applied to actions performed according to a man's own judgment, rather than according to the standard of objective right and the law of God (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The reference is probably not so much to open idolatry, which was actually practised, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 25:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:25-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as to acts of illegality, for which some excuse might be found in the circumstances in which they were placed when wandering through the desert, - such, for example, as the omission of the daily sacrifice when the tabernacle was not set up, and others of a similar kind.",
            "children": []
          }
        ]
      }
    ]
  }
]