[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 145:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord is righteous in all his ways ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And not unrighteous in any of them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and holy in all his works — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Always acting like himself, with perfect rectitude and purity. In all his acts of government he is just, injurious to none, but administering justice to all: his ways are equal, though ours are unequal. In giving laws, in deciding controversies, in recompensing services, and punishing offences, he is incontestably righteous and holy, and we are in duty bound to acknowledge it. But the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חסיד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "generally signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "merciful, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and, it seems, ought to have been so translated here. There is a mixture of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the most severe and terrible works and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dispensations ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of God toward men in this life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judgment without mercy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "being reserved for the next life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "145:10-21 All God's works show forth his praises. He satisfies the desire of every living thing, except the unreasonable children of men, who are satisfied with nothing. He does good to all the children of men; his own people in a special manner. Many children of God, who have been ready to fall into sin, to fall into despair, have tasted his goodness in preventing their falls, or recovering them speedily by his graces and comforts. And with respect to all that are heavy laden under the burden of sin, if they come to Christ by faith, he will ease them, he will raise them. He is very ready to hear and answer the prayers of his people. He is present every where; but in a special way he is nigh to them, as he is not to others. He is in their hearts, and dwells there by faith, and they dwell in him. He is nigh to those that call upon him, to help them in all times of need. He will be nigh to them, that they may have what they ask, and find what they seek, if they call upon him in truth and sincerity. And having taught men to love his name and holy ways, he will save them from the destruction of the wicked. May we then love his name, and walk in his ways, while we desire that all flesh should bless his holy name for ever and ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord is righteous in all his ways - In his own character; in his laws; in his providential dealings; in his arrangements for the redemption and salvation of man. In his own character he is what it is desirable that a God should be; in all his laws he ordains that only which it is desirable should be enacted; in all his dealings with people he does that which it is desirable should be done. He violates no right; he wrongs no one; he demands of no one a service which would be unjust; he makes no arrangements for pardon and salvation which it is not best should be made. It is much for a man to be able to say in all that occurs to him under the divine administration, \"It is right;\" it is much for a man to have such confidence in God as to be able to feel that all he does in respect to nations is the best thing that could be done. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 97:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And holy in all his works - Margin, merciful, or bountiful. The Hebrew word is merciful. The idea seems to be that righteousness and mercy are equally consulted in his arrangements; that they meet together, and act harmomoniously in the divine plans. Compare the notes at Psalm 85:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And holy in all his works - Margin, merciful, or bountiful. The Hebrew word is merciful. The idea seems to be that righteousness and mercy are equally consulted in his arrangements; that they meet together, and act harmomoniously in the divine plans. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 85:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. holy … works—literally, \"merciful\" or \"kind, goodness\" (Ps 144:2) is the corresponding noun.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "righteous—in a similar relation of meaning to \"righteousness\" (Ps 145:7).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "righteous—in a similar relation of meaning to \"righteousness\" (Ps 145:7).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17 The Lord is righteous in all his ways, and holy in all his works.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 The Lord is nigh unto all them that call upon him, to all that call upon him in truth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19 He will fulfil the desire of them that fear him, he also will hear their cry, and will save them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20 The Lord preserveth all them that love him, but all the wicked will he destroy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21 My mouth shall speak the praise of the Lord, and let all flesh bless his holy name for ever and ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In these verses we behold our God in the realm of his free grace dealing well with his believing people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 145:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord is righteous in all his ways, and holy in all his works.\" His ways and works are both worthy to be praised. Jehovah cannot be unjust or impure. Let his doings be what they may, they are in every case righteous and holy. This is the confession of the godly who follow his ways, and of the gracious who study his works. Whatever God is or does must be right. In the salvation of his people he is as righteous and holy as in any other of his ways and works: he has not manifested mercy at the expense of justice, but the rather he has magnified his righteousness by the death of his Son.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 145:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:18",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord is nigh unto all them that call upon him.\" Not only near by his omnipresence, but to sympathize and favour. He does not leave praying men, and men who confess his name, to battle with the world alone, but he is ever at their side. This favour is not for a few of those who invoke him; but for each one of the pious company. \"All\" who place themselves beneath the shield of his glorious name by calling themselves by it, and by calling upon it in supplication, shall find him to be a very present help in trouble. \"To all that call upon him in truth'\" for there are many whose formal prayers and false professions will never bring them into communion with the Lord. To pray in truth, we must have a true heart, and the truth in our heart; and then we must be humble, for pride is a falsehood; and be earnest, or else prayer is a lie. A God of truth cannot be nigh to the spirit of hypocrisy; this he knows and hates; neither can he be far removed from a sincere spirit, since it is his work, and he forsakes not the work of his own hands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 145:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:19",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"He will fulfil the desire of them that fear him\" that is, those who reverence his name and his law. Inasmuch as they have respect unto his will, he will have respect unto their will. They shall have their way for they have his way in their hearts. A holy heart only desires what a holy God can give, and so its desire is filled full out of the fulness of the Lord. \"He also will hear their cry, and will save them.\" Divinely practical shall his nearness be, for he will work their deliverance. He will listen to their piteous cry, and then will send salvation from every ill. This he will do himself personally; he will not trust them to angels or saints.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 145:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:20",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord preserveth all them that love him.\" They keep him in their love, and he keeps them by his love. See how these favoured ones have advanced from fearing the Lord and crying to him, even to loving him, and in that love they are secure from all danger. Mark the number of \"alls\" in these later verses of the Psalm. In each of these God is all in all. \"But all the wicked will he destroy.\" Wickedness is an offence to all holy beings, and therefore those who are determined to continue in it must be weeded out. As good sanitary laws remove all creators of pest and plague, so does the moral government of God mark every evil thing for destruction; it cannot be tolerated in the presence of a perfectly holy God. What ruins wicked men frequently become in this life! What monuments of wrath will they be in the world to come! Like Nineveh and Babylon, and other destroyed places, they shall only exist to declare how thoroughly God fulfils his threatenings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or rather, merciful, as this word most commonly signifies. There is a mixture of mercy in the most severe and terrible works of God in this life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judgment without mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being reserved for the next life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jam 2:13 Revelation 14:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord is righteous in all his ways,.... Christ is righteous in all the ways of providence, in which he is jointly concerned with his Father: there are some of the ways of providence, which are now intricate and perplexed, are unsearchable and past finding out, and cannot be easily reconciled to the justice and faithfulness of God, respecting the prosperity of the wicked and the afflictions of the righteous; but these will before long be made manifest, and they will appear to be just and true. And so in all his ways of grace, in all his decrees; in the choice of some to everlasting life, and the leaving of others; with respect to either of these, there is no unrighteousness in him: nor in the redemption of men, for which an adequate price is given; and in which mercy and truth, righteousness and peace, meet together; nor in the justification of a sinner, which is not done without a righteousness, but in such manner that God is just while he is the justifier of him that believes in Jesus; nor in the pardon of sin, which is upon the foot of a satisfaction made to the justice of God, by the blood and sacrifice of Christ; nor in eternal life, the gift of God through Christ, which none inherit but righteous ones. Christ is righteous in all his suretyship engagements, which he has punctually performed, and in the execution of all his offices; in doing which, righteousness and faithfulness are the girdle of his loins and reins: and so likewise he is and will appear righteous in his judgments on his and his people's enemies, in the destruction of antichrist and his followers. And, moreover, he is righteous in all the ways he prescribes for his people to walk in, in all his commandments and ordinances; which are all holy, just, and good; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and holy in all his works; in all his works of providence; doing no evil, though he suffers it for wise ends, and overrules it for good: and in all his works of grace; in election, which is through holiness and to it; in the redemption of his people, which is from a vain conversation, and that they might be a peculiar people, zealous of good works; in the calling of them with an holy calling, and to holiness; in bringing them to glory, which is through regeneration and sanctification. It may be rendered, is \"merciful\" or \"bountiful in all his works\" (k); all he does flowing from his grace, mercy, and goodness. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) \"misericors\", Pagninus, Montanus, so Ainsworth; \"benignus\", Tigurine version, Musculus, Junius & Tremellius, Piscator, Gejerus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) \"misericors\", Pagninus, Montanus, so Ainsworth; \"benignus\", Tigurine version, Musculus, Junius & Tremellius, Piscator, Gejerus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The LORD is {k} righteous in all his ways, and holy in all his works.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The LORD ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " righteous in all his ways, and holy in all his works.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) He praises God, not only because he is beneficial to all his creatures, but also in that he justly punishes the wicked, and mercifully examines his by the cross, giving them strength and delivering them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] True to His character. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 145:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So the LXX, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅσιος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is used of God in the N.T. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "châsîd",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as applied to God (here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " only) means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full of lovingkindness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", loving. See App., Note I.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord is righteous in all his ways, and holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gracious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "merciful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in all his works",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in all his works",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mercy and truth meet in God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 85:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He is at once perfectly just, and absolutely tender and compassionate. \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "All",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his works\" experience both his justice and his tenderness (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Psalm 145:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet now celebrates in detail the deeds of the gracious King. The words with ל are pure datives, cf. the accusative expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 146:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He in person is the support which holds fast the falling ones (נופלים, here not the fallen ones, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the midst of falling (Nicephorus: τοὺς καταπεσεῖν μέλλοντας ἑδραιοῖ, ὥστε μὴ καταπεσεῖν), and the stay by which those who are bowed together raise themselves. He is the Provider for all beings, the Father of the house, to whom in the great house of the world the eyes (עיני with the second ê toneless, Ew. 100, b) of all beings, endowed with reason and irrational, are directed with calm confidence (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and who gives them their food in its, i.e., in due season. The language of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is very similar, and it proceeds here, too, as there in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Sir. 40:14). He opens His hand, which is ever full, much as a man who feeds the doves in his court does, and gives רצון, pleasure, i.e., that which is good, which is the fulfilling of their desire, in sufficient fulness to all living things (and therefore those in need of support for the body and the life). Thus it is to be interpreted, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (after which here in the lxx the reading varies between εὐδοκίας and εὐλογίας), cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ἐμπιπλών τροφῆς καὶ εὐφροσύνης τάς καρδίας ἡμῶν. השׂבּיע is construed with a dative and accusative of the object instead of with two accusatives of the object (Ges. 139. 1, 2). The usage of the language is unacquainted with רצון as an adverb in the sense of \"willingly\" (Hitzig), which would rather be ברצונך. In all the ways that Jahve takes in His historical rule He is \"righteous,\" i.e., He keeps strictly to the rule (norm) of His holy love; and in all His works which He accomplishes in the course of history He is merciful (חסיד), i.e., He practises mercy (חסד, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for during the present time of mercy the primary essence of His active manifestation is free preventing mercy, condescending love. True, He remains at a distance from the hypocrites, just as their heart remains far from Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but as for the rest, with impartial equality He is nigh (קרוב as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to all who call upon Him בּאמת, in firmness, certainty, truth, i.e., so that the prayer comes from their heart and is holy fervour (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 48:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What is meant is true and real prayer in opposition to the νεκρὸν ἔργον, as is also meant in the main in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To such true praying ones Jahve is present, viz., in mercy (for in respect of His power He is everywhere); He makes the desire of those who fear Him a reality, their will being also His; and He grants them the salvation (σωτηρία) prayed for. Those who are called in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those who fear Him, are called in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those who love Him. Fear and love of God belong inseparably together; for fear without love is an unfree, servile disposition, and love without fear, bold-faced familiarity: the one dishonours the all-gracious One, and the other the all-exalted One. But all who love and fear Him He preserves, and on the other hand exterminates all wanton sinners. Having reached the Tav, the hymn of praise, which has traversed all the elements of the language, is at an end. The poet does not, however, close without saying that praising God shall be his everlasting employment (פּי ידבּר with Olewejored, the Mahpach or rather Jethib sign of which above represents the Makkeph), and without wishing that all flesh, i.e., all men, who αρε σὰρξ καὶ αἷμα, בּשׂר ודם, may bless God's holy Name to all eternity. The realization of this wish is the final goal of history. It will then have reached ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the great song in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Jahve one and His Name one (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Israel praising God ὑπὲρ ἀληθείας, and the Gentiles ὑπὲρ ἐλέους (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). ",
        "children": []
      }
    ]
  }
]