[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Walk about Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Notice here the strong patriotic feeling of Hebrew song. The inhabitants of the city are invited to make a tour of inspection of the defences which, under God’s providence, have protected them from their foes. We are reminded of the fine passage in Shakespeare’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cymbeline, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which gratefully recalls “the natural bravery” of our own island home, or of the national songs about our “wooden walls.” Comparison has also been drawn between this passage and a similar burst of patriotic sentiment from the lips of a Grecian orator (Thuc. Ii. 53); but while the Greek thinks only of the men who made Athens strong, the Hebrew traces all back to God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(12) Tell—i.e., count. So in Milton, “Every shepherd tells his tale,” i.e., counts his sheep.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(12) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Tell",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "count. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "So in Milton, “Every shepherd ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "tells ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "his tale,” ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "counts his sheep.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 48:12-13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:12-13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Walk about Zion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He speaks probably to the people of the city and kingdom, who had been eye-witnesses of the glorious work God had wrought for their deliverance. Bishop Patrick thus paraphrases the words: “Make a solemn procession, and go round about the city, blessing and praising God, with thankful hearts, who hath preserved you from being begirt by the enemy. Tell all the towers as you go along, and see if there be so much as one wanting, or the least hurt done to any of them.” Some commentators, however, think that he speaks to the hostile kings and their armies, who had come up against Jerusalem, and had gone round her to reconnoitre her strength, in order to take her, but who were now fled away; and that he calls upon them to return, and go round her again, and see how entire her fortifications were; and bids them tell the next generation, that it would be in vain to attempt any thing against her while she had Jehovah for her protector.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "48:8-14 We have here the improvement which the people of God are to make of his glorious and gracious appearances for them. Let our faith in the word of God be hereby confirmed. Let our hope of the stability of the church be encouraged. Let our minds be filled with good thoughts of God. All the streams of mercy that flow down to us, must be traced to the fountain of His loving-kindness. Let us give to God the glory of the great things he has done for us. Let all the members of the church take comfort from what the Lord does for his church. Let us observe the beauty, strength, and safety of the church. Consider its strength; see it founded on Christ the Rock, fortified by the Divine power, guarded by Him who neither slumbers nor sleeps. See what precious ordinances are its palaces, what precious promises are its bulwarks, that you may be encouraged to join yourselves to it: and tell this to others. This God, who has now done such great things for us, is unchangeable in his love to us, and his care for us. If he is our God, he will lead and keep us even to the last. He will so guide us, as to set us above the reach of death, so that it shall not do us any real hurt. He will lead us to a life in which there shall be no more death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Walk about Zion - This is a call on all persons to go round the city; to take a survey of it; to see how beautiful and how strong it was - how it had escaped all danger, and was uninjured by the attempt to destroy it - how capable it was of resisting an attack. The word \"walk\" here means simply to go around or surround. The other word used has a more direct reference to a solemn procession.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And go round about her - The word used here - from נקף  nâqaph - to fasten together, to join together, means to move round in a circle, as if persons joined together (see the notes at Job 1:5), and would refer here properly to a solemn procession moving round the city, and taking a deliberate survey of its entire circuit.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And go round about her - The word used here - from נקף  nâqaph - to fasten together, to join together, means to move round in a circle, as if persons joined together (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and would refer here properly to a solemn procession moving round the city, and taking a deliberate survey of its entire circuit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Tell the towers thereof - That is, Take the number of the towers. See how numerous they are; how firm they remain; what a defense and protection they constitute. Cities, surrounded by walls, had always \"towers\" or elevated portions as posts of observation, or as places from which missiles might be discharged with advantage on those who should attempt to scale the walls. Compare Genesis 11:4-5; 2 Chronicles 26:9-10; Isaiah 2:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Tell the towers thereof - That is, Take the number of the towers. See how numerous they are; how firm they remain; what a defense and protection they constitute. Cities, surrounded by walls, had always \"towers\" or elevated portions as posts of observation, or as places from which missiles might be discharged with advantage on those who should attempt to scale the walls. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12-14. The call to survey Zion, or the Church, as a fortified city, is designed to suggest \"how well our God secures His fold.\" This security is perpetual, and its pledge is His guidance through this life.   ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12 Walk about Zion, and go round about her: tell the towers thereof.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13 Mark ye well her bulwarks, consider her palaces; that ye may tell it to the generation following.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14 For this God is our God for ever and ever: he will be our guide even unto death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 48:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:12",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Walk about Zion;\" often beat her bounds, even as Israel marched around Jericho. With leisurely and careful inspection survey her. \"And go round about her.\" Encircle her again and again with loving perambulations. We cannot too frequently or too deeply consider the origin, privileges, history, security, and glory of the church. Some subjects deserve but a passing thought; this is worthy of the most patient consideration. \"Tell the towers thereof.\" See if any of them have crumbled, or have been demolished. Is the church of God what she was in doctrine, in strength and in beauty? Her foes counted her towers in envy first, and then in terror, let us count them with sacred exultation. The city of Lucerne, encircled by its ancient walls, adorned with a succession of towers, is a visible illustration of this figure; and as we have gone around it, and paused at each picturesque tower, we have realised the loving, lingering inspection which the metaphor implies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 48:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:13",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Mark ye well her bulwarks.\" Consider most attentively how strong are her ramparts, how safely her inhabitants are entrenched behind successive lines of defence. The security of the people of God is not a doctrine to be kept in the background, it may be safely taught, and frequently pondered; only to base hearts will that glorious truth prove harmful; the sons of perdition make a stumbling stone even of the Lord Jesus himself, it is little wonder, that they pervert the truth of God concerning the final perseverance of the saints. We are not to turn away from inspecting Zion's ramparts, because idlers skulk behind them. \"Consider her palaces.\" Examine with care the fair dwellings of the city. Let the royal promises which afford quiet resting places for believers be attentively inspected. See how sound are the defences, and how fair are the pleasaunces of \"that ancient city,\" of which you are citizens. A man should be best acquainted with his own home; and the church is our dear and blest abode. Would to God professors were more considerate of the condition of the church; so far from telling the towers, some of them scarcely know what or where they are; they are too busy counting their money, and considering their ledgers. Freehold and copyhold, and leasehold, men measure to an inch, but heavenhold and gracehold are too often taken at peradventure, and neglected in sheer heedlessness. \"That ye may tell it to the generation following.\" An excellent reason for studious observation. We have received and we must transmit. We must be students that we may be teachers. The debt we owe to the past we must endeavour to repay by handing down the truth to the future.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 48:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:14",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For this God is our God for ever and ever.\" A good reason for preserving a record of all that he has wrought. Israel will not change her God so as to wish to forget, nor will the Lord change so as to make the past mere history. He will be the covenant God of his people world without end. There is no other God, we wish for no other, we would have no other even if other there were. There are some who are so ready to comfort the wicked, that for the sake of ending their punishment they weaken the force of language, and make \"for ever and ever,\" mean but a time; nevertheless, despite their interpretations we exult in the hope of an eternity of bliss, and to us \"everlasting,\" and \"for ever and ever\" mean what they say. \"He will be our guide even unto death.\" Throughout life, and to our dying couch, he will graciously conduct us, and even after death he will lead us to the living fountains of waters. We look to him for resurrection and eternal life. This consolation is clearly derivable from what has gone before; hitherto our foes have been scattered, and our bulwarks have defied attack, for God has been in our midst, therefore all possible assaults in the future shall be equally futile.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The church has all her foes defied",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And laughed to scorn their rage;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "E'en thus for aye she shall abide",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Secure from age to age.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Farewell, fear. Comehither, gratitute and faith, and sing right joyously. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He speaketh, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. To the enemies, as triumphing over them. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. To the people of that city and kingdom, who had been eye-witnesses of this glorious work of God, as appears from the following verses. He bids them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mark well her towers, bulwarks, and palaces",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 48:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", not with vain ostentation, or carnal confidence, for he had said that God only was their refuge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 48:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but with thankfulness to God, when they should find upon inquiry, that not one of them was demolished or any way defaced by so potent an enemy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Walk about Zion, and go round about her,.... These words are either an address to the enemies of the church, sarcastically delivered; calling upon them to come, and surround, and besiege Zion, and see what the issue and consequence of it will he, even the same as that of the kings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or to the builders of Zion, as Jarchi observes, to come and take a survey of it, and see what repairs were necessary; or rather to the saints, to the daughters of Judah before mentioned, to take a view of the strength and defence of the church, for their own comfort and encouragement, and to report the same to others for theirs also; for by walking around it may be observed the foundation, the rock and eminence on which it is built, Christ Jesus; the wall of it, the Lord himself, a wall of fire; the entrance into it, Christ the gate of righteousness; the fortress and strong hold of it the same; and the guards about it, the watch men on its walls, the ministers of the Gospel, and an innumerable company of angels, that in a circle surround both ministers and people; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "tell the towers thereof; see 2 Chronicles 26:9; the Lord himself is the tower of his people, high and strong, which secures and defends them from all their enemies, Psalm 18:2; the ministers of the Gospel, who are immovable, and are set for the defence of it, Jeremiah 6:27; the Scriptures of truth, which are like a tower built for an armoury, out of which the saints are furnished and provided with proper armour, whereby they are able to engage with false teachers, and to overcome the evil one, Sol 4:4; and the ordinances of the Gospel, the church's two breasts, said to be as towers, Sol 8:10; some render the words, \"tell in the towers\" (i); publish on the house tops, declare in the high places of the city, in the most public manner, the great things of the Gospel, which relate to the glory of Christ and his church. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "tell the towers thereof; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the Lord himself is the tower of his people, high and strong, which secures and defends them from all their enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the ministers of the Gospel, who are immovable, and are set for the defence of it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the Scriptures of truth, which are like a tower built for an armoury, out of which the saints are furnished and provided with proper armour, whereby they are able to engage with false teachers, and to overcome the evil one, Sol 4:4; and the ordinances of the Gospel, the church's two breasts, said to be as towers, Sol 8:10; some render the words, \"tell in the towers\" (i); publish on the house tops, declare in the high places of the city, in the most public manner, the great things of the Gospel, which relate to the glory of Christ and his church. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i)   , Sept. \"in turribus ejus\", V. L. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i)   , Sept. \"in turribus ejus\", V. L. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{l} Walk about Zion, and go round about her: tell the towers thereof.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Walk about Zion, and go round about her: tell the towers thereof.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) For in this outward defence and strength God's blessings also appeared, but the chief is to be referred to God's favour and secret defence, who never leaves his.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Walk about Zion, and go round about her; tell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the towers thereof.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Admire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., O Israelites, your glorious city, which God has preserved for you intact. Walk around it, view it on every side; observe its strength and beauty. Nay, count its towers, and see how many they are, that ye may form a true estimate of its defences, which render it well-nigh impregnable. Such a survey would \"tend to the glorifying of the God of Israel, and to the strengthening of their faith\" (Hengstenberg). Psalm 48:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 48:13-15) The call is addressed not to the enemies of Jerusalem - for it would be absurd to invite such to look round about upon Jerusalem with joy and gladness - but to the people of Jerusalem itself. From the time of the going forth of the army to the arrival of the news of victory, they have remained behind the walls of the city in anxious expectation. Now they are to make the circuit of the city (הקּיף, still more definite than סבב, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") outside the walls, and examine them and see that its towers are all standing, its bulwark is intact, its palaces are resplendent as formerly. לחילה, \"upon its bulwark,\"  equals  לחילהּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with softened suffix as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently; Ew. 247, d. פּסּג (according to another reading, הפסיג) signifies, in B. Baba kamma 81b, to cut through (a vineyard in a part where there is no way leading through it); the signification \"to take to pieces and examine, to contemplate piece by piece,\" has no support in the usage of the language, and the signification \"to extol\" (erhhen, Luther following Jewish tradition) rests upon a false deduction from the name פּסגּה. Louis de Dieu correctly renders it: Dividite palatia, h. e. obambulate inter palatia ejus, secando omnes palatiorum vias, quo omnia possitis commode intueri. They are to convince themselves by all possible means of the uninjured state of the Holy City, in order that they may be able to tell to posterity, that זה, such an one, such a marvellous helper as is now manifest to them, is Elohim our God. He will also in the future guide us.... Here the Psalm closes; for, although נהג is wont to be construed with עלּ in the signification ἄγειν ἐπὶ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), still \"at death\" [lit. dying], i.e., when it comes to dying (Hengstenberg), or \"even unto (על as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") death\" [lit. dying] (Hupfeld), forms no suitable close to this thoroughly national song, having reference to a people of whom the son of Sirach says (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): ζωὴ ἀνδρὸς ἐν ἀριθμῷ ἡμερῶν καὶ αἱ ἡμέραι τοῦ Ἰσραήλ ἀναρίθμητοι. The rendering of Mendelssohn, Stier, and others, \"over death\" i.e., beyond death (Syriac), would be better; more accurately: beyond dying  equals  destruction (Bunsen, Bibelwerk, Th. i. S. clxi.). but the expression does not admit of this extension, and the thought comes upon one unexpectedly and as a surprise in this Psalm belonging to the time before the Exile. The Jerusalem Talmud, Megilla, ch. ii.((fol. 73, col. b, ed. Venet.), present a choice of the following interpretations: (1) עלמוּת  equals  בּעלימוּת, in youthfulness, adopting which, but somewhat differently applied, the Targum renders, \"in the days of youth;\" (2) כעילין עלמות, like virgins, with which Luther's rendering coincides: like youth (wie die Jugent); (3) according to the reading עלמות, which the lxx also reproduces: in this and the future world, noting at the same time that Akilas (Aquila) translates the word by ἀθανασία: \"in a world where there is no death.\" But in connection with this last rendering one would rather expect to find אל־מות (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") instead of על־מות. עלמות, however, as equivalent to αἰῶνες is Mishnic, not Biblical; and a Hebrew word עלמוּת (עלימוּת) in the sense of the Aramaic עלּימתּ cannot be justified elsewhere. We see from the wavering of the MSS, some of which give על־מוּת, and others עלמוּת, and from the wavering of expositors, what little success is likely to follow any attempt to gain for על־מות, as a substantial part of the Psalm, any sense that is secure and in accordance both with the genius of the language and with the context. Probably it is a marginal note of the melody, an abbreviation for על־מוּת לבּן, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And either this note, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " למנצּח בּנגינותי, stands in an exceptional manner at the end instead of the beginning (Hitzig, Reggio), or it belongs to the למנצח of the following Psalm, and is to be inserted there (Bttcher, De inferis, 371). If, however, על־מות does not belong to the Psalm itself, then it must be assumed that the proper closing words are lost. The original close was probably more full-toned, and somewhat like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]