[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As we have heard.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The generations of a religious nation are “bound each to each by natural piety.” Probably here the ancient tale of the overthrow of Pharaoh and his host recurred to the poet’s mind.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God will establish it.—Better, God will preserve her for ever, i.e., the holy city. This forms the refrain of the song, and probably should be restored between the parts of Psalm 48:3.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "God will establish it.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "God will preserve her for ever, i.e., the holy city. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This forms the refrain of the song, and probably should be restored between the parts of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 48:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As we have heard, so have we seen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The predictions of the prophets have been verified by the events. Or, we have had late and fresh experience of such wonderful works of God, as before we only heard of by the report of our fathers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God will establish it for ever — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God will defend her in all succeeding ages. And so God would have done, if Jerusalem had not forsaken him, and forfeited his protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have thought of thy loving-kindness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— It hath been the matter of our serious and deep meditation, when we have been worshipping in thy temple. For when the priests were offering incense, or sacrifices, the religious people were wont to exercise themselves in holy meditation and secret prayer to God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we have silently, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patiently waited for thy loving- kindness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "דמינו חסדךְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dim-minu chasdecha, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "more properly signifies, and some ancient and other interpreters render it. A consideration of the wondrous works which God has wrought for us tends to produce faith in his promises, and resignation to his will: “and he,” says Dr. Horne, “that with these dispositions waits for God’s mercies, in God’s house, shall not wait in vain.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "48:8-14 We have here the improvement which the people of God are to make of his glorious and gracious appearances for them. Let our faith in the word of God be hereby confirmed. Let our hope of the stability of the church be encouraged. Let our minds be filled with good thoughts of God. All the streams of mercy that flow down to us, must be traced to the fountain of His loving-kindness. Let us give to God the glory of the great things he has done for us. Let all the members of the church take comfort from what the Lord does for his church. Let us observe the beauty, strength, and safety of the church. Consider its strength; see it founded on Christ the Rock, fortified by the Divine power, guarded by Him who neither slumbers nor sleeps. See what precious ordinances are its palaces, what precious promises are its bulwarks, that you may be encouraged to join yourselves to it: and tell this to others. This God, who has now done such great things for us, is unchangeable in his love to us, and his care for us. If he is our God, he will lead and keep us even to the last. He will so guide us, as to set us above the reach of death, so that it shall not do us any real hurt. He will lead us to a life in which there shall be no more death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As we have heard, so have we seen - That is, What has been told us, or handed down by tradition, in regard to the strength and safety of the city - what our fathers have told us respecting its sacredness and its being under the protection of God - we have found to be true. It has been shown that God is its protector; that he dwells in the midst of it; that it is safe from the assaults of man; that it is permanent and abiding. All that had ever been said of the city in this respect had been found, in this trial when the kings assembled against it, to be true.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the city of the Lord of hosts - The city where the Lord of hosts has taken up his abode, or which he has chosen for his dwelling-place on earth. See the notes at Isaiah 1:24; notes at Psalm 24:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the city of the Lord of hosts - The city where the Lord of hosts has taken up his abode, or which he has chosen for his dwelling-place on earth. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the city of our God - Of Him who has shown himself to be our God; the God of our nation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God will establish it for ever - That is, this had been told them; this is what they had heard from their fathers; this they now saw to be verified in the divine interposition in the time of danger. They had seen that these combined armies could not take the city; that God had mercifully interposed to scatter their forces; and they inferred that it could be taken by no human power, and that God intended that it should be permanent and abiding. What is here said of Jerusalem is true in a sense more strict and absolute of the Church - that nothing can prevail against it, but that it will endure to the end of the world. See the notes at Matthew 16:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God will establish it for ever - That is, this had been told them; this is what they had heard from their fathers; this they now saw to be verified in the divine interposition in the time of danger. They had seen that these combined armies could not take the city; that God had mercifully interposed to scatter their forces; and they inferred that it could be taken by no human power, and that God intended that it should be permanent and abiding. What is here said of Jerusalem is true in a sense more strict and absolute of the Church - that nothing can prevail against it, but that it will endure to the end of the world. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. This present experience assures of that perpetual care which God extends to His Church.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The predictions of the prophets, either ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 20:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 19:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 19:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., have been verified by the events. Or, we have had late and fresh experiences of such wonderful works of God, as before we only heard of by the report of our fathers. From this miraculous deliverance we plainly see that God hath a singular love to it, and care of it, and therefore will defend her in all succeeding ages against all her enemies. And so God would have done, if Jerusalem had not forsaken God, and forfeited his favour and protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As we have heard, so have we seen,.... These are the words of the people of God making their observations on the above things; and so Aben Ezra and Kimchi understand them of the people of Israel; and the former, referring them to the war of Gog and Magog, paraphrases them thus: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the Israelites shall say in that day, as we have heard the prophets, who prophesied of the fall of Gog and Magog, so have we seen in the city of the Lord of hosts.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The words may be understood, either of facts which have been reported and heard to have been done in time past, to which others will correspond, and will be seen to do to in the latter day; as, for instance, as it has been heard that God inflicted plagues upon Egypt; so it will be seen that he will pour out the vials of his wrath upon the great city, which is spiritually called Egypt and Sodom: as it has been heard that God brought his people Israel out of Egypt with a mighty hand; so it will be seen that he will deliver his people from the captivity and tyranny of the man of sin, and will call them out from Babylon a little before the destruction of it: as it has been heard that Pharaoh and his host were drowned in the Red sea; so it will be seen that Babylon shall be thrown down like a mill stone cast into the sea, and be found no more: as it has been heard that, literal Babylon is destroyed; so it will be seen that mystical Babylon will be destroyed also: and as it has been heard that the kings of the nations, at several times, have gathered themselves together against Jerusalem, without effect; so it will be seen treat the kings of the earth will assemble together against the church of Christ; but, as soon as they shall come up to her, and look upon her, they shall be astonished and flee with the utmost consternation, fear, and dread, and be utterly ruined: or else the sense is, as it has been heard, from the promises and prophecies delivered out from time to time, that God will grant his presence to his church and people, and will be the protection of them, and will destroy all his and their enemies; so it has been seen that these have been fulfilled, more or less, in all ages; in the latter day their accomplishment will be full and manifest, even ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the city of the Lord of hosts; of the hosts of heaven and earth, of all armies above and below; and therefore the church must be safe under his protection; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the city of our God: the covenant God of his people; wherefore, as the former title declares his power, this shows his love and affection, and both together secure the happiness of the saints: wherefore it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God will establish it for ever. Not only particular believers, of which the church consists, are established on the foundation, Christ; but the church itself is built on him, the Rock against which the gates of hell cannot prevail; yet as they are not always in a settled and constant condition, so neither is that, being sometimes tossed with the tempests of afflictions and persecutions, and sometimes in one place, and sometimes in another; but in the latter day it will be established on the top of the mountains; and which is a desirable thing by all the saints, and what they should, as many do, earnestly pray for; and which God will do in his own time; and then it shall be established for ever, and be a tabernacle that shall not be taken down; not one of its stakes shall be removed, nor any of its cords broken, Isaiah 2:2, Isaiah 33:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God will establish it for ever. Not only particular believers, of which the church consists, are established on the foundation, Christ; but the church itself is built on him, the Rock against which the gates of hell cannot prevail; yet as they are not always in a settled and constant condition, so neither is that, being sometimes tossed with the tempests of afflictions and persecutions, and sometimes in one place, and sometimes in another; but in the latter day it will be established on the top of the mountains; and which is a desirable thing by all the saints, and what they should, as many do, earnestly pray for; and which God will do in his own time; and then it shall be established for ever, and be a tabernacle that shall not be taken down; not one of its stakes shall be removed, nor any of its cords broken, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah; on this word; see Gill on Psalm 3:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Selah; on this word; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As we have {h} heard, so have we seen in the city of the LORD of hosts, in the city of our God: God will establish it for ever. Selah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As we have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " heard, so have we seen in the city of the LORD of hosts, in the city of our God: God will establish it for ever. Selah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) That is, of our fathers: so have we proved: or God has performed his promise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Experience has confirmed what tradition (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") related of God’s marvellous works on behalf of His people, and justifies the confidence that He will never cease to guard the city of His choice. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But all such anticipations are conditional: Israel’s unfaithfulness made a literal fulfilment impossible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As we have heard, so have we seen in the city of the Lord of hosts, in the city of our God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e. as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have heard of former deliverances of Jerusalem from the attacks of enemies; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from Shishak (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 12:2-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from Zorah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 14:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so now we have seen with our own eyes a deliverance of the same favoured city, such as might be expected from the fact that she is \"the city of the Lord of hosts, the city of our God.\" Having seen with our own eyes Jerusalem thus delivered, we come to the conclusion that God will establish it for ever. Psalm 48:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 48:4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the pointing is rightly נודע, not נודע, shows that the praise sung by the poet is based upon an event in contemporary history. Elohim has made Himself known by the loftily built parts ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: lxx: ἐν ταῖς βάρεσιν αὐτῆς, on which Gregory of Nyssa remarks (Opera, Ed. Paris, t. i. p. 333): βάρεις λέγει τάς τῶν οἰκοδομημάτων περιγραφεὶς ἐν τετραγώνῳ τῷ σχήματι.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of Jerusalem (Psalm 122:7) למשׂגּב (the ל that is customary with verbs of becoming and making), i.e., as an inaccessible fortress, making them secure against any hostile attack. The fact by which He has thus made Himself known now immediately follows. המּלכים points to a definite number of kings known to the poet; it therefore speaks in favour of the time of peril and war in the reign of Jehoshaphat and against that in the reign of Hezekiah. נועד is reciprocal: to appoint themselves a place of meeting, and meet together there. עבר, as in Judges 11:29; 2 Kings 8:21, of crossing the frontier and invasion (Hitzig), not of perishing and destruction, as in Psalm 37:36, Nahum 1:12 (De Wette); for נועדו requires further progress, and the declaration respecting their sudden downfall does not follow till later on. The allies encamped in the desert to Tekoa, about three hours distant from Jerusalem. The extensive view at that point extends even to Jerusalem: as soon as they saw it they were amazed, i.e., the seeing and astonishment, panic and confused flight, occurred all together; there went forth upon them from the Holy City, because Elohim dwells therein, a חרדּת אלהים (1 Samuel 14:15), or as we should say, a panic or a panic-striking terror. Concerning כּן as expressive of simultaneousness, vid., on Habakkuk 3:10. כּאשׁר in the correlative protasis is omitted, as in Hosea 11:2, and frequently; cf. on Isaiah 55:9. Trembling seized upon them there (שׁם, as in Psalm 14:5), pangs as of a woman in travail. In Psalm 48:8, the description passes over emotionally into the form of address. It moulds itself according to the remembrance of a recent event of the poet's own time, viz., the destruction of the merchant fleet fitted out by Jehoshaphat in conjunction with Ahaziah, king of Israel (1 Kings 22:49; 2 Chronicles 20:36.). The general meaning of Psalm 48:8 is, that God's omnipotence is irresistible. Concerning the \"wind of the east quarter,\" which here, as in Ezekiel 27:26, causes shipwreck, vid., on Job 27:21. The \"ships of Tarshish,\" as is clear from the context both before and after, are not meant literally, but used as a figure of the worldly powers; Isaiah (Isaiah 33) also compares Assyria to a gallant ship. Thus, then, the church can say that in the case of Jerusalem it has, as an eye-witness, experienced that which it has hitherto only heard from the tradition of a past age (ראה and שׁמע as in Job 42:5), viz., that God holds it erect, establishes it, for ever. Hengstenberg observes here, \"The Jerusalem that has been laid in ruins is not that which the psalmist means; it is only its outward form which it has put off\" [lit. its broken and deserted pupa]. It is true that, according to its inner and spiritual nature, Jerusalem continues its existence in the New Testament church; but it is not less true that its being trodden under foot for a season in the kairoi' ethnoo'n no more annuls the promise of God than Israel's temporary rejection annuls Israel's election. The Holy City does not fall without again rising up. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "of Jerusalem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 122:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") למשׂגּב (the ל that is customary with verbs of becoming and making), i.e., as an inaccessible fortress, making them secure against any hostile attack. The fact by which He has thus made Himself known now immediately follows. המּלכים points to a definite number of kings known to the poet; it therefore speaks in favour of the time of peril and war in the reign of Jehoshaphat and against that in the reign of Hezekiah. נועד is reciprocal: to appoint themselves a place of meeting, and meet together there. עבר, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 11:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of crossing the frontier and invasion (Hitzig), not of perishing and destruction, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (De Wette); for נועדו requires further progress, and the declaration respecting their sudden downfall does not follow till later on. The allies encamped in the desert to Tekoa, about three hours distant from Jerusalem. The extensive view at that point extends even to Jerusalem: as soon as they saw it they were amazed, i.e., the seeing and astonishment, panic and confused flight, occurred all together; there went forth upon them from the Holy City, because Elohim dwells therein, a חרדּת אלהים (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or as we should say, a panic or a panic-striking terror. Concerning כּן as expressive of simultaneousness, vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". כּאשׁר in the correlative protasis is omitted, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently; cf. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Trembling seized upon them there (שׁם, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), pangs as of a woman in travail. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the description passes over emotionally into the form of address. It moulds itself according to the remembrance of a recent event of the poet's own time, viz., the destruction of the merchant fleet fitted out by Jehoshaphat in conjunction with Ahaziah, king of Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). The general meaning of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is, that God's omnipotence is irresistible. Concerning the \"wind of the east quarter,\" which here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", causes shipwreck, vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The \"ships of Tarshish,\" as is clear from the context both before and after, are not meant literally, but used as a figure of the worldly powers; Isaiah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") also compares Assyria to a gallant ship. Thus, then, the church can say that in the case of Jerusalem it has, as an eye-witness, experienced that which it has hitherto only heard from the tradition of a past age (ראה and שׁמע as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), viz., that God holds it erect, establishes it, for ever. Hengstenberg observes here, \"The Jerusalem that has been laid in ruins is not that which the psalmist means; it is only its outward form which it has put off\" [lit. its broken and deserted pupa]. It is true that, according to its inner and spiritual nature, Jerusalem continues its existence in the New Testament church; but it is not less true that its being trodden under foot for a season in the kairoi' ethnoo'n no more annuls the promise of God than Israel's temporary rejection annuls Israel's election. The Holy City does not fall without again rising up. ",
            "children": []
          }
        ]
      }
    ]
  }
]