[{"header":"The Wise Men"},{"num":2,"verse":"When Jesus was born in the village of Bethlehem in Judea, Herod was king. During this time some wise men from the east came to Jerusalem "},{"num":2,"verse":"and said, “Where is the child born to be king of the Jews? We saw his star in the east and have come to worship him.”"},{"num":3,"verse":"When King Herod heard about this, he was worried, and so was everyone else in Jerusalem. "},{"num":4,"verse":"Herod brought together the chief priests and the teachers of the Law of Moses and asked them, “Where will the Messiah be born?”"},{"num":5,"verse":"They told him, “He will be born in Bethlehem, just as the prophet wrote,"},{"num":7,"verse":"Herod secretly called in the wise men and asked them when they had first seen the star. "},{"num":8,"verse":"He told them, “Go to Bethlehem and search carefully for the child. As soon as you find him, let me know. I want to go and worship him too.”"},{"num":9,"verse":"The wise men listened to what the king said and then left. And the star they had seen in the east went on ahead of them until it stopped over the place where the child was. "},{"num":10,"verse":"They were thrilled and excited to see the star."},{"num":11,"verse":"When the men went into the house and saw the child with Mary, his mother, they knelt down and worshiped him. They took out their gifts of gold, frankincense, and myrrh and gave them to him. "},{"num":12,"verse":"Later they were warned in a dream not to return to Herod, and they went back home by another road."},{"header":"The Escape to Egypt"},{"num":13,"verse":"After the wise men had gone, an angel from the Lord appeared to Joseph in a dream and said, “Get up! Hurry and take the child and his mother to Egypt! Stay there until I tell you to return, because Herod is looking for the child and wants to kill him.”"},{"num":14,"verse":"That night, Joseph got up and took his wife and the child to Egypt, "},{"num":15,"verse":"where they stayed until Herod died. So the Lord’s promise came true, just as the prophet had said, “I called my son out of Egypt.”"},{"header":"The Killing of the Children"},{"num":16,"verse":"When Herod found out that the wise men from the east had tricked him, he was very angry. He gave orders for his men to kill all the boys who lived in or near Bethlehem and were two years old and younger. This was based on what he had learned from the wise men."},{"num":17,"verse":"So the Lord’s promise came true, just as the prophet Jeremiah had said,"},{"header":"The Return from Egypt"},{"num":19,"verse":"After King Herod died, an angel from the Lord appeared in a dream to Joseph while he was still in Egypt. "},{"num":20,"verse":"The angel said, “Get up and take the child and his mother back to Israel. The people who wanted to kill him are now dead.”"},{"num":21,"verse":"Joseph got up and left with them for Israel. "},{"num":22,"verse":"But when he heard that Herod’s son Archelaus was now ruler of Judea, he was afraid to go there. Then in a dream he was told to go to Galilee, "},{"num":23,"verse":"and they went to live there in the town of Nazareth. So the Lord’s promise came true, just as the prophet had said, “He will be called a Nazarene.”"}]