[{"header":"King Saul and His Sons Die"},{"num":10,"verse":"The Philistines fought against Israel in a battle at Mount Gilboa. Israel’s soldiers ran from the Philistines, and many of them were killed. "},{"num":2,"verse":"The Philistines closed in on Saul and his sons and killed three of them: Jonathan, Abinadab, and Malchishua. "},{"num":3,"verse":"The fighting was fierce around Saul, and he was badly wounded by enemy arrows."},{"num":4,"verse":"Saul told the soldier who carried his weapons, “Kill me with your sword! I don’t want those godless Philistines to torture and make fun of me.”"},{"num":5,"verse":"When the soldier realized that Saul was dead, he killed himself in the same way."},{"num":6,"verse":"Saul, three of his sons, and all his male relatives were dead. "},{"num":7,"verse":"The Israelites who lived in Jezreel Valley learned that their army had run away and that Saul and his sons were dead. They ran away too, and the Philistines moved into the towns the Israelites left behind."},{"num":8,"verse":"The next day the Philistines came back to the battlefield to carry away the weapons of the dead Israelite soldiers. When they found the bodies of Saul and his sons on Mount Gilboa, "},{"num":9,"verse":"they took Saul’s weapons, pulled off his armor, and cut off his head. Then they sent messengers everywhere in Philistia to spread the news among their people and to thank the idols of their gods. "},{"num":10,"verse":"They put Saul’s armor in the temple of their gods and hung his head in the temple of their god Dagon."},{"num":11,"verse":"When the people who lived in Jabesh in Gilead heard what the Philistines had done to Saul, "},{"num":12,"verse":"some brave men went to get his body and the bodies of his three sons. The men brought the bodies back to Jabesh, where they buried them under an oak tree. Then for seven days, they went without eating to show their sorrow."},{"num":13,"verse":"Saul died because he was unfaithful and disobeyed the Lord. He even asked advice from a woman who talked to spirits of the dead, "},{"num":14,"verse":"instead of asking the Lord. So the Lord had Saul killed and gave his kingdom to David, the son of Jesse."}]