[{"header":"Saul Takes His Own Life"},{"num":10,"verse":"The Philistines fought against Israel. The men of Israel ran away from them. But many Israelites were killed on Mount Gilboa. "},{"num":2,"verse":"The Philistines kept chasing Saul and his sons. They killed his sons Jonathan, Abinadab and Malki-Shua. "},{"num":3,"verse":"The fighting was heavy around Saul. Men armed with bows and arrows caught up with him. They shot their arrows at him and wounded him badly."},{"num":4,"verse":"Saul spoke to the man who was carrying his armor. He said, “Pull out your sword and stick it through me. If you don’t, these men who aren’t circumcised will come and hurt me badly.”"},{"num":5,"verse":"The man saw that Saul was dead. So he fell on his own sword and died. "},{"num":6,"verse":"Saul and his three sons died. All of them died together."},{"num":7,"verse":"All the Israelites who lived in the valley saw that their army had run away. They saw that Saul and his sons were dead. So the Israelites left their towns and ran away. Then the Philistines came and lived in them."},{"num":8,"verse":"The day after the Philistines had won the battle, they came to take what they wanted from the dead bodies. They found Saul and his sons dead on Mount Gilboa. "},{"num":9,"verse":"So they took what they wanted from Saul’s body. They cut off his head and took his armor. Then they sent messengers through the whole land of the Philistines. They announced the news to the statues of their gods. They also announced it among their people. "},{"num":10,"verse":"They put Saul’s armor in the temple of their gods. They hung up his head in the temple of their god Dagon."},{"num":11,"verse":"The people of Jabesh Gilead heard what the Philistines had done to Saul. "},{"num":12,"verse":"So all the brave men of Jabesh Gilead went and got the bodies of Saul and his sons. They brought them to Jabesh. Then they buried the bones of Saul and his sons under the great tree that was there. They didn’t eat anything for seven days."},{"num":13,"verse":"Saul died because he wasn’t faithful to the Lord. He didn’t obey the word of the Lord. He even asked for advice from a person who gets messages from people who have died. "},{"num":14,"verse":"He didn’t ask the Lord for advice. So the Lord put him to death. He turned the kingdom over to David. David was the son of Jesse."}]