[{"header":"Saul Dies on Mount Gilboa"},{"num":10,"verse":"Now the Philistines fought against Israel. The men of Israel fled before the Philistines and fell slain on Mount Gilboa. "},{"num":2,"verse":"The Philistines pursued Saul and his sons. The Philistines killed Saul’s sons Jonathan, Abinadab and Malchi-shua. "},{"num":3,"verse":"The battle raged around Saul and the archers spotted him and he was wounded by the archers."},{"num":4,"verse":"Then Saul said to his armor-bearer, “Draw your sword and run me through, so that these uncircumcised will not come and torture me.”"},{"num":5,"verse":"When his armor-bearer saw that Saul was dead, he also fell on his sword and died. "},{"num":6,"verse":"So Saul and his three sons died; his whole household died together. "},{"num":7,"verse":"Now when all the men of Israel who were in the valley saw that they had fled and that Saul and his sons were dead, they abandoned their towns and fled. The Philistines then came and lived in them."},{"num":8,"verse":"The next day, when the Philistines came to strip the slain, they found Saul and his sons fallen on Mount Gilboa. "},{"num":9,"verse":"They stripped him and took his head and his armor, and sent messengers throughout the land of the Philistines proclaiming the good news to their idols and to the people. "},{"num":10,"verse":"They put his armor in the house of their gods, and hung his head in the house of Dagon."},{"num":11,"verse":"Now when all Jabesh Gilead heard all that the Philistines had done to Saul, "},{"num":12,"verse":"all the valiant men arose and retrieved the body of Saul and the bodies of his sons and brought them to Jabesh. They buried their bones under the oak tree in Jabesh, and fasted seven days."},{"num":13,"verse":"So Saul died because of his unfaithful acts that he committed against the word of Adonai, which he did not keep, and he even consulted a medium for guidance "},{"num":14,"verse":"rather than inquire of Adonai. So He put him to death and transferred the kingdom to David the son of Jesse."}]