[{"header":"David prepares to bring the chest to Jerusalem"},{"num":15,"verse":"After he had built houses for himself in David’s City, David prepared a place for God’s chest and pitched a tent for it."},{"num":2,"verse":"David said, “Only the Levites may carry God’s chest, because the Lord has chosen them to carry the Lord’s chest and to minister to him forever.”"},{"num":3,"verse":"David assembled all Israel in Jerusalem to bring the Lord’s chest to the place he had prepared for it."},{"num":4,"verse":"David also gathered Aaron’s family and the Levites:"},{"num":11,"verse":"David called for the priests Zadok and Abiathar, and the Levites Uriel, Asaiah, Joel, Shemaiah, Eliel, and Amminadab."},{"num":12,"verse":"He said to them, “You are the household heads of the Levites. Make yourselves holy, you and your brothers, and then bring the chest of the Lord, Israel’s God, to the place I’ve prepared for it."},{"num":13,"verse":"When you weren’t with us the first time, the Lord our God burst out against us because we didn’t ask his advice properly.”"},{"num":14,"verse":"So the priests and the Levites made themselves holy to bring up the chest of the Lord, Israel’s God."},{"num":15,"verse":"The Levites carried God’s chest with poles on their shoulders, just as Moses had commanded according to the Lord’s word."},{"num":16,"verse":"Then David told the leaders of the Levites to appoint some of their relatives as singers to raise their voices joyfully, accompanied by musical instruments, including harps, lyres, and cymbals."},{"num":17,"verse":"So the Levites appointed Heman, Joel’s son; and from his relatives, Asaph, Berechiah’s son; and from their Merarite relatives, Ethan, Kushaiah’s son;"},{"num":18,"verse":"and second in rank with them their relatives: Zechariah, Jaaziel, Shemiramoth, Jehiel, Unni, Eliab, Benaiah, Maaseiah, Mattithiah, Eliphelehu, Mikneiah, and Obed-edom and Jeiel the gatekeepers."},{"header":"David brings the chest to Jerusalem"},{"num":25,"verse":"Then David, along with Israel’s elders and the captains of the thousands, went with rejoicing to bring up the chest containing the Lord’s covenant from Obed-edom’s house."},{"num":26,"verse":"Since God had helped the Levites who were carrying the chest containing the Lord’s covenant, they sacrificed seven bulls and seven rams."},{"num":27,"verse":"David wore a fine-linen robe, as did the singers, all the Levites who were carrying the chest, and Chenaniah, the leader of transportation. David also wore a linen priestly vest."},{"num":28,"verse":"So all Israel brought up the chest containing the Lord’s covenant with shouts of joy, accompanied by the blast of the ram’s horn, by trumpets and cymbals, and playing on harps and lyres."},{"num":29,"verse":"As the chest containing the Lord’s covenant entered David’s City, Michal, Saul’s daughter, looked out the window. When she saw King David leaping and dancing, she lost all respect for him."}]