[{"header":"David Brings the Ark to Jerusalem(A)"},{"num":15,"verse":"After David constructed buildings for himself in the City of David, he prepared a place for Elohim’s ark and set up a tent for it. "},{"num":2,"verse":"Then David insisted that only the Levites carry Elohim’s ark because Yahweh had chosen them to carry Yahweh’s ark and to serve him forever."},{"num":3,"verse":"David called together all Israel at Jerusalem to bring Yahweh’s ark to the place he had prepared for it. "},{"num":4,"verse":"David also called together Aaron’s descendants and the Levites. "},{"num":5,"verse":"Leading Kohath’s descendants was Uriel, who came with 120 of his relatives. "},{"num":6,"verse":"Leading Merari’s descendants was Asaiah, who came with 220 of his relatives. "},{"num":7,"verse":"Leading Gershom’s descendants was Joel, who came with 130 of his relatives. "},{"num":8,"verse":"Leading Elizaphan’s descendants was Shemaiah, who came with 200 of his relatives. "},{"num":9,"verse":"Leading Hebron’s descendants was Eliel, who came with 80 of his relatives. "},{"num":10,"verse":"Leading Uzziel’s descendants was Amminadab, who came with 112 of his relatives."},{"num":11,"verse":"David called for the priests Zadok and Abiathar and for the Levites Uriel, Asaiah, Joel, Shemaiah, Eliel, and Amminadab. "},{"num":12,"verse":"He said to them, “You are the heads of the Levite families. You and your relatives must perform the ceremonies to make yourselves holy. Then bring the ark of Yahweh Elohim of Israel to the place I prepared for it. "},{"num":13,"verse":"Because you weren’t there the first time, Yahweh our Elohim struck us. We hadn’t dedicated our lives to serving him in the way he designated.”"},{"num":14,"verse":"So the priests and the Levites made themselves holy in order to move the ark of Yahweh Elohim of Israel. "},{"num":15,"verse":"The Levites carried Elohim’s ark on their shoulders. They used poles as Moses had commanded according to Yahweh’s instructions."},{"num":16,"verse":"David told the Levite leaders to appoint some of their relatives to serve as musicians. They were expected to play music on harps, lyres, and cymbals to produce joyful music for singing. "},{"num":17,"verse":"So the Levites appointed Heman, son of Joel, and from his relatives they appointed Asaph, Berechiah’s son. From their own relatives, Merari’s descendants, they appointed Ethan, son of Kushaiah. "},{"num":18,"verse":"In addition, they appointed their relatives from the second division: Zechariah, Jaaziel, Shemiramoth, Jehiel, Unni, Eliab, Benaiah, Maaseiah, Mattithiah, Eliphelehu, and Mikneiah. Obed Edom and Jeiel were appointed gatekeepers. "},{"num":19,"verse":"The musicians Heman, Asaph, and Ethan were appointed to play bronze cymbals. "},{"num":20,"verse":"Zechariah, Jaziel, Shemiramoth, Jehiel, Unni, Eliab, Maaseiah, and Benaiah were appointed to play harps according to alamoth. "},{"num":21,"verse":"Mattithiah, Eliphelehu, Mikneiah, Obed Edom, Jeiel, and Azaziah were appointed to play lyres and to conduct the sheminith. "},{"num":22,"verse":"Chenaniah, a Levite leader, instructed others how to sing prophetic songs because he was skilled at it. "},{"num":23,"verse":"Berechiah and Elkanah were gatekeepers for the ark. "},{"num":24,"verse":"The priests Shebaniah, Joshaphat, Nethanel, Amasai, Zechariah, Benaiah, and Eliezer blew trumpets in front of Elohim’s ark. Obed Edom and Jehiah were doorkeepers for the ark."},{"num":25,"verse":"So David, the leaders of Israel, and the army’s commanders joyfully went to get the ark of Yahweh’s promise from Obed Edom’s house. "},{"num":26,"verse":"Because Elohim helped the Levites who carried the ark of Yahweh’s promise, they sacrificed seven bulls and seven rams. "},{"num":27,"verse":"David was dressed in a fine linen robe, as were all the Levites who carried the ark, the Levites who were singers, and Chenaniah, the leader of the musicians’ prophetic songs. David also wore a linen ephod."},{"num":28,"verse":"All Israel brought the ark of Yahweh’s promise with shouts of joy and the sounding of rams’ horns, trumpets, cymbals, harps, and lyres. "},{"num":29,"verse":"When the ark of Yahweh’s promise came to the City of David, Saul’s daughter Michal looked out of a window and saw King David dancing and celebrating, so she despised him."}]