[{"header":"War against the Midianites"},{"num":31,"verse":"The Lord spoke to Moses:"},{"num":2,"verse":"Take just reparations for the Israelites from the Midianites. Afterward you will join your ancestors."},{"num":3,"verse":"Moses spoke to the people: “Equip some of your men for battle so that they may go against Midian and execute the Lord’s just punishment against Midian."},{"num":4,"verse":"You will send out for battle one thousand from each of the tribes of Israel.”"},{"num":5,"verse":"From the thousands of Israel, one thousand from each tribe were selected. Twelve thousand were equipped for battle."},{"num":6,"verse":"Moses sent them to battle, one thousand from each tribe, along with Phinehas, Eleazar the priest’s son, who carried the sanctuary equipment and the trumpets for sounding the alarm in his hand."},{"num":7,"verse":"They battled against Midian as the Lord had commanded Moses, and they killed every male."},{"num":8,"verse":"They killed the kings of Midian: Evi, Rekem, Zur, Hur, and Reba, the five kings of Midian, along with others slain. They also killed Balaam, Beor’s son, with the sword."},{"num":9,"verse":"The Israelites took captive the Midianite women, their little ones, all their cattle, their herds, and their possessions."},{"num":10,"verse":"They burned all the cities where they lived and their encampments."},{"num":11,"verse":"They took all the spoils of war and the valuable property, both human and animal,"},{"num":12,"verse":"and they brought the captives, the valuable property, and the spoils of war to Moses, Eleazar the priest, and the Israelite community, at the camp on the plains of Moab by the Jordan across from Jericho."},{"header":"Purification from war"},{"num":13,"verse":"Moses, Eleazar the priest, and the chiefs of the community went to meet them outside the camp."},{"num":14,"verse":"Moses became angry with the commanders of the army, the officers of thousands and the officers of hundreds, who came back from the battle."},{"num":15,"verse":"Moses said to them, “Have you let all the women live?"},{"num":16,"verse":"These very women, on Balaam’s advice, made the Israelites break faith with the Lord in the affair at Peor, so there was a plague among the Lord’s community."},{"num":17,"verse":"Now kill every male child and every female who has known a man intimately by sleeping with him."},{"num":18,"verse":"But all the young girls who have not known a man intimately by sleeping with him, spare for yourselves."},{"num":19,"verse":"You will remain outside the camp for seven days. Everyone among you or your captives who has killed a person or touched a corpse must purify themselves on the third and seventh days."},{"num":20,"verse":"You must also purify every garment, and everything made of leather, goats’ hair, or wood.”"},{"header":"Instructions about the spoils of war"},{"num":21,"verse":"Eleazar the priest said to the men of battle who had gone out to war, “This is the regulation in the Instruction that the Lord commanded Moses:"},{"num":22,"verse":"Gold, silver, copper, iron, tin, and lead—"},{"num":23,"verse":"anything that can withstand fire—you will put through the fire and it will be clean. It will also be purified with the water of purification. Anything that isn’t able to withstand fire, you will immerse in water."},{"num":24,"verse":"You must wash your clothes on the seventh day and you will be clean. Afterward you may enter the camp.”"},{"num":25,"verse":"The Lord said to Moses:"},{"num":26,"verse":"You, Eleazar the priest, and the leaders of the community’s households must take an inventory of the valuable property and the captives, both human and animals,"},{"num":27,"verse":"and divide the valuable property between the warriors who went into battle and the entire community."},{"num":28,"verse":"You will offer as tribute to the Lord from each warrior who went into battle one living being in five hundred, whether human, oxen, donkeys, or flocks."},{"num":29,"verse":"Take it from the warriors’ half and give it to Eleazar the priest as a gift offering to the Lord."},{"num":30,"verse":"But from the Israelites’ half you will take one out of every fifty, whether from human, oxen, donkeys, or flock—all the animals. You will give them to the Levites who carry out the duties of the Lord’s dwelling."},{"num":31,"verse":"Moses and Eleazar the priest did as the Lord commanded Moses."},{"num":32,"verse":"The valuable property remaining from the spoils of war that the people of the army had taken was 675,000 sheep,"},{"num":33,"verse":"72,000 oxen,"},{"num":34,"verse":"61,000 donkeys,"},{"num":35,"verse":"and 32,000 women who hadn’t known a man intimately by sleeping with him."},{"num":36,"verse":"The half-share of those who had gone out to battle numbered 337,500 sheep,"},{"num":37,"verse":"of which the Lord’s tribute was 675."},{"num":38,"verse":"The oxen were 36,000, of which the Lord’s tribute was 72."},{"num":39,"verse":"The donkeys were 30,500, of which the Lord’s tribute was 61."},{"num":40,"verse":"Humans were 16,000, of which the Lord’s tribute was 32 persons."},{"num":41,"verse":"Moses gave the tribute, a gift offering for the Lord, to Eleazar the priest as the Lord had commanded Moses."},{"num":42,"verse":"As for the half-share of the Israelites that Moses divided from those who had gone out to battle:"},{"num":43,"verse":"the community’s half-share was 337,500 sheep,"},{"num":44,"verse":"36,000 oxen,"},{"num":45,"verse":"30,500 donkeys,"},{"num":46,"verse":"and 16,000 humans."},{"num":47,"verse":"Moses took from the Israelites’ half one out of every fifty, from humans and animals. He gave them to the Levites who carry out the duties of the Lord’s dwelling, just as the Lord had commanded Moses."},{"num":48,"verse":"The commanders over the thousands of the army, officers over thousands and officers over hundreds, approached Moses"},{"num":49,"verse":"and said to Moses, “Your servants have counted the warriors in our charge and not one of us is missing."},{"num":50,"verse":"We have brought the Lord’s offering that each found, gold articles—anklets, bracelets, signet rings, earrings, and necklaces—to seek reconciliation for ourselves before the Lord.”"},{"num":51,"verse":"Moses and Eleazar the priest took all the gold articles from them."},{"num":52,"verse":"All the gold for the gift offering that was presented to the Lord from the officers of thousands and the officers of hundreds was sixteen thousand seven hundred fifty shekels."},{"num":53,"verse":"Each of the men of battle took spoils of war for himself."},{"num":54,"verse":"Yet Moses and Eleazar the priest also received the gold from the officers of thousands and of hundreds, and they brought it to the meeting tent as a memorial for the Israelites before the Lord."}]