[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:10-22 The miserable condition of the wicked man in this world is fully set forth. The lusts of the flesh are here called the sins of his youth. His hiding it and keeping it under his tongue, denotes concealment of his beloved lust, and delight therein. But He who knows what is in the heart, knows what is under the tongue, and will discover it. The love of the world, and of the wealth of it, also is wickedness, and man sets his heart upon these. Also violence and injustice, these sins bring God's judgments upon nations and families. Observe the punishment of the wicked man for these things. Sin is turned into gall, than which nothing is more bitter; it will prove to him poison; so will all unlawful gains be. In his fulness he shall be in straits, through the anxieties of his own mind. To be led by the sanctifying grace of God to restore what was unjustly gotten, as Zaccheus was, is a great mercy. But to be forced to restore by the horrors of a despairing conscience, as Judas was, has no benefit and comfort attending it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet his meat - His food.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In his bowels is turned - That is, it is as if he had taken food which was exceedingly pleasant, and had retained it in his mouth as long as possible, that he might enjoy it, but when he swallowed it, it became bitter and offensive; compare Revelation 10:9-10. Sin may be pleasant when it is committed, but its consequences will be bitter.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In his bowels is turned - That is, it is as if he had taken food which was exceedingly pleasant, and had retained it in his mouth as long as possible, that he might enjoy it, but when he swallowed it, it became bitter and offensive; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Sin may be pleasant when it is committed, but its consequences will be bitter.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It is the gall of asps - On the meaning of the word here rendered \"asps\" (פתן  pethen), see the notes at Isaiah 11:8. There can be little doubt that the \"asp,\" or aspic, of antiquity, which was so celebrated, is here intended. The bite was deadly, and was regarded as incurable. The sight became immediately dim after the bite - a swelling took place, and pain was felt in the stomach, followed by stupor, convulsions, and death. It is probably the same as the \"boetan\" of the Arabians. It is about a foot in length, and two inches in circumference - its color being black and white. \"Pict. Bib.\" The word \"gall\" (מרורה  merôrâh), means \"bitterness, acridness\" (compare Job 13:26); and hence, bile or gall. It is not improbable that it was formerly supposed that the poison of the serpent was contained in the gall, though it is now ascertained that it is found in a small sack in the mouth. It is used here as synonymous with the \"poison\" of asps - supposed to be \"bitter\" and \"deadly.\" The meaning is, that sin, however pleasant and grateful it may be when committed, will be as destructive to the soul as food would be to the body, which, as soon as it was swallowed, became the most deadly poison. This is a fair account still of the effects of sin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is the gall of asps - On the meaning of the word here rendered \"asps\" (פתן  pethen), see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There can be little doubt that the \"asp,\" or aspic, of antiquity, which was so celebrated, is here intended. The bite was deadly, and was regarded as incurable. The sight became immediately dim after the bite - a swelling took place, and pain was felt in the stomach, followed by stupor, convulsions, and death. It is probably the same as the \"boetan\" of the Arabians. It is about a foot in length, and two inches in circumference - its color being black and white. \"Pict. Bib.\" The word \"gall\" (מרורה  merôrâh), means \"bitterness, acridness\" (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and hence, bile or gall. It is not improbable that it was formerly supposed that the poison of the serpent was contained in the gall, though it is now ascertained that it is found in a small sack in the mouth. It is used here as synonymous with the \"poison\" of asps - supposed to be \"bitter\" and \"deadly.\" The meaning is, that sin, however pleasant and grateful it may be when committed, will be as destructive to the soul as food would be to the body, which, as soon as it was swallowed, became the most deadly poison. This is a fair account still of the effects of sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. turned—Hebrew denotes a total change into a disagreeable contrary (Jer 2:21; compare Re 10:9, 10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "gall—in which the poison of the asp was thought to lie. It rather is contained in a sack in the mouth. Scripture uses popular language, where no moral truth is thereby endangered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Turned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into another nature or quality, from sweet to bitter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The gall of asps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. exceeding bitter and pernicious. Gall is most bitter; the gall of serpents is full of poison, which from thence is conveyed to their mouths by veins, as Pliny observes; and the poison of asps is most dangerous, and within a few hours kills without remedy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet his meat in his bowels is turned,.... Or \"his bread\" (r), to which sin is compared, being what the sinner lives in, and lives upon; what he strengthens himself in and with, and by which he is nourished unto the day of slaughter, and by means of which he grows and proceeds to more ungodliness, though in the issue he comes into starving and famishing circumstances; for this is bread of deceit, and proves to be ashes and gravel stones; it promises pleasure, profit, liberty, and impunity, but is all the reverse; as meat turns in a man's stomach when it does not digest in him, or rather his stomach turns against that, and instead of its being pleasant and agreeable to him, it distresses him and makes him uneasy; sin being compared to meat in the bowels, denotes the finishing of in after it has been conceived in the mind, and completed in the act: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it is the gall of asps within him; which is bitter, though not poison; which yet Pliny (s) suggests, but it seems (t) it is not fact. Sin is an evil and bitter thing, and produces bitter sorrow, and makes bitter work for repentance in good men, Jeremiah 2:19; and fills with distress inexpressible and intolerable in wicked men, as in Cain and Judas in this world, and with black despair, weeping, and gnashing of teeth, and dreadful horrors of conscience, in the world to come, to all eternity; the effect of it is eternal death, the second death, inevitable and everlasting ruin and destruction. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "it is the gall of asps within him; which is bitter, though not poison; which yet Pliny (s) suggests, but it seems (t) it is not fact. Sin is an evil and bitter thing, and produces bitter sorrow, and makes bitter work for repentance in good men, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and fills with distress inexpressible and intolerable in wicked men, as in Cain and Judas in this world, and with black despair, weeping, and gnashing of teeth, and dreadful horrors of conscience, in the world to come, to all eternity; the effect of it is eternal death, the second death, inevitable and everlasting ruin and destruction. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) \"panis ejus\", Pagninus, Montanus, Beza, Schmidt. (s) Nat. Hist. l. 11. c. 37. (t) Scheuchzer. Physic. Sacr. vol. 4. p. 711. Philosoph. Transact. abridged, vol. 2. p. 819. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) \"panis ejus\", Pagninus, Montanus, Beza, Schmidt. (s) Nat. Hist. l. 11. c. 37. (t) Scheuchzer. Physic. Sacr. vol. 4. p. 711. Philosoph. Transact. abridged, vol. 2. p. 819. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Yet his meat in his bowels is turned, it is the gall of asps within him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is turned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. is changed,—it becomes the poison of asps in his belly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet his meat in his bowels is turned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Still, a time comes when the self-complacency of the wicked man is shaken. He experiences a failure of health or spirits. Then, suddenly, it is as if the meat that he has swallowed had been turned to poison in his bowels, as if the gall of asps were within him. Compare what Bishop Butler says of the sudden waking up of a man's conscience ('Analogy,' pt. 1. ch. 2. p. 52). The ancients seem to have known that the poison of serpents was a strong acid, and therefore supposed that it was secreted by the gallbladder (see Pliny, 'Hist. Nat.,' 11:37). Job 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12  If wickedness tasted sweet in his mouth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hid it under his tongue;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13  He carefully cherished it and did not let it go,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And retained it in his palate:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  His bread is now changed in his bowels,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is the gall of vipers within him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  He hath swallowed down riches and now he spitteth them out,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God shall drive them out of his belly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  He sucked in the poison of vipers,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The tongue of the adder slayeth him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The evil-doer is, in Job 20:12, likened to an epicure; he keeps hold of wickedness as long as possible, like a delicate morsel that is retained in the mouth (Renan: comme un bonbon qu'on laisse fondre dans la bouche), and seeks to enjoy it to the very last. המתּיק, to make sweet, has here the intransitive signification dulcescere, Ew. 122, c. הכחיד, to remove from sight, signifies elsewhere to destroy, here to conceal (as the Piel, Job 6:10; Job 15:18). חמל, to spare, is construed with על, which is usual with verbs of covering and protecting. The conclusion of the hypothetical antecedent clauses begins with Job 20:14; the perf. נהפּך (with Kametz by Athnach) describes the suddenness of the change; the מרורת which follows is not equivalent to למרורת (Luther: His food shall be turned to adder's gall in his body), but Job 20:14 expresses the result of the change in a substantival clause. The bitter and poisonous are synonymous in the ancient languages; hence we find the meanings poison and gall (Job 20:25) in מררה, and ראשׁ signifies both a poisonous plant which is known by its bitterness, and the poison of plants like to the poison of serpents (Job 20:16; Deuteronomy 32:33). חיל (Job 20:15) is property, without the accompanying notion of forcible acquisition (Hirz.), which, on the contrary, is indicated by the בּלע. The following fut. consec. is here not aor., but expressive of the inevitable result which the performance of an act assuredly brings: he must vomit back the property which he has swallowed down; God casts it out of his belly, i.e., (which is implied in בּלע, expellere) forcibly, and therefore as by the pains of colic. The lxx, according to whose taste the mention of God here was contrary to decorum, trans. ἐξ οἰκίας (read κοιλίας, according to Cod. Alex.) αὐτοῦ ἐξελκύσει αὐτὸν ἄγγελος (Theod. δυνάστης). The perf., Job 20:15, is in Job 20:16 changed into the imperf. fut. יינק, which more strongly represents the past action as that which has gone before what is now described; and the ασυνδέτως, fut. which follows, describes the consequence which is necessarily and directly involved in it. Psalm 140:4 may be compared with Job 20:16, Proverbs 23:32 with Job 20:16. He who sucked in the poison of low desire with a relish, will meet his punishment in that in which he sinned: he is destroyed by the poisonous deadly bite of the serpent, for the punishment of sin is fundamentally nothing but the nature of sin itself brought fully out. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The evil-doer is, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", likened to an epicure; he keeps hold of wickedness as long as possible, like a delicate morsel that is retained in the mouth (Renan: comme un bonbon qu'on laisse fondre dans la bouche), and seeks to enjoy it to the very last. המתּיק, to make sweet, has here the intransitive signification dulcescere, Ew. 122, c. הכחיד, to remove from sight, signifies elsewhere to destroy, here to conceal (as the Piel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). חמל, to spare, is construed with על, which is usual with verbs of covering and protecting. The conclusion of the hypothetical antecedent clauses begins with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the perf. נהפּך (with Kametz by Athnach) describes the suddenness of the change; the מרורת which follows is not equivalent to למרורת (Luther: His food shall be turned to adder's gall in his body), but ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " expresses the result of the change in a substantival clause. The bitter and poisonous are synonymous in the ancient languages; hence we find the meanings poison and gall (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in מררה, and ראשׁ signifies both a poisonous plant which is known by its bitterness, and the poison of plants like to the poison of serpents (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). חיל (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is property, without the accompanying notion of forcible acquisition (Hirz.), which, on the contrary, is indicated by the בּלע. The following fut. consec. is here not aor., but expressive of the inevitable result which the performance of an act assuredly brings: he must vomit back the property which he has swallowed down; God casts it out of his belly, i.e., (which is implied in בּלע, expellere) forcibly, and therefore as by the pains of colic. The lxx, according to whose taste the mention of God here was contrary to decorum, trans. ἐξ οἰκίας (read κοιλίας, according to Cod. Alex.) αὐτοῦ ἐξελκύσει αὐτὸν ἄγγελος (Theod. δυνάστης). The perf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " changed into the imperf. fut. יינק, which more strongly represents the past action as that which has gone before what is now described; and the ασυνδέτως, fut. which follows, describes the consequence which is necessarily and directly involved in it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 140:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may be compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He who sucked in the poison of low desire with a relish, will meet his punishment in that in which he sinned: he is destroyed by the poisonous deadly bite of the serpent, for the punishment of sin is fundamentally nothing but the nature of sin itself brought fully out. ",
            "children": []
          }
        ]
      }
    ]
  }
]