[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 20:15-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:15-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath swallowed down riches — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He hath got possession of them, and thought them to be as much his own as the meat he had eaten. But he is deceived. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall vomit them up again ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Shall be compelled to restore them: his own conscience perhaps may make him so uneasy in the keeping of what he has gotten, that, for the quiet of his own mind, he shall make restitution, and that not with the pleasure of a virtue, but with the utmost reluctancy, like the pain produced by an emetic. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God shall cast them out of his belly — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If he do not himself voluntarily refund what he has violently taken away, God, by his providence, shall force him to do it, and bring it about, one way or other, that his ill-gotten goods shall return to their right owners. If man’s hand cannot reach him, God shall find him out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall suck the poison of asps — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "What he sucked so sweetly, and with so much pleasure, shall, in the issue, prove most ungrateful and destructive, as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "poison, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "head ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(for the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ראשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rosh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies both, and the poison lies in the head) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of asps ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "would be to one that sucked it. Such is sin; such especially will all unlawful gains be. The fawning tongue will prove the viper’s tongue. All the charming graces that are thought to be in sin will turn, when the conscience is awakened, into so many raging furies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:10-22 The miserable condition of the wicked man in this world is fully set forth. The lusts of the flesh are here called the sins of his youth. His hiding it and keeping it under his tongue, denotes concealment of his beloved lust, and delight therein. But He who knows what is in the heart, knows what is under the tongue, and will discover it. The love of the world, and of the wealth of it, also is wickedness, and man sets his heart upon these. Also violence and injustice, these sins bring God's judgments upon nations and families. Observe the punishment of the wicked man for these things. Sin is turned into gall, than which nothing is more bitter; it will prove to him poison; so will all unlawful gains be. In his fulness he shall be in straits, through the anxieties of his own mind. To be led by the sanctifying grace of God to restore what was unjustly gotten, as Zaccheus was, is a great mercy. But to be forced to restore by the horrors of a despairing conscience, as Judas was, has no benefit and comfort attending it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath swallowed down riches - He has \"glutted\" down riches - or gormandized them - or devoured them greedily. The Hebrew word בלע  bela‛, means \"to absorb, to devour with the idea of greediness.\" It is descriptive of the voracity of a wild beast, and means here that he had devoured them eagerly, or voraciously.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he shall vomit - As an epicure does that which he has drunk or swallowed with delight. \"Noyes.\" The idea is, that he shall lose that which he has acquired, and that it will be attended with loathing. All this is to a great extent true still, and may be applied to those who aim to accumulate wealth, and to lay up ill gotten gold. It will be ruinous to their peace; and the time will come when it will be looked on with inexpressible loathing. Zophar meant, undoubtedly, to apply this to Job, and to infer, that since it was a settled maxim that such would be the result of the ill-gotten gain of a wicked man, where a result like this \"had\" happened, that there must have been wickedness. How cutting and severe this must have been to Job can be easily conceived. The Septuagint renders this, \"Out of his house let an angel drag him.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he shall vomit - As an epicure does that which he has drunk or swallowed with delight. \"Noyes.\" The idea is, that he shall lose that which he has acquired, and that it will be attended with loathing. All this is to a great extent true still, and may be applied to those who aim to accumulate wealth, and to lay up ill gotten gold. It will be ruinous to their peace; and the time will come when it will be looked on with inexpressible loathing. Zophar meant, undoubtedly, to apply this to Job, and to infer, that since it was a settled maxim that such would be the result of the ill-gotten gain of a wicked man, where a result like this \"had\" happened, that there must have been wickedness. How cutting and severe this must have been to Job can be easily conceived. The Septuagint renders this, \"Out of his house let an angel drag him.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. He is forced to disgorge his ill-gotten wealth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall vomit them up again, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. be forced to restore them with great shame and torment, as gluttons sometimes do loathe, and with grief and pain cast up, that meat which they have eaten and swallowed down with much greediness and delight. If no man’s hand can reach him, God shall find him out, and punish him severely. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath swallowed down riches,.... Not his own, but another's, which he has spoiled him of and devoured, with as much eagerness, pleasure, and delight, as a hungry man swallows down his food; having an excessive and immoderate love of riches, and an insatiable desire after them, which make him stop at nothing, though ever so illicit, to obtain them; and when he has got them into his possession, thinks them as safe as the food in his belly, and never once dreams of refunding them, which yet he must do, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he shall vomit them up again; that is, make restoration of them, not freely, but forcedly, with great reluctance, much pain of mind, and gripes of conscience: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God shall cast them out of his belly; he shall oblige him to cast them up again, by working upon his heart, making his mind uneasy, loading his conscience with guilt, so that he shall have no rest nor peace until he has done it; though they are as meat in his belly within him, they shall not remain with him; though they are in his house, in his coffers, or in his barns, they shall be fetched out from thence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God shall cast them out of his belly; he shall oblige him to cast them up again, by working upon his heart, making his mind uneasy, loading his conscience with guilt, so that he shall have no rest nor peace until he has done it; though they are as meat in his belly within him, they shall not remain with him; though they are in his house, in his coffers, or in his barns, they shall be fetched out from thence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He hath swallowed down riches, and he shall vomit them up again: God shall cast them out of his belly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The same general figure of a delightful food particularized. The ill-gotten riches which he amassed do not abide with him; the wealth that he swallowed up he must disgorge. The figure is perhaps that of a food which the stomach cannot retain.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath swallowed down riches and he shall vomit them up again",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The wicked man shall be made to disgorge his ill-gotten gains. Either fear, or remorse, or a judicial sentence will force him to make restitution (see ver. 10). God shall cast them out of his belly. Whatever is the immediate motive of the restitution: it will really be God's doing. He will cause the fear, or the remorse, or bring about the judicial sentence. Job 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12  If wickedness tasted sweet in his mouth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hid it under his tongue;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13  He carefully cherished it and did not let it go,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And retained it in his palate:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  His bread is now changed in his bowels,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is the gall of vipers within him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  He hath swallowed down riches and now he spitteth them out,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God shall drive them out of his belly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  He sucked in the poison of vipers,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The tongue of the adder slayeth him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The evil-doer is, in Job 20:12, likened to an epicure; he keeps hold of wickedness as long as possible, like a delicate morsel that is retained in the mouth (Renan: comme un bonbon qu'on laisse fondre dans la bouche), and seeks to enjoy it to the very last. המתּיק, to make sweet, has here the intransitive signification dulcescere, Ew. 122, c. הכחיד, to remove from sight, signifies elsewhere to destroy, here to conceal (as the Piel, Job 6:10; Job 15:18). חמל, to spare, is construed with על, which is usual with verbs of covering and protecting. The conclusion of the hypothetical antecedent clauses begins with Job 20:14; the perf. נהפּך (with Kametz by Athnach) describes the suddenness of the change; the מרורת which follows is not equivalent to למרורת (Luther: His food shall be turned to adder's gall in his body), but Job 20:14 expresses the result of the change in a substantival clause. The bitter and poisonous are synonymous in the ancient languages; hence we find the meanings poison and gall (Job 20:25) in מררה, and ראשׁ signifies both a poisonous plant which is known by its bitterness, and the poison of plants like to the poison of serpents (Job 20:16; Deuteronomy 32:33). חיל (Job 20:15) is property, without the accompanying notion of forcible acquisition (Hirz.), which, on the contrary, is indicated by the בּלע. The following fut. consec. is here not aor., but expressive of the inevitable result which the performance of an act assuredly brings: he must vomit back the property which he has swallowed down; God casts it out of his belly, i.e., (which is implied in בּלע, expellere) forcibly, and therefore as by the pains of colic. The lxx, according to whose taste the mention of God here was contrary to decorum, trans. ἐξ οἰκίας (read κοιλίας, according to Cod. Alex.) αὐτοῦ ἐξελκύσει αὐτὸν ἄγγελος (Theod. δυνάστης). The perf., Job 20:15, is in Job 20:16 changed into the imperf. fut. יינק, which more strongly represents the past action as that which has gone before what is now described; and the ασυνδέτως, fut. which follows, describes the consequence which is necessarily and directly involved in it. Psalm 140:4 may be compared with Job 20:16, Proverbs 23:32 with Job 20:16. He who sucked in the poison of low desire with a relish, will meet his punishment in that in which he sinned: he is destroyed by the poisonous deadly bite of the serpent, for the punishment of sin is fundamentally nothing but the nature of sin itself brought fully out. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The evil-doer is, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", likened to an epicure; he keeps hold of wickedness as long as possible, like a delicate morsel that is retained in the mouth (Renan: comme un bonbon qu'on laisse fondre dans la bouche), and seeks to enjoy it to the very last. המתּיק, to make sweet, has here the intransitive signification dulcescere, Ew. 122, c. הכחיד, to remove from sight, signifies elsewhere to destroy, here to conceal (as the Piel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). חמל, to spare, is construed with על, which is usual with verbs of covering and protecting. The conclusion of the hypothetical antecedent clauses begins with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the perf. נהפּך (with Kametz by Athnach) describes the suddenness of the change; the מרורת which follows is not equivalent to למרורת (Luther: His food shall be turned to adder's gall in his body), but ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " expresses the result of the change in a substantival clause. The bitter and poisonous are synonymous in the ancient languages; hence we find the meanings poison and gall (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in מררה, and ראשׁ signifies both a poisonous plant which is known by its bitterness, and the poison of plants like to the poison of serpents (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). חיל (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is property, without the accompanying notion of forcible acquisition (Hirz.), which, on the contrary, is indicated by the בּלע. The following fut. consec. is here not aor., but expressive of the inevitable result which the performance of an act assuredly brings: he must vomit back the property which he has swallowed down; God casts it out of his belly, i.e., (which is implied in בּלע, expellere) forcibly, and therefore as by the pains of colic. The lxx, according to whose taste the mention of God here was contrary to decorum, trans. ἐξ οἰκίας (read κοιλίας, according to Cod. Alex.) αὐτοῦ ἐξελκύσει αὐτὸν ἄγγελος (Theod. δυνάστης). The perf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " changed into the imperf. fut. יינק, which more strongly represents the past action as that which has gone before what is now described; and the ασυνδέτως, fut. which follows, describes the consequence which is necessarily and directly involved in it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 140:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may be compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He who sucked in the poison of low desire with a relish, will meet his punishment in that in which he sinned: he is destroyed by the poisonous deadly bite of the serpent, for the punishment of sin is fundamentally nothing but the nature of sin itself brought fully out. ",
            "children": []
          }
        ]
      }
    ]
  }
]