[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Throne of iniquity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This is an apt expression for an oppressive and unjust government. The word rendered “iniquity” might mean “calamity” or “destruction” (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 57:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “noisome”), but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it seems to mean “lawless desire,” which best suits this passage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Have fellowship—i.e., be associated in the government. Could the theocracy admit to a share in it, not merely imperfect instruments of justice, but even those who perverted justice to evil ends?",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Have fellowship",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., be associated in the government. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Could the theocracy admit to a share in it, not merely imperfect instruments of justice, but even those who perverted justice to evil ends?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Which frameth mischief by a law?—i.e., making legislation a means of wrong. Others, however, render, “against the law.” But the former explanation best suits the next verse.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Which frameth mischief by a law?",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., making legislation a means of wrong. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Others, however, render, “against the law.” But the former explanation best suits the next verse.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 94:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall the throne of iniquity have fellowship with thee? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Wilt thou take part with the unrighteous powers of the world, who oppress thy people? Wilt thou countenance and support these tyrants in their wickedness? We know thou wilt not; but wilt manifest thy justice and displeasure against them. A throne has fellowship with God, when it is a throne of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "justice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and answers the end of its being erected; for by him kings reign; and when they reign for him their judgments are his, and he owns them as his ministers; and whoever resist them, or rise up against them, shall receive to themselves condemnation; but when it becomes a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "throne of iniquity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it has no longer fellowship with God. Far be it from the just and holy God that he should be the patron of unrighteousness, even in princes and those that sit on thrones; yea, though they be the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thrones of the house of David. Which frameth mischief by a law — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who devise wicked devices, and lay heavy burdens upon men by virtue of those unrighteous decrees which they have made in form of laws; or by false pretences of law. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "against all right, and the laws, both of God and men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "94:12-23 That man is blessed, who, under the chastening of the Lord, is taught his will and his truths, from his holy word, and by the Holy Spirit. He should see mercy through his sufferings. There is a rest remaining for the people of God after the days of their adversity, which shall not last always. He that sends the trouble, will send the rest. The psalmist found succour and relief only in the Lord, when all earthly friends failed. We are beholden, not only to God's power, but to his pity, for spiritual supports; and if we have been kept from falling into sin, or shrinking from our duty, we should give him the glory, and encourage our brethren. The psalmist had many troubled thoughts concerning the case he was in, concerning the course he should take, and what was likely to be the end of it. The indulgence of such contrivances and fears, adds to care and distrust, and renders our views more gloomy and confused. Good men sometimes have perplexed and distressed thoughts concerning God. But let them look to the great and precious promises of the gospel. The world's comforts give little delight to the soul, when hurried with melancholy thoughts; but God's comforts bring that peace and pleasure which the smiles of the world cannot give, and which the frowns of the world cannot take away. God is his people's Refuge, to whom they may flee, in whom they are safe, and may be secure. And he will reckon with the wicked. A man cannot be more miserable than his own wickedness will make him, if the Lord visit it upon him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall the throne of iniquity - The throne established in iniquity; or, sustaining iniquity. The allusion is probably to what was referred to in the former part of the psalm - the powers that were spreading desolation through the land - wicked princes or rulers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:3-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their thrones were established on evil; they defended wickedness and wrong by their authority; they abused their power, and employed it to overthrow the rights of others. The \"phrase\" would be applicable to any unjust government, or to any laws that are designed to uphold that which is wrong. Such are all the laws which authorize or uphold slavery, gaming, lotteries, the traffic in intoxicating drinks, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Have fellowship with thee - With God. Shall they be united with thee; be sustained by thee; be regarded as a part of thine administration? Wilt thou sanction them? Wilt thou give to them thy patronage, as if they met with thine approbation? The Hebrew word means to be associated with, or allied to, and would be properly applied to a partnership, or anything where there is fellowship or alliance. The interrogative form here strongly implies that this \"cannot be.\" Such laws - such purposes - \"cannot\" be in accordance with the laws and authority of God; or, in other words, God does not sit on the same throne with those who authorize and by law sustain slavery, intemperance, and gambling. There can be no partnership here.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which frameth mischief by a law - The word rendered \"mischief\" usually means labor, toil; and then, trouble, vexation, sorrow. It may, however, be used to denote evil of any kind - crime, or wrong. The word rendered frameth means to form, to fashion, to make, as a potter does clay; Genesis 2:7-8, Genesis 2:19; or as a workman does statues, Isaiah 44:9-10, Isaiah 44:12; or as one makes weapons, Isaiah 54:17. It is often applied to God as the Creator. See the notes at Psalm 94:9 : \"he that formed the eye.\" The word law here means a rule or statute; and the idea is, that the iniquity referred to was not the result of an irregular and fitful impulse; or of passion; of sudden excitement; or of mere \"will\" in a particular case; but was reduced to statute, and sustained by law. The expression would apply to all those cases where evil is upheld by the government or by civil authority, or where those who are engaged in it can plead in their defense the sanction of law. The statement here is, that such acts \"cannot\" have fellowship with God, or receive his approval. It is an insult to God to suppose that he has ever appointed legislators or magistrates for the purpose of making or upholding such enactments. Yet there are many such laws in the world; and a main reason why it is so difficult to remove such evils as have been above referred to is the fact that they are sustained by law, and that they who hold slaves, or open gambling-houses, or sell intoxicating drinks, can plead the authority of the law; or, in other words, that the laws have done all they can to place such things on a level with those which \"ought\" to be protected by statute. Many a man in his business looks no further than to the laws of the land, and if he has their sanction, in vain is the attempt to induce him to abandon a business that leads to oppression, or that scatters woe and sorrow through a community. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which frameth mischief by a law - The word rendered \"mischief\" usually means labor, toil; and then, trouble, vexation, sorrow. It may, however, be used to denote evil of any kind - crime, or wrong. The word rendered frameth means to form, to fashion, to make, as a potter does clay; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or as a workman does statues, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or as one makes weapons, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is often applied to God as the Creator. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"he that formed the eye.\" The word law here means a rule or statute; and the idea is, that the iniquity referred to was not the result of an irregular and fitful impulse; or of passion; of sudden excitement; or of mere \"will\" in a particular case; but was reduced to statute, and sustained by law. The expression would apply to all those cases where evil is upheld by the government or by civil authority, or where those who are engaged in it can plead in their defense the sanction of law. The statement here is, that such acts \"cannot\" have fellowship with God, or receive his approval. It is an insult to God to suppose that he has ever appointed legislators or magistrates for the purpose of making or upholding such enactments. Yet there are many such laws in the world; and a main reason why it is so difficult to remove such evils as have been above referred to is the fact that they are sustained by law, and that they who hold slaves, or open gambling-houses, or sell intoxicating drinks, can plead the authority of the law; or, in other words, that the laws have done all they can to place such things on a level with those which \"ought\" to be protected by statute. Many a man in his business looks no further than to the laws of the land, and if he has their sanction, in vain is the attempt to induce him to abandon a business that leads to oppression, or that scatters woe and sorrow through a community. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. throne—power, rulers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "iniquity [and] mischief—both denote evils done to others, as Ps 94:21 explains.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "iniquity [and] mischief—both denote evils done to others, as Ps 94:21 explains.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20 Shall the throne of iniquity have fellowship with thee, which frameth mischief by a law?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21 They gather themselves together against the soul of the righteous, and condemn the innocent blood.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 94:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:20",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Shall the throne of iniquity have fellowship with thee?\" Such thrones there are, and they plead a right divine, but their claim is groundless, a fraud upon mankind and a blasphemy of heaven. God enters into no alliance with unjust authority, he gives no sanction to unrighteous legislation. \"Which frameth mischief by a law?\" They legalise robbery and violence, and then plead that it is the law of the land; and so indeed it may be, but it is a wickedness for all that. With great care men prepare enactments intended to put down all protests, so as to render wrong-doing a permanent institution, but one element is necessary to true conservatism, viz., righteousness; and lacking that, all their arrangements of the holders of power must come to an end, and all their decrees must in process of time be wiped out of the statute-book. Nothing can last for ever but impartial right. No injustice can be permanent, for God will not set his seal upon it, nor have any fellowship with it, and therefore down it must come, and happy shall be the day which sees it fall.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 94:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:21",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"They gather themselves together against the soul of the righteous,\" so many are there of them that they crowd their assemblies, and carry their hard measures with enthusiasm; they are the popular party, and are eager to put down the saints. In counsel, and in action, they are unanimous; their one resolve is to hold their own tyrannical position, and put down the godly party. \"And condemn the innocent blood.\" They are great at slander and false accusation, nor do they stick at murder; no crime is too great for them, if only they can trample on the servants of the Lord. This description is historically true in reference to persecuting times; it bas been fulfilled in England, and may be again if Popery is to advance in future time at the same rate as in the past few years. The dominant sect has the law on its side, and boasts that it is the national church; but the law which establishes and endows one religion rather than another is radically an injustice, God has no fellowship with it, and therefore the synagogue of Ritualism will yet be a stench in the nostrils of all sane men. What evil times are in store for us it is not for us to prophesy; it is ours to leave the matter in the hands of him who cannot be in fellowship with an oppressive system, and will not always endure to be insulted to his face by Popish idols, and their priests. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Wilt thou take part with the unrighteous powers of the world, who oppress thy people? It is true, they partake of thy name, being called gods, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 82:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 82:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but I know thou wilt not afford them thy protection and patronage, but wilt manifest thy justice and displeasure against them. This seems to have been one of those comfortable thoughts wherewith the psalmist delighted his soul, as he now said. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which frameth mischief; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who devise wicked devices, and lay heavy burdens upon men that are more righteous than themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By a law; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either by virtue of those unrighteous decrees which they have made in form of laws; or by false pretences of law. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; against all right, and the laws both of God and men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall the throne of iniquity have fellowship with thee,.... Or \"be joined with thee\", be \"partner with thee\" (f), as antichrist affects to be; who may well be called \"the throne of iniquity\", since the dragon, the old serpent, and Satan, gave him his power, seat, or throne, and great authority: his coming is after the working of Satan, with all deceivableness of unrighteousness; he sits and enacts, practices and countenances, all manner of iniquity; he sits in the temple of God, showing himself as if he was God; he claims all power in heaven and in earth; takes upon him to dispense with the laws of God and men, and makes new laws, and binds the consciences of men with them; presumes to forgive sin, which none but God can do; and to open the gates of heaven to whom he pleases; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but can these things be allowed of shall not such pride and arrogance, and horrible iniquity be punished with the utmost severity? doubtless it will: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which frameth mischief by a law? does all manner of mischief to men, without control, as if he had a law for doing it; or makes a law that all men shall worship him, or receive his mark in their right hand, or forehead; or else shall not buy or sell, yea, be killed; see Revelation 13:15, or \"against law\" (g); against the laws of God and man; for antichrist is , \"the lawless one\", spoken of in 2 Thessalonians 2:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which frameth mischief by a law? does all manner of mischief to men, without control, as if he had a law for doing it; or makes a law that all men shall worship him, or receive his mark in their right hand, or forehead; or else shall not buy or sell, yea, be killed; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or \"against law\" (g); against the laws of God and man; for antichrist is , \"the lawless one\", spoken of in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"an sociabitur tibi?\" Cocceius, Gejerus; \"num consociabitur?\" Michaelis. (g)  \"praeter statutum\", Piscator, Cocceius; \"contra statutum\", Gejerus; \"contra legem tuam\", Arab. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"an sociabitur tibi?\" Cocceius, Gejerus; \"num consociabitur?\" Michaelis. (g)  \"praeter statutum\", Piscator, Cocceius; \"contra statutum\", Gejerus; \"contra legem tuam\", Arab. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall the throne of iniquity have {n} fellowship with thee, which frameth mischief by a law?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall the throne of iniquity have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fellowship with thee, which frameth mischief by a law?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Though the wicked judges pretend justice in oppressing the Church, yet they do not have the authority of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though He may tolerate them for a time, it is inconceivable that Jehovah should let these rapacious judges shelter themselves under His authority. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The throne",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tribunal of destruction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note) denotes the rulers or judges who were ready like a yawning gulf to swallow up the innocent. They contrive wrong by statute, inflict injury and misery under the shelter of legal forms. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "20–23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The doom of tyrants and the deliverance of their victims.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 20-23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The destruction of the evil doers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There can be no fellowship between  light and darkness - between God and evildoers, especially those who carry out their wicked purposes under the forms of law (ver. 20), and go the length of condemning innocent blood (ver. 21). Such persons God, who defends the righteous (ver. 22), will assuredly bring to utter destruction (ver. 23). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall the throne of iniquity have fellowship with thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The interrogative is here, as so often, an emphatic negative. By \"the throne of iniquity\" is meant iniquity in high places, wickedness enthroned upon the judgment seat, and thence delivering its unjust sentences. Oppressors in Israel made a large use of the machinery of the law to crush and ruin their victims (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:1, 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Which frameth mischief by a law;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". which effects its mischievous purposes by means of the decrees of courts (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:10-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 94:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the sixth strophe the poet confidently expects the inevitable divine retribution for which he has earnestly prayed in the introduction. יחברך is erroneously accounted by many (and by Gesenius too) as fut. Pual  equals  יחבּרך  equals  יחבּר עמּך, a vocal contraction together with a giving up of the reduplication in favour of which no example can be advanced. It is fut. Kal  equals  יחברך, from יחבּר  equals  יחבּר, with the same regression of the modification of the vowel",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: By means of a similar transposition of the vowel as is to be assumed in תּאהבוּ, Proverbs 1:22, it also appears that מדוּבּין  equals  מוּסבּין (lying upon the table, ἀνακείμενοι) of the Pesach-Haggada has to be explained, which Joseph Kimchi finds so inexplicable that he regards it as a clerical error that has become traditional.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: By means of a similar transposition of the vowel as is to be assumed in תּאהבוּ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it also appears that מדוּבּין  equals  מוּסבּין (lying upon the table, ἀνακείμενοι) of the Pesach-Haggada has to be explained, which Joseph Kimchi finds so inexplicable that he regards it as a clerical error that has become traditional.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "as in יחנך  equals  יחנך in Genesis 43:29; Isaiah 30:19 (Hupfeld), but as in verbs primae gutturalis, so also in כּתבם, כּתבם, inflected from כּתב, Ew. ֗251, d. It might be more readily regarded as Poel than as Pual (like תּאכלנוּ, Job 20:26), but the Kal too already signifies to enter into fellowship (Genesis 14:3; Hosea 4:17), therefore (similarly to יגרך, Psalm 5:5) it is: num consociabitur tecum. כּסּא is here the judgment-seat, just as the Arabic cursi directly denotes the tribunal of God (in distinction from Arab. 'l-‛arš, the throne of His majesty). With reference to הוּות vid., on Psalm 5:10. Assuming that חק is a divine statute, we obtain this meaning for עלי־חק: which frameth (i.e., plots and executes) trouble, by making the written divine right into a rightful title for unrighteous conduct, by means of which the innocent are plunged into misfortune. Hitzig renders: contrary to order, after Proverbs 17:26, where, however, על־ישׁר is intended like ἕνεκεν δικαιοσύνης, Matthew 5:10. Olshausen proposes to read יגוּרוּ (Psalm 56:7; Psalm 59:4) instead of יגודּוּ, just as conversely Aben-Ezra in Psalm 56:7 reads יגודּוּ. But גּדד, גּוּד, has the secured signification of scindere, incidere (cf. Arab. jdd, but also chd, supra, p. 255), from which the signification invadere can be easily derived (whence גּדוּד, a breaking in, invasion, an invading host). With reference to דּם נקי vid., Psychology, S. 243 (tr. p. 286): because the blood is the soul, that is said of the blood which applies properly to the person. The subject to יגודו are the seat of corruption (by which a high council consisting of many may be meant, just as much as a princely throne) and its accomplices. Prophetic certainty is expressed in ויהי and ויּשׁב. The figure of God as משׂגּב is Davidic and Korahitic. צוּר מחסּי צוּר is explained from Psalm 18:2. Since השׁיב designates the retribution as a return of guilt incurred in the form of actual punishment, it might be rendered \"requite\" just as well as \"cause to return;\" עליהם, however, instead of להם (Psalm 54:7) makes the idea expressed in Psalm 7:17 more natural. On ברעתם Hitzig correctly compares 2 Samuel 14:7; 2 Samuel 3:27. The Psalm closes with an anadiplosis, just as it began with one; and אלהינוּ affirms that the destruction of the persecutor will follow as surely as the church is able to call Jahve its God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as in יחנך  equals  יחנך in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Hupfeld), but as in verbs primae gutturalis, so also in כּתבם, כּתבם, inflected from כּתב, Ew. ֗251, d. It might be more readily regarded as Poel than as Pual (like תּאכלנוּ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but the Kal too already signifies to enter into fellowship (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), therefore (similarly to יגרך, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") it is: num consociabitur tecum. כּסּא is here the judgment-seat, just as the Arabic cursi directly denotes the tribunal of God (in distinction from Arab. 'l-‛arš, the throne of His majesty). With reference to הוּות vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Assuming that חק is a divine statute, we obtain this meaning for עלי־חק: which frameth (i.e., plots and executes) trouble, by making the written divine right into a rightful title for unrighteous conduct, by means of which the innocent are plunged into misfortune. Hitzig renders: contrary to order, after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 17:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where, however, על־ישׁר is intended like ἕνεκεν δικαιοσύνης, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Olshausen proposes to read יגוּרוּ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") instead of יגודּוּ, just as conversely Aben-Ezra in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " reads יגודּוּ. But גּדד, גּוּד, has the secured signification of scindere, incidere (cf. Arab. jdd, but also chd, supra, p. 255), from which the signification invadere can be easily derived (whence גּדוּד, a breaking in, invasion, an invading host). With reference to דּם נקי vid., Psychology, S. 243 (tr. p. 286): because the blood is the soul, that is said of the blood which applies properly to the person. The subject to יגודו are the seat of corruption (by which a high council consisting of many may be meant, just as much as a princely throne) and its accomplices. Prophetic certainty is expressed in ויהי and ויּשׁב. The figure of God as משׂגּב is Davidic and Korahitic. צוּר מחסּי צוּר is explained from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Since השׁיב designates the retribution as a return of guilt incurred in the form of actual punishment, it might be rendered \"requite\" just as well as \"cause to return;\" עליהם, however, instead of להם (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") makes the idea expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " more natural. On ברעתם Hitzig correctly compares ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 3:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Psalm closes with an anadiplosis, just as it began with one; and אלהינוּ affirms that the destruction of the persecutor will follow as surely as the church is able to call Jahve its God. ",
            "children": []
          }
        ]
      }
    ]
  }
]