[{"num":1,"verse":"The word of the Lord that came to Hosea son of Beeri in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and in the days of Jeroboam son of Joash king of Israel."},{"num":2,"verse":"When the Lord first spoke with and through Hosea, the Lord said to him, Go, take to yourself a wife of harlotry and have children of [her] harlotry, for the land commits great whoredom by departing from the Lord."},{"num":3,"verse":"So he went and took Gomer the daughter of Diblaim, and she became pregnant and bore him a son."},{"num":4,"verse":"And the Lord said to him, Call his name Jezreel or God-sows, for yet a little while and I will avenge the blood of Jezreel and visit the punishment for it upon the house of Jehu, and I will put an end to the kingdom of the house of Israel."},{"num":5,"verse":"And on that day I will break the bow of Israel in the Valley of Jezreel."},{"num":6,"verse":"And [Gomer] conceived again and bore a daughter. And the Lord said to Hosea, Call her name Lo-Ruhamah or Not-pitied, for I will no more have love, pity, and mercy on the house of Israel, that I should in any way pardon them."},{"num":7,"verse":"But I will have love, pity, and mercy on the house of Judah and will deliver them by the Lord their God and will not save them by bow, nor by sword, nor by equipment of war, nor by horses, nor by horsemen."},{"num":8,"verse":"Now when [Gomer] had weaned Lo-Ruhamah [Not-pitied], she became pregnant [again] and bore a son."},{"num":9,"verse":"And the Lord said, Call his name Lo-Ammi [Not-my-people], for you are not My people and I am not your God."},{"num":10,"verse":"Yet the number of the children of Israel shall be as the sand of the sea, which cannot be measured or numbered; and instead of it being said to them, You are not My people, it shall be said to them, Sons of the Living God!"},{"num":11,"verse":"Then shall the children of Judah and the children of Israel be gathered together and appoint themselves one head, and they shall go up out of the land, for great shall be the day of Jezreel [for the spiritually reborn Israel, a divine offspring, the people whom the Lord has blessed.]"}]