[{"header":"The Lord God’s Message Through Hosea"},{"num":1,"verse":"This is the Lord’s message that came to Hosea son of Beeri during the time that Uzziah, Jotham, Ahaz, and Hezekiah were kings of Judah, and Jeroboam son of Joash was king of Israel."},{"num":2,"verse":"This was the Lord’s first message to Hosea. The Lord said, “Go, marry a prostitute who has had children as a result of her prostitution. Do this because the people in this country have acted like prostitutes—they have been unfaithful to the Lord.”"},{"header":"The Birth of Jezreel"},{"num":3,"verse":"So Hosea married Gomer daughter of Diblaim. She became pregnant and gave birth to a son for Hosea."},{"num":4,"verse":"The Lord said to Hosea, “Name him Jezreel, because soon I will punish the family of Jehu for the people he killed at Jezreel Valley. Then I will put an end to the kingdom of the nation of Israel."},{"num":5,"verse":"And at that time I will break Israel’s bow at Jezreel Valley.”"},{"header":"The Birth of Lo-Ruhamah"},{"num":6,"verse":"Then Gomer became pregnant again and gave birth to a daughter. The Lord said to Hosea, “Name her Lo-Ruhamah, because I will not show mercy to the nation of Israel anymore, nor will I forgive them."},{"num":7,"verse":"But I will show mercy to the nation of Judah. I will save them, but I will not use bows or swords or war horses and soldiers to save them. I will save them by my own power.”"},{"header":"The Birth of Lo-Ammi"},{"num":8,"verse":"After Gomer had finished nursing Lo-Ruhamah, she became pregnant again and gave birth to a son."},{"num":9,"verse":"Then the Lord said, “Name him Lo-Ammi, because you are not my people, and I am not your God.”"},{"header":"The Lord Speaks to the Nation of Israel"},{"num":10,"verse":"“In the future the number of the people of Israel will be like the sand of the sea, which you cannot measure or count. In the same place that God told them, ‘You are not my people,’ he will call them ‘children of the Living God.’"},{"num":11,"verse":"“Then the people of Judah and the people of Israel will be gathered together. They will choose one ruler for themselves, and their nation will be too large for the land. Jezreel’s day will be great!"}]