[{"header":"In The Fifteenth Year of Tiberius, John Is Sent Out By God"},{"num":3,"verse":"Now in the fifteenth year of the government of Tiberius Caesar— Pontius Pilate being-governor of Judea, and Herod being-tetrarch of Galilee, and Philip his brother being tetrarch of the region of Ituraea and Trachonitis, and Lysanias being tetrarch of Abilene, "},{"num":2,"verse":"in-the-time-of the high priest Annas and Caiaphas— the word of God came to John, the son of Zechariah, in the wilderness."},{"header":"John Proclaims a Baptism of Repentance, In Fulfillment of Isaiah"},{"num":3,"verse":"And he went into all the surrounding-region of the Jordan, proclaiming a baptism of repentance for the forgiveness of sins, "},{"num":4,"verse":"as it has been written in the book of the words of Isaiah the prophet [in Isa 40:3-5], “A voice of one shouting in the wilderness: ‘Prepare the way of the Lord; be making His paths straight. "},{"num":5,"verse":"Every valley will be filled and every mountain and hill will be made-low. And the crooked paths will become straight, and the rough will become smooth paths. "},{"num":6,"verse":"And all flesh will see the salvation of God’”. "},{"num":7,"verse":"Therefore he was saying to the crowds coming out to be baptized by him, “Brood of vipers— who showed you to flee from the coming wrath? "},{"num":8,"verse":"Therefore produce fruits worthy of repentance. And do not begin to say within yourselves, ‘We have Abraham as our father’. For I say to you that God is able to raise-up children for Abraham from these stones! "},{"num":9,"verse":"And indeed the axe is already lying at the root of the trees. Therefore every tree not producing good fruit is cut down and thrown into the fire”."},{"header":"The People Ask John What They Should Do To Produce Fruit Worthy of Repentance"},{"num":10,"verse":"And the crowds were questioning him, saying, “What then should we do?” "},{"num":11,"verse":"And having responded, he was saying to them, “Let the one having two tunics give to the one not having, and let the one having food be doing likewise”. "},{"num":12,"verse":"And tax collectors also came to be baptized. And they said to him, “Teacher, what should we do?” "},{"num":13,"verse":"And the one said to them, “Be collecting nothing more than the amount having been commanded”. "},{"num":14,"verse":"And ones serving-as-soldiers also were questioning him, saying, “And us, what should we do?” And he said to them, “Do not violently-extort anyone, nor extort-with-false-charges. And be content with your wages”."},{"header":"John Says One More Powerful Is Coming, Who Will Baptize With The Spirit And Fire"},{"num":15,"verse":"And while the populace was waiting-in-expectation and all were pondering in their hearts about John— if perhaps he might be the Christ— "},{"num":16,"verse":"John responded, saying to everyone, “I am baptizing you with water, but the One more powerful than me is coming, of Whom I am not fit to untie the strap of His sandals. He will baptize you with the Holy Spirit and fire— "},{"num":17,"verse":"Whose winnowing-tool is in His hand so as to clean-out His threshing floor and gather the wheat into His barn; but He will burn up the chaff with an inextinguishable fire”. "},{"num":18,"verse":"So indeed, while also exhorting many other things, he was announcing-good-news-to the people."},{"header":"Herod Locked Up John In Prison"},{"num":19,"verse":"But Herod the tetrarch— while being rebuked by him concerning Herodias, the wife of his brother, and concerning all the evil things which Herod did— "},{"num":20,"verse":"also added this to everything: he also locked-up John in prison."},{"header":"Jesus Was Baptized When All The People Were Baptized"},{"num":21,"verse":"And it came about when all the people were baptized, Jesus also having been baptized and praying, that the heaven was opened "},{"num":22,"verse":"and the Holy Spirit descended upon Him in a bodily form like a dove, and a voice came from heaven: “You are My beloved Son. With You I was well-pleased”."},{"header":"At About Age Thirty, Jesus Begins His Ministry"},{"num":23,"verse":"And Jesus Himself was, [when] beginning His ministry, about thirty years old, being a son, as it was being supposed, of Joseph, the son of Heli, "},{"num":24,"verse":"the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph, "},{"num":25,"verse":"the son of Mattathias, the son of Amos, the son of Nahum, the son of Hesli, the son of Naggai, "},{"num":26,"verse":"the son of Maath, the son of Mattathias, the son of Semein, the son of Josech, the son of Joda, "},{"num":27,"verse":"the son of Joanan, the son of Rhesa, the son of Zerubbabel, the son of Shealtiel, the son of Neri, "},{"num":28,"verse":"the son of Melchi, the son of Addi, the son of Cosam, the son of Elmadam, the son of Er, "},{"num":29,"verse":"the son of Joshua, the son of Eliezer, the son of Jorim, the son of Matthat, the son of Levi, "},{"num":30,"verse":"the son of Simeon, the son of Judah, the son of Joseph, the son of Jonam, the son of Eliakim, "},{"num":31,"verse":"the son of Melea, the son of Menna, the son of Mattatha, the son of Nathan, the son of David, "},{"num":32,"verse":"the son of Jesse, the son of Obed, the son of Boaz, the son of Sala, the son of Nahshon, "},{"num":33,"verse":"the son of Aminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, "},{"num":34,"verse":"the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor, "},{"num":35,"verse":"the son of Serug, the son of Reu, the son of Peleg, the son of Heber, the son of Shelah, "},{"num":36,"verse":"the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech, "},{"num":37,"verse":"the son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalaleel, the son of Cainan, "},{"num":38,"verse":"the son of Enosh, the son of Seth, the son of Adam, the son of God."}]