[{"num":3,"verse":"Now in the fifteenth year of the reign of Tiberius Caesar, Pontius Pilate being governor of Judea, and Herod being tetrarch of Galilee, and his brother Philip tetrarch of Iturea and of the region of Trachonitis, and Lysanias the tetrarch of Abilene,"},{"num":2,"verse":"Annas and Caiaphas being the high priests, the Word of God came unto John the son of Zacharias in the wilderness."},{"num":3,"verse":"And he came into all the country about the Jordan, preaching the baptism of repentance for the remission of sins,"},{"num":4,"verse":"as it is written in the book of the words of Isaiah the prophet, saying, “The voice of one crying in the wilderness: ‘Prepare ye the way of the Lord, make His paths straight."},{"num":5,"verse":"Every valley shall be filled, and every mountain and hill shall be brought low; and the crooked shall be made straight, and the rough ways shall be made smooth;"},{"num":6,"verse":"and all flesh shall see the salvation of God.’”"},{"num":7,"verse":"Then said he to the multitude who came forth to be baptized by him, “O generation of vipers! Who hath warned you to flee from the wrath to come?"},{"num":8,"verse":"Bring forth therefore fruits worthy of repentance, and begin not to say among yourselves, ‘We have Abraham as our father.’ For I say unto you, that God is able from these stones to raise up children unto Abraham."},{"num":9,"verse":"And now also the ax is laid unto the root of the trees. Every tree therefore which bringeth not forth good fruit is hewn down and cast into the fire.”"},{"num":10,"verse":"And the people asked him, saying, “What shall we do then?”"},{"num":11,"verse":"He answered and said unto them, “He that hath two coats, let him impart to him that hath none. And he that hath meat, let him do likewise.”"},{"num":12,"verse":"Then came also publicans to be baptized, and said unto him, “Master, what shall we do?”"},{"num":13,"verse":"And he said unto them, “Exact no more than that which is appointed you.”"},{"num":14,"verse":"And the soldiers likewise demanded of him, saying, “And what shall we do?” And he said unto them, “Do violence to no man, neither accuse any falsely; and be content with your wages.”"},{"num":15,"verse":"And as the people were in expectation, and all men mused in their hearts whether John was the Christ or not,"},{"num":16,"verse":"John answered, saying unto them all, “I indeed baptize you with water; but One mightier than I cometh, the straps of whose shoes I am not worthy to unloose. He shall baptize you with the Holy Ghost and with fire."},{"num":17,"verse":"His winnowing fan is in His hand, and He will thoroughly purge His floor and will gather the wheat into His garner; but the chaff He will burn with fire unquenchable.”"},{"num":18,"verse":"And with many other exhortations preached he unto the people."},{"num":19,"verse":"But Herod the tetrarch, being reproved by him because of Herodias, his brother Philip’s wife, and for all the evils which Herod had done,"},{"num":20,"verse":"added yet this above all, that he shut up John in prison."},{"num":21,"verse":"Now when all the people were baptized, it came to pass that Jesus also was baptized. And while He prayed the heaven was opened,"},{"num":22,"verse":"and the Holy Ghost descended in a bodily shape like a dove upon Him, and a voice came from Heaven, which said, “Thou Art My Beloved Son; In Thee I Am Well Pleased.”"},{"num":23,"verse":"And Jesus Himself had become about thirty years of age, being (as was supposed) the son of Joseph, who was the son of Heli,"},{"num":24,"verse":"who was the son of Matthat, who was the son of Levi, who was the son of Melchi, who was the son of Janna, who was the son of Joseph,"},{"num":25,"verse":"who was the son of Mattathias, who was the son of Amos, who was the son of Nahum, who was the son of Esli, who was the son of Naggai,"},{"num":26,"verse":"who was the son of Maath, who was the son of Mattathias, who was the son of Semei, who was the son of Joseph, who was the son of Juda,"},{"num":27,"verse":"who was the son of Joanna, who was the son of Rhesa, who was the son of Zerubbabel, who was the son of Shealtiel, who was the son of Neri,"},{"num":28,"verse":"who was the son of Melchi, who was the son of Addi, who was the son of Cosam, who was the son of Elmodam, who was the son of Er,"},{"num":29,"verse":"who was the son of Jose, who was the son of Eliezer, who was the son of Jorim, who was the son of Matthat, who was the son of Levi,"},{"num":30,"verse":"who was the son of Simeon, who was the son of Judah, who was the son of Joseph, who was the son of Jonan, who was the son of Eliakim,"},{"num":31,"verse":"who was the son of Melea, who was the son of Menan, who was the son of Mattatha, who was the son of Nathan, who was the son of David,"},{"num":32,"verse":"who was the son of Jesse, who was the son of Obed, who was the son of Boaz, who was the son of Salmon, who was the son of Nahshon,"},{"num":33,"verse":"who was the son of Amminadab, who was the son of Aram, who was the son of Hezron, who was the son of Perez, who was the son of Judah,"},{"num":34,"verse":"who was the son of Jacob, who was the son of Isaac, who was the son of Abraham, who was the son of Terah, who was the son of Nahor,"},{"num":35,"verse":"who was the son of Serug, who was the son of Reu, who was the son of Peleg, who was the son of Eber, who was the son of Shelah,"},{"num":36,"verse":"who was the son of Cainan, who was the son of Arphaxad, who was the son of Shem, who was the son of Noah, who was the son of Lamech,"},{"num":37,"verse":"who was the son of Methuselah, who was the son of Enoch, who was the son of Jared, who was the son of Mahalaleel, who was the son of Cainan,"},{"num":38,"verse":"who was the son of Enos, who was the son of Seth, who was the son of Adam, who was the son of God."}]