[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(32) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither in this world, neither in the world to come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The distinction was hardly the same for our Lord’s Jewish listeners as it has come to be with us. For them “this world”—better, perhaps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—was the time before the coming of the Christ; “the age to come” was that which was to follow it. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Our Lord thus stood on the boundary-line of the two ages, that of the Law and the Prophets, and that of the Kingdom of Heaven, and He declares that while all personal outrages to Himself as the Son of Man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Christ, are capable of forgiveness, this enmity against goodness, as good, shuts it out in both. Practically, however, the order of things since the first coming of the Christ has been one of slow and continuous growth, not of rapid and complete change. There has been no “age to come” such as the Jew dreamt of, and we still wait for its manifestation, and think of ourselves as still living in “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " world,” in “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " age,” and of the “world to come” as lying in the far future, or, for each individual soul, beyond the grave. Our Lord’s words, it may be noted, clearly imply that some sins wait for their full forgiveness, the entirely cancelling of the past, till the time of that “age to come” which shall witness the great and final Advent. Does this imply that repentance, and therefore pardon, may come in the state that follows death? We know not, and ask questions that we cannot answer, but the words at least check the harsh dogmatic answer in the negative. If one sin only is thus excluded from forgiveness in that “coming age,” other sins cannot stand on the same level, and the darkness behind the veil is lit up with at least a gleam of hope.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 12:32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whosoever speaketh a word against the Son of man ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In any other respect, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it shall be forgiven him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Upon his true repentance: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But whosoever speaketh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, in this manner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against the Holy Ghost ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— and most unreasonably ascribes his extraordinary and beneficent operations to the grand enemy of God and man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it shall not be forgiven him, neither",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in this world, neither in the world to come ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The original words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ουτε εν τουτω τω αιωνι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ουτε εν τω μελλοντι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither in this age, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or dispensation, (namely, the Jewish,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nor in the age, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or dispensation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, the Christian. Thus the clause is understood by Macknight, who considers it as importing, that “no expiation was provided for the blasphemy against the Holy Spirit, either under the Jewish or Christian dispensations.” But it seems rather to have been a mere proverbial expression among the Jews, for a thing that would never be done. Accordingly, in the parallel passage in Mark, we read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that shall blaspheme against the Holy Ghost hath never forgiveness, but is in danger of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is liable to, eternal damnation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is well known, that the Papists argue from this passage, for the remission of some sins in purgatory, after this life is ended, which are not remitted by God here. But “the Scripture,” says Whitby, “knows only two times for the remission of sins: one here upon earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the penitent and believing; and the other at the day of judgment, when the great Judge shall pronounce the sentence of absolution to all his faithful servants; Christ, therefore, here signifies, that this blasphemy shall neither obtain forgiveness now, nor at the great day of final accounts: that is, shall never be forgiven. It may be proper to observe here, that as no one call be pardoned for any sins but through Christ, and in consequence of faith in him, as the Son of God and Saviour of the world; and as none can believe in him as such that supposes he wrought his miracles by the aid of the devil; and as his miracles, united with his holy life, were the chief proofs of his divine mission; therefore, those who attributed them to Satan, were of course thereby precluded from believing on him, and of consequence from obtaining pardon.” Mr. Baxter’s paraphrase on the passage is to nearly the same purpose — thus: “All other sin and blasphemy against me, as I appear in my human nature, hath some excuse, and may be cured, and so pardoned: but seeing the great works of the Holy Ghost done by me, and to be done by my disciples, in miracles and sanctification, are the greatest evidences that God will give the world to convince them of the truth of my gospel; he that is convinced of the fact, that all these miracles and this holiness is wrought, and yet will deny it to be God’s attestation, and blasphemously insist that it is the work of the devil; this man rejects the greatest evidences, and shall have no greater, and so his infidelity is incurable, and aggravated with blasphemy and obstinacy, and will never be repented of, nor forgiven.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:31,32 Here is a gracious assurance of the pardon of all sin upon gospel terms. Christ herein has set an example to the sons of men, to be ready to forgive words spoken against them. But humble and conscientious believers, at times are tempted to think they have committed the unpardonable sin, while those who have come the nearest to it, seldom have any fear about it. We may be sure that those who indeed repent and believe the gospel, have not committed this sin, or any other of the same kind; for repentance and faith are the special gifts of God, which he would not bestow on any man, if he were determined never to pardon him; and those who fear they have committed this sin, give a good sign that they have not. The trembling, contrite sinner, has the witness in himself that this is not his case.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this place, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:28-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Jesus states the awful nature of the sin of which they had been guilty. That sin was the sin against the Holy Spirit. It consisted in charging him with being in league with the devil, or accusing him of working his miracles, not by the \"spirit\" or \"power\" of God, but by the aid of the prince of the devils. It was therefore a direct insult, abuse, or evil speaking against the Holy Spirit - the spirit by which Jesus worked his miracles. That this was what he intended by this sin, at that time, is clear from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"because they said he had an unclean spirit.\" All other sins - all speaking against the Saviour himself - might be remitted. But this sin was clearly against the Holy One; it was alleging that the highest displays of God's mercy and power were the work of the devil; and it argued, therefore, the deepest depravity of mind. The sin of which he speaks is therefore clearly stated. It was accusing him of working miracles by the aid of the devil, thus dishonoring the Holy Spirit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All manner of sin and blasphemy shall be forgiven - That is, only on condition that people repent and believe. If they continue in this sin they cannot be forgiven, Mark 16:16; Romans 2:6-9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All manner of sin and blasphemy shall be forgiven - That is, only on condition that people repent and believe. If they continue in this sin they cannot be forgiven, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:6-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Blasphemy - Injurious or evil speaking of God. See the notes at Matthew 9:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Blasphemy - Injurious or evil speaking of God. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A word against the Son of man - The Jews were offended at the humble life and appearance of the Saviour. They reproached him as being a Nazarene - sprung from Nazareth, a place from which no good was expected to proceed; with being a Galilean, from Galilee, a place from which no prophet came, John 7:52. Jesus says that reproaches of this kind could be pardoned. Reflections on his poverty, on his humble birth, and on the lowliness of his human nature might be forgiven; but for those which affected his divine nature, accusing him of being in league with the devil, denying his divinity, and attributing the power which manifestly implied divinity to the prince of fallen spirits, there could be no pardon. This sin was a very different thing from what is now often supposed to be the sin against the Holy Spirit. It was a wanton and blasphemous attack on the divine power and nature of Christ. Such a sin God would not forgive.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A word against the Son of man - The Jews were offended at the humble life and appearance of the Saviour. They reproached him as being a Nazarene - sprung from Nazareth, a place from which no good was expected to proceed; with being a Galilean, from Galilee, a place from which no prophet came, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jesus says that reproaches of this kind could be pardoned. Reflections on his poverty, on his humble birth, and on the lowliness of his human nature might be forgiven; but for those which affected his divine nature, accusing him of being in league with the devil, denying his divinity, and attributing the power which manifestly implied divinity to the prince of fallen spirits, there could be no pardon. This sin was a very different thing from what is now often supposed to be the sin against the Holy Spirit. It was a wanton and blasphemous attack on the divine power and nature of Christ. Such a sin God would not forgive.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Speaketh against the Holy Ghost - The word \"ghost\" means \"spirit,\" and probably refers here to the \"divine nature\" of Christ - the power by which he performed his miracles. There is no evidence that it refers to the third person of the Trinity; and the meaning of the whole passage may be: \"He that speaks against me as a man of Nazareth - that speaks contemptuously of my humble birth, etc., may be pardoned; but he that reproaches my divine nature, charging me with being in league with Satan, and blaspheming the power of God manifestly displayed \"by me,\" can never obtain forgiveness.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither in this world, nor in that which is to come - That is, as Mark expresses it, \"hath never forgiveness, but is in danger of eternal damnation.\" This fixes the meaning of the phrase. It means, then, not the future age or dispensation, known among the Jews as the world to come, but it means that the guilt will be unpardoned forever; that such is the purpose of God that he will not forgive a sin so direct, presumptuous, and awful. It cannot be inferred from this that any sins will be forgiven in hell. The Saviour meant simply to say that there were \"no possible circumstances\" in which the offender could obtain forgiveness. He certainly did \"not\" say that any sin unpardoned here would be pardoned hereafter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither in this world, nor in that which is to come - That is, as Mark expresses it, \"hath never forgiveness, but is in danger of eternal damnation.\" This fixes the meaning of the phrase. It means, then, not the future age or dispensation, known among the Jews as the world to come, but it means that the guilt will be unpardoned forever; that such is the purpose of God that he will not forgive a sin so direct, presumptuous, and awful. It cannot be inferred from this that any sins will be forgiven in hell. The Saviour meant simply to say that there were \"no possible circumstances\" in which the offender could obtain forgiveness. He certainly did \"not\" say that any sin unpardoned here would be pardoned hereafter. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32. And whosoever speaketh a word against the Son of man, it shall be forgiven him: but whosoever speaketh against the Holy Ghost, it shall not be forgiven him, neither in this world, neither in the world to come—In Mark the language is awfully strong, \"hath never forgiveness, but is in danger of eternal damnation\" (Mr 3:20)—or rather, according to what appears to be the preferable though very unusual reading, \"in danger of eternal guilt\"—a guilt which he will underlie for ever. Mark has the important addition (Mr 3:30), \"Because they said, He hath an unclean spirit.\" (See on [1279]Mt 10:25). What, then, is this sin against the Holy Ghost—the unpardonable sin? One thing is clear: Its unpardonableness cannot arise from anything in the nature of sin itself; for that would be a naked contradiction to the emphatic declaration of Mt 12:31, that all manner of sin is pardonable. And what is this but the fundamental truth of the Gospel? (See Ac 13:38, 39; Ro 3:22, 24; 1Jo 1:7, &c.). Then, again when it is said (Mt 12:32), that to speak against or blaspheme the Son of man is pardonable, but the blasphemy against the Holy Ghost is not pardonable, it is not to be conceived that this arises from any greater sanctity in the one blessed Person than the other. These remarks so narrow the question that the true sense of our Lord's words seem to disclose themselves at once. It is a contrast between slandering \"the Son of man\" in His veiled condition and unfinished work—which might be done \"ignorantly, in unbelief\" (1Ti 1:13), and slandering the same blessed Person after the blaze of glory which the Holy Ghost was soon to throw around His claims, and in the full knowledge of all that. This would be to slander Him with eyes open, or to do it \"presumptuously.\" To blaspheme Christ in the former condition—when even the apostles stumbled at many things—left them still open to conviction on fuller light: but to blaspheme Him in the latter condition would be to hate the light the clearer it became, and resolutely to shut it out; which, of course, precludes salvation. (See on [1280]Heb 10:26-29). The Pharisees had not as yet done this; but in charging Jesus with being in league with hell they were displaying beforehand a malignant determination to shut their eyes to all evidence, and so, bordering upon, and in spirit committing, the unpardonable sin.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 31,32. Mark repeateth the same, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 3:28,29, ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",29, ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " with no alteration as to the sense, and instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither in this world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither in the world to come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but is in danger of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eternal damnation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke hath something of it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And whosoever shall speak a word against the Son of man, it shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be forgive him: but unto him that blasphemeth against the Holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ghost it shall not be forgiven.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is a text (which) hath very much exercised great divines, and much more perplexed poor Christians in their fits of melancholy and under temptations. There is in it something asserted, that is, that all manner of sin and blasphemy shall be forgiven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 12:32.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whosoever speaketh a word against the Son of man, it shall be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forgiven; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, upon the terms other sins are forgiven, repentance and faith in Jesus Christ. By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here some would understand any ordinary man; but; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Christ never spake of any under the notion but himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. It had been no great news for Christ to have told them, that ordinary evil speaking against men should be forgiven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Doubtless by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man here Christ meaneth himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He declareth that sins of ignorance should be forgiven; though a man should blaspheme Christ, yet if he did it ignorantly, verily thinking he was no more than the son of man, it should, upon his repentance and faith in him, be forgiven: a text yielding exceeding great relief to souls labouring under the burden of their sins, and reflecting upon their aggravation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the difficulty lieth in the latter part of the text, which denieth forgiveness to any who blaspheme the Holy Ghost. Upon this arise several questions. First, What the sin against the Holy Ghost here specified was. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Answer:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not hard to gather this from the context, and what Mark addeth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 3:30, ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": " Because they said, He hath an unclean",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ was come amongst these persons to whom he speaketh; he had not only preached, but he had wrought many miraculous operations sufficient to convince them that he acted by the power and Spirit of God. They were not only convinced of it, so far as to acknowledge it, but they attributed these operations to the devil, and said he had a devil, and that he did what he did by the power of the devil. This, out of doubt, was their sin against the Holy Ghost, maliciously speaking to the highest reproach of the Holy Spirit, contrary to the rational conviction of their own consciences. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Hence ariseth a second question, Whether any such sin can be now committed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Answer:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If there were no other texts that seem to conclude, there may be such as those, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 6:4-6 10:26,27 1Jo 5:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 10:26,27 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 5:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where he speaketh of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a sin unto death, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the forgiveness of which he would not have Christians pray. I should conclude that there is no such sin now to be committed, for we cannot have such means of conviction as the Pharisees had, Christ not being on the earth now working miracles; but it is plain from the texts before mentioned, that there is such a sin, that men and women may yet incur the guilt of. But now what that sin is hath exercised the judgment of the greatest divines to describe. I shall not repeat the various opinions about it, many of which are easily confuted; but shall determine from the guidance of the scriptures that mention it, so far as they will direct in the finding of it out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. It cannot be any sin that is committed ignorantly. Paul was a blasphemer, but forgiven, because he did it ignorantly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. It must be a sin knowingly committed against the operations of the Holy Ghost. So was this sin of the Pharisees. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. Apostasy must be an ingredient in it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If they fall away, saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the apostle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Hebrews 6:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is a sinning wilfully after the receiving the knowledge of the truth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 10:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. It should seem by this text persecution is an ingredient in it: the Pharisees did not only say this, but they spake it out of malice, designing to destroy Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "5. Most certainly it is, that though impenitency cannot be called that sin, yet it must be an ingredient in it, for what sins we truly repent of shall be forgiven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1Jo 1:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 1:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and therefore the apostle saith of such sinners, It is impossible they should be renewed by repentance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Upon the whole then, if any person hath been instructed in the things of God, and hath made a profession of religion and godliness, and afterwards falleth off from his profession, and becomes a bitter enemy to it; saying that those things are the effects of the devil in men, which his heart telleth him are the operations of the Holy Spirit, and be so hardy as to persecute and seek to destroy such persons for such profession: the interpretation be to those that hate us and to the enemies of our God: if they have not committed this unpardonable sin, they have done what is very like it; and I know no way they have, but by a timely and hearty repentance to satisfy the world, or their own consciences, that they are not under this dreadful guilt. And that which confirms me in this opinion is, that we rarely hear of such persons renewed by repentance (if any instances of that nature at all can be produced). I know some have thought that this sin might be committed by words, without other overt acts, and indeed blaspheming (properly taken) can signify nothing else but evil or reproachful speaking. But these words must proceed from a malicious heart, full of rancour and revenge; for it is not every word, nor every blasphemy, that is here meant, it is (as Augustine saith) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "quoddam dictum, quaedam blasphemia, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a certain word, a certain blasphemy; not words spoken ignorantly or hastily, or according to our real judgment and opinion; but words spoken maliciously, in order to destroy God or Christ, if it were possible, after sufficient means of light and conviction, that the things which we speak evil of are not from the evil, but, probably at least, from the Holy Spirit of God, and yet we will impute them to the devil, in order to the defaming or destruction of those servants of God who do them, or in whom they are found. We can define nothing certain in the case, but this cometh nearest to the sin here mentioned, that shall never be forgiven in this world, or the world to come; that is, as Mark expounds it, the persons guilty shall be in danger of eternal damnation, by which he hath spoiled the papists’ argument from this text for their purgatory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And whosoever speaketh a word against the son of man,.... By whom is meant, not any man, as Grotius thought, but the Lord Jesus Christ, so often called \"the son of man\", on account of his human nature, in which he appeared in great meanness and obscurity. Now many might, through ignorance of him, thinking him to be a mere man, and taking up with common fame, speak evil of him, deny him to be the Messiah, reproach him for the meanness of his parentage and education, and for the freedom of his conversation with publicans and sinners; and do many things contrary to his name, as Saul, whilst a Pharisee did, and thought he ought to do; and yet be afterwards convinced of their mistakes, and be brought to a sense and acknowledgment of them, and obtain pardoning grace and mercy, as Saul did, though a blasphemer; and who is an instance of what is here promised, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it shall be forgiven him through the grace of God, the blood and mediation of Christ, under the application of the blessed Spirit. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But whosoever speaketh against the Holy Ghost, in the sense before declared, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it shall not be forgiven him: not because the Holy Ghost is greater than Christ; or for want of efficacy in the blood of Christ; or because God cannot pardon it; but because such persons wilfully, maliciously, and obstinately oppose the Spirit of God, without whom there can be no application of pardon made; and remain in hardness of heart, are given up to a reprobate mind, and die in impenitence and unbelief, and so there is no forgiveness for them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither in this world, nor in the world to come; that is; they shall never be forgiven, see Mark 3:29. The distinction here used, does not refer to a common one among the Jews, of the Jewish state and the times of the Messiah; but to the present state of life, and that which will be after, or upon death: and it does not suppose there may be forgiveness of other sins, though not of this, in the other world; but strikes at a notion the Jews had, that there are some sins, which repentance and the day of atonement expiate in this life; but there are others, which repentance and the day of atonement do not expiate; and these a man's death expiates, or makes atonement for (a). The form of confession used by sick persons is the following (b); ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither in this world, nor in the world to come; that is; they shall never be forgiven, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The distinction here used, does not refer to a common one among the Jews, of the Jewish state and the times of the Messiah; but to the present state of life, and that which will be after, or upon death: and it does not suppose there may be forgiveness of other sins, though not of this, in the other world; but strikes at a notion the Jews had, that there are some sins, which repentance and the day of atonement expiate in this life; but there are others, which repentance and the day of atonement do not expiate; and these a man's death expiates, or makes atonement for (a). The form of confession used by sick persons is the following (b); ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I confess before thee, O Lord our God, and the God of our fathers, that my cure is in thy hands, and my death is in thy hands; if it be thy good pleasure, heal me with a perfect healing: but if I die,  , \"let my death be for the pardon\", forgiveness, and atonement of all the sins, iniquities, and transgressions, which I have sinned, acted perversely in, and transgressed before thee; and give me my portion in paradise, and justify me \"in the world to come\", which is hidden for the righteous.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the sin against the Holy Ghost is such, as is not forgiven, neither before, nor at, nor after death, nor by it: all sins that are forgiven, are forgiven in this world, and that perfectly and at once; and all that are forgiven in this world, there will be a manifestation and declaration of the pardon of them in another; but such sins as are not forgiven here, there will be no declaration of the pardon of them hereafter. In short, the sense is, that the sin against the Holy Ghost never has forgiveness; it is not pardoned now, and consequently there will be no declaration of the pardon of it hereafter. The Jews use the phrase in the same sense (c); a certain sick man said to his son, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"give me water, and such certain food; but if not, I will not \"forgive thee, neither in this world, nor in the world to come\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That is, I will never forgive thee. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) T. Bab. Yoma, fol. 86. 1.((b) Seder Tephillot, fol. 333. 2. Ed. Basil. Vid. T. Bab. Beracot, fol. 60. 1.((c) Sepher Chasidim: num. 234. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) T. Bab. Yoma, fol. 86. 1.((b) Seder Tephillot, fol. 333. 2. Ed. Basil. Vid. T. Bab. Beracot, fol. 60. 1.((c) Sepher Chasidim: num. 234. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And whosoever speaketh a word against the Son of man, it shall be forgiven him: {6} but whosoever speaketh against the Holy Spirit, it shall not be forgiven him, neither in this world, neither in the world to come.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And whosoever speaketh a word against the Son of man, it shall be forgiven him: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{6}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but whosoever speaketh against the Holy Spirit, it shall not be forgiven him, neither in this world, neither in the ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "world",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to come.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) Of blasphemy against the Holy Spirit.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Κατὰ τοῦ υἱοῦ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνθρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", such as Daniel promised that the Messiah should be. In this case also (comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") this select expression indicates the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "majesty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Messiah in His human manifestation, in contrast to the hostile terms with which it has been assailed. Grotius and Fritzsche erroneously understand it as in contrast to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in general.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀφεθήσεται αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For if the hostile expressions are directed only against the person of the Messiah as such, not against the Holy Spirit who may be recognised in that person, even without our ascribing to it a Messianic character, it is possible that fuller knowledge, change, of disposition, faith, may be created by the Spirit’s own influence, whereupon the man will be forgiven. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ αἰὼν οὗτος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the period previous to the coming of the Messiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עוֹלָם הַזֶּה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as Jesus understood it: the time before the second coming. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὁ αἰὼν μέλλων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the period that succeeds the coming of the Messiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עוֹלָם הַבָּא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as Jesus understood it: the time that follows the second coming. Bertholdt, Christol. p. 38; Koppe, Exc. 1, ad Ep. ad Eph. p. 289 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὔτε ἐν τῷ μέλλοντι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] where it would be granted in the shape of acquittal in the judgment, combined with the eternal consequences of such acquittal (everlasting felicity). The threatening of a very different fate—that is to say, the thought of endless punishment—must not be in any way softened down (Chrysostom, de Wette). Schmid, bibl. Theol. I. p. 358 (comp. Olshausen and Stirm in the Jahrb. f. Deutsche Theol. 1861, p. 300), is quite mistaken in thinking that the period referred to is that between death and judgment, which, in fact, does not belong to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἰὼν μέλλων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". o serious a statement needs to be carefully guarded against misapprehension; therefore Jesus adds an explanatory declaration.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λόγον κατὰ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "υ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνθρώπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jesus distinguishes between a word against the Son of Man and a word against the Holy Ghost. The reference in the former is to Himself, presumably, though Mark at the corresponding place has “the sons of men,” and no special mention of a particular son of man. Christ gives the Pharisees to understand that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gravamen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of their offence is not that they have spoken evil of Him. Jesus had no exceptional sensitiveness as to personal offences. Nor did He mean to suggest that offences of the kind against Him were more serious or less easily pardonable than such offences against other men, say, the prophets or the Baptist. Many interpreters, indeed, think otherwise, and represent blasphemy against the Son of Man as the higher limit of the forgiveable. A grave mistake, I humbly think. Jesus was as liable to honest misunderstanding as other good men, in some respects more liable than any, because of the exceptional originality of His character and conduct. All new things are liable to be misunderstood and decried, and the best for a while to be treated as the worst. Jesus knew this, and allowed for it. Men might therefore honestly misunderstand Him, and be in no danger of the sin against the Holy Ghost (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Saul of Tarsus). On the other hand, men might dishonestly calumniate any ordinary good man, and be very near the unpardonable sin. It is not the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that makes the difference, but the source of the blasphemy. If the source be ignorance, misconception, ill-informed prejudice, blasphemy against the Son of Man will be equally pardonable with other sins. If the source be malice, rooted dislike of the good, selfish preference of wrong, because of the advantage it brings, to the right which the good seek to establish, then the sin is not against the man but against the cause, and the Divine Spirit who inspires him, and though the agent be but a humble, imperfect man, the sinner is perilously near the unpardonable point. Jesus wished the Pharisees to understand that, in His judgment, that was their position.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὔτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὔτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " analyse the negation of pardon, conceived as affecting both worlds, into its parts for sake of emphasis (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:34-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Dogmatic inferences, based on the double negation, to possible pardon after death, are precarious. Lightfoot (Hor. Heb.) explains the double negation by reference to the Jewish legal doctrine that, in contrast to other sins, profaning the name of God could be expiated only by death, unpardonable in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " life. Blasphemy against the Holy Ghost, says Jesus, in conscious antithesis, pardonable neither here nor there: “neque ante mortem, neque per mortem”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whosoever speaketh against the Holy Ghost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] To speak against the Holy Ghost is to speak against the clear voice of the Holy Ghost within the heart—wilful sin against knowledge. Jesus, who saw the heart, knew that the Pharisees were insincere in the charge which they brought against Him. They were attributing to Satan what they knew to be the work of God. Their former attacks against the Son of man had excuse; for instance, they might have differed conscientiously on the question of Sabbath observance, now they have no excuse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[574] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τοῦ υἱοῦ τοῦʼ Ανθρώπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of Man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This expression is used in accordance with our Lord’s condition as it appeared to men, inasmuch as He was then conversing with them on an equal footing, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as He is described in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. also Gnomon on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not therefore easy, in these times, to say anything against the Son of Man: it is more easy to commit blasphemy against the Holy Spirit.[575]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὔτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὔτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither—neither",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he shall in both drain to the dregs the most sure and most grievous punishment. See Chrysostom on this passage.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[574] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ ὅς ἐὰν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and whosoever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The words immediately preceding are hereby further explained and illustrated.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[575] Therefore their words were directed against the Son of man, when they spake insultingly concerning Him on account of His connection with Nazareth, on account of His lowly bearing and conversation, etc.; but it was against the Holy Spirit that those words of theirs were directed, whereby they brought allegations against His miracles, which were performed by the instrumentality of the Holy Spirit, and ascribed them to the powers of darkness. It was at that time especially, when Christ was sojourning in the midst of them, that men were able to incur the guilt of both kinds of sinful speeches. But what is the present state of those who, in our time, bring criminations against the good operations of the Holy Spirit in His instruments? Christians, no doubt, for their part have the Spirit, and besides His presence, are not without their own blemishes. If, then, any one brings charges against some Christian, perhaps he in a great degree sees only the blemishes of that Christian, and so in a less degree observes the good that is in him; and, therefore, he does not blaspheme against the Spirit in others, however grievously he sins in other respects. Christ Jesus, being endued with the Spirit beyond ail measure, had no foreign element at all intermixed; therefore the blasphemies with which He was assailed, were much more enormous sins.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 32.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Our Lord applies the general principle of ver. 31 to \"blasphemy\" against himself. This might be, comparatively speaking, innocuous if it was merely defamation or detraction of him as man; but if, on the other hand, it referred to his work in such a way as to mean a real detraction of God's actions considered as Divine, it indicated a state of feeling which did not admit of forgiveness (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If it be asked whether the individual Pharisees referred to in vers. 24-28 had committed this sin, the answer depends upon whether they had recognized the hand of God as such, and had, notwithstanding, wilfully rejected it. If they had - as our Lord's tone seems to imply - then they had in fact committed it. Yet they may afterwards have repented, and so have come under a different category. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And whosoever speaketh a word against the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his birth, the circumstances of his life on earth, or his decisions respecting the sabbath or meats, or his disregard of the conventionalities of his time in his treatment of \"sinners\" and publicans. All such things must have been included in those which St. Paul once blasphemed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall be forgiven him: but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "whosoever speaketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (such a word) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "against the Holy Ghost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Holy Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall not be forgiven him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οὐκ ἀφεθήσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The margin of Westcott and Hort, with the Vatican manuscript, represents it still more strongly (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οὐ μὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀφεθῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither in this world",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version margin), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "neither in the world to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"The age to come\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "העולם הבא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") included all that followed the coming of Messiah. Sometimes it was restricted to, or practically identified with, the reign of Messiah upon earth, but usually it included much more - eternity as well as time (see especially Weber, 'System,' pp. 354, 355; and cf. Schurer, II. 2:177). It is in its widest sense that our Lord here uses it - contrasting the present order of things with that which will be the final result of his coming, his thoughts travelling far beyond the present course of this world to that which is to be hereafter. Matthew 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Holy Spirit (τοῦ πνεύματος τοῦ ἁγίου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Spirit - the holy. These words define more clearly the blasphemy against the Spirit, Matthew 12:31. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Spirit - the holy. These words define more clearly the blasphemy against the Spirit, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]