[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The priests in the temple profane the sabbath.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The work of the priests, as described, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz., slaying victims, placing the shewbread, involved an amount of labour which, in work of any other kind, would have broken the Sabbath rest; yet no one blamed the priests, for they were serving in the Temple of Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 12:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have ye not read in the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He does not mean that the words following were to be found in the law, but only that they might read in the law, how the priests were obliged, on the sabbath days, to perform such servile work in the temple as, considered separately from the end of it, would have been a profanation of the sabbath, but really was not so, because it was necessary to the public worship of God, on account of which the sabbath was instituted. If it be asked what servile work the priests performed on the sabbath, the answer is obvious. On that day, as well as on other days, they made up the fires, killed, flayed, and dressed the sacrifices, and performed other pieces of manual labour necessary to the religious service which God had established among them. Nay, besides the continual burnt offering, the priests were obliged, on the sabbaths, to sacrifice two lambs extraordinary, by which their servile work was that day double of what it was on the other days of the week. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But in this place is one greater than the temple ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As if he had said, “If you reply that the priests were not culpable in those actions, because they were undertaken for the temple service, I acknowledge it; but at the same time I must observe, that if the temple, with its service, is of such importance as to merit a particular dispensation from the law of the sabbath, I and my disciples, whose business of promoting the salvation of men is a matter of more importance, may, on that account, with more reason take the same liberty in a case of the like necessity. According to this interpretation, the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μειζον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a greater work, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μειζων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a greater person, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which is authorized by many manuscripts, will have a peculiar elegance. Then the sense will be, ‘There is here a much more noble work carrying on than the temple service.’” — Macknight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-8 Being in the corn-fields, the disciples began to pluck the ears of corn: the law of God allowed it, De 23:25. This was slender provision for Christ and his disciples; but they were content with it. The Pharisees did not quarrel with them for taking another man's corn, but for doing it on the sabbath day. Christ came to free his followers, not only from the corruptions of the Pharisees, but from their unscriptural rules, and justified what they did. The greatest shall not have their lusts indulged, but the meanest shall have their wants considered. Those labours are lawful on the sabbath day which are necessary, and sabbath rest is to froward, not to hinder sabbath worship. Needful provision for health and food is to be made; but when servants are kept at home, and families become a scene of hurry and confusion on the Lord's day, to furnish a feast for visitors, or for indulgence, the case is very different. Such things as these, and many others common among professors, are to be blamed. The resting on the sabbath was ordained for man's good, De 5:14. No law must be understood so as to contradict its own end. And as Christ is the Lord of the sabbath, it is fit the day and the work of it should be dedicated to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How he entered into the house of God - That is, the \"tabernacle,\" the temple not being then built.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Have ye not read in the law? - In the law, or in the books of Moses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Profane the Sabbath - He referred them to the conduct of the priests also. On the Sabbath days they were engaged, as well as on other days, in killing beasts for sacrifice, Numbers 28:9-10. Two lambs were killed on the Sabbath, in addition to the daily sacrifice. The priests must be engaged in killing them, and making fires to burn them in sacrifice, whereas to kindle a fire was expressly forbidden the Jews on the Sabbath, Exodus 35:3. They did that which, for other persons to do, would have been \"profaning\" the Sabbath. Yet they were blameless. They did what was necessary and commanded. This was done in the very temple, too, the place of holiness, where the law should be most strictly observed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Profane the Sabbath - He referred them to the conduct of the priests also. On the Sabbath days they were engaged, as well as on other days, in killing beasts for sacrifice, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Two lambs were killed on the Sabbath, in addition to the daily sacrifice. The priests must be engaged in killing them, and making fires to burn them in sacrifice, whereas to kindle a fire was expressly forbidden the Jews on the Sabbath, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They did that which, for other persons to do, would have been \"profaning\" the Sabbath. Yet they were blameless. They did what was necessary and commanded. This was done in the very temple, too, the place of holiness, where the law should be most strictly observed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Or have ye not read in the law, how that on the sabbath days the priests in the temple profane the sabbath—by doing \"servile work.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and are blameless?—The double offerings required on the sabbath day (Nu 28:9) could not be presented, and the new-baked showbread (Le 24:5; 1Ch 9:32) could not be prepared and presented every sabbath morning, without a good deal of servile work on the part of the priests; not to speak of circumcision, which, when the child's eighth day happened to fall on a sabbath, had to be performed by the priests on that day. (See on [1269]Joh 7:22, 23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Neither Mark nor Luke have this argument of our Saviour’s. The meaning is, all acts of servile labour are not unlawful on the sabbath day. The priests, according to the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 28:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", offer sacrifices, and do many other acts, such as circumcising, and many other things, which in your sense would be a profanation of the sabbath; yet you do not blame them, neither are they to he blamed, because God permitted and directed them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If any say, \"But how doth this agree to what our Saviour is speaking to?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Answer:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The disciples of Christ were employed with and by him in going about and preaching the gospel, and what they now did was but in order to fit them for his work, when they had not had such leisure as others beforehand to provide: and this establisheth a second rule, That works of piety, and tending to fit us for acts of piety, that cannot conveniently be done before, are lawful on the sabbath day. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Or have ye not read in the law,.... ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by which law the priests were obliged, every sabbath day, to offer up two lambs for a burnt offering; to which were annexed many servile works, as killing the sacrifice, flaying it, cutting it in pieces, and laying it on the altar, cutting of wood, and putting that in order, and kindling the fire: from all which, it might be observed, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "how that on the sabbath days, the priests in the temple profane the sabbath, and are blameless. There were many things, which, according to the Jewish canons, the priests might do on the sabbath day; particularly they might slay the sacrifice: it was a rule with them,    , \"that slaying drives away the sabbath\" (u). They might also knead, make, and bake the showbread on the sabbath day: their general rule was, as R. Akiba says, that what was possible to be done on the evening of the sabbath, did not drive away the sabbath; but what was not possible to be done on the sabbath eve, did drive away the sabbath (w): so they might kill the passover, sprinkle its blood, wipe its inwards, and burn the fat on the sabbath day (x), with many other things. What exculpated these men was, that what they did was done in the temple, and for the service of it, upon which an emphasis is put; and agrees with their canons, which say, that there is no prohibition in the sanctuary;    , \"that which is forbidden to be done on the sabbath, is lawful to be done in the sanctuary\" (y): and whereas, it might be objected to the disciples of Christ, that they were not priests; and what they did was not in the temple, but in the fields; to this it is replied, in the following words: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) T. Bab. Menachot, fol. 72. 2.((w) Misn. Menachot, c. 11. sect. 3.((x) Misn. Pesachim, c. 6. sect. 1. Maimon. Pesach. c. 1. sect. 18. (y) lb. sect. 16. & Hilchot Sabbat, c. 21. sect. 27. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) T. Bab. Menachot, fol. 72. 2.((w) Misn. Menachot, c. 11. sect. 3.((x) Misn. Pesachim, c. 6. sect. 1. Maimon. Pesach. c. 1. sect. 18. (y) lb. sect. 16. & Hilchot Sabbat, c. 21. sect. 27. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Or have ye not read in the law, how that on the sabbath days the priests in the temple {b} profane the sabbath, and are blameless?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Or have ye not read in the law, how that on the sabbath days the priests in the temple ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " profane the sabbath, and are blameless?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) When the priests do God's service on the sabbath day, they do not break the law: much less does the Lord of the Sabbath break the sabbath.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀνέγνωτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βεβηλοῦσι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] that is, if one were consistently to judge according to your precepts, which forbid every sort of work on the Sabbath as being a desecration of that day. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βεβηλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profanant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and see Schleusner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I. p. 558.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". his reference to the priests naturally leads on to the second instance taken from their systematic breach of the technical Sabbath law in the discharge of sacerdotal duty.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἢ οὐκ ἀνέγνωτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", have ye not read? not of course the statement following, but directions on which such a construction could be put, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", concerning the burnt offering of two lambs. They had read often enough, but had not understood. As Euthy. Zig. remarks, Jesus reproaches them for their vain labour, as not understanding what they read (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ ἐπιγινώσκουσιν ἃ ἀναγινώσκουσι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βεβηλοῦσι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", profane, on the Pharisaic view of the Sabbath law, as an absolute prohibition of work. Perhaps the Pharisees themselves used this word as a technical term, applicable even to permissible Sabbath labour. So Schanz after Schöttgen.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the priests in the temple profane the sabbath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] by labour in removing the shewbread, preparing fire for the sacrifice, and performing the whole temple service. “Not merely does the sacred ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "history",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " relate exceptional instances of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "necessity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself ordains labour on the Sabbath as a duty” (Stier).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἢ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ νόμῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[551] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He proceeds step by step to a more stringent argument, from the example of the Prince, which the priest had approved, to the Law itself; from the prophets, even the earlier, parts of whom were read, to the Law, all of which was read; and from the sacred food to the sacred day, concerning which the dispute arose.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ ἱερεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the priests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") who ought especially to maintain the law, yet in this matter are especially excepted. Thus also, the priests of Christ are less bound to the Sabbath than the remaining multitude.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ ἱερῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Whilst they are employed in sacred rites.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βεβηλοῦσι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profane",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") (verb); the adjective ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βέβηλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profane",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is opposed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἅγιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", nor does it always imply impurity or guilt.—See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[551] At that very time of year Leviticus was being read on the Sabbaths, the book in which there occur so many precepts as to sacrifices, which were required to be performed even on the Sabbath.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Matthew only. Or. A second example, if the first does not convince you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Have ye not read in the Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Beyond which there is no appeal. Jewish authors often appeal to Scripture in the order of Hagio-graphs, Prophets, and, last of all, Law. He here refers to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 24:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 9:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but Bengel's suggestive remark that Leviticus was read in the services at that very time of year is vitiated by the double uncertainty, first, what time of year it really was; and secondly, what is the antiquity of the present custom of reading the whole Law every year (cf. Dr. Lumby on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'Add. Note'). According to the express orders of the Law, the priests put in fresh shewbread on the sabbath day. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "How that on the sabbath days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the priests in the temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word of wider import is used (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἱερόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σκηνή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), because the Law still holds good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Profane the sabbath.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If their work is regarded in itself, as the action of my disciples is now regarded. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And are blameless?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "guiltless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version, as also the Authorized Version in ver. 7); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the eyes of the Law. This you will all grant (cf. Schurer, II. 2:103). Lightfoot's ('Her. Hebr.') attractive quotation from Maimonides in ' Pesachim,' 1. (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 'Hilkoth Korban Pesach,' § 1.), \"There is no sabbatism at all in the temple,\" appears to rest on a misunderstanding. Matthew 12:5",
        "children": []
      }
    ]
  }
]