[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The God of Israel grant thee thy petition.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The character of Eli is a deeply interesting one. Weak and over-indulgent to his headstrong, wicked sons, probably too self-indulgent, and a lover of ease, yet in the brief record we possess we catch eight of not a few noble thoughts and wishes: flashes of true nobility, real generosity and self-forgetfulness, of intense, devoted patriotism, light up a life which closed in failure and disaster. Here the old man is quick to see that he had been insulting a blameless woman, so at once he retracts his cruel accusation, and silently accuses himself of precipitancy and injustice in his graceful, courteous words of farewell; adding too his fatherly wish, he almost promises that what she wished so ardently should be hers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 1:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 1:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Eli said, Go in peace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Her modest and respectful answer fully satisfied him, and he prayed that God would grant her petition, or, as the Chaldee interprets his words, assured her, that the God of Israel would grant it her. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let thy handmaid find grace in thy sight —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That favourable opinion and gracious prayer which thou hast expressed on my behalf, be pleased to continue toward me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Her countenance was no more sad — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Her heart being cheered by the priest’s comfortable words, and especially by the Spirit of God applying them to her mind, and inspiring her with confidence, that both his and her prayers would be heard, she departed from the tabernacle with such satisfaction and assurance, that there no longer remained any token of sorrow or grief in her countenance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:9-18 Hannah mingled tears with her prayers; she considered the mercy of our God, who knows the troubled soul. God gives us leave, in prayer, not only to ask good things in general, but to mention that special good thing we most need and desire. She spoke softly, none could hear her. Hereby she testified her belief of God's knowledge of the heart and its desires. Eli was high priest, and judge in Israel. It ill becomes us to be rash and hasty in censures of others, and to think people guilty of bad things while the matter is doubtful and unproved. Hannah did not retort the charge, and upbraid Eli with the wicked conduct of his own sons. When we are at any time unjustly censured, we have need to set a double watch before the door of our lips, that we do not return censure for censure. Hannah thought it enough to clear herself, and so must we. Eli was willing to acknowledge his mistake. Hannah went away with satisfaction of mind. She had herself by prayer committed her case to God, and Eli had prayed for her. Prayer is heart's ease to a gracious soul. Prayer will smooth the countenance; it should do so. None will long remain miserable, who use aright the privilege of going to the mercy-seat of a reconciled God in Christ Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and note. She means that wine was not the cause of her present discomposure, but grief of heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12-18. Eli marked her mouth—The suspicion of the aged priest seems to indicate that the vice of intemperance was neither uncommon nor confined to one sex in those times of disorder. This mistaken impression was immediately removed, and, in the words, \"God grant,\" or rather, \"will grant,\" was followed by an invocation which, as Hannah regarded it in the light of a prophecy pointing to the accomplishment of her earnest desire, dispelled her sadness, and filled her with confident hope [1Sa 1:18]. The character and services of the expected child were sufficiently important to make his birth a fit subject for prophecy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Go in peace; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I recall my censure, and give thee my blessing, and wish thee peace, i.e. a quiet and composed mind, free from whatsoever it is that grieves and oppresses thee; and withal, good success and prosperity in what thou desirest; for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a very comprehensive word among the Hebrews. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Grant, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will grant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for it may be either a prayer or a prediction, which he might deliver, either from the consideration of God’s known goodness and readiness to hear prayers; or he might be directed to say so by a special instinct of God’s Spirit, which sometimes was given to the high priests, even when they were wicked, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " John 11:51",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and much more when they were holy men, as Eli was. And some add, that he was a prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Eli answered and said, go in peace,.... He found he was mistaken in her, and that her discourse was not only sober and rational, but religious and spiritual; and therefore dismisses her in peace, and bids her not distress herself with what he had said to her, nor with anything she had met with from others, or from the Lord; but expect peace and prosperity, and particularly success in what she had been engaged, and had been solicitous for: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the God of Israel grant thee thy petition that thou hast asked of him; which may be considered either as a prayer for her, he joining with her in a request to the Lord, that what she had asked might be granted; or as a prophecy that so it would be, it being revealed to him by the Holy Ghost, as the high priest of the Lord; or impressed by an impulse upon his spirit that the favour asked would be given; and therefore she might go home in peace, and with satisfaction of mind. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the God of Israel grant thee thy petition that thou hast asked of him; which may be considered either as a prayer for her, he joining with her in a request to the Lord, that what she had asked might be granted; or as a prophecy that so it would be, it being revealed to him by the Holy Ghost, as the high priest of the Lord; or impressed by an impulse upon his spirit that the favour asked would be given; and therefore she might go home in peace, and with satisfaction of mind. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Eli answered and said, Go in peace: and the God of Israel grant thee thy petition that thou hast asked of him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Eli then replied: \"Go in peace, and the God of Israel give (grant) thy request (שׁלתך for שׁאלתך), which thou hast asked of Him.\" This word of the high priest was not a prediction, but a pious wish, which God in His grace most gloriously fulfilled. ",
        "children": []
      }
    ]
  }
]