[{"header":"Israel Complains"},{"num":11,"verse":"Eventually, the people began complaining about their distress, and the Lord heard them. When the Lord heard, his anger flared up and the Lord’s fire incinerated some of them within the outskirts of the camp. "},{"num":2,"verse":"When the people cried out to Moses, he prayed to the Lord and the fire stopped. "},{"num":3,"verse":"He then named that place Taberah, because the Lord’s fire had incinerated some of them."},{"num":4,"verse":"Meanwhile, certain riff-raff among the people had an insatiable appetite for food. As a result, they wept and turned back, and the Israelis cried out, “If only somebody would feed us some meat! "},{"num":5,"verse":"How we remember the fish that we used to eat in Egypt for free! And the cucumbers, melons, leeks, onions, and garlic! "},{"num":6,"verse":"But now we can’t stand it anymore, because there’s nothing in front of us except this manna.”"},{"num":7,"verse":"Now manna was reminiscent of coriander seed, with an appearance similar to amber. "},{"num":8,"verse":"People would go out to gather it, then they would grind it in mills or pound it in mortars, and then they would boil it in pots or make cakes out of it that tasted like butter cakes. "},{"num":9,"verse":"When the dew fell in the camp, the manna came with it."},{"header":"Moses Responds"},{"num":10,"verse":"Moses heard the people weeping throughout their entire families. Everyone gathered at the entrance to their tents so that the Lord was very angry. Moses thought the situation was bad, "},{"num":11,"verse":"so he asked the Lord, “Why did you bring all this trouble to your servant? Why haven’t I found favor in your eyes? After all, you’re putting the burden of this entire people on me! "},{"num":12,"verse":"Did I conceive this people or give birth to them, so that you would tell me to carry them near my heart like a wet nurse carries a suckling baby to the land that you promised to their forefathers? "},{"num":13,"verse":"Where am I going to get meat to give this people? After all, they’re crying in front of me, ‘Give us meat to eat!’ "},{"num":14,"verse":"I cannot carry this whole nation! The burden is too heavy for me! "},{"num":15,"verse":"If this is how you treat me, please kill me right now, if I’ve found favor in your eyes, because I don’t want to keep staring at all of this misery!”"},{"header":"The Appointment of 70 Elders"},{"num":16,"verse":"Then the Lord told Moses, “Gather together for me 70 men who are elders of Israel, men whom you know to be elders of the people and officers over them. Then bring them to the Tent of Meeting and let them stand there with you. "},{"num":17,"verse":"Then I’ll come down and speak with you. I’ll take some of the spirit that rests on you and apportion it among them, so that they may help you bear the burden of the people. That way, you won’t bear it by yourself.”"},{"header":"God Threatens to Provide Meat"},{"num":18,"verse":"“But give this command to the people: ‘You are to consecrate yourselves, because tomorrow you’re going to eat meat, since you’ve complained where the Lord can hear it, “Who can give us meat to eat? After all, life was better with us in Egypt.” Therefore, the Lord is going to give you meat and you’ll eat— "},{"num":19,"verse":"not only for a day, or for two days, or for five days, or for ten days, or for 20 days, "},{"num":20,"verse":"but for a whole month—until it comes out your nostrils and makes you vomit. This is because you’ve despised the Lord, who is among you, and you cried out in his presence by complaining, “Why did we ever leave Egypt?”’”"},{"header":"Moses Doubts God’s Ability"},{"num":21,"verse":"Moses responded, “I’m with 600,000 people on foot and you’re saying I am to give them enough meat to eat for a whole month? "},{"num":22,"verse":"What if we were to slaughter our entire inventory of flocks and herds for them? Would that be enough? What if we could gather all the fish in the sea in nets for them? Would that be enough, either?”"},{"header":"God Rebukes Moses"},{"num":23,"verse":"But the Lord responded to Moses, “Is the Lord short on power? You’re now going to witness whether what I say will come to pass or not.”"},{"num":24,"verse":"So Moses went out and told the people what the Lord had said. He gathered 70 men from the elders of the people and stationed them around the tent. "},{"num":25,"verse":"The Lord came down in a cloud, spoke to Moses, and made an apportionment from the spirit who rested on him to the 70 elders. When the spirit rested on them, they prophesied, but that was it."},{"num":26,"verse":"Now two men had remained in camp. One was named Eldad and the other was named Medad. When the spirit rested on them, since they were among those who were listed but had not gone out to the tent, they stayed behind and prophesied in the camp. "},{"num":27,"verse":"A young man ran and reported to Moses, “Eldad and Medad are prophesying in the camp!”"},{"num":28,"verse":"In response, Nun’s son Joshua, Moses’ attendant and one of his choice men, exclaimed, “My master Moses! Stop them!”"},{"num":29,"verse":"“Are you jealous on account of me?” Moses asked in reply. “I wish all of the Lord’s people were prophets and that the Lord would put his spirit upon them!” "},{"num":30,"verse":"Then Moses—that is, he and the elders of Israel—returned to the camp."},{"header":"Quails Come to the Camp"},{"num":31,"verse":"Just then, a wind burst forth from the Lord, who brought quails from the sea and spread them all around the camp, about a day’s journey in each direction, completely encircling the camp about two cubits deep on top of the ground! "},{"num":32,"verse":"The people stayed up all that day, all that night, and all through the next day, gathering quails. The one who gathered least gathered enough to fill ten omers, as they spread out all around the camp. "},{"num":33,"verse":"But even as they were chewing the meat and before they had swallowed it, the Lord became very angry with the people and struck them with a disastrous plague. "},{"num":34,"verse":"That’s why the place was named Kibroth-hattaavah, because they buried the people there who had an insatiable appetite for meat. "},{"num":35,"verse":"Later, the people left Kibroth-hattaavah for Hazeroth and camped there."}]