[{"num":11,"verse":"¶ And it came to pass that the people complained in an evil manner in the ears of the LORD, and the LORD heard it; and his anger was kindled, and the fire of the LORD burnt among them and consumed in the uttermost parts of the camp."},{"num":2,"verse":"Then the people cried unto Moses, and when Moses prayed unto the LORD, the fire was quenched."},{"num":3,"verse":"And he called the name of the place Taberah because the fire of the LORD burnt among them."},{"num":4,"verse":"¶ And the vulgar who were mixed in among them returned to their lust; and even the sons of Israel wept and said, Who shall give us flesh to eat?"},{"num":5,"verse":"We remember the fish, which we freely ate in Egypt, the cucumbers and the melons and the leeks and the onions and the garlic,"},{"num":6,"verse":"but now our soul is dried away; there is nothing at all besides this manna before our eyes."},{"num":7,"verse":"And the manna was as coriander seed, and the colour thereof as the colour of bdellium."},{"num":8,"verse":"And the people scattered about and gathered it and ground it in mills or beat it in a mortar and baked it in pans and made cakes of it, and the taste of it was as the taste of fresh oil."},{"num":9,"verse":"And when the dew fell upon the camp in the night, the manna fell upon it."},{"num":10,"verse":"Then Moses heard the people weep throughout their families, each man in the door of his tent; and the anger of the LORD was kindled greatly; Moses also was displeased."},{"num":11,"verse":"And Moses said unto the LORD, Why hast thou afflicted thy slave and why have I not found grace in thy sight, that thou layest the burden of all these people upon me?"},{"num":12,"verse":"Have I conceived all these people? Have I begotten them, that thou should say unto me, Carry them in thy bosom, as a nurse carries a sucking child, unto the land which thou hast sworn unto their fathers?"},{"num":13,"verse":"Where should I find flesh to give unto all these people? For they weep unto me, saying, Give us flesh that we may eat."},{"num":14,"verse":"I am not able to bear all these people alone because it is too heavy for me."},{"num":15,"verse":"And if thou must deal thus with me, kill me, I pray thee, out of hand, if I have found grace in thy sight; and let me not see my wretchedness."},{"num":16,"verse":"¶ Then the LORD said unto Moses, Gather unto me seventy men of the elders of Israel, whom thou knowest to be elders of the people, and their princes; and bring them unto the tabernacle of the testimony that they may stand there with thee."},{"num":17,"verse":"And I will come down and talk with thee there, and I will take of the spirit which is in thee and will put it upon them, and they shall bear the burden of the people with thee, that thou bear it not thyself alone."},{"num":18,"verse":"But thou shalt say unto the people, Sanctify yourselves for tomorrow, and ye shall eat flesh, for ye have wept in the ears of the LORD, saying, Who shall give us flesh to eat? for it was better with us in Egypt. Therefore the LORD will give you flesh, and ye shall eat."},{"num":19,"verse":"Ye shall not eat one day nor two days nor five days neither ten days nor twenty days,"},{"num":20,"verse":"But even a whole month, until it comes out of your nostrils and it becomes loathsome unto you, because ye have despised the LORD who is among you and have wept before him, saying, Why have we come forth out of Egypt?"},{"num":21,"verse":"Then Moses said, The people, among whom I am, are six hundred thousand footmen, and thou hast said, I will give them flesh that they may eat a whole month!"},{"num":22,"verse":"Shall sheep and oxen be slain for them, to suffice them? Or shall all the fish of the sea be gathered together for them, to suffice them?"},{"num":23,"verse":"Then the LORD said unto Moses, Is the LORD’s hand waxed short? Thou shalt see now whether my word shall come to pass unto thee or not."},{"num":24,"verse":"¶ And Moses went out and told the people the words of the LORD and gathered the seventy men of the elders of the people and set them round about the tabernacle."},{"num":25,"verse":"Then the LORD came down in the cloud and spoke unto him and took of the spirit that was in him and gave it unto the seventy elders, and it came to pass that when the spirit rested upon them, they prophesied and did not cease."},{"num":26,"verse":"But there remained two of the men in the camp, the name of the one was Eldad and the name of the other Medad, upon whom the spirit also rested; and they were of those that were written, but they had not gone unto the tabernacle; and they began to prophesy in the camp."},{"num":27,"verse":"And a young man ran and told Moses, and said, Eldad and Medad prophesy in the camp."},{"num":28,"verse":"Then Joshua the son of Nun, the minister of Moses, one of his young men, answered and said, My lord Moses, forbid them."},{"num":29,"verse":"And Moses said unto him, Art thou jealous for my sake? It would be good that all the LORD’s people were prophets and that the LORD would put his spirit upon them!"},{"num":30,"verse":"And Moses withdrew into the camp, he and the elders of Israel."},{"num":31,"verse":"¶ And there went forth a wind from the LORD and brought quail from the sea and left them upon the camp, a day’s journey on this side and a day’s journey on the other side, round about the camp and almost two cubits high upon the face of the earth."},{"num":32,"verse":"Then the people stood up all that day and all that night and all the next day, and they gathered the quail; he that gathered least gathered ten heaps, and they spread them all abroad for themselves round about the camp."},{"num":33,"verse":"And while the flesh was yet between their teeth, before it was chewed, the wrath of the LORD was kindled against the people, and the LORD smote the people with a very great plague."},{"num":34,"verse":"And he called the name of that place Kibrothhattaavah because there they buried the people that lusted."},{"num":35,"verse":"From Kibrothhattaavah he moved the people unto Hazeroth, and they abode at Hazeroth."}]