[{"header":"The Children of Israel Complain"},{"num":11,"verse":"Now the people complained about their troubles in the hearing of the Lord. When the Lord heard it, His anger burned. The fire of the Lord burned among them, and destroyed some around the outer parts of the tents. "},{"num":2,"verse":"Then the people cried to Moses and he prayed to the Lord, and the fire went out. "},{"num":3,"verse":"So the name of that place was called Taberah, because the fire of the Lord burned among them."},{"num":4,"verse":"The mixed group of people among them had strong desires. The people of Israel cried again and said, “Who will give us meat to eat? "},{"num":5,"verse":"We remember all the fish we could eat free in Egypt, and all the fruit and vegetables and spices. "},{"num":6,"verse":"But now our strength is gone. There is nothing at all to look at except this bread from heaven.” "},{"num":7,"verse":"Now the bread from heaven was like coriander seed, and it looked like bdellium. "},{"num":8,"verse":"The people would go and gather it and beat it between stones. They boiled it in a pot or made bread with it. It tasted like bread made with oil. "},{"num":9,"verse":"When the grass became wet around the tents at night, the bread from heaven would fall."},{"num":10,"verse":"Moses heard all the people crying in every family, each man at the door of his tent. The Lord became very angry with them and Moses was not pleased. "},{"num":11,"verse":"So Moses said to the Lord, “Why have You been so hard on Your servant? Why have I not found favor in Your eyes, that You have laid the troubles of all these people on me? "},{"num":12,"verse":"Did I give birth to all these people? Did I bring them out, that You should say to me, ‘Carry them close to your heart as a nurse carries a nursing baby, to the land You promised their fathers’? "},{"num":13,"verse":"Where am I to get meat to give to all these people? They cry in front of me, saying, ‘Give us meat so we may eat!’ "},{"num":14,"verse":"I am not able to carry all these people alone. The load is too heavy for me. "},{"num":15,"verse":"So if You are going to act this way toward me, I beg You to kill me now, if I have found favor in Your eyes. Do not let me see how bad off I am.”"},{"header":"The Seventy Leaders"},{"num":16,"verse":"The Lord said to Moses, “Gather for Me seventy men from the leaders of Israel, whom you know to be the leaders of the people, the men who rule over them. Bring them to the meeting tent and let them stand there with you. "},{"num":17,"verse":"Then I will come down and speak with you there. I will take of the Spirit Who is upon you, and will put Him upon them. Then they will carry the troubles of the people with you so you will not carry them all alone. "},{"num":18,"verse":"Say to the people, ‘Make yourselves holy for tomorrow, and you will eat meat. The Lord heard you when you cried and said, “If only someone would give us meat to eat! For it was well with us in Egypt.” So the Lord will give you meat and you will eat. "},{"num":19,"verse":"You will not eat it for only one day, or two days, or five days, or ten days, or twenty days. "},{"num":20,"verse":"But you will eat it a whole month, until it comes out of your nose and you hate it, because you have turned away from the Lord Who is among you. You have cried before Him, saying, “Why did we ever leave Egypt?”’” "},{"num":21,"verse":"But Moses said, “The people whom I am among are 600,000 on foot. And You have said, ‘I will give them meat so they may eat for a whole month.’ "},{"num":22,"verse":"Will enough flocks and cattle be killed to feed them? Or will enough fish be gathered from the sea to feed them?” "},{"num":23,"verse":"The Lord said to Moses, “Is there an end to the Lord’s power? Now you will see if My Word will come true for you or not.”"},{"num":24,"verse":"So Moses went out and told the people the words of the Lord. And he gathered seventy men from the leaders of the people, and had them stand around the meeting tent. "},{"num":25,"verse":"Then the Lord came down in the cloud and spoke to him. He took of the Spirit Who was upon him and put Him upon the seventy leaders. When the Spirit rested upon them, they spoke the word of the Lord. But they did not do it again."},{"num":26,"verse":"But two men had stayed among the tents. Their names were Eldad and Medad, and the Spirit rested upon them. They were among those who had been chosen, but had not gone out to the meeting tent. So they spoke the word of the Lord among the tents. "},{"num":27,"verse":"A young man ran and told Moses, “Eldad and Medad are speaking the word of the Lord among the tents.” "},{"num":28,"verse":"Then Joshua the son of Nun, the helper of Moses since he was young, said, “Moses, my lord, do not let them.” "},{"num":29,"verse":"But Moses said to him, “Are you jealous for my good? If only all the Lord’s people would speak for God, that the Lord would put His Spirit upon them!” "},{"num":30,"verse":"Then Moses and the leaders of Israel returned to the tents."},{"header":"The Lord Sends Quails"},{"num":31,"verse":"Now a wind went out from the Lord. It brought quail from the sea, and let them fall beside the place where the tents were set up. They fell all around the tents, about as far on each side as it takes to travel in a day. They lay on the ground as deep as two cubits. "},{"num":32,"verse":"The people worked all day and all night and all the next day gathering the quail. He who gathered the least gathered enough to fill 110 baskets. And they spread them out for themselves all around the tents. "},{"num":33,"verse":"While the meat was still between their teeth and not yet eaten, the Lord became angry with the people. The Lord sent a bad sickness upon the people. "},{"num":34,"verse":"So the name of that place was called Kibroth-hattaavah. Because there they buried the people who had wanted meat to eat. "},{"num":35,"verse":"The people left Kibroth-hattaavah and went to Hazeroth. And they stayed at Hazeroth."}]