[{"header":"Armies around Jerusalem"},{"num":6,"verse":"“Run away to be safe, O sons of Benjamin! Run from Jerusalem! Blow the horn in Tekoa, and light a fire in Beth-haccerem. For a sinful power is coming down from the north, that will destroy much. "},{"num":2,"verse":"I will cut off the beautiful and fine ones, the people of Zion. "},{"num":3,"verse":"Shepherds and their flocks will come to her. They will set up their tents around her and feed their flocks there, each in his place. "},{"num":4,"verse":"Make war against her. Rise up, let us go and fight her at noon. It is bad for us, for the day is passing! The shadows of the evening are longer! "},{"num":5,"verse":"Rise up, let us go and fight in the night and destroy her strong houses!” "},{"num":6,"verse":"For the Lord of All says, “Cut down her trees, and build a battle-wall against Jerusalem. This is the city to be punished. There is nothing but a sinful power that makes hard times for others within her. "},{"num":7,"verse":"As a well keeps its water good for drinking, so Jerusalem keeps going on in her sin. The sounds of those who fight and those who destroy are heard in her. Sickness and sorrow are always before Me. "},{"num":8,"verse":"Listen about the danger, O Jerusalem, or I will become a stranger to you. I will make you a waste, a land with no people.”"},{"header":"Israel Will Not Listen"},{"num":9,"verse":"The Lord of All says, “They will gather all the people of Israel who are left like gathering from the vine. Pass your hand over the branches again like one who gathers grapes.” "},{"num":10,"verse":"Whom should I tell of the danger, that they may hear? See, their ears are closed and they cannot listen. They have become ashamed of the Word of the Lord. They have no joy in it. "},{"num":11,"verse":"But I am full of the anger of the Lord. I am tired of holding it in. “Pour it out on the children in the street, and on the young men gathered together. For both husband and wife will be taken, the old and those who have lived a very long time. "},{"num":12,"verse":"Their houses, their fields and their wives will be given to others. I will put out My hand against the people of the land,” says the Lord. "},{"num":13,"verse":"“For from the least to the greatest of them, every one is always wanting something. And from the man of God to the religious leader, every one lies to get what he wants. "},{"num":14,"verse":"They have healed the hurt of My people only a little, saying, ‘Peace, peace,’ when there is no peace. "},{"num":15,"verse":"Were they ashamed because of the sinful things they had done? No, they were not ashamed at all. They did not even know how to turn red. So they will fall among those who fall. When I punish them, they will be brought down,” says the Lord."},{"header":"Israel Will Not Go God’s Way"},{"num":16,"verse":"The Lord says, “Stand by where the roads cross, and look. Ask for the old paths, where the good way is, and walk in it. And you will find rest for your souls. But they said, ‘We will not walk in it.’ "},{"num":17,"verse":"I set watchmen over you, saying, ‘Listen to the sound of the horn!’ But they said, ‘We will not listen.’ "},{"num":18,"verse":"So hear, O nations, and know, O people, what will happen to them. "},{"num":19,"verse":"Hear, O earth. See, I am bringing much trouble upon these people. It is the fruit of their plans, because they have not listened to My words. And they have turned away from My law. "},{"num":20,"verse":"Why does special perfume come to Me from Sheba, or sweet spices from a far away land? I will not receive your burnt gifts on the altar in worship. The gifts you give on the altar are not pleasing to Me.” "},{"num":21,"verse":"So the Lord says, “See, I am laying things in front of these people, and they will fall over them. Fathers and sons will fall together, and neighbor and friend will die.”"},{"header":"Armies from the North"},{"num":22,"verse":"The Lord says, “See, a people is coming from the north country. A great nation is being raised up from the farthest parts of the earth. "},{"num":23,"verse":"They take hold of bow and spear. They are hard on people and have no pity. Their voice sounds like the sea. They ride on horses, dressed as a man for battle against you, O people of Zion!” "},{"num":24,"verse":"We have heard about it. Our hands fall weak. Suffering has taken hold of us, like the pain of a woman giving birth. "},{"num":25,"verse":"Do not go out into the field, and do not walk on the road. For the one who hates us has a sword. Fear is all around us. "},{"num":26,"verse":"O daughter of my people, dress in cloth made from hair and roll in ashes. Have sorrow as if you lost your only son. Cry with a bitter cry. For all at once the destroyer will come upon us."},{"num":27,"verse":"“I have asked you to test My people, that you may know and test their ways.” "},{"num":28,"verse":"All of them are strongwilled in turning to their own way, going about telling stories to hurt people. They are brass and iron. All of them are sinful. "},{"num":29,"verse":"Air is blown hard on the fire to burn up the lead. It is of no use because the sinful ones are not taken away. "},{"num":30,"verse":"They are called waste silver, because the Lord has turned away from them."}]