[{"num":5,"verse":"1 Not to speak lightly, chiefly in God’s matters. 9 The covetous can never have enough. 11 The laborer’s sleep is sweet. 14 Man when he dieth, taketh nothing with him. 18 To live joyfully, and with a contented mind, is the gift of God."},{"num":1,"verse":"Be not rash with thy mouth, nor let thine heart be hasty to utter a thing before God: for God is in the heavens, and thou art on the earth: therefore let thy words be few."},{"num":2,"verse":"For as a dream cometh by the multitude of business: so the voice of a fool is in the multitude of words."},{"num":3,"verse":"When thou hast vowed a vow to God, defer not to pay it: for he delighteth not in fools: pay therefore that thou hast vowed."},{"num":4,"verse":"It is better that thou shouldest not vow, than that thou shouldest vow and not pay it."},{"num":5,"verse":"Suffer not thy mouth to make thy flesh to sin: neither say before the Angel, that this is ignorance: wherefore shall God be angry by thy voice, and destroy the work of thine hands?"},{"num":6,"verse":"For in the multitude of dreams, and vanities are also many words: but fear thou God."},{"num":7,"verse":"If in a country thou seest the oppression of the poor, and the defrauding of judgment and justice, be not astonied at the matter: for he that is higher than the highest, regardeth, and there be higher than they."},{"num":8,"verse":"And the abundance of the earth is over all: the king also consisteth by the field that is tilled."},{"num":9,"verse":"He that loveth silver, shall not be satisfied with silver, and he that loveth riches, shall be without the fruit thereof: this is also vanity."},{"num":10,"verse":"When goods increase, they are increased that eat them: and what good cometh to the owners thereof, but the beholding thereof with their eyes?"},{"num":11,"verse":"The sleep of him that travaileth, is sweet, whether he eat little or much: but the satiety of the rich will not suffer him to sleep."},{"num":12,"verse":"There is an evil sickness that I have seen under the sun: to wit, riches reserved to the owners thereof for their evil."},{"num":13,"verse":"And these riches perish by evil travail, and he begetteth a son, and in his hand is nothing."},{"num":14,"verse":"As he came forth of his mother’s belly, he shall return naked to go as he came, and shall bear away nothing of his labor, which he hath caused to pass by his hand."},{"num":15,"verse":"And this also is an evil sickness, that in all points as he came, so shall he go, and what profit hath he that he hath travailed for the wind?"},{"num":16,"verse":"Also all his days he eateth in darkness with much grief, and in his sorrow and anger."},{"num":17,"verse":"Behold then, what I have seen good, that it is comely to eat, and to drink, and to take pleasure in all his labor, wherein he travaileth under the sun, the whole number of the days of his life, which God giveth him: for this is his portion."},{"num":18,"verse":"Also to every man to whom God hath given riches and treasures, and giveth him power to eat thereof, and to take his part, and to enjoy his labor: this is the gifts of God."},{"num":19,"verse":"Surely he will not much remember the days of his life, because God answereth to the joy of his heart."}]