[{"num":9,"verse":"Then the fifth angel blew [his] trumpet, and I saw a star that had fallen from the sky to the earth; and to the angel was given the key of the shaft of the Abyss (the bottomless pit)."},{"num":2,"verse":"He opened the long shaft of the Abyss (the bottomless pit), and smoke like the smoke of a huge furnace puffed out of the long shaft, so that the sun and the atmosphere were darkened by the smoke from the long shaft."},{"num":3,"verse":"Then out of the smoke locusts came forth on the earth, and such power was granted them as the power the earth’s scorpions have."},{"num":4,"verse":"They were told not to injure the herbage of the earth nor any green thing nor any tree, but only [to attack] such human beings as do not have the seal (mark) of God on their foreheads."},{"num":5,"verse":"They were not permitted to kill them, but to torment (distress, vex) them for five months; and the pain caused them was like the torture of a scorpion when it stings a person."},{"num":6,"verse":"And in those days people will seek death and will not find it; and they will yearn to die, but death evades and flees from them."},{"num":7,"verse":"The locusts resembled horses equipped for battle. On their heads was something like golden crowns. Their faces resembled the faces of people."},{"num":8,"verse":"They had hair like the hair of women, and their teeth were like lions’ teeth."},{"num":9,"verse":"Their breastplates (scales) resembled breastplates made of iron, and the [whirring] noise made by their wings was like the roar of a vast number of horse-drawn chariots going at full speed into battle."},{"num":10,"verse":"They have tails like scorpions, and they have stings, and in their tails lies their ability to hurt men for [the] five months."},{"num":11,"verse":"Over them as king they have the angel of the Abyss (of the bottomless pit). In Hebrew his name is Abaddon [destruction], but in Greek he is called Apollyon [destroyer]."},{"num":12,"verse":"The first woe (calamity) has passed; behold, two others are yet to follow."},{"num":13,"verse":"Then the sixth angel blew [his] trumpet, and from the four horns of the golden altar which stands before God I heard a solitary voice,"},{"num":14,"verse":"Saying to the sixth angel who had the trumpet, Liberate the four angels who are bound at the great river Euphrates."},{"num":15,"verse":"So the four angels who had been in readiness for that hour in the appointed day, month, and year were liberated to destroy a third of mankind."},{"num":16,"verse":"The number of their troops of cavalry was twice ten thousand times ten thousand (200,000,000); I heard what their number was."},{"num":17,"verse":"And in [my] vision the horses and their riders appeared to me like this: the riders wore breastplates the color of fiery red and sapphire blue and sulphur (brimstone) yellow. The heads of the horses looked like lions’ heads, and from their mouths there poured fire and smoke and sulphur (brimstone)."},{"num":18,"verse":"A third of mankind was killed by these three plagues—by the fire and the smoke and the sulphur (brimstone) that poured from the mouths of the horses."},{"num":19,"verse":"For the power of the horses to do harm is in their mouths and also in their tails. Their tails are like serpents, for they have heads, and it is by means of them that they wound people."},{"num":20,"verse":"And the rest of humanity who were not killed by these plagues even then did not repent of [the worship of] the works of their [own] hands, so as to cease paying homage to the demons and idols of gold and silver and bronze and stone and wood, which can neither see nor hear nor move."},{"num":21,"verse":"And they did not repent of their murders or their practice of magic (sorceries) or their sexual vice or their thefts."}]