[{"num":9,"verse":"When the fifth angel blew his trumpet, I saw a star fall from the sky to earth. It was given the key to the tunnel that leads down to the deep pit. "},{"num":2,"verse":"As it opened the tunnel, smoke poured out like the smoke of a great furnace. The sun and the air turned dark because of the smoke. "},{"num":3,"verse":"Locusts came out of the smoke and covered the earth. They were given the same power that scorpions have."},{"num":4,"verse":"The locusts were told not to harm the grass on the earth or any plant or any tree. They were to punish only those people who did not have God’s mark on their foreheads. "},{"num":5,"verse":"The locusts were allowed to make them suffer for five months, but not to kill them. The suffering they caused was like the sting of a scorpion. "},{"num":6,"verse":"In those days people will want to die, but they will not be able to. They will hope for death, but it will escape from them."},{"num":7,"verse":"These locusts looked like horses ready for battle. On their heads they wore something like gold crowns, and they had human faces. "},{"num":8,"verse":"Their hair was like a woman’s long hair, and their teeth were like those of a lion. "},{"num":9,"verse":"On their chests they wore armor made of iron. Their wings roared like an army of horse-drawn chariots rushing into battle. "},{"num":10,"verse":"Their tails were like a scorpion’s tail with a stinger that had the power to hurt someone for five months. "},{"num":11,"verse":"Their king was the angel in charge of the deep pit. In Hebrew his name was Abaddon, and in Greek it was Apollyon."},{"num":12,"verse":"The first horrible thing has now happened! But wait. Two more horrible things will happen soon."},{"num":13,"verse":"Then the sixth angel blew his trumpet. I heard a voice speak from the four corners of the gold altar that stands in the presence of God. "},{"num":14,"verse":"The voice spoke to this angel and said, “Release the four angels who are tied up beside the great Euphrates River.” "},{"num":15,"verse":"The four angels had been prepared for this very hour and day and month and year. Now they were set free to kill a third of all people."},{"num":16,"verse":"By listening, I could tell there were more than two hundred million of these war horses. "},{"num":17,"verse":"In my vision their riders wore fiery-red, dark-blue, and yellow armor on their chests. The heads of the horses looked like lions, with fire and smoke and sulfur coming out of their mouths. "},{"num":18,"verse":"One-third of all people were killed by the three terrible troubles caused by the fire, the smoke, and the sulfur. "},{"num":19,"verse":"The horses had powerful mouths, and their tails were like poisonous snakes that bite and hurt."},{"num":20,"verse":"The people who lived through these terrible troubles did not turn away from the idols they had made, and they did not stop worshiping demons. They kept on worshiping idols that were made of gold, silver, bronze, stone, and wood. Not one of these idols could see, hear, or walk. "},{"num":21,"verse":"No one stopped murdering or practicing witchcraft or being immoral or stealing."}]