[{"num":9,"verse":"Then the fifth angel blew his trumpet. I saw a star which had fallen down to the earth, and it was given the key to the abyss. "},{"num":2,"verse":"The star opened the abyss, and smoke poured out of it, like the smoke from a large furnace; the sunlight and the air were darkened by the smoke from the abyss. "},{"num":3,"verse":"Locusts came down out of the smoke upon the earth, and they were given the same kind of power that scorpions have. "},{"num":4,"verse":"They were told not to harm the grass or the trees or any other plant; they could harm only the people who did not have the mark of God's seal on their foreheads. "},{"num":5,"verse":"The locusts were not allowed to kill these people, but only to torture them for five months. The pain caused by the torture is like the pain caused by a scorpion's sting. "},{"num":6,"verse":"During those five months they will seek death, but will not find it; they will want to die, but death will flee from them."},{"num":7,"verse":"The locusts looked like horses ready for battle; on their heads they had what seemed to be crowns of gold, and their faces were like human faces. "},{"num":8,"verse":"Their hair was like women's hair, their teeth were like lions' teeth. "},{"num":9,"verse":"Their chests were covered with what looked like iron breastplates, and the sound made by their wings was like the noise of many horse-drawn chariots rushing into battle. "},{"num":10,"verse":"They have tails and stings like those of a scorpion, and it is with their tails that they have the power to hurt people for five months. "},{"num":11,"verse":"They have a king ruling over them, who is the angel in charge of the abyss. His name in Hebrew is Abaddon; in Greek the name is Apollyon (meaning “The Destroyer”)."},{"num":12,"verse":"The first horror is over; after this there are still two more horrors to come."},{"num":13,"verse":"Then the sixth angel blew his trumpet. I heard a voice coming from the four corners of the gold altar standing before God. "},{"num":14,"verse":"The voice said to the sixth angel, “Release the four angels who are bound at the great Euphrates River!” "},{"num":15,"verse":"The four angels were released; for this very hour of this very day of this very month and year they had been kept ready to kill a third of all the human race. "},{"num":16,"verse":"I was told the number of the mounted troops: it was two hundred million. "},{"num":17,"verse":"And in my vision I saw the horses and their riders: they had breastplates red as fire, blue as sapphire, and yellow as sulfur. The horses' heads were like lions' heads, and from their mouths came out fire, smoke, and sulfur. "},{"num":18,"verse":"A third of the human race was killed by those three plagues: the fire, the smoke, and the sulfur coming out of the horses' mouths. "},{"num":19,"verse":"For the power of the horses is in their mouths and also in their tails. Their tails are like snakes with heads, and they use them to hurt people."},{"num":20,"verse":"The rest of the human race, all those who had not been killed by these plagues, did not turn away from what they themselves had made. They did not stop worshiping demons, nor the idols of gold, silver, bronze, stone, and wood, which cannot see, hear, or walk. "},{"num":21,"verse":"Nor did they repent of their murders, their magic, their sexual immorality, or their stealing."}]