[{"num":9,"verse":"And the fifth angel blew, and I saw a star fall from heaven to the earth. And to him was given the key of the bottomless pit. "},{"num":2,"verse":"And he opened the bottomless pit, and there arose the smoke of a great furnace. And the sun and the air were darkened by reason of the smoke of the pit. "},{"num":3,"verse":"And there came out of the smoke locusts upon the earth, and to them was given power as the scorpions of the earth have power. "},{"num":4,"verse":"And it was commanded them that they should not hurt the grass of the earth, nor any green thing, nor any tree, but only those people who do not have the seal of God in their foreheads. "},{"num":5,"verse":"And to them was commanded that they should not kill them, but that they should be tormented five months. And their pain was as the pain that comes from a scorpion when he has stung a man. "},{"num":6,"verse":"And in those days people will seek death, but will not find it, and will desire to die, but death will escape them."},{"num":7,"verse":"And the similitude of the locusts was as horses prepared for battle. And on their heads were as it were crowns, as of gold, and their faces were like the faces of men. "},{"num":8,"verse":"And they had hair as the hair of women. And their teeth were as the teeth of lions. "},{"num":9,"verse":"And they had breastplates, as it were breastplates of iron. And the sound of their wings was like the sound of chariots when many horses run together to battle. "},{"num":10,"verse":"And they had tails like scorpions, and there were stings in their tails. And their power was to hurt people for five months. "},{"num":11,"verse":"And they had a king over them, who is the angel of the bottomless pit, whose name in the Hebrew tongue is Abaddon, but in the Greek tongue, Apollyon. "},{"num":12,"verse":"One woe is past, and behold, two woes come after this."},{"num":13,"verse":"And the sixth angel blew. And I heard a voice from the four corners of the golden altar that is before God, "},{"num":14,"verse":"saying to the sixth angel who had the trumpet, Release the four angels that are bound in the great river Euphrates! "},{"num":15,"verse":"And the four angels were released, who were prepared for an hour, for a day, for a month, and for a year, to slay the third part of man-kind. "},{"num":16,"verse":"And the number of horsemen of war was twenty times ten thousand. And I heard the number of them. "},{"num":17,"verse":"And thus I saw the horses in a vision, and those who sat on them, having fiery breastplates of a jacinth colour, and of crystal sulphur. And the heads of the horses were like the heads of lions. And out of their mouths went forth fire and smoke and brimstone. "},{"num":18,"verse":"And by these three the third part of mankind was killed; that is to say, by the fire, smoke, and brimstone that proceeded out of their mouths. "},{"num":19,"verse":"For their power was in their mouths and in their tails. For their tails were like serpents, and had heads, and with them they did harm."},{"num":20,"verse":"And the rest of the people, who were not killed by these plagues, did not repent of the deeds of their hands, so they would not worship devils, and idols of gold, silver, brass, stone, and wood, which can neither see nor hear, nor go about. "},{"num":21,"verse":"Also, they did not repent of their murder, nor of their sorceries, nor of their fornication, nor of their theft."}]