[{"num":17,"verse":"These words Jesus spoke, and lifted up his eyes to heaven and said, Father, the hour is come. Glorify your Son so that your Son may glorify you. "},{"num":2,"verse":"For you have given him power over all flesh, so that he may give eternal life to as many as you have given him. "},{"num":3,"verse":"This is life eternal: to know you, the only true God, and Jesus Christ whom you have sent."},{"num":4,"verse":"I have glorified you on the earth. I have finished the work that you gave me to do. "},{"num":5,"verse":"And now glorify me, Father, with your own self – with the glory that I had with you before the world was. "},{"num":6,"verse":"I have declared your name to the men that you gave me out of the world. Yours they were, and you gave them to me, and they have kept your sayings. "},{"num":7,"verse":"Now they know that all things, whatsoever you have given me, are of you. "},{"num":8,"verse":"For I have given to them the words that you gave me, and they have received them, and know surely that I came out from you, and do believe that you did send me."},{"num":9,"verse":"I pray for them – and pray not for the world, but for those whom you have given me. For they are yours. "},{"num":10,"verse":"And all mine are yours, and yours are mine, and I am glorified in them. "},{"num":11,"verse":"And now I am no longer in the world, but they are in the world, and I come to you. Holy Father, keep in your own name those whom you have given me so that they may be one, as we are. "},{"num":12,"verse":"While I was with them in the world, I kept them in your name. Those whom you gave me I have kept, and none of them is lost except that lost child, so that the scripture may be fulfilled."},{"num":13,"verse":"Now I come to you. And I speak these words in the world so that they may have my joy full in them. "},{"num":14,"verse":"I have given them your words. And the world has hated them, because they are not of the world, just as I am not of the world. "},{"num":15,"verse":"I ask not that you take them out of the world, but that you keep them from evil. "},{"num":16,"verse":"They are not of the world, as I am not of the world. "},{"num":17,"verse":"Sanctify them with your truth. Your word is truth. "},{"num":18,"verse":"As you sent me into the world, so have I sent them into the world. "},{"num":19,"verse":"And for their sakes I sanctify myself, so that they also may be sanctified through the truth."},{"num":20,"verse":"I pray not for them alone, but also for those who will believe on me through their preaching: "},{"num":21,"verse":"that they all may be one, as you, Father, are in me, and I in you; that they may also be one in us, so that the world may believe that you have sent me. "},{"num":22,"verse":"And the glory that you gave me, I have given them, so that they may be one as we are one, "},{"num":23,"verse":"I in them and you in me, so that they may be made perfect in one, and so that the world may know that you have sent me, and have loved them as you have loved me."},{"num":24,"verse":"Father, I will that those whom you have given me be with me where I am, that they may see the glory that you have given me. For you loved me before the making of the world. "},{"num":25,"verse":"O righteous Father, the very world has not known you, but I have known you, and these have known that you have sent me. "},{"num":26,"verse":"And I have declared to them your name, and will declare it, so that the love with which you have loved me may be in them, and so that I may be in them."}]