[{"header":"The Son Glorifies the Father"},{"num":17,"verse":"Yeshua spoke these things; then, lifting up His eyes to heaven, He said, “Father, the hour has come. Glorify Your Son, so the Son may glorify You. "},{"num":2,"verse":"Even as You gave Him authority over all flesh, so may He give eternal life to all those You have given Him. "},{"num":3,"verse":"And this is eternal life, that they may know You, the only true God, and Yeshua the Messiah, the One You sent. "},{"num":4,"verse":"I glorified You on earth by finishing the work that You have given Me to do. "},{"num":5,"verse":"Now, Father, glorify Me together with Yourself, with the glory which I had with You before the world came to be.”"},{"header":"Yeshua Prays for His Disciples"},{"num":6,"verse":"“I have made Your name known to the men of this world that You gave Me. They were Yours; You gave them to Me, and they have kept Your word. "},{"num":7,"verse":"Now they have come to know that everything You have given Me is from You. "},{"num":8,"verse":"The words, which You gave Me, I have given to them. They received them and truly understood that I came from You, and they believed that You sent Me. "},{"num":9,"verse":"I ask on their behalf. Not on behalf of the world do I ask, but on behalf of those You have given Me, for they are Yours. "},{"num":10,"verse":"All Mine are Yours, and Yours are Mine; and I have been glorified in them. "},{"num":11,"verse":"I am no longer in the world; but they are in the world, and I am coming to You. Holy Father, keep them in Your name that You have given Me, so that they may be one just as We are. "},{"num":12,"verse":"While I was with them, I was keeping them in Your name that You have given Me. I guarded them, and not one of them was lost except the son of destruction, so that the Scripture would be fulfilled."},{"num":13,"verse":"“But now I am coming to You. I say these words while I am still in the world, so that they may have My joy made full in themselves. "},{"num":14,"verse":"I have given them Your word; and the world hated them, because they are not of the world just as I am not of the world. "},{"num":15,"verse":"I am not asking that You take them out of the world, but that You keep them from the evil one. "},{"num":16,"verse":"They are not of the world, just as I am not of the world."},{"num":17,"verse":"“Make them holy in the truth. Your word is truth. "},{"num":18,"verse":"Just as You sent Me into the world, so I have sent them into the world. "},{"num":19,"verse":"And for their sakes I make Myself holy, so that they also may be made holy in truth.”"},{"header":"Interceding for All Believers"},{"num":20,"verse":"“I pray not on behalf of these only, but also for those who believe in Me through their message, "},{"num":21,"verse":"that they all may be one. Just as You, Father, are in Me and I am in You, so also may they be one in Us, so the world may believe that You sent Me. "},{"num":22,"verse":"The glory that You have given to Me I have given to them, that they may be one just as We are one—"},{"num":23,"verse":"I in them and You in Me—that they may be perfected in unity, so that the world may know that You sent Me and loved them as You loved Me."},{"num":24,"verse":"“Father, I also want those You have given Me to be with Me where I am, so that they may see My glory—the glory You gave Me, for You loved Me before the foundation of the world. "},{"num":25,"verse":"Righteous Father, the world did not know You, but I knew You; and these knew that You sent Me. "},{"num":26,"verse":"I made your Name known to them, and will continue to make it known, so that the love with which You loved Me may be in them, and I in them.”"}]