[{"header":"Satan confined"},{"num":20,"verse":"Then I saw an angel coming down from heaven, holding in his hand the key to the abyss and a huge chain."},{"num":2,"verse":"He seized the dragon, the old snake, who is the devil and Satan, and bound him for a thousand years."},{"num":3,"verse":"He threw him into the abyss, then locked and sealed it over him. This was to keep him from continuing to deceive the nations until the thousand years were over. After this he must be released for a little while."},{"header":"The saints rule with Christ"},{"num":4,"verse":"Then I saw thrones, and people took their seats on them, and judgment was given in their favor. They were the ones who had been beheaded for their witness to Jesus and God’s word, and those who hadn’t worshipped the beast or its image, who hadn’t received the mark on their forehead or hand. They came to life and ruled with Christ for one thousand years."},{"num":5,"verse":"The rest of the dead didn’t come to life until the thousand years were over. This is the first resurrection."},{"num":6,"verse":"Favored and holy are those who have a share in the first resurrection. The second death has no power over them, but they will be priests of God and of Christ, and will rule with him for one thousand years."},{"header":"Satan’s defeat"},{"num":7,"verse":"When the thousand years are over, Satan will be released from his prison."},{"num":8,"verse":"He will go out to deceive the nations that are at the four corners of the earth—Gog and Magog. He will gather them for battle. Their number is like the sand of the sea."},{"num":9,"verse":"They came up across the whole earth and surrounded the saints’ camp, the city that God loves. But fire came down from heaven and consumed them."},{"num":10,"verse":"Then the devil, who had deceived them, was thrown into the lake of fire and sulfur, where the beast and the false prophet also were. There painful suffering will be inflicted upon them day and night, forever and always."},{"header":"Final judgment"},{"num":11,"verse":"Then I saw a great white throne and the one who is seated on it. Before his face both earth and heaven fled away, and no place was found for them."},{"num":12,"verse":"I saw the dead, the great and the small, standing before the throne, and scrolls were opened. Another scroll was opened too; this is the scroll of life. And the dead were judged on the basis of what was written in the scrolls about what they had done."},{"num":13,"verse":"The sea gave up the dead that were in it, and Death and the Grave gave up the dead that were in them, and people were judged by what they had done."},{"num":14,"verse":"Then Death and the Grave were thrown into the fiery lake. This, the fiery lake, is the second death."},{"num":15,"verse":"Then anyone whose name wasn’t found written in the scroll of life was thrown into the fiery lake."}]