[{"num":20,"verse":"Then kai I saw an  angel angelos coming  down katabainō from ek · ho heaven ouranos,  having echō in epi his autos hand cheir the ho key kleis to  the ho abyss abyssos and kai a  great megas chain halysis.  · ho"},{"num":2,"verse":"· kai He  seized krateō the ho dragon drakōn,  that ho ancient archaios serpent ophis · ho ( who hos is eimi the  devil diabolos and kai · ho Satan Satanas),  and kai bound deō him autos for  a  thousand chilioi years etos. "},{"num":3,"verse":"Then kai he  threw ballō him autos into eis the ho abyss abyssos,  · kai locked kleiō and kai sealed sphragizō it  over epanō him autos,  so hina he  could  not mē deceive planaō the ho nations ethnos any  longer eti,  until achri the ho thousand chilioi years etos were  finished teleō.  After meta that houtos he autos must dei be  set  loose lyō for  a  short mikros time chronos. "},{"num":4,"verse":"And kai I saw  thrones thronos,  and kai seated kathizō on epi them autos · kai were  those autos who  had  been  given  the  authority didōmi to  judge krima. I  also kai saw  the ho souls psychē of  those ho who  had  been  beheaded pelekizō for dia the ho testimony martyria of  Jesus Iēsous and kai for dia the ho word logos of ho God theos.  · kai These hostis had  not ou worshiped proskyneō the ho beast thērion or oude · ho its autos image eikōn and kai had  not ou received lambanō its ho mark charagma on epi · ho their  foreheads metōpon or kai · ho their autos hands cheir.  · kai They  came  to  life zaō and kai reigned basileuō with meta · ho Christ Christos for  a  thousand chilioi years etos. "},{"num":5,"verse":"( The ho rest loipos of  the ho dead nekros did  not ou come  to  life zaō until achri the ho thousand chilioi years etos were  finished teleō).  This houtos is  the ho first prōtos resurrection anastasis.  · ho"},{"num":6,"verse":"Blessed makarios and kai holy hagios is  the ho one  who  has echō a  part meros in en the ho first prōtos resurrection anastasis!  · ho Over epi such houtos the ho second deuteros death thanatos has echō no ou power exousia,  but alla they  will  be eimi priests hiereus of ho God theos and kai of ho Christ Christos,  and kai they  will  reign basileuō with meta him autos for ho a  thousand chilioi years etos. "},{"num":7,"verse":"· kai When hotan the ho thousand chilioi years etos are  finished teleō,  Satan Satanas will  be  released lyō · ho from ek · ho his autos prison phylakē"},{"num":8,"verse":"and kai will  go  out exerchomai to  deceive planaō the ho nations ethnos · ho at en the ho four tessares corners gōnia of  the ho earth gē,  · ho Gog Gōg and kai Magog Magōg,  to  gather synagō them autos for eis · ho battle polemos.  · ho In  number arithmos they autos are  as hōs the ho sand ammos of  the ho sea thalassa. "},{"num":9,"verse":"And kai they  marched  up anabainō on epi the ho broad  plain platos of  the ho earth gē and kai encircled kykleuō the ho camp parembolē of  the ho saints hagios and kai the ho beloved agapaō city polis,  · ho but kai fire pyr came  down katabainō from ek · ho heaven ouranos and kai consumed katesthiō them autos. "},{"num":10,"verse":"And kai the ho devil diabolos,  the ho one  who  had  deceived planaō them autos,  was  thrown ballō into eis the ho lake limnē of ho fire pyr and kai sulfur theion where hopou both kai the ho beast thērion and kai the ho false  prophet pseudoprophētēs are.  · kai There  they  will  suffer  torment basanizō day hēmera and kai night nyx for eis all ho time aiōn ho.  · ho"},{"num":11,"verse":"Then kai I saw a  great megas white leukos throne thronos and kai the ho one  who  was  seated kathēmai on epi it autos.  From apo his hos · ho presence prosōpon earth gē and kai heaven ouranos fled  away pheugō,  · ho · ho and kai no ou place topos was  found heuriskō for  them autos. "},{"num":12,"verse":"And kai I saw  the ho dead nekros,  the ho great megas and kai the ho small mikros,  standing histēmi before enōpion the ho throne thronos,  and kai the  books biblion were  opened anoigō.  Then kai another allos book biblion was  opened anoigō— the hos Book  of ho Life zōē.  And kai the ho dead nekros were  judged krinō by ek what ho was  written graphō in en the ho books biblion,  according  to kata · ho their autos deeds ergon. "},{"num":13,"verse":"And kai the ho sea thalassa gave  up didōmi the ho dead nekros that ho were  in en it autos,  and kai · ho death thanatos and kai · ho Hades hadēs gave  up didōmi the ho dead nekros that ho were  in en them autos,  and kai they  were  judged krinō,  each hekastos one  according  to kata · ho his autos deeds ergon. "},{"num":14,"verse":"Then kai · ho death thanatos and kai · ho Hades hadēs were  thrown ballō into eis the ho lake limnē of ho fire pyr.  This houtos is eimi the ho second deuteros death thanatos,  · ho the ho lake limnē of ho fire pyr. "},{"num":15,"verse":"And kai anyone ei tis whose name  was  not ou found heuriskō written graphō in en the ho Book biblos of ho Life zōē was  thrown ballō into eis the ho lake limnē of ho fire pyr. "}]