[{"header":"The First Resurrection"},{"num":20,"verse":"Then I saw an angel coming down from heaven, holding in his hand the key to the abyss and a great chain. "},{"num":2,"verse":"He seized the dragon—the ancient serpent, who is the devil and satan—and bound him for a thousand years."},{"num":3,"verse":" He also threw him into the abyss and locked and sealed it over him, so that he would not deceive the nations any longer, until the thousand years were completed. After these things, he must be released for a short while."},{"num":4,"verse":"Then I saw thrones, and people sat upon them—those to whom authority to judge was given. And I saw the souls of those who had been beheaded because of their testimony for Yeshua and because of the word of God. They had not worshiped the beast or his image, nor had they received his mark on their forehead or on their hand. And they came to life and reigned with the Messiah for a thousand years."},{"num":5,"verse":"The rest of the dead did not come to life until the thousand years were completed. This is the first resurrection. "},{"num":6,"verse":"How fortunate and holy is the one who has a share in the first resurrection! Over such the second death has no authority, but they shall be kohanim of God and the Messiah, and they shall reign with Him for a thousand years."},{"header":"Judgment After 1000 Years"},{"num":7,"verse":"When the thousand years has ended, satan shall be released from his prison, "},{"num":8,"verse":"and he shall come out to deceive the nations at the four corners of the earth, Gog and Magog, to gather them for the battle. Their number is like the sand of the sea. "},{"num":9,"verse":"And they came up on the broad plain of the earth and surrounded the camp of the kedoshim and the beloved city—but fire fell from heaven and consumed them."},{"num":10,"verse":"And the devil who deceived them was thrown into the lake of fire and brimstone, where the beast and the false prophet are too, and they shall be tortured day and night forever and ever."},{"num":11,"verse":"Then I saw a great white throne, and the One seated on it. The earth and heaven fled from His presence, but no place was found for them. "},{"num":12,"verse":"And I saw the dead—the great and the small—standing before the throne. The books were opened, and another book was opened—the Book of Life. And the dead were judged according to what was written in the books, according to their deeds."},{"num":13,"verse":" The sea gave up the dead that were in it, and death and Sheol gave up the dead in them. Then they were each judged, each one of them, according to their deeds."},{"num":14,"verse":"Then death and Sheol were thrown into the lake of fire. This is the second death—the lake of fire. "},{"num":15,"verse":"And if anyone was not found written in the Book of Life, he was thrown into the lake of fire."}]