[{"header":"Manasseh King of Judah"},{"num":33,"verse":"Manasseh was twelve years old when he became king, and he ruled as king in Jerusalem for fifty-five years."},{"num":2,"verse":"He did evil in the eyes of the Lord by following the disgusting practices of the nations which the Lord had driven out before the people of Israel. "},{"num":3,"verse":"He rebuilt the high places which his father Hezekiah had torn down. He erected altars to the Baals and made Asherah poles. He worshipped the whole army of the heavens and served them. "},{"num":4,"verse":"He built altars in the House of the Lord, about which the Lord had said, “In Jerusalem my Name will be forever.” "},{"num":5,"verse":"He built altars for the whole army of the heavens in the two courtyards of the House of the Lord."},{"num":6,"verse":"He made his sons pass through the fire in the Valley of the Son of Hinnom. He practiced fortune telling and sought omens and consulted mediums and spiritists. He greatly increased the evil deeds he did in the eyes of the Lord and provoked him to anger."},{"num":7,"verse":"He placed the image of the carved idol that he had made in the House of God, about which God had said to David and to his son Solomon, “In this house and in Jerusalem, which I have chosen out of all the tribes of Israel, I will put my Name forever. "},{"num":8,"verse":"I will not make the feet of Israel wander again from the land which I assigned to their fathers, but only if they are conscientious to carry out everything I have commanded them, all of the law, the statutes, and the ordinances given through Moses.”"},{"num":9,"verse":"Manasseh seduced Judah and the inhabitants of Jerusalem to do more evil than the nations whom the Lord had destroyed before the people of Israel."},{"header":"The Lord’s Discipline Leads to Repentance"},{"num":10,"verse":"The Lord spoke to Manasseh and to his people, but they paid no attention. "},{"num":11,"verse":"So the Lord brought the officials of the army of the king of Assyria against them. They led Manasseh captive with hooks. They bound him with bronze shackles and took him to Babylon."},{"num":12,"verse":"When he was in distress, he sought the favor of the Lord his God and humbled himself deeply before the God of his fathers. "},{"num":13,"verse":"He prayed to the Lord, and the Lord responded to his prayer and heard his plea for mercy. He brought him back to Jerusalem into his own kingdom. Then Manasseh knew that the Lord is the true God."},{"num":14,"verse":"Afterward he built an outer wall for the City of David in the valley, from west of the Gihon Spring up to the entrance by the Fish Gate. He encircled Ophel with it and raised it to a very great height. He also put commanders of the army in all the fortified cities in Judah."},{"num":15,"verse":"He removed the foreign gods and the idol from the House of the Lord. He removed all the altars he had built on the mountain of the House of the Lord and in Jerusalem and threw them outside of the city. "},{"num":16,"verse":"He restored the altar of the Lord and offered sacrifices of fellowship offerings and thank offerings on it. He commanded Judah to serve the Lord, the God of Israel."},{"num":17,"verse":"Nevertheless, the people still sacrificed at the high places, but only to the Lord their God."},{"header":"Manasseh’s Death"},{"num":18,"verse":"You can find the rest of the acts of Manasseh, his prayer to his God, and the words of the seers who spoke to him in the name of the Lord, the God of Israel, in the annals of the kings of Israel."},{"num":19,"verse":"His prayer and how the Lord received it, all his sin and his unfaithfulness, and the sites on which he built the high places and set the Asherah poles and the carved images before he humbled himself, you can find recorded in the chronicles of the seers."},{"num":20,"verse":"Manasseh rested with his fathers, and he was buried in his own house. Amon his son became king in his place."},{"header":"Amon King of Judah"},{"num":21,"verse":"Amon was twenty-two years old when he became king, and he ruled as king in Jerusalem for two years."},{"num":22,"verse":"He did what was evil in the eyes of the Lord, just as his father Manasseh had done. Amon sacrificed to all the images that Manasseh his father had made, and he served them. "},{"num":23,"verse":"But he did not humble himself before the Lord, as Manasseh his father had humbled himself. Instead, Amon even multiplied the guilt."},{"num":24,"verse":"His servants conspired against him and put him to death in his own house. "},{"num":25,"verse":"Then the people of the land killed all those who had conspired against King Amon. The people of the land made his son Josiah king in his place."}]