[{"num":33,"verse":"Manasseh an idolater. 9 He causeth Judah to err. 11 He is led away prisoner into Babylon. 12 He prayeth to the Lord, and is delivered. 14 He abolisheth idolatry, 16 and setteth up true religion. 20 He dieth, and Amon his son succeedeth. 24 Whom his own servants slay."},{"num":1,"verse":"Manasseh was twelve years old, when he began to reign, and he reigned five and fifty years in Jerusalem:"},{"num":2,"verse":"And he did evil in the sight of the Lord, like the abominations of the heathen, whom the Lord had cast out before the children of Israel."},{"num":3,"verse":"For he went back and built the high places, which Hezekiah his father had broken down: and he set up altars for Baal, and made groves and worshipped all the host of the heaven, and served them."},{"num":4,"verse":"Also he built altars in the house of the Lord, whereof the Lord had said, In Jerusalem shall my Name be forever."},{"num":5,"verse":"And he built altars for all the host of the heaven in the two courts of the house of the Lord."},{"num":6,"verse":"And he caused his sons to pass through the fire in the valley of Ben-hinnom: he gave himself to witchcraft and to charming, and to sorcery, and he used them that had familiar spirits, and soothsayers: he did very much evil in the sight of the Lord to anger him."},{"num":7,"verse":"He put also the carved image, which he had made, in the house of God: whereof God had said to David and to Solomon his son, In this house and in Jerusalem, which I have chosen before all the tribes of Israel, will I put my Name forever."},{"num":8,"verse":"Neither will I make the foot of Israel to remove anymore out of the land which I have appointed for your fathers, so that they take heed, and do all that I have commanded them, according to the Law and statutes and judgments by the hand of Moses."},{"num":9,"verse":"So Manasseh made Judah and the inhabitants of Jerusalem to err, and to do worse than the heathen, whom the Lord had destroyed before the children of Israel."},{"num":10,"verse":"¶ And the Lord spake to Manasseh and to his people, but they would not regard."},{"num":11,"verse":"Wherefore the Lord brought upon them the captains of the host of the king of Assyria, which took Manasseh and put him in fetters, and bound him in chains, and carried him to Babel."},{"num":12,"verse":"And when he was in tribulation, he prayed to the Lord his God, and humbled himself greatly before the God of his fathers,"},{"num":13,"verse":"And prayed unto him: and God was entreated of him, and heard his prayer, and brought him again to Jerusalem into his kingdom: then Manasseh knew that the Lord was God."},{"num":14,"verse":"Now after this he built a wall without the city of David, on the West side of Gihon in the valley, even at the entry of the fish gate, and compassed about Ophel, and raised it very high, and put captains of war in all the strong cities of Judah."},{"num":15,"verse":"And he took away the strange gods and the image out of the house of the Lord, and all the altars that he had built in the mount of the house of the Lord, and in Jerusalem, and cast them out of the city."},{"num":16,"verse":"Also he prepared the altar of the Lord, and sacrificed thereon peace offerings, and of thanks, and commanded Judah to serve the Lord God of Israel."},{"num":17,"verse":"Nevertheless the people did sacrifice still in the high places, but unto the Lord their God."},{"num":18,"verse":"¶ Concerning the rest of the acts of Manasseh, and his prayer unto his God, and the words of the Seers, that spake to him in the Name of the Lord God of Israel, behold, they are written in the book of the Kings of Israel."},{"num":19,"verse":"And his prayer and how God was entreated of him, and all his sin, and his trespass, and the places wherein he built high places, and set groves and images (before he was humbled) behold, they are written in the book of the Seers."},{"num":20,"verse":"So Manasseh slept with his fathers, and they buried him in his own house: and Amon his son reigned in his stead."},{"num":21,"verse":"¶Amon was two and twenty years old, when he began to reign, and reigned two years in Jerusalem."},{"num":22,"verse":"But he did evil in the sight of the Lord, as did Manasseh his father: for Amon sacrificed to all the images, which Manasseh his father had made, and served them."},{"num":23,"verse":"And he humbled not himself before the Lord, as Manasseh his father had humbled himself: but this Amon trespassed more and more."},{"num":24,"verse":"And his servants conspired against him, and slew him in his own house."},{"num":25,"verse":"But the people of the land slew all them that had conspired against King Amon: and the people of the land made Josiah his son King in his stead."}]