[{"header":"King Manasseh of Judah(A)"},{"num":33,"verse":"Manasseh was 12 years old when he began to rule, and he ruled for 55 years in Jerusalem."},{"num":2,"verse":"He did what the Lord considered evil by copying the disgusting things done by the nations that the Lord had forced out of the Israelites’ way. "},{"num":3,"verse":"He rebuilt the illegal places of worship that his father Hezekiah had torn down. He set up altars dedicated to other gods—the Baals—and made a pole dedicated to the goddess Asherah as King Ahab of Israel had done. Manasseh, like Ahab, worshiped and served the entire army of heaven. "},{"num":4,"verse":"He built altars in the Lord’s temple, where the Lord had said, “My name will be in Jerusalem forever.” "},{"num":5,"verse":"In the two courtyards of the Lord’s temple, he built altars for the entire army of heaven. "},{"num":6,"verse":"He burned his son as a sacrifice in the valley of Ben Hinnom, consulted fortunetellers, cast evil spells, practiced witchcraft, and appointed ⌞royal⌟ mediums and psychics. He did many things that made the Lord furious. "},{"num":7,"verse":"Manasseh had a carved idol made. Then he set it up in God’s temple, where God had said to David and his son Solomon, “I have chosen this temple and Jerusalem from all the tribes of Israel. I will put my name here forever. "},{"num":8,"verse":"I will never again remove Israel from the land that I set aside for their ancestors if they will obey all the commands, all the teachings, the ordinances, and the regulations ⌞I gave⌟ through Moses.” "},{"num":9,"verse":"Manasseh misled Judah and the inhabitants of Jerusalem so that they did more evil things than the nations that the Lord had destroyed when the Israelites arrived in the land."},{"num":10,"verse":"When the Lord spoke to Manasseh and his people, they wouldn’t even pay attention. "},{"num":11,"verse":"So the Lord made the army commanders of the king of Assyria invade Judah. They took Manasseh captive, put a hook in his nose, put him in bronze shackles, and brought him to Babylon."},{"num":12,"verse":"When he experienced this distress, he begged the Lord his God to be kind and humbled himself in front of the God of his ancestors. "},{"num":13,"verse":"He prayed to the Lord, and the Lord accepted his prayer and listened to his request. The Lord brought him back to his kingdom in Jerusalem. Then Manasseh knew that the Lord is God."},{"num":14,"verse":"After this, Manasseh rebuilt the outer wall of the City of David from west of Gihon Spring in the valley to the entrance of Fish Gate. He made the wall go around the Ophel, and he built it very high. He put army commanders in every fortified city in Judah."},{"num":15,"verse":"Manasseh got rid of the foreign gods and the idol in the Lord’s temple. He got rid of the altars he had built in the temple on the Lord’s mountain and in Jerusalem. "},{"num":16,"verse":"He built the Lord’s altar and sacrificed fellowship offerings and thank offerings on it. And he told Judah to serve the Lord God of Israel. "},{"num":17,"verse":"The people continued to sacrifice at the illegal places of worship, but they sacrificed only to the Lord their God."},{"num":18,"verse":"Everything else about Manasseh—including his prayer to his God and the words that the seers  spoke to him in the name of the Lord God of Israel—are in the records of the kings of Israel. "},{"num":19,"verse":"His prayer and how God accepted it are written in the records of Hozai. The things he did before he humbled himself are also written there. This includes all his sins and unfaithfulness and the places where he built illegal worship sites and set up idols and poles dedicated to the goddess Asherah."},{"num":20,"verse":"Manasseh lay down in death with his ancestors. They buried him in his own palace. His son Amon succeeded him as king."},{"header":"King Amon of Judah(B)"},{"num":21,"verse":"Amon was 22 years old when he began to rule, and he ruled for 2 years in Jerusalem. "},{"num":22,"verse":"He did what the Lord considered evil, as his father Manasseh had done. Amon sacrificed to all the idols his father Manasseh had made, and he worshiped them. "},{"num":23,"verse":"He didn’t humble himself in front of the Lord as his father Manasseh had humbled himself. Instead, Amon continued to sin."},{"num":24,"verse":"His officials plotted against him and killed him in his palace. "},{"num":25,"verse":"Then the people of the land killed everyone who had plotted against King Amon. They made his son Josiah king in his place."}]