[{"header":"Chapter 33"},{"num":1,"verse":"Manasseh’s Impiety. Manasseh was twelve years old when he became king, and he reigned fifty-five years in Jerusalem. "},{"num":2,"verse":"He did what was evil in the Lord’s sight, following the abominable practices of the nations whom the Lord dispossessed before the Israelites. "},{"num":3,"verse":"He rebuilt the high places which Hezekiah his father had torn down. He set up altars to the Baals, and also made asherahs. He bowed down to the whole host of heaven and served them. "},{"num":4,"verse":"He built altars in the house of the Lord, of which the Lord had said: In Jerusalem shall my name be forever; "},{"num":5,"verse":"and he built altars to the whole host of heaven in the two courts of the house of the Lord. "},{"num":6,"verse":"It was he, too, who immolated his children by fire in the Valley of Ben-hinnom. He practiced soothsaying and divination, and reintroduced the consulting of ghosts and spirits."},{"num":7,"verse":"An idol he had made he placed in the house of God, of which God had said to David and to his son Solomon: In this house and in Jerusalem, which I have chosen out of all the tribes of Israel, I shall set my name forever. "},{"num":8,"verse":"I will no longer make Israel step out of the land I assigned to your ancestors, provided that they are careful to observe all I commanded them, the entire law, the statutes, and the ordinances given by Moses."},{"num":9,"verse":"Manasseh misled Judah and the inhabitants of Jerusalem into doing even greater evil than the nations the Lord had destroyed at the coming of the Israelites. "},{"num":10,"verse":"The Lord spoke to Manasseh and his people, but they paid no attention."},{"num":11,"verse":"Manasseh’s Conversion. Therefore the Lord brought against them the army commanders of the Assyrian king; they captured Manasseh with hooks, shackled him with chains, and transported him to Babylon. "},{"num":12,"verse":"In his distress, he began to appease the Lord, his God. He humbled himself abjectly before the God of his ancestors, "},{"num":13,"verse":"and prayed to him. The Lord let himself be won over: he heard his prayer and restored him to his kingdom in Jerusalem. Then Manasseh knew that the Lord is indeed God."},{"num":14,"verse":"Afterward he built an outer wall for the City of David to the west of Gihon in the valley, extending to the Fish Gate and encircling Ophel; he built it very high. He stationed army officers in all the fortified cities of Judah. "},{"num":15,"verse":"He removed the foreign gods and the idol from the Lord’s house and all the altars he had built on the mount of the Lord’s house and in Jerusalem, and cast them outside the city. "},{"num":16,"verse":"He restored the altar of the Lord, and sacrificed on it communion offerings and thank offerings, and commanded Judah to serve the Lord, the God of Israel. "},{"num":17,"verse":"Though the people continued to sacrifice on the high places, they now did so to the Lord, their God."},{"num":18,"verse":"The rest of the acts of Manasseh, his prayer to his God, and the words of the seers who spoke to him in the name of the Lord, the God of Israel, are written in the chronicles of the kings of Israel. "},{"num":19,"verse":"His prayer and how his supplication was heard, all his sins and his treachery, the sites where he built high places and set up asherahs and carved images before he humbled himself, all this is recorded in the chronicles of his seers. "},{"num":20,"verse":"Manasseh rested with his ancestors and was buried in his own palace. His son Amon succeeded him as king."},{"num":21,"verse":"Reign of Amon. Amon was twenty-two years old when he became king, and he reigned two years in Jerusalem. "},{"num":22,"verse":"He did what was evil in the Lord’s sight, as his father Manasseh had done. Amon offered sacrifice to all the idols his father Manasseh had made, and served them. "},{"num":23,"verse":"Moreover, he did not humble himself before the Lord as his father Manasseh had humbled himself; on the contrary, Amon only increased his guilt. "},{"num":24,"verse":"His officials plotted against him and put him to death in his palace, "},{"num":25,"verse":"but the people of the land then slew all who had plotted against King Amon, and the people of the land made his son Josiah king in his stead."}]