[{"header":"Manasseh Rules Judah"},{"num":33,"verse":"Manasseh was twelve years old when he became king. And he ruled for fifty-five years in Jerusalem. "},{"num":2,"verse":"He did what was bad in the eyes of the Lord. He did the hated things of the nations whom the Lord drove out before the sons of Israel. "},{"num":3,"verse":"For he built again the high places which his father Hezekiah had broken down. He built altars for the false gods of Baal and made objects of worship for the false goddess Asherah. He worshiped all the stars of heaven and served them. "},{"num":4,"verse":"And he built altars in the Lord’s house, of which the Lord had said, “My name will be in Jerusalem forever.” "},{"num":5,"verse":"He built altars for all the stars of heaven in the two open spaces of the house of the Lord. "},{"num":6,"verse":"And he burned his sons as a gift in the valley of Ben-hinnom. He did witchcraft and asked the demon world about the future. He asked the demon world to do very special things, and he talked with people who spoke with the spirits of the dead. He did what was very bad in the eyes of the Lord, and made Him angry. "},{"num":7,"verse":"Manasseh made an object to look like a false god, and put it in God’s house, of which God had said to David and to Solomon his son, “In this house, and in Jerusalem which I have chosen from all the families of Israel, I will put My name forever. "},{"num":8,"verse":"And I will never again take Israel out of the land which I have chosen for your fathers, if only they will obey all that I have told them in the Laws given through Moses.” "},{"num":9,"verse":"Manasseh led Judah and the people of Jerusalem to do more sinful things than the nations whom the Lord destroyed before the sons of Israel."},{"header":"Manasseh Turns from His Sin"},{"num":10,"verse":"The Lord spoke to Manasseh and his people, but they would not listen. "},{"num":11,"verse":"So the Lord brought the captains of the army of the king of Assyria against them. And they took Manasseh with hooks and tied him with brass chains and brought him to Babylon. "},{"num":12,"verse":"When Manasseh was in trouble, he prayed to the Lord his God, and put away his pride before the God of his fathers. "},{"num":13,"verse":"When he prayed to Him, God heard his prayer and listened to him, and brought him again to Jerusalem and to his nation. Then Manasseh knew that the Lord was God."},{"num":14,"verse":"After this he built the outside wall of the city of David on the west side of Gihon, in the valley, as far as the Fish Gate. He built it around the Ophel, and made it very high. Then he put army captains in all the strong cities of Judah. "},{"num":15,"verse":"He took away the strange gods and the false god from the house of the Lord. And he took away all the altars he had built on the mountain of the Lord’s house and in Jerusalem, and threw them outside the city. "},{"num":16,"verse":"He set up the altar of the Lord and gave peace gifts and thank gifts in worship on it. And he told Judah to serve the Lord God of Israel. "},{"num":17,"verse":"But the people still killed animals in worship at the high places, but only to the Lord their God."},{"header":"The End of Manasseh’s Rule"},{"num":18,"verse":"Now the rest of the acts of Manasseh, his prayer to his God, and the words the men who spoke for God spoke to him in the name of the Lord God of Israel, are among the writings of the kings of Israel. "},{"num":19,"verse":"His prayer and how God heard his prayer, and of all his sin and how he was not faithful, are found in the writings of the men who spoke for God. Also it is written where he built the high places, and made the objects of the false goddess Asherah, and made objects to look like gods, before he put away his pride. "},{"num":20,"verse":"So Manasseh died and they buried him in his own house. And his son Amon became king in his place."},{"num":21,"verse":"Amon was twenty-two years old when he became king, and ruled for two years in Jerusalem. "},{"num":22,"verse":"Amon did what was sinful in the eyes of the Lord, as his father Manasseh had done. He killed animals in worship to all the false gods his father Manasseh had made, and he served them. "},{"num":23,"verse":"He did not put away his pride before the Lord as his father Manasseh had done, but Amon added to his guilt. "},{"num":24,"verse":"His servants made plans against him, and killed him in his own house. "},{"num":25,"verse":"But the people of the land killed all those who had killed King Amon and made his son Josiah king in his place."}]