[{"header":"Summary of the Genealogies"},{"num":9,"verse":"All of Israel was enumerated by genealogy and recorded in the Book of the Kings of Israel as Judah was being taken captive into exile to Babylon due to their disobedience. "},{"num":2,"verse":"The first to settle on their own property in their own towns of Israel were priests, descendants of Levi, and the Temple Servants."},{"header":"Jerusalem after the Exile"},{"num":3,"verse":"In Jerusalem there lived some of the people of Judah, Benjamin, Ephraim, and Manasseh including "},{"num":4,"verse":"Ammihud’s son Uthai, who was the grandson of Omri, who was the great-grandson of Imri, who was fathered by Bani from the descendants of Judah’s son Perez. "},{"num":5,"verse":"From the descendants of Shilon there was Asaiah the firstborn, along with his descendants. "},{"num":6,"verse":"From the descendants of Zerah there was Jeuel, along with 690 of their relatives. "},{"num":7,"verse":"From the descendants of Benjamin there was Meshullam’s son Sallu, who was also the grandson of Hodaviah and great-grandson of Hassenuah, "},{"num":8,"verse":"Jeroham’s son Ibneiah, Uzzi’s son Elah, who was also Michri’s grandson, and Shephatiah’s son Meshullam, who was the grandson of Reuel and great-grandson of Ibnijah, "},{"num":9,"verse":"along with 956 of their relatives according to their generations. All of these were leaders of families according to their ancestral households."},{"header":"Priests in Service"},{"num":10,"verse":"From the priests there were Jedaiah, Jehoiarib, Jachin, "},{"num":11,"verse":"and Hilkiah’s son Azariah, who was fathered by Meshullam, who was fathered by Zadok, who was fathered by Meraioth, who was fathered by Ahitub, the Chief Operating Officer of the Temple of God. "},{"num":12,"verse":"There was Jeroham’s son Adaiah, who was fathered by Pashhur, who was fathered by Malchijah, and Adiel’s son Maasai, who was fathered by Jahzerah, who was fathered by Meshullam, who was fathered by Meshillemith, who was fathered by Immer, "},{"num":13,"verse":"along with 1,760 of their relatives, who were leaders of their ancestral households, valiant and qualified to serve in the Temple of God."},{"header":"Levitical Families"},{"num":14,"verse":"From the descendants of Levi there was Hasshub’s son Shemaiah, who was the grandson of Azrikam, who was fathered by Hashabiah, from the descendants of Merari; "},{"num":15,"verse":"along with Bakbakkar, Heresh, Galal, and Mica’s son Mattaniah, who was the grandson of Zichri and great-grandson of Asaph, "},{"num":16,"verse":"and Shemaiah’s son Obadiah, who was the grandson of Galal, who was fathered by Jeduthun, and Asa’s son Berechiah, who was the grandson of Elkanah, who lived in the villages of the Netophathites."},{"num":17,"verse":"The gatekeepers included Shallum, Akkub, Talmon, Ahiman, and other relatives. Shallum was the leader. "},{"num":18,"verse":"He used to be stationed in the King’s Gate on the east side as one of the gatekeepers of the camp belonging to the descendants of Levi. "},{"num":19,"verse":"Kore’s son Shallum, who was the grandson of Ebiasaph and the great-grandson of Korah, and the descendants of Korah (who were relatives of his ancestral house) were over the service responsibilities and served as guardians of the entrances of the Tent, just as their ancestors had been in charge of the camp of the Lord and guardians of the entrance. "},{"num":20,"verse":"Eleazar’s son Phinehas used to be Commander-in-Chief over them—the Lord was with him. "},{"num":21,"verse":"Meshelemiah’s son Zechariah was gatekeeper at the entrance to the Tent of Meeting. "},{"num":22,"verse":"All these, who had been set apart as gatekeepers at the entrances, numbered 212 and had been enrolled by genealogies in their villages."},{"num":23,"verse":"so they and their descendants were in charge of the gates of the house of the Lord, that is, the House of the Tent, as guardians. "},{"num":24,"verse":"The guardians were stationed on four sides—east, west, north, and south. "},{"num":25,"verse":"Their relatives who lived in their villages were required to visit every seven days to be with them in turn, "},{"num":26,"verse":"because the four senior gatekeepers (who were descendants of Levi) had been placed in charge of the chambers and the treasury of the Temple of God. "},{"num":27,"verse":"They spent the night near the Temple of God, since they had been entrusted to guard it. They were in charge of opening it every morning."},{"num":28,"verse":"Some were responsible for the service utensils, and they were required to take an inventory of them when they were brought in and out. "},{"num":29,"verse":"Others were responsible for the furniture and for all of the holy utensils, including the flour, wine, oil, incense, and spices. "},{"num":30,"verse":"Other descendants of the priests prepared the mixed spices. "},{"num":31,"verse":"Mattithiah, a descendant of Levi and firstborn of Shallum the Korahite, was in charge of making the offering cakes. "},{"num":32,"verse":"Some of their Kohathite relatives were responsible to prepare the rows of bread for each Sabbath. "},{"num":33,"verse":"These singers, leaders of ancestral households of the descendants of Levi, were living in the chambers of the Temple. Freed from other service responsibilities, they were on duty day and night. "},{"num":34,"verse":"These leaders of the descendants of Levi, enrolled according to their genealogies, lived in Jerusalem."},{"header":"Genealogy of King Saul"},{"num":35,"verse":"Jeiel, who fathered Gibeon, lived in the city of Gibeon. His wife was named Maacah. "},{"num":36,"verse":"His firstborn son was Abdon, followed by Zur, Kish, Baal, Ner, Nadab, "},{"num":37,"verse":"Gedor, Ahio, Zechariah, and Mikloth. "},{"num":38,"verse":"Mikloth fathered Shimeam. They lived across town from their relatives in Jerusalem. "},{"num":39,"verse":"Ner fathered Kish, Kish fathered Saul, and Saul fathered Jonathan, Malchi-shua, Abinadab, and Esh-baal. "},{"num":40,"verse":"Jonathan fathered Merib-baal, and Merib-baal fathered Micah."},{"num":41,"verse":"Micah’s descendants included Pithon, Melech, Tahrea, and Ahaz. "},{"num":42,"verse":"Ahaz fathered Jarah, and Jarah fathered Alemeth, Azmaveth, and Zimri. Zimri fathered Moza, and "},{"num":43,"verse":"Moza fathered Binea, and Rephaiah was his son, Eleasah his son, and Azel his son. "},{"num":44,"verse":"Azel had six descendants with these names: Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, and Hanan—these were the descendants of Azel."}]