[[],[{"type":"prose","content":"So all Israel was enrolled by genealogies; and these are written in the Book of the Kings of Israel. And Judah was taken into exile in Babylon because of their unfaithfulness. "}],[{"type":"prose","content":"Now the first to live again in their possessions in their towns were Israelites, priests, Levites, and temple servants."}],[{"type":"header","content":"Inhabitants of Jerusalem after the Exile"},{"type":"prose","content":"And some of the people of Judah, Benjamin, Ephraim, and Manasseh lived in Jerusalem: "}],[{"type":"prose","content":"Uthai son of Ammihud, son of Omri, son of Imri, son of Bani, from the sons of Perez son of Judah. "}],[{"type":"prose","content":"And of the Shilonites: Asaiah the firstborn, and his sons. "}],[{"type":"prose","content":"Of the sons of Zerah: Jeuel and their kin, six hundred ninety. "}],[{"type":"prose","content":"Of the Benjaminites: Sallu son of Meshullam, son of Hodaviah, son of Hassenuah, "}],[{"type":"prose","content":"Ibneiah son of Jeroham, Elah son of Uzzi, son of Michri, and Meshullam son of Shephatiah, son of Reuel, son of Ibnijah; "}],[{"type":"prose","content":"and their kindred according to their generations, nine hundred fifty-six. All these were heads of families according to their ancestral houses."}],[{"type":"header","content":"Priestly Families"},{"type":"prose","content":"Of the priests: Jedaiah, Jehoiarib, Jachin, "}],[{"type":"prose","content":"and Azariah son of Hilkiah, son of Meshullam, son of Zadok, son of Meraioth, son of Ahitub, the chief officer of the house of God; "}],[{"type":"prose","content":"and Adaiah son of Jeroham, son of Pashhur, son of Malchijah, and Maasai son of Adiel, son of Jahzerah, son of Meshullam, son of Meshillemith, son of Immer; "}],[{"type":"prose","content":"besides their kindred, heads of their ancestral houses, one thousand seven hundred sixty, qualified for the work of the service of the house of God."}],[{"type":"header","content":"Levitical Families"},{"type":"prose","content":"Of the Levites: Shemaiah son of Hasshub, son of Azrikam, son of Hashabiah, of the sons of Merari; "}],[{"type":"prose","content":"and Bakbakkar, Heresh, Galal, and Mattaniah son of Mica, son of Zichri, son of Asaph; "}],[{"type":"prose","content":"and Obadiah son of Shemaiah, son of Galal, son of Jeduthun, and Berechiah son of Asa, son of Elkanah, who lived in the villages of the Netophathites."}],[{"type":"prose","content":"The gatekeepers were: Shallum, Akkub, Talmon, Ahiman; and their kindred Shallum was the chief, "}],[{"type":"prose","content":"stationed previously in the king’s gate on the east side. These were the gatekeepers of the camp of the Levites. "}],[{"type":"prose","content":"Shallum son of Kore, son of Ebiasaph, son of Korah, and his kindred of his ancestral house, the Korahites, were in charge of the work of the service, guardians of the thresholds of the tent, as their ancestors had been in charge of the camp of the LORD, guardians of the entrance. "}],[{"type":"prose","content":"And Phinehas son of Eleazar was chief over them in former times; the LORD was with him. "}],[{"type":"prose","content":"Zechariah son of Meshelemiah was gatekeeper at the entrance of the tent of meeting. "}],[{"type":"prose","content":"All these, who were chosen as gatekeepers at the thresholds, were two hundred twelve. They were enrolled by genealogies in their villages. David and the seer Samuel established them in their office of trust. "}],[{"type":"prose","content":"So they and their descendants were in charge of the gates of the house of the LORD, that is, the house of the tent, as guards. "}],[{"type":"prose","content":"The gatekeepers were on the four sides, east, west, north, and south; "}],[{"type":"prose","content":"and their kindred who were in their villages were obliged to come in every seven days, in turn, to be with them; "}],[{"type":"prose","content":"for the four chief gatekeepers, who were Levites, were in charge of the chambers and the treasures of the house of God. "}],[{"type":"prose","content":"And they would spend the night near the house of God; for on them lay the duty of watching, and they had charge of opening it every morning."}],[{"type":"prose","content":"Some of them had charge of the utensils of service, for they were required to count them when they were brought in and taken out. "}],[{"type":"prose","content":"Others of them were appointed over the furniture, and over all the holy utensils, also over the choice flour, the wine, the oil, the incense, and the spices. "}],[{"type":"prose","content":"Others, of the sons of the priests, prepared the mixing of the spices, "}],[{"type":"prose","content":"and Mattithiah, one of the Levites, the firstborn of Shallum the Korahite, was in charge of making the flat cakes. "}],[{"type":"prose","content":"Also some of their kindred of the Kohathites had charge of the rows of bread, to prepare them for each sabbath."}],[{"type":"prose","content":"Now these are the singers, the heads of ancestral houses of the Levites, living in the chambers of the temple free from other service, for they were on duty day and night. "}],[{"type":"prose","content":"These were heads of ancestral houses of the Levites, according to their generations; these leaders lived in Jerusalem."}],[{"type":"header","content":"The Family of King Saul"},{"type":"prose","content":"In Gibeon lived the father of Gibeon, Jeiel, and the name of his wife was Maacah. "}],[{"type":"prose","content":"His firstborn son was Abdon, then Zur, Kish, Baal, Ner, Nadab, "}],[{"type":"prose","content":"Gedor, Ahio, Zechariah, and Mikloth; "}],[{"type":"prose","content":"and Mikloth became the father of Shimeam; and these also lived opposite their kindred in Jerusalem, with their kindred. "}],[{"type":"prose","content":"Ner became the father of Kish, Kish of Saul, Saul of Jonathan, Malchishua, Abinadab, and Esh-baal; "}],[{"type":"prose","content":"and the son of Jonathan was Merib-baal; and Merib-baal became the father of Micah. "}],[{"type":"prose","content":"The sons of Micah: Pithon, Melech, Tahrea, and Ahaz; "}],[{"type":"prose","content":"and Ahaz became the father of Jarah, and Jarah of Alemeth, Azmaveth, and Zimri; and Zimri became the father of Moza. "}],[{"type":"prose","content":"Moza became the father of Binea; and Rephaiah was his son, Eleasah his son, Azel his son. "}],[{"type":"prose","content":"Azel had six sons, and these are their names: Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, and Hanan; these were the sons of Azel."}]]