[{"num":9,"verse":"Therefore all Israel was numbered, and the sum of them was written in the book of [the] kings of Israel and of Judah; and they were translated into Babylon for their sin. (And so all Israel was listed, or registered, and their sum was written down in The Book of the Kings of Israel and of Judah; but they were carried away to Babylon because of their sins.)"},{"num":2,"verse":"And they that dwelled first in their cities, and in the possessions of Israel, and the priests, and the deacons, and Nethinims, (And the first to return, and to live on their own possessions, or on their own property, in their cities, were the Israelites, and the priests, and the Levites, and the Nethinims.)"},{"num":3,"verse":"dwelled in Jerusalem. Of the sons of Judah, and of the sons of Benjamin, also of the sons of Ephraim, and of Manasseh; (And they who lived in Jerusalem were of the sons of Judah, and of Benjamin, and of Ephraim, and of Manasseh;)"},{"num":4,"verse":"(of the sons of Judah;) Uthai, the son of Ammihud, the son of Omri, the son of Imri, the son of Bani, of the sons of Pharez (of the sons of Perez), the son of Judah;"},{"num":5,"verse":"and of Shelah (and of the Shilonites/and of the Shelanites); Asaiah, the first begotten (son), and his sons;"},{"num":6,"verse":"and (of) the sons of Zerah; Jeuel, and his brethren (and his kinsmen); six hundred, fourscore and ten."},{"num":7,"verse":"And of the sons of Benjamin; Sallu, the son of Meshullam, the sons of Hodaviah, the sons of Hasenuah, (And of the sons of Benjamin; Sallu, the son of Meshullam, the son of Hodaviah, the son of Hasenuah,)"},{"num":8,"verse":"and Ibneiah the son of Jeroham, and Elah the son of Uzzi, the sons of Michri (the son of Michri), and Meshullam the son of Shephathiah, the son of Reuel, (the) son of Ibnijah,"},{"num":9,"verse":"and the brethren of them, by their families; nine hundred [and] six and fifty. All these were princes of their kindreds by the houses of their fathers. (and their kinsmen, by their families; nine hundred and fifty-six. All these were leaders of their kindreds by the houses of their forefathers.)"},{"num":10,"verse":"And of the priests, Jedaiah, (and) Jehoiarib, and Jachin;"},{"num":11,"verse":"and Azariah, the son of Hilkiah, (the) son of Meshullam, the son of Zadok, the son of Meraioth, (the) son of Ahitub, was [the] bishop of the house of the Lord (was the High Priest, or the ruler, of the House of the Lord)."},{"num":12,"verse":"(And) Adaiah, son of Jeroham, son of Pashur, son of Malchijah, and Maasiai, son of Adiel, son of Jahzerah, son of Meshullam, son of Meshillemith, son of Immer,"},{"num":13,"verse":"also their brethren, princes by their families, were a thousand seven hundred and fourscore (and their kinsmen, leaders of their families, were a thousand seven hundred and sixty), men full strong in bodily might, to make the work of [the] service in the house of the Lord."},{"num":14,"verse":"And of the deacons (And of the Levites); Shemaiah, the son of Hasshub, the son of Azrikam, the son of Hashabiah, of the sons of Merari;"},{"num":15,"verse":"also Bakbakkar, the carpenter, and Galal, and Mattaniah, the son of Micah, son of Zichri, son of Asaph, (and Bakbakkar, and Heresh, and Galal, and Mattaniah, the son of Micah, the son of Zichri, the son of Asaph,)"},{"num":16,"verse":"and Obadiah, the son of Shemaiah, (the) son of Galal, the son of Jeduthun, and Berechiah, the son of Asa, the son of Elkanah, that dwelled in the porches of Netophathites (who lived in the villages of the Netophathites)."},{"num":17,"verse":"And the porters were Shallum, and Akkub, and Talmon, and Ahiman, and the brethren of them; Shallum was the prince; (And the guards, or the doorkeepers, were Shallum, and Akkub, and Talmon, and Ahiman, and their kinsmen; and Shallum was the leader;)"},{"num":18,"verse":"till to that time they kept by their whiles in the gate of the king at the east, of the sons of Levi. (until that time, they had all been guards, or doorkeepers, in the companies of the Levites, at the King’s Gate, on the east.)"},{"num":19,"verse":"Shallum forsooth, the son of Kore, the son of Ebiasaph, the son of Korah, with his brethren, and with the house of his father; these be the sons of Korah upon the works of the service, keepers of the porches of the tabernacle, and the families of them kept by whiles, or times, the entering of the castles of the Lord. (And Shallum, the son of Kore, the son of Ebiasaph, the son of Korah, with his kinsmen, of the house of his father; these Korahites were in charge of the guards at the entrance to the Tabernacle; for their families had long guarded the entrances to the tents, or to the camp, of the Lord.)"},{"num":20,"verse":"And Phinehas, the son of Eleazar, was the duke of them before the Lord. (And Phinehas, the son of Eleazar, had been their leader before, the Lord be with him!)"},{"num":21,"verse":"And Zechariah, the son of Meshelemiah, was porter of the gate of the tabernacle of witnessing. (And Zechariah, the son of Meshelemiah, was the guard at the gate to the Tabernacle of the Witnessing.)"},{"num":22,"verse":"All these chosen into porters by (the) gates were two hundred and twelve, and they were described, or presented, in their own towns, which deacons, or ministers, David and Samuel, the prophet, ordained in their faith, (All these chosen to be guards at the gates were two hundred and twelve, and they were listed in their own towns, and David, and the prophet Samuel, had ordained these Levites, or these ministers, for their faithfulness,)"},{"num":23,"verse":"both them and the sons of them in the doors of the house of the Lord, and in the tabernacle of witnessing, by their whiles. (both them and their sons to be at the doors of the House of the Lord, that is, at the entrance to the Tabernacle of the Witnessing, by their watches.)"},{"num":24,"verse":"Porters were by four coasts (Guards were on four sides), that is, at the east, at the west, at the north, and at the south."},{"num":25,"verse":"And their brethren dwelled in towns, and came in their sabbaths from time till to time. (And their kinsmen lived in their towns, and came for seven days at a time, each in their turn.)"},{"num":26,"verse":"All the number of porters was betaken to these four deacons, and they kept (charge of) the chambers, and the treasures of the house of the Lord. (These four chief guards, or doorkeepers, were Levites; and they were greatly trusted, and kept charge of the rooms, and the supplies of the House of the Lord.)"},{"num":27,"verse":"Also they dwelled in their keepings by the compass of the temple of the Lord, that when time were, they should open the gates early. (And they lived in their residences about the Temple of the Lord, so that at the proper time, they could open the gates every morning.)"},{"num":28,"verse":"Men of their kin were also on the vessels of [the] service; for the vessels were borne in at the number, and were borne out of them. (Men of their kin were also in charge of the vessels used in the service; for the vessels were borne in and borne out by them, by number.)"},{"num":29,"verse":"And they that had the vessels of the saintuary betaken to their keeping, were sovereigns of [the tried] flour, and [the] wine, and oil, and incense, and sweet smelling spiceries. (And they who had the vessels of the sanctuary under their charge, or their care, were also responsible for the fine flour, and the wine, and the oil, and the incense, and the sweet smelling spices.)"},{"num":30,"verse":"And (some of) the sons of [the] priests made ointments of (the) sweet smelling spiceries."},{"num":31,"verse":"And Mattithiah, deacon (the Levite), the first begotten son of Shallum of the kindred of Korah, was the sovereign of all things that were fried in the frying pan."},{"num":32,"verse":"And men of the sons of Kohath, the brethren of them, were on the loaves of setting forth, that they should make ready ever new loaves by each sabbath. (And some of the sons of Kohath, their kinsmen, were responsible for the loaves of setting forth, or the loaves of proposition, and they prepared new loaves every sabbath.)"},{"num":33,"verse":"These be the princes of chanters, by the families of Levites, that dwelled in chambers, so that they should serve continually day and night in their service. (These be the leaders of the cantors, or of the singers, by the families of the Levites, who lived in rooms set apart for them, so that they could continually serve day and night in their service.)"},{"num":34,"verse":"The heads of (the) Levites, by their families, the princes, dwelled in Jerusalem. (The heads of the Levites, their leaders, lived in Jerusalem, by their families.)"},{"num":35,"verse":"And there dwelled in Gibeon, Jeiel, the father of Gibeon, and the name of his wife (was) Maachah; (And Jeiel, the founder of Gibeon, lived in Gibeon, and his wife’s name was Maachah;)"},{"num":36,"verse":"(and) Abdon, his first begotten son, and Zur, and Kish, and Baal, and Ner, and Nadab,"},{"num":37,"verse":"and Gedor, and Ahio, and Zechariah, and Mikloth;"},{"num":38,"verse":"and Mikloth begat Shimeam; these dwelled even against their brethren in Jerusalem, with their brethren. (and Mikloth begat Shimeam; they lived with their kinsmen in Jerusalem.)"},{"num":39,"verse":"And Ner begat Kish; and Kish begat Saul; and Saul begat Jonathan, and Malchishua, and Abinadab, and Eshbaal."},{"num":40,"verse":"And the son of Jonathan was Meribbaal; and Meribbaal begat Micah."},{"num":41,"verse":"And the sons of Micah were Pithon, and Melech, and Tahrea, (and Ahaz);"},{"num":42,"verse":"and Ahaz begat Jarah; and Jarah begat Alemeth, and Azmaveth, and Zimri; and Zimri begat Moza;"},{"num":43,"verse":"and Moza begat Binea, whose son Rephaiah begat Eleasah, of whom Azel was begotten."},{"num":44,"verse":"And Azel had six sons by these names, Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, (and) Hanan; these were the sons of Azel."}]