[{"num":1,"verse":"This is the word of the Lord that came to Joel, the son of Pethuel."},{"header":"The Land Is Destroyed"},{"num":2,"verse":"Hear this, you old men. Listen, all who live in the land. Has anything like this happened in your days or in your fathers’ days? "},{"num":3,"verse":"Tell your sons about it, and let your sons tell their sons, and their sons tell the next sons-to-come."},{"num":4,"verse":"What the chewing locust has left, the flying locust has eaten. What the flying locust has left, the jumping locust has eaten. And what the jumping locust has left, the destroying locust has eaten. "},{"num":5,"verse":"Wake up and cry, you who drink too much. Cry in a loud voice, all you who drink wine, for the sweet wine has been taken from your lips. "},{"num":6,"verse":"A nation has come to fight against my land. Its army is powerful, with too many to number. Its teeth are the teeth of a lion. It has the long, sharp teeth of a female lion. "},{"num":7,"verse":"It has made my vine a waste, and has broken my fig tree to pieces. It has torn off their covering and thrown it away. Their branches have become white."},{"num":8,"verse":"Cry in sorrow like a young, pure woman dressed in cloth made from hair because the man she was going to marry is dead. "},{"num":9,"verse":"The grain gifts and drink gifts have been cut off from the house of the Lord. The religious leaders who served the Lord are full of sorrow. "},{"num":10,"verse":"The fields are laid waste and the land is full of sorrow. The grain is destroyed, the new wine dries up, and the oil wastes away. "},{"num":11,"verse":"Be troubled, you farmers! Cry in a loud voice, you who take care of the vines! Cry for the wheat and the barley, because what was gathered from the field is destroyed. "},{"num":12,"verse":"The vine dries up and the fig tree wastes away. The pomegranate, the palm, the apple tree, and all the trees of the field dry up. And the people’s joy dries up."},{"num":13,"verse":"Dress in cloth made from hair, and cry in sorrow, you religious leaders! Cry in a loud voice, you who serve at the altar! Come, spend the night in cloth made from hair, you who serve my God. For the grain gifts and drink gifts are kept from the house of your God. "},{"num":14,"verse":"Set apart a time when no food will be eaten. Call together a holy meeting. Gather the leaders and all the people of the land to the house of the Lord your God, and cry out to the Lord. "},{"num":15,"verse":"What a bad day it will be! The day of the Lord is near, when the All-powerful God will come to destroy. "},{"num":16,"verse":"Do you see how our food has been taken from us? Has not happiness and joy been cut off from the house of our God? "},{"num":17,"verse":"The seeds dry up under the ground. The store-houses are laid waste. The buildings where the grain was kept are torn down, for the grain is destroyed. "},{"num":18,"verse":"How the animals cry inside themselves! The cattle go from place to place because there is no food for them. Even the flocks of sheep suffer. "},{"num":19,"verse":"I cry to You, O Lord. For fire has destroyed the fields of the desert. All the trees of the field have burned up. "},{"num":20,"verse":"Even the animals of the field cry to You. For the rivers are dried up, and fire has burned up the fields of the desert."}]