[{"header":"Teaching about Divorce"},{"num":10,"verse":"After Jesus left, he went to Judea and then on to the other side of the Jordan River. Once again large crowds came to him, and as usual, he taught them."},{"num":2,"verse":"Some Pharisees wanted to test Jesus. So they came up to him and asked if it was right for a man to divorce his wife. "},{"num":3,"verse":"Jesus asked them, “What does the Law of Moses say about that?”"},{"num":4,"verse":"They answered, “Moses allows a man to write out divorce papers and send his wife away.”"},{"num":5,"verse":"Jesus replied, “Moses gave you this law because you are so heartless. "},{"num":6,"verse":"But in the beginning God made a man and a woman. "},{"num":7,"verse":"That’s why a man leaves his father and mother and gets married. "},{"num":8,"verse":"He becomes like one person with his wife. Then they are no longer two people, but one. "},{"num":9,"verse":"And no one should separate a couple that God has joined together.”"},{"num":10,"verse":"When Jesus and his disciples were back in the house, they asked him about what he had said. "},{"num":11,"verse":"He told them, “A man who divorces his wife and marries someone else is unfaithful to his wife. "},{"num":12,"verse":"A woman who divorces her husband and marries again is also unfaithful.”"},{"header":"Jesus Blesses Little Children"},{"num":13,"verse":"Some people brought their children to Jesus so that he could bless them by placing his hands on them. But his disciples told the people to stop bothering him."},{"num":14,"verse":"When Jesus saw this, he became angry and said, “Let the children come to me! Don’t try to stop them. People who are like these little children belong to the kingdom of God. "},{"num":15,"verse":"I promise you that you cannot get into God’s kingdom, unless you accept it the way a child does.” "},{"num":16,"verse":"Then Jesus took the children in his arms and blessed them by placing his hands on them."},{"header":"A Rich Man"},{"num":17,"verse":"As Jesus was walking down a road, a man ran up to him. He knelt down, and asked, “Good teacher, what can I do to have eternal life?”"},{"num":18,"verse":"Jesus replied, “Why do you call me good? Only God is good. "},{"num":19,"verse":"You know the commandments. ‘Do not murder. Be faithful in marriage. Do not steal. Do not tell lies about others. Do not cheat. Respect your father and mother.’”"},{"num":20,"verse":"The man answered, “Teacher, I have obeyed all these commandments since I was a young man.”"},{"num":21,"verse":"Jesus looked closely at the man. He liked him and said, “There’s one thing you still need to do. Go sell everything you own. Give the money to the poor, and you will have riches in heaven. Then come with me.”"},{"num":22,"verse":"When the man heard Jesus say this, he went away gloomy and sad because he was very rich."},{"num":23,"verse":"Jesus looked around and said to his disciples, “It’s hard for rich people to get into God’s kingdom!” "},{"num":24,"verse":"The disciples were shocked to hear this. So Jesus told them again, “It’s terribly hard to get into God’s kingdom! "},{"num":25,"verse":"In fact, it’s easier for a camel to go through the eye of a needle than for a rich person to get into God’s kingdom.”"},{"num":26,"verse":"Jesus' disciples were even more amazed. They asked each other, “How can anyone ever be saved?”"},{"num":27,"verse":"Jesus looked at them and said, “There are some things that people cannot do, but God can do anything.”"},{"num":28,"verse":"Peter replied, “Remember, we left everything to be your followers!”"},{"num":29,"verse":"Jesus told him:"},{"header":"Jesus Again Tells about His Death"},{"num":32,"verse":"The disciples were confused as Jesus led them toward Jerusalem, and his other followers were afraid. Once again, Jesus took the twelve disciples aside and told them what was going to happen to him. He said:"},{"header":"The Request of James and John"},{"num":35,"verse":"James and John, the sons of Zebedee, came up to Jesus and asked, “Teacher, will you do us a favor?”"},{"num":36,"verse":"Jesus asked them what they wanted, "},{"num":37,"verse":"and they answered, “When you come into your glory, please let one of us sit at your right side and the other at your left.”"},{"num":38,"verse":"Jesus told them, “You don’t really know what you’re asking! Are you able to drink from the cup that I must soon drink from or be baptized as I must be baptized?”"},{"num":39,"verse":"“Yes, we are!” James and John answered."},{"num":40,"verse":"But it isn’t for me to say who will sit at my right side and at my left. That is for God to decide.”"},{"num":41,"verse":"When the ten other disciples heard this, they were angry with James and John. "},{"num":42,"verse":"But Jesus called the disciples together and said:"},{"header":"Jesus Heals Blind Bartimaeus"},{"num":46,"verse":"Jesus and his disciples went to Jericho. And as they were leaving, they were followed by a large crowd. A blind beggar by the name of Bartimaeus son of Timaeus was sitting beside the road. "},{"num":47,"verse":"When he heard that it was Jesus from Nazareth, he shouted, “Jesus, Son of David, have pity on me!” "},{"num":48,"verse":"Many people told the man to stop, but he shouted even louder, “Son of David, have pity on me!”"},{"num":49,"verse":"Jesus stopped and said, “Call him over!”"},{"num":50,"verse":"The man threw off his coat as he jumped up and ran to Jesus."},{"num":51,"verse":"Jesus asked, “What do you want me to do for you?”"},{"num":52,"verse":"Jesus told him, “You may go. Your eyes are healed because of your faith.”"}]