[{"header":"Teaching about Divorce(A)"},{"num":10,"verse":"Then Jesus left that place and went into the territory of Judea on the other side of the Jordan. Crowds gathered around him as usual, and he began to teach them again as was his custom. "},{"num":2,"verse":"Some Pharisees came to test him. They asked, “Is it lawful for a man to divorce his wife?”"},{"num":3,"verse":"“What did Moses command you?” he responded."},{"num":4,"verse":"They said, “Moses allowed a man to write a certificate of divorce and to divorce her.”"},{"num":5,"verse":"But Jesus told them, “It was because of your hardness of heart that he wrote this command for you. "},{"num":6,"verse":"But from the beginning of creation, ‘God made them male and female.’ "},{"num":7,"verse":"That’s why ‘a man will leave his father and mother and be united with his wife, "},{"num":8,"verse":"and the two will become one flesh.’ So they’re no longer two, but one flesh. "},{"num":9,"verse":"Therefore, what God has joined together, man must never separate.”"},{"num":10,"verse":"Back in the house, the disciples asked him about this again. "},{"num":11,"verse":"So he told them, “Whoever divorces his wife and marries another woman commits adultery against her. "},{"num":12,"verse":"And if a woman divorces her husband and marries another man, she commits adultery.”"},{"header":"Jesus Blesses the Little Children(B)"},{"num":13,"verse":"Some people were bringing little children to Jesus to have him touch them. But the disciples rebuked those who brought them. "},{"num":14,"verse":"When Jesus saw this, he became furious and told them, “Let the little children come to me, and stop keeping them away, because the kingdom of God belongs to people like these. "},{"num":15,"verse":"I tell all of you with certainty, whoever doesn’t receive the kingdom of God as a little child will never enter it.” "},{"num":16,"verse":"Then after he had hugged the children, he tenderly blessed them as he laid his hands on them."},{"header":"A Rich Man Comes to Jesus(C)"},{"num":17,"verse":"As Jesus was setting out again, a man ran up to him, knelt down in front of him, and asked him, “Good Teacher, what must I do to inherit eternal life?”"},{"num":18,"verse":"“Why do you call me good?” Jesus asked him. “Nobody is good except for one—God. "},{"num":19,"verse":"You know the commandments: ‘Never murder.’ ‘Never commit adultery.’ ‘Never steal.’ ‘Never give false testimony.’ ‘Never cheat.’ ‘Honor your father and mother.’”"},{"num":20,"verse":"The man replied to him, “Teacher, I have obeyed all of these since I was a young man.”"},{"num":21,"verse":"Jesus looked at him and loved him. Then he told him, “You’re missing one thing. Go and sell everything you own, give the money to the destitute, and you will have treasure in heaven. Then come back and follow me.” "},{"num":22,"verse":"Shocked at this statement, the man went away sad, because he had many possessions."},{"header":"Salvation and Reward(D)"},{"num":23,"verse":"Then Jesus looked around and told his disciples, “How hard it will be for those who are wealthy to enter the kingdom of God!” "},{"num":24,"verse":"The disciples were startled by these words, but Jesus told them again, “Children, how hard it is for those who trust in their wealth to get into the kingdom of God! "},{"num":25,"verse":"It’s easier for a camel to squeeze through the eye of a needle than for a rich person to get into the kingdom of God.”"},{"num":26,"verse":"The disciples were utterly amazed and asked one another, “Then who can be saved?”"},{"num":27,"verse":"Jesus looked at them intently and said, “For humans it’s impossible, but not for God. All things are possible for God.”"},{"num":28,"verse":"Then Peter began to say to him, “See, we have left everything and followed you.” "},{"num":29,"verse":"Jesus said, “I tell all of you with certainty, there is no one who has left his home, brothers, sisters, mother, father, children, or fields because of me and the gospel "},{"num":30,"verse":"who will not receive a hundred times as much here in this world—homes, brothers, sisters, mothers, children, and fields, along with persecution—as well as eternal life in the age to come. "},{"num":31,"verse":"But many who are first will be last, and the last will be first.”"},{"num":32,"verse":"Now Jesus and his disciples had been on the road going up to Jerusalem, with Jesus walking ahead of them. They were astonished, and the others who followed were afraid."},{"header":"Jesus Predicts His Death and Resurrection a Third Time(E)"},{"num":33,"verse":"“Pay attention! We’re going up to Jerusalem. The Son of Man will be handed over to the high priests and the scribes, and they’ll condemn him to death. Then they’ll hand him over to the unbelievers, "},{"num":34,"verse":"and they’ll make fun of him, spit on him, whip him, and kill him. But after three days he’ll be raised.”"},{"header":"The Request of James and John(F)"},{"num":35,"verse":"James and John, the sons of Zebedee, went to Jesus and told him, “Teacher, we want you to do for us whatever we ask you.”"},{"num":36,"verse":"He asked them, “What do you want me to do for you?”"},{"num":37,"verse":"They asked him, “Let us sit in your glory, one on your right and one on your left.”"},{"num":38,"verse":"But Jesus told them, “You don’t realize what you’re asking. Can you drink from the cup that I’m going to drink from or be baptized with the baptism with which I’m going to be baptized?”"},{"num":39,"verse":"They told him, “We can.”"},{"num":40,"verse":"But it’s not up to me to grant you a seat at my right or my left. Those positions have already been prepared for others.”"},{"num":41,"verse":"When the ten other disciples heard this, they began to be furious with James and John. "},{"num":42,"verse":"Jesus called his disciples and told them, “You know that those who are recognized as rulers among the unbelievers lord it over them, and their superiors act like tyrants over them. "},{"num":43,"verse":"That’s not the way it should be among you. Instead, whoever wants to become great among you must be your servant, "},{"num":44,"verse":"and whoever wants to be first among you must be a slave to everyone, "},{"num":45,"verse":"because even the Son of Man did not come to be served, but to serve and to give his life as a ransom for many people.”"},{"header":"Jesus Heals Blind Bartimaeus(G)"},{"num":46,"verse":"Then they came to Jericho. As Jesus, his disciples, and a large crowd were leaving Jericho, a blind beggar named Bartimaeus (that is, the son of Timaeus) was sitting by the road. "},{"num":47,"verse":"When he heard that Jesus of Nazareth was there, he began to shout, “Jesus, Son of David, have mercy on me!” "},{"num":48,"verse":"Many people sternly told him to be quiet, but he started shouting even louder, “Son of David, have mercy on me!”"},{"num":49,"verse":"So Jesus stopped and said, “Call him!”"},{"num":50,"verse":"He threw off his coat, jumped up, and went to Jesus."},{"num":51,"verse":"Then Jesus asked him, “What do you want me to do for you?”"},{"num":52,"verse":"Jesus told him, “Go. Your faith has made you well.” At once the man could see again, and he began to follow Jesus down the road."}]