[{"header":"Divorce(A)"},{"num":10,"verse":"Jesus then left that place and went into the region of Judea and across the Jordan. Again crowds of people came to him, and as was his custom, he taught them."},{"num":2,"verse":"Some Pharisees came and tested him by asking, “Is it lawful for a man to divorce his wife?”"},{"num":4,"verse":"They said, “Moses permitted a man to write a certificate of divorce and send her away.”"},{"num":10,"verse":"When they were in the house again, the disciples asked Jesus about this."},{"num":11,"verse":"He answered, “Anyone who divorces his wife and marries another woman commits adultery against her."},{"header":"The Little Children and Jesus(K)"},{"num":13,"verse":"People were bringing little children to Jesus for him to place his hands on them, but the disciples rebuked them."},{"num":14,"verse":"When Jesus saw this, he was indignant. He said to them, “Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these."},{"num":16,"verse":"And he took the children in his arms, placed his hands on them and blessed them."},{"header":"The Rich and the Kingdom of God(O)"},{"num":17,"verse":"As Jesus started on his way, a man ran up to him and fell on his knees before him. “Good teacher,” he asked, “what must I do to inherit eternal life?”"},{"num":20,"verse":"“Teacher,” he declared, “all these I have kept since I was a boy.”"},{"num":21,"verse":"Jesus looked at him and loved him. “One thing you lack,” he said. “Go, sell everything you have and give to the poor, and you will have treasure in heaven. Then come, follow me.”"},{"num":22,"verse":"At this the man’s face fell. He went away sad, because he had great wealth."},{"num":23,"verse":"Jesus looked around and said to his disciples, “How hard it is for the rich to enter the kingdom of God!”"},{"num":24,"verse":"The disciples were amazed at his words. But Jesus said again, “Children, how hard it is to enter the kingdom of God!"},{"num":26,"verse":"The disciples were even more amazed, and said to each other, “Who then can be saved?”"},{"num":27,"verse":"Jesus looked at them and said, “With man this is impossible, but not with God; all things are possible with God.”"},{"num":28,"verse":"Then Peter spoke up, “We have left everything to follow you!”"},{"header":"Jesus Predicts His Death a Third Time(AE)"},{"num":32,"verse":"They were on their way up to Jerusalem, with Jesus leading the way, and the disciples were astonished, while those who followed were afraid. Again he took the Twelve aside and told them what was going to happen to him."},{"header":"The Request of James and John(AN)"},{"num":35,"verse":"Then James and John, the sons of Zebedee, came to him. “Teacher,” they said, “we want you to do for us whatever we ask.”"},{"num":37,"verse":"They replied, “Let one of us sit at your right and the other at your left in your glory.”"},{"num":39,"verse":"“We can,” they answered."},{"num":41,"verse":"When the ten heard about this, they became indignant with James and John."},{"num":42,"verse":"Jesus called them together and said, “You know that those who are regarded as rulers of the Gentiles lord it over them, and their high officials exercise authority over them."},{"header":"Blind Bartimaeus Receives His Sight(AW)"},{"num":46,"verse":"Then they came to Jericho. As Jesus and his disciples, together with a large crowd, were leaving the city, a blind man, Bartimaeus (which means “son of Timaeus”), was sitting by the roadside begging."},{"num":47,"verse":"When he heard that it was Jesus of Nazareth, he began to shout, “Jesus, Son of David, have mercy on me!”"},{"num":48,"verse":"Many rebuked him and told him to be quiet, but he shouted all the more, “Son of David, have mercy on me!”"},{"num":49,"verse":"Jesus stopped and said, “Call him.”"},{"num":50,"verse":"Throwing his cloak aside, he jumped to his feet and came to Jesus."}]