[{"header":"The Lord Will Destroy Jerusalem’s Enemies"},{"num":12,"verse":"This is a prophecy. It is the Lord’s message about Israel."},{"num":2,"verse":"“Jerusalem will be like a cup in my hand. It will make all the surrounding nations drunk from the wine of my anger. Judah will be attacked by its enemies. So will Jerusalem. "},{"num":3,"verse":"At that time all the nations on earth will gather together against Jerusalem. Then it will become like a rock that can’t be moved. All the nations that try to move it will only hurt themselves. "},{"num":4,"verse":"On that day I will fill every horse with panic. I will make every rider crazy,” announces the Lord. “I will watch over the people of Judah. But I will make all the horses of the nations blind. "},{"num":5,"verse":"Then the family groups of Judah will say in their hearts, ‘The people of Jerusalem are strong. That’s because the Lord who rules over all is their God.’"},{"num":6,"verse":"“At that time Judah’s family groups will be like a fire pot in a pile of wood. They will be like a burning torch among bundles of grain. They will destroy all the surrounding nations on every side. But Jerusalem will remain unharmed in its place."},{"num":7,"verse":"“I will save the houses in Judah first. The honor of David’s family line is great. So is the honor of those who live in Jerusalem. But their honor will not be greater than the honor of the rest of Judah. "},{"num":8,"verse":"At that time I will be like a shield to those who live in Jerusalem. Then even the weakest among them will be great warriors like David. And David’s family line will be like the angel of the Lord who leads them. "},{"num":9,"verse":"On that day I will begin to destroy all the nations that attack Jerusalem."},{"header":"Israel’s People Will Mourn Over the One They Pierced"},{"num":10,"verse":"“I will pour out a spirit of grace and prayer on David’s family line. I will also send it on those who live in Jerusalem. They will look to me. I am the one they have pierced. They will mourn over me as someone mourns over an only child who has died. They will be full of sorrow over me. Their sorrow will be just like someone’s sorrow over an oldest son. "},{"num":11,"verse":"At that time there will be a lot of weeping in Jerusalem. It will be as great as the weeping of the people at Hadad Rimmon. Hadad Rimmon is in the valley of Megiddo. They were weeping over Josiah’s death. "},{"num":12,"verse":"Everyone in the land will mourn. Each family will mourn by themselves and their wives by themselves. That will include the family lines of David, Nathan, "},{"num":13,"verse":"Levi, Shimei and "},{"num":14,"verse":"all the others."}]