[{"header":"Jerusalem, a Cup of Reeling"},{"num":12,"verse":"The burden of the word of Adonai concerning Israel."},{"num":2,"verse":"“Behold, I will make Jerusalem a cup of reeling to all the surrounding peoples when they besiege Jerusalem as well as Judah. "},{"num":3,"verse":"Moreover, in that day I will make Jerusalem a massive stone for all the people. All who try to lift it will be cut to pieces. Nevertheless, all the nations of the earth will be gathered together against her. "},{"num":4,"verse":"In that day”—it is a declaration of Adonai—“I will strike every horse with confusion and its rider with madness. I will keep My eyes on the house of Judah but will blind every horse of the peoples. "},{"num":5,"verse":"Then the leaders of Judah will say in their heart, ‘The inhabitants of Jerusalem are my strength through Adonai-Tzva’ot their God.”"},{"num":6,"verse":"“In that day I will make the leaders of Judah like a firepot in a woodpile, like a burning torch among sheaves. They will devour on the right and on the left all the surrounding peoples, yet Jerusalem will remain in her place, in Jerusalem. "},{"num":7,"verse":"Adonai also will save the tents of Judah first, so that the honor of the house of David and the honor of the inhabitants of Jerusalem will not exceed that of Judah. "},{"num":8,"verse":"In that day Adonai will defend the inhabitants of Jerusalem so that the weakest among them that day will be like David and the house of David will be like God—like the angel of Adonai before them. "},{"num":9,"verse":"It will happen in that day that I will seek to destroy all the nations that come against Jerusalem."},{"header":"Mourning the Pierced One"},{"num":10,"verse":"“Then I will pour out on the house of David and the inhabitants of Jerusalem a spirit of grace and supplication, when they will look toward Me whom they pierced. They will mourn for him as one mourns for an only son and grieve bitterly for him, as one grieves for a firstborn. "},{"num":11,"verse":"In that day there will be a great mourning in Jerusalem, mourning like Hadad-rimmon in the valley of Megiddo. "},{"num":12,"verse":"The land will mourn clan by clan. The clan of the house of David by itself and their wives by themselves, the clan of the house of Nathan by itself, and their wives by themselves, "},{"num":13,"verse":"the clan of the house of Levi by itself and their wives by themselves, the clan of the Shimeites by itself and their wives by themselves."},{"num":14,"verse":"Each of the remaining clans will mourn by itself and their wives by themselves.”"}]