[{"header":"The Unrighteous Steward: Use Earthly Money For Heavenly Gain"},{"num":16,"verse":"And He was also saying to the disciples, “There was a certain rich man who had a steward. And this one was accused to him as squandering his possessions. "},{"num":2,"verse":"And having called him, he said to him, ‘What is this I am hearing about you? Render the account of your stewardship, for you can no longer be steward’. "},{"num":3,"verse":"And the steward said within himself, ‘What should I do, because my master is taking-away the stewardship from me? I am not strong-enough to dig. I am ashamed to beg. "},{"num":4,"verse":"I know what I will do so that they will welcome me into their houses when I am removed from the stewardship’. "},{"num":5,"verse":"And having summoned each one of the debtors of his master, he was saying to the first, ‘How much do you owe to my master?’ "},{"num":6,"verse":"And the one said, ‘A hundred baths of olive-oil’. And the one said to him, ‘Take your writings, and having sat-down quickly, write fifty’. "},{"num":7,"verse":"Then he said to another, ‘And you, how much do you owe?’ And the one said, ‘A hundred cor of wheat’. He says to him, ‘Take your writings, and write eighty’. "},{"num":8,"verse":"And the master praised the unrighteous steward because he acted shrewdly. Because the sons of  this age are more shrewd in-relation-to their own kind than the sons of the light. "},{"num":9,"verse":"And I say to you— make friends for yourselves by means of unrighteous wealth, so that when it fails they will welcome you into the eternal dwellings. "},{"num":10,"verse":"The one trustworthy in a very-little thing is also trustworthy in much. And the one unrighteous in a very little thing is also unrighteous in much. "},{"num":11,"verse":"Therefore if you did not prove-to-be trustworthy with unrighteous wealth, who will entrust the true thing to you? "},{"num":12,"verse":"And if you did not prove-to-be trustworthy with the thing belonging to another, who will give you your own thing? "},{"num":13,"verse":"No household-servant can be serving two masters. For either he will hate the one and love the other, or he will be devoted to one and disregard the other. You cannot be serving God and wealth”."},{"header":"Jesus Rebukes The Pharisees: The Thing You Highly Value Is Worthless To God"},{"num":14,"verse":"Now the Pharisees, being money-lovers, were listening-to all these things, and they were sneering-at Him. "},{"num":15,"verse":"And He said to them, “You are the ones declaring yourselves righteous in the sight of people, but God knows your hearts— because the highly-valued thing among people is an abomination in the sight of God. "},{"num":16,"verse":"The Law and the Prophets were until John. From that time on, the kingdom of God is being announced-as-good-news, and everyone is forcing-himself  into it. "},{"num":17,"verse":"But it is easier that the heaven and the earth should pass away than that one stroke of the Law should fail. "},{"num":18,"verse":"Everyone sending-away his wife and marrying another is committing-adultery. And the one marrying one having been sent-away from her husband is committing-adultery."},{"header":"The Rich Man And Lazarus: What God Values Is What Matters"},{"num":19,"verse":"“Now there was a certain rich man. And he was dressing himself in purple and fine-linen, radiantly enjoying-himself daily. "},{"num":20,"verse":"And a certain poor man, Lazarus by name, had been put at his gate— having been covered-with-sores, "},{"num":21,"verse":"and desiring to be filled-to-satisfaction by the things falling from the table of the rich man. Even indeed the dogs coming were licking his sores. "},{"num":22,"verse":"And it came about that the poor man died and he was carried-away by the angels to the bosom of Abraham. And the rich man also died and was buried. "},{"num":23,"verse":"And having lifted-up his eyes in Hades while being in torments, he sees Abraham from a-distance, and Lazarus in his bosom. "},{"num":24,"verse":"And he, having called, said, ‘Father Abraham, have-mercy-on me and send Lazarus in order that he may dip the tip of his finger in water and cool-off my tongue, because I am suffering-pain in this flame’. "},{"num":25,"verse":"But Abraham said, ‘Child, remember that during your life you received your good things, and likewise Lazarus the bad things. But now, here, he is being comforted and you are suffering-pain. "},{"num":26,"verse":"And in all these regions, a great chasm has been fixed between us and you, so that the ones wanting to cross from here to you are not able, nor may they cross-over from there to us’. "},{"num":27,"verse":"And he said, ‘Then I ask you, father, that you send him to the house of my father— "},{"num":28,"verse":"for I have five brothers— so that he may solemnly-warn them in order that they also might not come to this place of torment’. "},{"num":29,"verse":"But Abraham says, ‘They have Moses and the Prophets. Let them listen-to them’. "},{"num":30,"verse":"But the one said, ‘No, father Abraham. But if someone goes to them from the dead, they will repent’. "},{"num":31,"verse":"But he said to him, ‘If they do not listen-to Moses and the Prophets, neither will they be persuaded if someone rises-up from the dead’”."}]