[{"header":"The parable of the shrewd manager"},{"num":16,"verse":"Jesus told his disciples: ‘There was a rich man whose manager was accused of wasting his possessions. "},{"num":2,"verse":"So he called him in and asked him, “What is this I hear about you? Give an account of your management, because you cannot be manager any longer.”"},{"num":3,"verse":"‘The manager said to himself, “What shall I do now? My master is taking away my job. I’m not strong enough to dig, and I’m ashamed to beg –  "},{"num":4,"verse":"I know what I’ll do so that, when I lose my job here, people will welcome me into their houses.”"},{"num":5,"verse":"‘So he called in each one of his master’s debtors. He asked the first, “How much do you owe my master?”"},{"num":6,"verse":"‘“Three thousand litres of olive oil,” he replied."},{"num":7,"verse":"‘Then he asked the second, “And how much do you owe?”"},{"num":8,"verse":"‘The master commended the dishonest manager because he had acted shrewdly. For the people of this world are more shrewd in dealing with their own kind than are the people of the light. "},{"num":9,"verse":"I tell you, use worldly wealth to gain friends for yourselves, so that when it is gone, you will be welcomed into eternal dwellings."},{"num":10,"verse":"‘Whoever can be trusted with very little can also be trusted with much, and whoever is dishonest with very little will also be dishonest with much. "},{"num":11,"verse":"So if you have not been trustworthy in handling worldly wealth, who will trust you with true riches? "},{"num":12,"verse":"And if you have not been trustworthy with someone else’s property, who will give you property of your own?"},{"num":13,"verse":"‘No one can serve two masters. Either you will hate the one and love the other, or you will be devoted to the one and despise the other. You cannot serve both God and Money.’"},{"num":14,"verse":"The Pharisees, who loved money, heard all this and were sneering at Jesus. "},{"num":15,"verse":"He said to them, ‘You are the ones who justify yourselves in the eyes of others, but God knows your hearts. What people value highly is detestable in God’s sight."},{"header":"Additional teachings"},{"num":16,"verse":"‘The Law and the Prophets were proclaimed until John. Since that time, the good news of the kingdom of God is being preached, and everyone is forcing their way into it. "},{"num":17,"verse":"It is easier for heaven and earth to disappear than for the least stroke of a pen to drop out of the Law."},{"num":18,"verse":"‘Anyone who divorces his wife and marries another woman commits adultery, and the man who marries a divorced woman commits adultery."},{"header":"The rich man and Lazarus"},{"num":19,"verse":"‘There was a rich man who was dressed in purple and fine linen and lived in luxury every day. "},{"num":20,"verse":"At his gate was laid a beggar named Lazarus, covered with sores "},{"num":21,"verse":"and longing to eat what fell from the rich man’s table. Even the dogs came and licked his sores."},{"num":22,"verse":"‘The time came when the beggar died and the angels carried him to Abraham’s side. The rich man also died and was buried. "},{"num":23,"verse":"In Hades, where he was in torment, he looked up and saw Abraham far away, with Lazarus by his side. "},{"num":24,"verse":"So he called to him, “Father Abraham, have pity on me and send Lazarus to dip the tip of his finger in water and cool my tongue, because I am in agony in this fire.”"},{"num":25,"verse":"‘But Abraham replied, “Son, remember that in your lifetime you received your good things, while Lazarus received bad things, but now he is comforted here and you are in agony. "},{"num":26,"verse":"And besides all this, between us and you a great chasm has been set in place, so that those who want to go from here to you cannot, nor can anyone cross over from there to us.”"},{"num":27,"verse":"‘He answered, “Then I beg you, father, send Lazarus to my family, "},{"num":28,"verse":"for I have five brothers. Let him warn them, so that they will not also come to this place of torment.”"},{"num":29,"verse":"‘Abraham replied, “They have Moses and the Prophets; let them listen to them.”"},{"num":30,"verse":"‘“No, father Abraham,” he said, “but if someone from the dead goes to them, they will repent.”"},{"num":31,"verse":"‘He said to him, “If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.”’"}]