[{"header":"The Sacred Chest"},{"num":37,"verse":"Bezalel built a chest of acacia wood forty-five inches long, twenty-seven inches wide, and twenty-seven inches high. "},{"num":2,"verse":"He covered it inside and out with pure gold and put a gold edging around the top. "},{"num":3,"verse":"He made four gold rings and fastened one of them to each of the four legs of the chest. "},{"num":4,"verse":"Then he made two poles of acacia wood, covered them with gold, "},{"num":5,"verse":"and put them through the rings, so the chest could be carried by the poles."},{"num":6,"verse":"The entire lid of the chest, which was also covered with pure gold, was the place of mercy. "},{"num":7,"verse":"On each of the two ends of the chest he made a winged creature of hammered gold. They faced each other, and their wings covered the place of mercy."},{"header":"The Table for the Sacred Bread"},{"num":10,"verse":"Bezalel built a table of acacia wood thirty-six inches long, eighteen inches wide, and twenty-seven inches high. "},{"num":11,"verse":"He covered it with pure gold and put a gold edging around it with a border three inches wide. "},{"num":13,"verse":"He made four gold rings and attached one to each of the legs "},{"num":14,"verse":"near the edging. The poles for carrying the table were placed through these rings "},{"num":15,"verse":"and were made of acacia wood covered with gold. "},{"num":16,"verse":"Everything that was to be set on the table was made of pure gold—the bowls, plates, jars, and cups for wine offerings."},{"header":"The Lampstand"},{"num":17,"verse":"Bezalel made a lampstand of pure gold. The whole lampstand, including its decorative flowers, was made from a single piece of hammered gold, "},{"num":18,"verse":"with three branches on each of its two sides. "},{"num":19,"verse":"There were three decorative almond blossoms on each branch "},{"num":20,"verse":"and four on the stem. "},{"num":21,"verse":"There was also a blossom where each pair of branches came out from the stem. "},{"num":22,"verse":"The lampstand, including its branches and decorative flowers, was made from a single piece of hammered pure gold. "},{"num":23,"verse":"The lamp and its equipment, including the tongs and trays, were made of about seventy-five pounds of pure gold."},{"header":"The Altar for Burning Incense"},{"num":25,"verse":"For burning incense, Bezalel made an altar of acacia wood. It was eighteen inches square and thirty-six inches high with each of its four corners sticking up like the horn of a bull. "},{"num":26,"verse":"He covered it with pure gold and put a gold edging around it. "},{"num":27,"verse":"Then below the edging on opposite sides he attached two gold rings through which he put the poles for carrying the altar. "},{"num":28,"verse":"These poles were also made of acacia wood and covered with gold."},{"header":"The Oil for Dedication and the Incense"},{"num":29,"verse":"Bezalel mixed the oil for dedication and the sweet-smelling spices for the incense."}]