[{"num":37,"verse":"B’tzal’el made the ark of acacia-wood three-and-three-quarters feet long, two-and-a-quarter feet wide and two-and-a-quarter feet high. "},{"num":2,"verse":"He overlaid it with pure gold inside and outside and put a molding of gold for it around the top. "},{"num":3,"verse":"He cast four gold rings for it at its four feet, two rings on each side. "},{"num":4,"verse":"He made poles of acacia-wood and overlaid them with gold. "},{"num":5,"verse":"He put the carrying-poles for the ark in the rings on the sides of the ark."},{"num":6,"verse":"He made a cover for the ark of pure gold, three-and-three-quarters feet long and two-and-a-quarter feet wide. "},{"num":7,"verse":"He made two k’ruvim of gold; he made them of hammered work for the two ends of the ark-cover — "},{"num":8,"verse":"one keruv for one end and one keruv for the other end; he made the k’ruvim of one piece with the ark-cover at its two ends. "},{"num":9,"verse":"The k’ruvim had their wings spread out above, so that their wings covered the ark; their faces were toward each other and toward the ark-cover."},{"num":10,"verse":"He made the table of acacia-wood, three feet long, eighteen inches wide and eighteen inches high. "},{"num":11,"verse":"He overlaid it with pure gold and put a molding of gold around the top of it. "},{"num":12,"verse":"He made around it a rim a handbreadth wide and put a molding of gold around the rim. "},{"num":13,"verse":"He cast for it four gold rings and attached the rings to the four corners, near its four legs. "},{"num":14,"verse":"The rings to hold the carrying-poles for the table were placed close to the rim. "},{"num":15,"verse":"He made the carrying-poles for the table of acacia-wood and overlaid them with gold. "},{"num":16,"verse":"He made the utensils to be put on the table — its dishes, pans, bowls and pitchers — of pure gold."},{"num":17,"verse":"(RY: iii, LY: vi) He made the menorah of pure gold. He made it of hammered work; its base, shaft, cups, rings of outer leaves and flowers were a single unit. "},{"num":18,"verse":"There were six branches extending from its sides, three branches of the menorah on one side of it and three on the other. "},{"num":19,"verse":"On one branch were three cups shaped like almond blossoms, a ring of outer leaves and petals; likewise on the opposite branch three cups shaped like almond blossoms, a ring of outer leaves and petals; and similarly for all six branches extending from the menorah. "},{"num":20,"verse":"On the central shaft of the menorah were four cups shaped like almond blossoms, each with its ring of outer leaves and petals. "},{"num":21,"verse":"Where each pair of branches joined the central shaft was a ring of outer leaves of one piece with the pair of branches — thus for all six branches. "},{"num":22,"verse":"Their rings of outer leaves and their branches were of one piece with the shaft. Thus the whole menorah was one piece of hammered work made of pure gold. "},{"num":23,"verse":"He made its seven lamps, its tongs and its trays of pure gold. "},{"num":24,"verse":"The menorah and its utensils were made of sixty-six pounds of pure gold."},{"num":25,"verse":"He made the altar on which to burn incense of acacia-wood, eighteen inches square and three feet high; its horns were a single unit. "},{"num":26,"verse":"He overlaid it with pure gold — its top, all around its sides and its horns; and he put around it a molding of gold. "},{"num":27,"verse":"He made two gold rings for it under its molding at the two corners on both sides, to hold the carrying-poles. "},{"num":28,"verse":"He made the poles of acacia-wood and overlaid them with gold."},{"num":29,"verse":"He made the holy anointing oil and the pure incense of aromatic plant substances as would an expert perfume-maker."}]