[{"num":37,"verse":"¶ Bezaleel also made the ark of cedar wood; two cubits and a half was the length of it, a cubit and a half the breadth of it, and a cubit and a half the height of it;"},{"num":2,"verse":"and he covered it with pure gold within and without and made a moulding of gold to it round about."},{"num":3,"verse":"And he cast for it four rings of gold, to be set by the four corners of it: even two rings upon the one side of it and two rings upon the other side of it."},{"num":4,"verse":"He also made the staves of cedar wood and covered them with gold."},{"num":5,"verse":"And he put the staves into the rings by the sides of the ark, to bear the ark."},{"num":6,"verse":"He made the seat of reconciliation likewise of pure gold; two cubits and a half was its length, and one cubit and a half its breadth."},{"num":7,"verse":"He also made the two cherubim of gold, beaten out of one piece he made them, on the two ends of the seat of reconciliation;"},{"num":8,"verse":"one cherub on the end on this side and another cherub on the other end on that side of the seat of reconciliation; he made the cherubim on the two ends thereof."},{"num":9,"verse":"And the cherubim spread out their wings above, covering with their wings the seat of reconciliation, with their faces one to another; the faces of the cherubim were facing the covering."},{"num":10,"verse":"¶ And he made the table of cedar wood; two cubits was the length thereof and a cubit the breadth thereof and a cubit and a half the height thereof;"},{"num":11,"verse":"and he covered it with pure gold and made it a moulding of gold round about."},{"num":12,"verse":"He also made it a border of a handbreadth round about and made a moulding of gold for the border thereof round about."},{"num":13,"verse":"And he cast for it four rings of gold and put the rings upon the four corners that correspond to the four feet thereof."},{"num":14,"verse":"Over against the border were the rings, the places for the staves to bear the table."},{"num":15,"verse":"And he made the staves of cedar wood and covered them with gold, to bear the table."},{"num":16,"verse":"He also made the vessels which were upon the table, its dishes, its spoons, its bowls, and its covers to cover the bread, of pure gold."},{"num":17,"verse":"He made the lampstand likewise of pure gold; of beaten work he made the lampstand, its shaft and its branch, its bowls, its knops, and its flowers were of the same."},{"num":18,"verse":"Out of the sides thereof went six branches, three branches out of one side of the lampstand and three branches out of the other side of the lampstand;"},{"num":19,"verse":"in one branch there were three bowls made after the fashion of almonds, a knop and a flower; and in the other branch there were three bowls made like almonds, a knop and a flower, so throughout the six branches going out of the lampstand."},{"num":20,"verse":"And in the lampstand were four bowls made like almonds, their knops, and their flowers,"},{"num":21,"verse":"and a knop under the two branches of the same and another knop under two branches of the same and a knop under the two other branches of the same, according to the six branches going out of it."},{"num":22,"verse":"Their knops and their branches were of the same; all of it was one beaten work of pure gold."},{"num":23,"verse":"He made likewise its seven lamps and its snuffers and its snuff dishes of pure gold."},{"num":24,"verse":"Of a talent of pure gold he made it and all its vessels."},{"num":25,"verse":"¶ He also made the altar of incense of cedar wood: the length of it was a cubit and the breadth of it a cubit; it was square; and two cubits was the height of it; its horns were of the same piece."},{"num":26,"verse":"And he covered it with pure gold, its top and its sides round about and its horns; and he made it a moulding of gold round about."},{"num":27,"verse":"He also made two rings of gold for it under the moulding thereof, by the two corners of it, upon its two sides, to be places for the staves to bear it with."},{"num":28,"verse":"And he made the staves of cedar wood and covered them with gold."},{"num":29,"verse":"He made likewise the oil of the holy anointing and the pure aromatic incense, according to the work of the apothecary."}]