[[],[{"type":"header","content":"The Making of the Ark"},{"type":"prose","content":"Bezalel made the ark of acacia wood; its length was 45 inches, its width 27 inches, and its height 27 inches. "}],[{"type":"prose","content":"He overlaid it with pure gold, inside and out, and he made a surrounding border of gold for it. "}],[{"type":"prose","content":"He cast four gold rings for it that he put on its four feet, with two rings on one side and two rings on the other side. "}],[{"type":"prose","content":"He made poles of acacia wood, overlaid them with gold, "}],[{"type":"prose","content":"and put the poles into the rings on the sides of the ark in order to carry the ark."}],[{"type":"prose","content":"He made an atonement lid of pure gold; its length was 45 inches, and its width was 27 inches. "}],[{"type":"prose","content":"He made two cherubim of gold; he made them of hammered metal on the two ends of the atonement lid, "}],[{"type":"prose","content":"one cherub on one end and one cherub on the other end. He made the cherubim from the atonement lid on its two ends. "}],[{"type":"prose","content":"The cherubim were spreading their wings upward, overshadowing the atonement lid with their wings. The cherubim faced each other, looking toward the atonement lid."},{"type":"header","content":"The Making of the Table"}],[{"type":"prose","content":"Bezalel made the table of acacia wood; its length was 36 inches, its width 18 inches, and its height 27 inches. "}],[{"type":"prose","content":"He overlaid it with pure gold, and he made a surrounding border of gold for it. "}],[{"type":"prose","content":"He made a surrounding frame for it about three inches wide, and he made a surrounding border of gold for its frame. "}],[{"type":"prose","content":"He cast four gold rings for it and attached the rings at the four corners where its four legs were. "}],[{"type":"prose","content":"The rings were close to the frame to provide places for the poles to carry the table. "}],[{"type":"prose","content":"He made the poles of acacia wood and overlaid them with gold, to carry the table. "}],[{"type":"prose","content":"He made the vessels which were on the table out of pure gold, its plates, its ladles, its pitchers, and its bowls, to be used in pouring out offerings."},{"type":"header","content":"The Making of the Lampstand"}],[{"type":"prose","content":"Bezalel made the lampstand of pure gold. He made the lampstand of hammered metal; its base and its shaft, its cups, its buds, and its blossoms were from the same piece. "}],[{"type":"prose","content":"Six branches were extending from its sides, three branches of the lampstand from one side of it, and three branches of the lampstand from the other side of it. "}],[{"type":"prose","content":"Three cups shaped like almond flowers with buds and blossoms were on the first branch, and three cups shaped like almond flowers with buds and blossoms were on the next branch, and the same for the six branches that were extending from the lampstand. "}],[{"type":"prose","content":"On the lampstand there were four cups shaped like almond flowers with buds and blossoms, "}],[{"type":"prose","content":"with a bud under the first two branches from it, and a bud under the next two branches from it, and a bud under the third two branches from it; according to the six branches that extended from it. "}],[{"type":"prose","content":"Their buds and their branches were of one piece; all of it was one hammered piece of pure gold. "}],[{"type":"prose","content":"He made its seven lamps, its trimmers, and its trays of pure gold. "}],[{"type":"prose","content":"He made the lampstand and all its accessories with seventy-five pounds of pure gold."},{"type":"header","content":"The Making of the Altar of Incense"}],[{"type":"prose","content":"Bezalel made the incense altar of acacia wood. Its length was 18 inches and its width 18 inches—a square—and its height was 36 inches. Its horns were of one piece with it. "}],[{"type":"prose","content":"He overlaid it with pure gold—its top, its four walls, and its horns—and he made a surrounding border of gold for it. "}],[{"type":"prose","content":"He also made two gold rings for it under its border, on its two sides, on opposite sides, as places for poles to carry it with. "}],[{"type":"prose","content":"He made the poles of acacia wood and overlaid them with gold."}],[{"type":"prose","content":"He made the sacred anointing oil and the pure fragrant incense, the work of a perfumer."}]]