[[],[{"type":"prose","content":"And Bildad the Shuhite answereth and saith: --"}],[{"type":"prose","content":"Till when dost thou speak these things? And a strong wind -- sayings of thy mouth?"}],[{"type":"prose","content":"Doth God pervert judgment? And doth the Mighty One pervert justice?"}],[{"type":"prose","content":"If thy sons have sinned before Him, And He doth send them away, By the hand of their transgression,"}],[{"type":"prose","content":"If thou dost seek early unto God, And unto the Mighty makest supplication,"}],[{"type":"prose","content":"If pure and upright thou [art], Surely now He waketh for thee, And hath completed The habitation of thy righteousness."}],[{"type":"prose","content":"And thy beginning hath been small, And thy latter end is very great."}],[{"type":"prose","content":"For, ask I pray thee of a former generation, And prepare to a search of their fathers,"}],[{"type":"prose","content":"(For of yesterday we [are], and we know not, For a shadow [are] our days on earth.)"}],[{"type":"prose","content":"Do they not shew thee -- speak to thee, And from their heart bring forth words?"}],[{"type":"prose","content":"`Doth a rush wise without mire? A reed increase without water?"}],[{"type":"prose","content":"While it [is] in its budding -- uncropt, Even before any herb it withereth."}],[{"type":"prose","content":"So [are] the paths of all forgetting God, And the hope of the profane doth perish,"}],[{"type":"prose","content":"Whose confidence is loathsome, And the house of a spider his trust."}],[{"type":"prose","content":"He leaneth on his house -- and it standeth not: He taketh hold on it -- and it abideth not."}],[{"type":"prose","content":"Green he [is] before the sun, And over his garden his branch goeth out."}],[{"type":"prose","content":"By a heap his roots are wrapped, A house of stones he looketh for."}],[{"type":"prose","content":"If [one] doth destroy him from his place, Then it hath feigned concerning him, I have not seen thee!"}],[{"type":"prose","content":"Lo, this [is] the joy of his way, And from the dust others spring up.'"}],[{"type":"prose","content":"Lo, God doth not reject the perfect, Nor taketh hold on the hand of evil doers."}],[{"type":"prose","content":"While he filleth with laughter thy mouth, And thy lips with shouting,"}],[{"type":"prose","content":"Those hating thee do put on shame, And the tent of the wicked is not!"}]]