[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The hands of a man.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Implying, of course, also human arms. This particular adds to the generally human appearance of the cherubim, yet we must understand (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that there were four hands corresponding to the wings for each cherub. These hands were “under their wings on their four sides.” Hence the wings must have been attached at the shoulder. The repetition, “they four had their faces and their wings,” is for the sake of emphasis and distinctness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-14 It is a mercy to have the word of God brought to us, and a duty to attend to it diligently, when we are in affliction. The voice of God came in the fulness of light and power, by the Holy Spirit. These visions seem to have been sent to possess the prophet's mind with great and high thoughts of God. To strike terror upon sinners. To speak comfort to those that feared God, and humbled themselves. In ver. 4-14, is the first part of the vision, which represents God as attended and served by a vast company of angels, who are all his messengers, his ministers, doing his commandments. This vision would impress the mind with solemn awe and fear of the Divine displeasure, yet raise expectations of blessings. The fire is surrounded with a glory. Though we cannot by searching find out God to perfection, yet we see the brightness round about it. The likeness of the living creatures came out of the midst of the fire; angels derive their being and power from God. They have the understanding of a man, and far more. A lion excels in strength and boldness. An ox excels in diligence and patience, and unwearied discharge of the work he has to do. An eagle excels in quickness and piercing sight, and in soaring high; and the angels, who excel man in all these respects, put on these appearances. The angels have wings; and whatever business God sends them upon, they lose no time. They stood straight, and firm, and steady. They had not only wings for motion, but hands for action. Many persons are quick, who are not active; they hurry about, but do nothing to purpose; they have wings, but no hands. But wherever the angels' wings carried them, they carried hands with them, to be doing what duty required. Whatever service they went about, they went every one straight forward. When we go straight, we go forward; when we serve God with one heart, we perform work. They turned not when they went. They made no mistakes; and their work needed not to be gone over again. They turned not from their business to trifle with any thing. They went whithersoever the Spirit of God would have them go. The prophet saw these living creatures by their own light, for their appearance was like burning coals of fire; they are seraphim, or burners; denoting the ardour of their love to God, and fervent zeal in his service. We may learn profitable lessons from subjects we cannot fully enter into or understand. But let us attend to the things which relate to our peace and duty, and leave secret things to the Lord, to whom alone they belong.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Or, \"They had the hands of a man under their wings on all four sides, just as they had wings and faces on all four sides.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. The hands of each were the hands of a man. The hand is the symbol of active power, guided by skilfulness (Ps 78:72).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "under their wings—signifying their operations are hidden from our too curious prying; and as the \"wings\" signify something more than human, namely, the secret prompting of God, it is also implied that they are moved by it and not by their own power, so that they do nothing at random, but all with divine wisdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they four had … faces and … wings—He returns to what he had stated already in Eze 1:6; this gives a reason why they had hands on their four sides, namely, because they had faces and wings on the four sides. They moved whithersoever they would, not by active energy merely, but also by knowledge (expressed by their faces) and divine guidance (expressed by their \"wings\").",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " each of the four living creatures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Had the hands:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hands in every language, especially in the Oriental, imply power; and being the chief instruments of action, are here ascribed to these active instruments that execute the commands of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of a man:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is added to denote the wisdom, dexterity, and vigilance wherewith they discharge their ministry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Under their wings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their power and manner of exerting it is secret and invisible, and it is put forth as God pleaseth to move them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "On their four sides; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on each side of the chariot one of these living creatures stood, and so on each side hands were ready to act as they were moved; and though it was to all parts of the world, yet were they most ready and prepared. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they four had their faces and their wings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is doubled to confirm the truth and certainty of the thing, and to intimate the greatness of their power, agility, and wisdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they had the hands of a man under their wings on their four sides,.... \"Hands of a man\" denote action, according to knowledge; ministers of the Gospel are men of practice and business, as well as have the theory and knowledge of things; and they act like men in a rational way, according to the will of God revealed in the word: and these being \"on their four sides\", show that they have much work to do all around, on every side; in ministering the word, administering ordinances; visiting their people; giving counsel, caution, comfort, exhortation, instruction, &c. and that they have many hands to do, it with, much grace and strength from above; and they have need of all the hands they have; and what they have they constantly employ, and are steadfast and immovable, always abounding in the work of the Lord. Briareus, a man of business, is represented by the poets as having a hundred hands. These being \"under their wings\", show that, besides their public ministrations, they do much work secretly and privately, in their closet and studies, where no eye sees them but the eye of God, as well as in private houses, by their visits and conversation; and is also expressive of their modesty and humility, not doing what they do to be seen of men, nor boasting of their works; but ascribing all to the grace of God, and strength of Christ, by which they perform them, and which give them success The Jews, in the Talmud (m), interpret this of the hand of God himself which is stretched out under the wings of the living creatures, to receive penitent persons; because it is written  \"his hand\", but read  \"hands\". And they four had their faces and their wings; that is, on their four sides; a face and a wing before, and a face and a wing behind, and a face and a wing on each side; and under each wing a man's hand and arm. The Targum of the whole is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and hands, as the hands of a man, were made for them under their wings on their four sides; to take in them coals of fire from between the cherubim under the firmament, which was over their seats, to, put them into the hands of the seraphim, to scatter upon the place of the ungodly, to destroy the wicked that transgress his word; and their faces and their wings were equal to them four;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "see Ezekiel 10:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Bab. Pesachim, fol. 119. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Bab. Pesachim, fol. 119. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they had the hands of a man under their wings on their four sides; and they four had their faces and their wings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Each living creature appears to have had four hands or arms, cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The last words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " must be joined with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " : “and their faces and their wings, of them four—their wings were joined one to another; they turned not when they went, they went every one straightforward.” The meaning is that as each creature with his outstretched wings formed one side of the square his wings touched or were joined to those of two other creatures, one on his right and another on his left. The words “they turned not” refer to the faces. The above sentence is very awkward, and the whole is given by LXX. in a much shorter form: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and the faces of them four ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " turned not when they went, they went every one straightforward. The clauses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb.) correspond respectively to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 1:11-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:11-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They had the hands of a man, etc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet seems to describe each detail in the order in which it presented itself to him. What he next sees is that each of the four forms has two hands on each of its four sides. Nothing could supersede that symbol of activity and strength. Ezekiel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The four cherubim. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And out of its midst there prominently appeared a figure, consisting of four creatures, and this was their appearance: they had the figure of a man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And each had four faces, and each of them had four wings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And their feet were upright-standing feet; and the soles of their feet like the soles of a calf, and sparkling like the appearance of shining brass. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the hands of a man were under their wings on their four sides; and all four had faces and wings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their wings were joined one to another; they turned not as they went; they went each one in the direction of his face. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the form of their faces was that of a man; and on the right all four had a lion's face; and on the left all four had the face of an ox; and all four had an eagle's face. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And their faces and their wings were divided above, two of each uniting with one another, and two covering their bodies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And they went each in the direction of his face; whithersoever the spirit was to go, they went; they turned not as they went. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the likeness of the creatures resembled burning coals of fire, like the appearance of torches: it (the fire) went hither and thither amongst the beings; and the fire was brilliant, and from the fire came forth lightning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the beings ran hither and thither in a zig-zag manner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From out of the fiery centre of the cloud there shows itself the form (tw%md@;, properly \"resemblance,\" \"picture\") of four חיּות, animantia, \"living creatures;\" ζῶα, Revelation 4:6; not θηρία, \"wild beasts,\" as Luther has incorrectly rendered it, after the animalia of the Vulgate. These four creatures had דּמוּת  אדם, \"the figure of a man.\" Agreeably to this notice, placed at the head of the description, these creatures are to be conceived as presenting the appearance of a human body in all points not otherwise specified in the following narrative. Each of them had four faces and four wings (אחת without the article stands as a distributive, and כּנפים are \"pinions,\" as in Isaiah 6:2, not \"pairs of wings\"). Their feet were רגל ישׁרה, \"a straight foot;\" the singular stands generically, stating only the nature of the feet, without reference to their number. We have accordingly to assume in each of the four creatures two legs, as in a man. ישׁר .nam a , \"straight,\" i.e., standing upright, not bent, as when sitting or kneeling. רגל is the whole leg, including the knee and thigh, and כּף רגל, \"sole of the foot,\" or the under part of the leg, with which we tread on the ground. This part, not the whole leg, resembled the calf's foot, which is firmly planted on the ground. The legs sparkled like the appearance of נחשׁה קלל. The subject of נצצים is not \"the כּרוּבים, which are understood to be intended under the חיּות in verse fifth\" (Hitzig), for this subject is too far distant, but רגליהם, which is here construed as masculine, as in Jeremiah 13:16. In this sense are these words apprehended in Revelation 1:15, and נחשׁת  there translated by χαλκολίβανος. On this word see Hengstenberg and Dsterdieck on Revelation 1:15. נח' קלל probably signifies \"light,\" i.e., \"bright, shining brass,\" as the old translators have rendered it. The Septuagint has ἐξαστράπτων; the Vulgate, aes candens; and the Chaldee paraphrase, aes flammans. The signification \"smoothed, polished brass\" (Bochart), rests upon uncertain combinations; cf. Gesen. Thes. p. 1217, and is appropriate neither here nor in Daniel 10:6, where these words precede, \"His face had the appearance of lightning, and his eyes were as a flame of fire.\" Under the four wings were four hands on the four sides of each cherub, formed like the hands of a man. The wings accordingly rested upon the shoulders, from which the hands came forth. The Chetib וידו may certainly be defended if with Kimchi and others we punctuate וידו, and take the suffix distributively and אדם elliptically, \"his (i.e., each of the four creatures) hands were (the hands of) a man;\" cf. for such an ellipsis as this, passages like that in Psalm 18:34, רגלי כּאיּלות, \"my feet as the (feet) of hinds;\" Job 35:2, מאל, \"before the righteousness of God.\" It is extremely probable, however, that ו is only the error of an old copyist for י, and that the Keri וידי is the correct reading, as the taking of אדם elliptically is not in keeping with the broad style of Ezekiel, which in its verbosity verges on tautology. The second half of Ezekiel 1:8 is neither, with Hvernick, to be referred to the following ninth verse, where the faces are no more spoken of, nor, with Hitzig, to be arbitrarily mutilated; but is to be taken as it stands, comprising all that has hitherto been said regarding the faces and wings, in order to append thereto in Ezekiel 1:9. the description of the use and nature of these members. The definite statement, that \"the wings were joined one to another,\" is in Ezekiel 1:11 limited to the two upper wings, according to which we have so to conceive the matter, that the top or the upper right wing of each cherub came in contact with the top of the left wing of the neighbouring cherub. This junction presented to the eye of the seer the unity and coherence of all the four creatures as a complete whole - a  חיּה, and implied, as a consequence, the harmonious action in common of the four creatures. They did not turn as they went along, but proceeded each in the direction of his face. אל, \"over against his face.\" The meaning is thus rightly given by Kliefoth: \"As they had four faces, they needed not to turn as they went, but went on as (i.e., in the direction in which) they were going, always after the face.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From out of the fiery centre of the cloud there shows itself the form (tw%md@;, properly \"resemblance,\" \"picture\") of four חיּות, animantia, \"living creatures;\" ζῶα, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not θηρία, \"wild beasts,\" as Luther has incorrectly rendered it, after the animalia of the Vulgate. These four creatures had דּמוּת  אדם, \"the figure of a man.\" Agreeably to this notice, placed at the head of the description, these creatures are to be conceived as presenting the appearance of a human body in all points not otherwise specified in the following narrative. Each of them had four faces and four wings (אחת without the article stands as a distributive, and כּנפים are \"pinions,\" as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not \"pairs of wings\"). Their feet were רגל ישׁרה, \"a straight foot;\" the singular stands generically, stating only the nature of the feet, without reference to their number. We have accordingly to assume in each of the four creatures two legs, as in a man. ישׁר .nam a , \"straight,\" i.e., standing upright, not bent, as when sitting or kneeling. רגל is the whole leg, including the knee and thigh, and כּף רגל, \"sole of the foot,\" or the under part of the leg, with which we tread on the ground. This part, not the whole leg, resembled the calf's foot, which is firmly planted on the ground. The legs sparkled like the appearance of נחשׁה קלל. The subject of נצצים is not \"the כּרוּבים, which are understood to be intended under the חיּות in verse fifth\" (Hitzig), for this subject is too far distant, but רגליהם, which is here construed as masculine, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this sense are these words apprehended in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and נחשׁת  there translated by χαλκολίβανος. On this word see Hengstenberg and Dsterdieck on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". נח' קלל probably signifies \"light,\" i.e., \"bright, shining brass,\" as the old translators have rendered it. The Septuagint has ἐξαστράπτων; the Vulgate, aes candens; and the Chaldee paraphrase, aes flammans. The signification \"smoothed, polished brass\" (Bochart), rests upon uncertain combinations; cf. Gesen. Thes. p. 1217, and is appropriate neither here nor in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where these words precede, \"His face had the appearance of lightning, and his eyes were as a flame of fire.\" Under the four wings were four hands on the four sides of each cherub, formed like the hands of a man. The wings accordingly rested upon the shoulders, from which the hands came forth. The Chetib וידו may certainly be defended if with Kimchi and others we punctuate וידו, and take the suffix distributively and אדם elliptically, \"his (i.e., each of the four creatures) hands were (the hands of) a man;\" cf. for such an ellipsis as this, passages like that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", רגלי כּאיּלות, \"my feet as the (feet) of hinds;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", מאל, \"before the righteousness of God.\" It is extremely probable, however, that ו is only the error of an old copyist for י, and that the Keri וידי is the correct reading, as the taking of אדם elliptically is not in keeping with the broad style of Ezekiel, which in its verbosity verges on tautology. The second half of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is neither, with Hvernick, to be referred to the following ninth verse, where the faces are no more spoken of, nor, with Hitzig, to be arbitrarily mutilated; but is to be taken as it stands, comprising all that has hitherto been said regarding the faces and wings, in order to append thereto in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". the description of the use and nature of these members. The definite statement, that \"the wings were joined one to another,\" is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " limited to the two upper wings, according to which we have so to conceive the matter, that the top or the upper right wing of each cherub came in contact with the top of the left wing of the neighbouring cherub. This junction presented to the eye of the seer the unity and coherence of all the four creatures as a complete whole - a  חיּה, and implied, as a consequence, the harmonious action in common of the four creatures. They did not turn as they went along, but proceeded each in the direction of his face. אל, \"over against his face.\" The meaning is thus rightly given by Kliefoth: \"As they had four faces, they needed not to turn as they went, but went on as (i.e., in the direction in which) they were going, always after the face.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the closer description of the faces in Ezekiel 1:10, the face of the man is first mentioned as that which was turned towards the seer, that of the lion to the right side, the ox to the left, and that of the eagle (behind). In naming these three, it is remarked that all the four creatures had these faces: in naming the man's face, this remark is omitted, because the word פּניהם (referring to all the four) immediately precedes. In Ezekiel 1:11, it is next remarked of the faces and wings, that they were divided above (מלמעלה, \"from above,\" \"upward\"); then the direction of the wings is more precisely stated. The word וּפניהם is neither to be referred to the preceding, \"and it was their faces,\" nor, with Hitzig, to be expunged as a gloss; but is quite in order as a statement that not only the wings but also the faces were divided above, consequently were not like Janus' faces upon one head, but the four faces were planted upon four heads and necks. In the description that follows, חוברות אישׁ is not quite distinct, and #y)i is manifestly to be taken as an abbreviation of אשּׁה אל־אחותהּ in Ezekiel 1:9 : on each were two wings joining one another, i.e., touching with their tops the tips of the wings of the cherub beside them, in accordance with which we have to conceive the wings as expanded. Two were covering their bodies, i.e., each cherub covered his body with the pair of wings that folded downwards; not, as Kliefoth supposes, that the lower wings of the one cherub covered the body of the other cherub beside him, which also is not the meaning in Ezekiel 1:23; see note on that verse. In Ezekiel 1:12, what is to be said about their movements is brought to a conclusion, while both statements are repeated in Ezekiel 1:9, and completed by the addition of the principium movens. In whatever direction the רוּח \"was to go, in that direction they went;\" i.e., not according to the action of their own will, but wherever the רוּח impelled them. רוּח, however, signifies not \"impulse,\" nor, in this place, even \"the wind,\" as the vehicle of the power of the spiritual life palpable to the senses, which produced and guided their movements, (Kliefoth), but spirit. For, according to Ezekiel 1:20, the movement of the wheels, which was in harmony with the movements of the cherubim, was not caused by the wind, but proceeded from the רוּח החיּה, i.e., from the spirit dwelling in the creature. On the contrary, there is not in the whole description, with the exception of the general statement that a tempestuous wind drove from the north the great cloud in which the theophany was enwrapped, any allusion to a means of motion palpable to the senses. In the 13th and 14th verses is described the entire impression produced by the movement of the whole appearance. וּדמוּת החיּות precedes, and is taken absolutely \"as regards the form of the creatures,\" and corresponds to the דּמוּת  ארבּע  חיּות in Ezekiel 1:5, with which the description of the individual figures which appeared in the brightness of the fire was introduced. Their appearance was like burning coals of fire, like the appearance of torches. היא refers to אשׁ as the principal conception. Fire, like the fire of burning coals and torches, went, moved hither and thither amongst the four creatures. This fire presented a bright appearance, and out of it came forth lightnings. The creatures, moreover, were in constant motion. רצוא, from רצא, an Aramaising form for the Hebrew רוּץ, to run. The infin. absol. stands instead of the finite verb. The conjecture of יצוא, after Genesis 8:7 (Hitzig), is inappropriate, because here we have not to think of \"coming out,\" and no reason exists for the striking out of the words, as Hitzig proposes. The continued motion of the creatures is not in contradiction with their perpetually moving on straight before them. \"They went hither and thither, and yet always in the direction of their countenances; because they had a countenance looking in the direction of every side\" (Kliefoth). בּזק signifies not \"lightning\" ( equals בּרק), but comes from בּזק; in Syriac, \"to be split,\" and denotes \"the splitting,\" i.e., the zigzag course of the lightning (Kliefoth).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the closer description of the faces in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the face of the man is first mentioned as that which was turned towards the seer, that of the lion to the right side, the ox to the left, and that of the eagle (behind). In naming these three, it is remarked that all the four creatures had these faces: in naming the man's face, this remark is omitted, because the word פּניהם (referring to all the four) immediately precedes. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is next remarked of the faces and wings, that they were divided above (מלמעלה, \"from above,\" \"upward\"); then the direction of the wings is more precisely stated. The word וּפניהם is neither to be referred to the preceding, \"and it was their faces,\" nor, with Hitzig, to be expunged as a gloss; but is quite in order as a statement that not only the wings but also the faces were divided above, consequently were not like Janus' faces upon one head, but the four faces were planted upon four heads and necks. In the description that follows, חוברות אישׁ is not quite distinct, and #y)i is manifestly to be taken as an abbreviation of אשּׁה אל־אחותהּ in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : on each were two wings joining one another, i.e., touching with their tops the tips of the wings of the cherub beside them, in accordance with which we have to conceive the wings as expanded. Two were covering their bodies, i.e., each cherub covered his body with the pair of wings that folded downwards; not, as Kliefoth supposes, that the lower wings of the one cherub covered the body of the other cherub beside him, which also is not the meaning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see note on that verse. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", what is to be said about their movements is brought to a conclusion, while both statements are repeated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and completed by the addition of the principium movens. In whatever direction the רוּח \"was to go, in that direction they went;\" i.e., not according to the action of their own will, but wherever the רוּח impelled them. רוּח, however, signifies not \"impulse,\" nor, in this place, even \"the wind,\" as the vehicle of the power of the spiritual life palpable to the senses, which produced and guided their movements, (Kliefoth), but spirit. For, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the movement of the wheels, which was in harmony with the movements of the cherubim, was not caused by the wind, but proceeded from the רוּח החיּה, i.e., from the spirit dwelling in the creature. On the contrary, there is not in the whole description, with the exception of the general statement that a tempestuous wind drove from the north the great cloud in which the theophany was enwrapped, any allusion to a means of motion palpable to the senses. In the 13th and 14th verses is described the entire impression produced by the movement of the whole appearance. וּדמוּת החיּות precedes, and is taken absolutely \"as regards the form of the creatures,\" and corresponds to the דּמוּת  ארבּע  חיּות in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with which the description of the individual figures which appeared in the brightness of the fire was introduced. Their appearance was like burning coals of fire, like the appearance of torches. היא refers to אשׁ as the principal conception. Fire, like the fire of burning coals and torches, went, moved hither and thither amongst the four creatures. This fire presented a bright appearance, and out of it came forth lightnings. The creatures, moreover, were in constant motion. רצוא, from רצא, an Aramaising form for the Hebrew רוּץ, to run. The infin. absol. stands instead of the finite verb. The conjecture of יצוא, after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Hitzig), is inappropriate, because here we have not to think of \"coming out,\" and no reason exists for the striking out of the words, as Hitzig proposes. The continued motion of the creatures is not in contradiction with their perpetually moving on straight before them. \"They went hither and thither, and yet always in the direction of their countenances; because they had a countenance looking in the direction of every side\" (Kliefoth). בּזק signifies not \"lightning\" ( equals בּרק), but comes from בּזק; in Syriac, \"to be split,\" and denotes \"the splitting,\" i.e., the zigzag course of the lightning (Kliefoth).",
            "children": []
          }
        ]
      }
    ]
  }
]