[{"header":"Jesus Talks to a Woman in Samaria"},{"num":4,"verse":"Jesus learned that the Pharisees had heard the report that he was making and baptizing more followers than John."},{"num":2,"verse":"(But really, Jesus himself did not baptize anyone; his followers baptized people for him.)"},{"num":3,"verse":"So he left Judea and went back to Galilee."},{"num":4,"verse":"On the way to Galilee, he had to go through the country of Samaria."},{"num":5,"verse":"In Samaria Jesus came to the town called Sychar, which is near the field that Jacob gave to his son Joseph."},{"num":6,"verse":"Jacob’s well was there. Jesus was tired from his long trip, so he sat down beside the well. It was about noon."},{"num":7,"verse":"A Samaritan woman came to the well to get some water, and Jesus said to her, “Please give me a drink.”"},{"num":8,"verse":"This happened while his followers were in town buying some food."},{"num":9,"verse":"The woman answered, “I am surprised that you ask me for a drink! You are a Jew and I am a Samaritan woman!” (Jews have nothing to do with Samaritans.)"},{"num":10,"verse":"Jesus answered, “You don’t know what God can give you. And you don’t know who I am, the one who asked you for a drink. If you knew, you would have asked me, and I would have given you living water.”"},{"num":11,"verse":"The woman said, “Sir, where will you get that living water? The well is very deep, and you have nothing to get water with."},{"num":12,"verse":"Are you greater than our ancestor Jacob? He is the one who gave us this well. He drank from it himself, and his sons and all his animals drank from it too.”"},{"num":13,"verse":"Jesus answered, “Everyone who drinks this water will be thirsty again."},{"num":14,"verse":"But anyone who drinks the water I give will never be thirsty again. The water I give people will be like a spring flowing inside them. It will bring them eternal life.”"},{"num":15,"verse":"The woman said to Jesus, “Sir, give me this water. Then I will never be thirsty again and won’t have to come back here to get more water.”"},{"num":16,"verse":"Jesus told her, “Go get your husband and come back.”"},{"num":17,"verse":"The woman answered, “But I have no husband.”"},{"num":18,"verse":"That’s because, although you have had five husbands, the man you live with now is not your husband. That much was the truth.”"},{"num":19,"verse":"The woman said, “Sir, I can see that you are a prophet."},{"num":20,"verse":"Our fathers worshiped on this mountain. But you Jews say that Jerusalem is the place where people must worship.”"},{"num":21,"verse":"Jesus said, “Believe me, woman! The time is coming when you will not have to be in Jerusalem or on this mountain to worship the Father."},{"num":22,"verse":"You Samaritans worship something you don’t understand. We Jews understand what we worship, since salvation comes from the Jews."},{"num":23,"verse":"But the time is coming when the true worshipers will worship the Father in spirit and truth. In fact, that time is now here. And these are the kind of people the Father wants to be his worshipers."},{"num":24,"verse":"God is spirit. So the people who worship him must worship in spirit and truth.”"},{"num":25,"verse":"The woman said, “I know that the Messiah is coming.” (He is the one called Christ.) “When he comes, he will explain everything to us.”"},{"num":26,"verse":"Then Jesus said, “He is talking to you now—I am the Messiah.”"},{"num":27,"verse":"Just then Jesus’ followers came back from town. They were surprised because they saw Jesus talking with a woman. But none of them asked, “What do you want?” or “Why are you talking with her?”"},{"num":28,"verse":"Then the woman left her water jar and went back to town. She told the people there,"},{"num":29,"verse":"“A man told me everything I have ever done. Come see him. Maybe he is the Messiah.”"},{"num":30,"verse":"So the people left the town and went to see Jesus."},{"num":31,"verse":"While the woman was in town, Jesus’ followers were begging him, “Teacher, eat something!”"},{"num":32,"verse":"But Jesus answered, “I have food to eat that you know nothing about.”"},{"num":33,"verse":"So the followers asked themselves, “Did someone already bring him some food?”"},{"num":34,"verse":"Jesus said, “My food is to do what the one who sent me wants me to do. My food is to finish the work that he gave me to do."},{"num":35,"verse":"When you plant, you always say, ‘Four more months to wait before we gather the grain.’ But I tell you, open your eyes, and look at the fields. They are ready for harvesting now."},{"num":36,"verse":"Even now, the people who harvest the crop are being paid. They are gathering crops for eternal life. So now the people who plant can be happy together with those who harvest."},{"num":37,"verse":"It is true when we say, ‘One person plants, but another person harvests the crop.’"},{"num":38,"verse":"I sent you to harvest a crop that you did not work for. Others did the work, and you get the profit from their work.”"},{"num":39,"verse":"Many of the Samaritan people in that town believed in Jesus. They believed because of what the woman had told them about him. She had told them, “He told me everything I have ever done.”"},{"num":40,"verse":"The Samaritans went to Jesus. They begged him to stay with them. So he stayed there two days."},{"num":41,"verse":"Many more people became believers because of the things he said."},{"num":42,"verse":"The people said to the woman, “First we believed in Jesus because of what you told us. But now we believe because we heard him ourselves. We know now that he really is the one who will save the world.”"},{"header":"Jesus Heals an Official’s Son(A)"},{"num":43,"verse":"Two days later Jesus left and went to Galilee."},{"num":44,"verse":"(Jesus had said before that a prophet is not respected in his own country.)"},{"num":45,"verse":"When he arrived in Galilee, the people there welcomed him. They had been at the Passover festival in Jerusalem and had seen everything he did there."},{"num":46,"verse":"Jesus went to visit Cana in Galilee again. Cana is where he had changed the water into wine. One of the king’s important officials lived in the city of Capernaum. This man’s son was sick."},{"num":47,"verse":"The man heard that Jesus had come from Judea and was now in Galilee. So he went to Jesus and begged him to come to Capernaum and heal his son, who was almost dead."},{"num":48,"verse":"Jesus said to him, “You people must see miraculous signs and wonders before you will believe in me.”"},{"num":49,"verse":"The king’s official said, “Sir, come before my little son dies.”"},{"num":50,"verse":"Jesus answered, “Go. Your son will live.”"},{"num":51,"verse":"On the way home, the man’s servants came and met him. They said, “Your son is well.”"},{"num":52,"verse":"The man asked, “What time did my son begin to get well?”"},{"num":53,"verse":"The father knew that one o’clock was the same time that Jesus had said, “Your son will live.” So the man and everyone in his house believed in Jesus."},{"num":54,"verse":"That was the second miraculous sign that Jesus did after coming from Judea to Galilee."}]