[{"num":4,"verse":"When therefore the Lord knew how the Pharisees had heard that Jesus made and baptized more disciples than John"},{"num":2,"verse":"(though Jesus Himself baptized not, but His disciples),"},{"num":3,"verse":"He left Judea and departed again into Galilee,"},{"num":4,"verse":"and He needed to go through Samaria."},{"num":5,"verse":"Then came He to a city of Samaria, which is called Sychar, near to the parcel of ground that Jacob gave to his son Joseph."},{"num":6,"verse":"Now Jacob’s well was there. Jesus therefore, being wearied with His journey, sat thus by the well; and it was about the sixth hour."},{"num":7,"verse":"There came a woman of Samaria to draw water. Jesus said unto her, “Give Me to drink.”"},{"num":8,"verse":"(For His disciples had gone away unto the city to buy meat.)"},{"num":9,"verse":"Then said the woman of Samaria unto Him, “How is it that thou, being a Jew, askest a drink of me, who am a woman of Samaria?” For the Jews have no dealings with the Samaritans."},{"num":10,"verse":"Jesus answered and said unto her, “If thou knewest the gift of God and who it is that saith to thee, ‘Give Me to drink,’ thou wouldest have asked of Him, and He would have given thee living water.”"},{"num":11,"verse":"The woman said unto Him, “Sir, thou hast nothing to draw with, and the well is deep. From whence then hast thou that living water?"},{"num":12,"verse":"Art thou greater than our father Jacob, who gave us the well and drank thereof himself, and his children and his cattle?”"},{"num":13,"verse":"Jesus answered and said unto her, “Whosoever drinketh of this water shall thirst again,"},{"num":14,"verse":"but whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into everlasting life.”"},{"num":15,"verse":"The woman said unto Him, “Sir, give me this water, that I thirst not, neither come hither to draw.”"},{"num":16,"verse":"Jesus said unto her, “Go, call thy husband, and come hither.”"},{"num":17,"verse":"The woman answered and said, “I have no husband.” Jesus said unto her, “Thou hast well said, ‘I have no husband’;"},{"num":18,"verse":"for thou hast had five husbands, and he whom thou now hast is not thy husband. In that thou saidst truly.”"},{"num":19,"verse":"The woman said unto Him, “Sir, I perceive that thou art a prophet."},{"num":20,"verse":"Our fathers worshiped on this mountain, and ye say that Jerusalem is the place where men ought to worship.”"},{"num":21,"verse":"Jesus said unto her, “Woman, believe Me, the hour cometh when ye shall neither on this mountain, nor yet at Jerusalem, worship the Father."},{"num":22,"verse":"Ye worship ye know not what; we know what we worship, for salvation is of the Jews."},{"num":23,"verse":"But the hour cometh and now is, when the true worshipers shall worship the Father in spirit and in truth; for the Father seeketh such to worship Him."},{"num":24,"verse":"God is a Spirit, and they that worship Him must worship Him in spirit and in truth.”"},{"num":25,"verse":"The woman said unto Him, “I know that Messiah cometh, who is called Christ. When He has come, He will tell us all things.”"},{"num":26,"verse":"Jesus said unto her, “I that speak unto thee am He.”"},{"num":27,"verse":"And upon this came His disciples and marveled that He talked with the woman; yet no man said, “What seekest Thou?” or, “Why talkest Thou with her?”"},{"num":28,"verse":"The woman then left her waterpot, and went her way into the city and said to the men,"},{"num":29,"verse":"“Come, see a man who told me all things that ever I did. Is not this the Christ?”"},{"num":30,"verse":"Then they went out of the city and came unto Him."},{"num":31,"verse":"Meanwhile His disciples entreated Him, saying, “Master, eat.”"},{"num":32,"verse":"But He said unto them, “I have meat to eat that ye know not of.”"},{"num":33,"verse":"Therefore the disciples said one to another, “Hath any man brought Him aught to eat?”"},{"num":34,"verse":"Jesus said unto them, “My meat is to do the will of Him that sent Me, and to finish His work."},{"num":35,"verse":"Say not ye, ‘There are yet four months and then cometh the harvest’? Behold, I say unto you, lift up your eyes and look on the fields, for they are white already to harvest."},{"num":36,"verse":"And he that reapeth receiveth wages and gathereth fruit unto life eternal, that both he that soweth and he that reapeth may rejoice together."},{"num":37,"verse":"And herein is that saying true, ‘One soweth and another reapeth.’"},{"num":38,"verse":"I sent you to reap that whereon ye bestowed no labor; other men labored, and ye have entered into their labors.”"},{"num":39,"verse":"And many of the Samaritans of that city believed in Him because of the saying of the woman who testified, “He told me all that ever I did.”"},{"num":40,"verse":"So when the Samaritans had come unto Him, they besought Him that He would tarry with them; and He abode there two days."},{"num":41,"verse":"And many more believed because of His own word,"},{"num":42,"verse":"and said unto the woman, “Now we believe, not because of thy saying, for we have heard Him ourselves and know that this is indeed the Christ, the Savior of the world.”"},{"num":43,"verse":"Now after two days He departed thence and went into Galilee."},{"num":44,"verse":"For Jesus Himself testified that a prophet hath no honor in his own country."},{"num":45,"verse":"Then when He had come into Galilee, the Galileans received Him, having seen all the things that He did at Jerusalem at the feast; for they also had gone to the feast."},{"num":46,"verse":"So Jesus came again into Cana of Galilee where He had made the water wine. And there was a certain nobleman, whose son was sick at Capernaum."},{"num":47,"verse":"When he heard that Jesus had come out of Judea into Galilee, he went unto Him and besought Him that He would come down and heal his son, for he was at the point of death."},{"num":48,"verse":"Then Jesus said unto him, “Unless ye see signs and wonders, ye will not believe.”"},{"num":49,"verse":"The nobleman said unto Him, “Sir, come down ere my child die!”"},{"num":50,"verse":"Jesus said unto him, “Go thy way; thy son liveth.” And the man believed the word that Jesus had spoken unto him, and he went his way."},{"num":51,"verse":"And as he was going down, his servants met him and told him, saying, “Thy son liveth!”"},{"num":52,"verse":"Then he inquired of them the hour when he began to be healed. And they said unto him, “Yesterday at the seventh hour the fever left him.”"},{"num":53,"verse":"So the father knew that it was at the same hour in which Jesus had said unto him, “Thy son liveth.” And he himself believed, and his whole house."},{"num":54,"verse":"This is again the second miracle that Jesus did when He had come out of Judea into Galilee."}]