[{"header":"A Samaritan Woman Meets Jesus at a Well"},{"num":4,"verse":"Yeshua knew that the Pharisees had heard that he was making and baptizing more disciples than John. "},{"num":2,"verse":"(Actually, Yeshua was not baptizing people. His disciples were.) "},{"num":3,"verse":"So he left the Judean countryside and went back to Galilee."},{"num":4,"verse":"Yeshua had to go through Samaria. "},{"num":5,"verse":"He arrived at a city in Samaria called Sychar. Sychar was near the piece of land that Jacob had given to his son Joseph. "},{"num":6,"verse":"Jacob’s Well was there. Yeshua sat down by the well because he was tired from traveling. The time was about six o’clock in the evening."},{"num":7,"verse":"A Samaritan woman went to get some water. Yeshua said to her, “Give me a drink of water.” "},{"num":8,"verse":"(His disciples had gone into the city to buy some food.)"},{"num":9,"verse":"The Samaritan woman asked him, “How can a Jewish man like you ask a Samaritan woman like me for a drink of water?” (Jews, of course, don’t associate with Samaritans.)"},{"num":10,"verse":"Yeshua replied to her, “If you only knew what God’s gift is and who is asking you for a drink, you would have asked him for a drink. He would have given you living water.”"},{"num":11,"verse":"The woman said to him, “Sir, you don’t have anything to use to get water, and the well is deep. So where are you going to get this living water? "},{"num":12,"verse":"You’re not more important than our ancestor Jacob, are you? He gave us this well. He and his sons and his animals drank water from it.”"},{"num":13,"verse":"Yeshua answered her, “Everyone who drinks this water will become thirsty again. "},{"num":14,"verse":"But those who drink the water that I will give them will never become thirsty again. In fact, the water I will give them will become in them a spring that gushes up to eternal life.”"},{"num":15,"verse":"The woman told Yeshua, “Sir, give me this water! Then I won’t get thirsty or have to come here to get water.”"},{"num":16,"verse":"Yeshua told her, “Go to your husband, and bring him here.”"},{"num":17,"verse":"The woman replied, “I don’t have a husband.”"},{"num":18,"verse":"You’ve had five husbands, and the man you have now isn’t your husband. You’ve told the truth.”"},{"num":19,"verse":"The woman said to Yeshua, “I see that you’re a prophet! "},{"num":20,"verse":"Our ancestors worshiped on this mountain. But you Jews say that people must worship in Jerusalem.”"},{"num":21,"verse":"Yeshua told her, “Believe me. A time is coming when you Samaritans won’t be worshiping the Father on this mountain or in Jerusalem. "},{"num":22,"verse":"You don’t know what you’re worshiping. We Jews know what we’re worshiping, because salvation comes from the Jews. "},{"num":23,"verse":"Indeed, the time is coming, and it is now here, when the true worshipers will worship the Father in spirit and truth. The Father is looking for people like that to worship him. "},{"num":24,"verse":"God is a spirit. Those who worship him must worship in spirit and truth.”"},{"num":25,"verse":"The woman said to him, “I know that the Messiah is coming. When he comes, he will tell us everything.” (Messiah is the one called Christ.)"},{"num":26,"verse":"Yeshua told her, “I am he, and I am speaking to you now.”"},{"num":27,"verse":"At that time his disciples returned. They were surprised that he was talking to a woman. But none of them asked him, “What do you want from her?” or “Why are you talking to her?”"},{"num":28,"verse":"Then the woman left her water jar and went back into the city. She told the people, "},{"num":29,"verse":"“Come with me, and meet a man who told me everything I’ve ever done. Could he be the Messiah?” "},{"num":30,"verse":"The people left the city and went to meet Yeshua."},{"num":31,"verse":"Meanwhile, the disciples were urging him, “Rabbi, have something to eat.”"},{"num":32,"verse":"Yeshua told them, “I have food to eat that you don’t know about.”"},{"num":33,"verse":"The disciples asked each other, “Did someone bring him something to eat?”"},{"num":34,"verse":"Yeshua told them, “My food is to do what the one who sent me wants me to do and to finish the work he has given me."},{"num":35,"verse":"“Don’t you say, ‘In four more months the harvest will be here’? I’m telling you to look and see that the fields are ready to be harvested. "},{"num":36,"verse":"The person who harvests the crop is already getting paid. He is gathering grain for eternal life. So the person who plants the grain and the person who harvests it are happy together. "},{"num":37,"verse":"In this respect the saying is true: ‘One person plants, and another person harvests.’ "},{"num":38,"verse":"I have sent you to harvest a crop you have not worked for. Other people have done the hard work, and you have followed them in their work.”"},{"num":39,"verse":"Many Samaritans in that city believed in Yeshua because of the woman who said, “He told me everything I’ve ever done.” "},{"num":40,"verse":"So when the Samaritans went to Yeshua, they asked him to stay with them. He stayed in Samaria for two days. "},{"num":41,"verse":"Many more Samaritans believed because of what Yeshua said. "},{"num":42,"verse":"They told the woman, “Our faith is no longer based on what you’ve said. We have heard him ourselves, and we know that he really is the savior of the world.”"},{"header":"A Believing Official(A)"},{"num":43,"verse":"After spending two days in Samaria, Yeshua left for Galilee. "},{"num":44,"verse":"Yeshua had said that a prophet is not honored in his own country. "},{"num":45,"verse":"But when Yeshua arrived in Galilee, the people of Galilee welcomed him. They had seen everything he had done at the festival in Jerusalem, since they, too, had attended the festival."},{"num":46,"verse":"Yeshua returned to the city of Cana in Galilee, where he had changed water into wine. A government official was in Cana. His son was sick in Capernaum. "},{"num":47,"verse":"The official heard that Yeshua had returned from Judea to Galilee. So he went to Yeshua and asked him to go to Capernaum with him to heal his son who was about to die."},{"num":48,"verse":"Yeshua told the official, “If people don’t see miracles and amazing things, they won’t believe.”"},{"num":49,"verse":"The official said to him, “Sir, come with me before my little boy dies.”"},{"num":50,"verse":"Yeshua told him, “Go home. Your son will live.” The man believed what Yeshua told him and left."},{"num":51,"verse":"While the official was on his way to Capernaum, his servants met him and told him that his boy was alive. "},{"num":52,"verse":"The official asked them at what time his son got better. His servants told him, “The fever left him yesterday evening at seven o’clock.” "},{"num":53,"verse":"Then the boy’s father realized that it was the same time that Yeshua had told him, “Your son will live.” So the official and his entire family became believers."},{"num":54,"verse":"This was the second miracle that Yeshua performed after he had come back from Judea to Galilee."}]