[{"header":"The Woman of Samaria"},{"num":4,"verse":"So when Jesus knew that the Pharisees had heard that he was making more disciples than John, and was baptizing them "},{"num":2,"verse":"(Jesus himself didn’t baptize people; it was his disciples who were doing it), "},{"num":3,"verse":"he left Judaea and went back to Galilee."},{"num":4,"verse":"He had to go through Samaria, "},{"num":5,"verse":"and he came to a town in Samaria named Sychar. It was near the place which Jacob gave to his son Joseph. "},{"num":6,"verse":"Jacob’s well was there. So Jesus, tired from the journey, sat down there by the well. It was about midday."},{"num":7,"verse":"A Samaritan woman came to draw water, and Jesus spoke to her."},{"num":8,"verse":"(The disciples had gone off into the town to buy food.)"},{"num":9,"verse":"‘What!’ said the Samaritan woman. ‘You, a Jew, asking for a drink from me, a woman, and a Samaritan at that?’ (Jews, you see, don’t have any dealings with Samaritans.)"},{"num":10,"verse":"‘If only you’d known God’s gift,’ replied Jesus, ‘and who it is that’s saying to you, “Give me a drink”, you’d have asked him, and he would have given you living water.’"},{"num":11,"verse":"‘But sir,’ replied the woman, ‘you haven’t got a bucket! And the well’s deep! So how were you thinking of getting living water? "},{"num":12,"verse":"Are you greater than our father Jacob, who gave us the well, and drank of it himself, with his sons and his animals?’"},{"num":13,"verse":"‘Everyone who drinks this water’, Jesus replied, ‘will get thirsty again. "},{"num":14,"verse":"But anyone who drinks the water I’ll give them won’t ever be thirsty again. No: the water I’ll give them will become a spring of water welling up to the life of God’s new age.’"},{"num":15,"verse":"‘Sir,’ the woman said, ‘give me this water! Then I won’t be thirsty any more, and I won’t have to come here to draw from the well.’"},{"header":"Jesus and the Woman"},{"num":16,"verse":"‘Well then,’ said Jesus to the woman, ‘go and call your husband and come here.’"},{"num":17,"verse":"‘I haven’t got a husband,’ replied the woman."},{"num":18,"verse":"‘The fact is, you’ve had five husbands, and the one you’ve got now isn’t your husband. You were speaking the truth!’"},{"num":19,"verse":"‘Well, sir,’ replied the woman, ‘I can see you’re a prophet . . . "},{"num":20,"verse":"Our ancestors worshipped on this mountain. And you say that in Jerusalem is the place where people ought to worship.’"},{"num":21,"verse":"‘Believe me, woman,’ replied Jesus, ‘the time is coming when you won’t worship the father on this mountain or in Jerusalem. "},{"num":22,"verse":"You worship what you don’t know. We worship what we do know; salvation, you see, is indeed from the Jews. "},{"num":23,"verse":"But the time is coming – indeed, it’s here already! – when true worshippers will worship the father in spirit and in truth. Yes; that’s the kind of worshippers the father is looking for. "},{"num":24,"verse":"God is spirit, and those who worship him must worship in spirit and in truth.’"},{"num":25,"verse":"‘I know that Messiah is coming,’ said the woman, ‘the one they call “the anointed”. When he comes, he’ll tell us everything.’"},{"num":26,"verse":"‘I’m the one – the one speaking to you right now,’ said Jesus."},{"header":"Sower and Reaper Rejoice Together"},{"num":27,"verse":"Just then Jesus’ disciples came up. They were astonished that he was talking with a woman; but nobody said ‘What did you want?’ or ‘Why were you talking with her?’ "},{"num":28,"verse":"So the woman left her water-jar, went into the town and spoke to the people."},{"num":29,"verse":"‘Come on!’ she said. ‘Come and see a man who told me everything I ever did! You don’t think he can be the Messiah, do you?’"},{"num":30,"verse":"So they left the town and were coming out to him."},{"num":31,"verse":"Meanwhile the disciples were nagging him."},{"num":32,"verse":"‘I’ve got food to eat that you know nothing about,’ he said."},{"num":33,"verse":"‘Nobody’s brought him anything to eat, have they?’ said the disciples to one another."},{"num":34,"verse":"‘My food’, replied Jesus, ‘is to do the will of the one who sent me, and to finish his work! "},{"num":35,"verse":"Don’t you have a saying, “Another four months, then comes harvest”? Well, let me tell you, raise your eyes and see! The fields are white! It’s harvest time already! "},{"num":36,"verse":"The reaper earns his pay, and gathers crops for the life of God’s coming age, so that sower and reaper can celebrate together. "},{"num":37,"verse":"This is where that saying comes true, “One sows, another reaps”. "},{"num":38,"verse":"I sent you to reap what you didn’t work for. Others did the hard work, and you’ve come into the results.’"},{"num":39,"verse":"Several Samaritans from that town believed in Jesus because of what the woman said in evidence about him, ‘He told me everything I did.’ "},{"num":40,"verse":"So when the Samaritans came to him, they asked him to stay with them. And he stayed there two days."},{"num":41,"verse":"Many more believed because of what he said."},{"num":42,"verse":"‘We believe, too,’ they said to the woman, ‘but it’s no longer because of what you told us. We’ve heard him ourselves! We know that he really is the one! He’s the saviour of the world!’"},{"header":"The Official’s Son"},{"num":43,"verse":"After the two days in Samaria, Jesus went off from there to Galilee. "},{"num":44,"verse":"Jesus himself gave evidence, after all, that a prophet isn’t honoured in his own country. "},{"num":45,"verse":"So when he came to Galilee, the Galileans welcomed him. They had seen all the things he had done in Jerusalem at the festival, since they had been at the festival too."},{"num":46,"verse":"So he went once more to Cana in Galilee, where he had turned the water into wine."},{"num":47,"verse":"He heard that Jesus had come from Judaea into Galilee, and he went to him and asked him to come down and heal his son, since he was at the point of death."},{"num":48,"verse":"‘Unless you see signs and miracles,’ replied Jesus, ‘you won’t ever believe.’"},{"num":49,"verse":"‘Sir,’ replied the official, ‘come down before my child dies!’"},{"num":50,"verse":"‘Off you go!’ said Jesus. ‘Your son will live!’"},{"num":51,"verse":"But while he was still on his way down to Capernaum, his servants met him with the news that his son was alive and well."},{"num":52,"verse":"So he asked them what time he had begun to get better."},{"num":53,"verse":"So the father knew that it had happened at the very moment when Jesus had said to him, ‘Your son will live!’ He himself believed, and so did all his household."},{"num":54,"verse":"This was now the second sign Jesus did, when he came out of Judaea into Galilee."}]