[{"header":"Amaziah, King of Judah(A)"},{"num":25,"verse":"Amaziah was twenty-five years old when he was king, and he reigned twenty-nine years in Jerusalem. The name of his mother was Jehoaddan from Jerusalem. "},{"num":2,"verse":"He did what was correct in the eyes of the Lord, only not with a complete heart. "},{"num":3,"verse":"And it happened that when the kingdom was firmly his that he killed his servants, those who struck down his father King Joash. "},{"num":4,"verse":"But he did not put to death their children because, as it is written in the Law in the Book of Moses, as the Lord commanded, “You will not put to death the fathers for their children’s actions nor the children will you put to death for their fathers’ actions, for every man will be put to death for his own sin.”"},{"header":"Slaughter of the Edomites"},{"num":5,"verse":"Then Amaziah assembled Judah and set over them according to the house of the fathers commanders of thousands and hundreds in all Judah and Benjamin, and he appointed men who were twenty years old and above. And they found three hundred thousand choice men fit for war and able to use a long spear and large shield. "},{"num":6,"verse":"And he hired out from Israel one hundred thousand mighty men of war for one hundred talents of silver."},{"num":7,"verse":"Then a man of God came to him saying, “O king, do not let the army of Israel come with you because the Lord is not with Israel or with any of the sons of Ephraim. "},{"num":8,"verse":"But if you go, do it. Be strong for the battle. Yet God shall make you fall before the enemy, for God has power to help and to bring down.”"},{"num":9,"verse":"Then Amaziah said to the man of God, “So what should I do about the one hundred talents of silver that I gave to the military party from Israel?”"},{"num":10,"verse":"So Amaziah dismissed the military party that came to him from Ephraim to return to their place. And they were very angry with Judah and returned to their place in a great rage."},{"num":11,"verse":"But Amaziah strengthened himself and led his people, and he journeyed to the Valley of Salt and struck down ten thousand of the people of Seir. "},{"num":12,"verse":"And the people of Judah took captive another ten thousand alive and brought them to the top of a cliff and threw them from the top of the rock so that they were all dashed to pieces."},{"num":13,"verse":"But the men of the military party that Amaziah turned back from going with him in battle raided the cities of Judah from Samaria to Beth Horon. They struck down three thousand Judeans and took a great amount of plunder."},{"num":14,"verse":"And it happened after Amaziah came back from striking down the Edomites, he brought back the gods of the people from Seir and set them up as gods for himself. He worshipped them and gave them sacrifices. "},{"num":15,"verse":"So the Lord was greatly angry with Amaziah, and He sent a prophet to the king. And he said, “Why do you seek from the gods of the people who were not even able to deliver the people from your hand?”"},{"num":16,"verse":"But while the prophet was speaking, the king said, “Have we made you a counselor to the king? Stop! Why should you be struck down?”"},{"header":"Israel Defeats Judah"},{"num":17,"verse":"Then Amaziah king of Judah received advice and sent for Jehoash the son of Jehoahaz, the son of Jehu king of Israel, saying, “Come, let us meet together.”"},{"num":18,"verse":"So Jehoash king of Israel sent a message for Amaziah king of Judah saying, “A thistle in Lebanon sent for a cedar in Lebanon stating, ‘Give your daughter to my son as a wife.’ Then an animal of the field in Lebanon passed by and trampled the thistle. "},{"num":19,"verse":"You say that you have struck down Edom, and your heart lifts you up in arrogance. Now remain in your palace. Why do you provoke disaster so that you fall, you and Judah with you?”"},{"num":20,"verse":"But Amaziah would not listen because this was from God so that He might give them into the hand of Jehoash because Amaziah had sought after the gods of Edom. "},{"num":21,"verse":"So Jehoash king of Israel went up, and they faced each other, he and Amaziah king of Judah, at Beth Shemesh, which is in Judah. "},{"num":22,"verse":"And Judah was struck down by Israel, and each man fled to his home. "},{"num":23,"verse":"So at Beth Shemesh, Jehoash king of Israel seized Amaziah king of Judah the son of Joash, the son of Ahaziah. And they brought him to Jerusalem and broke through the walls of the city from the Ephraim Gate to the Corner Gate, a section of four hundred cubits. "},{"num":24,"verse":"And Jehoash took all the gold and silver and all the vessels that were found in the house of God with Obed-Edom, even the treasures of the palace of the king and hostages. Then he returned to Samaria."},{"header":"The Death of Amaziah"},{"num":25,"verse":"And Amaziah, the son of Joash king of Judah, lived fifteen years more after the death of Jehoash, the son of Jehoahaz king of Israel. "},{"num":26,"verse":"Now the rest of the acts of Amaziah, from first to last, are they not written in the book of the kings of Judah and Israel? "},{"num":27,"verse":"From the time when Amaziah turned aside from the Lord, they plotted a conspiracy against him in Jerusalem, and he fled to Lachish. Then they sent for him and put him to death in Lachish. "},{"num":28,"verse":"They brought him on horses and buried him with his fathers in the City of David in Judah."}]