[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-5 The Israelites must occupy the new conquests. Canaan would have been subdued in vain, if it had not been inhabited. Yet every man might not go and settle where he pleased. God shall choose our inheritance for us. Let us survey our heritage of present mercy, our prospect for the land of promise, eternal in the heavens. Is God any respecter of persons? Is it not better that our place, as to earthly good or sorrow, should be determined by the infinite wisdom of our heavenly Father, than by our own ignorance? Should not those for whom the great mystery of godliness was exhibited, those whose redemption was purchased by Jesus Christ, thankfully refer their earthly concerns to his appointment?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By lot - We are not told in what manner the lot was cast. Perhaps two urns were employed, one containing a description of the several districts to be allotted, the other the names of the tribes; and the portion of each tribe would then be determined by a simultaneous drawing from the two urns. Or a drawing might be made by some appointed person, or by a delegate of each tribe from one urn containing the description of the ten inheritances. The lot only determined in a general way the position in the country of the particular tribe concerned, whether north or south, etc.; the dimensions of each territory being left to be adjusted subsequently, according to the numbers and wants of the tribe to be provided for. Since the predilections and habits of two tribes and a half were consulted in the apportionment to them of the trans-Jordanic territory ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is no objection to the supposition that something of the same kind may have taken place, subject to the divine approval, in the distribution of the lands to the nine and a half other tribes; and the lot would thus be appealed to as finally deciding the matter and foreclosing jealousies and disputes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is apparent that the casting of the ten lots did not take place simultaneously. The tribe of Judah had precedence, whether by express appointment or because its lot \"came up\" first, does not appear. It was, as it seems, only after this tribe had settled upon its domains, that further lots were drawn for Ephraim and the half tribe of Manasseh. After this a pause, perhaps of some duration, appears to have occurred; the camp was moved from Gilgal to Shiloh; and the further casting of lots for the other seven tribes was proceeded with at the instigation of Joshua (see Joshua 18:10). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is apparent that the casting of the ten lots did not take place simultaneously. The tribe of Judah had precedence, whether by express appointment or because its lot \"came up\" first, does not appear. It was, as it seems, only after this tribe had settled upon its domains, that further lots were drawn for Ephraim and the half tribe of Manasseh. After this a pause, perhaps of some duration, appears to have occurred; the camp was moved from Gilgal to Shiloh; and the further casting of lots for the other seven tribes was proceeded with at the instigation of Joshua (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 14",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jos 14:1-5. The Nine Tribes and a Half to Have Their Inheritance by Lot.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. these are the countries which the children of Israel inherited in the land of Canaan—This chapter forms the introduction to an account of the allocation of the land west of Jordan, or Canaan proper, to the nine tribes and a half. It was also made by lot in presence of a select number of superintendents, appointed according to divine directions given to Moses (see on [192]Nu 34:16). In everything pertaining to civil government, and even the division of the land, Joshua was the acknowledged chief. But in a matter to be determined by lot, a solemn appeal was made to God, and hence Eleazar, as high priest, is named before Joshua.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses had given the inheritance of two tribes, and an half tribe, on the other side Jordan,.... The two tribes of Gad and Reuben, and the half tribe of Manasseh, whose inheritance is described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but unto the Levites he gave none inheritance among them; this is frequently observed, that it might be taken notice of, to show the disinterestedness of Moses in this affair, Levi being his own tribe; and to recommend the care of the Levites to the other tribes, according to the provision God had made for them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but unto the Levites he gave none inheritance among them; this is frequently observed, that it might be taken notice of, to show the disinterestedness of Moses in this affair, Levi being his own tribe; and to recommend the care of the Levites to the other tribes, according to the provision God had made for them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For Moses had given the inheritance of {a} two tribes and an half tribe on the other side Jordan: but unto the Levites he gave none inheritance among them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For Moses had given the inheritance of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " two tribes and an half tribe on the other side Jordan: but unto the Levites he gave none inheritance among them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) As Reuben and Gad and half the tribe of Manasseh, Nu 32:33.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In this verse the reason is stated why there were only nine tribes and a half, to whom the land was distributed by lot; viz. because two tribes and a half had already received their inheritance on the east of the Jordan, and no land was given to the Levites as an inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Joshua 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So many tribes were to receive their inheritance, for the two tribes and a half had already received theirs from Moses on the other side of the Jordan, and the tribe of Levi was not to receive any land for an inheritance. According to this, there seem to be only eight tribes and a half to be provided for (2 1/2 + 1 + 8 1/2  equals  12); but there were really nine and a half, for the sons of Joseph formed two tribes in consequence of the adoption of Ephraim and Manasseh by the patriarch Jacob (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But although the Levites were to have no share in the land, they were to receive towns to dwell in, with pasture adjoining for their cattle; these the other tribes were to give up to them out of their inheritance, according to the instructions in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the notes upon this passage).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So far as the division of the land itself was concerned, it was to be distributed by lot, according to Numbers 26:52.; but, at the same time, the distribution was carried out with such special regard to the relative sizes of the different tribes, that the more numerous tribe received a larger share of the land than one that was not so numerous. This could only be accomplished, however, by their restricting the lot to the discrimination of the relative situation of the different tribes, and then deciding the extent and boundaries of their respective possessions according to the number of families of which they were composed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So far as the division of the land itself was concerned, it was to be distributed by lot, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 26:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; but, at the same time, the distribution was carried out with such special regard to the relative sizes of the different tribes, that the more numerous tribe received a larger share of the land than one that was not so numerous. This could only be accomplished, however, by their restricting the lot to the discrimination of the relative situation of the different tribes, and then deciding the extent and boundaries of their respective possessions according to the number of families of which they were composed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"This was the force of the lot: there were ten lots cast in such a manner as to decide that some were to be next to the Egyptians, some to have the sea-coasts, some to occupy the higher ground, and some to settle in the valleys. When this was done, it remained for the heads of the nation to determine the boundaries of their different territories according to some equitable standard. It was their place, therefore, to ascertain how many thousand heads there were in each tribe, and then to adjudicate a larger or smaller space according to the size of the tribe\" (Calvin). Or, as Clericus observes (Numbers 26:52), \"the lot seems to have had respect to the situation alone, and not to the extent of territory at all.\")",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: \"This was the force of the lot: there were ten lots cast in such a manner as to decide that some were to be next to the Egyptians, some to have the sea-coasts, some to occupy the higher ground, and some to settle in the valleys. When this was done, it remained for the heads of the nation to determine the boundaries of their different territories according to some equitable standard. It was their place, therefore, to ascertain how many thousand heads there were in each tribe, and then to adjudicate a larger or smaller space according to the size of the tribe\" (Calvin). Or, as Clericus observes (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 26:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), \"the lot seems to have had respect to the situation alone, and not to the extent of territory at all.\")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The casting of the lots was probably effected, as the Rabbins assumed, by means of two urns, one filled with slips having the names of the tribes upon them; the other, with an equal number, representing separate divisions of the land: so that when one slip, with a name upon it, was taken out of one urn, another slip, with a division of the land upon it, was taken from the other. The result of the lot was accepted as the direct decree of God; \"for the lot was not controlled in any way by the opinion, or decision, or authority of men\" (Calvin). See the fuller remarks at Numbers 26:56.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The casting of the lots was probably effected, as the Rabbins assumed, by means of two urns, one filled with slips having the names of the tribes upon them; the other, with an equal number, representing separate divisions of the land: so that when one slip, with a name upon it, was taken out of one urn, another slip, with a division of the land upon it, was taken from the other. The result of the lot was accepted as the direct decree of God; \"for the lot was not controlled in any way by the opinion, or decision, or authority of men\" (Calvin). See the fuller remarks at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 26:56",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the account of the casting of the lots, the first fact which strikes us is, that after the tribes of Judah and Joseph had received their inheritance, an interruption took place, and the camp was moved from Gilgal to Shiloh, and the tabernacle erected there (Joshua 18:1-9); after which the other tribes manifested so little desire to receive their inheritance, that Joshua reproved them for their indolence (Joshua 18:3), and directed them to nominate a committee of twenty-one from their own number, whom he sent out to survey the land and divide it into seven parts; and it was not till after this had been done that the casting of the lots was proceeded with, and each of these seven tribes received its inheritance. The reason for this interruption is not given; and the commentators have differed in their opinions as to the cause (see Keil's former Comm. on Joshua, pp. 347ff.). The following appears to be the most probable supposition. When Joshua received the command from the Lord to divide the land among the tribes, they made an approximative division of the land into nine or ten parts, according to the general idea of its extent and principal features, which they had obtained in connection with the conquest of the country, and then commenced distributing it without any more minute survey or more accurate measurement, simply fixing the boundaries of those districts which came out first according to the size of the tribes upon whom the lots fell. As soon as that was done, these tribes began to move off into the territory allotted to them, and to take possession of it. The exact delineation of the boundaries, however, could not be effected at once, but required a longer time, and was probably not finally settled till the tribe had taken possession of its land. In this manner the tribes of Judah, Ephraim, and half Manasseh had received their inheritance one after another. And whilst they were engaged in taking possession, Shiloh was chosen, no doubt in accordance with divine instructions, as the place where the tabernacle was to be permanently erected; and there the sanctuary was set up, the whole camp, of course, removing thither at the same time. But when the casting of the lots was about to be continued for the remainder of the tribes, they showed no great desire for fixed abodes, as they had become so accustomed to a nomad life, through having been brought up in the desert, that they were much more disposed to continue it, than to take possession of a circumscribed inheritance, - a task which would require more courage and exertion, on account of the remaining Canaanites, than a life in tents, in which they might wander up and down in the land by the side of the Canaanites, and supply their wants from its productions, as Abraham, Isaac, and Jacob had formerly done, since the Canaanites who were left were so weakened by the war that the Israelites had no occasion for a moment's anxiety about them, provided they did not attempt to expel or to exterminate them. But Joshua could not rest contented with this, if he would remain faithful to the charge which he had received from the Lord. He therefore reproved these tribes for their tardiness, and commanded them to take steps for continuing the casting of lots for the land. But as the tribe of Joseph had expressed its dissatisfaction with the smallness of the inheritance allotted to it, and by so doing had manifested its cowardice, which prevented it from attacking the Canaanites who were still left in the territory that had fallen to their lot, Joshua may possibly have had his eyes opened in consequence to the fact that, if the casting of lots was continued in the manner begun, and with nothing more than an approximative definition of the different portions of the land, there was a possibility of still greater dissatisfaction arising among the other tribes, since some of them at any rate would be sure to receive portions of the land in which the Canaanites were more numerous and still stronger than in the possessions of Ephraim. He therefore gave orders, that before the casting of lots was proceeded with any further, the rest of the land should be carefully surveyed and divided into seven districts, and that a statement of the result should be laid before him, that these seven districts might be divided by lot among the seven tribes. This survey of the land no doubt very clearly showed that what remained, after deducting the possessions of Judah and Joseph, was too small for the remaining seven tribes, in proportion to what had been already divided. Moreover, it had also been discovered that Judah's share was larger than this tribe required (Joshua 19:9). Consequently it was necessary that certain partial alterations should be made in the arrangements connected with the first division. The lot itself could not be pronounced invalid when it had once been cast, as its falling was regarded as the decision of God himself, and therefore it was impossible to make a fresh division of the whole land among all the tribes. The only thing that could be done was to leave the two tribes in those districts which had fallen to them by lot (Joshua 18:5), but to take certain parts of their territory for the other tribes, which would leave the lot in all its integrity, as the lot itself had not determined either the size of the boundaries. This will serve to explain both the interruption to the casting of the lots, which had been commenced at Gilgal, and also the peculiar manner in which it was continued at Shiloh. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the account of the casting of the lots, the first fact which strikes us is, that after the tribes of Judah and Joseph had received their inheritance, an interruption took place, and the camp was moved from Gilgal to Shiloh, and the tabernacle erected there (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); after which the other tribes manifested so little desire to receive their inheritance, that Joshua reproved them for their indolence (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and directed them to nominate a committee of twenty-one from their own number, whom he sent out to survey the land and divide it into seven parts; and it was not till after this had been done that the casting of the lots was proceeded with, and each of these seven tribes received its inheritance. The reason for this interruption is not given; and the commentators have differed in their opinions as to the cause (see Keil's former Comm. on Joshua, pp. 347ff.). The following appears to be the most probable supposition. When Joshua received the command from the Lord to divide the land among the tribes, they made an approximative division of the land into nine or ten parts, according to the general idea of its extent and principal features, which they had obtained in connection with the conquest of the country, and then commenced distributing it without any more minute survey or more accurate measurement, simply fixing the boundaries of those districts which came out first according to the size of the tribes upon whom the lots fell. As soon as that was done, these tribes began to move off into the territory allotted to them, and to take possession of it. The exact delineation of the boundaries, however, could not be effected at once, but required a longer time, and was probably not finally settled till the tribe had taken possession of its land. In this manner the tribes of Judah, Ephraim, and half Manasseh had received their inheritance one after another. And whilst they were engaged in taking possession, Shiloh was chosen, no doubt in accordance with divine instructions, as the place where the tabernacle was to be permanently erected; and there the sanctuary was set up, the whole camp, of course, removing thither at the same time. But when the casting of the lots was about to be continued for the remainder of the tribes, they showed no great desire for fixed abodes, as they had become so accustomed to a nomad life, through having been brought up in the desert, that they were much more disposed to continue it, than to take possession of a circumscribed inheritance, - a task which would require more courage and exertion, on account of the remaining Canaanites, than a life in tents, in which they might wander up and down in the land by the side of the Canaanites, and supply their wants from its productions, as Abraham, Isaac, and Jacob had formerly done, since the Canaanites who were left were so weakened by the war that the Israelites had no occasion for a moment's anxiety about them, provided they did not attempt to expel or to exterminate them. But Joshua could not rest contented with this, if he would remain faithful to the charge which he had received from the Lord. He therefore reproved these tribes for their tardiness, and commanded them to take steps for continuing the casting of lots for the land. But as the tribe of Joseph had expressed its dissatisfaction with the smallness of the inheritance allotted to it, and by so doing had manifested its cowardice, which prevented it from attacking the Canaanites who were still left in the territory that had fallen to their lot, Joshua may possibly have had his eyes opened in consequence to the fact that, if the casting of lots was continued in the manner begun, and with nothing more than an approximative definition of the different portions of the land, there was a possibility of still greater dissatisfaction arising among the other tribes, since some of them at any rate would be sure to receive portions of the land in which the Canaanites were more numerous and still stronger than in the possessions of Ephraim. He therefore gave orders, that before the casting of lots was proceeded with any further, the rest of the land should be carefully surveyed and divided into seven districts, and that a statement of the result should be laid before him, that these seven districts might be divided by lot among the seven tribes. This survey of the land no doubt very clearly showed that what remained, after deducting the possessions of Judah and Joseph, was too small for the remaining seven tribes, in proportion to what had been already divided. Moreover, it had also been discovered that Judah's share was larger than this tribe required (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Consequently it was necessary that certain partial alterations should be made in the arrangements connected with the first division. The lot itself could not be pronounced invalid when it had once been cast, as its falling was regarded as the decision of God himself, and therefore it was impossible to make a fresh division of the whole land among all the tribes. The only thing that could be done was to leave the two tribes in those districts which had fallen to them by lot (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but to take certain parts of their territory for the other tribes, which would leave the lot in all its integrity, as the lot itself had not determined either the size of the boundaries. This will serve to explain both the interruption to the casting of the lots, which had been commenced at Gilgal, and also the peculiar manner in which it was continued at Shiloh. ",
            "children": []
          }
        ]
      }
    ]
  }
]