[{"header":"Chapter 12"},{"num":1,"verse":"Reign of Joash. Joash began to reign during the seventh year of the reign of Jehu, and he reigned for forty years in Jerusalem. His mother’s name was Zibiah, and she was from Beer-sheba."},{"num":2,"verse":"Joash did what was right in the sight of the Lord all of his days. Jehoiada, the priest, instructed him."},{"num":3,"verse":"However, he did not eliminate the high places, and the people still sacrificed and burned incense on the high places."},{"num":4,"verse":"Joash said to the priests, “Gather all of the money that has been brought into the temple of the Lord as a sacred offering, the money from the census, the money from personal vows, and all of the money that each man saw fit to bring to the temple of the Lord."},{"num":5,"verse":"Let the priests each take it from their treasurers, and let them use it to repair whatever damage they might find in the temple.”"},{"num":6,"verse":"In spite of this, in the twenty-third year of the reign of King Joash, the priests had not yet repaired the damage in the temple."},{"num":7,"verse":"King Joash therefore summoned Jehoiada the priest and the other priests and he said to them, “Why have you not repaired the damage in the temple? Take no more money from the treasurers; hand it over for the repair of the temple.”"},{"num":8,"verse":"The priests agreed that they would take no more money from the people and that they, themselves, would not repair the damage in the temple."},{"num":9,"verse":"Jehoiada took a chest and cut a hole in its lid. He placed it beside the altar on the right side as one enters the temple of the Lord. The priests who guarded the door placed all of the money that was brought into the temple of the Lord in it."},{"num":10,"verse":"When they saw that there was quite a bit of money in the chest, the king’s scribe and the high priest would come. They would count the money that was found in the temple of the Lord, and they would put it in bags."},{"num":11,"verse":"When the money had been counted, they placed it in the hands of the supervisor of the work being done on the temple of the Lord. With it they paid those who were working on the temple of the Lord: the carpenters and the builders,"},{"num":12,"verse":"the masons, and the stonecutters. It was also used to buy wood and hewn stone that were used to repair the damage in the temple of the Lord, and for all of the expenses involved in repairing the temple."},{"num":13,"verse":"However, the money that was brought into the temple of the Lord was not used to make silver basins, nor snuffers, nor sprinkling bowls, nor trumpets, nor any utensils made with gold, nor any utensils made with silver."},{"num":14,"verse":"They gave it to the workmen who used it to repair the temple of the Lord."},{"num":15,"verse":"Moreover, they did not ask for an accounting from the men into whose hands the money had been deposited for the payment of the workmen, for they acted honestly."},{"num":16,"verse":"The money from guilt offerings and from sin offerings was not brought into the temple of the Lord for it belonged to the priests."},{"num":17,"verse":"Hazael, the king of Aram, went up and fought against Gath. He captured it, and Hazael decided to go up to Jerusalem."},{"num":18,"verse":"Joash, the king of Judah, took all of the sacred things that had been dedicated by Jehoshaphat, Jehoram, and Ahaziah, his ancestors, the kings of Judah, and all of the sacred things that he had dedicated, and all of the gold that was found in the treasury of the temple of the Lord and the royal palace, and he sent it to Hazael, the king of Aram, who then departed from Jerusalem."},{"num":19,"verse":"As for the other deeds of Joash, what he did, are they not written in the book of the chronicles of the kings of Judah?"},{"num":20,"verse":"Joash’s servants plotted against him, and they killed him at Beth-millo, on the road going down to Silla."},{"num":21,"verse":"His servants who killed him were Jozacar, the son of Shimeath, and Jehozabad, the son of Shomer."}]