[{"num":16,"verse":"So they brought the ark of God, and set it in the midst of the tent that David had pitched for it: and they offered burnt sacrifices and peace offerings before God. "},{"num":2,"verse":"And when David had made an end of offering the burnt offerings and the peace offerings, he blessed the people in the name of the Lord. "},{"num":3,"verse":"And he dealt to every one of Israel, both man and woman, to every one a loaf of bread, and a good piece of flesh, and a flagon of wine."},{"num":4,"verse":"And he appointed certain of the Levites to minister before the ark of the Lord, and to record, and to thank and praise the Lord God of Israel: "},{"num":5,"verse":"Asaph the chief, and next to him Zechariah, Jeiel, and Shemiramoth, and Jehiel, and Mattithiah, and Eliab, and Benaiah, and Obed-edom: and Jeiel with psalteries and with harps; but Asaph made a sound with cymbals; "},{"num":6,"verse":"Benaiah also and Jahaziel the priests with trumpets continually before the ark of the covenant of God."},{"num":7,"verse":"Then on that day David delivered first this psalm to thank the Lord into the hand of Asaph and his brethren."},{"num":37,"verse":"So he left there before the ark of the covenant of the Lord Asaph and his brethren, to minister before the ark continually, as every day’s work required: "},{"num":38,"verse":"and Obed-edom with their brethren, threescore and eight; Obed-edom also the son of Jeduthun and Hosah to be porters: "},{"num":39,"verse":"and Zadok the priest, and his brethren the priests, before the tabernacle of the Lord in the high place that was at Gibeon, "},{"num":40,"verse":"to offer burnt offerings unto the Lord upon the altar of the burnt offering continually morning and evening, and to do according to all that is written in the law of the Lord, which he commanded Israel; "},{"num":41,"verse":"and with them Heman and Jeduthun, and the rest that were chosen, who were expressed by name, to give thanks to the Lord, because his mercy endureth for ever; "},{"num":42,"verse":"and with them Heman and Jeduthun with trumpets and cymbals for those that should make a sound, and with musical instruments of God. And the sons of Jeduthun were porters. "},{"num":43,"verse":"And all the people departed every man to his house: and David returned to bless his house."}]