[{"num":16,"verse":"They brought the ark of God and placed it inside the tent David had pitched for it. Then they offered burnt offerings and fellowship offerings in God’s presence. "},{"num":2,"verse":"When David had finished offering the burnt offerings and the fellowship offerings, he blessed the people in the name of the Lord. "},{"num":3,"verse":"Then he distributed to each and every Israelite, both men and women, a loaf of bread, a date cake, and a raisin cake."},{"num":4,"verse":"David appointed some of the Levites to be ministers before the ark of the Lord, to celebrate the Lord God of Israel, and to give thanks and praise to him. "},{"num":5,"verse":"Asaph was the chief and Zechariah was second to him. Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom, and Jeiel played the harps and lyres, while Asaph sounded the cymbals "},{"num":6,"verse":"and the priests Benaiah and Jahaziel blew the trumpets regularly before the ark of the covenant of God."},{"header":"David’s Psalm of Thanksgiving"},{"num":7,"verse":"On that day David decreed for the first time that thanks be given to the Lord by Asaph and his relatives:"},{"num":37,"verse":"So David left Asaph and his relatives there before the ark of the Lord’s covenant to minister regularly before the ark according to the daily requirements. "},{"num":38,"verse":"He assigned Obed-edom and his sixty-eight relatives. Obed-edom son of Jeduthun and Hosah were to be gatekeepers. "},{"num":39,"verse":"David left the priest Zadok and his fellow priests before the tabernacle of the Lord at the high place in Gibeon "},{"num":40,"verse":"to offer burnt offerings regularly, morning and evening, to the Lord on the altar of burnt offerings and to do everything that was written in the law of the Lord, which he had commanded Israel to keep. "},{"num":41,"verse":"With them were Heman, Jeduthun, and the rest who were chosen and designated by name to give thanks to the Lord—for his faithful love endures forever. "},{"num":42,"verse":"Heman and Jeduthun had with them trumpets and cymbals to play and musical instruments of God. Jeduthun’s sons were at the city gate."},{"num":43,"verse":"Then all the people went home, and David returned home to bless his household."}]