[{"num":16,"verse":"The Levites brought God’s Holy Box and put it inside the tent David had set up for it. Then they offered burnt offerings and fellowship offerings to God."},{"num":2,"verse":"After David had finished giving the burnt offerings and fellowship offerings, he used the Lord’s name to bless the people."},{"num":3,"verse":"Then he gave a loaf of bread, some dates, and raisins to every Israelite man and woman."},{"num":4,"verse":"Then David chose some of the Levites to serve before the Lord’s Holy Box. They had the job of celebrating and giving thanks and praise to the Lord, the God of Israel."},{"num":5,"verse":"Asaph was the leader of the first group. His group played the cymbals. Zechariah was the leader of the second group. The other Levites were Uzziel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed Edom, and Jeiel. These men played the lyres and harps."},{"num":6,"verse":"Benaiah and Jahaziel were the priests who always blew the trumpets before the Box of God’s Agreement."},{"num":7,"verse":"This was when David first gave Asaph and his brothers the job of singing praises to the Lord."},{"header":"David’s Song of Thanks"},{"num":37,"verse":"Then David left Asaph and his brothers there in front of the Box of the Lord’s Agreement. David left them there to serve in front of it every day."},{"num":38,"verse":"He also left Obed Edom and 68 other Levites to serve with Asaph and his brothers. Obed Edom and Hosah were guards. Obed Edom was Jeduthun’s son."},{"num":39,"verse":"David left Zadok the priest and the other priests who served with him in front of the Lord’s Tent at the high place in Gibeon."},{"num":40,"verse":"Every morning and evening Zadok and the other priests offered burnt offerings to the Lord on the altar of burnt offerings. They did this to follow the rules written in the law of the Lord, which he had given Israel."},{"num":41,"verse":"Heman, Jeduthun, and all the other Levites were chosen by name to praise the Lord, singing, “His faithful love will last forever.”"},{"num":42,"verse":"Heman and Jeduthun were with them. They had the job of blowing the trumpets and playing cymbals. They also had the job of playing other musical instruments when songs were sung to God. Jeduthun’s sons guarded the gates."},{"num":43,"verse":"After the celebration, all the people left and went home. David also went home to bless his family."}]