[{"header":"The Ark is Placed in the Tent(A)"},{"num":16,"verse":"They brought the Ark of God, placed it within the tent that David had erected, and offered burnt offerings and peace offerings in the presence of God. "},{"num":2,"verse":"After David had finished sacrificing the burnt offerings and peace offerings, he blessed the people in the name of the Lord "},{"num":3,"verse":"and distributed a loaf of bread, a date bar, and a raisin bar to every person in Israel—that is, to each man and to each woman. "},{"num":4,"verse":"In the presence of the ark of the Lord, he appointed some of the descendants of Levi to minister continually by remembering, giving thanks, and praising the Lord God of Israel. "},{"num":5,"verse":"Their director Asaph played cymbals, and next to him was Zechariah, followed by Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom, and Jeiel, who played harps and lyres. "},{"num":6,"verse":"The priests Benaiah and Jahaziel played the trumpets continually in the presence of the Ark of the Covenant of God."},{"header":"David’s Psalm of Thanksgiving(B)"},{"num":7,"verse":"On that very day, David composed this psalm of thanksgiving to the Lord just for Asaph and his companions:"},{"header":"David Establishes Regular Worship"},{"num":37,"verse":"Later David left the presence of the Ark of the Covenant of the Lord so Asaph and his fellow descendants of Levi could serve the ark there continually each day, doing whatever was required. "},{"num":38,"verse":"Obed-edom and 68 of his relatives remained also, with Jeduthun’s son Obed-edom and Hosah serving as trustees. "},{"num":39,"verse":"He left Zadok the priest and his relatives at the Tent of the Lord at the high place in Gibeon, where they ministered in the Lord’s presence, "},{"num":40,"verse":"sacrificing the regular burnt offerings regularly each morning and evening to the Lord on the altar dedicated to that purpose, doing everything written in the Law of the Lord, just as he had commanded Israel."},{"num":41,"verse":"David also appointed Heman, Jeduthun, and others chosen by name to give thanks to the Lord, because “his gracious love is eternal.” "},{"num":42,"verse":"They accompanied their songs of praise to God with trumpets, cymbals, and other musical instruments while Jeduthun’s children served as trustees. "},{"num":43,"verse":"After this, everyone left for their own homes and David went home to bless his own household."}]