[{"header":"Chapter 16"},{"num":1,"verse":"They brought the Ark of God and placed it inside of the tent that David had pitched for it. They offered burnt sacrifices and peace offerings before God."},{"num":2,"verse":"When David had finished offering the burnt offerings and the peace offerings, he blessed the people in the name of the Lord."},{"num":3,"verse":"He gave each man and each woman in Israel one loaf of bread, a piece of meat, and a cake of raisins."},{"num":4,"verse":"The Levite Ministers. He appointed some of the Levites to minister before the Ark of the Lord, to commemorate, to thank, and to praise the Lord, the God of Israel."},{"num":5,"verse":"They were Asaph, the leader, Zechariah, the next in charge, and Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, and Obed-edom. They were to play upon the lyres and the harps while Asaph was to play upon the cymbals."},{"num":6,"verse":"Benaiah and Jahaziel were the priests who normally blew the trumpets before the Ark of the Covenant of the Lord."},{"num":7,"verse":"On that day David first gave Asaph and his brethren this psalm of thanks to the Lord:"},{"num":37,"verse":"He left Asaph and his brethren there before the Ark of the Covenant of the Lord to minister before the Ark and to do each day’s required work."},{"num":38,"verse":"He also left Obed-edom and sixty-eight of his brethren with them. Obed-edom, the son of Jeduthun, and Hosah were the gatekeepers."},{"num":39,"verse":"He also left Zadok, the priest, and his fellow priests before the tabernacle of the Lord at the high place in Gibeon."},{"num":40,"verse":"He was to offer the regular burnt offerings upon the altar of burnt offerings, each morning and each evening, just as it is written in the law of the Lord which he gave to Israel."},{"num":41,"verse":"With him there were Heman and Jeduthun and the others who had been chosen, who had been designated by name to give thanks to the Lord, for his mercy endures forever."},{"num":42,"verse":"Heman and Jeduthun were responsible for playing the trumpets and the cymbals as well as the other sacred musical instruments. The sons of Jeduthun were gatekeepers."},{"num":43,"verse":"Then all the people departed, each returning home. David, too, went home to bless his household."}]