[[],[{"type":"header","content":"The Ark Placed in the Tabernacle(A)"},{"type":"prose","content":"So they brought the ark of God, and set it in the midst of the tabernacle that David had erected for it. Then they offered burnt offerings and peace offerings before God. "}],[{"type":"prose","content":"And when David had finished offering the burnt offerings and the peace offerings, he blessed the people in the name of the . "}],[{"type":"prose","content":"Then he distributed to everyone of Israel, both man and woman, to everyone a loaf of bread, a piece  and a cake of raisins."}],[{"type":"prose","content":"And he appointed some of the Levites to minister before the ark of the , to commemorate, to thank, and to praise the  God of Israel: "}],[{"type":"prose","content":"Asaph the chief, and next to him Zechariah,  Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, and Obed-Edom: Jeiel with stringed instruments and harps, but Asaph made music with cymbals; "}],[{"type":"prose","content":"Benaiah and Jahaziel the priests regularly  the trumpets before the ark of the covenant of God."},{"type":"header","content":"David’s Song of Thanksgiving(F)"}],[{"type":"prose","content":"On that day David first delivered  into the hand of Asaph and his brethren, to thank the :And all the people said, “Amen!” and praised the ."},{"type":"header","content":"Regular Worship Maintained"}],[{"type":"prose","content":"So he left Asaph and his brothers there before the ark of the covenant of the  to minister before the ark regularly, as every day’s work required; "}],[{"type":"prose","content":"and Obed-Edom with his sixty-eight brethren, including Obed-Edom the son of Jeduthun, and Hosah,  gatekeepers; "}],[{"type":"prose","content":"and Zadok the priest and his brethren the priests, before the tabernacle of the  at the high place that  at Gibeon, "}],[{"type":"prose","content":"to offer burnt offerings to the  on the altar of burnt offering regularly morning and evening, and  according to all that is written in the Law of the  which He commanded Israel; "}],[{"type":"prose","content":"and with them Heman and Jeduthun and the rest who were chosen, who were designated by name, to give thanks to the , because His mercy  forever; "}],[{"type":"prose","content":"and with them Heman and Jeduthun, to sound aloud with trumpets and cymbals and the musical instruments of God. Now the sons of Jeduthun  gatekeepers."}],[{"type":"prose","content":"Then all the people departed, every man to his house; and David returned to bless his house."}]]