[[],[{"type":"prose","content":"They brought the Ark of God and placed it inside the special tent David had prepared for it. And they presented burnt offerings and peace offerings to God."}],[{"type":"prose","content":"When he had finished his sacrifices, David blessed the people in the name of the LORD."}],[{"type":"prose","content":"Then he gave to every man and woman in all Israel a loaf of bread, a cake of dates, and a cake of raisins."}],[{"type":"prose","content":"David appointed the following Levites to lead the people in worship before the Ark of the LORD—to invoke his blessings, to give thanks, and to praise the LORD, the God of Israel."}],[{"type":"prose","content":"Asaph, the leader of this group, sounded the cymbals. Second to him was Zechariah, followed by Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom, and Jeiel. They played the harps and lyres."}],[{"type":"prose","content":"The priests, Benaiah and Jahaziel, played the trumpets regularly before the Ark of God’s Covenant."}],[{"type":"header","content":"David’s Song of Praise"},{"type":"prose","content":"On that day David gave to Asaph and his fellow Levites this song of thanksgiving to the LORD:And all the people shouted “Amen!” and praised the LORD."}],[{"type":"header","content":"Worship at Jerusalem and Gibeon"},{"type":"prose","content":"David arranged for Asaph and his fellow Levites to serve regularly before the Ark of the LORD’s Covenant, doing whatever needed to be done each day."}],[{"type":"prose","content":"This group included Obed-edom (son of Jeduthun), Hosah, and sixty-eight other Levites as gatekeepers."}],[{"type":"prose","content":"Meanwhile, David stationed Zadok the priest and his fellow priests at the Tabernacle of the LORD at the place of worship in Gibeon, where they continued to minister before the LORD."}],[{"type":"prose","content":"They sacrificed the regular burnt offerings to the LORD each morning and evening on the altar set aside for that purpose, obeying everything written in the Law of the LORD, as he had commanded Israel."}],[{"type":"prose","content":"David also appointed Heman, Jeduthun, and the others chosen by name to give thanks to the LORD, for “his faithful love endures forever.”"}],[{"type":"prose","content":"They used their trumpets, cymbals, and other instruments to accompany their songs of praise to God. And the sons of Jeduthun were appointed as gatekeepers."}],[{"type":"prose","content":"Then all the people returned to their homes, and David turned and went home to bless his own family."}]]