[[],[{"type":"header","content":"The Ark Placed in the Tent"},{"type":"prose","content":"They brought in the ark of God, and set it inside the tent that David had pitched for it; and they offered burnt offerings and offerings of well-being before God. "}],[{"type":"prose","content":"When David had finished offering the burnt offerings and the offerings of well-being, he blessed the people in the name of the ; "}],[{"type":"prose","content":"and he distributed to every person in Israel—man and woman alike—to each a loaf of bread, a portion of meat, and a cake of raisins."}],[{"type":"prose","content":"He appointed certain of the Levites as ministers before the ark of the , to invoke, to thank, and to praise the , the God of Israel. "}],[{"type":"prose","content":"Asaph was the chief, and second to him Zechariah, Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom, and Jeiel, with harps and lyres; Asaph was to sound the cymbals, "}],[{"type":"prose","content":"and the priests Benaiah and Jahaziel were to blow trumpets regularly, before the ark of the covenant of God."},{"type":"header","content":"David’s Psalm of Thanksgiving"}],[{"type":"prose","content":"Then on that day David first appointed the singing of praises to the  by Asaph and his kindred."}],[{"type":"prose","content":"Say also:"},{"type":"poetry","content":"“Save us, O God of our salvation,"},{"type":"poetry","content":""},{"type":"poetry","content":"that we may give thanks to your holy name,"},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"Blessed be the , the God of Israel,"},{"type":"poetry","content":""},{"type":"prose","content":"Then all the people said “Amen!” and praised the ."},{"type":"header","content":"Regular Worship Maintained"}],[{"type":"prose","content":"David left Asaph and his kinsfolk there before the ark of the covenant of the  to minister regularly before the ark as each day required, "}],[{"type":"prose","content":"and also Obed-edom and his sixty-eight kinsfolk; while Obed-edom son of Jeduthun and Hosah were to be gatekeepers. "}],[{"type":"prose","content":"And he left the priest Zadok and his kindred the priests before the tabernacle of the  in the high place that was at Gibeon, "}],[{"type":"prose","content":"to offer burnt offerings to the  on the altar of burnt offering regularly, morning and evening, according to all that is written in the law of the  that he commanded Israel. "}],[{"type":"prose","content":"With them were Heman and Jeduthun, and the rest of those chosen and expressly named to render thanks to the , for his steadfast love endures forever. "}],[{"type":"prose","content":"Heman and Jeduthun had with them trumpets and cymbals for the music, and instruments for sacred song. The sons of Jeduthun were appointed to the gate."}],[{"type":"prose","content":"Then all the people departed to their homes, and David went home to bless his household."}]]