[{"header":"Worship in David’s Tent"},{"num":16,"verse":"They brought the Ark of God and set it in the middle of the tent that David had pitched for it. Then they offered burnt offerings and peace offerings before God. "},{"num":2,"verse":"After David finished offering the burnt offering and the fellowship offerings, he blessed the people in the Name of Adonai. "},{"num":3,"verse":"He then distributed to everyone in Israel—man and woman alike—to each a loaf of bread, a date cake and a raisin cake."},{"num":4,"verse":"He appointed some of the Levites as ministers before the Ark of Adonai, to petition, to thank and to praise Adonai, the God of Israel. "},{"num":5,"verse":"Asaph was the chief and second to him were Zechariah, Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-edom and Jehiel. They were to play harps and lyres; Asaph was to sound the cymbals, "},{"num":6,"verse":"and the kohanim Benaiah and Jahaziel were to blow trumpets continually before the Ark of the Covenant of God."},{"num":7,"verse":"On that day David first appointed Asaph and his kinsmen to give thanks to Adonai:"},{"num":37,"verse":"So David left Asaph and his kinsmen there before the Ark of the Covenant of Adonai, to minister before the Ark continually, according to each day’s requirements, "},{"num":38,"verse":"including Obed-edom and his 68 kinsmen. Obed-edom son of Jeduthun and Hosah were gatekeepers. "},{"num":39,"verse":"Also he left Zadok the kohen and his fellow kohanim before the Tabernacle of Adonai in the high place that was at Gibeon "},{"num":40,"verse":"to offer burnt offerings to Adonai on the altar of burnt offering, regularly morning and evening, according to all that is written in the Torah of Adonai that He commanded Israel. "},{"num":41,"verse":"Along with them were Heman and Jeduthun and the rest who were chosen, designated by name to give thanks to Adonai—for His mercy endures forever. "},{"num":42,"verse":"Heman and Jeduthun had trumpets and cymbals for music and other instruments for praising God. The sons of Jeduthun were to be at the gate."},{"num":43,"verse":"Then all the people departed each one to his home, and David returned to bless his household."}]