[{"header":"The Lord Rejects Saul as King"},{"num":13,"verse":"Saul was ⌞thirty⌟ years old when he became king, and he was king of Israel ⌞forty-two⌟ years."},{"num":2,"verse":"Saul chose 3,000 men from Israel; 2,000 of them were stationed with Saul at Michmash and in the mountains of Bethel, and 1,000 were stationed with Jonathan at Gibeah in Benjamin. But the rest of the people he sent home."},{"num":3,"verse":"Jonathan defeated the Philistine troops at Geba, and the Philistines heard about it. With the sounding of the ram’s horn throughout the land, Saul announced, “Listen, Hebrews!” "},{"num":4,"verse":"(So all Israel listened.) “I, Saul, have defeated the Philistine troops, and now Israel has become offensive to the Philistines!” All the troops rallied behind Saul at Gilgal."},{"num":5,"verse":"The Philistines assembled to fight against Israel. They had 30,000 chariots, 6,000 horsemen, and as many soldiers as the sand on the seashore. They camped at Michmash, east of Beth Aven. "},{"num":6,"verse":"When the Israelites saw they were in trouble because the army was hard-pressed, they hid in caves, in thorny thickets, among rocks, in pits, and in cisterns. "},{"num":7,"verse":"Some Hebrews crossed the Jordan River into the territory of Gad and Gilead. But Saul remained in Gilgal, and all the people who followed him trembled ⌞in fear⌟."},{"num":8,"verse":"He waited seven days, the time set by Samuel. But Samuel had not come to Gilgal, and the troops began to scatter. "},{"num":9,"verse":"Then Saul said, “Bring me the animals for the burnt offering and the fellowship offerings.” So he sacrificed the burnt offering. "},{"num":10,"verse":"As he finished sacrificing the burnt offering, Samuel came, and Saul went to greet him."},{"num":11,"verse":"Samuel asked, “What have you done?”"},{"num":12,"verse":"So I thought, ‘Now, the Philistines will come against me at Gilgal, but I haven’t sought the Lord’s favor.’ I felt pressured into sacrificing the burnt offering.”"},{"num":13,"verse":"“You did a foolish thing,” Samuel told Saul. “You didn’t follow the command of the Lord your God. ⌞If you had,⌟ the Lord would have established your kingdom over Israel permanently. "},{"num":14,"verse":"But now your kingdom will not last. The Lord has searched for a man after his own heart. The Lord has appointed him as ruler of his people, because you didn’t follow the command of the Lord.”"},{"num":15,"verse":"Samuel left Gilgal. The rest of the people followed Saul to meet the soldiers. They went from Gilgal  to Gibeah in Benjamin, where Saul counted the troops who were still with him—about 600 men. "},{"num":16,"verse":"Saul, his son Jonathan, and the troops who were with them stayed at Geba in Benjamin while the Philistines camped at Michmash."},{"num":17,"verse":"Raiding parties left the Philistine camp in three columns. One column turned onto the road to Ophrah to the region of Shual. "},{"num":18,"verse":"Another column turned onto the road to Beth Horon. And one turned onto the road toward the region that overlooks the valley of Zeboim and the desert."},{"num":19,"verse":"No blacksmith could be found in the entire land of Israel. In this way the Philistines kept the Hebrews from making swords and spears. "},{"num":20,"verse":"Everyone in Israel had to go to the Philistines to sharpen the blade of his plow, his mattock, ax, or sickle. "},{"num":21,"verse":"The price was a pim  for plow blades and mattocks, and one-tenth of an ounce of silver to sharpen a mattock or set a metal point on a cattle-prod. "},{"num":22,"verse":"So on the day of battle, not one sword or spear could be found among all the troops who were with Saul and Jonathan. But Saul and his son Jonathan had them."},{"num":23,"verse":"Now, Philistine troops had gone out to the pass at Michmash."}]