[{"header":"Lot Is Captured"},{"num":14,"verse":"Now Amraphel was king of ·Babylonia [Shinar], Arioch was king of Ellasar [possibly in Mesopotamia], Kedorlaomer was king of Elam [located on the Iranian plateau], and Tidal was king of Goiim [possibly a people otherwise known as the Umman-manda]. "},{"num":2,"verse":"All these kings went to war against several other kings: Bera king of Sodom, Birsha king of Gomorrah, Shinab king of Admah, Shemeber king of Zeboiim, and the king of Bela. (Bela is also called Zoar.) [Sodom and Gomorrah were located in the vicinity of the Dead Sea, and the other named cities are thought to have been nearby.]"},{"num":3,"verse":"These kings who were attacked united their armies in the Valley of Siddim (·now [that is] the ·Dead [Salt] Sea). "},{"num":4,"verse":"They had served Kedorlaomer for twelve years, but in the thirteenth year, they all ·turned [rebelled] against him. "},{"num":5,"verse":"Then in the fourteenth year, Kedorlaomer and the kings with him came and ·defeated [subdued] the ·Rephaites [or Rephaim; an especially warlike tribe in Canaan] in Ashteroth Karnaim, the Zuzites in Ham, and the Emites in Shaveh Kiriathaim [the Zuzites and Emites were likely related to the Rephaites; Deut. 2:10–11]. "},{"num":6,"verse":"They also defeated the Horites in the mountains of ·Edom [Seir; a region outside of Palestine on the southeastern coast of the Dead Sea] to El Paran (near the ·desert [wilderness]). "},{"num":7,"verse":"Then they turned back and went to En Mishpat (that is, Kadesh). They ·defeated [subdued] all the Amalekites [a fearsome tribe in pre-Israelite Canaan], as well as the Amorites who lived in Hazazon Tamar."},{"num":8,"verse":"At that time the kings of Sodom, Gomorrah, Admah, Zeboiim, and Bela went out to fight in the Valley of Siddim. (Bela is called Zoar.) "},{"num":9,"verse":"They fought against Kedorlaomer king of Elam, Tidal king of Goiim, Amraphel king of ·Babylonia [Shinar], and Arioch king of Ellasar—four kings fighting against five. "},{"num":10,"verse":"There were many ·tar [bitumen] pits in the Valley of Siddim. When the kings of Sodom and Gomorrah and their armies ·ran away [fled], some of the soldiers fell into the tar pits, but the others ·ran away [fled] to the mountains."},{"num":11,"verse":"Now Kedorlaomer and his armies took everything the people of Sodom and Gomorrah owned, including their food, and left. "},{"num":12,"verse":"They took Lot, Abram’s ·nephew [son of his brother] who was living in Sodom, and ·everything he owned [his possessions/goods]. Then they left. "},{"num":13,"verse":"One of the men who was not captured went to Abram, the Hebrew, and told him what had happened. At that time Abram was camped near the ·great trees [oaks; or terebinths] of Mamre the Amorite. Mamre was a brother of Eshcol and Aner, and they had all made an ·agreement to help [covenant/treaty with] Abram."},{"header":"Abram Rescues Lot"},{"num":14,"verse":"When Abram learned that ·Lot [his relative/brother] had been captured, he called out his 318 trained men who had been born in his camp. He led the men and ·chased the enemy [went in pursuit] all the way to the town of Dan [in the far north of Palestine]. "},{"num":15,"verse":"That night he divided his men into groups, and ·they made a surprise attack against the enemy [he subdued/defeated/struck them]. They chased them all the way to Hobah, north of Damascus [a major city in Syria]. "},{"num":16,"verse":"Then Abram brought back ·everything the enemy had stolen [all their possessions/goods], the women and the other people, and Lot, and ·everything Lot owned [his goods/possessions]."},{"num":17,"verse":"After defeating Kedorlaomer and the kings who were with him, Abram ·went home [returned]. As he was returning, the king of Sodom came out to meet him in the Valley of Shaveh (now called King’s Valley [somewhere in the vicinity of Jerusalem])."},{"num":18,"verse":"Melchizedek king of ·Salem [probably an old name of Jerusalem] brought out bread and wine. He was a priest for God Most High [Ps. 110; Heb. 5:6–10; 6:20—7:28] "},{"num":19,"verse":"and blessed Abram, saying,"},{"num":21,"verse":"The king of Sodom said to Abram, “You may keep ·all these things [the goods/possessions] for yourself. Just give me my people who were captured.”"},{"num":22,"verse":"But Abram said to the king of Sodom, “I ·make a promise [lifted my hand; a gesture of swearing] to the Lord, the God Most High, who made heaven and earth. "},{"num":23,"verse":"I promise that I will not keep anything that is yours. I will not keep even a thread or a sandal strap [that is, not the smallest thing] so that you cannot say, ‘I made Abram rich.’ "},{"num":24,"verse":"I will keep nothing but the food my young men have eaten. But give Aner, Eshcol, and Mamre their share of what we won, because they went with me into battle.”"}]