[{"header":"Idolatry Leads to Servitude"},{"num":3,"verse":"Now these are the nations that the Lord left, to test Israel by them (that is, all the Israelites who had not experienced any of the wars of Canaan;"},{"num":2,"verse":"only in order that the generations of the sons of Israel might be taught war, those who had not experienced it previously)."},{"num":3,"verse":"These nations are: the five governors of the Philistines and all the Canaanites and the Sidonians, and the Hivites who lived on Mount Lebanon, from Mount Baal-hermon as far as Lebo-hamath."},{"num":4,"verse":"They were left to test Israel by them, to find out if they would obey the commandments of the Lord, which He had commanded their fathers through Moses."},{"num":5,"verse":"The sons of Israel lived among the Canaanites, the Hittites, the Amorites, the Perizzites, the Hivites, and the Jebusites;"},{"num":6,"verse":"and they took their daughters for themselves as wives, and gave their own daughters to their sons, and served their gods."},{"num":7,"verse":"So the sons of Israel did what was evil in the sight of the Lord, and they forgot the Lord their God and served the Baals and the Asheroth."},{"num":8,"verse":"Then the anger of the Lord was kindled against Israel, so that He sold them into the hand of Cushan-rishathaim, king of Mesopotamia; and the sons of Israel served Cushan-rishathaim for eight years."},{"header":"The First Judge Frees Israel"},{"num":9,"verse":"But the sons of Israel cried out to the Lord, and the Lord raised up a deliverer for the sons of Israel to set them free, Othniel the son of Kenaz, Caleb’s younger brother."},{"num":10,"verse":"And the Spirit of the Lord came upon him, and he judged Israel. When he went to war, the Lord handed over to him Cushan-rishathaim king of Mesopotamia, so that he prevailed over Cushan-rishathaim."},{"num":11,"verse":"Then the land was at rest for forty years. And Othniel the son of Kenaz died."},{"num":12,"verse":"Now the sons of Israel again did evil in the sight of the Lord. So the Lord strengthened Eglon the king of Moab against Israel, because they had done evil in the sight of the Lord."},{"num":13,"verse":"And he gathered to himself the sons of Ammon and Amalek; and he went and defeated Israel, and they took possession of the city of the palm trees."},{"num":14,"verse":"And the sons of Israel served Eglon the king of Moab for eighteen years."},{"header":"Ehud Kills Eglon"},{"num":15,"verse":"But when the sons of Israel cried out to the Lord, the Lord raised up a deliverer for them, Ehud the son of Gera, the Benjaminite, a left-handed man. And the sons of Israel sent tribute by him to Eglon the king of Moab."},{"num":16,"verse":"Now Ehud made himself a sword which had two edges, a cubit in length, and he strapped it on his right thigh under his cloak."},{"num":17,"verse":"Then he presented the tribute to Eglon king of Moab. Now Eglon was a very fat man."},{"num":18,"verse":"And it came about, when he had finished presenting the tribute, that Ehud sent away the people who had carried the tribute."},{"num":19,"verse":"But he himself turned back from the idols which were at Gilgal, and said, “I have a secret message for you, O king.” And the king said, “Silence!” And all who were attending him left him."},{"num":20,"verse":"Then Ehud came to him while he was sitting in his cool roof chamber alone. And Ehud said, “I have a message from God for you.” And he got up from his seat."},{"num":21,"verse":"Then Ehud reached out with his left hand and took the sword from his right thigh, and thrust it into his belly."},{"num":22,"verse":"The hilt of the sword also went in after the blade, and the fat closed over the blade because he did not pull the sword out of his belly; and the refuse came out."},{"num":23,"verse":"Then Ehud went out into the vestibule, and shut the doors of the roof chamber behind him, and locked them."},{"num":24,"verse":"When he had left, the king’s servants came and looked, and behold, the doors of the roof chamber were locked; and they said, “Undoubtedly he is relieving himself in the cool room.”"},{"num":25,"verse":"So they waited until it would have been shameful to wait longer; but behold, he did not open the doors of the roof chamber. So they took the key and opened them, and behold, their master had fallen to the floor dead."},{"num":26,"verse":"Now Ehud escaped while they were hesitating, and he passed by the idols and escaped to Seirah."},{"num":27,"verse":"And when he arrived, he blew the trumpet in the hill country of Ephraim; and the sons of Israel went down with him from the hill country, and he was leading them."},{"num":28,"verse":"Then he said to them, “Pursue them, for the Lord has handed your enemies the Moabites over to you.” So they went down after him and took control of the crossing places of the Jordan opposite Moab, and did not allow anyone to cross."},{"num":29,"verse":"They struck and killed about ten thousand Moabites at that time, all robust and valiant men; and no one escaped."},{"num":30,"verse":"So Moab was subdued that day under the hand of Israel. And the land was at rest for eighty years."},{"header":"Shamgar Saves Israel"},{"num":31,"verse":"Now after him came Shamgar the son of Anath, who struck and killed six hundred Philistines with an oxgoad; and he also saved Israel."}]