[{"num":6,"verse":"6 Elisha maketh iron to swim above the water. 8 He discloseth the king of Syria’s counsel to the king of Israel, 13 who sending certain to take him, were kept fast in Samaria. 24 Samaria is besieged, and endureth extreme famine."},{"num":1,"verse":"And the children of the Prophets said unto Elisha, Behold, we pray thee, the place where we dwell with thee, is too little for us."},{"num":2,"verse":"Let us now go to Jordan, that we may take thence every man a beam, and make us a place to dwell in. And he answered, Go."},{"num":3,"verse":"And one said, Vouchsafe, I pray thee, to go with thy servants. And he answered, I will go."},{"num":4,"verse":"So he went with them, and when they came to Jordan, they cut down wood."},{"num":5,"verse":"And as one was felling of a tree, the iron fell into the water: then he cried, and said, Alas master, it was but borrowed."},{"num":6,"verse":"And the man of God said, Where fell it? And he showed him the place. Then he cut down a piece of wood, and cast in thither, and he caused the iron to swim."},{"num":7,"verse":"Then he said, Take it up to thee. And he stretched out his hand, and took it."},{"num":8,"verse":"¶ Then the king of Aram warred against Israel, and took counsel with his servants, and said, In such and such a place shall be my camp."},{"num":9,"verse":"Therefore the man of God sent unto the king of Israel, saying, Beware thou go not over to such a place: for there the Aramites are come down."},{"num":10,"verse":"So the king of Israel sent to the place which the man of God told him, and warned him of, and saved himself from thence, not once, nor twice."},{"num":11,"verse":"And the heart of the king of Aram was troubled for this thing: therefore he called his servants, and said unto them, Will ye not show me, which of us bewrayeth our counsel to the king of Israel?"},{"num":12,"verse":"Then one of his servants said, None, my lord, O king, but Elisha the Prophet that is in Israel, telleth the king of Israel, even the words that thou speakest in thy privy chamber."},{"num":13,"verse":"And he said, Go, and espy where he is, that I may send and fetch him. And one told him, saying, Behold, he is in Dothan."},{"num":14,"verse":"¶ So he sent thither horses, and chariots, and a mighty host: and they came by night, and compassed the city."},{"num":15,"verse":"And when the servant of the man of God arose early to go out, behold, an host compassed the city with horses and chariots. Then his servant said unto him, Alas master, how shall we do?"},{"num":16,"verse":"And he answered, Fear not: for they that be with us, are more than they that be with them."},{"num":17,"verse":"Then Elisha prayed, and said, Lord, I beseech thee, open his eyes, that he may see. And the Lord opened the eyes of the servant, and he looked, and behold, the mountain was full of horses and chariots of fire round about Elisha."},{"num":18,"verse":"So they came down to him, but Elisha prayed unto the Lord, and said, Smite this people, I pray thee, with blindness. And he smote them with blindness, according to the word of Elisha."},{"num":19,"verse":"And Elisha said unto them, This is not the way, neither is this the city: follow me, and I will lead you to the man whom ye seek. But he led them to Samaria."},{"num":20,"verse":"And when they were come to Samaria, Elisha said, Lord, open their eyes that they may see. And the Lord opened their eyes, and they saw, and behold, they were in the midst of Samaria."},{"num":21,"verse":"And the king of Israel said unto Elisha when he saw them, My father, shall I smite them, shall I smite them?"},{"num":22,"verse":"And he answered, Thou shalt not smite them: doest thou not smite them that thou hast taken with thy sword, and with thy bow? but set bread and water before them, that they may eat and drink and go to their master."},{"num":23,"verse":"And he made great preparation for them: and when they had eaten and drunken, he sent them away: and they went to their master. So the bands of Aram came no more into the land of Israel."},{"num":24,"verse":"But afterward Ben-Hadad king of Aram gathered all his host, and went up and besieged Samaria."},{"num":25,"verse":"So there was a great famine in Samaria: for lo, they besieged it until an asses head was at four score pieces of silver, and the fourth part of a cab of dove’s dung at five pieces of silver."},{"num":26,"verse":"And as the king of Israel was going upon the wall, there cried a woman unto him, saying, Help, my lord, O King."},{"num":27,"verse":"And he said, Seeing the Lord doth not succor thee, how should I help thee with the barn, or with the wine press?"},{"num":28,"verse":"Also the king said unto her, What aileth thee? And she answered, This woman said unto me, Give thy son that we may eat him today, and we will eat my son tomorrow,"},{"num":29,"verse":"So we sod my son, and did eat him: and I said to her the day after, Give thy son, that we may eat him, but she hath hid her son."},{"num":30,"verse":"And when the king had heard the words of the woman, he rent his clothes, (and as he went upon the wall, the people looked, and behold, he had sackcloth within upon his flesh)"},{"num":31,"verse":"And he said, God do so to me and more also, if the head of Elisha the son of Shaphat shall stand on him this day."},{"num":32,"verse":"(Now Elisha sat in his house, and the Elders sat with him.) And the King sent a man before him: but before the messenger came to him, he said to the Elders, See ye not how this murderer’s son hath sent to take away mine head? take heed when the messenger cometh, and shut the door, and handle him roughly at the door: is not the sound of his master’s feet behind him?"},{"num":33,"verse":"While he yet talked with them, behold, the messenger came down unto him, and said, Behold, this evil cometh of the Lord: should I attend on the Lord any longer?"}]