[{"header":"The Ax Head That Was Not Lost"},{"num":6,"verse":"Now the sons of the men who tell what will happen in the future said to Elisha, “See, the place where we are living under your care is too small for us. "},{"num":2,"verse":"Let us go to the Jordan and each of us cut down a tree there. And let us make a place for us to live there.” So Elisha said, “Go.” "},{"num":3,"verse":"Then one of them said, “Be pleased to go with your servants.” And Elisha answered, “I will go.” "},{"num":4,"verse":"So he went with them. When they came to the Jordan, they cut down trees. "},{"num":5,"verse":"But as one of them was cutting a tree, the ax head fell into the water. The man cried out, “It is bad, sir! The ax belongs to another man, and I was to return it.” "},{"num":6,"verse":"The man of God said, “Where did it fall?” And when he showed him the place, Elisha cut off a stick and threw it in, and the iron came to the top of the water. "},{"num":7,"verse":"He said, “Pick it up.” So his servant put out his hand and took it."},{"header":"Syrian Army Loses the Battle"},{"num":8,"verse":"Now the king of Syria was fighting a war against Israel. He had a meeting with his servants, and said, “This is the place where I will be staying.” "},{"num":9,"verse":"The man of God sent news to the king of Israel, saying, “Be careful that you do not pass this place. For the Syrians are coming down there.” "},{"num":10,"verse":"The king of Israel sent men to the place where the man of God said there would be danger. So he saved himself there more than once or twice. "},{"num":11,"verse":"The heart of the king of Syria was angry because of this. He called his servants and said to them, “Will you show me which one of us is helping the king of Israel?” "},{"num":12,"verse":"And one of his servants said, “None, my lord, O king. Elisha, the man of God who is in Israel, tells the king of Israel the very words you say in your bedroom.” "},{"num":13,"verse":"So he said, “Go and see where Elisha is, that I may send men to take him.” And he was told, “See, he is in Dothan.” "},{"num":14,"verse":"So the king of Syria sent horses and war-wagons and an army of many soldiers there. They came during the night and gathered around the city."},{"num":15,"verse":"The servant of the man of God got up early and went out. And he saw an army with horses and war-wagons around the city. The servant said to Elisha, “It is bad, sir! What should we do?” "},{"num":16,"verse":"He answered, “Do not be afraid. For those who are with us are more than those who are with them.” "},{"num":17,"verse":"Then Elisha prayed and said, “O Lord, I pray, open his eyes, that he may see.” And the Lord opened the servant’s eyes, and he saw. He saw that the mountain was full of horses and war-wagons of fire all around Elisha. "},{"num":18,"verse":"When the Syrians came against him, Elisha prayed to the Lord, saying, “Make these people blind, I pray.” So the Lord made them blind, as Elisha had said. "},{"num":19,"verse":"Then Elisha said to them, “This is not the way. This is not the city. Follow me and I will bring you to the man you are looking for.” And he brought them to Samaria."},{"num":20,"verse":"When they had come to Samaria, Elisha said, “O Lord, open the eyes of these men. Let them see.” So the Lord opened their eyes, and they saw. They saw they were in the center of Samaria. "},{"num":21,"verse":"When the king of Israel saw them, he said to Elisha, “My father, should I kill them? Should I kill them?” "},{"num":22,"verse":"He answered, “Do not kill them. Would you kill those you have taken against their will with your sword and bow? Give them bread and water. Let them eat and drink and return to their owner.” "},{"num":23,"verse":"So he made a big supper for them. When they had eaten and drunk, he sent them away. And they went to their owner. The Syrians sent no more small groups of soldiers into the land of Israel."},{"header":"Samaria’s Trouble"},{"num":24,"verse":"After this, Ben-hadad the king of Syria gathered all his army and went up against Samaria. "},{"num":25,"verse":"There was a time of no food in Samaria. The Syrian army gathered around it, until a donkey’s head sold for eighty pieces of silver. A half cup of dove’s waste sold for five pieces of silver. "},{"num":26,"verse":"As the king of Israel was passing by on the wall, a woman cried out to him, “Help, my lord, O king!” "},{"num":27,"verse":"And he said, “If the Lord does not help you, from where can I help you? From the grain-floor, or from the grape-crusher?” "},{"num":28,"verse":"Then the king said to her, “What is your trouble?” And she answered, “This woman said to me, ‘Give your son, so we may eat him today. And we will eat my son tomorrow.’ "},{"num":29,"verse":"So we made my son ready to eat over the fire, and ate him. The next day I said to her, ‘Give your son, so we may eat him.’ But she has hidden her son.” "},{"num":30,"verse":"When the king heard the words of the woman, he tore his clothes. He was passing by on the wall, and the people looked. They saw that he wore cloth made from hair under his clothes. "},{"num":31,"verse":"Then he said, “May God do so to me and more also, if the head of Elisha the son of Shaphat stays on him today.”"},{"num":32,"verse":"Now Elisha was sitting in his house. And the leaders were sitting with him. The king sent a man, but before the man came to him, Elisha said to the leaders, “Do you see how this son of a killer has sent to take off my head? See, when the king’s man comes, shut the door. Hold the door shut against him. Is not the sound of his owner’s feet behind him?” "},{"num":33,"verse":"While he was still talking with them, the king came down to him and said, “See, this trouble is from the Lord. Why should I wait for the Lord any longer?”"}]