[{"num":46,"verse":"Thus says the Lord God: The gate of the inner court that faces east shall be shut during the six working days, but on the Sabbath it shall be opened, and also on the day of the New Moon it shall be opened."},{"num":2,"verse":"And the prince shall enter by the porch or vestibule of the gate from without and shall stand by the sidepost of the gate. The priests shall prepare and offer his burnt offering and his peace offerings, and he shall worship at the threshold of the gate. Then he shall go out, but the gate shall not be shut until evening."},{"num":3,"verse":"The people of the land shall worship at the entrance of that gate before the Lord on the Sabbaths and on the New Moons."},{"num":4,"verse":"And the burnt offering that the prince shall offer to the Lord on the Sabbath day shall be six lambs without blemish and a ram without blemish."},{"num":5,"verse":"And the bloodless or meal offering with the ram shall be an ephah, and the meal offering with the lambs shall be as much as he is able and willing to give, and a hin of oil with each ephah."},{"num":6,"verse":"And on the day of the New Moon the offering shall be a young bull without blemish and six lambs and a ram without blemish."},{"num":7,"verse":"And the prince shall provide and make a meal or bloodless offering, an ephah for the bullock and an ephah for the ram, and for the lambs as he is able and willing according to what has been made available to his hand, and a hin of oil to each ephah."},{"num":8,"verse":"And when the prince shall enter, he shall go in by the porch or vestibule of that gate and he shall go out by way of it."},{"num":9,"verse":"But when the people of the land shall come before the Lord at the appointed solemn feasts, he who enters the north gate to worship shall go out by the south gate, and he who enters by the south gate shall go out by the north gate; he shall not return by the gate by which he came in but shall go out by the opposite gate [straight ahead]."},{"num":10,"verse":"And the prince, when they go in, shall go in with them, and when they go out, he shall go out."},{"num":11,"verse":"And in the appointed and solemn feasts the meal or bloodless offering shall be with a bullock an ephah, and with a ram an ephah, and with the lambs as much as the prince is willing and able to give [from what has been made available to him], and a hin of oil with each ephah."},{"num":12,"verse":"When the prince shall prepare and make a freewill burnt offering or peace offerings voluntarily to the Lord, the gate that faces east shall be opened for him, and he shall offer his burnt offering and his peace offerings as he does on the Sabbath day. Then he shall go out, and after he has gone out, the gate shall be shut."},{"num":13,"verse":"And a lamb a year old without blemish shall you [the priests, for the congregation] offer daily to the Lord; you shall prepare and offer it every morning."},{"num":14,"verse":"And you [the priests] shall prepare a meal offering to go with it every morning, one-sixth of an ephah with one-third of a hin of oil to moisten the fine flour. This is a perpetual ordinance for a continual meal offering to the Lord."},{"num":15,"verse":"Thus shall they prepare and offer the lamb and the meal offering and the oil every morning for a continual burnt offering."},{"num":16,"verse":"Thus says the Lord God: If the prince gives a gift to any of his sons out of his inheritance, it shall belong to his sons; it is their property by inheritance."},{"num":17,"verse":"But if he gives a gift out of his inheritance to one of his servants, then it shall be his until the year of liberty [the Year of Jubilee]; after that it shall be returned to the prince; only his sons may keep a gift from his inheritance [permanently]."},{"num":18,"verse":"Moreover, the prince shall not take of the people’s inheritance by oppression, thrusting them out of their property; what he gives to his sons he shall take out of his own possession, so that none of My people shall be separated from his [inherited] possession."},{"num":19,"verse":"Then he [my guide] led me through the entrance which was at the side of the gate into the holy chambers for the priests, which faced the north; and behold, there was a place at the extreme western end of them."},{"num":20,"verse":"And he said to me, This is the place where the priests shall boil the guilt offering and the sin offering, and where they shall bake the [bloodless] meal offering, to prevent their having to bring them into the outer court, lest they should thereby wrongfully sanctify (separate and consecrate for holy service) the people who are there."},{"num":21,"verse":"And he brought me out into the outer court and caused me to pass by the four corners of the court, and behold, in every corner of the court there was a court."},{"num":22,"verse":"In the four corners of the court there were courts joined on and enclosed, forty cubits long and thirty broad; these four in the corners were the same size."},{"num":23,"verse":"And there was a row of masonry inside them, round about [each of] the four courts, and it was made with hearths for boiling at the bottom of the rows round about."},{"num":24,"verse":"Then said he to me, These are the kitchens of those who do the boiling, where the ministers [the Levites] of the temple shall boil the sacrifices of the people."}]