[{"num":46,"verse":"“This is what Adonai Elohim says: ‘The east gate of the inner courtyard is to be shut on the six working days, but on Shabbat it is to be opened, and on Rosh-Hodesh it is to be opened. "},{"num":2,"verse":"The prince is to enter by way of the outer vestibule of the gate and stand by the support of the gate. The cohanim are to prepare his burnt offering and peace offerings. Then he is to prostrate himself in worship at the threshold of the gate, after which he is to leave; but the gate is not to be shut until evening. "},{"num":3,"verse":"The people of the land are also to prostrate themselves in worship before Adonai at the entrance to that gate on Shabbat and on Rosh-Hodesh."},{"num":4,"verse":"“‘The burnt offering the prince is to offer Adonai on Shabbat is to consist of six lambs without defect and a ram without defect. "},{"num":5,"verse":"The grain offering is to be a bushel for the ram, while for the lambs it can be as much as he wants to give; with a gallon of olive oil per eifah. "},{"num":6,"verse":"On Rosh-Hodesh it is to be a young bull, six lambs and a ram, all without defect. "},{"num":7,"verse":"He is to prepare a grain offering consisting of a bushel for the bull, a bushel for the ram, and for the lambs as his means allow; with a gallon of olive oil per bushel."},{"num":8,"verse":"“‘When the prince enters, he is to go in by way of the vestibule of the gate, and he is to leave the same way. "},{"num":9,"verse":"But when the people of the land come before Adonai at the designated times, whoever comes in to worship by way of the north gate is to leave by way of the south gate, and whoever comes in by way of the south gate is to leave by way of the north gate; he is not to go back out through the gate by which he entered but is to exit straight ahead of him. "},{"num":10,"verse":"[On these occasions,] the prince is to be among them when they enter; and when they leave, they are to leave together."},{"num":11,"verse":"“‘At the festivals and at designated times, the grain offering is to be a bushel for a young bull and a bushel for a ram, while for the lambs it can be as much as he wants to give, with a gallon of olive oil per bushel."},{"num":12,"verse":"“‘When the prince provides a voluntary offering, whether it is a burnt offering or peace offerings that he offers voluntarily to Adonai, someone is to open the east gate for him; and he is to provide his burnt offering and peace offerings as he does on Shabbat. Then he will leave; and after he leaves, the gate is to be shut."},{"num":13,"verse":"“‘You are to provide a lamb in its first year that has no defect for a daily burnt offering to Adonai; do this each morning. "},{"num":14,"verse":"Also each morning, provide with it a grain offering, one-sixth of a bushel, and one-third of a gallon of olive oil to moisten the fine flour; this is the ongoing grain offering for Adonai, by a permanent regulation. "},{"num":15,"verse":"Thus they will offer a lamb, a grain offering and oil each morning as the ongoing burnt offering.’"},{"num":16,"verse":"“Adonai Elohim says this: ‘If the prince turns over part of his hereditary property to one of his sons, it is his inheritance; it will belong to his sons; it is their possession by inheritance. "},{"num":17,"verse":"But if he gives part of his hereditary property to one of his slaves, it will be his until the year of freedom, at which time it will revert to the prince, so that the prince’s heritage will go to his sons. "},{"num":18,"verse":"The prince is not to take over any of the people’s inheritance, thereby evicting them wrongfully from their property; he is to give his sons an inheritance out of his own property, so that none of my people will be driven off their property.’”"},{"num":19,"verse":"Next, he brought me through the entry at the side of the gate into the holy rooms facing north that were for the cohanim. At their far west end I saw a place "},{"num":20,"verse":"about which he said to me, “This is the place where the cohanim will boil the guilt offerings and sin offerings and bake the grain offerings. In this way they won’t have to bring them into the outer courtyard and risk transmitting holiness to the people.” "},{"num":21,"verse":"He took me into the outer courtyard and had me pass by the four corners of the courtyard, and there in each corner of the courtyard was another courtyard — "},{"num":22,"verse":"in the four corners of the courtyard were enclosed courtyards seventy feet long and fifty-two-and-a-half feet; the four courtyards in the corners were the same size. "},{"num":23,"verse":"There was a wall around each of the four, with open stoves all around the bases of the walls. "},{"num":24,"verse":"He said to me, “These are the stoves where those serving in the house will boil the people’s sacrifices.”"}]