[{"header":"Chapter 46"},{"num":1,"verse":"Sabbaths. Thus says the Lord God: The gate of the inner court facing east shall remain closed throughout the six working days, but on the sabbath and on the day of the new moon it shall be open. "},{"num":2,"verse":"Then the prince shall enter from outside by way of the vestibule of the gate and remain standing at the doorpost of the gateway while the priests sacrifice his burnt offerings and communion offerings; then he shall bow down in worship at the opening of the gate and leave. But the gate shall not be closed until evening. "},{"num":3,"verse":"The people of the land also shall bow down in worship before the Lord at the opening of this gate on the sabbaths and new moons. "},{"num":4,"verse":"The burnt offerings which the prince sacrifices to the Lord on the sabbath shall consist of six unblemished lambs and an unblemished ram, "},{"num":5,"verse":"together with a grain offering of one ephah for the ram and whatever he pleases for the lambs, and a hin of oil for each ephah. "},{"num":6,"verse":"On the day of the new moon, he shall provide an unblemished young bull, six lambs, and a ram without blemish, "},{"num":7,"verse":"with a grain offering of one ephah for the bull and an ephah for the ram, and for the lambs whatever he can, and for each ephah a hin of oil."},{"num":8,"verse":"Ritual Laws. When the prince enters, he shall always enter and depart by the vestibule of the gate. "},{"num":9,"verse":"When the people of the land come before the Lord to bow down on the festivals, if they enter by the north gate they shall leave by the south gate, and if they enter by the south gate they shall leave by the north gate. They shall not go back by the gate through which they entered; everyone shall leave by the opposite gate. "},{"num":10,"verse":"When they come in, the prince shall be with them; he shall also leave with them. "},{"num":11,"verse":"On feasts and festivals, the grain offering shall be an ephah for a bull, an ephah for a ram, but for the lambs whatever they please, and a hin of oil with each ephah. "},{"num":12,"verse":"When the prince makes a freewill offering to the Lord, whether a burnt offering or communion offering, the gate facing east shall be opened for him, and he shall bring his burnt offering or peace offering as he does on the sabbath. Then he shall leave, and the gate shall be closed after his departure. "},{"num":13,"verse":"Every day you shall bring as a burnt offering to the Lord an unblemished year-old lamb; you shall offer it every morning, "},{"num":14,"verse":"and with it every morning a grain offering of one sixth of an ephah, with a third of a hin of oil to moisten the fine flour. This grain offering for the Lord is a perpetual statute. "},{"num":15,"verse":"The lamb, the grain offering, and the oil you must bring every morning as a perpetual burnt offering."},{"num":16,"verse":"The Prince and the Land. Thus says the Lord God: If the prince makes a gift of part of his heritage to any of his sons, it belongs to his sons; that property is their heritage. "},{"num":17,"verse":"But if he makes a gift of part of his heritage to one of his servants, it belongs to him until the year of release; then it reverts to the prince. Only the heritage given to his sons belongs to him. "},{"num":18,"verse":"The prince shall not seize any part of the heritage of the people by forcing them off their property. From his own property he shall provide heritage for his sons, so that none of my people will be driven off their property."},{"num":19,"verse":"The Temple Kitchens. Then he brought me through the entrance at the side of the gateway to the chambers reserved for the priests, which faced north. There I saw a place at the far west end, "},{"num":20,"verse":"about which he said to me, “This is the place where the priests cook the reparation offerings and the purification offerings and bake the grain offerings, so they do not have to bring them into the outer court and so transmit holiness to the people.” "},{"num":21,"verse":"Then he led me into the outer court and had me cross to the four corners of the court, and there, in each corner, was another court! "},{"num":22,"verse":"In all four corners of the courtyard there were courts set off, each forty cubits long by thirty cubits wide, all four of them the same size. "},{"num":23,"verse":"A stone wall surrounded them on four sides, and ovens were built along the bottom of the walls all the way around. "},{"num":24,"verse":"He said to me, “These are the kitchens where the temple ministers cook the sacrifices of the people.”"}]