[{"header":"David’s census"},{"num":24,"verse":"The Lord burned with anger against Israel again, and he incited David against them: Go and count the people of Israel and Judah."},{"num":2,"verse":"So the king said to Joab and the military commanders who were with him, “Go throughout all the tribes of Israel, from Dan to Beer-sheba, and take a census of the people so I know how many people there are.”"},{"num":3,"verse":"Joab said to the king, “May the Lord your God increase the number of people a hundred times while the eyes of my master the king can still see it! But why does my master the king want to do this?”"},{"num":4,"verse":"But the king’s word overruled Joab and the military commanders. So Joab and the commanders left the king’s presence to take a census of the Israelites."},{"num":5,"verse":"They crossed the Jordan River and began from Aroer and from the town that is in the middle of the valley of Gad, then on to Jazer."},{"num":6,"verse":"They continued to Gilead and on to Kadesh in Hittite territory. They came to Dan and went around to Sidon."},{"num":7,"verse":"They went to the fortress of Tyre and to all the towns of the Hivites and the Canaanites. They went out to Beer-sheba in the arid southern plain of Judah."},{"num":8,"verse":"At the end of nine months and twenty days, after going through the entire country, they came back to Jerusalem."},{"num":9,"verse":"Joab reported to the king the number of the people who had been counted: in Israel there were eight hundred thousand strong men who could handle a sword; in Judah the total was five hundred thousand men."},{"num":10,"verse":"But after this David felt terrible that he had counted the people. David said to the Lord, “I have sinned greatly in what I have done. Now, Lord, please take away the guilt of your servant because I have done something very foolish.”"},{"num":11,"verse":"When David got up the next morning, the Lord’s word came to the prophet Gad, David’s seer:"},{"num":12,"verse":"Go and tell David, This is what the Lord says: I’m offering you three punishments. Choose one of them, and that is what I will do to you."},{"num":13,"verse":"So Gad went to David and said to him, “Will three years of famine come on your land? Or will you run from your enemies for three months while they chase you? Or will there be three days of plague in your land? Decide now what answer I should take back to the one who sent me.”"},{"num":14,"verse":"“I’m in deep trouble,” David said to Gad. “Let’s fall into the Lord’s hands because his mercy is great, but don’t let me fall into human hands.”"},{"num":15,"verse":"So the Lord sent a plague on Israel from that very morning until the allotted time. Seventy thousand people died, from Dan to Beer-sheba."},{"num":16,"verse":"But when the divine messenger stretched out his hand to destroy Jerusalem, the Lord regretted doing this disaster and said to the messenger who was destroying the people, “That’s enough! Withdraw your hand.” At that time the Lord’s messenger was by the threshing floor of Araunah from Jebus."},{"num":17,"verse":"When David saw the messenger who was striking down the people, he said, “I’m the one who sinned! I’m the one who has done wrong. But these sheep—what have they done wrong? Turn your hand against me and my household.”"},{"num":18,"verse":"That same day Gad came to David and told him, “Go up and build an altar to the Lord on the threshing floor of Araunah from Jebus.”"},{"num":19,"verse":"So David went up, following Gad’s instructions, just as the Lord had commanded."},{"num":20,"verse":"Araunah looked up and saw the king and his servants approaching him. Araunah rushed out and bowed low before the king, his nose to the ground."},{"num":21,"verse":"Araunah said, “Why has my master and king come to his servant?”"},{"num":22,"verse":"Then Araunah said to David, “Take it for yourself, and may my master the king do what he thinks is best. Here are oxen for the entirely burned offering, and here are threshing boards and oxen yokes for wood."},{"num":23,"verse":"All this, Your Majesty, Araunah gives to the king.” Then he added, “May the Lord your God respond favorably to you!”"},{"num":24,"verse":"“No,” the king said to Araunah. “I will buy them from you at a fair price. I won’t offer up to the Lord my God entirely burned offerings that cost me nothing.” So David bought the threshing floor and the oxen for fifty shekels of silver."},{"num":25,"verse":"David built an altar there for the Lord and offered entirely burned offerings and well-being sacrifices. The Lord responded to the prayers for the land, and the plague against Israel came to an end."}]