[{"num":35,"verse":"And the Lord spoke these things also to Moses in the plains of Moab by the Jordan, over against Jericho:"},{"num":2,"verse":"Command the children of Israel that they give to the Levites out of their possessions,"},{"num":3,"verse":"Cities to dwell in, and their suburbs round about: that they may abide in the towns, and the suburbs may be for their cattle and beasts:"},{"num":4,"verse":"Which suburbs shall reach from the walls of the cities outward, a thousand paces on every side:"},{"num":5,"verse":"Toward the east shall be two thousand cubits: and toward the south in like manner shall be two thousand cubits: toward the sea also, which looketh to the west, shall be the same extent: and the north side shall be bounded with the like limits. And the cities shall be in the midst, and the suburbs without."},{"num":6,"verse":"And among the cities, which you shall give to the Levites, six shall be separated for refuge to fugitives, that he who hath shed blood may flee to them: and besides these there shall be other forty-two cities,"},{"num":7,"verse":"That is, in all forty-eight with their suburbs."},{"num":8,"verse":"And of these cities which shall be given out of the possessions of the children of Israel, from them that have more, more shall be taken: and from them that have less, fewer. Each shall give towns to the Levites according to the extent of their inheritance."},{"num":9,"verse":"The Lord said to Moses:"},{"num":10,"verse":"Speak to the children of Israel, and thou shalt say to them: When you shall have passed over the Jordan into the land of Chanaan,"},{"num":11,"verse":"Determine what cities shall be for the refuge of fugitives, who have shed blood against their will."},{"num":12,"verse":"And when the fugitive shall be in them, the kinsman of him that is slain may not have power to kill him, until he stand before the multitude, and his cause be judged."},{"num":13,"verse":"And of those cities, that are separated for the refuge of fugitives,"},{"num":14,"verse":"Three shall be beyond the Jordan, and three in the land of Chanaan,"},{"num":15,"verse":"As well for the children of Israel as for strangers and sojourners, that he may flee to them, who hath shed blood against his will."},{"num":16,"verse":"If any man strike with iron, and he die that was struck: he shall be guilty of murder, and he himself shall die."},{"num":17,"verse":"If he throw a stone, and he that is struck die: he shall be punished in the same manner."},{"num":18,"verse":"If he that is struck with wood die: he shall be revenged by the blood of him that struck him."},{"num":19,"verse":"The kinsman of him that was slain, shall kill the murderer: as soon as he apprehendeth him, he shall kill him."},{"num":20,"verse":"If through hatred any one push a man, or fling any thing at him with ill design:"},{"num":21,"verse":"Or being his enemy, strike; him with his hand, and he die: the striker shall be guilty of murder: the kinsman of him that was slain as soon as he findeth him, shall kill him."},{"num":22,"verse":"But if by chance medley, and without hatred,"},{"num":23,"verse":"And enmity, he do any of these things,"},{"num":24,"verse":"And this be proved in the hearing of the people, and the cause be debated between him that struck, and the next of kin:"},{"num":25,"verse":"The innocent shall be delivered from the hand of the revenger, and shall be brought back by sentence into the city, to which he had fled, and he shall abide there until the death of the high priest, that is anointed with the holy oil."},{"num":26,"verse":"If the murderer be found without the limits of the cities that are appointed for the banished,"},{"num":27,"verse":"And be struck by him that is the avenger of blood: he shall not be guilty that killed him."},{"num":28,"verse":"For the fugitive ought to have stayed in the city until the death of the high priest: and after he is dead, then shall the manslayer return to his own country."},{"num":29,"verse":"These things shall be perpetual, and for an ordinance in all your dwellings."},{"num":30,"verse":"The murderer shall be punished by witnesses: none shall be condemned upon the evidence of one man."},{"num":31,"verse":"You shall not take money of him that is guilty of blood, but he shall die forthwith."},{"num":32,"verse":"The banished and fugitives before the death of the high priest may by no means return into their own cities."},{"num":33,"verse":"Defile not the land of your habitation, which is stained with the blood of the innocent: neither can it otherwise be expiated, but by his blood that hath shed the blood of another."},{"num":34,"verse":"And thus shall your possession he cleansed, myself abiding with you. For I am the Lord that dwell among the children of Israel."}]