[{"header":"The Levites’ Towns"},{"num":35,"verse":"The Lord spoke to Moses on the plains of Moab. This was across from Jericho by the Jordan River. He said, "},{"num":2,"verse":"“Command the Israelites to give the Levites cities to live in. These will be cities in the land they receive. Also give the Levites the pastureland around these cities. "},{"num":3,"verse":"Then the Levites will have cities where they may live. And they will have pastureland for their cattle, sheep and other animals. "},{"num":4,"verse":"The pastureland you give the Levites will extend 1,500 feet from the city wall. "},{"num":5,"verse":"Also measure 3,000 feet in each direction from the city wall. Measure 3,000 feet east of the city. Measure 3,000 feet south of the city. Measure 3,000 feet west of the city. And measure 3,000 feet north of the city. The city will be in the center. This will be pastureland for the Levites’ cities."},{"header":"Cities of Safety"},{"num":6,"verse":"“Six of the cities you give the Levites will be cities of safety. A person might accidentally kill someone. If he does, he may run to one of those cities for safety. You must also give 42 other cities to the Levites. "},{"num":7,"verse":"Give the Levites a total of 48 cities and their pastures. "},{"num":8,"verse":"The larger tribes of Israel must give more cities. The smaller tribes must give fewer cities. Each tribe must give some of its cities to the Levites. The number of cities they give will depend on the size of their land.”"},{"num":9,"verse":"Then the Lord said to Moses, "},{"num":10,"verse":"“Tell the Israelites these things: ‘You will cross the Jordan River and go into Canaan. "},{"num":11,"verse":"You must choose cities to be cities of safety. If a person accidentally kills someone, he may run to them for safety. "},{"num":12,"verse":"There he will be safe from the dead person’s relative who has the duty of punishing the killer. He will not die before he is judged in court. "},{"num":13,"verse":"The six cities you give will be cities of safety. "},{"num":14,"verse":"Give three cities east of the Jordan River. And give three cities in Canaan as cities of safety. "},{"num":15,"verse":"These six cities will be places of safety for citizens of Israel. And they will be for foreigners and other people living with you. Any of these people may run to one of these cities if he accidentally kills someone."},{"num":16,"verse":"“‘If a person uses an iron weapon to kill someone, he is a murderer. He must be put to death. "},{"num":17,"verse":"A person might take a rock that could kill someone. If he kills a person with it, he is a murderer. He must be put to death. "},{"num":18,"verse":"A person might pick up a piece of wood that could kill someone. If he kills someone with it, he is a murderer. He must be put to death. "},{"num":19,"verse":"A relative of the dead person must put the murderer to death. When he finds the murderer, he must kill him. "},{"num":20,"verse":"A person might shove someone and kill him. Or he might throw something at someone and kill him. "},{"num":21,"verse":"Or he might hit someone with his hand and kill him. If he did that from hate, he is a murderer. He must be put to death. A relative of the dead person must kill the murderer when he finds him."},{"num":22,"verse":"“‘But a person might suddenly shove someone. He did not hate the person. Or he might accidentally throw something and hit someone. "},{"num":23,"verse":"Or he might drop a rock that could kill someone. It might fall on someone he did not see. And it might kill that person. He didn’t plan to hurt anyone. He didn’t hate the person he killed. "},{"num":24,"verse":"If that happens, the community must decide what to do. They must decide between the relative of the dead person and the killer. Here are the rules. "},{"num":25,"verse":"They must protect the killer from the dead person’s relative. They must send the killer back to the city of safety that he ran to. He must stay there until the high priest dies. The high priest had the holy oil poured on him."},{"num":26,"verse":"“‘That man must never go outside the limits of his city of safety. "},{"num":27,"verse":"If a relative of the dead person finds him outside the city, the relative may kill him. He will not be guilty of murder. "},{"num":28,"verse":"The killer must stay in his city of safety until the high priest dies. After the high priest dies, he may go back to his own land."},{"num":29,"verse":"“‘These laws are for you from now on, wherever you live."},{"num":30,"verse":"“‘A killer may be put to death only if he is a murderer. And there must be witnesses. No one may be put to death with only one witness."},{"num":31,"verse":"“‘A murderer should die. Don’t take money to spare his life. He must be put to death."},{"num":32,"verse":"“‘A person might run to a city of safety. Don’t take money to let him go back home before the high priest dies."},{"num":33,"verse":"“‘Don’t let murder spoil your land. There is only one way to remove the sin of killing an innocent person. The murderer must be put to death. "},{"num":34,"verse":"I am the Lord. I live among the Israelites. I live in that land with you. So do not spoil it with murder.’”"}]