[{"header":"Chapter 35"},{"num":1,"verse":"The Levites’ Share. The Lord spoke to Moses in the plain of Moab near the Jordan, across from Jericho, saying,"},{"num":2,"verse":"“Command the people of Israel to give cities to the Levites from the inheritance that they will possess. Also give the Levites pastures around the cities."},{"num":3,"verse":"They are to have cities in which they can dwell as well as pastures for their cattle, their flocks, and all their other animals."},{"num":4,"verse":"The pastures that you will give the Levites around the cities will extend one thousand cubits from the city wall."},{"num":5,"verse":"“Outside of the city, measure two thousand cubits on the east side, two thousand cubits on the south side, two thousand cubits on the west side, and two thousand cubits on the north side, with the city in the middle. This will be the pastures for the city."},{"num":6,"verse":"“Six of the cities that you give to the Levites will be established as cities of refuge to which a person who has killed another can flee. In addition, there are to be another forty-two cities."},{"num":7,"verse":"In all you will give the Levites forty-eight cities along with their pastures."},{"num":8,"verse":"The cities that you will give the Levites from the possession of Israel will be given according to the inheritance that they have inherited. Those who have more will give more and those who have less will give less.”"},{"num":9,"verse":"Cities of Refuge. The Lord said to Moses,"},{"num":10,"verse":"“Speak to the people of Israel and say to them, ‘When you cross the Jordan into the land of Canaan,"},{"num":11,"verse":"choose cities that will be your cities of refuge to which a person who has accidentally killed another person can flee."},{"num":12,"verse":"These will be cities of refuge from the kinsman avenger so that the killer will not die until he has received judgment before the assembly."},{"num":13,"verse":"These six cities that you give will be your cities of refuge."},{"num":14,"verse":"Give three cities across the Jordan and give three cities in the land of Canaan to be your cities of refuge."},{"num":15,"verse":"These six cities will be a refuge for the people of Israel, for foreigners, and for foreigners dwelling among them, to which a person who has killed accidentally can flee."},{"num":16,"verse":"Treatment of Murderers.“ ‘If someone strikes another with an iron object to kill him, then he is a murderer. The murderer will be put to death."},{"num":17,"verse":"If someone strikes another with a stone in his hand to kill him, then he is a murderer. The murderer will be put to death."},{"num":18,"verse":"If someone strikes another with a wooden object in his hand to kill him, then he is a murderer. The murderer will be put to death."},{"num":19,"verse":"The kinsman avenger of blood will kill him. When he meets the murderer, he will put him to death."},{"num":20,"verse":"If anyone pushes another person out of hatred or lays in wait and throws something at him in order to kill him,"},{"num":21,"verse":"or if with bitterness he strikes someone with his hand in order to kill him, then that person will be put to death, for he is a murderer. The kinsman avenger of blood will kill the murderer when he meets him."},{"num":22,"verse":"“ ‘But if someone without bitterness pushes another person or throws something at him without his lying in wait,"},{"num":23,"verse":"or he has a deadly stone object and he does not see the other, but drops it on him causing him to die, and he was not an enemy nor was he seeking to harm the other person,"},{"num":24,"verse":"then the assembly will judge between the killer and the kinsman avenger of blood according to these ordinances:"},{"num":25,"verse":"the assembly will save the killer from the hands of the kinsman avenger of blood. The assembly will send him back to the city of refuge to which he fled. He will live in it until the death of the high priest who was anointed with holy oil."},{"num":26,"verse":"“ ‘But if the killer at any time crosses over the boundary of the city of refuge to which he has fled,"},{"num":27,"verse":"and the kinsman avenger of blood finds him outside of the boundary of the city of refuge, and the kinsman avenger of blood kills the killer, he will not be considered to have blood guilt."},{"num":28,"verse":"He should have remained in the city of refuge until the death of the high priest. After the death of the high priest, the killer can return to the land of his possession."},{"num":29,"verse":"These things will be a statute and an ordinance for you for all of your generations and in all of your dwellings."},{"num":30,"verse":"“ ‘If a person kills another, the murderer will be put to death upon the testimony of witnesses. But no one is to be put to death on the testimony of a single witness."},{"num":31,"verse":"You are not to accept a ransom for the murderer who is guilty of death; he is to be put to death."},{"num":32,"verse":"You are not to take a ransom from someone who has fled to his city of refuge who wants to return to live in the land before the death of the priest."},{"num":33,"verse":"“ ‘You are not to pollute the land in which you live, for blood pollutes the land, and the land cannot be cleansed of the blood that is shed upon it except through the blood of the person who shed it."},{"num":34,"verse":"You are not to pollute the land in which you dwell, for I dwell in it; I, the Lord, dwell among the people of Israel.’ ”"}]