[{"header":"Passover"},{"num":9,"verse":"The Lord spoke to Moses in the Sinai desert in the first month of the second year after they had left the land of Egypt:"},{"num":2,"verse":"Let the Israelites keep the Passover at its appointed time."},{"num":3,"verse":"On the fourteenth day of this month at twilight you will keep it at its appointed time. Keep it according to all its regulations and its customary practices."},{"num":4,"verse":"Moses instructed the Israelites to keep the Passover."},{"num":5,"verse":"At twilight on the fourteenth day of the first month they kept the Passover in the Sinai desert. The Israelites did everything just as the Lord commanded Moses."},{"num":6,"verse":"But there were persons who were unclean from contact with a human corpse, and they were unable to keep the Passover on that day. They approached Moses and Aaron that day."},{"num":7,"verse":"These persons said to him, “Although we are unclean from contact with a human corpse, why must we be prohibited from presenting the Lord’s offering at its appointed time with the rest of the Israelites?”"},{"num":8,"verse":"Moses said to them, “Wait while I listen for what the Lord will command concerning you.”"},{"num":9,"verse":"The Lord spoke to Moses:"},{"num":10,"verse":"Tell the Israelites: When any of you or your descendants are unclean from contact with a corpse or are on a long trip, they may still keep the Passover to the Lord."},{"num":11,"verse":"They will keep it at twilight on the fourteenth day of the second month. They will eat the Passover lamb with unleavened bread and bitter herbs."},{"num":12,"verse":"They must not leave any of it until morning, nor break any of its bones. They will keep the Passover according to all its regulations."},{"num":13,"verse":"But any persons who are clean and not on a trip, yet don’t keep the Passover, those persons will be cut off from their people, because they didn’t present the Lord’s offering at its appointed time. Those persons will bear their sin."},{"num":14,"verse":"If an immigrant resides among you and wishes to keep the Passover to the Lord, that one also will keep it according to its regulations and its customary practices. There will be one set of regulations for both of you, for the immigrant and for the native of the land."},{"header":"Cloud over the dwelling"},{"num":15,"verse":"On the day the dwelling was erected, the cloud covered the dwelling, the covenant tent. At night until morning, the cloud appeared with lightning over the dwelling."},{"num":16,"verse":"It was always there. The cloud covered it by day, appearing with lightning at night."},{"num":17,"verse":"Whenever the cloud ascended from the tent, the Israelites would march. And the Israelites would camp wherever the cloud settled."},{"num":18,"verse":"At the Lord’s command, the Israelites would march, and at the Lord’s command they would camp. As long as the cloud settled on the dwelling, they would camp."},{"num":19,"verse":"When the cloud lingered on the meeting tent for many days, the Israelites would observe the Lord’s direction and they wouldn’t march."},{"num":20,"verse":"Sometimes the cloud would be over the dwelling for a number of days, so they would camp at the Lord’s command, marching again only at the Lord’s command."},{"num":21,"verse":"Sometimes the cloud would settle only overnight, and they would march when the cloud ascended in the morning. Whether it was day or night, they would march when the cloud ascended."},{"num":22,"verse":"Whether it was two days, or a month, or a long time, the Israelites would camp so long as the cloud lingered on the dwelling and settled on it. They wouldn’t march. But when it ascended, they would march."},{"num":23,"verse":"They camped at the Lord’s command and they marched at the Lord’s command. They followed the Lord’s direction according to the Lord’s command through Moses."}]