[{"header":"The Passover at Sinai"},{"num":9,"verse":"And the Lord spoke to Moses in the Wilderness of Sinai, in the first month of the second year after they came out of the land of Egypt, saying: "},{"num":2,"verse":"Let the children of Israel also keep the Passover at its appointed time. "},{"num":3,"verse":"On the fourteenth day of this month, at evening, you will keep it at its appointed time. According to all its rites and according to all its ceremonies, you will keep it."},{"num":4,"verse":"Moses spoke to the children of Israel, that they should keep the Passover. "},{"num":5,"verse":"They kept the Passover on the fourteenth day of the first month at evening in the Wilderness of Sinai. According to all that the Lord commanded Moses, so the children of Israel did."},{"num":6,"verse":"There were men who were unclean by the dead body of a man, so they could not keep the Passover on that day, and they came before Moses and before Aaron on that day. "},{"num":7,"verse":"And those men said to him, “We are defiled by the dead body of a man. Why are we kept back, that we may not offer an offering of the Lord at its appointed time among the children of Israel?”"},{"num":8,"verse":"And Moses said to them, “Stand still, and I will hear what the Lord will command concerning you.”"},{"num":9,"verse":"The Lord spoke to Moses, saying: "},{"num":10,"verse":"Speak to the children of Israel, saying: If any man of you or of your posterity is unclean because of a dead body, or is far off on a journey, he will still keep the Passover to the Lord. "},{"num":11,"verse":"The fourteenth day of the second month at evening they will keep it, and eat it with unleavened bread and bitter herbs. "},{"num":12,"verse":"They will leave none of it until the morning, nor break any of its bones. According to all the ordinances of the Passover they will keep it. "},{"num":13,"verse":"But the man who is ceremonially clean, and is not on a journey, and fails to keep the Passover, even the same person will be cut off from his people. Because he did not bring the offering of the Lord at its appointed time, that man will bear his sin."},{"num":14,"verse":"If a stranger will sojourn among you and will keep the Passover to the Lord, according to the ordinance of the Passover, and according to the manner of it, so he will do. You will have one ordinance both for the resident alien and for the natural born citizen of the land."},{"header":"The Cloud and the Fire"},{"num":15,"verse":"And on the day that the tabernacle was erected, the cloud covered the tabernacle, the tent of the testimony, and at evening there was over the tabernacle the appearance of fire until the morning. "},{"num":16,"verse":"So it was always. The cloud covered it by day, and the appearance of fire by night. "},{"num":17,"verse":"When the cloud was lifted up from over the tabernacle, then after it the children of Israel journeyed, and in the place where the cloud settled, there the children of Israel camped. "},{"num":18,"verse":"At the commandment of the Lord the children of Israel journeyed, and at the commandment of the Lord they camped. As long as the cloud dwelt over the tabernacle they camped. "},{"num":19,"verse":"When the cloud remained many days over the tabernacle, then the children of Israel kept the charge of the Lord and did not journey. "},{"num":20,"verse":"When the cloud remained a few days over the tabernacle, according to the commandment of the Lord they dwelt in their tents, and according to the commandment of the Lord they journeyed. "},{"num":21,"verse":"When the cloud dwelt from evening until morning and the cloud was lifted up in the morning, then they journeyed. Whether it was by day or by night that the cloud was lifted up, they journeyed. "},{"num":22,"verse":"Whether it was two days, or a month, or a long time that the cloud dwelt over the tabernacle, the children of Israel dwelt in their tents and did not journey. But when it was lifted up they journeyed. "},{"num":23,"verse":"At the command of the Lord they camped, and at the command of the Lord they journeyed. They kept the charge of the Lord at the command of the Lord by the hand of Moses."}]