[{"header":"The Day of Yahweh"},{"num":12,"verse":"An oracle. The word of Yahweh concerning Israel. “Thus declares Yahweh, who stretches out the heavens, founds the earth, and forms the spirit of humankind in its midst: "},{"num":2,"verse":"‘Look, I am going to make Jerusalem a cup of reeling for all the surrounding nations; it will also be against Judah in the siege against Jerusalem. "},{"num":3,"verse":"And then on that day I will make Jerusalem a stone weight for all the peoples. All those lifting it up will grievously hurt themselves, and all the nations of the earth will assemble against it. "},{"num":4,"verse":"On that day,’ declares Yahweh, ‘I will strike every horse with confusion, and the one riding it with madness; but over the house of Judah I will keep my eyes open, and I will strike every horse of the peoples with blindness. "},{"num":5,"verse":"And the clans of Judah will say to themselves, “The inhabitants of Jerusalem are a strength to us, through Yahweh of hosts, their God.”"},{"num":6,"verse":"“‘On that day I will make the clans of Judah like a pan of fire among sticks of wood, and like a torch of fire among stalks of grain, and they will devour to the right and to the left all the surrounding peoples, and Jerusalem will be inhabited again in its place, in Jerusalem. "},{"num":7,"verse":"And Yahweh will save the tents of Judah first, so that the glory of the house of David and the glory of the inhabitants of Jerusalem may not be exalted over Judah. "},{"num":8,"verse":"On that day Yahweh will put a shield around the inhabitants of Jerusalem, and the one who stumbles among them on that day will be like David, and the house of David will be like God, like the angel of Yahweh, before them. "},{"num":9,"verse":"And then on that day I will seek to destroy all the nations coming against Jerusalem."},{"num":10,"verse":"“‘I will pour on the house of David and on the inhabitants of Jerusalem a spirit of grace and supplication, and they will look to me whom they pierced, and they shall mourn over him, as one wails over an only child, and they will grieve bitterly over him as one grieves bitterly over a firstborn. "},{"num":11,"verse":"On that day the wailing will be great in Jerusalem, like the wailing for Hadad Rimmon in the plain of Megiddo. "},{"num":12,"verse":"And the land shall mourn, each clan by itself; the clan of the house of David by itself, and their wives by themselves; the clan of the house of Nathan by itself, and their wives by themselves; "},{"num":13,"verse":"the clan of the house of Levi by itself, and their wives by themselves; the clan of the Shimeites by itself, and their wives by themselves; "},{"num":14,"verse":"and all those clans remaining, each clan by itself, and their wives by themselves.’”"}]