[{"num":6,"verse":"“Now this is the mitzvah, the laws and rulings which Adonai your God ordered me to teach you for you to obey in the land you are crossing over to possess, "},{"num":2,"verse":"so that you will fear Adonai your God and observe all his regulations and mitzvot that I am giving you — you, your child and your grandchild — as long as you live, and so that you will have long life. "},{"num":3,"verse":"Therefore listen, Isra’el, and take care to obey, so that things will go well with you, and so that you will increase greatly, as Adonai, the God of your ancestors, promised you by giving you a land flowing with milk and honey."},{"num":4,"verse":"(A:vi, S: v) “Sh’ma, Yisra’el! Adonai Eloheinu, Adonai echad [Hear, Isra’el! Adonai our God, Adonai is one]; "},{"num":5,"verse":"and you are to love Adonai your God with all your heart, all your being and all your resources. "},{"num":6,"verse":"These words, which I am ordering you today, are to be on your heart; "},{"num":7,"verse":"and you are to teach them carefully to your children. You are to talk about them when you sit at home, when you are traveling on the road, when you lie down and when you get up. "},{"num":8,"verse":"Tie them on your hand as a sign, put them at the front of a headband around your forehead, "},{"num":9,"verse":"and write them on the door-frames of your house and on your gates."},{"num":10,"verse":"(S: vi) “When Adonai your God has brought you into the land he swore to your ancestors Avraham, Yitz’chak and Ya‘akov that he would give you — cities great and prosperous, which you didn’t build; "},{"num":11,"verse":"houses full of all sorts of good things, which you didn’t fill; water cisterns dug out, which you didn’t dig; vineyards and olive trees, which you didn’t plant — and you have eaten your fill; "},{"num":12,"verse":"then be careful not to forget Adonai, who brought you out of the land of Egypt, where you lived as slaves. "},{"num":13,"verse":"You are to fear Adonai your God, serve him and swear by his name. "},{"num":14,"verse":"You are not to follow other gods, chosen from the gods of the peoples around you; "},{"num":15,"verse":"because Adonai, your God, who is here with you, is a jealous God. If you do, the anger of Adonai your God will flare up against you and he will destroy you from the face of the earth. "},{"num":16,"verse":"Do not put Adonai your God to the test, as you tested him at Massah [testing]. "},{"num":17,"verse":"Observe diligently the mitzvot of Adonai your God, and his instructions and laws which he has given you. "},{"num":18,"verse":"You are to do what is right and good in the sight of Adonai, so that things will go well with you, and you will enter and possess the good land Adonai swore to your ancestors, "},{"num":19,"verse":"expelling all your enemies ahead of you, as Adonai said."},{"num":20,"verse":"“Some day your child will ask you, ‘What is the meaning of the instructions, laws and rulings which Adonai our God has laid down for you?’ "},{"num":21,"verse":"Then you will tell your child, ‘We were slaves to Pharaoh in Egypt, and Adonai brought us out of Egypt with a strong hand. "},{"num":22,"verse":"Adonai worked great and terrible signs and wonders against Egypt, Pharaoh and all his household, before our very eyes. "},{"num":23,"verse":"He brought us out from there in order to bring us to the land he had sworn to our ancestors that he would give us. "},{"num":24,"verse":"Adonai ordered us to observe all these laws, to fear Adonai our God, always for our own good, so that he might keep us alive, as we are today. "},{"num":25,"verse":"It will be righteousness for us if we are careful to obey all these mitzvot before Adonai our God, just as he ordered us to do.’”"}]