[{"num":6,"verse":"These are the precepts, and ceremonies, and judgments, which the Lord your God commanded that I should teach you, and that you should do them in the land into which you pass over to possess it:"},{"num":2,"verse":"That thou mayst fear the Lord thy God, and keep all his commandments and precepts, which I command thee, and thy sons, and thy grandsons, all the days of thy life, that thy days may be prolonged."},{"num":3,"verse":"Hear, O Israel, and observe to do the things which the Lord hath commanded thee, that it may be well with thee, and thou mayst be greatly multiplied, as the Lord the God of thy fathers hath promised thee a land flowing with milk and honey."},{"num":4,"verse":"Hear, O Israel, the Lord our God is one Lord."},{"num":5,"verse":"Thou shalt love the Lord thy God with thy whole heart, and with thy whole soul, and with thy whole strength."},{"num":6,"verse":"And these words which I command thee this day, shall be in thy heart:"},{"num":7,"verse":"And thou shalt tell them to thy children, and thou shalt meditate upon them sitting in thy house, and walking on thy journey, sleeping and rising."},{"num":8,"verse":"And thou shalt bind them as a sign on thy hand, and they shall be and shall move between thy eyes."},{"num":9,"verse":"And thou shalt write them in the entry, and on the doors of thy house."},{"num":10,"verse":"And when the Lord thy God shall have brought thee into the land, for which he swore to thy fathers Abraham, Isaac, and Jacob: and shall have given thee great and goodly cities, which thou didst not build,"},{"num":11,"verse":"Houses full of riches, which thou didst not set up, cisterns which thou didst not dig, vineyards and oliveyards, which thou didst not plant,"},{"num":12,"verse":"And thou shalt have eaten and be full:"},{"num":13,"verse":"Take heed diligently lest thou forget the Lord, who brought thee out of the land of Egypt, out of the house of bondage. Thou shalt fear the Lord thy God, and shalt serve him only, and thou shalt swear by his name."},{"num":14,"verse":"You shall not go after the strange gods of all the nations, that are round about you:"},{"num":15,"verse":"Because the Lord thy God is a jealous God in the midst of thee: lest at any time the wrath of the Lord thy God be kindled against thee, and take thee away from the face of the earth."},{"num":16,"verse":"Thou shalt not tempt the Lord thy God, as thou temptedst him in the place of temptation."},{"num":17,"verse":"Keep the precepts of the Lord thy God, and the testimonies and ceremonies which he hath commanded thee."},{"num":18,"verse":"And do that which is pleasing and good in the sight of the Lord, that it may be well with thee: and going in thou mayst possess the goodly land, concerning which the Lord swore to thy fathers,"},{"num":19,"verse":"That he would destroy all thy enemies before thee, as he hath spoken."},{"num":20,"verse":"And when thy son shall ask thee to morrow, saying: What mean these testimonies, and ceremonies and judgments, which the Lord our God hath commanded us?"},{"num":21,"verse":"Thou shalt say to him: We were bondmen of Pharao in Egypt, and the Lord brought us out of Egypt with a strong hand."},{"num":22,"verse":"And he wrought signs and wonders great and very grievous in Egypt against Pharao, and all his house, in our sight,"},{"num":23,"verse":"And he brought us out from thence, that he might bring us in and give us the land, concerning which he swore to our fathers."},{"num":24,"verse":"And the Lord commanded that we should do all these ordinances, and should fear the Lord our God, that it might be well with us all the days of our life, as it is at this day."},{"num":25,"verse":"And he will be merciful to us, if we keep and do all his precepts before the Lord our God, as he hath commanded us."}]