[{"header":"Moses Presents the Privileges of the Covenant"},{"num":4,"verse":"“Now, Israel, listen to the statutes and the ordinances that I’m teaching you to observe so you may live and go in to take possession of the land that the Lord, the God of your ancestors, is about to give you. "},{"num":2,"verse":"Do not add or subtract a thing to what I’m commanding you. Observe the commands of the Lord your God. "},{"num":3,"verse":"You saw with your own eyes what he did in Baal Peor. The Lord your God exterminated from among you every man who followed Baal of Peor. "},{"num":4,"verse":"But all of you who are clinging to the Lord your God are alive today. "},{"num":5,"verse":"See! I taught you the statutes and the ordinances, just as the Lord God commanded. Therefore, observe them when you enter the land you are about to possess. "},{"num":6,"verse":"Observe them carefully, because this will show your wisdom and discernment in the eyes of people who’ll listen to all these decrees. Then they’ll say: ‘Surely this great nation is a wise and discerning people.’ "},{"num":7,"verse":"For what great nation has a god so near like the Lord our God whenever we call on him? "},{"num":8,"verse":"And what great nation has all the decrees and righteous ordinances like all this teaching that I’m giving you today? "},{"num":9,"verse":"Only guard yourselves carefully so you won’t forget the things that you saw and let them slip from your mind for the rest of your life. Tell them to your children and to your grandchildren. "},{"num":10,"verse":"The day you stood in the presence of the Lord your God in Horeb, the Lord told me, ‘Gather the people before me so they may hear my words, learn to revere me the whole time that they live in the land, and teach them to their children.’”"},{"header":"Moses Warns against Idolatry"},{"num":11,"verse":"“When you approached and stood at the foot of the mountain—a mountain that was blazing with fire at its core while the sky was covered with thick, dark clouds— "},{"num":12,"verse":"the Lord your God spoke from the midst of the fire. You heard the sound of words, but you saw no form; there was only a voice. "},{"num":13,"verse":"He declared to you his covenant, which he commanded you to observe—the Ten Commandments that he wrote on two stone tablets. "},{"num":14,"verse":"The Lord commanded me at that time to teach you to observe the statutes and ordinances in the land after you cross over to take possession of it."},{"num":15,"verse":"“Therefore, for your own sake, be very careful, since you did not see any form on the day that the Lord your God spoke to you in Horeb from the midst of the fire. "},{"num":16,"verse":"Be careful! Otherwise, you will be destroyed when you make carved images for yourself—all sorts of images in the form of man, woman, "},{"num":17,"verse":"any animal on earth, any winged bird that flies in the sky, "},{"num":18,"verse":"any creeping thing on the ground, or any fish in the sea. "},{"num":19,"verse":"Do not gaze toward the heavens and observe the sun, the moon, the stars—the entire array of the sky—with the intent to worship and serve what the Lord your God gave every nation. "},{"num":20,"verse":"For the Lord took you and brought you out of the iron-smelting furnace—out of Egypt—to be the people of his inheritance, as you are today."},{"num":21,"verse":"“But the Lord was angry with me because of you. So he swore that I’ll never cross the Jordan River to enter the good land that the Lord your God is about to give you as an inheritance. "},{"num":22,"verse":"I’m going to die in this land and I won’t cross the Jordan River, but you’re about to cross over to possess that good land. "},{"num":23,"verse":"Be careful! Otherwise, you will forget the covenant of the Lord your God, who established that covenant with you. Don’t make carved images of any likeness in violation of everything that you were commanded by the Lord your God. "},{"num":24,"verse":"Indeed, the Lord your God is a consuming fire. He is a jealous God.”"},{"header":"Warnings against Angering God"},{"num":25,"verse":"“After you’ve borne children and grandchildren, have been there for a long time in the land, have become so corrupted that you make images of any form, and have done evil in the eyes of the Lord your God, you will provoke him to anger. "},{"num":26,"verse":"Heaven and earth will testify against what has occurred today: you’ll surely and swiftly be destroyed from the land that you are about to possess by crossing the Jordan River. You won’t live long in it, because you’ll certainly be exterminated. "},{"num":27,"verse":"Moreover, the Lord will scatter you among the nations, and you’ll be fewer in number in the nations where the Lord your God will drive you. "},{"num":28,"verse":"There you’ll serve gods made by human hands, serving trees and stones that cannot see, hear, eat, nor smell. "},{"num":29,"verse":"If from there you will seek the Lord your God, then you will find him if you seek him with all your heart and soul. "},{"num":30,"verse":"In your distress, when all these things happen to you in days to come and you return to the Lord your God, then you will hear his voice. "},{"num":31,"verse":"For God is compassionate. The Lord your God won’t fail you. He won’t destroy you or forget the covenant that he confirmed with your ancestors.”"},{"header":"Who is Like the Lord?"},{"num":32,"verse":"“Indeed, ask from one end of the heavens to the other about days of old, before your time, when God created mankind on the earth. Did we ever have anything as great as this, or ever hear of anything like it? "},{"num":33,"verse":"Has any people heard the voice of God speaking from the middle of a fire just as you did, and survived it? "},{"num":34,"verse":"Or has any god ever taken for himself one nation out from another nation with testings, signs, wonders, wars, awesome power, and magnificent, terrifying deeds as the Lord your God did in Egypt before your eyes?"},{"num":35,"verse":"“You have been shown this in order to know that ‘the Lord is God’ and there is no one like him. "},{"num":36,"verse":"You have been made to hear his voice from heaven so you may be instructed. And he showed you his great fire here on earth, and you heard his voice from the middle of that fire. "},{"num":37,"verse":"Moreover, he loved your ancestors, chose their descendants after them, and brought you out of Egypt, accompanied by his presence and great power, "},{"num":38,"verse":"in order to drive out nations that are stronger and more powerful than you, to bring you into this land, and to give you their land as an inheritance, as it is today."},{"num":39,"verse":"“May you acknowledge and take to heart this day that the Lord is God in the heavens above and over the earth below—there is no other God. "},{"num":40,"verse":"May you observe his statutes and keep his commands that I’m giving you today, so that life may go well for you and for your descendants after you. That way, you’ll live a long life in the land that the Lord your God is about to give you permanently.”"},{"header":"Cities of Refuge"},{"num":41,"verse":"Then Moses designated three cities on the east side of the Jordan, "},{"num":42,"verse":"where a person who accidentally killed someone could flee, if he killed his neighbor without having enmity toward him in the past. He may flee to one of these cities and live: "},{"num":43,"verse":"Bezer in the desert plain for the descendants of Reuben, Ramoth in Gilead for the descendants of Gad, and Golan in Bashan for the descendants of Manasseh."},{"header":"Moses Reviews the Law"},{"num":44,"verse":"This is the Law that Moses reviewed in the presence of the Israelis. "},{"num":45,"verse":"These are the instructions, decrees, and ordinances that Moses declared to the Israelis when they came out of Egypt. "},{"num":46,"verse":"He did this east of the Jordan, in the valley opposite Beth Peor, in the land of Sihon, king of the Amorites, who lived in Heshbon, and whom Moses and the Israelis defeated after leaving Egypt. "},{"num":47,"verse":"So they took possession of his land, as well as the land of King Og of Bashan. Both Amorite kings lived east of the Jordan—"},{"num":48,"verse":"from Aroer on the edge of the Wadi Arnon as far as Mount Sirion, which is also called Hermon, "},{"num":49,"verse":"and all the Arabah east of the Jordan as far as the Dead Sea below the slopes of Pisgah."}]