[{"num":30,"verse":"Now, once all these things happen to you, the blessing and the curse that I’m setting before you, you must call them to mind as you sit among the various nations where the Lord your God has driven you;"},{"num":2,"verse":"and you must return to the Lord your God, obeying his voice, in line with all that I’m commanding you right now—you and your children—with all your mind and with all your being."},{"num":3,"verse":"Then the Lord your God will restore you as you were before and will have compassion on you, gathering you up from all the peoples where the Lord your God scattered you."},{"num":4,"verse":"Even if he has driven you to the far end of heaven, the Lord your God will gather you up from there; he will take you back from there."},{"num":5,"verse":"The Lord your God will bring you home to the land that your ancestors possessed; you will possess it again. And he will do good things for you and multiply you—making you more numerous even than your ancestors!"},{"num":6,"verse":"Then the Lord your God will circumcise your hearts and the hearts of your descendants so that you love the Lord your God with all your mind and with all your being in order that you may live."},{"num":7,"verse":"The Lord your God will put all these curses on your enemies and on those who hate you and chase you."},{"num":8,"verse":"But you will change and obey the Lord’s voice and do all his commandments that I’m commanding you right now."},{"num":9,"verse":"The Lord your God will help you succeed in everything you do—in your own fertility, your livestock’s offspring, and your land’s produce—everything will be great! Because the Lord will once again enjoy doing good things for you just as he enjoyed doing them for your ancestors,"},{"num":10,"verse":"and because you will be obeying the Lord your God’s voice, keeping his commandments and his regulations that are written in this Instruction scroll, and because you will have returned to the Lord your God with all your heart and all your being."},{"num":11,"verse":"This commandment that I’m giving you right now is definitely not too difficult for you. It isn’t unreachable."},{"num":12,"verse":"It isn’t up in heaven somewhere so that you have to ask, “Who will go up for us to heaven and get it for us that we can hear it and do it?”"},{"num":13,"verse":"Nor is it across the ocean somewhere so that you have to ask, “Who will cross the ocean for us and get it for us that we can hear it and do it?”"},{"num":14,"verse":"Not at all! The word is very close to you. It’s in your mouth and in your heart, waiting for you to do it."},{"header":"Life and death"},{"num":15,"verse":"Look here! Today I’ve set before you life and what’s good versus death and what’s wrong."},{"num":16,"verse":"If you obey the Lord your God’s commandments that I’m commanding you right now by loving the Lord your God, by walking in his ways, and by keeping his commandments, his regulations, and his case laws, then you will live and thrive, and the Lord your God will bless you in the land you are entering to possess."},{"num":17,"verse":"But if your heart turns away and you refuse to listen, and so are misled, worshipping other gods and serving them,"},{"num":18,"verse":"I’m telling you right now that you will definitely die. You will not prolong your life on the fertile land that you are crossing the Jordan River to enter and possess."},{"num":19,"verse":"I call heaven and earth as my witnesses against you right now: I have set life and death, blessing and curse before you. Now choose life—so that you and your descendants will live—"},{"num":20,"verse":"by loving the Lord your God, by obeying his voice, and by clinging to him. That’s how you will survive and live long on the fertile land the Lord swore to give to your ancestors: to Abraham, Isaac, and Jacob."}]