[{"header":"Chapter 30"},{"num":1,"verse":"Compassion for the Repentant. When all these things, the blessing and the curse which I have set before you, come upon you, and you take them to heart in any of the nations where the Lord, your God, has dispersed you, "},{"num":2,"verse":"and return to the Lord, your God, obeying his voice, according to all that I am commanding you today, you and your children, with your whole heart and your whole being, "},{"num":3,"verse":"the Lord, your God, will restore your fortunes and will have compassion on you; he will again gather you from all the peoples where the Lord, your God, has scattered you. "},{"num":4,"verse":"Though you may have been dispersed to the farthest corner of the heavens, even from there will the Lord, your God, gather you; even from there will he bring you back. "},{"num":5,"verse":"The Lord, your God, will then bring you into the land your ancestors once possessed, that you may possess it; and he will make you more prosperous and numerous than your ancestors. "},{"num":6,"verse":"The Lord, your God, will circumcise your hearts and the hearts of your descendants, so that you will love the Lord, your God, with your whole heart and your whole being, in order that you may live. "},{"num":7,"verse":"The Lord, your God, will put all those curses on your enemies and the foes who pursued you. "},{"num":8,"verse":"You, however, shall again obey the voice of the Lord and observe all his commandments which I am giving you today. "},{"num":9,"verse":"Then the Lord, your God, will generously increase your undertakings, the fruit of your womb, the offspring of your livestock, and the produce of your soil; for the Lord, your God, will again take delight in your prosperity, just as he took delight in your ancestors’, "},{"num":10,"verse":"because you will obey the voice of the Lord, your God, keeping the commandments and statutes that are written in this book of the law, when you return to the Lord, your God, with your whole heart and your whole being."},{"num":11,"verse":"For this command which I am giving you today is not too wondrous or remote for you. "},{"num":12,"verse":"It is not in the heavens, that you should say, “Who will go up to the heavens to get it for us and tell us of it, that we may do it?” "},{"num":13,"verse":"Nor is it across the sea, that you should say, “Who will cross the sea to get it for us and tell us of it, that we may do it?” "},{"num":14,"verse":"No, it is something very near to you, in your mouth and in your heart, to do it."},{"num":15,"verse":"The Choice Before Israel. See, I have today set before you life and good, death and evil. "},{"num":16,"verse":"If you obey the commandments of the Lord, your God, which I am giving you today, loving the Lord, your God, and walking in his ways, and keeping his commandments, statutes and ordinances, you will live and grow numerous, and the Lord, your God, will bless you in the land you are entering to possess. "},{"num":17,"verse":"If, however, your heart turns away and you do not obey, but are led astray and bow down to other gods and serve them, "},{"num":18,"verse":"I tell you today that you will certainly perish; you will not have a long life on the land which you are crossing the Jordan to enter and possess. "},{"num":19,"verse":"I call heaven and earth today to witness against you: I have set before you life and death, the blessing and the curse. Choose life, then, that you and your descendants may live, "},{"num":20,"verse":"by loving the Lord, your God, obeying his voice, and holding fast to him. For that will mean life for you, a long life for you to live on the land which the Lord swore to your ancestors, to Abraham, Isaac, and Jacob, to give to them."}]