[{"num":30,"verse":"“When all these things have happened to you—the blessings and the curses I have listed—you will meditate upon them as you are living among the nations where the Lord your God will have driven you. "},{"num":2,"verse":"If at that time you want to return to the Lord your God, and you and your children have begun wholeheartedly to obey all of the commandments I have given you today, "},{"num":3,"verse":"then the Lord your God will rescue you from your captivity! He will have mercy upon you and come and gather you out of all the nations where he will have scattered you. "},{"num":4,"verse":"Though you are at the ends of the earth, he will go and find you and bring you back again "},{"num":5,"verse":"to the land of your ancestors. You shall possess the land again, and he will do you good and bless you even more than he did your ancestors! "},{"num":6,"verse":"He will cleanse your hearts and the hearts of your children and of your children’s children so that you will love the Lord your God with all your hearts and souls, and Israel shall come alive again!"},{"num":7,"verse":"“If you return to the Lord and obey all the commandments that I command you today, the Lord your God will take his curses and turn them against your enemies—against those who hate you and persecute you. "},{"num":9,"verse":"The Lord your God will prosper everything you do and give you many children and much cattle and wonderful crops; for the Lord will again rejoice over you as he did over your fathers. "},{"num":10,"verse":"He will rejoice if you but obey the commandments written in this book of the law, and if you turn to the Lord your God with all your hearts and souls."},{"num":11,"verse":"“Obeying these commandments is not something beyond your strength and reach; "},{"num":12,"verse":"for these laws are not in the far heavens, so distant that you can’t hear and obey them, and with no one to bring them down to you; "},{"num":13,"verse":"nor are they beyond the ocean, so far that no one can bring you their message; "},{"num":14,"verse":"but they are very close at hand—in your hearts and on your lips—so obey them."},{"num":15,"verse":"“Look, today I have set before you life and death, depending on whether you obey or disobey. "},{"num":16,"verse":"I have commanded you today to love the Lord your God and to follow his paths and to keep his laws, so that you will live and become a great nation, and so that the Lord your God will bless you and the land you are about to possess. "},{"num":17,"verse":"But if your hearts turn away and you won’t listen—if you are drawn away to worship other gods—"},{"num":18,"verse":"then I declare to you this day that you shall surely perish; you will not have a long, good life in the land you are going in to possess."},{"num":19,"verse":"“I call heaven and earth to witness against you that today I have set before you life or death, blessing or curse. Oh, that you would choose life; that you and your children might live! "},{"num":20,"verse":"Choose to love the Lord your God and to obey him and to cling to him, for he is your life and the length of your days. You will then be able to live safely in the land the Lord promised your ancestors, Abraham, Isaac, and Jacob.”"}]