[[],[{"type":"header","content":"Inheritance by Marriage"},{"type":"prose","content":"The leaders of the fathers’  of the family of the sons of Gilead, the son of Machir, the son of Manasseh, of the families of the sons of Joseph, approached and spoke before Moses and before the leaders, the heads of the fathers’  of the Israelites, "}],[{"type":"prose","content":"and they said, “The  commanded my lord [Moses] to give the land by lot to the sons of Israel as an inheritance, and my lord was commanded by the  to give the inheritance of Zelophehad our brother to his daughters. "}],[{"type":"prose","content":"But if the daughters marry any of the men from any of the  tribes of Israel, then their inheritance will be taken away from that of our fathers (tribal ancestors) and will be added to the inheritance of the tribe to which they belong; so it will be taken away from our allotted inheritance. "}],[{"type":"prose","content":"When the [year of] Jubilee of the Israelites comes, then their inheritance will be added [permanently] to that of the tribe to which they belong; so their inheritance will be taken away from that of the tribe of our fathers (tribal ancestors).”"}],[{"type":"prose","content":"Then Moses commanded the Israelites in accordance with the word of the , saying, “The statement of the tribe of the sons of Joseph is correct. "}],[{"type":"prose","content":"This is what the  commands regarding the daughters of Zelophehad: ‘Let them marry whom they wish; only they must marry within the family of the tribe of their father.’ "}],[{"type":"prose","content":"So no inheritance of the Israelites shall be transferred from tribe to tribe, for every one of the Israelites shall hold to the inheritance of the tribe of his fathers (tribal ancestors). "}],[{"type":"prose","content":"Every daughter who possesses an inheritance [of land] in any one of the tribes of the Israelites shall marry [only] a man whose family is of her father’s tribe, so that the Israelites may each possess the inheritance of his fathers (tribal ancestors). "}],[{"type":"prose","content":"So no inheritance shall be transferred from one tribe to another, but each of the tribes of the Israelites shall hold to its own inheritance.”"}],[{"type":"prose","content":"The daughters of Zelophehad did as the  commanded Moses. "}],[{"type":"prose","content":"For Mahlah, Tirzah, Hoglah, Milcah, and Noah, the daughters of Zelophehad, were married to sons of their father’s brothers. "}],[{"type":"prose","content":"They married into the families of the descendants of Manasseh the son of Joseph, and their inheritance remained in the tribe of the family of their father."}],[{"type":"prose","content":"These are the commandments and the ordinances (judgments) which the  commanded through Moses to the sons of Israel in the plains of Moab by the Jordan [across from] Jericho."}]]