[{"header":"Marriage of Female Heirs"},{"num":36,"verse":"The heads of the fathers’ houses of the families of the sons of Gilead the son of Machir, son of Manas′seh, of the fathers’ houses of the sons of Joseph, came near and spoke before Moses and before the leaders, the heads of the fathers’ houses of the people of Israel; "},{"num":2,"verse":"they said, “The Lord commanded my lord to give the land for inheritance by lot to the people of Israel; and my lord was commanded by the Lord to give the inheritance of Zeloph′ehad our brother to his daughters. "},{"num":3,"verse":"But if they are married to any of the sons of the other tribes of the people of Israel then their inheritance will be taken from the inheritance of our fathers, and added to the inheritance of the tribe to which they belong; so it will be taken away from the lot of our inheritance. "},{"num":4,"verse":"And when the jubilee of the people of Israel comes, then their inheritance will be added to the inheritance of the tribe to which they belong; and their inheritance will be taken from the inheritance of the tribe of our fathers.”"},{"num":5,"verse":"And Moses commanded the people of Israel according to the word of the Lord, saying, “The tribe of the sons of Joseph is right. "},{"num":6,"verse":"This is what the Lord commands concerning the daughters of Zeloph′ehad, ‘Let them marry whom they think best; only, they shall marry within the family of the tribe of their father. "},{"num":7,"verse":"The inheritance of the people of Israel shall not be transferred from one tribe to another; for every one of the people of Israel shall cleave to the inheritance of the tribe of his fathers. "},{"num":8,"verse":"And every daughter who possesses an inheritance in any tribe of the people of Israel shall be wife to one of the family of the tribe of her father, so that every one of the people of Israel may possess the inheritance of his fathers. "},{"num":9,"verse":"So no inheritance shall be transferred from one tribe to another; for each of the tribes of the people of Israel shall cleave to its own inheritance.’”"},{"num":10,"verse":"The daughters of Zeloph′ehad did as the Lord commanded Moses; "},{"num":11,"verse":"for Mahlah, Tirzah, Hoglah, Milcah, and Noah, the daughters of Zeloph′ehad, were married to sons of their father’s brothers. "},{"num":12,"verse":"They were married into the families of the sons of Manas′seh the son of Joseph, and their inheritance remained in the tribe of the family of their father."},{"num":13,"verse":"These are the commandments and the ordinances which the Lord commanded by Moses to the people of Israel in the plains of Moab by the Jordan at Jericho."}]