[{"num":35,"verse":"2 The Sabbath. 5 The free gifts are required.  21 The readiness of the people to offer. 30 Bezalel and Aholiab are praised of Moses."},{"num":1,"verse":"Then Moses assembled all the Congregation of the children of Israel, and said unto them, These are the words which the Lord hath commanded, that ye should do them:"},{"num":2,"verse":"Six days thou shalt work, but the seventh day shall be unto you the holy Sabbath of rest unto the Lord: whosoever doeth any work therein, shall die."},{"num":3,"verse":"Ye shall kindle no fire throughout all your habitations upon the Sabbath day."},{"num":4,"verse":"¶ Again, Moses spake unto all the Congregation of the children of Israel, saying, This is the thing which the Lord commandeth, saying,"},{"num":5,"verse":"Take from among you an offering unto the Lord: whosoever is of a willing heart, let him bring this offering to the Lord, namely gold, and silver and brass:"},{"num":6,"verse":"Also blue silk, and purple, and scarlet, and fine linen, and goats’ hair,"},{"num":7,"verse":"And rams’ skins dyed red, and badgers’ skins with Shittim wood:"},{"num":8,"verse":"Also oil for light, and spices for the anointing oil, and for the sweet incense,"},{"num":9,"verse":"And onyx stones, and stones to be set in the Ephod, and in the breastplate."},{"num":10,"verse":"And all the wise hearted among you, shall come and make all that the Lord hath commanded:"},{"num":11,"verse":"That is, the Tabernacle, the pavilion thereof, and his covering, and his taches, and his boards, his bars, his pillars, and his sockets,"},{"num":12,"verse":"The Ark, and the bars thereof: the Mercy seat, and the veil that covereth it,"},{"num":13,"verse":"The Table, and the bars of it, and all the instruments thereof, and the showbread:"},{"num":14,"verse":"Also the Candlestick of light and his instruments, and his lamps with the oil for the light:"},{"num":15,"verse":"Likewise the Altar of perfume and his bars, and the anointing oil, and the sweet incense, and the veil of the door at the entering in of the Tabernacle,"},{"num":16,"verse":"The Altar of burnt offering with his brazen grate, his bars and all his instruments, the laver and his foot,"},{"num":17,"verse":"The hangings of the court, his pillars and his sockets, and the veil of the gate of the court,"},{"num":18,"verse":"The pins of the Tabernacle, and the pins of the court with their cords,"},{"num":19,"verse":"The ministering garments to minister in the holy place, and the holy garments of Aaron the Priest, and the garments of his sons, that they may minister in the Priest’s office."},{"num":20,"verse":"¶ Then all the Congregation of the children of Israel departed from the presence of Moses."},{"num":21,"verse":"And every one, whose heart encouraged him, and every one, whose spirit made him willing, came and brought an offering to the Lord, for the work of the Tabernacle of the Congregation, and for all his uses, and for the holy garments."},{"num":22,"verse":"Both men and women, as many as were free hearted, came and brought taches and earrings, and rings, and bracelets, all were jewels of gold: and every one that offered an offering of gold unto the Lord:"},{"num":23,"verse":"Every man also, which had blue silk, and purple, and scarlet, and fine linen and goats’ hair, and rams’ skins dyed red, and badgers’ skins, brought them."},{"num":24,"verse":"All that offered an oblation of silver and of brass, brought the offering unto the Lord: and every one, that had Shittim wood for any manner work of the ministration, brought it."},{"num":25,"verse":"And all the women that were wise-hearted, did spin with their hands, and brought the spun work, even the blue silk, and the purple, the scarlet, and fine linen."},{"num":26,"verse":"Likewise all the women, whose hearts were moved with knowledge, spun goats’ hair."},{"num":27,"verse":"And the rulers brought onyx stones, and stones to be set in the Ephod, and in the breastplate:"},{"num":28,"verse":"Also spice, and oil for light, and for the anointing oil, and for the sweet perfume."},{"num":29,"verse":"Every man and woman of the children of Israel, whose hearts moved them willingly to bring for all the work which the Lord had commanded them to make by the hand of Moses, brought a free offering unto the Lord."},{"num":30,"verse":"¶ Then Moses said unto the children of Israel, Behold, the Lord hath called by name Bezalel the son of Uri, the son of Hur of the tribe of Judah,"},{"num":31,"verse":"And hath filled him with an excellent spirit of wisdom, of understanding, and of knowledge, and in all manner work,"},{"num":32,"verse":"To find out curious works, to work in gold, and in silver, and in brass,"},{"num":33,"verse":"And in graving stones to set them, and in carving of wood, even to make any manner of fine work."},{"num":34,"verse":"And he hath put in his heart that he may teach other: both he, and Aholiab the son of Ahisamach of the tribe of Dan:"},{"num":35,"verse":"Them hath he filled with wisdom of heart to work all manner of cunning and broidered, and needle work: in blue silk, and in purple, in scarlet, and in fine linen and weaving, even to do all manner of work and subtle inventions."}]