[{"header":"Chapter 35"},{"num":1,"verse":"Sabbath Regulations. Moses assembled the whole community of the children of Israel and said to them, “These are the things that the Lord has commanded you to do:"},{"num":2,"verse":"For six days you shall work, but the seventh shall be a holy day for you, a day of absolute rest, sacred to the Lord. Whoever works on that day shall be put to death."},{"num":3,"verse":"You shall light no fires on the Sabbath in all of your dwellings.”"},{"num":4,"verse":"Materials for the Tabernacle. Moses told the whole community of the children of Israel, “This is what the Lord has commanded you to do:"},{"num":5,"verse":"Take up an offering from among yourselves for the Lord. Whoever is generous, let him bring the offering to the Lord: gold, silver, and bronze,"},{"num":6,"verse":"blue, purple, and scarlet material, fine twisted linen, goat hair,"},{"num":7,"verse":"rams’ skins dyed red, sheep skins, acacia wood,"},{"num":8,"verse":"oil for lamps, balsam for anointing, and oil for fragrant incense,"},{"num":9,"verse":"onyx stones and stones for setting in the ephod and the breastplate."},{"num":10,"verse":"“All the artisans among you shall come and make what the Lord has commanded:"},{"num":11,"verse":"the tabernacle, its tent, its covering, its hooks, its boards, its bars, its pillars, its bases;"},{"num":12,"verse":"the Ark and its poles, the seat of atonement, and the veil of the screen;"},{"num":13,"verse":"the table with its poles and all its accessories, the bread of the Presence;"},{"num":14,"verse":"the lampstand that provides light and its accessories, the lamps, and the oil for light;"},{"num":15,"verse":"the altar of incense with its poles, the anointing oil, and the fragrant incense; the screen for the door at the entrance to the tabernacle;"},{"num":16,"verse":"the altar of burnt offerings with its bronze grate, its poles, and all its accessories; the basin and its base;"},{"num":17,"verse":"the drapes for the courtyard, their columns, and their bases, and the screen for the gate of the courtyard;"},{"num":18,"verse":"the pegs for the tabernacle and the pegs for the courtyard and their cords;"},{"num":19,"verse":"the carefully prepared cloths for ministering in the sanctuary, the sacred vestments for Aaron the priest and the vestments for his sons to exercise their priesthood.”"},{"num":20,"verse":"All the community of the children of Israel left the presence of Moses."},{"num":21,"verse":"Then those whose hearts were stirred and whose spirits moved them came and brought the Lord’s offerings to be used for the construction of the meeting tent and for all its service and for the sacred vestments."},{"num":22,"verse":"Men and women came forward, those whose hearts were willing, and they brought brooches and earrings and rings and armlets, all kinds of golden objects, and each man dedicated his gold unto the Lord."},{"num":23,"verse":"All those who had blue or purple or scarlet cloth, or fine linen, or goat hair, or rams’ skins dyed red, or sheep skins brought them."},{"num":24,"verse":"Those who could make an offering of silver or bronze offered it to the Lord. Likewise, those who had acacia wood for some purpose brought it."},{"num":25,"verse":"Furthermore, all the skilled women spun with their hands and brought the blue, purple, and scarlet cloth and the fine linen they had spun."},{"num":26,"verse":"All the women whose hearts were moved by wisdom spun goat hair."},{"num":27,"verse":"The leaders brought onyx stones and stones for setting in the ephod and the breastplate,"},{"num":28,"verse":"balsam and oil for light, oil of anointing, and fragrant incense."},{"num":29,"verse":"Thus, all the men and women whose hearts moved them to bring something for the construction that the Lord had commanded them to build through Moses brought it. The children of Israel brought their freewill offerings to the Lord."},{"num":30,"verse":"The Artisans. Moses said to the children of Israel, “Behold, the Lord has summoned Bezalel, the son of Uri, the son of Hur, of the tribe of Judah, by name."},{"num":31,"verse":"He has filled him with the Spirit of God, with wisdom, with intelligence, with knowledge, and with ability in every type of craft,"},{"num":32,"verse":"to design artistic works in gold, silver, and bronze,"},{"num":33,"verse":"to know how to cut stones for settings and how to carve wood. He is expert in every craft."},{"num":34,"verse":"He has inspired him to teach, both him and Oholiab, the son of Ahisamach of the tribe of Dan."},{"num":35,"verse":"He has filled them with the skill needed to do the work of the engraver, the designer, and the embroiderer, to work with blue and purple and scarlet cloth and fine linen, and to weave. They can do the work of any craftsman or designer."}]