[{"header":"Sabbath Regulations"},{"num":35,"verse":"Moses assembled the whole community of the Israelites and said to them, “These are the things that the Lord has commanded you to do. "},{"num":2,"verse":"In six days work may be done, but on the seventh day there must be a holy day for you, a Sabbath of complete rest to the Lord. Anyone who does work on it will be put to death. "},{"num":3,"verse":"You must not kindle a fire in any of your homes on the Sabbath day.”"},{"header":"Willing Workers"},{"num":4,"verse":" Moses spoke to the whole community of the Israelites, “This is the word that the Lord has commanded: "},{"num":5,"verse":"‘Take an offering for the Lord. Let everyone who has a willing heart bring an offering to the Lord: gold, silver, bronze; "},{"num":6,"verse":"blue, purple, and scarlet yarn; fine linen; goats’ hair; "},{"num":7,"verse":"ram skins dyed red; fine leather; acacia wood; "},{"num":8,"verse":"olive oil for the light; spices for the anointing oil and for the fragrant incense; "},{"num":9,"verse":"onyx stones, and other gems for mounting on the ephod and the breastpiece. "},{"num":10,"verse":"Every skilled person among you is to come and make all that the Lord has commanded: "},{"num":11,"verse":"the tabernacle with its tent, its covering, its clasps, its frames, its crossbars, its posts, and its bases; "},{"num":12,"verse":"the ark, with its poles, the atonement lid, and the special curtain that conceals it; "},{"num":13,"verse":"the table with its poles and all its vessels, and the Bread of the Presence; "},{"num":14,"verse":"the lampstand for the light and its accessories, its lamps, and oil for the light; "},{"num":15,"verse":"and the altar of incense with its poles, the anointing oil, and the fragrant incense; the hanging for the door at the entrance of the tabernacle; "},{"num":16,"verse":"the altar for the burnt offering with its bronze grating that is on it, its poles, and all its utensils; the large basin and its pedestal; "},{"num":17,"verse":"the hangings of the courtyard, its posts and its bases, and the curtain for the gateway to the courtyard; "},{"num":18,"verse":"tent pegs for the tabernacle and tent pegs for the courtyard and their ropes; "},{"num":19,"verse":"the woven garments for serving in the Holy Place, the holy garments for Aaron the priest, and the garments for his sons to minister as priests.’”"},{"num":20,"verse":"So the whole community of the Israelites went out from the presence of Moses. "},{"num":21,"verse":"Everyone whose heart stirred him to action and everyone whose spirit was willing came and brought the offering for the Lord for the work of the tent of meeting, for all its service, and for the holy garments. "},{"num":22,"verse":"They came, men and women alike, all who had willing hearts. They brought brooches, earrings, rings and ornaments, all kinds of gold jewelry, and everyone came who waved a wave offering of gold to the Lord."},{"num":23,"verse":"Everyone who had blue, purple, or scarlet yarn, fine linen, goats’ hair, ram skins dyed red, or fine leather brought them. "},{"num":24,"verse":"Everyone making an offering of silver or bronze brought it as an offering to the Lord, and everyone who had acacia wood for any work of the service brought it. "},{"num":25,"verse":"Every woman who was skilled spun with her hands and brought what she had spun, blue, purple, or scarlet yarn, or fine linen, "},{"num":26,"verse":"and all the women whose heart stirred them to action and who were skilled spun goats’ hair."},{"num":27,"verse":"The leaders brought onyx stones and other gems to be mounted for the ephod and the breastpiece, "},{"num":28,"verse":"and spices and olive oil for the light, for the anointing oil, and for the fragrant incense."},{"num":29,"verse":"The Israelites brought a freewill offering to the Lord, every man and woman whose heart was willing to bring materials for all the work that the Lord through Moses had commanded them to do."},{"num":30,"verse":"Moses said to the Israelites, “See, the Lord has chosen Bezalel son of Uri, the son of Hur, of the tribe of Judah. "},{"num":31,"verse":"He has filled him with the Spirit of God—with skill, with understanding, with knowledge, and in all kinds of work—"},{"num":32,"verse":"to design artistic designs, to work in gold, in silver, and in bronze, "},{"num":33,"verse":"and in cutting stones for their setting, and in cutting wood, to do work in every artistic craft. "},{"num":34,"verse":"And he has put it in his heart to teach, he and Oholiab son of Ahisamach, of the tribe of Dan. "},{"num":35,"verse":"He has filled them with skill to do all kinds of work as craftsmen, as designers, as embroiderers in blue, purple, and scarlet yarn and in fine linen, and as weavers. They are craftsmen in all the work and artistic designers. "}]