[{"num":35,"verse":"Therefore when all the company of the sons of Israel was gathered (together), Moses said to them, These things it be, which the Lord commanded to be done."},{"num":2,"verse":"Six days ye shall do work, the seventh day shall be holy to you, the sabbath and the rest of the Lord; he that doeth work in the sabbath shall be slain. (For six days ye shall do work, but the seventh day shall be holy to you, yea, the sabbath of rest, holy to the Lord; he who doeth work on the sabbath shall be put to death.)"},{"num":3,"verse":"Ye shall not kindle fire in all your dwelling places by the sabbath day. (Ye shall not kindle a fire in any of your dwellings on the sabbath day.)"},{"num":4,"verse":"And Moses said to all the company of the sons of Israel, This is the word which the Lord commanded, and said,"},{"num":5,"verse":"Separate ye at you the first fruits to the Lord; each willful man and of ready will offer them to the Lord, gold, and silver, and brass, (Set ye aside among you the first fruits to the Lord; yea, each willing person, and of ready desire, shall offer to the Lord out of their gold, and silver, and brass,)"},{"num":6,"verse":"and jacinth, and purple, and red silk twice-dyed, and bis, and hairs of goats, (and jacinth, and purple, and red silk twice-dyed, and fine linen, and goats’ hair,)"},{"num":7,"verse":"and skins of rams made red, and (skins) of jacinth, and [the] wood of shittim, (and red rams’ skins, and blue skins, and shittim wood, or acacia wood,)"},{"num":8,"verse":"and oil to the lights to be ordained, and (spices so) that the ointment (can) be made, and (for) the incense most sweet, (and oil to nourish the light/and oil to fuel the lanterns, and spices to make the ointment, and the most sweet incense,)"},{"num":9,"verse":"stones of onyx, and gems, to the adorning of the cloak on the shoulders, and of the rational. (and onyx stones, and gems, for the adornment of the ephod, and the breast-piece.)"},{"num":10,"verse":"Whoever of you is wise, come he, and make that, that the Lord commanded,"},{"num":11,"verse":"that is, the tabernacle, and the roof thereof, and the covering; rings, and the buildings of boards, with [the] bars, stakes, and bases; (that is, the Tabernacle, its tent, and its coverings; its rings, and boards, and bars, and pegs, and bases;)"},{"num":12,"verse":"the ark, and bars; the propitiatory, and the veil, which is hanged before it; (the Ark, that is, the Box for the tablets of the Law, and its bars; the propitiatory, that is, the mercy seat, or the lid for the Box, and the Veil, which is hung in front of it;)"},{"num":13,"verse":"the board, with bars, and vessels, and with [the] loaves of setting forth; (the table, and its bars, and vessels, and the loaves of proposition, that is, the showbread;)"},{"num":14,"verse":"the candlestick to sustain [the] lights, the vessels, and lanterns thereof, and oil to the nourishing of fires; (the lamp-stand to provide the light/the lamp-stand to hold the lanterns, and its vessels, and its lanterns, and the oil for the nourishing of the light;)"},{"num":15,"verse":"the altar of incense, and the bars; the oil of anointing, and [the] incense of sweet smelling spiceries; the curtain at the door of the tabernacle; (the altar of incense, and its bars; the anointing oil, and the incense of sweet smelling spices; the curtain at the Tabernacle’s entrance;)"},{"num":16,"verse":"the altar of burnt sacrifice, and his brazen griddle, with his bars, and vessels; the great washing vessel, and his foundament; (the altar of burnt sacrifice, and its bronze griddle, and its bars, and vessels; the great washing vessel, and its foundation, or its base;)"},{"num":17,"verse":"the curtains of the large entry, with the pillars, and their bases; the curtain in the doors of the porch; (the curtains for the courtyard, and its pillars, and their bases; and the curtain for the courtyard’s entrance;)"},{"num":18,"verse":"the stakes of the tabernacle, and of the large entry, with their cords; (the pegs for the Tabernacle, and for the courtyard, and their cords;)"},{"num":19,"verse":"the clothes, whose use is in the service of the saintuary; the clothes of Aaron the bishop, and of his sons, that they be set in priesthood to me. (the clothes, for ministering in the sanctuary; yea, the clothes for Aaron the High Priest, and for his sons, when they serve as my priests.)"},{"num":20,"verse":"And all the multitude of the sons of Israel went out of the sight of Moses, (And then all the Israelites went out from Moses’ presence,)"},{"num":21,"verse":"and offered with most ready soul and devout the first things to the Lord, to make the work of the tabernacle of witnessing, whatever was needful to the adorning, and to the holy clothes. (and they offered with most ready and devout souls their first things to the Lord, for the building of the Tabernacle of the Witnessing, yea, whatever was needed for its adornment, and for the holy clothes.)"},{"num":22,"verse":"Men and women gave bands of the arms, and earrings, and other rings, and ornaments of their arms nigh the hand; each golden vessel was separated into the gifts of the Lord. (Men and women gave arm bands, and earrings, and other rings, and ornaments for their arms nigh the hand, that is, bracelets; and each gold vessel was set aside as a gift to the Lord.)"},{"num":23,"verse":"If any man had jacinth, and purple, and red silk twice-dyed, bis, and the hairs of goats, skins of rams made red, and (skins) of jacinth, either blue, (And anyone who had jacinth, and purple, and red silk twice-dyed, and fine linen, and goats’ hair, and red rams’ skins, and blue skins,)"},{"num":24,"verse":"(and) metals of silver, and of brass, they offered (it) to the Lord, and [the] wood of shittim into diverse uses. (and metals of silver, and brass, they offered it to the Lord, and also shittim wood, or acacia wood, for diverse uses.)"},{"num":25,"verse":"But also women taught gave those things, which they had spun, (of) jacinth, and purple, and vermilion, and bis, (And all the skilled women gave those things which they had spun out of jacinth, and purple, and red silk twice-dyed, and fine linen,)"},{"num":26,"verse":"and the hairs of goats (and also out of goats’ hair); and they gave all (these) things by their own free will."},{"num":27,"verse":"Forsooth (the) princes offered stones of onyx, and gems, to the cloak on the shoulders, and to the rational, (And the leaders offered onyx stones, and gems, for the ephod, and the breast-piece,)"},{"num":28,"verse":"and sweet smelling spiceries, and oil to the lights to be ordained, and to make ready the ointment, and to make the incense of the sweetest odour. (and oil to nourish the light/and oil to fuel the lanterns, and sweet smelling spices to make the ointment, and the incense of the sweetest aroma.)"},{"num":29,"verse":"All men and women offered gifts with devout soul(s), (so) that the works should be made, which the Lord commanded by the hand of Moses; all the sons of Israel hallowed willful things to the Lord (yea, all the Israelites willingly dedicated these things to the Lord)."},{"num":30,"verse":"And Moses said to the sons of Israel, Lo! the Lord hath called Bezaleel by name, the son of Uri, the son of Hur, of the lineage of Judah; (And Moses said to the Israelites, Lo! the Lord hath called by name Bezaleel, the son of Uri, the son of Hur, of the tribe of Judah;)"},{"num":31,"verse":"and the Lord hath filled him with the spirit of God, of wisdom, and of understanding, and of knowing, and with all doctrine, (and the Lord hath filled him with the spirit of God, yea, with wisdom, and understanding, and knowledge, and all doctrine,)"},{"num":32,"verse":"to find out and to make work in gold, and silver, and brass, (to know how to do work in gold, and silver, and brass,)"},{"num":33,"verse":"and in stones to be graven, and in work of carpentry; whatever thing may be found craftily, (and to engrave stones, and to do carpentry; yea, whatever thing that can be done with craftsmanship,)"},{"num":34,"verse":"the Lord hath given in his heart; and the Lord hath called Aholiab, the son of Ahisamach, of the lineage of Dan; (the Lord hath put this in his heart; and the Lord hath also called Aholiab, the son of Ahisamach, of the tribe of Dan;)"},{"num":35,"verse":"the Lord [hath] taught both with wisdom, that they make the works of a carpenter, of (a) stainer, and of (an) embroiderer, of jacinth, and of purple, and of red silk (twice-dyed), and of bis, and that they make all things, and find all new things. (the Lord hath taught both of them with wisdom, so that they know how to do the work of a carpenter, and of a stainer, and of an embroiderer with jacinth, and purple, and red silk twice-dyed, and fine linen, yea, so that they know how to make all kinds of things, and to devise all kinds of new things.)"}]