[{"header":"Jeremiah and the Covenant"},{"num":11,"verse":"The Lord said to me, "},{"num":2,"verse":"“Listen to the terms of the covenant. Tell the people of Judah and of Jerusalem "},{"num":3,"verse":"that I, the Lord God of Israel, have placed a curse on everyone who does not obey the terms of this covenant. "},{"num":4,"verse":"It is the covenant I made with their ancestors when I brought them out of Egypt, the land that was like a blazing furnace to them. I told them to obey me and to do everything that I had commanded. I told them that if they obeyed, they would be my people and I would be their God. "},{"num":5,"verse":"Then I would keep the promise I made to their ancestors that I would give them the rich and fertile land which they now have.”"},{"num":6,"verse":"Then the Lord said to me, “Go to the cities of Judah and to the streets of Jerusalem. Proclaim my message there and tell the people to listen to the terms of the covenant and to obey them. "},{"num":7,"verse":"When I brought their ancestors out of Egypt, I solemnly warned them to obey me, and I have kept on warning the people until this day. "},{"num":8,"verse":"But they did not listen or obey. Instead, everyone continued to be as stubborn and evil as ever. I had commanded them to keep the covenant, but they refused. So I brought on them all the punishments described in it.”"},{"num":9,"verse":"Then the Lord said to me, “The people of Judah and of Jerusalem are plotting against me. "},{"num":10,"verse":"They have gone back to the sins of their ancestors, who refused to do what I said; they have worshiped other gods. Both Israel and Judah have broken the covenant that I made with their ancestors. "},{"num":11,"verse":"So now I, the Lord, warn them that I am going to bring destruction on them, and they will not escape. And when they cry out to me for help, I will not listen to them. "},{"num":12,"verse":"Then the people of Judah and of Jerusalem will go to the gods to whom they offer sacrifices and will cry out to them for help. But those gods will not be able to save them when this destruction comes. "},{"num":13,"verse":"The people of Judah have as many gods as they have cities, and the inhabitants of Jerusalem have set up as many altars for sacrifices to that disgusting god Baal as there are streets in the city. "},{"num":14,"verse":"Jeremiah, don't pray to me or plead with me on behalf of these people. When they are in trouble and call to me for help, I will not listen to them.”"},{"num":15,"verse":"The Lord says, “The people I love are doing evil things. What right do they have to be in my Temple? Do they think they can prevent disaster by making promises and by offering animal sacrifices? Will they then rejoice? "},{"num":16,"verse":"I once called them a leafy olive tree, full of beautiful fruit; but now, with a roar like thunder I will set its leaves on fire and break its branches."},{"num":17,"verse":"“I, the Lord Almighty, planted Israel and Judah; but now I threaten them with disaster. They have brought this on themselves because they have done wrong; they have made me angry by offering sacrifices to Baal.”"},{"header":"A Plot against Jeremiah's Life"},{"num":18,"verse":"The Lord informed me of the plots that my enemies were making against me. "},{"num":19,"verse":"I was like a trusting lamb taken out to be killed, and I did not know that it was against me that they were planning evil things. They were saying, “Let's chop down the tree while it is still healthy; let's kill him so that no one will remember him any more.”"},{"num":20,"verse":"Then I prayed, “Almighty Lord, you are a just judge; you test people's thoughts and feelings. I have placed my cause in your hands; so let me watch you take revenge on these people.”"},{"num":21,"verse":"The people of Anathoth wanted me killed, and they told me that they would kill me if I kept on proclaiming the Lord's message. "},{"num":22,"verse":"So the Lord Almighty said, “I will punish them! Their young men will be killed in war; their children will die of starvation. "},{"num":23,"verse":"I have set a time for bringing disaster on the people of Anathoth, and when that time comes, none of them will survive.”"}]