[{"header":"The Agreement Is Broken"},{"num":11,"verse":"These are the words that the Lord spoke to Jeremiah: "},{"num":2,"verse":"“Listen to the words of this agreement and tell them to the people of Judah and those living in Jerusalem. "},{"num":3,"verse":"Tell them this is what the Lord, the God of Israel, says: ‘Cursed is the person who does not obey the words of this agreement "},{"num":4,"verse":"that I made with your ancestors when I brought them out of Egypt. Egypt was like a furnace for melting iron!’ I told them, ‘Obey me and do everything I command you. Then you will be my people, and I will be your God. "},{"num":5,"verse":"Then I will keep the promise I made to your ancestors to give them a fertile land.’ And you are living in that country today.”"},{"num":6,"verse":"The Lord said to me, “Announce this message in the towns of Judah and in the streets of Jerusalem: ‘Listen to the words of this agreement and obey them. "},{"num":7,"verse":"I warned your ancestors to obey me when I brought them out of Egypt. I have warned them again and again to this very day: “Obey me!” "},{"num":8,"verse":"But your ancestors did not listen to me. They were stubborn and did what their own evil hearts wanted. So I made all the curses of this agreement come upon them. I commanded them to obey the agreement, but they did not.’”"},{"num":9,"verse":"Then the Lord said to me, “I know the people of Judah and those living in Jerusalem have made secret plans. "},{"num":10,"verse":"They have gone back to the same sins their ancestors did. Their ancestors refused to listen to my message and followed and worshiped other gods instead. The families of Israel and Judah have broken the agreement I made with their ancestors. "},{"num":11,"verse":"So this is what the Lord says: ‘I will soon bring a disaster on the people of Judah which they will not be able to escape. They will cry to me for help, but I will not listen to them. "},{"num":12,"verse":"The people living in the towns of Judah and the city of Jerusalem will pray to their idols to whom they burn incense. But those idols will not be able to help when disaster comes. "},{"num":13,"verse":"Look, people of Judah, you have as many idols as there are towns in Judah. You have built as many altars to burn incense to that shameful god Baal as there are streets in Jerusalem.’"},{"num":14,"verse":"“As for you, Jeremiah, don’t pray for these people or cry out for them or ask anything for them. I will not listen when they call to me in the time of their trouble."},{"num":17,"verse":"The Lord All-Powerful, who planted you, has announced that disaster will come to you. This is because the families of Israel and Judah have done evil and have made him angry by burning incense to Baal."},{"header":"Evil Plans Against Jeremiah"},{"num":18,"verse":"The Lord showed me that people were making plans against me. Because he showed me what they were doing, I knew they were against me. "},{"num":19,"verse":"Before this, I was like a gentle lamb waiting to be butchered. I did not know they had made plans against me, saying:"},{"num":21,"verse":"So the Lord speaks about the people from Anathoth who plan to kill Jeremiah and say, “Don’t prophesy in the name of the Lord, or we will kill you!” "},{"num":22,"verse":"So this is what the Lord All-Powerful says: “I will soon punish the men from Anathoth. Their young men will die in war. Their sons and daughters will die from hunger. "},{"num":23,"verse":"No one from the city of Anathoth will be left alive, because I will cause a disaster to happen to them that year.”"}]