[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But ye shall not sound an alarm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A clear and intelligible distinction was to be made between the summons to the princes, or to the congregation, to assemble at the entrance of the Tent of Meeting and the signal for the moving of the camps. So the gospel trumpet must at no time give an uncertain sound (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but must be used faithfully and diligently by the spiritual watchmen, whether it be to warn the ungodly, to arouse the careless, or to speak to the hearts of God’s people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-10 Here are directions concerning the public notices to be given the people by sound of trumpet. Their laws in every case were to be Divine, therefore, even in this matter Moses is directed. These trumpets typify the preached gospel. It sounds an alarm to sinners, calls them to repent, proclaims liberty to the captives and slaves of Satan, and collects the worshippers of God. It directs and encourages their heavenly journey; stirs them up to combat against the world and sin, encouraging them with the assurance of victory. It leads their attention to the sacrifice of Christ, and shows the Lord's presence for their protection. It is also necessary that the gospel trumpet give a distinct sound, according to the persons addressed, or the end proposed; whether to convince, humble, console, exhort, reprove, or teach. The sounding of the trumpet of the gospel is God's ordinance, and demands the attention of all to whom it is sent.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blow an alarm - i. e. along continuous peal. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ye shall blow, but not sound an alarm: i. e. blow in short, sharp notes, not in a continuous peal. A third and a fourth alarm were probably blown as signals. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-7. when they shall blow with them—There seem to have been signals made by a difference in the loudness and variety in the notes, suited for different occasions, and which the Israelites learned to distinguish. A simple uniform sound by both trumpets summoned a general assembly of the people; the blast of a single trumpet convoked the princes to consult on public affairs; notes of some other kind were made to sound an alarm, whether for journeying or for war. One alarm was the recognized signal for the eastern division of the camp (the tribes of Judah, Issachar, and Zebulun) to march; two alarms gave the signal for the southern to move; and, though it is not in our present Hebrew text, the Septuagint has, that on three alarms being sounded, those on the west; while on four blasts, those on the north decamped. Thus the greatest order and discipline were established in the Israelitish camp—no military march could be better regulated.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But when the congregation is to be gathered together,.... At the door of the tabernacle of the congregation, and not to move in separate camps or bodies one after another: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "you shall blow, but you shall not sound an alarm; blow with an even and uninterrupted sound, and not with a broken and quavering one; by which the congregation and camps were distinguished from one another, the same certain sound being given to each constantly, whereby they knew which were called to motion: see 1 Corinthians 14:8; according to Ben Gersom blowing was a voice drawn out, and joined or continued; an alarm, a voice not joined, but broken. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "you shall blow, but you shall not sound an alarm; blow with an even and uninterrupted sound, and not with a broken and quavering one; by which the congregation and camps were distinguished from one another, the same certain sound being given to each constantly, whereby they knew which were called to motion: see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; according to Ben Gersom blowing was a voice drawn out, and joined or continued; an alarm, a voice not joined, but broken. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But when the congregation is to be gathered together, ye shall blow, but ye shall not sound an alarm.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But to call the congregation together they were to blow, not to sound an alarm. תּקע signifies blowing in short, sharp tones. הריע  equals  תּרוּעה תּקע, blowing in a continued peal. ",
        "children": []
      }
    ]
  }
]