[{"num":43,"verse":"1 The Lord comforteth his people.  He promiseth deliverance to the Jews. 11 There is no God but one alone."},{"num":1,"verse":"But now thus saith the Lord, that created thee, O Jacob: and he that formed thee, O Israel, Fear not: for I have redeemed thee: I have called thee by thy name, thou art mine."},{"num":2,"verse":"When thou passest through the waters, I will be with thee, and through the floods, that they do not overflow thee. When thou walkest through the very fire, thou shalt not be burnt, neither shall the flame kindle upon thee."},{"num":3,"verse":"For I am the Lord thy God, the holy one of Israel, thy Savior: I gave Egypt for thy ransom, Ethiopia, and Seba for thee."},{"num":4,"verse":"Because thou wast precious in my sight, and thou wast honorable, and I loved thee, therefore will I give man for thee, and people for thy sake."},{"num":5,"verse":"Fear not, for I am with thee: I will bring thy seed from the East, and gather thee from the West."},{"num":6,"verse":"I will say to the North, Give: and to the South, Keep not back: bring my sons from far, and my daughters from the ends of the earth."},{"num":7,"verse":"Everyone shall be called by my Name: for I created him for my glory, formed him and made him."},{"num":8,"verse":"I will bring forth the blind people, and they shall have eyes, and the deaf, and they shall have ears."},{"num":9,"verse":"Let all the nations be gathered together, and let the people be assembled: who among them can declare this, and show us former things? let them bring forth their witnesses, that they may be justified: but let them hear, and say, It is truth."},{"num":10,"verse":"You are my witnesses, saith the Lord, and my servant, whom I have chosen: therefore ye shall know and believe me, and ye shall understand that I am: before me there was no God formed, neither shall there be after me."},{"num":11,"verse":"I, even I am the Lord, and beside me there is no Savior."},{"num":12,"verse":"I have declared, and I have saved, and I have showed, when there was no strange god among you: therefore you are my witnesses, saith the Lord, that I am God."},{"num":13,"verse":"Yea, before the day was, I am, and there is none that can deliver out of mine hand: I will do it, and who shall let it?"},{"num":14,"verse":"Thus saith the Lord your redeemer, the holy one of Israel, For your sake I have sent to Babel, and brought it down: they are all fugitives, and the Chaldeans cry in the ships."},{"num":15,"verse":"I am the Lord your holy one, the creator of Israel, your King."},{"num":16,"verse":"Thus saith the Lord which maketh a way in the Sea, and a path in the mighty waters."},{"num":17,"verse":"When he bringeth out the chariot and horse, the army and the power lie together, and shall not rise, they are extinct, and quenched as tow."},{"num":18,"verse":"Remember ye not the former things, neither regard the things of old."},{"num":19,"verse":"Behold, I do a new thing: now shall it come forth: shall you not know it? I will even make a way in the desert, and floods in the wilderness."},{"num":20,"verse":"The wild beasts shall honor me, the dragons and the ostriches, because I gave water in the desert, and floods in the wilderness to give drink to my people, even to mine elect."},{"num":21,"verse":"This people have I formed for myself: they shall show forth my praise."},{"num":22,"verse":"And thou hast not called upon me, O Jacob, but thou hast wearied me, O Israel."},{"num":23,"verse":"Thou hast not brought me the sheep of thy burnt offerings, neither hast thou honored me with thy sacrifices. I have not caused thee to serve with an offering, nor wearied thee with incense."},{"num":24,"verse":"Thou broughtest me no sweet savor with money, neither hast thou made me drunk with the fat of thy sacrifices, but thou hast made me to serve with thy sins, and wearied me with thine iniquities."},{"num":25,"verse":"I, even I am he that putteth away thine iniquities for mine own sake, and will not remember thy sins."},{"num":26,"verse":"Put me in remembrance: let us be judged together: count thou that thou mayest be justified."},{"num":27,"verse":"Thy first father hath sinned, and thy teachers have transgressed against me."},{"num":28,"verse":"Therefore I have profaned the rulers of the Sanctuary, and have made Jacob a curse, and Israel a reproach."}]