[{"num":1,"verse":"¶The song of songs, which is of Solomon."},{"num":2,"verse":"¶ Oh! if he would kiss me with the kisses of his mouth! for thy love is better than wine."},{"num":3,"verse":"Because of the savour of thy good ointments (ointment poured forth is thy name), therefore have the virgins loved thee."},{"num":4,"verse":"Draw me after thee, we will run. The king has brought me into his chambers; we will be glad and rejoice in thee; we will remember thy love more than the wine; the upright love thee."},{"num":5,"verse":"I am dark, O ye daughters of Jerusalem, more desirable as the booths of Kedar, as the tents of Solomon."},{"num":6,"verse":"Do not look upon me because I am dark because the sun has looked upon me; my mother’s sons were angry with me; they made me the keeper of the vineyards, but I have not kept my own vineyard."},{"num":7,"verse":"¶ Tell me, O thou whom my soul loves, where thou dost feed, where thou dost make thy flock to rest at noon; for why did I have to be as a wanderer after the flocks of thy companions?"},{"num":8,"verse":"If thou know not, O thou fairest among women, go forth, following the footprints of the flock and feed thy little female goats beside the booths of the shepherds."},{"num":9,"verse":"I have compared thee, O my love, to a mare of the chariots of Pharaoh."},{"num":10,"verse":"Thy cheeks are beautiful between the earrings, thy neck between the necklaces."},{"num":11,"verse":"We will make thee earrings of gold with studs of silver."},{"num":12,"verse":"¶ While the king was on his couch, my spikenard gave forth its fragrance."},{"num":13,"verse":"A bundle of myrrh is my wellbeloved unto me that rests between my breasts."},{"num":14,"verse":"My beloved is unto me as a cluster of camphire {Heb. ransom} in the vineyards of Engedi."},{"num":15,"verse":"Behold, thou art fair, my love; behold, thou art fair; thou hast doves’ eyes."},{"num":16,"verse":"Behold, thou art fair, O my beloved, and pleasant; also our bed has flowers."},{"num":17,"verse":"The beams of our house are cedar, and our rafters of fir."}]