[{"header":"Dangers of Debt"},{"num":6,"verse":"My son, don’t make yourself responsible for the debts of others. Don’t make such deals with friends or strangers."},{"num":2,"verse":"If you do, your words will trap you."},{"num":3,"verse":"You will be under the power of other people, so you must go and free yourself. Beg them to free you from that debt."},{"num":4,"verse":"Don’t wait to rest or sleep."},{"num":5,"verse":"Escape from that trap like a deer running from a hunter. Free yourself like a bird flying from a trap."},{"header":"The Dangers of Being Lazy"},{"num":6,"verse":"You lazy people, you should watch what the ants do and learn from them."},{"num":7,"verse":"Ants have no ruler, no boss, and no leader."},{"num":8,"verse":"But in the summer, ants gather all of their food and save it. So when winter comes, there is plenty to eat."},{"num":9,"verse":"You lazy people, how long are you going to lie there? When will you get up?"},{"num":10,"verse":"You say, “I need a rest. I think I’ll take a short nap.”"},{"num":11,"verse":"But then you sleep and sleep and become poorer and poorer. Soon you will have nothing. It will be as if a thief came and stole everything you owned."},{"header":"Troublemakers"},{"num":12,"verse":"Some people are just troublemakers. They are always thinking up some crooked plan and telling lies."},{"num":13,"verse":"They use secret signals to cheat people; they wink their eyes, shuffle their feet, and point a finger."},{"num":14,"verse":"They are always planning to do something bad."},{"num":15,"verse":"But they will be punished. Disaster will strike, and they will be destroyed. There will be no one to help them."},{"header":"What the Lord Hates"},{"header":"Warning Against Adultery"},{"num":20,"verse":"My son, remember your father’s command, and don’t forget your mother’s teaching."},{"num":21,"verse":"Remember their words always. Tie them around your neck and keep them over your heart."},{"num":22,"verse":"Let this teaching lead you wherever you go. It will watch over you while you sleep. And when you wake up, it will give you good advice."},{"num":23,"verse":"Your parents give you commands and teachings that are like lights to show you the right way. This teaching corrects you and trains you to follow the path to life."},{"num":24,"verse":"It stops you from going to an evil woman, and it protects you from the smooth talk of another man’s wife."},{"num":25,"verse":"Such a woman might be beautiful, but don’t let that beauty tempt you. Don’t let her eyes capture you."},{"num":26,"verse":"A prostitute might cost a loaf of bread, but the wife of another man could cost you your life."},{"num":27,"verse":"If you drop a hot coal in your lap, your clothes will be burned."},{"num":28,"verse":"If you step on one, your feet will be burned."},{"num":29,"verse":"If you sleep with another man’s wife, you will be punished."},{"num":30,"verse":"A hungry man might steal to fill his stomach. If he is caught, he must pay seven times more than he stole. It might cost him everything he owns, but other people understand. They don’t lose all their respect for him."},{"num":32,"verse":"But a man who commits adultery is a fool. He brings about his own destruction."},{"num":33,"verse":"He will suffer disease and disgrace and never be free from the shame."},{"num":34,"verse":"The woman’s husband will be jealous and angry and do everything he can to get revenge."},{"num":35,"verse":"No payment—no amount of money—will stop him."}]