[{"num":6,"verse":"Son, if you endorse a note for someone you hardly know, guaranteeing his debt, you are in serious trouble. "},{"num":2,"verse":"You may have trapped yourself by your agreement. "},{"num":3,"verse":"Quick! Get out of it if you possibly can! Swallow your pride; don’t let embarrassment stand in the way. Go and beg to have your name erased. "},{"num":4,"verse":"Don’t put it off. Do it now. Don’t rest until you do. "},{"num":5,"verse":"If you can get out of this trap you have saved yourself like a deer that escapes from a hunter or a bird from the net."},{"num":6,"verse":"Take a lesson from the ants, you lazy fellow. Learn from their ways and be wise! "},{"num":7,"verse":"For though they have no king to make them work, "},{"num":8,"verse":"yet they labor hard all summer, gathering food for the winter. "},{"num":9,"verse":"But you—all you do is sleep. When will you wake up? "},{"num":10,"verse":"“Let me sleep a little longer!” Sure, just a little more! "},{"num":11,"verse":"And as you sleep, poverty creeps upon you like a robber and destroys you; want attacks you in full armor."},{"num":12,"verse":"Let me describe for you a worthless and a wicked man; first, he is a constant liar; he signals his true intentions to his friends with eyes and feet and fingers. "},{"num":14,"verse":"He is always thinking up new schemes to swindle people. He stirs up trouble everywhere. "},{"num":15,"verse":"But he will be destroyed suddenly, broken beyond hope of healing."},{"num":16,"verse":"For there are six things the Lord hates—no, seven: haughtiness, lying, murdering, plotting evil, eagerness to do wrong, a false witness, sowing discord among brothers."},{"num":20,"verse":"Young man, obey your father and your mother. "},{"num":21,"verse":"Take to heart all of their advice; keep in mind everything they tell you. "},{"num":22,"verse":"Every day and all night long their counsel will lead you and save you from harm; when you wake up in the morning, let their instructions guide you into the new day. "},{"num":23,"verse":"For their advice is a beam of light directed into the dark corners of your mind to warn you of danger and to give you a good life. "},{"num":24,"verse":"Their counsel will keep you far away from prostitutes, with all their flatteries, and unfaithful wives of other men."},{"num":25,"verse":"Don’t lust for their beauty. Don’t let their coyness seduce you. "},{"num":26,"verse":"For a prostitute will bring a man to poverty, and an adulteress may cost him his very life. "},{"num":27,"verse":"Can a man hold fire against his chest and not be burned? "},{"num":28,"verse":"Can he walk on hot coals and not blister his feet? "},{"num":29,"verse":"So it is with the man who commits adultery with another’s wife. He shall not go unpunished for this sin. "},{"num":30,"verse":"Excuses might even be found for a thief if he steals when he is starving! "},{"num":31,"verse":"But even so, he is fined seven times as much as he stole, though it may mean selling everything in his house to pay it back."},{"num":32,"verse":"But the man who commits adultery is an utter fool, for he destroys his own soul. "},{"num":33,"verse":"Wounds and constant disgrace are his lot, "},{"num":34,"verse":"for the woman’s husband will be furious in his jealousy, and he will have no mercy on you in his day of vengeance. "},{"num":35,"verse":"You won’t be able to buy him off no matter what you offer."}]