[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-8 Christ, the Lamb, opens the first seal: observe what appeared. A rider on a white horse. By the going forth of this white horse, a time of peace, or the early progress of the Christian religion, seems to be intended; its going forth in purity, at the time when its heavenly Founder sent his apostles to teach all nations, adding, Lo! I am with you alway, even to the end of the world. The Divine religion goes out crowned, having the Divine favour resting upon it, armed spiritually against its foes, and destined to be victorious in the end. On opening the second seal, a red horse appeared; this signifies desolating judgments. The sword of war and persecution is a dreadful judgment; it takes away peace from the earth, one of the greatest blessings; and men who should love one another, and help one another, are set upon killing one another. Such scenes also followed the pure age of early Christianity, when, neglectful of charity and the bond of peace, the Christian leaders, divided among themselves, appealed to the sword, and entangled themselves in guilt. On opening the third seal, a black horse appeared; a colour denoting mourning and woe, darkness and ignorance. He that sat on it had a yoke in his hand. Attempts were made to put a yoke of superstitious observances on the disciples. As the stream of Christianity flowed further from its pure fountain, it became more and more corrupt. During the progress of this black horse, the necessaries of life should be at excessive prices, and the more costly things should not be hurt. According to prophetic language, these articles signified that food of religious knowledge, by which the souls of men are sustained unto everlasting life; such we are invited to buy, Isa 55:1. But when the dark clouds of ignorance and superstition, denoted by the black horse, spread over the Christian world, the knowledge and practice of true religion became scarce. When a people loathe their spiritual food, God may justly deprive them of their daily bread. The famine of bread is a terrible judgment; but the famine of the word is more so. Upon opening the fourth seal, another horse appeared, of a pale colour. The rider was Death, the king of terrors. The attendants, or followers of this king of terrors, hell, a state of eternal misery to all who die in their sins; and in times of general destruction, multitudes go down unprepared into the pit. The period of the fourth seal is one of great slaughter and devastation, destroying whatever may tend to make life happy, making ravages on the spiritual lives of men. Thus the mystery of iniquity was completed, and its power extended both over the lives and consciences of men. The exact times of these four seals cannot be ascertained, for the changes were gradual. God gave them power, that is, those instruments of his anger, or those judgments: all public calamities are at his command; they only go forth when God sends them, and no further than he permits.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had opened the third seal - Unfolding another portion of the volume. See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I heard the third beast say, Come and see - See the notes on Revelation 4:7. It is not apparent why the third beast is represented as taking a particular interest in the opening of this seal (compare the notes on Revelation 6:3), nor is it necessary to show why it was so. The general design seems to have been, to represent each one of the four living creatures as interested in the opening of the seals, but the order in which they did this does not seem to be a matter of importance.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I heard the third beast say, Come and see - See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is not apparent why the third beast is represented as taking a particular interest in the opening of this seal (compare the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), nor is it necessary to show why it was so. The general design seems to have been, to represent each one of the four living creatures as interested in the opening of the seals, but the order in which they did this does not seem to be a matter of importance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And I beheld, and lo, a black horse - The specifications of the symbol here are the following:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) As before, the horse. See the notes on Revelation 6:2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) As before, the horse. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The color of the horse: \"lo, a black horse.\" This would properly denote distress and calamity - for black has been regarded always as such a symbol. So Virgil speaks of fear as black: \"atrumque timorem\" (Aen. ix. 619). So again, Georg. iv. 468:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Caligantem nigra formidine lucum.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So, as applied to the dying Acca, Aeneas xi. 825:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Tenebris nigrescunt omnia circum.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Black, in the Scriptures, is the image of fear, of famine, of death. Lamentations 5:10; \"our skin was black like an oven, because of the terrible famine.\" Jeremiah 14:2; \"because of the drought Judah mourneth, and the gates thereof languish; they are in deep mourning (literally, black) for the land.\" Joel 2:6; \"all faces shall gather blackness.\" Nahum 2:10; \"the knees smite together, and there is great pain in all loins, and the faces of them all gather blackness.\" Compare Revelation 6:12; Ezekiel 32:7. See also Bochart, Hieroz. P. i. lib. ii. c. vii. pp. 106, 107. From the color of the horse here introduced we should naturally look for some dire calamity, though the nature of the calamity would not be designated by the mere use of the word \"black.\" What the calamity was to be must be determined by what follows in the symbol. Famine, pestiilence, oppression, heavy taxation, tyranny, invasion - any of these might be denoted by the color of the horse.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Black, in the Scriptures, is the image of fear, of famine, of death. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"our skin was black like an oven, because of the terrible famine.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"because of the drought Judah mourneth, and the gates thereof languish; they are in deep mourning (literally, black) for the land.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"all faces shall gather blackness.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"the knees smite together, and there is great pain in all loins, and the faces of them all gather blackness.\" Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 32:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also Bochart, Hieroz. P. i. lib. ii. c. vii. pp. 106, 107. From the color of the horse here introduced we should naturally look for some dire calamity, though the nature of the calamity would not be designated by the mere use of the word \"black.\" What the calamity was to be must be determined by what follows in the symbol. Famine, pestiilence, oppression, heavy taxation, tyranny, invasion - any of these might be denoted by the color of the horse.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The balances: \"and he that sat on him had a pair of balances in his hand.\" The original word rendered here as \"a pair of balances,\" is ζυγὸν  zugon. This word properly means a yoke, serving to couple anything together, as a yoke for cattle. Hence it is used to denote the beam of a balance, or of a pair of scales - and is evidently so used here. The idea is, that something was to be weighed, in order to ascertain either its quantity or its value. Scales or balances are the emblems of justice or equity (compare Job 31:6; Psalm 62:9; Proverbs 11:1; Proverbs 16:11); and when joined with symbols that denote the sale of grain and fruit by weight, become the symbol of scarcity. Thus, \"bread by weight\" Leviticus 26:26 denotes scarcity. So in Ezekiel 4:16, \"And they shall eat bread by weight.\" The use of balances here as a symbol would signify that something was to be accurately and carefully weighed out.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) The balances: \"and he that sat on him had a pair of balances in his hand.\" The original word rendered here as \"a pair of balances,\" is ζυγὸν  zugon. This word properly means a yoke, serving to couple anything together, as a yoke for cattle. Hence it is used to denote the beam of a balance, or of a pair of scales - and is evidently so used here. The idea is, that something was to be weighed, in order to ascertain either its quantity or its value. Scales or balances are the emblems of justice or equity (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and when joined with symbols that denote the sale of grain and fruit by weight, become the symbol of scarcity. Thus, \"bread by weight\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " denotes scarcity. So in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"And they shall eat bread by weight.\" The use of balances here as a symbol would signify that something was to be accurately and carefully weighed out.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The connection leads us to suppose that this would pertain to the necessaries of life, and that it would occur either in consequence of scarcity, or because there would be an accurate or severe exaction, as in collecting a revenue on these articles. The balance was commonly the symbol of equity and justice; but it was also, sometimes, the symbol of exaction and oppression, as in Hosea 12:7; \"The balance of deceit is in his hands; he loveth to oppress.\" If the balances stood alone, and there were no proclamation as to what was to occur, we should look, under this seal, to a time of the exact administration of justice, as scales or balances are now used as emblems of the rigid application of the laws and of the principles of justice in courts, or in public affairs. If this representation stood alone, or if the black horse and the scales constituted the whole of the symbol, we should look for some severe administration, or perhaps some heavy calamity under a rigorous administration of laws. The reference, however, to the \"wheat and barley,\" and to the price for which they were to be weighed out, serves still further to limit and define the meaning of the symbol as having reference to the necessaries of life - to the productions of the land - to the actual capital of the country. Whether this refers to scarcity, or to taxation, or both, must be determined by the other parts of the symbol.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The connection leads us to suppose that this would pertain to the necessaries of life, and that it would occur either in consequence of scarcity, or because there would be an accurate or severe exaction, as in collecting a revenue on these articles. The balance was commonly the symbol of equity and justice; but it was also, sometimes, the symbol of exaction and oppression, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"The balance of deceit is in his hands; he loveth to oppress.\" If the balances stood alone, and there were no proclamation as to what was to occur, we should look, under this seal, to a time of the exact administration of justice, as scales or balances are now used as emblems of the rigid application of the laws and of the principles of justice in courts, or in public affairs. If this representation stood alone, or if the black horse and the scales constituted the whole of the symbol, we should look for some severe administration, or perhaps some heavy calamity under a rigorous administration of laws. The reference, however, to the \"wheat and barley,\" and to the price for which they were to be weighed out, serves still further to limit and define the meaning of the symbol as having reference to the necessaries of life - to the productions of the land - to the actual capital of the country. Whether this refers to scarcity, or to taxation, or both, must be determined by the other parts of the symbol.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) The proclamation: And I heard a voice in the midst of the four beasts say. That is, from the throne, Revelation 4:6. The voice was not that of one of the four beasts, but it seemed to come from among them. As the rider went forth, this was the proclamation that was made in regard to him; or this is what is symbolized in his going forth, to wit, that there would be such a state of things that a measure of wheat would be sold for a penny, etc. The proclamation consists essentially of two things - what refers to the price or value of wheat and barley, and what requires that care shall be taken not to injure the oil and the wine. Each of these demands explanation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) The proclamation: And I heard a voice in the midst of the four beasts say. That is, from the throne, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The voice was not that of one of the four beasts, but it seemed to come from among them. As the rider went forth, this was the proclamation that was made in regard to him; or this is what is symbolized in his going forth, to wit, that there would be such a state of things that a measure of wheat would be sold for a penny, etc. The proclamation consists essentially of two things - what refers to the price or value of wheat and barley, and what requires that care shall be taken not to injure the oil and the wine. Each of these demands explanation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A measure of wheat for a penny - See the margin. The word rendered \"measure\" - χοῖνιξ  choinix - denotes an Attic measure for grain and things dry, equal to the 48th part of the Attic medimnus, or the 8th part of the Roman modius, and consequently was nearly equivalent to one quart English (Robinson's Lexicon). The word rendered \"penny,\" δηναρίον  dēnarion - Latin, denarius - was of the same value as the Greek δραχμή  drachmē, and was equivalent to about fourteen cents or seven-pence (circa mid-19th century). This was the usual price of a day's labor, Matthew 20:2, Matthew 20:9. The choenix, or measure of grain here referred to, was the ordinary daily allowance for one man (Odyssey xix. 27, 28). See Stuart, in loco. The common price of the Attic medimnus of wheat was five or six denarii; but here, as that contained 48 choenixes or quarts, the price would be augmented to 48 denarii - or it would be about eight times as dear as ordinary; that is, there would be a scarcity or famine. The price of a bushel of wheat at this rate would be about four dollars and a half or 18 shillings - a price which would indicate great scarcity, and which would give rise to much distress.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A measure of wheat for a penny - See the margin. The word rendered \"measure\" - χοῖνιξ  choinix - denotes an Attic measure for grain and things dry, equal to the 48th part of the Attic medimnus, or the 8th part of the Roman modius, and consequently was nearly equivalent to one quart English (Robinson's Lexicon). The word rendered \"penny,\" δηναρίον  dēnarion - Latin, denarius - was of the same value as the Greek δραχμή  drachmē, and was equivalent to about fourteen cents or seven-pence (circa mid-19th century). This was the usual price of a day's labor, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The choenix, or measure of grain here referred to, was the ordinary daily allowance for one man (Odyssey xix. 27, 28). See Stuart, in loco. The common price of the Attic medimnus of wheat was five or six denarii; but here, as that contained 48 choenixes or quarts, the price would be augmented to 48 denarii - or it would be about eight times as dear as ordinary; that is, there would be a scarcity or famine. The price of a bushel of wheat at this rate would be about four dollars and a half or 18 shillings - a price which would indicate great scarcity, and which would give rise to much distress.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And three measures of barley for a penny - It would seem from this that barley usually bore about one-third the price of wheat. It was a less valuable grain, and perhaps was produced in greater abundance. This is not far from the proportion which the price of this grain usually bears to that of wheat, and here, as in the case of the wheat, the thing which would be indicated would be scarcity. This proclamation of \"a measure of wheat for a penny\" was heard either as addressed to the horseman, as a rule of action for him, or as addressed by the horseman as he went forth. If the former is the meaning, it would be an appropriate address to one who was going forth to collect tribute - with reference to the exact manner in which this tribute was to be collected, implying some sort of severity of exaction; or to one who should distribute wheat and barley out of the public granaries at an advanced price, indicating scarcity. Thus, it would mean that a severe and heavy tax - represented by the scales and the scarcity - or a tax so severe as to make grain dear, was referred to. If the latter is the meaning, then the idea is that there would be a scarcity, and that grain would be dealt out by the government at a high and oppressive price. The latter idea would be as consonant with the symbol of the scales and the price mentioned as the other, if it were not for the additional injunction not to \"hurt the oil and the wine\" - which cannot be well applied to the idea of dealing out grain at a high price. It can, however, be connected, by a fair interpretation of that passage, with such a severity of taxation that there would be a propriety in such a command - for, as we shall see, under the explanation of that phrase, such a law was actually promulgated as resulting from severity of taxation. The idea, then, in the passage before us, would seem to be:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. a voice—Two oldest manuscripts, A, C, read, \"as it were a voice.\" B reads as English Version. The voice is heard \"in the midst of the four living creatures\" (as Jehovah in the Shekinah-cloud manifested His presence between the cherubim); because it is only for the sake of, and in connection with, His redeemed, that God mitigates His judgments on the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A measure—\"A chœnix.\" While making food scarce, do not make it so much so that a chœnix (about a day's provision of wheat, variously estimated at two or three pints) shall not be obtainable \"for a penny\" (denarius, eight and a half pence of our money, probably the day's wages of a laborer). Famine generally follows the sword. Ordinarily, from sixteen to twenty measures were given for a denarius. The sword, famine, noisome beasts, and the pestilence, are God's four judgments on the earth. A spiritual famine, too, may be included in the judgment. The \"Come,\" in the case of this third seal, is said by the third of the four living creatures, whose likeness is a man indicative of sympathy and human compassion for the sufferers. God in it tempers judgment with mercy. Compare Mt 24:7, which indicates the very calamities foretold in these seals, nation rising against nation (the sword), famines, pestilences (Re 6:8), and earthquakes (Re 6:12).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "three measures of barley for a penny—the cheaper and less nutritious grain, bought by the laborer who could not buy enough wheat for his family with his day's wages, a denarius, and, therefore, buys barley.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "see thou hurt not the oil, and the wine—the luxuries of life, rather than necessaries; the oil and wine were to be spared for the refreshment of the sufferers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A measure of wheat for a penny, and three measures of barley for a penny:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " interpreters are at so great a loss here to fix the sense, that some think this phrase signifies famine and scarcity; others think it signifies great plenty. The Greek word here used, signifieth, say some, half a bushel; others say it signifieth so much bread corn as is sufficient for four loaves; others say, something more than a quart; others, so much as was allowed servants for maintenance for a day: let it be which it will, it signifies no great scarcity; for the word signifying ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a penny, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signified but as much in our money as came to seven pence halfpenny. I think therefore Mr. Mede judgeth well, that by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "black horse",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was signified not a time of famine and scarcity, but of plenty; and the rather, because it is added, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hurt not the oil and the wine:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "balances",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the rider’s hands signified not scales to give men their bread by weight, (as in a time of scarcity), but the balance of justice; nor will the colour of the horse conclude the contrary. The whole therefore of this prophecy seemeth to foretell that this period, from the time of Commodus the Roman emperor, who ruled the empire from the year 180 to 197, and was followed by Severus, Macrinus, Caracalla, Hellogabalus, and Alexander Severus, the son of Mammeas, who came to the empire Anno 222, and reigned to 237, should be a time of great plenty and civil justice. Histories tell us of no famine in that time, but large stories of the great care of two of those emperors especially, for supplying their countries with corn, and for the administering of civil justice. The things foretold by the opening of this seal, our famous Mede makes to have had their accomplishment with the determination of the reign of Alexander Severus. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I heard a voice in the midst of the four beasts say,.... Not the voice of Agabus to the Apostle Paul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 11:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but rather of Christ, who was in the midst of them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the Ethiopic version adds, \"as the voice of an eagle\": ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a measure of wheat for a penny, and three measures of barley for a penny; \"Choenix\", the measure here used, signifies as much as was sufficient for a man for one day, as a penny was the usual hire of a labourer for a day, Matthew 20:2; so a choenix of corn was allowed to each man in Xerxes's army for a day, according to Herodotus (d); the same quantity for a day was given by the Romans to their shepherds and servants, and is generally said to be about two pounds; according to Agricola it was two pounds and a quarter (e). This measure was very different; the Attic choenix was a measure that held three pounds, the Italic choenix four pounds, and the military choenix five pounds, and answers to the Hebrew Kab (f); and in the Septuagint version of Ezekiel 45:10; it answers to the Bath; and some make it to be the fourth part of a bushel, and others half a bushel (g); the first account of its being about two pounds, and the allowance of a man for a day, seems best to agree with this place: so that this phrase expresses such a scarcity, as that a man's daily wages would be but just enough to buy himself bread, without any thing to eat with it; and when he would have nothing left for clothes, and other things, nor anything for his wife and children: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "a measure of wheat for a penny, and three measures of barley for a penny; \"Choenix\", the measure here used, signifies as much as was sufficient for a man for one day, as a penny was the usual hire of a labourer for a day, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so a choenix of corn was allowed to each man in Xerxes's army for a day, according to Herodotus (d); the same quantity for a day was given by the Romans to their shepherds and servants, and is generally said to be about two pounds; according to Agricola it was two pounds and a quarter (e). This measure was very different; the Attic choenix was a measure that held three pounds, the Italic choenix four pounds, and the military choenix five pounds, and answers to the Hebrew Kab (f); and in the Septuagint version of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it answers to the Bath; and some make it to be the fourth part of a bushel, and others half a bushel (g); the first account of its being about two pounds, and the allowance of a man for a day, seems best to agree with this place: so that this phrase expresses such a scarcity, as that a man's daily wages would be but just enough to buy himself bread, without any thing to eat with it; and when he would have nothing left for clothes, and other things, nor anything for his wife and children: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and see that thou hurt not the oil and wine; signifying that this scarcity should fall not upon the superfluities, such as oil and wine, which may be spared, and men can live without; but upon the necessities of life, particularly bread: some render the words, \"and be not unjust in the oil and wine\"; and so think they refer to the laws of the Roman emperors, in relation to wine and oil, and to the just execution of them, that there might be plenty of them; and others understand them in an allegorical sense, of the principal doctrines of the Gospel, comparable to oil and wine, and which Christ takes care of, that they shall not be hurt and destroyed by heretics and false teachers, even when they prevail the most, and bring on a famine of the word, and when the church is blackened and darkened with them; and indeed these may much better be applied to the Gospel, than, as they are by the Jews, to the law; who frequently say (h) that the law is called \"oil\", and speak of  , \"the wine of the law\" (i): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Polymnia, c. 187. (e) De Mensuris Graecis, p. 120. (f) Waserus de Mensuris, l. 2. c. 2. sect. 5, 6. & c. 3. sect. 6. & c. 7. sect. 6. (g) Alex. ab Alex. Genial. Dier. l. 2. c. 20. (h) Tzeror Hammor, fol. 85. 3. & 96. 1. & 97. 4. & 104. 1. & 105. 2. & 137. 2, 3.((i) Zohar in Exod. fol. 51. 3. & in Deut. fol. 115. 3. Raya Mehimna in Zohar in Numb. fol. 94. 3. Shirhashirim Rabba, fol. 5. 3. Midrash Kohelet, fol. 64. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Polymnia, c. 187. (e) De Mensuris Graecis, p. 120. (f) Waserus de Mensuris, l. 2. c. 2. sect. 5, 6. & c. 3. sect. 6. & c. 7. sect. 6. (g) Alex. ab Alex. Genial. Dier. l. 2. c. 20. (h) Tzeror Hammor, fol. 85. 3. & 96. 1. & 97. 4. & 104. 1. & 105. 2. & 137. 2, 3.((i) Zohar in Exod. fol. 51. 3. & in Deut. fol. 115. 3. Raya Mehimna in Zohar in Numb. fol. 94. 3. Shirhashirim Rabba, fol. 5. 3. Midrash Kohelet, fol. 64. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I heard a voice in the midst of the four beasts say, A {a} measure of wheat for a penny, {5} and three measures of barley for a penny; and see thou hurt not the oil and the wine.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I heard a voice in the midst of the four beasts say, A ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " measure of wheat for a penny, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{5}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and three measures of barley for a penny; and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "see",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thou hurt not the oil and the wine.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) It is here signified how little grain there was, for the word used here is a unit of measure for dry things, about an eighth of a bushel, which was a typical daily ration given to servants.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) I would rather interpret and read the words this way, And the wine and the oil you will not distribute unjustly. In this sense likewise the wine and the oil will be sold a very little for a penny. You will not distribute unjustly, namely, when you measure out a very little for a great price: so are the times evident: otherwise it would be true, as the wise man says, that whoever withholds the grain will be cursed by the people; Pr 11:26.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I heard a voice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] One of the many voices heard throughout this book without anyone being defined as the speaker.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A measure of wheat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The object of the voice is rather to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "define",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the extent of the scarcity than, as some say, to mitigate it. A quart (or somewhat less) of corn is to be bought for a silver penny (about 8½",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "d.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the former was the estimated ration for an able-bodied man’s daily fare, the latter the daily pay of a soldier, apparently a liberal daily pay (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for a labourer. So there is not such a famine that the poor must starve, and the rich “give their pleasant things for meat to relieve the soul:” the working man can, if he pleases, earn the ordinary necessaries of life for himself: he may even procure a bare comfortless subsistence (for barley, an ordinary article of human food down to the time of the kings of Israel, was now considered as fodder for cattle) for a family, if not too numerous. Meanwhile, nothing is said about the fish and vegetables, which the plain-living man of the Mediterranean ate with his bread, as the plain-living Englishman eats bacon or cheese: but the comparatively superfluous luxuries of wine and oil are carefully protected. In short, we have a picture of “bad times,” when no one need be absolutely without bare necessaries, and those who can afford it need not go without luxuries. All that we know of the age of the decline of the Roman Empire points to this prophecy having been eminently fulfilled then; but we need not go so far for fulfilments of it any more than of the two former: indeed this is much nearer to us than the grand army and the barricades, or Waterloo and Peterloo.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I heard a voice in the midst of the four beasts say;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I heard as it were a voice in the midst of the four living creatures, saying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). The speaker is not perceived by St. John; the words proceed from somewhere near the throne (but the exact situation is left doubtful), which is surrounded by the four living creatures (see on Revelation 4:6 for the consideration both of the position and of the nature of the four living creatures). Alford points out the appropriateness of the voice proceeding from the midst of the representatives of creation, when the intent of the words is to mitigate the woes denounced against creation. Those who consider the living creatures to be symbolical of the Gospels, and who interpret this vision as a prophecy of heresy (see on ver. 5), also see an appropriateness in the fact of the voice issuing from amidst the living creatures, since by the power and influence of the Gospels heresy is dispelled. Wordsworth recalls the custom of placing the Gospels in the midst of the Synod in the ancient Councils of the Church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A measure of wheat for a penny, and three measures of barley for a penny;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a choenix of wheat for a denarius, and three choenixes of barley for a denarius.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "choenix",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " appears to have been the food allotted to one man for a day; while the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "denarius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was the pay of a soldier or of a common labourer for one day (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He agreed with the labourers for a penny a day,\" and Tacitus, 'Ann.,' 1:17, 26, \"Ut denarius diurnum stipendium foret.\" Cf. Tobit 5:14, where ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "drachma",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is equivalent to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "denarius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The choenix was the eighth part of the modius, and a denarius would usually purchase a modius of wheat. The price given, therefore, denotes great scarcity, though not an entire absence of food, since a man's wages would barely suffice to obtain him food. Barley, which was the coarser food, was obtainable at one third of the price, which would allow a man to feed a family, though with difficulty. A season of great scarcity is therefore predicted, though in his wrath God remembers mercy (cf. the judgments threatened in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:23-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. the sword, pestilence, and famine; also the expression, \"They shall deliver you your bread again by weight\"). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And see thou hurt net the oil and the wine.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The corollary to the preceding sentence, with the same signification. It expresses a limit set to the power of the rider on the black horse. These were typical articles of food (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:14, 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"That he may bring forth food out of the earth; and wine that maketh glad the heart of man, and oil to make his face to shine, and bread which strengtheneth man's heart;\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The corn is wasted: the new wine is dried up, the oil languisheth\"). Wordsworth interprets, \"The prohibition to the rider, 'Hurt not thou the oil and the wine,' is a restraint on the evil design of the rider, who would injure the spiritual oil and wine, that is, the means of grace, which had been typified under those symbols in ancient prophecy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:4, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and also by the words and acts of Christ, the good Samaritan, pouring in oil and wine into the wounds of the traveller, representing human nature, lying in the road.\" '",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Αδικήσῃς ἀδικεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Revelation invariably signifies \"to injure,\" and, except in one case, takes the direct accusative after it (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:2, 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:4, 10, 19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Nevertheless, Heinrich and Elliott render, \"Do not commit injustice in the matter of the oil and wine.\" Rinek renders, \"waste not.\" The vision is a general prophecy of the future for all time (see on ver. 5); but many writers have striven to identify the fulfilment of the vision with some one particular famine. Grotius and Wetstein refer it to the scarcity in the days of Claudius; Renan, to that in the time of Nero; Bishop Newton, to the end of the second century. Those who interpret the vision as a forewarning of the spread of heresy, especially single out that of Arius. Revelation 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Measure (χοῖνιξ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Choenix. Only here in the New Testament. A dry measure, according to some, a quart; to others a pint and a half. Herodotus, speaking of the provisions for Xerxes' army, assigns a choenix of corn for a man's daily supply, evidently meaning a minimum allowance (vii., 187); and Thucydides, speaking of the terms of truce between the Lacedaemonians and the Athenians, mentions the following as one of the provisions: \"The Athenians shall permit the Lacedaemonians on the mainland to send to those on the island a fixed quantity of kneaded flour, viz., two Attic quarts (χοίνικας) of barley-meal for each man\" (iv., 16). Jowett (\"Thucydides\") says that the choenix was about two pints dry measure. So Arnold (\"Thucydides\"), who adds that the allowance of two choenixes of barley-meal daily to a man was the ordinary allowance of a Spartan at the public table. See Herodotus, vi., 57.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For a penny (δηναρίου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on Matthew 20:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]