[{"num":21,"verse":"The Lord controls the mind of a king as easily as he directs the course of a stream."},{"num":2,"verse":"You may think that everything you do is right, but remember that the Lord judges your motives."},{"num":3,"verse":"Do what is right and fair; that pleases the Lord more than bringing him sacrifices."},{"num":4,"verse":"Wicked people are controlled by their conceit and arrogance, and this is sinful."},{"num":5,"verse":"Plan carefully and you will have plenty; if you act too quickly, you will never have enough."},{"num":6,"verse":"The riches you get by dishonesty soon disappear, but not before they lead you into the jaws of death."},{"num":7,"verse":"The wicked are doomed by their own violence; they refuse to do what is right."},{"num":8,"verse":"Guilty people walk a crooked path; the innocent do what is right."},{"num":9,"verse":"Better to live on the roof than share the house with a nagging wife."},{"num":10,"verse":"Wicked people are always hungry for evil; they have no mercy on anyone."},{"num":11,"verse":"When someone who is conceited gets his punishment, even an unthinking person learns a lesson. One who is wise will learn from what he is taught."},{"num":12,"verse":"God, the righteous one, knows what goes on in the homes of the wicked, and he will bring the wicked down to ruin."},{"num":13,"verse":"If you refuse to listen to the cry of the poor, your own cry for help will not be heard."},{"num":14,"verse":"If someone is angry with you, a gift given secretly will calm him down."},{"num":15,"verse":"When justice is done, good people are happy, but evil people are brought to despair."},{"num":16,"verse":"Death is waiting for anyone who wanders away from good sense."},{"num":17,"verse":"Indulging in luxuries, wine, and rich food will never make you wealthy."},{"num":18,"verse":"The wicked bring on themselves the suffering they try to cause good people."},{"num":19,"verse":"Better to live out in the desert than with a nagging, complaining wife."},{"num":20,"verse":"Wise people live in wealth and luxury, but stupid people spend their money as fast as they get it."},{"num":21,"verse":"Be kind and honest and you will live a long life; others will respect you and treat you fairly."},{"num":22,"verse":"A shrewd general can take a city defended by strong men, and destroy the walls they relied on."},{"num":23,"verse":"If you want to stay out of trouble, be careful what you say."},{"num":24,"verse":"Show me a conceited person and I will show you someone who is arrogant, proud, and inconsiderate."},{"num":25,"verse":"Lazy people who refuse to work are only killing themselves; "},{"num":26,"verse":"all they do is think about what they would like to have. The righteous, however, can give, and give generously."},{"num":27,"verse":"The Lord hates it when wicked people offer him sacrifices, especially if they do it from evil motives."},{"num":28,"verse":"The testimony of a liar is not believed, but the word of someone who thinks matters through is accepted."},{"num":29,"verse":"Righteous people are sure of themselves; the wicked have to pretend as best they can."},{"num":30,"verse":"Human wisdom, brilliance, insight—they are of no help if the Lord is against you."},{"num":31,"verse":"You can get horses ready for battle, but it is the Lord who gives victory."}]