[{"num":21,"verse":"As partings of waters, so the heart of the king is in the power of the Lord; whither ever he will, he shall bow it. (Like out-flowings of water, is the king’s heart in the Lord’s hand; he shall turn it wherever he will, or desireth.)"},{"num":2,"verse":"Each way of a man seemeth rightful to himself; but the Lord weigheth the hearts."},{"num":3,"verse":"To do mercy and doom, pleaseth more the Lord, than sacrifices. (To do mercy and justice, that pleaseth the Lord more than sacrifices, or burnt offerings.)"},{"num":4,"verse":"Enhancing of eyes is [the] alarging of the heart; the lantern of wicked men is sin. (The raising up of the eyes, and the enlarging of the heart; such sins be the lantern of the wicked.)"},{"num":5,"verse":"The thoughts of a strong man be ever in abundance; but each slow man is ever in neediness. (The thoughts of a strong person be forevermore on abundance, or on plenty; but those of each person in haste be forevermore on neediness./Carefully-made plans shall be successful; but each person in haste shall be forever in need.)"},{"num":6,"verse":"He that gathereth treasures by the tongue of a lie maker, (or of a liar,) is vain, and without heart; and he shall be hurled to the snares of death."},{"num":7,"verse":"The ravens of unpious men shall draw them down; for they would not do doom. (The robberies of the wicked shall pull them down; for what they do is wrong.)"},{"num":8,"verse":"The wayward way of a man is alien from God; but the work of him that is clean of sin, is rightful. (The evil way of a person is alien to God; but the work of him who is clean of sin, is upright.)"},{"num":9,"verse":"It is better to sit in the corner of an house without roof, than with a woman full of chiding, and in a common house. (It is better to sit in the corner of a house without a roof, than with a woman full of arguments, or of bickering, in a house together.)"},{"num":10,"verse":"The soul of an unpious man desireth evil; he shall not have mercy on his neighbour. (The soul of a wicked person desireth evil; he shall not even give mercy to his friend.)"},{"num":11,"verse":"When a man full of pestilence is punished, a little man of wit shall be wiser (even someone of little wit, or of low intelligence, shall be made the wiser); and if he followeth a wise man, he shall take knowing."},{"num":12,"verse":"A just man of the house of a wicked man thinketh, to withdraw wicked men from evil. (The righteous think about the wicked in their houses, but it is God who shall throw down the wicked for their evil./The just God thinketh about the house of the wicked, and he shall throw down the wicked for their evil.)"},{"num":13,"verse":"He that stoppeth his ear at the cry of a poor man, shall cry also (shall also cry), and he shall not be heard."},{"num":14,"verse":"A gift hid quencheth chidings (A secret gift quencheth arguments); and a gift in [the] bosom quencheth most indignation."},{"num":15,"verse":"It is joy to a just man to make doom; and it is dread to them that work wickedness. (It is a joy for the righteous to see justice done; but judgement bringeth ruin to those who work wickedness.)"},{"num":16,"verse":"A man that erreth from the way of doctrine, shall dwell in the company of giants, that is, of men evil ruled, either of fiends. (Those who err, or who stray, from the way of doctrine, shall dwell in the company of the dead.)"},{"num":17,"verse":"He that loveth meats shall be in neediness (He who loveth too much food shall be in want); he that loveth wine and fat things, shall not be made rich."},{"num":18,"verse":"An unpious man shall be given for a just man; and a wicked man shall be given for a rightful man. (An evil person shall be given as a ransom for a righteous person; and a wicked person shall be given as a ransom for an upright person.)"},{"num":19,"verse":"It is better to dwell in a desert land, than with a woman full of chiding, and wrathful."},{"num":20,"verse":"Desirable treasure and oil is in the dwelling place of a just man; and an unprudent man shall destroy it. (Desirable treasure and oil be in the dwelling place of the wise; but an imprudent person shall destroy it all.)"},{"num":21,"verse":"He that followeth rightfulness and mercy, shall find life, [and rightwiseness,] and glory."},{"num":22,"verse":"A wise man ascended into the city of (the) strong men, and destroyed the strength of [the] trust thereof."},{"num":23,"verse":"He that keepeth his mouth and his tongue (under control), keepeth his soul from anguishes."},{"num":24,"verse":"A proud man and (a) boaster is called a fool, (for) that (he) worketh (his) pride in ire."},{"num":25,"verse":"Desires slay a slow man; for his hands would not (do) work (of) anything. (Desires shall slay a lazy person; for his hands shall not do any work.)"},{"num":26,"verse":"All day he coveteth and desireth; but he that is a just man, shall give, and shall not cease. (All day long he wanteth, and longeth for; but he who is righteous, shall give, and shall never cease to give.)"},{"num":27,"verse":"The offerings of wicked men (The offerings of the wicked), that be offered (out) of great trespass, be abominable."},{"num":28,"verse":"A false witness shall perish; a man obedient shall speak victory (but an honest person shall speak, and be rewarded)."},{"num":29,"verse":"A wicked man maketh firm his cheer unshamefastly; but he that is rightful, amendeth his way. (A wicked person unashamedly maketh firm his face, or is stubborn; but he who is upright, mendeth his way.)"},{"num":30,"verse":"No wisdom there is, no prudence there is, no counsel there is, against the Lord. (There is no wisdom, no understanding, no good advice, in being against the Lord.)"},{"num":31,"verse":"An horse is made ready to the day of battle; but the Lord shall give health. (A horse can be prepared for the day of battle; but victory cometh only from the Lord.)"}]