[{"header":"False Teachers"},{"num":2,"verse":"False prophets appeared in the past among the people, and in the same way false teachers will appear among you. They will bring in destructive, untrue doctrines, and will deny the Master who redeemed them, and so they will bring upon themselves sudden destruction. "},{"num":2,"verse":"Even so, many will follow their immoral ways; and because of what they do, others will speak evil of the Way of truth. "},{"num":3,"verse":"In their greed these false teachers will make a profit out of telling you made-up stories. For a long time now their Judge has been ready, and their Destroyer has been wide awake!"},{"num":4,"verse":"God did not spare the angels who sinned, but threw them into hell, where they are kept chained in darkness, waiting for the Day of Judgment. "},{"num":5,"verse":"God did not spare the ancient world, but brought the flood on the world of godless people; the only ones he saved were Noah, who preached righteousness, and seven other people. "},{"num":6,"verse":"God condemned the cities of Sodom and Gomorrah, destroying them with fire, and made them an example of what will happen to the godless. "},{"num":7,"verse":"He rescued Lot, a good man, who was distressed by the immoral conduct of lawless people. "},{"num":8,"verse":"That good man lived among them, and day after day he suffered agony as he saw and heard their evil actions. "},{"num":9,"verse":"And so the Lord knows how to rescue godly people from their trials and how to keep the wicked under punishment for the Day of Judgment, "},{"num":10,"verse":"especially those who follow their filthy bodily lusts and despise God's authority."},{"num":11,"verse":"Even the angels, who are so much stronger and mightier than these false teachers, do not accuse them with insults in the presence of the Lord. "},{"num":12,"verse":"But these people act by instinct, like wild animals born to be captured and killed; they attack with insults anything they do not understand. They will be destroyed like wild animals, "},{"num":13,"verse":"and they will be paid with suffering for the suffering they have caused. Pleasure for them is to do anything in broad daylight that will satisfy their bodily appetites; they are a shame and a disgrace as they join you in your meals, all the while enjoying their deceitful ways! "},{"num":14,"verse":"They want to look for nothing but the chance to commit adultery; their appetite for sin is never satisfied. They lead weak people into a trap. Their hearts are trained to be greedy. They are under God's curse! "},{"num":15,"verse":"They have left the straight path and have lost their way; they have followed the path taken by Balaam son of Beor, who loved the money he would get for doing wrong "},{"num":16,"verse":"and was rebuked for his sin. His donkey spoke with a human voice and stopped the prophet's insane action."},{"num":17,"verse":"These people are like dried-up springs, like clouds blown along by a storm; God has reserved a place for them in the deepest darkness. "},{"num":18,"verse":"They make proud and stupid statements, and use immoral bodily lusts to trap those who are just beginning to escape from among people who live in error. "},{"num":19,"verse":"They promise them freedom while they themselves are slaves of destructive habits—for we are slaves of anything that has conquered us. "},{"num":20,"verse":"If people have escaped from the corrupting forces of the world through their knowledge of our Lord and Savior Jesus Christ, and then are again caught and conquered by them, such people are in worse condition at the end than they were at the beginning. "},{"num":21,"verse":"It would have been much better for them never to have known the way of righteousness than to know it and then turn away from the sacred command that was given them. "},{"num":22,"verse":"What happened to them shows that the proverbs are true: “A dog goes back to what it has vomited” and “A pig that has been washed goes back to roll in the mud.”"}]