[{"header":"False Prophets and Teachers(A)"},{"num":2,"verse":"But there were also false prophets among the people, just as there will be false teachers among you, who will secretly bring in destructive heresies, even denying the Lord who bought them, bringing swift destruction upon themselves. "},{"num":2,"verse":"And many will follow their destructive ways, because of whom the way of truth will be blasphemed. "},{"num":3,"verse":"And in their greed they will exploit you with deceptive words. Their judgment, made long ago, does not linger, and their destruction does not slumber."},{"num":4,"verse":"For if God did not spare the angels that sinned, but cast them down to hell and delivered them into chains of darkness to be kept for judgment; "},{"num":5,"verse":"and if He did not spare the ancient world, but saved Noah, a preacher of righteousness, with seven others, when He brought a flood upon the world of the ungodly; "},{"num":6,"verse":"and if He condemned the cities of Sodom and Gomorrah to destruction by reducing them to ashes, making them an example to those afterward who would live ungodly lives; "},{"num":7,"verse":"and if He delivered righteous Lot, who was distressed by the filthy conduct of the wicked "},{"num":8,"verse":"(for that righteous man lived among them, and what he saw and heard of their lawless deeds tormented his righteous soul day after day); "},{"num":9,"verse":"then the Lord knows how to rescue the godly from trial, and to keep the unrighteous under punishment for the Day of Judgment, "},{"num":10,"verse":"especially those who walk after the flesh in pursuit of unclean desires, and despise authority."},{"num":11,"verse":"Whereas angels, who are greater in power and might, do not bring slanderous accusations against them before the Lord. "},{"num":12,"verse":"But these people are like irrational animals, born to be captured and destroyed. They speak evil of the things that they do not understand, and in their corruption they will be destroyed."},{"num":13,"verse":"They shall receive the wages of unrighteousness. They count it a pleasure to carouse in the daytime. They are blots and blemishes who revel in their own deception while they carouse together with you. "},{"num":14,"verse":"They have eyes full of adultery that cannot cease from sin. They entice unstable souls. Their hearts are trained in greed. They are cursed children! "},{"num":15,"verse":"They have forsaken the right way and have gone astray. They follow the way of Balaam the son of Beor, who loved the wages of wickedness, "},{"num":16,"verse":"but who was rebuked for his iniquity. The mute donkey speaking with a man’s voice constrained the madness of the prophet."},{"num":17,"verse":"These men are wells without water and clouds that are carried by a storm, for whom the gloom of darkness has been reserved forever. "},{"num":18,"verse":"For when they speak arrogant words of vanity, they entice by the lusts of the flesh and by depravity those who barely escaped from those who live in error. "},{"num":19,"verse":"Although they promise them freedom, they themselves are slaves of corruption, for by that which a man is overcome, to this he is enslaved. "},{"num":20,"verse":"For if after they have escaped the defilements of the world through the knowledge of the Lord and Savior Jesus Christ, and they are again entangled in them and are overcome, the latter end is worse for them than the beginning. "},{"num":21,"verse":"For it would have been better for them not to have known the way of righteousness than to have known it and then turn back from the holy commandment that was delivered to them. "},{"num":22,"verse":"But it has happened to them according to the true proverb, “The dog returns to his own vomit,” and “the sow that was washed to her wallowing in the mud.”"}]