[{"header":"Chapter 2"},{"num":1,"verse":"False Teachers. There were also false prophets among the people, just as there will be false teachers among you, who will introduce destructive heresies and even deny the Master who ransomed them, bringing swift destruction on themselves. "},{"num":2,"verse":"Many will follow their licentious ways, and because of them the way of truth will be reviled. "},{"num":3,"verse":"In their greed they will exploit you with fabrications, but from of old their condemnation has not been idle and their destruction does not sleep."},{"num":4,"verse":"Lessons from the Past. For if God did not spare the angels when they sinned, but condemned them to the chains of Tartarus and handed them over to be kept for judgment; "},{"num":5,"verse":"and if he did not spare the ancient world, even though he preserved Noah, a herald of righteousness, together with seven others, when he brought a flood upon the godless world; "},{"num":6,"verse":"and if he condemned the cities of Sodom and Gomorrah [to destruction], reducing them to ashes, making them an example for the godless [people] of what is coming; "},{"num":7,"verse":"and if he rescued Lot, a righteous man oppressed by the licentious conduct of unprincipled people "},{"num":8,"verse":"(for day after day that righteous man living among them was tormented in his righteous soul at the lawless deeds that he saw and heard), "},{"num":9,"verse":"then the Lord knows how to rescue the devout from trial and to keep the unrighteous under punishment for the day of judgment, "},{"num":10,"verse":"and especially those who follow the flesh with its depraved desire and show contempt for lordship."},{"num":11,"verse":"whereas angels, despite their superior strength and power, do not bring a reviling judgment against them from the Lord. "},{"num":12,"verse":"But these people, like irrational animals born by nature for capture and destruction, revile things that they do not understand, and in their destruction they will also be destroyed, "},{"num":13,"verse":"suffering wrong as payment for wrongdoing. Thinking daytime revelry a delight, they are stains and defilements as they revel in their deceits while carousing with you. "},{"num":14,"verse":"Their eyes are full of adultery and insatiable for sin. They seduce unstable people, and their hearts are trained in greed. Accursed children! "},{"num":15,"verse":"Abandoning the straight road, they have gone astray, following the road of Balaam, the son of Bosor, who loved payment for wrongdoing, "},{"num":16,"verse":"but he received a rebuke for his own crime: a mute beast spoke with a human voice and restrained the prophet’s madness."},{"num":17,"verse":"These people are waterless springs and mists driven by a gale; for them the gloom of darkness has been reserved. "},{"num":18,"verse":"For, talking empty bombast, they seduce with licentious desires of the flesh those who have barely escaped from people who live in error. "},{"num":19,"verse":"They promise them freedom, though they themselves are slaves of corruption, for a person is a slave of whatever overcomes him. "},{"num":20,"verse":"For if they, having escaped the defilements of the world through the knowledge of [our] Lord and savior Jesus Christ, again become entangled and overcome by them, their last condition is worse than their first. "},{"num":21,"verse":"For it would have been better for them not to have known the way of righteousness than after knowing it to turn back from the holy commandment handed down to them. "},{"num":22,"verse":"What is expressed in the true proverb has happened to them, “The dog returns to its own vomit,” and “A bathed sow returns to wallowing in the mire.”"}]