[{"header":"False Prophets"},{"num":2,"verse":"There were, however, false prophets among the people, just as there will be false teachers among yourselves, who will sneak in with their destructive false teachings, even denying the master who paid the price for them. They will earn swift destruction for themselves, "},{"num":2,"verse":"and many will follow after their disgusting practices. The way of truth will be blasphemed because of them, "},{"num":3,"verse":"and in their greed they will exploit you with fake prophecies. Their condemnation has not been idle for a long time now, and their destruction has not fallen asleep."},{"num":4,"verse":"God didn’t spare the angels who sinned, you see, but he threw them into the Pit, into dark caverns, handing them over to be guarded until the time of judgment. "},{"num":5,"verse":"Similarly, he didn’t spare the ancient world, but brought a flood on the world of the ungodly and rescued Noah, a herald of righteousness, with seven others. "},{"num":6,"verse":"Similarly, he condemned the cities of Sodom and Gomorrah, reducing them to ashes and ruin, thus setting up an example of what would happen to the ungodly. "},{"num":7,"verse":"He snatched righteous Lot out of the disaster, a man who had been deeply troubled by their shameful and unprincipled behaviour. "},{"num":8,"verse":"That righteous man, you see, living in their midst, could see and hear day after day lawless deeds which tortured his righteous soul. "},{"num":9,"verse":"The Lord knows how to rescue the godly from testing, and also how to keep the unrighteous ready for the day of judgment and punishment, "},{"num":10,"verse":" especially those who follow after the pollution of fleshly lust and despise authority."},{"header":"From Bad to Worse"},{"num":10,"verse":" Such people are arrogant and self-willed! They are not afraid to blaspheme the glorious ones, "},{"num":11,"verse":"whereas the angels, stronger and more powerful though they are, do not bring a charge of blasphemy against them before the Lord."},{"num":12,"verse":"These people are like unreasoning beasts, by nature born to be caught and destroyed. They curse at things of which they have no knowledge; they are destroyed by their own self-destructive tendencies. "},{"num":13,"verse":"They commit injustice, and receive injustice as their reward. They count it pleasure to hold wild revels in the daytime. If they join you for a meal, they pollute and stain the whole thing as they wallow in their disgusting pleasures. "},{"num":14,"verse":"Their eyes are full of adultery; they can’t get enough of sin; when they find unsteady souls, they lead them astray; their hearts have been trained in greed; they are children of the curse. "},{"num":15,"verse":"They have left the straight path and have wandered off in pursuit of Balaam son of Bosor, who loved the reward of unrighteousness, "},{"num":16,"verse":"and was rebuked for his disobedience when a normally speechless donkey spoke in a human voice to stop the prophet’s madness in its tracks."},{"num":17,"verse":"These people are springs without water. They are patches of fog driven along by a storm. The depth of darkness has been reserved for them! "},{"num":18,"verse":"They utter bombastic words of folly as they entice, with licentious fleshly desires, those who have only just escaped from the company of people who behave improperly. "},{"num":19,"verse":"They promise them freedom, but they themselves are slaves to corruption. (A person who is defeated by something, you see, is enslaved to it.) "},{"num":20,"verse":"For if they have fled the pollutions of the world through the knowledge of our Lord and saviour Jesus the Messiah, but again become entangled in them and are defeated, they have ended up in a worse state than they were before. "},{"num":21,"verse":"It would have been better for them never to have known the way of righteousness than, having known it, to turn away from the holy commandment which had been given to them. "},{"num":22,"verse":"There is a true proverb which now applies to them: the dog returns to its own vomit, and the sow gets washed only to wallow once more in the mud."}]