[{"header":"Balak Sends for Balaam"},{"num":22,"verse":"Then the people of Israel went to the plains of Moab, and they camped near the Jordan River across from Jericho."},{"num":2,"verse":"Balak son of Zippor saw everything the Israelites had done to the Amorites. "},{"num":3,"verse":"And Moab was scared of so many Israelites; truly, Moab was terrified by them."},{"num":4,"verse":"The Moabites said to the elders of Midian, “These people will take everything around us like an ox eating grass.”"},{"num":5,"verse":"He sent messengers to Balaam son of Beor at Pethor, near the Euphrates River in his native land. Balak said, “A nation has come out of Egypt that covers the land. They have camped next to me, "},{"num":6,"verse":"and they are too powerful for me. So come and put a curse on them. Maybe then I can defeat them and make them leave the area. I know that if you bless someone, the blessings happen, and if you put a curse on someone, it happens.”"},{"num":7,"verse":"The elders of Moab and Midian went with payment in their hands. When they found Balaam, they told him what Balak had said."},{"num":8,"verse":"Balaam said to them, “Stay here for the night, and I will tell you what the Lord tells me.” So the Moabite leaders stayed with him."},{"num":9,"verse":"God came to Balaam and asked, “Who are these men with you?”"},{"num":10,"verse":"Balaam said to God, “The king of Moab, Balak son of Zippor, sent them to me with this message: "},{"num":11,"verse":"‘A nation has come out of Egypt that covers the land. So come and put a curse on them, and maybe I can fight them and force them out of my land.’”"},{"num":12,"verse":"But God said to Balaam, “Do not go with them. Don’t put a curse on those people, because I have blessed them.”"},{"num":13,"verse":"The next morning Balaam awoke and said to Balak’s leaders, “Go back to your own country; the Lord has refused to let me go with you.”"},{"num":14,"verse":"So the Moabite leaders went back to Balak and said, “Balaam refused to come with us.”"},{"num":15,"verse":"So Balak sent other leaders—this time there were more of them, and they were more important. "},{"num":16,"verse":"They went to Balaam and said, “Balak son of Zippor says this: Please don’t let anything stop you from coming to me. "},{"num":17,"verse":"I will pay you very well, and I will do what you say. Come and put a curse on these people for me.”"},{"num":18,"verse":"But Balaam answered Balak’s servants, “King Balak could give me his palace full of silver and gold, but I cannot disobey the Lord my God in anything, great or small. "},{"num":19,"verse":"You stay here tonight as the other men did, and I will find out what more the Lord tells me.”"},{"num":20,"verse":"That night God came to Balaam and said, “These men have come to ask you to go with them. Go, but only do what I tell you.”"},{"header":"Balaam’s Donkey Speaks"},{"num":21,"verse":"Balaam got up the next morning and put a saddle on his donkey. Then he went with the Moabite leaders. "},{"num":22,"verse":"But God became angry because Balaam went, so the angel of the Lord stood in the road to stop Balaam. Balaam was riding his donkey, and he had two servants with him. "},{"num":23,"verse":"When the donkey saw the angel of the Lord standing in the road with a sword in his hand, the donkey left the road and went into the field. Balaam hit the donkey to force her back on the road."},{"num":24,"verse":"Later, the angel of the Lord stood on a narrow path between two vineyards, with walls on both sides. "},{"num":25,"verse":"Again the donkey saw the angel of the Lord, and she walked close to one wall, crushing Balaam’s foot against it. So he hit her again."},{"num":26,"verse":"The angel of the Lord went ahead again and stood at a narrow place, too narrow to turn left or right. "},{"num":27,"verse":"When the donkey saw the angel of the Lord, she lay down under Balaam. This made him so angry that he hit her with his stick. "},{"num":28,"verse":"Then the Lord made the donkey talk, and she said to Balaam, “What have I done to make you hit me three times?”"},{"num":29,"verse":"Balaam answered the donkey, “You have made me look foolish! I wish I had a sword in my hand! I would kill you right now!”"},{"num":30,"verse":"But the donkey said to Balaam, “I am your very own donkey, which you have ridden for years. Have I ever done this to you before?”"},{"num":31,"verse":"Then the Lord let Balaam see the angel of the Lord, who was standing in the road with his sword drawn. Then Balaam bowed facedown on the ground."},{"num":32,"verse":"The angel of the Lord asked Balaam, “Why have you hit your donkey three times? I have stood here to stop you, because what you are doing is wrong. "},{"num":33,"verse":"The donkey saw me and turned away from me three times. If she had not turned away, I would have killed you by now, but I would have let her live.”"},{"num":34,"verse":"Then Balaam said to the angel of the Lord, “I have sinned; I did not know you were standing in the road to stop me. If I am wrong, I will go back.”"},{"num":35,"verse":"The angel of the Lord said to Balaam, “Go with these men, but say only what I tell you.” So Balaam went with Balak’s leaders."},{"num":36,"verse":"When Balak heard that Balaam was coming, he went out to meet him at Ar in Moab, which was beside the Arnon, at the edge of his country. "},{"num":37,"verse":"Balak said to Balaam, “I had asked you before to come quickly. Why didn’t you come to me? I am able to reward you well.”"},{"num":38,"verse":"But Balaam answered, “I have come to you now, but I can’t say just anything. I can only say what God tells me to say.”"},{"num":39,"verse":"Then Balaam went with Balak to Kiriath Huzoth. "},{"num":40,"verse":"Balak offered cattle and sheep as a sacrifice and gave some meat to Balaam and the leaders with him."},{"num":41,"verse":"The next morning Balak took Balaam to Bamoth Baal; from there he could see the edge of the Israelite camp."}]