[{"header":"Balak Summons Balaam to Curse Israel"},{"num":22,"verse":"Then the people of Israel set out, and encamped in the plains of Moab beyond the Jordan at Jericho. "},{"num":2,"verse":"And Balak the son of Zippor saw all that Israel had done to the Amorites. "},{"num":3,"verse":"And Moab was in great dread of the people, because they were many; Moab was overcome with fear of the people of Israel. "},{"num":4,"verse":"And Moab said to the elders of Mid′ian, “This horde will now lick up all that is round about us, as the ox licks up the grass of the field.” So Balak the son of Zippor, who was king of Moab at that time, "},{"num":5,"verse":"sent messengers to Balaam the son of Be′or at Pethor, which is near the River, in the land of Amaw to call him, saying, “Behold, a people has come out of Egypt; they cover the face of the earth, and they are dwelling opposite me. "},{"num":6,"verse":"Come now, curse this people for me, since they are too mighty for me; perhaps I shall be able to defeat them and drive them from the land; for I know that he whom you bless is blessed, and he whom you curse is cursed.”"},{"num":7,"verse":"So the elders of Moab and the elders of Mid′ian departed with the fees for divination in their hand; and they came to Balaam, and gave him Balak’s message. "},{"num":8,"verse":"And he said to them, “Lodge here this night, and I will bring back word to you, as the Lord speaks to me”; so the princes of Moab stayed with Balaam. "},{"num":9,"verse":"And God came to Balaam and said, “Who are these men with you?” "},{"num":10,"verse":"And Balaam said to God, “Balak the son of Zippor, king of Moab, has sent to me, saying, "},{"num":11,"verse":"‘Behold, a people has come out of Egypt, and it covers the face of the earth; now come, curse them for me; perhaps I shall be able to fight against them and drive them out.’” "},{"num":12,"verse":"God said to Balaam, “You shall not go with them; you shall not curse the people, for they are blessed.” "},{"num":13,"verse":"So Balaam rose in the morning, and said to the princes of Balak, “Go to your own land; for the Lord has refused to let me go with you.” "},{"num":14,"verse":"So the princes of Moab rose and went to Balak, and said, “Balaam refuses to come with us.”"},{"num":15,"verse":"Once again Balak sent princes, more in number and more honorable than they. "},{"num":16,"verse":"And they came to Balaam and said to him, “Thus says Balak the son of Zippor: ‘Let nothing hinder you from coming to me; "},{"num":17,"verse":"for I will surely do you great honor, and whatever you say to me I will do; come, curse this people for me.’” "},{"num":18,"verse":"But Balaam answered and said to the servants of Balak, “Though Balak were to give me his house full of silver and gold, I could not go beyond the command of the Lord my God, to do less or more. "},{"num":19,"verse":"Pray, now, tarry here this night also, that I may know what more the Lord will say to me.” "},{"num":20,"verse":"And God came to Balaam at night and said to him, “If the men have come to call you, rise, go with them; but only what I bid you, that shall you do.”"},{"header":"Balaam, the Donkey, and the Angel"},{"num":21,"verse":"So Balaam rose in the morning, and saddled his ass, and went with the princes of Moab. "},{"num":22,"verse":"But God’s anger was kindled because he went; and the angel of the Lord took his stand in the way as his adversary. Now he was riding on the ass, and his two servants were with him. "},{"num":23,"verse":"And the ass saw the angel of the Lord standing in the road, with a drawn sword in his hand; and the ass turned aside out of the road, and went into the field; and Balaam struck the ass, to turn her into the road. "},{"num":24,"verse":"Then the angel of the Lord stood in a narrow path between the vineyards, with a wall on either side. "},{"num":25,"verse":"And when the ass saw the angel of the Lord, she pushed against the wall, and pressed Balaam’s foot against the wall; so he struck her again. "},{"num":26,"verse":"Then the angel of the Lord went ahead, and stood in a narrow place, where there was no way to turn either to the right or to the left. "},{"num":27,"verse":"When the ass saw the angel of the Lord, she lay down under Balaam; and Balaam’s anger was kindled, and he struck the ass with his staff. "},{"num":28,"verse":"Then the Lord opened the mouth of the ass, and she said to Balaam, “What have I done to you, that you have struck me these three times?” "},{"num":29,"verse":"And Balaam said to the ass, “Because you have made sport of me. I wish I had a sword in my hand, for then I would kill you.” "},{"num":30,"verse":"And the ass said to Balaam, “Am I not your ass, upon which you have ridden all your life long to this day? Was I ever accustomed to do so to you?” And he said, “No.”"},{"num":31,"verse":"Then the Lord opened the eyes of Balaam, and he saw the angel of the Lord standing in the way, with his drawn sword in his hand; and he bowed his head, and fell on his face. "},{"num":32,"verse":"And the angel of the Lord said to him, “Why have you struck your ass these three times? Behold, I have come forth to withstand you, because your way is perverse before me; "},{"num":33,"verse":"and the ass saw me, and turned aside before me these three times. If she had not turned aside from me, surely just now I would have slain you and let her live.” "},{"num":34,"verse":"Then Balaam said to the angel of the Lord, “I have sinned, for I did not know that thou didst stand in the road against me. Now therefore, if it is evil in thy sight, I will go back again.” "},{"num":35,"verse":"And the angel of the Lord said to Balaam, “Go with the men; but only the word which I bid you, that shall you speak.” So Balaam went on with the princes of Balak."},{"num":36,"verse":"When Balak heard that Balaam had come, he went out to meet him at the city of Moab, on the boundary formed by the Arnon, at the extremity of the boundary. "},{"num":37,"verse":"And Balak said to Balaam, “Did I not send to you to call you? Why did you not come to me? Am I not able to honor you?” "},{"num":38,"verse":"Balaam said to Balak, “Lo, I have come to you! Have I now any power at all to speak anything? The word that God puts in my mouth, that must I speak.” "},{"num":39,"verse":"Then Balaam went with Balak, and they came to Kir′iath-hu′zoth. "},{"num":40,"verse":"And Balak sacrificed oxen and sheep, and sent to Balaam and to the princes who were with him."},{"header":"Balaam’s First Oracle"},{"num":41,"verse":"And on the morrow Balak took Balaam and brought him up to Bamothba′al; and from there he saw the nearest of the people. "}]