[{"num":22,"verse":"But they didn’t remain there. The Israelites traveled on to the Moabite plains, where they set up camp, just across the Jordan River, east of Jericho. "},{"num":2,"verse":"The Moabite Balak (Zippor’s son) knew about the Israelites’ victory over the Amorites and what they had done there. "},{"num":3,"verse":"Actually, everyone in Moab was terrified of the Israelites. And Moab hated the Israelites, because there were so many of them!"},{"num":5,"verse":"In the face of this threat, he sent messengers to the famous prophet Balaam (Beor’s son), who lived in a town that belonged to his country on the Euphrates River called Pethor. Balak wanted the prophet to come to Moab."},{"num":7,"verse":"So the messengers went—elders, actually, from both Moab and Midian—with money in hand, to pay the prophet to come back with them and curse the Israelites. They gave him Balak’s message."},{"num":9,"verse":"But God came in the night to Balaam and questioned him."},{"num":13,"verse":"So first thing in the morning, Balaam confronted Balak’s elders with the news."},{"num":14,"verse":"The Moabite contingent returned and told Balak that Balaam wouldn’t come. "},{"num":15,"verse":"But Balak wouldn’t take “no” for an answer. He sent another, bigger contingent of even more highly esteemed men to solicit Balaam’s help."},{"num":20,"verse":"Again, God came to Balaam in the night and spoke with him."},{"num":21,"verse":"So when morning came, Balaam got his donkey ready. He set out with the Moabite elders. "},{"num":22,"verse":"Nevertheless, God was angry that Balaam was going. He sent His own messenger as an adversary to stand in Balaam’s way, blocking the prophet’s path. Now Balaam was riding on his donkey, and he had two servants too. "},{"num":23,"verse":"But it was the donkey who saw the Eternal’s messenger standing in the road with a sword in his hand, drawn and ready. The donkey went off the road and into the field, and Balaam, not seeing the messenger as his donkey had, hit the beast to drive it back onto the road; "},{"num":24,"verse":"but then the messenger of the Eternal stood in the narrow walkway separating two vineyards, and there was a wall on either side. "},{"num":25,"verse":"Spooked by the Eternal’s messenger, the donkey pressed herself against one of the walls, trapping Balaam’s foot. Balaam hit her again. "},{"num":26,"verse":"The Eternal’s messenger got ahead of them again and faced them in a narrow spot where they had no way to avoid him. "},{"num":27,"verse":"This time, the donkey, seeing the Eternal’s messenger, just lay down, Balaam still sitting on top. Balaam was furious, and he beat the beast with a rod. "},{"num":28,"verse":"But the Eternal One gave the donkey the ability to speak."},{"num":31,"verse":"At that point, the Eternal opened the eyes of Balaam to see His messenger standing in the road, sword drawn. Balaam bowed low to the ground, lying with his face in the dirt."},{"num":36,"verse":"When they neared the very edge of Moabite territory, Balak (who’d heard they were on their way) met Balaam at Moab’s city on the Arnon."},{"num":39,"verse":"Nevertheless the two went off together. Balak led Balaam to Kiriath-huzoth in Moab. "},{"num":40,"verse":"Later on, Balak had some oxen and sheep sacrificed, which he made sure Balaam received (along with the officials who accompanied him)."},{"num":41,"verse":"The next day, Balak led Balaam up to a high place of Baal worship, an altar dedicated to pagan lords. Looking down from there, they could see a section of the Israelite camp."}]