[{"header":"Duties toward Believers"},{"num":5,"verse":"Do not rebuke an older man but exhort him as you would a father; treat younger men like brothers, "},{"num":2,"verse":"older women like mothers, younger women like sisters, in all purity."},{"num":3,"verse":"Honor widows who are real widows. "},{"num":4,"verse":"If a widow has children or grandchildren, let them first learn their religious duty to their own family and make some return to their parents; for this is acceptable in the sight of God. "},{"num":5,"verse":"She who is a real widow, and is left all alone, has set her hope on God and continues in supplications and prayers night and day; "},{"num":6,"verse":"whereas she who is self-indulgent is dead even while she lives. "},{"num":7,"verse":"Command this, so that they may be without reproach. "},{"num":8,"verse":"If any one does not provide for his relatives, and especially for his own family, he has disowned the faith and is worse than an unbeliever."},{"num":9,"verse":"Let a widow be enrolled if she is not less than sixty years of age, having been the wife of one husband; "},{"num":10,"verse":"and she must be well attested for her good deeds, as one who has brought up children, shown hospitality, washed the feet of the saints, relieved the afflicted, and devoted herself to doing good in every way. "},{"num":11,"verse":"But refuse to enrol younger widows; for when they grow wanton against Christ they desire to marry, "},{"num":12,"verse":"and so they incur condemnation for having violated their first pledge. "},{"num":13,"verse":"Besides that, they learn to be idlers, gadding about from house to house, and not only idlers but gossips and busybodies, saying what they should not. "},{"num":14,"verse":"So I would have younger widows marry, bear children, rule their households, and give the enemy no occasion to revile us. "},{"num":15,"verse":"For some have already strayed after Satan. "},{"num":16,"verse":"If any believing woman has relatives who are widows, let her assist them; let the church not be burdened, so that it may assist those who are real widows."},{"num":17,"verse":"Let the elders who rule well be considered worthy of double honor, especially those who labor in preaching and teaching; "},{"num":18,"verse":"for the scripture says, “You shall not muzzle an ox when it is treading out the grain,” and, “The laborer deserves his wages.” "},{"num":19,"verse":"Never admit any charge against an elder except on the evidence of two or three witnesses. "},{"num":20,"verse":"As for those who persist in sin, rebuke them in the presence of all, so that the rest may stand in fear. "},{"num":21,"verse":"In the presence of God and of Christ Jesus and of the elect angels I charge you to keep these rules without favor, doing nothing from partiality. "},{"num":22,"verse":"Do not be hasty in the laying on of hands, nor participate in another man’s sins; keep yourself pure."},{"num":23,"verse":"No longer drink only water, but use a little wine for the sake of your stomach and your frequent ailments."},{"num":24,"verse":"The sins of some men are conspicuous, pointing to judgment, but the sins of others appear later. "},{"num":25,"verse":"So also good deeds are conspicuous; and even when they are not, they cannot remain hidden."}]