[{"num":12,"verse":"Soothly Job answered, and said,"},{"num":2,"verse":"And ye therefore be (the) men alone, and wisdom dwell with you? (And so ye be the only people, with whom wisdom dwelleth?)"},{"num":3,"verse":"And to me is an heart, as and to you (But I also have understanding, like you do), and I am not lower than ye; for who knoweth not these things, which ye know?"},{"num":4,"verse":"He that is scorned of his friend, as I am, shall inwardly call (upon) God, and God shall hear him; for the simpleness of a just man is scorned (for the innocence, or the integrity, of the righteous is scorned)."},{"num":5,"verse":"And a lamp is despised at the thoughts of rich men, the which lamp is made ready to a time ordained. (And he who is about to slip, or unwittingly fall, is despised in the thoughts of the rich, or the successful.)"},{"num":6,"verse":"The tabernacles of robbers be plenteous, either full of goods; and boldly they stir God to wrath, when he hath given all things into their hands."},{"num":7,"verse":"No wonder (Do not wonder about it), (but) ask thou [the] beasts, and they shall teach thee; and ask thou [the] birds of the air, and they shall show to thee."},{"num":8,"verse":"Speak to the earth, and it shall answer thee; and the fishes of the sea shall tell those things."},{"num":9,"verse":"Who knoweth not that the hand of the Lord made all these things?"},{"num":10,"verse":"In whose hand the soul is of each living thing, and the spirit of each flesh of man. (In whose hand is the soul of each living thing, and the breath of all mankind.)"},{"num":11,"verse":"Whether the ear deemeth not words, and the cheeks of the eater deem (the) savour, or the taste of meat? (Whether the ear judgeth not the words, like the tongue of the eater judgeth the savour, or the taste, of the food?)"},{"num":12,"verse":"Wisdom is in eld men, and prudence is in much time."},{"num":13,"verse":"Wisdom and strength is with God; he hath counsel and understanding."},{"num":14,"verse":"If he destroyeth, there is no man that buildeth; if he shutteth in a man, there is none that openeth. (If he destroyeth, there is no one who buildeth up again; if he shutteth someone in, there is no one who can release him.)"},{"num":15,"verse":"If he holdeth together (the) waters, all things shall be made dry; and if he sendeth out those waters, they shall destroy the earth."},{"num":16,"verse":"Strength and wisdom is with God; he knoweth both him that deceiveth and him that is deceived."},{"num":17,"verse":"And he bringeth counsellors into a fond end, and judges into wondering, either astonishing. (And he bringeth counsellors to a foolish end, and judges to madness.)"},{"num":18,"verse":"He unbindeth the girdle of kings, and girdeth their reins with a cord."},{"num":19,"verse":"He leadeth their priests without glory, and he deceiveth the principal men;"},{"num":20,"verse":"and he changeth the lips of soothfast men, and taketh away the doctrine of eld men."},{"num":21,"verse":"He sheddeth out despising on princes, and relieveth them, that were oppressed. (He heapeth scorn upon leaders, and weakeneth oppressors.)"},{"num":22,"verse":"He showeth deep things from (out of the) darknesses; and he bringeth forth into (the) light the shadow of death."},{"num":23,"verse":"He multiplieth folks, and he loseth them; and he restoreth them, when they be destroyed, into whole number. (He multiplieth nations, and then he destroyeth them; and then after that they be destroyed, he restoreth them whole again.)"},{"num":24,"verse":"He changeth the heart of [the] princes of the people of [the] earth; and deceiveth them, that they go in vain out of the way (so that they go in vain where there is no way)."},{"num":25,"verse":"They shall grope, as in darknesses, and not in light; and he shall make them to err as drunken men (and he shall make them to wander about like drunken men)."}]