[{"header":"Resurrection and Judgment"},{"num":12,"verse":"“At that time Michael, the great prince who stands guard over the sons of your people, will arise. There will be a time of distress such as has never occurred since the beginning of the nation until then. But at that time your people—everyone who is found written in the book—will be delivered."},{"num":2,"verse":" Multitudes who sleep in the dust of the earth will awake—some to everlasting life, and others to shame and everlasting contempt."},{"num":3,"verse":" Those who are wise will shine like the brightness of the heavenly expanse. And those who turn many to righteousness will be like the stars forever and ever. "},{"num":4,"verse":"But you, Daniel, close up the words and seal the book until the time of the end. Many will run back and forth and knowledge will increase.’"},{"header":"The Final Outcome"},{"num":5,"verse":"Then I, Daniel, looked and behold, two others stood there, one on this bank of the river and the one on the other bank of the river. "},{"num":6,"verse":"One said to the man clothed in linen, who was above the waters of the river, “How long until the end of the wondrous things?”"},{"num":7,"verse":"Then I heard the man clothed in linen, who was above the waters of the river, as he raised both his right and left hands toward heaven and swore an oath by Him who lives forever, saying, “It is for a time, times, and a half. Then when the breaking of the power of the holy people comes to an end, all these things will be finished.”"},{"num":8,"verse":"Now I heard, but I did not understand. So I said, ‘My Lord, what will be the outcome of these things?’"},{"num":9,"verse":"Then he said: “Go your way, Daniel. For the words are closed up and sealed until the time of the end. "},{"num":10,"verse":"Many will be purified, made spotless and refined, but the wicked will act wickedly. None of the wicked will understand, but the wise will understand."},{"num":11,"verse":"“From the time that the daily burnt offering is taken away, and abomination of desolation is set up, there will be 1,290 days. "},{"num":12,"verse":"Happy is the one who keeps waiting, and reaches the 1,335 days."},{"num":13,"verse":" But you, go your way till the end. You will rest and then at the end of days you will arise to receive your portion.”"}]