[{"num":50,"verse":"1 Because the Church is always full of hypocrites, 8 which do imagine that God will be worshipped with outward ceremonies only without the heart: and especially the Jews were of this opinion, because of their figures and ceremonies of the Law, thinking that their sacrifices were sufficient. 21 Therefore the Prophet doth reprove this gross error, and pronounceth the Name of God to be blasphemed where holiness is set in ceremonies. 23 For he declareth the worship of God to be spiritual, whereof are two principal parts, invocation and thanksgiving."},{"num":1,"verse":"The God of gods, even the Lord hath spoken and called the earth from the rising up of the Sun, unto the going down thereof."},{"num":2,"verse":"Out of Zion, which is the perfection of beauty, hath God shined."},{"num":3,"verse":"Our God shall come, and shall not keep silence: a fire shall devour before him, and a mighty tempest shall be moved round about him."},{"num":4,"verse":"He shall call the heaven above, and the earth to judge his people."},{"num":5,"verse":"Gather my Saints together unto me, those that make a covenant with me with sacrifice."},{"num":6,"verse":"And the heavens shall declare his righteousness: for God is Judge himself. Selah."},{"num":7,"verse":"Hear, O my people and I will speak: hear, O Israel, and I will testify unto thee: for I am God, even thy God."},{"num":8,"verse":"I will not reprove thee for thy sacrifices, or thy burnt offerings, that have not been continually before me."},{"num":9,"verse":"I will take no bullock out of thine house, nor goats out of thy folds."},{"num":10,"verse":"For all the beasts of the forest are mine, and the beasts on a thousand mountains."},{"num":11,"verse":"I know all the fowls on the mountains, and the wild beasts of the field are mine."},{"num":12,"verse":"If I be hungry, I will not tell thee: for the world is mine and all that therein is."},{"num":13,"verse":"Will I eat the flesh of bulls? or drink the blood of goats?"},{"num":14,"verse":"Offer unto God praise, and pay thy vows unto the most High,"},{"num":15,"verse":"And call upon me in the day of trouble: so will I deliver thee, and thou shalt glorify me."},{"num":16,"verse":"But unto the wicked said God, What hast thou to do to declare mine ordinances, that thou shouldest take my covenant in thy mouth,"},{"num":17,"verse":"Seeing thou hatest to be reformed, and hast cast my words behind thee?"},{"num":18,"verse":"For when thou seest a thief, thou runnest with him, and thou art partaker with the adulterers."},{"num":19,"verse":"Thou givest thy mouth to evil, and with thy tongue thou forgest deceit."},{"num":20,"verse":"Thou sittest, and speakest against thy brother, and slanderest thy mother’s son."},{"num":21,"verse":"These things hast thou done, and I held my tongue: therefore thou thoughtest that I was like thee: but I will reprove thee, and set them in order before thee."},{"num":22,"verse":"Oh consider this ye that forget God, lest I tear you in pieces, and there be none that can deliver you."},{"num":23,"verse":"He that offereth praise, shall glorify me: and to him that disposeth his way aright, will I show the salvation of God."}]