[{"header":"God Decides Right from Wrong"},{"num":50,"verse":"The Powerful One, God, the Lord, has spoken. And He calls the earth from where the sun rises to where the sun goes down. "},{"num":2,"verse":"God shines from Zion, perfect in beauty. "},{"num":3,"verse":"May our God come and not keep quiet. A fire burns before Him, and around Him is a powerful storm. "},{"num":4,"verse":"He calls the heavens above, and the earth, that He may judge His people: "},{"num":5,"verse":"“Gather My holy ones to Me, those who have made an agreement with Me by their gifts given on an altar.” "},{"num":6,"verse":"And the heavens will tell how right and good He is, for God Himself is judge."},{"num":7,"verse":"“Listen, O My people, and I will speak. O Israel, I will speak against you. I am God, your God. "},{"num":8,"verse":"I do not speak sharp words to you for your gifts given on an altar. And your burnt gifts are always before Me. "},{"num":9,"verse":"I will not take a young bull out of your house, or male goats out of your fields. "},{"num":10,"verse":"For every animal among the trees is Mine, and the cattle on a thousand hills. "},{"num":11,"verse":"I know every bird of the mountains. And all things that move in the field are Mine. "},{"num":12,"verse":"If I were hungry, I would not tell you. For the world is Mine, and all that is in it. "},{"num":13,"verse":"Should I eat the flesh of bulls, or drink the blood of male goats? "},{"num":14,"verse":"Give a gift of thanks on the altar to God. And pay your promises to the Most High. "},{"num":15,"verse":"Call on Me in the day of trouble. I will take you out of trouble, and you will honor Me.”"},{"num":16,"verse":"But to the sinful, God says: “What right do you have to tell of My Laws, and take My agreement in your mouth? "},{"num":17,"verse":"For you hate to be told what to do, and you throw My words behind you. "},{"num":18,"verse":"When you see a robber, you are pleased with him. And you join those who do sex sins. "},{"num":19,"verse":"You say bad things with your mouth, and you lie with your tongue. "},{"num":20,"verse":"You sit and speak against your brother. You talk against your own mother’s son. "},{"num":21,"verse":"You have done these things, and I have kept quiet. You thought that I was just like you. But I will speak sharp words to you, and tell you who is guilty to your face."},{"num":22,"verse":"“Now think about this, you who forget God, or I will tear you in pieces and there will be no one to save you. "},{"num":23,"verse":"He who gives a gift of thanks honors Me. And to him who makes his way right, I will show him the saving power of God.”"}]