[{"num":1,"verse":"But we, the strong ones, ought to be carrying the weaknesses of the ones not-strong, and not to be pleasing ourselves."},{"header":"Be Pleasing Your Neighbor. For Even Christ Didn’t Please Himself, As It Is Written"},{"num":2,"verse":"Let each of us be pleasing his neighbor for good, toward [his] edification. "},{"num":3,"verse":"For even Christ did not please Himself, but just as it has been written [in Ps 69:9]: “The reproaches of the ones reproaching You fell upon Me”."},{"header":"For Scripture Was Written To Give Us Hope As We Endure In This"},{"num":4,"verse":"For all that was written-before was written for our instruction, in order that we might have hope through endurance and through the encouragement of the Scriptures."},{"header":"May God Help You All To Think The Same Thing, To His Glory"},{"num":5,"verse":"Now may the God of endurance and encouragement grant you to be thinking the same thing among one another according-to Christ Jesus, "},{"num":6,"verse":"in order that with-one-accord you may with one mouth be glorifying the God and Father of our Lord Jesus Christ."},{"header":"Therefore Accept One Another As Christ Has Accepted You, Both Jew And Gentile"},{"num":7,"verse":"Therefore, be accepting one-another, just as Christ also accepted you— for the glory of God. "},{"num":8,"verse":"For I say that Christ has become a servant of the circumcised on behalf of the truth of God, so that He might confirm the promises of  the fathers, "},{"num":9,"verse":"and the Gentiles might glorify God for His mercy just as it has been written: “For this reason I will praise You among the Gentiles and I will sing-praise to Your name” [Ps 18:49]. "},{"num":10,"verse":"And again he says, “Celebrate, Gentiles, with His people” [Deut 32:43]. "},{"num":11,"verse":"And again, “All Gentiles, be praising the Lord, and let all the peoples praise Him” [Ps 117:1]. "},{"num":12,"verse":"And again Isaiah says, “There will be the root of Jesse, even the One rising-up to rule the Gentiles. The Gentiles will put-their-hope upon Him” [Isa 11:10]."},{"header":"Peace And Joy To You All"},{"num":13,"verse":"Now may the God of  hope fill you with all joy and peace in believing, so that you may be abounding in hope by the power of the Holy Spirit."},{"header":"Brothers, I Wrote To You As a Minister of Christ To The Gentiles, Serving The Gospel"},{"num":14,"verse":"Now I am convinced, my brothers— even I myself concerning you— that you yourselves also are full of goodness, having been filled with all knowledge, being able also to admonish one another. "},{"num":15,"verse":"But I wrote more-boldly to you, in part as reminding you again, because of the grace having been given to me by God "},{"num":16,"verse":"so that I might be a minister of Christ Jesus to the Gentiles, performing-priestly-service-for the good-news of God in order that the offering of  the Gentiles might become acceptable, having been sanctified by the Holy Spirit."},{"header":"My Ministry of The Gospel To Gentiles Who Have Not Heard Is My Boast And My Ambition"},{"num":17,"verse":"I then have this boasting in Christ Jesus as to the things pertaining to God— "},{"num":18,"verse":"for I will not dare to speak anything of things which Christ did not accomplish through me in word and deed for the obedience of the Gentiles, "},{"num":19,"verse":"by the power of signs and wonders, by the power of the Spirit of God— so-that from Jerusalem and around as far as Illyricum I have completed the good-news of Christ, "},{"num":20,"verse":"and was thus being ambitious to be announcing-the-good-news where Christ was not named in order that I might not be building upon a foundation belonging-to-another, "},{"num":21,"verse":"but just as it has been written [in Isa 52:15]: “Ones to whom it was not declared concerning Him will see, and they who have not heard will understand”."},{"header":"Pursuing This Ministry, I Hope To Come To You On The Way To Spain"},{"num":22,"verse":"Therefore indeed I was hindered as to many things from coming to you. "},{"num":23,"verse":"But now no longer having a place in these regions, and having a yearning for many years that I should come to you "},{"num":24,"verse":"whenever I am proceeding into Spain— for I hope, while proceeding-through, to see you and to be sent-forward there by you, if I may first be filled in part with your company."},{"header":"But First I Am Going To Jerusalem, Taking a Contribution To The Poor Saints There"},{"num":25,"verse":"But now I am proceeding to Jerusalem, serving the saints. "},{"num":26,"verse":"For Macedonia and Achaia were well-pleased to make a certain contribution for the poor among the saints in Jerusalem. "},{"num":27,"verse":"For they were well-pleased, and they are their debtors. For if the Gentiles shared in their spiritual things, they are indebted also to minister to them in fleshly things. "},{"num":28,"verse":"Having then completed this, and having sealed this fruit to them, I will go through you into Spain. "},{"num":29,"verse":"And I know that while coming to you, I will come in the fullness of the blessing of Christ."},{"header":"Pray For Me, Brothers"},{"num":30,"verse":"Now I appeal-to you, brothers, through our Lord Jesus Christ and through the love of  the Spirit, to struggle-with me in your prayers to God for me— "},{"num":31,"verse":"that I may be delivered from the ones disobeying in Judea, and that my service for Jerusalem may prove-to-be acceptable to the saints, "},{"num":32,"verse":"in order that having come in joy to you by the will of God, I may rest-up-with you. "},{"num":33,"verse":"Now the God of peace be with you all, amen."}]