[{"num":15,"verse":"So those of us who have a strong faith must be patient with the weaknesses of those whose faith is not so strong. We must not think only of ourselves. "},{"num":2,"verse":"We should all be concerned about our neighbor and the good things that will build his faith. "},{"num":3,"verse":"Christ did not think only of himself. Rather, as Scripture says, “The insults of those who insult you have fallen on me.”"},{"header":"God Gives Us Unity"},{"num":4,"verse":"Everything written long ago was written to teach us so that we would have confidence through the endurance and encouragement which the Scriptures give us. "},{"num":5,"verse":"May God, who gives you this endurance and encouragement, allow you to live in harmony with each other by following the example of Christ Yeshua. "},{"num":6,"verse":"Then, having the same goal, you will praise the God and Father of our Lord Yeshua Christ."},{"num":7,"verse":"Therefore, accept each other in the same way that Christ accepted you. He did this to bring glory to God. "},{"num":8,"verse":"Let me explain. Christ became a servant for the Jewish people to reveal God’s truth. As a result, he fulfilled God’s promise to the ancestors of the Jewish people. "},{"num":9,"verse":"People who are not Jewish praise God for his mercy as well. This is what the Scriptures say,"},{"num":10,"verse":"And Scripture says again,"},{"num":11,"verse":"And again,"},{"num":12,"verse":"Again, Isaiah says,"},{"num":13,"verse":"May God, the source of hope, fill you with joy and peace through your faith in him. Then you will overflow with hope by the power of the Holy Spirit."},{"header":"Paul’s Desire to Tell the Good News to the World"},{"num":14,"verse":"I’m convinced, brothers and sisters, that you, too, are filled with goodness. I’m also convinced that you have all the knowledge you need and that you are able to instruct each other. "},{"num":15,"verse":"However, I’ve written you a letter, parts of which are rather bold, as a reminder to you. I’m doing this because God gave me the gift "},{"num":16,"verse":"to be a servant of Christ Yeshua to people who are not Jewish. I serve as a priest by spreading the Good News of God. I do this in order that I might bring the nations to God as an acceptable offering, made holy by the Holy Spirit. "},{"num":17,"verse":"So Christ Yeshua gives me the right to brag about what I’m doing for God. "},{"num":18,"verse":"I’m bold enough to tell you only what Christ has done through me to bring people who are not Jewish to obedience. By what I have said and done, "},{"num":19,"verse":"by the power of miraculous and amazing signs, and by the power of God’s Spirit, I have finished spreading the Good News about Christ from Jerusalem to Illyricum."},{"num":20,"verse":"My goal was to spread the Good News where the name of Christ was not known. I didn’t want to build on a foundation which others had laid. "},{"num":21,"verse":"As Scripture says,"},{"num":22,"verse":"This is what has so often kept me from visiting you. "},{"num":23,"verse":"But now I have no new opportunities for work in this region. For many years I have wanted to visit you. "},{"num":24,"verse":"Now I am on my way to Spain, so I hope to see you when I come your way. After I have enjoyed your company for a while, I hope that you will support my trip to Spain."},{"num":25,"verse":"Right now I’m going to Jerusalem to bring help to the Christians there. "},{"num":26,"verse":"Because the believers in Macedonia and Greece owe a debt to the Christians in Jerusalem, they have decided to take up a collection for the poor among the Christians in Jerusalem. "},{"num":27,"verse":"These Macedonians and Greeks have shared the spiritual wealth of the Christians in Jerusalem. So they are obligated to use their earthly wealth to help them."},{"num":28,"verse":"When the collection is completed and I have officially turned the money over to the Christians in Jerusalem, I will visit you on my way to Spain. "},{"num":29,"verse":"I know that when I come to you I will bring the full blessing of Christ."},{"num":30,"verse":"Brothers and sisters, I encourage you through our Lord Yeshua Christ and by the love that the Spirit creates, to join me in my struggle. Pray to God for me "},{"num":31,"verse":"that I will be rescued from those people in Judea who refuse to believe. Pray that God’s people in Jerusalem will accept the help I bring. "},{"num":32,"verse":"Also pray that by the will of God I may come to you with joy and be refreshed when I am with you."},{"num":33,"verse":"May the God of peace be with you all. Amen."}]