[[],[{"type":"header","content":"One Sacrifice of Christ Is Sufficient"},{"type":"prose","content":"For since the Law has only a shadow [just a pale representation] of the good things to come—not the very image of those things—it can never, by offering the same sacrifices continually year after year, make perfect those who approach [its altars]. "}],[{"type":"prose","content":"For if it were otherwise, would not these sacrifices have stopped being offered? For the worshipers, having once [for all time] been cleansed, would no longer have a consciousness of sin. "}],[{"type":"prose","content":"But [as it is] these [continual]  bring a fresh reminder of sins [to be atoned for] year after year, "}],[{"type":"prose","content":"for it is impossible for the blood of bulls and goats to take away sins. "}],[{"type":"prose","content":"Therefore, when Christ enters into the world, He says,"}],[{"type":"prose","content":"After saying [in the citation] above, “YOU HAVE NEITHER DESIRED, NOR HAVE YOU TAKEN DELIGHT IN SACRIFICES AND OFFERINGS AND WHOLE BURNT OFFERINGS AND  FOR SIN” which are offered according to the Law "}],[{"type":"prose","content":"then He said, “BEHOLD, I HAVE COME TO DO YOUR WILL.” [And so] He does away with the first [covenant as a means of atoning for sin based on animal sacrifices] so that He may inaugurate  establish the second [covenant by means of obedience]. "}],[{"type":"prose","content":"And in accordance with this will [of God] we [who believe in the message of salvation] have been sanctified [that is, set apart as holy for God and His purposes] through the offering of the body of Jesus Christ (the Messiah, the Anointed) once for all."}],[{"type":"prose","content":"Every priest stands [at his altar of service] ministering daily, offering the same sacrifices over and over, which are never able to strip away sins [that envelop and cover us]; "}],[{"type":"prose","content":"whereas Christ, having offered the one sacrifice [the all-sufficient sacrifice of Himself] for sins for all time, SAT DOWN [signifying the completion of atonement for sin] AT THE RIGHT HAND OF GOD [the position of honor], "}],[{"type":"prose","content":"waiting from that time onward UNTIL HIS ENEMIES ARE MADE A FOOTSTOOL FOR HIS FEET. "}],[{"type":"prose","content":"For by the one offering He has perfected forever  completely cleansed those who are being sanctified [bringing each believer to spiritual completion and maturity]. "}],[{"type":"prose","content":"And the Holy Spirit also adds His testimony to us [in confirmation of this]; for after having said,,"}],[{"type":"prose","content":"Now where there is [absolute] forgiveness  complete cancellation of the penalty of these things, there is no longer any offering [to be made to atone] for sin."}],[{"type":"header","content":"A New and Living Way"},{"type":"prose","content":"Therefore, believers, since we have confidence  full freedom to enter the Holy Place [the place where God dwells] by [means of] the blood of Jesus, "}],[{"type":"prose","content":"by this new and living way which He initiated  opened for us through the veil [as in the Holy of Holies], that is, through His flesh, "}],[{"type":"prose","content":"and since we have a great  wonderful Priest [Who rules] over the house of God, "}],[{"type":"prose","content":"let us approach [God] with a true  sincere heart in unqualified assurance of faith, having had our hearts sprinkled  from an evil conscience and our bodies washed with pure water. "}],[{"type":"prose","content":"Let us seize  hold tightly the confession of our hope without wavering, for He who promised is reliable  trustworthy  faithful [to His word]; "}],[{"type":"prose","content":"and let us consider [thoughtfully] how we may encourage one another to love and to do good deeds, "}],[{"type":"prose","content":"not forsaking our meeting together [as believers for worship and instruction], as is the habit of some, but encouraging ; and all the more [faithfully] as you see the day [of Christ’s return] approaching."}],[{"type":"header","content":"Christ or Judgment"},{"type":"prose","content":"For if we go on willfully  deliberately sinning after receiving the knowledge of the truth, there no longer remains a sacrifice [to atone] for our sins [that is, no further offering to anticipate], "}],[{"type":"prose","content":"but a kind of awful  terrifying expectation of [divine] judgment and THE FURY OF A FIRE  BURNING WRATH WHICH WILL CONSUME THE ADVERSARIES [those who put themselves in opposition to God]. "}],[{"type":"prose","content":"Anyone who has ignored  set aside the Law of Moses is put to death without mercy on  two or three witnesses. "}],[{"type":"prose","content":"How much greater punishment do you think he will deserve who has rejected  trampled under foot the Son of God, and has considered unclean  common the blood of the covenant that sanctified him, and has insulted the Spirit of grace [who imparts the unmerited favor and blessing of God]? "}],[{"type":"prose","content":"For we know Him who said, “VENGEANCE IS MINE [retribution and the deliverance of justice rest with Me], I WILL REPAY [the wrongdoer].” And again, “THE LORD WILL JUDGE HIS PEOPLE.” "}],[{"type":"prose","content":"It is a fearful  terrifying thing to fall into the hands of the living God [incurring His judgment and wrath]."}],[{"type":"prose","content":"But remember the earlier days, when, after being [spiritually] enlightened, you [patiently] endured a great conflict of sufferings, "}],[{"type":"prose","content":"sometimes by being made a spectacle, publicly exposed to insults and distress, and sometimes by becoming companions with those who were so treated. "}],[{"type":"prose","content":"For you showed sympathy  deep concern for those who were imprisoned, and you joyfully accepted the [unjust] seizure of your belongings  the confiscation of your property, conscious of the fact that you have a better possession and a lasting one [prepared for you in heaven]. "}],[{"type":"prose","content":"Do not, therefore, fling away your [fearless] confidence, for it has a glorious  great reward. "}],[{"type":"prose","content":"For you have need of patient endurance [to bear up under difficult circumstances without compromising], so that when you have carried out the will of God, you may receive  enjoy to the full what is promised."}],[{"type":"prose","content":"But our way is not that of those who shrink back to destruction, but [we are] of those who believe [relying on God through faith in Jesus Christ, the Messiah]  by this confident faith preserve the soul."}]]