[{"num":10,"verse":"The old system of Jewish laws gave only a dim foretaste of the good things Christ would do for us. The sacrifices under the old system were repeated again and again, year after year, but even so they could never save those who lived under their rules. "},{"num":2,"verse":"If they could have, one offering would have been enough; the worshipers would have been cleansed once for all and their feeling of guilt would be gone."},{"num":3,"verse":"But just the opposite happened: those yearly sacrifices reminded them of their disobedience and guilt instead of relieving their minds. "},{"num":4,"verse":"For it is not possible for the blood of bulls and goats really to take away sins."},{"num":5,"verse":"That is why Christ said as he came into the world, “O God, the blood of bulls and goats cannot satisfy you, so you have made ready this body of mine for me to lay as a sacrifice upon your altar. "},{"num":6,"verse":"You were not satisfied with the animal sacrifices, slain and burnt before you as offerings for sin. "},{"num":7,"verse":"Then I said, ‘See, I have come to do your will, to lay down my life, just as the Scriptures said that I would.’”"},{"num":8,"verse":"After Christ said this about not being satisfied with the various sacrifices and offerings required under the old system, "},{"num":9,"verse":"he then added, “Here I am. I have come to give my life.”"},{"num":10,"verse":"Under this new plan we have been forgiven and made clean by Christ’s dying for us once and for all."},{"num":11,"verse":"Under the old agreement the priests stood before the altar day after day offering sacrifices that could never take away our sins. "},{"num":12,"verse":"But Christ gave himself to God for our sins as one sacrifice for all time and then sat down in the place of highest honor at God’s right hand, "},{"num":13,"verse":"waiting for his enemies to be laid under his feet. "},{"num":14,"verse":"For by that one offering he made forever perfect in the sight of God all those whom he is making holy."},{"num":15,"verse":"And the Holy Spirit testifies that this is so, for he has said, "},{"num":16,"verse":"“This is the agreement I will make with the people of Israel, though they broke their first agreement: I will write my laws into their minds so that they will always know my will, and I will put my laws in their hearts so that they will want to obey them.” "},{"num":17,"verse":"And then he adds, “I will never again remember their sins and lawless deeds.”"},{"num":18,"verse":"Now, when sins have once been forever forgiven and forgotten, there is no need to offer more sacrifices to get rid of them."},{"num":19,"verse":"And so, dear brothers, now we may walk right into the very Holy of Holies, where God is, because of the blood of Jesus. "},{"num":20,"verse":"This is the fresh, new, life-giving way that Christ has opened up for us by tearing the curtain—his human body—to let us into the holy presence of God."},{"num":21,"verse":"And since this great High Priest of ours rules over God’s household, "},{"num":22,"verse":"let us go right in to God himself, with true hearts fully trusting him to receive us because we have been sprinkled with Christ’s blood to make us clean and because our bodies have been washed with pure water."},{"num":23,"verse":"Now we can look forward to the salvation God has promised us. There is no longer any room for doubt, and we can tell others that salvation is ours, for there is no question that he will do what he says."},{"num":24,"verse":"In response to all he has done for us, let us outdo each other in being helpful and kind to each other and in doing good."},{"num":25,"verse":"Let us not neglect our church meetings, as some people do, but encourage and warn each other, especially now that the day of his coming back again is drawing near."},{"num":26,"verse":"If anyone sins deliberately by rejecting the Savior after knowing the truth of forgiveness, this sin is not covered by Christ’s death; there is no way to get rid of it. "},{"num":27,"verse":"There will be nothing to look forward to but the terrible punishment of God’s awful anger, which will consume all his enemies. "},{"num":28,"verse":"A man who refused to obey the laws given by Moses was killed without mercy if there were two or three witnesses to his sin. "},{"num":29,"verse":"Think how much more terrible the punishment will be for those who have trampled underfoot the Son of God and treated his cleansing blood as though it were common and unhallowed, and insulted and outraged the Holy Spirit who brings God’s mercy to his people."},{"num":30,"verse":"For we know him who said, “Justice belongs to me; I will repay them”; who also said, “The Lord himself will handle these cases.” "},{"num":31,"verse":"It is a fearful thing to fall into the hands of the living God."},{"num":32,"verse":"Don’t ever forget those wonderful days when you first learned about Christ. Remember how you kept right on with the Lord even though it meant terrible suffering. "},{"num":33,"verse":"Sometimes you were laughed at and beaten, and sometimes you watched and sympathized with others suffering the same things. "},{"num":34,"verse":"You suffered with those thrown into jail, and you were actually joyful when all you owned was taken from you, knowing that better things were awaiting you in heaven, things that would be yours forever."},{"num":35,"verse":"Do not let this happy trust in the Lord die away, no matter what happens. Remember your reward! "},{"num":36,"verse":"You need to keep on patiently doing God’s will if you want him to do for you all that he has promised. "},{"num":37,"verse":"His coming will not be delayed much longer. "},{"num":38,"verse":"And those whose faith has made them good in God’s sight must live by faith, trusting him in everything. Otherwise, if they shrink back, God will have no pleasure in them."},{"num":39,"verse":"But we have never turned our backs on God and sealed our fate. No, our faith in him assures our souls’ salvation."}]