[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Many people shall go and say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—What was precious to the prophet’s heart was the thought that these pilgrims from afar would not come as with a formal worship like that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:10-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but, like the queen of Sheba (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 10:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as seekers after truth, desiring to be taught. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The “ways” and the “paths” are the great laws of righteousness, which lead to the eternal life. The verb for “teach” is the root of the Hebrew for “law,” as the “teaching” of Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall go forth the law . . .—In the preaching of the Christ, in the mission of the Twelve, in the whole history of the Apostolic Church, we have, to say the least, an adequate fulfilment of the promise. The language of St. Paul, however, suggests that there may be in the future a yet more glorious mission, of which Jerusalem shall once more be the centre (Romans 11:12-15).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall go forth the law ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". . .—In the preaching of the Christ, in the mission of the Twelve, in the whole history of the Apostolic Church, we have, to say the least, an adequate fulfilment of the promise. The language of St. Paul, however, suggests that there may be in the future a yet more glorious mission, of which Jerusalem shall once more be the centre (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:12-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 2:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And many people shall go ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Shall not only have some weak desires of going, but shall take pains, and actually go; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and say, Come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Yea, such shall be their zeal, that they shall not only go themselves, but shall persuade and press others to go with them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And we will walk in his paths ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thus they show the truth of their conversion, by their hearty desire to be instructed in the way of worshipping and serving God acceptably, and by their firm purpose of practising the instructions given. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For out of Zion shall go forth the law ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The new law, the doctrine of the gospel, which is frequently called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "because it hath the nature and power of a law, obliging us no less to the belief and practice of it than the old law did; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the word of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For the accomplishment of this promise, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This last clause shows the reason why the people should be so forward to go, and to invite others to go with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-9 The calling of the Gentiles, the spread of the gospel, and that far more extensive preaching of it yet to come, are foretold. Let Christians strengthen one another, and support one another. It is God who teaches his people, by his word and Spirit. Christ promotes peace, as well as holiness. If all men were real Christians, there could be no war; but nothing answering to these expressions has yet taken place on the earth. Whatever others do, let us walk in the light of this peace. Let us remember that when true religion flourishes, men delight in going up to the house of the Lord, and in urging others to accompany them. Those are in danger who please themselves with strangers to God; for we soon learn to follow the ways of persons whose company we keep. It is not having silver and gold, horses and chariots, that displeases God, but depending upon them, as if we could not be safe, and easy, and happy without them, and could not but be so with them. Sin is a disgrace to the poorest and the lowest. And though lands called Christian are not full of idols, in the literal sense, are they not full of idolized riches? and are not men so busy about their gains and indulgences, that the Lord, his truths, and precepts, are forgotten or despised?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And many people shall go - This denotes a prevalent \"desire\" to turn to the true God, and embrace the true religion. It is remarkable that it speaks of an inclination among them to \"seek\" God, as if they were satisfied of the folly and danger of their ways, and felt the necessity of obtaining a better religion. In many cases this has occurred. Thus, in modern times, the people of the Sandwich Islands threw away their gods and remained without any religion, as if waiting for the message of life. Thus, too, the pagan not unfreguently come from a considerable distance at missionary stations to be instructed, and to receive the Bible and tracts. Perhaps this is to be extensively the mode in which Christianity is to be spread. God, who has all power over human hearts, may excite the pagan to anxious inquiry; may show them the folly of their religion; and may lead them to this \"preparation\" to embrace the gospel, and this disposition to \"go\" and seek it. He has access to all people. By a secret influence on the understanding, the heart, and the conscience of the pagan, he can convince them of the folly of idolatry and its vices. He can soften down their prejudices in favor of their long-established systems; can break down the barriers between them and Christians; and can dispose them to receive with joy the messengers of salvation. He can raise up, among the pagan themselves, reformers, who shall show them the folly of their systems. It cannot be doubted that the universal triumph of the gospel will be preceded by some such remarkable preparation among the nations; by a secret, silent, but most mighty influence from God on the pagan generally, that shall loosen their hold on idolatry, and dispose them to welcome the gospel. And the probability that this state of things exists already, and will more and more, should be an inducement to Christians to make more vigorous efforts to send every where the light of life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He will teach us of his ways - He will make us acquainted with his will, and with the doctrines of the true religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For out of Zion - These are the words of the \"prophet,\" not of the people. The prophet declares that the law would go from Zion; that is, Zion would be the center from which it would be spread abroad; see the note at Isaiah 1:8. Zion is put here for Jerusalem, and means that the message of mercy to mankind would be spread \"from\" Jerusalem. Hence, the Messiah commanded his disciples to tarry 'in Jerusalem until they should be endued with power from on high.' Luke 24:49. Hence, also, he said that repentance and remission of sins should 'be preached among all nations, beginning at Jerusalem' - perhaps referring to this very passage in Isaiah; Luke 24:47.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For out of Zion - These are the words of the \"prophet,\" not of the people. The prophet declares that the law would go from Zion; that is, Zion would be the center from which it would be spread abroad; see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Zion is put here for Jerusalem, and means that the message of mercy to mankind would be spread \"from\" Jerusalem. Hence, the Messiah commanded his disciples to tarry 'in Jerusalem until they should be endued with power from on high.' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hence, also, he said that repentance and remission of sins should 'be preached among all nations, beginning at Jerusalem' - perhaps referring to this very passage in Isaiah; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The law - This is put here for the doctrines of the true religion in general. The law or will of God, under the reign of the Messiah, would proceed from Zion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The word of the Lord - The message of his mercy to mankind; that which he has \"spoken\" respecting the salvation of men. The truth which is here taught is, \"that Zion or the church is the source of religious truth, and the center of religious influence in the world.\" This is true in the following respects:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Zion was the source of religious truth to the ancient world. Knowledge was gained by travel; and it is capable of about as clear demonstration as any fact of ancient history, that no inconsiderable part of the knowledge pertaining to God in ancient Greece was obtained by contact with the sages of distant lands, and that the truths held in Zion or Jerusalem thus radiated from land to land, and mind to mind.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) The church is now the center of religious truth to the world around it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The world by its philosophy never originates a system of religion which it is desirable to retain, and which conveys any just view of God or the way of salvation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The most crude, unsettled, contradictory, and vague opinions on religion prevail in this community called 'the world.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) If \"in\" this community there are any opinions that are true and valuable, they can in most instances be traced to \"the church.\" They are owing to the influence of the pulpit; or to an early training in the Bible; or to early teaching in the Sabbath-school, or to the instructions of a pious parent, or to the \"general\" influence which Christianity exerts on the community.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) The church holds the power of \"reformation\" in her hands, every cause of morals advancing or retarding as she enters into the work, or as she withdraws from it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) The pagan world is dependent on the church for the knowledge of the true religion. There are \"no\" systems of truth that start up on a pagan soil. There is no elastic energy in a pagan mind. There is no recuperative power to bring it back to God. There is no \"advance\" made toward the truth in any pagan community. There is no well-spring of life to purify the soul. The effect of time is only to deepen the darkness, and to drive them farther from God. They only worship mere shapeless blocks; they bow down before worse looking idols; they enter less elegant and more polluted temples. The idols of the pagan are not constructed with half the skill and taste evinced two thousand years ago; nor are their temples built with such exquisite art. No idol of the pagan world now can compare with the statue of Minerva at Athens; no temple can be likened to the Parthenon; no sentiment of paganism in China, India, or Africa, can be compared with the views of the sages of Greece. The pagan world is becoming worse and worse, and if ever brought to better views, it must be by a \"foreign\" influence; and that influence will not go forth from philosophy or science, but \"from the church.\" If light is ever to spread, it is to go forth from Zion; and the world is dependent on \"the church\" for any just knowledge of God and of the way to life, The 'law is to go forth from Zion;' and the question whether the million of the human family are to be taught the way to heaven, is just a question whether the church can be roused to diffuse abroad the light which has arisen on her. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) The pagan world is dependent on the church for the knowledge of the true religion. There are \"no\" systems of truth that start up on a pagan soil. There is no elastic energy in a pagan mind. There is no recuperative power to bring it back to God. There is no \"advance\" made toward the truth in any pagan community. There is no well-spring of life to purify the soul. The effect of time is only to deepen the darkness, and to drive them farther from God. They only worship mere shapeless blocks; they bow down before worse looking idols; they enter less elegant and more polluted temples. The idols of the pagan are not constructed with half the skill and taste evinced two thousand years ago; nor are their temples built with such exquisite art. No idol of the pagan world now can compare with the statue of Minerva at Athens; no temple can be likened to the Parthenon; no sentiment of paganism in China, India, or Africa, can be compared with the views of the sages of Greece. The pagan world is becoming worse and worse, and if ever brought to better views, it must be by a \"foreign\" influence; and that influence will not go forth from philosophy or science, but \"from the church.\" If light is ever to spread, it is to go forth from Zion; and the world is dependent on \"the church\" for any just knowledge of God and of the way to life, The 'law is to go forth from Zion;' and the question whether the million of the human family are to be taught the way to heaven, is just a question whether the church can be roused to diffuse abroad the light which has arisen on her. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. If the curse foretold against Israel has been literally fulfilled, so shall the promised blessing be literal. We Gentiles must not, while giving them the curse, deny them their peculiar blessing by spiritualizing it. The Holy Ghost shall be poured out for a general conversion then (Jer 50:5; Zec 8:21, 23; Joe 2:28).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from Jerusalem—(Lu 24:47) an earnest of the future relations of Jerusalem to Christendom (Ro 11:12, 15).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall go; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall not only have some weak desires of going, but shall be ready to take pains, and shall actually go. And say; such shall be their zeal, that they shall not only go themselves, but shall persuade and press others to go with them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We will walk in his paths; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they show the truth of their conversion by their hearty desire to be structed in the way or method of worshipping and serving God acceptably, and by their firm purpose of practising the instructions given to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this last clause contains the reason why the people should be so forward to go, and to invite others to go with them; and they may be the words either of the people, continuing their speech; or of the prophet, now returning to speak in his own name. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The law; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the new law, the doctrine of the gospel, which is frequently called a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because it hath the nature and power of a law, obliging us no less to the belief and practice of it than the old law did. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The word of the Lord from Jerusalem:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the accomplishment of this promise, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 24:47 Acts 1:8 Romans 10:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And many people shall go and say,.... This is a prophecy of the numerous conversions among the Gentiles in the latter day, and agrees with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and even the author of the old Nizzachon (p) interprets it of the gathering of the people to the Messiah. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Come ye, and let us go up to the mountain of the Lord, and to the house of the God of Jacob; the church of Christ, so called; See Gill on Isaiah 2:2. This expresses the concern that truly gracious souls have for the house of God, and his worship in it; they go up to it, considering it both as their duty and their privilege; and which they do frequently and constantly, with much spiritual pleasure, though sometimes with difficulty, finding their account in it, and knowing it is for the glory of God; and not content with so doing themselves, they encourage others to do so likewise; either professors of religion with them, who are negligent and backward through a spirit of slumber and slothfulness on them; through lukewarmness, coldness, and leaving their first love; through an over love to the world, and the things of it; and through a vain conceit of themselves, as being as knowing as their teachers, or wiser than they: or else such who have made no profession, who are quite ignorant of divine things, these they endeavour to bring with them, out of love to their souls, that they may be under the means of grace, in order to their conversion; and such as are inquiring the way to Zion, with their faces toward it, these they encourage to join with them in holy fellowship; and in all they set an example by a constant attendance themselves; they do not stir them up to go alone, either one or other, but propose to go with them. See Psalm 122:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Come ye, and let us go up to the mountain of the Lord, and to the house of the God of Jacob; the church of Christ, so called; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This expresses the concern that truly gracious souls have for the house of God, and his worship in it; they go up to it, considering it both as their duty and their privilege; and which they do frequently and constantly, with much spiritual pleasure, though sometimes with difficulty, finding their account in it, and knowing it is for the glory of God; and not content with so doing themselves, they encourage others to do so likewise; either professors of religion with them, who are negligent and backward through a spirit of slumber and slothfulness on them; through lukewarmness, coldness, and leaving their first love; through an over love to the world, and the things of it; and through a vain conceit of themselves, as being as knowing as their teachers, or wiser than they: or else such who have made no profession, who are quite ignorant of divine things, these they endeavour to bring with them, out of love to their souls, that they may be under the means of grace, in order to their conversion; and such as are inquiring the way to Zion, with their faces toward it, these they encourage to join with them in holy fellowship; and in all they set an example by a constant attendance themselves; they do not stir them up to go alone, either one or other, but propose to go with them. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 122:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he will teach us of his ways: that is, the Lord the God of Jacob, the covenant God and Father of his church and people, who often in this prophecy go by the name of Jacob; he is the teacher, and there is none teacheth like him; and happy are they who are taught of God, and who have heard and learnt of the Father, and come to Christ: he taught men by his Son, when here on earth; who was a teacher that came from God, taught the way of God in truth, and with authority, as the Scribes and Pharisees did not: and then by his Spirit, sent after him to teach all things, and bring all things to remembrance; and since by his apostles and ministers, who have gifts, and a commission to teach men; though all human teachings are of no avail, without a divine blessing, unless accompanied with the anointing, which teacheth all things; and which will be abundantly bestowed in the latter day, when all the children of Zion, and that come to the house of the Lord, will be taught of God. Kimchi says, the teacher here is the King Messiah; the \"us\" to be taught are Gentiles, aliens from the commonwealth of Israel, and strangers to the covenants of promise, whom Christ, under the Gospel dispensation, has given his ministers a commission to teach; and here design such as are humble souls, and sensible of their ignorance, and who know something of Christ, and believe in him; yet, as they know but in part, they desire to know more. The things taught them are the \"ways\" of the Lord; his ways of love, grace, and mercy, in the salvation of men; the steps he took in eternity towards it, by consulting and contriving the best method of it, forming it in his Son, and agreeing with him in covenant about it, and choosing the persons in him he designed to save: and also his goings forth in time, by sending his Son into this world, to obtain salvation for them, and his Spirit into their hearts, to apply it to them; likewise the ways which he prescribes and directs his people to walk in, such as the ordinances of the Gospel, and every path of duty: and the place where these are taught is the church of God, and to this school all that desire to learn should go; and there is ever something more and more of these ways to be learnt; for they are not all learnt at once, only part of his ways; and it is but a small portion, we know of these in the present state, which God has taken in order to bring about our salvation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And we will walk in his paths; in Christ, the way, by faith, and in all his ordinances and paths of duty, according to the rule of his word; in imitation of him, and as he walked; in a dependence on his wisdom, grace, and strength, continuing therein; for walking is a progressive motion, and designs a series and course of obedience and perseverance in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for out of Zion shall go forth the law, and the word of the Lord from Jerusalem; by which is meant the law or doctrine of the Messiah, Isaiah 42:4 for the Hebrew word signifies any doctrine, and so the evangelical one, the law or doctrine of faith, of justification by faith in Christ's righteousness, Romans 3:27 together with all other doctrines of the same kind; called the \"word of the Lord\", which the Lord Christ is the author, preacher, sum, and substance of; the word of righteousness, peace, reconciliation, life, and salvation by him. This first began according to his commission and direction to be preached at Jerusalem, and from thence it went forth into all the world; and it is in Zion, in the church of God, it is now preached, and will be more clearly and fully in the latter day; and so is an argument and an encouraging reason to engage persons to go up thither and hear it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for out of Zion shall go forth the law, and the word of the Lord from Jerusalem; by which is meant the law or doctrine of the Messiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the Hebrew word signifies any doctrine, and so the evangelical one, the law or doctrine of faith, of justification by faith in Christ's righteousness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " together with all other doctrines of the same kind; called the \"word of the Lord\", which the Lord Christ is the author, preacher, sum, and substance of; the word of righteousness, peace, reconciliation, life, and salvation by him. This first began according to his commission and direction to be preached at Jerusalem, and from thence it went forth into all the world; and it is in Zion, in the church of God, it is now preached, and will be more clearly and fully in the latter day; and so is an argument and an encouraging reason to engage persons to go up thither and hear it. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Apud Wagenseil. Tela ignea, p. 29. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Apud Wagenseil. Tela ignea, p. 29. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And many people shall go and say, Come ye, and let us go up to {d} the mountain of the LORD, to the house of the God of Jacob; and he will teach us of his ways, and we will walk in his paths: for out of Zion shall go forth the {e} law, and the word of the LORD from {f} Jerusalem.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And many people shall go and say, Come ye, and let us go up to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the mountain of the LORD, to the house of the God of Jacob; and he will teach us of his ways, and we will walk in his paths: for out of Zion shall go forth the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " law, and the word of the LORD from ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jerusalem.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Alluding to mount Zion, where the visible Church then was.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Meaning, the whole doctrine of salvation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) This was accomplished when the gospel was first preached in Jerusalem, and from there went through all the world.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The conflux of nations explained by the desire, everywhere expressed, to know and practise the ways of Jehovah. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and he will teach us … and we will walk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that He may teach us … and that we may walk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verb for “teach” is that from which the noun “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tôrâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is derived; hence the instruction must be conceived as communicated through the agency of prophets like Isaiah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of his ways",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The preposition has a partitive sense (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): “somewhat of his ways”; each people receiving such direction as is adapted to its peculiar circumstances. The “ways” and “paths” of Jehovah, denoting the revealed principles and maxims of religion and ethics, are figures too frequent in the O.T. to need detailed references.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for out of Zion … Jerusalem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These may be either words of the prophet, looking into the future, or of the peoples themselves as they exhort one another to go up to Jerusalem. In the latter case the verbs should be rendered in the present tense. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tôrâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Many people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "many peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Shall go",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Shall go",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "set forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet means to represent the nations as encouraging one another on the way. There is no jealousy among them, for the \"mountain\" can hold them all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He will teach us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The nations feel their ignorance of God, and their need of \"teaching.\" God alone can teach them concerning himself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:33, 34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 2:10, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and \"he will teach\" them, either directly, as the Incarnate Son, or indirectly through those whom he has appointed to be \"teachers\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of his ways",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"some of his ways,\" not \"all of them;\" for at present \"we know in part\" only (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the greater portion of his ways are \"past finding out\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The \"ways\" here spoken of are, no doubt, rules for the conduct of life, which are practically inexhaustible. God, however, will teach every man, who honestly seeks to learn, enough to enable him to \"walk in his paths.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Out of Zion shall go forth the Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "instruction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "teaching",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "torah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is without the article. The instruction intended is that of the Church of God. Isaiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And peoples in multitude go and say, Come, let us go up to the mountain of Jehovah, to the house of the God of Jacob; let Him instruct us out of His ways, and we will walk in His paths.\" This is their signal for starting, and their song by the way (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What urges them on is the desire for salvation. Desire for salvation expresses itself in the name they give to the point towards which they are travelling: they call Moriah \"the mountain of Jehovah,\" and the temple upon it \"the house of the God of Jacob.\" Through frequent use, Israel had become the popular name for the people of God; but the name they employ is the choicer name Jacob, which is the name of affection in the mouth of Micah, of whose style we are also reminded by the expression \"many peoples\" (ammim rabbim). Desire for salvation expresses itself in the object of their journey; they wish Jehovah to teach them \"out of His ways,\" - a rich source of instruction with which they desire to be gradually entrusted. The preposition min (out of, or from) is not partitive here, but refers, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the source of instruction. The \"ways of Jehovah\" are the ways which God Himself takes, and by which men are led by Him - the revealed ordinances of His will and action. Desire for salvation also expresses itself in the resolution with which they set out: they not only wish to learn, but are resolved to act according to what they learn. \"We will walk in His paths:\" the hortative is used here, as it frequently is (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vid., Ges. 128, 1, c), to express either the subjective intention or subjective conclusion. The words supposed to be spoken by the multitude of heathen going up to Zion terminate here. The prophet then adds the reason and object of this holy pilgrimage of the nations: \"For instruction will go out from Zion, and the word of Jehovah from Jerusalem.\" The principal emphasis is upon the expressions \"from Zion\" and \"from Jerusalem.\" It is a triumphant utterance of the sentiment that \"salvation is of the Jews\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From Zion-Jerusalem there would go forth thorah, i.e., instruction as to the questions which man has to put to God, and debar Jehovah, the word of Jehovah, which created the world at first, and by which it is spiritually created anew. Whatever promotes the true prosperity of the nations, comes from Zion-Jerusalem. There the nations assemble together; they take it thence to their own homes, and thus Zion-Jerusalem becomes the fountain of universal good. For from the time that Jehovah made choice of Zion, the holiness of Sinai was transferred to Zion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which now presented the same aspect as Sinai had formerly done, when God invested it with holiness by appearing there in the midst of myriads of angels. What had been commenced at Sinai for Israel, would be completed at Zion for all the world. This was fulfilled on that day of Pentecost, when the disciples, the first-fruits of the church of Christ, proclaimed the thorah of Zion, i.e., the gospel, in the languages of all the world. It was fulfilled, as Theodoret observes, in the fact that the word of the gospel, rising from Jerusalem \"as from a fountain,\" flowed through the whole of the known world. But these fulfilments were only preludes to a conclusion which is still to be looked for in the future. For what is promised in the following v. is still altogether unfulfilled. ",
        "children": []
      }
    ]
  }
]