[{"header":"Absalom Rebels against David"},{"num":15,"verse":"Some time later, Absalom got himself a chariot with horses to pull it, and he had fifty men run in front. "},{"num":2,"verse":"He would get up early each morning and wait by the side of the road that led to the city gate. Anyone who had a complaint to bring to King David would have to go that way, and Absalom would ask each of them, “Where are you from?”"},{"num":3,"verse":"Absalom would say, “You deserve to win your case. It’s too bad the king doesn’t have anyone to hear complaints like yours. "},{"num":4,"verse":"I wish someone would make me the judge around here! I would be fair to everyone.”"},{"num":5,"verse":"Whenever anyone would come to Absalom and start bowing down, he would reach out and hug and kiss them. "},{"num":6,"verse":"That’s how he treated everyone from Israel who brought a complaint to the king. Soon everyone in Israel liked Absalom better than they liked David."},{"num":7,"verse":"Four years later, Absalom said to David, “Please, let me go to Hebron. I have to keep a promise that I made to the Lord, "},{"num":8,"verse":"when I was living with the Arameans in Geshur. I promised that if the Lord would bring me back to live in Jerusalem, I would worship him in Hebron.”"},{"num":9,"verse":"David gave his permission, and Absalom went to Hebron. "},{"num":10,"verse":"He took two hundred men from Jerusalem with him, but they had no idea what he was going to do. Absalom offered sacrifices in Hebron and sent someone to Gilo to tell David’s advisor Ahithophel to come."},{"header":"David Has To Leave Jerusalem"},{"num":13,"verse":"A messenger came and told David, “Everyone in Israel is on Absalom’s side!”"},{"num":14,"verse":"David’s officials were in Jerusalem with him, and he told them, “Let’s get out of here! We’ll have to leave soon, or none of us will escape from Absalom. Hurry! If he moves fast, he could catch us while we’re still here. Then he will kill us and everyone else in the city.”"},{"num":15,"verse":"The officials said, “Your Majesty, we’ll do whatever you say.”"},{"num":16,"verse":"David left behind ten of his wives to take care of the palace, but the rest of his family and his officials and soldiers went with him."},{"num":18,"verse":"Then David stood there and watched while his regular troops and his bodyguards marched past. The last group was the six hundred soldiers who had followed him from Gath. Their commander was Ittai."},{"num":19,"verse":"David spoke to Ittai and said, “You’re a foreigner from the town of Gath. You don’t have to leave with us. Go back and join the new king! "},{"num":20,"verse":"You haven’t been with me very long, so why should you have to follow me, when I don’t even know where I’m going? Take your soldiers and go back. I pray that the Lord will be kind and faithful to you.”"},{"num":21,"verse":"Ittai answered, “Your Majesty, just as surely as you and the Lord live, I will go where you go, no matter if it costs me my life.”"},{"num":22,"verse":"“Then come on!” David said."},{"header":"David Sends the Sacred Chest Back to Jerusalem"},{"num":23,"verse":"The people of Jerusalem were crying and moaning as David and everyone with him passed by. He led them across Kidron Valley and along the road toward the desert."},{"num":24,"verse":"Zadok and Abiathar the priests were there along with several men from the tribe of Levi who were carrying the sacred chest. They set the chest down, and left it there until David and his followers had gone out of the city."},{"num":25,"verse":"Then David said:"},{"num":29,"verse":"Zadok and Abiathar took the sacred chest back into Jerusalem and stayed there. "},{"num":30,"verse":"David went on up the slope of the Mount of Olives. He was barefoot and crying, and he covered his head to show his sorrow. Everyone with him was crying, and they covered their heads too."},{"num":31,"verse":"Someone told David, “Ahithophel is helping Absalom plot against you!”"},{"header":"David Sends Hushai Back as a Spy"},{"num":32,"verse":"When David reached the top of the Mount of Olives, he met Hushai the Archite at a place of worship. Hushai’s robe was torn, and dust was on his head. "},{"num":33,"verse":"David told him:"},{"num":37,"verse":"David’s advisor Hushai slipped back into Jerusalem, just about the same time that Absalom was coming in."}]