[{"num":15,"verse":"2 The practices of Absalom to aspire to the kingdom. 14 David and his flee. 31 David’s prayer. 34 Hushai is sent to Absalom to discover his counsel."},{"num":1,"verse":"After this, Absalom prepared him chariots, and horses, and fifty men to run before him."},{"num":2,"verse":"And Absalom rose up early, and stood hard by the entering in of the gate: and every man that had any matter, and came to the king for judgment, him did Absalom call unto him, and said, Of what city art thou? And he answered, Thy servant is of one of the tribes of Israel."},{"num":3,"verse":"Then Absalom said unto him, See, thy matters are good and righteous, but there is no man deputed of the king to hear thee."},{"num":4,"verse":"Absalom said moreover, Oh that I were made Judge in the land, that every man which hath any matter of controversy, might come to me, that I might do him justice."},{"num":5,"verse":"And when any man came near to him, and did him obeisance, he put forth his hand, and took him, and kissed him."},{"num":6,"verse":"And on this manner did Absalom to all Israel, that came to the King for judgment: so Absalom stole the hearts of the men of Israel."},{"num":7,"verse":"¶ And after forty years, Absalom said unto the King, I pray thee, let me go to Hebron, and render my vow which I have vowed unto the Lord."},{"num":8,"verse":"For thy servant vowed a vow when I remained at Geshur, in Aram, saying, If the Lord shall bring me again indeed to Jerusalem, I will serve the Lord."},{"num":9,"verse":"And the King said unto him, Go in peace. So he arose, and went to Hebron."},{"num":10,"verse":"¶ Then Absalom sent spies throughout all the tribes of Israel, saying, When ye hear the sound of the trumpet, ye shall say, Absalom reigneth in Hebron."},{"num":11,"verse":"¶ And with Absalom went two hundred men out of Jerusalem, that were called: and they went in their simplicity, knowing nothing."},{"num":12,"verse":"Also Absalom sent for Ahithophel the Gilonite David’s counselor, from his city Giloh, while he offered sacrifices: and the treason was great: for the people increased still with Absalom."},{"num":13,"verse":"¶ Then came a messenger to David, saying, The hearts of the men of Israel are turned after Absalom."},{"num":14,"verse":"Then David said unto all his servants that were with him at Jerusalem, Up, and let us flee: for we shall not escape from Absalom: make speed to depart, lest he come suddenly and take us, and bring evil upon us, and smite the city with the edge of the sword."},{"num":15,"verse":"And the king’s servants said unto him, Behold, thy servants are ready to do according to all that my lord the king shall appoint."},{"num":16,"verse":"So the king departed and all his household after him, and the king left ten concubines to keep the house."},{"num":17,"verse":"And the king went forth and all the people after him, and tarried in a place far off."},{"num":18,"verse":"And all his servants went about him, and all the Cherethites and all the Pelethites, and all the Gittites, even six hundred men which were come after him from Gath, went before the king."},{"num":19,"verse":"Then said the King to Ittai the Gittite, Wherefore comest thou also with us? Return and abide with the King, for thou art a stranger, depart thou therefore to thy place."},{"num":20,"verse":"Thou camest yesterday, and should I cause thee to wander today and go with us? I will go whither I can: therefore return thou, and carry again thy brethren: mercy and truth be with thee."},{"num":21,"verse":"And Ittai answered the King, and said, As the Lord liveth, and as my lord the king liveth, in what place my lord the king shall be, whether in death or life, even there surely will thy servant be."},{"num":22,"verse":"Then David said to Ittai, Come, and go forward. And Ittai the Gittite went, and all his men, and all the children that were with him."},{"num":23,"verse":"And all the country wept with a loud voice, and all the people went forward, but the King passed over the brook Kidron: and all the people went over toward the way of the wilderness."},{"num":24,"verse":"¶ And lo, Zadok also was there, and all the Levites with him, bearing the Ark of the covenant of God: and they set down the Ark of God: and Abiathar went up until the people were all come out of the city."},{"num":25,"verse":"Then the King said unto Zadok, Carry the Ark of God again into the city: if I shall find favor in the eyes of the Lord, he will bring me again, and show me both it, and the Tabernacle thereof."},{"num":26,"verse":"But if he thus say, I have no delight in thee, behold, here am I, let him do to me as seemeth good in his eyes."},{"num":27,"verse":"The King said again unto Zadok the Priest, Art not thou a Seer? return into the city in peace, and your two sons with you: to wit, Ahimaaz thy son, and Jonathan the son of Abiathar."},{"num":28,"verse":"Behold, I will tarry in the fields of the wilderness, until there come some word from you to be told me."},{"num":29,"verse":"Zadok therefore and Abiathar carried the Ark of God again to Jerusalem, and they tarried there."},{"num":30,"verse":"And David went up the mount of olives, and wept as he went up, and had his head covered, and went barefooted: and all the people that was with him, had every man his head covered, and as they went up, they wept."},{"num":31,"verse":"Then one told David, saying, Ahithophel is one of them that have conspired with Absalom: and David said, O Lord, I pray thee, turn the counsel of Ahithophel into foolishness."},{"num":32,"verse":"¶ Then David came to the top of the mount where he worshipped God: and behold, Hushai the Archite came against him with his coat torn, and having earth upon his head."},{"num":33,"verse":"Unto whom David said, If thou go with me, thou shalt be a burthen unto me."},{"num":34,"verse":"But if thou return to the city, and say unto Absalom, I will be thy servant, O King (as I have been in time past thy father’s servant, so will I now be thy servant) then thou mayest bring me the counsel of Ahithophel to nought."},{"num":35,"verse":"And hast thou not there with thee Zadok and Abiathar the Priests? therefore whatsoever thou shalt hear out of the King’s house, thou shalt show to Zadok and Abiathar the Priests."},{"num":36,"verse":"Behold, there are with them their two sons: Ahimaaz Zadok’s son, and Jonathan Abiathar’s son: by them also shall ye send me everything that ye can hear."},{"num":37,"verse":"So Hushai David’s friend went into the city: and Absalom came into Jerusalem."}]