[{"num":15,"verse":"Therefore after these things, Absalom made a chariot to him, and (had) knights and fifty men, that should go before him. (And so after these things, Absalom got a chariot and horses for himself, and had fifty men who went before him.)"},{"num":2,"verse":"And Absalom rose early, and stood beside the entering of the gate in the way; and Absalom called to him each man, that had a cause, [(or) a need,] that he should come to the doom of the king, and Absalom said, Of what city art thou? Which answered, and said, Of one lineage of Israel I am, thy servant. (And Absalom would rise up early, and stand beside the entrance to the city gate on the road; and then he would call over each man who had a case, or a dispute, that should have gone before the king for judgement, and Absalom would say, Of what city art thou? And each one would answer, and say, I, thy servant, am from such and such tribe of Israel.)"},{"num":3,"verse":"And Absalom answered to him, Thy words seem to me good and just, but none is ordained of the king to hear thee. (And then Absalom would say to him, Thy words seem good and just to me, but no one is ordained by the king to hear thee.)"},{"num":4,"verse":"And Absalom said, Who shall ordain me judge on the land, that all men that have (a) cause come to me, and I deem justly? (And Absalom would add, Who shall ordain me judge over the land, so that all who have a case, or a dispute, can come before me, and I shall give them justice?)"},{"num":5,"verse":"But when a man came to Absalom to greet him, he held forth his hand, and took, and kissed that man; (And whenever a man came to Absalom to greet him, he would stretch out his hand, and take hold of him, and kiss him;)"},{"num":6,"verse":"and Absalom did this to all Israel, that came to doom to be heard of the king (and Absalom did this for all of Israel who came to the king for a judgement); and (so) Absalom stole the hearts of [the] men of Israel."},{"num":7,"verse":"But after four years, Absalom said to king David, I shall go, and shall yield my vows, which I vowed to the Lord in Hebron; (And after four years, Absalom said to King David, I shall now go to Hebron, and yield my vows, which I vowed to the Lord;)"},{"num":8,"verse":"for thy servant vowing vowed, when he was in Geshur of Syria, and said, If the Lord bringeth again me into Jerusalem, I shall make sacrifice to the Lord. (for thy servant made a vow, when he was in Geshur of Syria, and said, If the Lord bringeth me back again to Jerusalem, I shall go and make sacrifice to the Lord in Hebron.)"},{"num":9,"verse":"And the king said to him, Go thou in peace. And Absalom rose up, and went into Hebron (And so Absalom rose up, and went to Hebron)."},{"num":10,"verse":"Forsooth Absalom sent spyers into all the lineage[s] of Israel, and said, Anon as ye hear the sound of [the] clarion, say ye, Absalom shall reign in Hebron. (But Absalom also sent messengers to all the tribes of Israel, who said, As soon as ye hear the sound of the trumpet, say ye, Absalom is king in Hebron.)"},{"num":11,"verse":"And two hundred men called (out) of Jerusalem went forth with Absalom, and went with simple heart, and utterly they knew not the cause. (And Absalom invited two hundred men to go out of Jerusalem with him, and they went innocently, that is, in good faith, and utterly knew nothing about his true intentions.)"},{"num":12,"verse":"Also Absalom called (for) Ahithophel of Giloh, the counsellor of David, from his city Giloh. And when he offered sacrifices, a strong swearing together was made, and the people running together was increased with Absalom. (And Absalom summoned Ahithophel the Gilonite, David’s counsellor, from his city of Giloh. And so while he offered his sacrifices, the conspiracy strengthened, and the number of people joining Absalom increased.)"},{"num":13,"verse":"Therefore a messenger came to David, and said, With all [the] heart all Israel followeth Absalom,"},{"num":14,"verse":"And David said to his servants that were with him in Jerusalem, Rise ye up, and flee we; for none escaping shall be to us from the face of Absalom; therefore haste ye to go out, lest he come, and occupy us, and fulfill upon us his falling, and smite the city with sharpness of [the] sword. (And David said to his servants who were with him in Jerusalem, Rise ye up, and flee we; for there shall be no escape for us from Absalom; and so haste ye to go out, lest he come, and occupy us, and fulfill his falling on us, that is, that he destroy us, and strike down the people of the city with the sharpness of his sword.)"},{"num":15,"verse":"And the servants of the king said to him, We thy servants shall perform gladly all things (We thy servants shall gladly do all things), whatever our lord the king shall command."},{"num":16,"verse":"Then the king went out, and all his house, upon their feet; and the king left ten women concubines, that is, secondary wives, to keep the house. (Then the king departed, and all his household followed him; but the king left ten of his concubines, or his secondary wives, to look after the palace.)"},{"num":17,"verse":"And (so) the king went out, and all Israel, upon their feet, and the king stood far from the house (and they stopped far away from the palace)."},{"num":18,"verse":"And all his servants went beside him, and the legions of Cherethites and of Pelethites, and all the strong fighting men of Gath, six hundred men, that followed him from Gath, went on foot before the king."},{"num":19,"verse":"And the king said to Ittai of Gath, Why comest thou with us? Turn thou again, and dwell with the (new) king, for thou art a pilgrim, and wentest out from thy place."},{"num":20,"verse":"Thou camest yesterday, and today thou art compelled to go out with us. Soothly I shall go, whither I shall go; (but thou) turn again, and lead again thy brethren with thee, and the Lord do mercy and truth with thee, for thou hast showed to me grace and faith. (Thou camest but yesterday, and so today, art thou compelled to go out with us? Nay! Truly I shall go, wherever I shall go; but thou return, and take thy kinsmen with thee, and may the Lord show kindness and truth to thee, for thou hast shown favour and faith to me.)"},{"num":21,"verse":"And Ittai answered to the king, and said, (As) The Lord liveth, and (as) my lord the king liveth, for in whatever place thou shalt be, my lord the king, either in death either in life, there thy servant shall be."},{"num":22,"verse":"And David said to Ittai, Come thou, and pass forth. And Ittai of Gath passed forth, and the king, and all men that were with him, and the tother multitude. (And David said to Ittai, Then come thou, and let us go. And so Ittai the Gittite, and the king, and the men who were with him, and all the other people, went forth.)"},{"num":23,"verse":"And all men wept with great voice, and all the people passed forth; and the king went over the strand of Kidron, and all the people went against the way of the olive tree(s), that beholdeth to the desert. (And all the people wept loudly, as they all went forth; and the king led the people over the Kidron Stream/over the Kidron Gorge, and they went toward the way of the olive trees which looketh toward the wilderness.)"},{"num":24,"verse":"Forsooth and Zadok the priest came, and all the deacons with him, and they bare the ark of [the] bond of peace of God, and they setted down the ark of God; and Abiathar went up, till all the people was passed forth that went out of the city. (And Zadok the priest came, and all the Levites with him, carrying the Ark of the Covenant of God; and they set down the Ark of God beside Abiathar, until all the people who went out of the city had passed by.)"},{"num":25,"verse":"And the king said to Zadok, Bear again the ark of God into the city; if I shall find grace in the eyes of the Lord, he shall lead me again, and he shall show to me that ark, and his tabernacle. (And the king said to Zadok, Take the Ark of God back to the city; if I shall find favour before the Lord, he shall bring me back here, and he shall let me see that Ark, and its resting place again.)"},{"num":26,"verse":"Soothly if the Lord saith, Thou pleasest not me; I am ready, do he that, that is good before himself. (But if the Lord saith, Thou pleasest me not; I am ready; do he what he desireth with me.)"},{"num":27,"verse":"And the king said to Zadok, the priest, O! thou seer, that is, (a) prophet, turn again into the city, with peace; and Ahimaaz, thy son, and Jonathan, the son of Abiathar, your two sons, be with you. (And the king said to Zadok, the priest, O! thou prophet, return to the city in peace; and thy son Ahimaaz, and Jonathan, the son of Abiathar, these two young men, go they with you.)"},{"num":28,"verse":"Lo! I shall be hid in [the] field places of the desert, till word come from you, and show to me. (Lo! I shall hide at the Fords, or the river crossings, of the Wilderness, until word come from thee to me.)"},{"num":29,"verse":"Therefore Zadok and Abiathar bare again the ark of God into Jerusalem, and they dwelled there (and they stayed there)."},{"num":30,"verse":"Forsooth David went up upon the hill of olive trees, going up and weeping, with his head covered, and with bare feet passing forth; but also all the people that was with him, went up with their head(s) covered, and (they also) wept. (And David went up on the Mount of Olives, walking and weeping, with his head covered, and going forth with bare feet; and all the people who were with him also went up weeping, and with their heads covered.)"},{"num":31,"verse":"And it was told to David, that Ahithophel was in the swearing together with Absalom; and David said, Lord, I beseech, make thou fond the counsel of Ahithophel. (And it was told to David that Ahithophel was in the conspiracy with Absalom; and David said, Lord, I beseech thee, turn thou Ahithophel’s advice into foolishness.)"},{"num":32,"verse":"And when David went up into [the] highness of the hill, in which he should worship the Lord, lo! Hushai of Archi, with his cloth rent, and with his head full of earth, came to him. (And when David reached the top of the hill, where he would worship the Lord, lo! Hushai the Archite came to him, with his cloak torn, and with earth, or with dirt, on his head.)"},{"num":33,"verse":"And David said to him, If thou comest with me, thou shalt be to me (a) charge (thou shalt be a burden to me);"},{"num":34,"verse":"soothly if thou turnest again to the city, and sayest to Absalom, I am thy servant, O king, suffer thou me to live; as I was the servant of thy father, so I shall be thy servant; thou shalt destroy the counsel of Ahithophel (then thou shalt be able to destroy Ahithophel’s advice)."},{"num":35,"verse":"And thou hast with thee Zadok and Abiathar, the priests; and whatever word thou shalt hear in the house of the king, thou shalt show it to the priests, Zadok and Abiathar. (And thou shalt have with thee Zadok and Abiathar, the priests; and whatever thing that thou shalt hear in the king’s house, thou shalt tell it to those priests, Zadok and Abiathar.)"},{"num":36,"verse":"And their two sons be with them, Ahimaaz, the son of Zadok, and Jonathan, the son of Abiathar; and ye shall send by them to me each word that ye shall hear (and ye shall send them to me with all that ye hear)."},{"num":37,"verse":"Therefore when Hushai, friend of David, came into the city, also Absalom entered into Jerusalem. (And so David’s friend Hushai came into the city, just as Absalom was entering Jerusalem.)"}]