[{"header":"Animals sick and dying"},{"num":9,"verse":"Then the Lord said to Moses, “Go to Pharaoh and say to him, This is what the Lord, the Hebrews’ God, says: Let my people go so that they can worship me."},{"num":2,"verse":"If you refuse to let them go and you continue to hold them back,"},{"num":3,"verse":"the Lord will send a very deadly disease on your livestock in the field: on horses, donkeys, camels, cattle, and flocks."},{"num":4,"verse":"But the Lord will distinguish Israel’s livestock from Egypt’s livestock so that not one that belongs to the Israelites will die.”"},{"num":5,"verse":"The Lord set a time and said, “Tomorrow the Lord will do this in the land.”"},{"num":6,"verse":"And the next day the Lord did it. All of the Egyptian livestock died, but not one animal that belonged to the Israelites died."},{"num":7,"verse":"Pharaoh asked around and found out that not one of Israel’s livestock had died. But Pharaoh was stubborn, and he wouldn’t let the people go."},{"header":"Skin sores and blisters"},{"num":8,"verse":"Then the Lord said to Moses and Aaron, “Take handfuls of ashes from a furnace and have Moses throw it up in the air in front of Pharaoh."},{"num":9,"verse":"The ashes will turn to soot over the whole land of Egypt. It will cause skin sores that will break out in blisters on people and animals in the whole land of Egypt.”"},{"num":10,"verse":"So they took ashes from the furnace, and they stood in front of Pharaoh. Moses threw the ash up in the air, and it caused skin sores and blisters to break out on people and animals."},{"num":11,"verse":"The religious experts couldn’t stand up to Moses because of the skin sores, because there were skin sores on the religious experts as well as on all the Egyptians."},{"num":12,"verse":"But the Lord made Pharaoh stubborn, and Pharaoh wouldn’t listen to them, just as the Lord had said to Moses."},{"header":"Hail and thunder"},{"num":13,"verse":"Then the Lord said to Moses, “Get up early in the morning and confront Pharaoh. Say to him, This is what the Lord, the God of the Hebrews, says: Let my people go so that they can worship me."},{"num":14,"verse":"This time I’m going to send all my plagues on you, your officials, and your people so that you will know that there is no one like me in the whole world."},{"num":15,"verse":"By now I could have used my power to strike you and your people with a deadly disease so that you would have disappeared from the earth."},{"num":16,"verse":"But I’ve left you standing for this reason: in order to show you my power and in order to make my name known in the whole world."},{"num":17,"verse":"You are still abusing your power against my people, and you refuse to let them go."},{"num":18,"verse":"Tomorrow at this time I’ll cause the heaviest hail to fall on Egypt that has ever fallen from the day Egypt was founded until now."},{"num":19,"verse":"So bring under shelter your livestock and all that belongs to you that is out in the open. Every person or animal that is out in the open field and isn’t brought inside will die when the hail rains down on them.”"},{"num":20,"verse":"Some of Pharaoh’s officials who took the Lord’s word seriously rushed to bring their servants and livestock inside for shelter."},{"num":21,"verse":"Others who didn’t take the Lord’s word to heart left their servants and livestock out in the open field."},{"num":22,"verse":"The Lord said to Moses, “Raise your hand toward the sky so that hail will fall on the whole land of Egypt, on people and animals and all the grain in the fields in the land of Egypt.”"},{"num":23,"verse":"Then Moses raised his shepherd’s rod toward the sky, and the Lord sent thunder and hail, and lightning struck the earth. The Lord rained hail on the land of Egypt."},{"num":24,"verse":"The hail and the lightning flashing in the middle of the hail were so severe that there had been nothing like it in the entire land of Egypt since it first became a nation."},{"num":25,"verse":"The hail beat down everything that was in the open field throughout the entire land of Egypt, both people and animals. The hail also beat down all the grain in the fields, and it shattered every tree out in the field."},{"num":26,"verse":"The only place where hail didn’t fall was in the land of Goshen where the Israelites lived."},{"num":27,"verse":"Then Pharaoh sent for Moses and Aaron and said to them, “This time I’ve sinned. The Lord is right, and I and my people are wrong."},{"num":28,"verse":"Pray to the Lord! Enough of God’s thunder and hail! I’m going to let you go. You don’t need to stay here any longer.”"},{"num":29,"verse":"Moses said to him, “As soon as I’ve left the city, I’ll spread out my hands to the Lord. Then the thunder and the hail will stop and won’t return so that you will know that the earth belongs to the Lord."},{"num":30,"verse":"But I know that you and your officials still don’t take the Lord God seriously.”"},{"num":31,"verse":"(Now the flax and the barley were destroyed, because the barley had ears of grain and the flax had buds."},{"num":32,"verse":"But both durum and spelt wheat weren’t ruined, because they hadn’t come up.)"},{"num":33,"verse":"Moses left Pharaoh and the city, and spread out his hands to the Lord. Then the thunder and the hail stopped, and the rain stopped pouring down on the earth."},{"num":34,"verse":"But when Pharaoh saw that the rain, hail, and thunder had stopped, he sinned again. Pharaoh and his officials became stubborn."},{"num":35,"verse":"Because of his stubbornness, Pharaoh refused to let the Israelites go, just as the Lord had told Moses."}]