[{"num":9,"verse":"Then Adonai said to Moshe, “Go to Pharaoh, and tell him, ‘Here is what Adonai, the God of the Hebrews, says: “Let my people go, so that they can worship me. "},{"num":2,"verse":"If you refuse to let them go and persist in holding on to them, "},{"num":3,"verse":"the hand of Adonai is on your livestock in the field — on the horses, donkeys, camels, cattle and flocks — and will make them suffer a devastating illness. "},{"num":4,"verse":"But Adonai will distinguish between Egypt’s and Isra’el’s livestock — nothing belonging to the people of Isra’el will die.”’” "},{"num":5,"verse":"Adonai determined the exact time by saying, “Tomorrow Adonai will do this in the land.” "},{"num":6,"verse":"The following day, Adonai did it — all the livestock of Egypt died; but not one of the animals belonging to the people of Isra’el died. "},{"num":7,"verse":"Pharaoh investigated and found that not even one of the animals of the people of Isra’el had died. Nevertheless, Pharaoh’s heart remained stubborn, and he didn’t let the people go."},{"num":8,"verse":"Adonai said to Moshe and Aharon, “Take handfuls of ashes from a kiln, and let Moshe throw them in the air before Pharaoh’s eyes. "},{"num":9,"verse":"They will turn into fine dust over all the land of Egypt and become infected sores on men and animals throughout Egypt.” "},{"num":10,"verse":"So they took ashes from a kiln, stood in front of Pharaoh and threw them in the air; and they became infected sores on men and animals. "},{"num":11,"verse":"The magicians couldn’t even stand in Moshe’s presence because of the sores, which were on them as well as on the other Egyptians. "},{"num":12,"verse":"But Adonai made Pharaoh hardhearted, so that he didn’t listen to them — just as Adonai had said to Moshe."},{"num":13,"verse":"Adonai said to Moshe, “Get up early in the morning, stand before Pharaoh, and say to him, ‘Here is what Adonai says: “Let my people go, so that they can worship me. "},{"num":14,"verse":"For this time, I will inflict my plagues on you, yourself, and on your officials and your people; so that you will realize that I am without equal in all the earth. "},{"num":15,"verse":"By now I could have stretched out my hand and struck you and your people with such severe plagues that you would have been wiped off the earth. "},{"num":16,"verse":"But it is for this very reason that I have kept you alive — to show you my power, and so that my name may resound throughout the whole earth. "},{"num":17,"verse":"(vii) Since you are still setting yourself up against my people and not letting them go, "},{"num":18,"verse":"tomorrow, about this time, I will cause a hailstorm so heavy that Egypt has had nothing like it from the day it was founded until now. "},{"num":19,"verse":"Therefore, send and hurry to bring indoors all your livestock and everything else you have in the field. For hail will fall on every human being and animal left in the field that hasn’t been brought home, and they will die.”’”"},{"num":20,"verse":"Whoever among Pharaoh’s servants feared what Adonai had said had his slaves and livestock escape into the houses; "},{"num":21,"verse":"but those who had no regard for what Adonai had said left their slaves and livestock in the field."},{"num":22,"verse":"Adonai said to Moshe, “Reach out your hand toward the sky, so that there will be hail in all the land of Egypt, falling on people, animals and everything growing in the field, throughout the land of Egypt.” "},{"num":23,"verse":"Moshe reached out with his staff toward the sky, and Adonai sent thunder and hail, and fire ran down to the earth. Adonai caused it to hail on the land of Egypt — "},{"num":24,"verse":"it hailed, and fire flashed up with the hail; it was terrible, worse than any hailstorm in all of Egypt since it became a nation. "},{"num":25,"verse":"Throughout all the land of Egypt, the hail struck everything in the field, people and animals; and the hail struck every plant growing in the field and broke every tree there. "},{"num":26,"verse":"But in the land of Goshen, where the people of Isra’el were, there was no hail."},{"num":27,"verse":"Pharaoh summoned Moshe and Aharon and said to them, “This time I have sinned: Adonai is in the right; I and my people are in the wrong. "},{"num":28,"verse":"Intercede with Adonai — we can’t take any more of this terrible thunder and hail; and I will let you go, you will stay no longer.” "},{"num":29,"verse":"Moshe said to him, “As soon as I have gone out of the city, I will spread out my hands to Adonai; the thunder will end, and there won’t be any more hail — so that you can know that the earth belongs to Adonai. "},{"num":30,"verse":"But you and your servants, I know you still won’t fear Adonai, God.” "},{"num":31,"verse":"The flax and barley were ruined, because the barley was ripe and the flax in bud. "},{"num":32,"verse":"But the wheat and buckwheat were not ruined, because they come up later. "},{"num":33,"verse":"(Maftir) Moshe went out of the city, away from Pharaoh, and spread out his hands to Adonai. The thunder and hail ended, and the rain stopped pouring down on the earth. "},{"num":34,"verse":"When Pharaoh saw that the rain, hail and thunder had ended, he sinned still more by making himself hardhearted, he and his servants. "},{"num":35,"verse":"Pharaoh was made hardhearted, and he didn’t let the people of Isra’el go, just as Adonai had said through Moshe."}]