[{"header":"Animals Owned by Egyptians Die"},{"num":9,"verse":"Then the Lord said to Moses, “Go to Pharaoh and say to him, ‘The Lord, the God of the Hebrews, says this: “Let My people go, so they may worship Me. "},{"num":2,"verse":"For if you will not let them go, and still hold them, "},{"num":3,"verse":"the hand of the Lord will come with a very bad disease on your animals in the field: on the horses, the donkeys, the camels, the cattle and the flocks. "},{"num":4,"verse":"But the Lord will divide the animals of Israel from the animals of Egypt. So nothing will die of all that belongs to the people of Israel.”’” "},{"num":5,"verse":"The Lord made a time for this, saying, “Tomorrow the Lord will do this in the land.” "},{"num":6,"verse":"So the Lord did this on the next day. All the animals of Egypt died. But not one of the animals died that belonged to the people of Israel. "},{"num":7,"verse":"Pharaoh learned that not one of the animals of Israel was dead. But the heart of Pharaoh was hard. He did not let the people go."},{"header":"Bad Sores Come on Egyptians and Their Animals"},{"num":8,"verse":"Then the Lord said to Moses and Aaron, “Fill your hands with ashes from a stove. Let Moses throw them toward the sky in front of Pharaoh. "},{"num":9,"verse":"And it will become fine dust over all the land of Egypt and will become bad sores on man and animal through all the land of Egypt.” "},{"num":10,"verse":"So they took ashes from a stove. Moses stood in front of Pharaoh and threw the ashes toward the sky. And it became sores on man and animal. "},{"num":11,"verse":"The wonder-workers could not stand in front of Moses because of the sores. For the sores were on the wonder-workers and on all the Egyptians. "},{"num":12,"verse":"But the Lord made the heart of Pharaoh hard. He did not listen to them, just as the Lord had said to Moses."},{"header":"Large Hail and Fire"},{"num":13,"verse":"Then the Lord said to Moses, “Get up early in the morning and stand in front of Pharaoh and say to him, ‘The Lord, the God of the Hebrews, says this: “Let My people go, so they may worship Me. "},{"num":14,"verse":"For this time I will send all My troubles on you and your servants and your people. So you may know that there is no one like Me in all the earth. "},{"num":15,"verse":"For by now I could have put out My hand and hit you and your people with much trouble and great suffering. You would then have been destroyed from the earth. "},{"num":16,"verse":"But I have let you live so you could see My power and so My name may be honored through all the earth. "},{"num":17,"verse":"But you still use your power against My people by not letting them go. "},{"num":18,"verse":"About this time tomorrow I will send a very heavy hail such as has never been seen in Egypt from the day it began until now. "},{"num":19,"verse":"Have your cattle and whatever you have in the field brought to a safe place. For the hail will come down upon every man and animal that is in the field and is not brought home. And they will die.”’” "},{"num":20,"verse":"Any of the people of Egypt who feared the word of the Lord made his servants and animals run to the houses. "},{"num":21,"verse":"But he who did not listen to the word of the Lord left his servants and animals in the field."},{"num":22,"verse":"The Lord said to Moses, “Put out your hand toward the sky and hail will fall on all the land of Egypt. Hail will fall on man and animal and every plant of the field through all the land of Egypt.” "},{"num":23,"verse":"Moses put out his special stick toward the sky. Then the Lord sent thunder and hail. And lightning struck the ground. The Lord poured hail on the land of Egypt. "},{"num":24,"verse":"So there was hail and lightning striking through the hail without stopping. It was very bad, worse than had ever been in all the land of Egypt since it became a nation. "},{"num":25,"verse":"The hail hit all that was in the field through all the land of Egypt, both man and animal. The hail hit every plant of the field and broke down every tree of the field. "},{"num":26,"verse":"Only in the land of Goshen where the people of Israel were, there was no hail."},{"num":27,"verse":"Then Pharaoh sent for Moses and Aaron. He said to them, “I have sinned this time. The Lord is right. I and my people are guilty. "},{"num":28,"verse":"Pray to the Lord. For there has been enough of God’s thunder and hail. And I will let you go. You will stay here no longer.” "},{"num":29,"verse":"Moses said to him, “When I have gone out of the city, I will spread out my hands to the Lord. The thunder will stop. There will be no more hail. Then you may know that the earth is the Lord’s. "},{"num":30,"verse":"But I know that you and your servants do not yet fear the Lord God.” "},{"num":31,"verse":"The flax and the barley were destroyed. For these plants had just begun to grow. "},{"num":32,"verse":"But the other grains were not destroyed, because they grow later."},{"num":33,"verse":"So Moses left the city and Pharaoh. He spread out his hands to the Lord. And the thunder and the hail stopped. The rain no longer poured on the earth. "},{"num":34,"verse":"But when Pharaoh saw that the rain and hail and thunder had stopped, he sinned again. He and his servants made their hearts hard. "},{"num":35,"verse":"Pharaoh’s heart was not changed. He did not let the people of Israel go, just as the Lord had said by Moses."}]