[{"num":6,"verse":"Then the Eternal did exactly as He said and sent this sign on the next day. All of the Egyptians’ livestock began to die, but not a single animal from Israel’s livestock perished. "},{"num":7,"verse":"Pharaoh sent investigators to check Israel’s livestock, and they found that not a single one of their animals had died or become sick. But Pharaoh’s heart was still as hard as stone, and he refused to release the people."},{"num":10,"verse":"So they removed ash from the furnace and stood directly in front of Pharaoh. Moses threw the ashes up in the air, and it caused abscesses to break out on people and their animals. "},{"num":11,"verse":"Even the most talented magicians in Pharaoh’s Egypt could not stand before Moses, because the abscesses broke out on their bodies as well as the rest of the Egyptians."},{"num":12,"verse":"The Eternal made Pharaoh’s hard heart even harder, and Pharaoh was not moved by the miraculous deeds and the words of Moses and Aaron, just as the Eternal had told Moses."},{"num":20,"verse":"Some of Pharaoh’s servants feared the Eternal’s message, so they gathered their servants and livestock into the safety of their houses. "},{"num":21,"verse":"But there were others who did not take seriously the Eternal’s word, and they left their servants and livestock unprotected in the field."},{"num":23,"verse":"So Moses raised his staff up toward the heavens, and the Eternal released loud thunder and hail from the sky, and fire streaked down upon the earth. He caused hail to rain down upon all of Egypt. "},{"num":24,"verse":"As the hail fell, lightning pierced the darkness and lit up the sky. The hailstorm was so intense that it was like no other that had ever occurred in Egypt since its beginning. "},{"num":25,"verse":"The hail pounded everything to the ground that remained in the fields, both people and their animals; it crushed every crop, it shattered every tree. "},{"num":26,"verse":"There was only one place the hail did not fall—Goshen—where the people of Israel lived."},{"num":27,"verse":"Pharaoh then sent for Moses and Aaron."},{"num":31,"verse":"(The flax and barley crops were both destroyed, because the barley heads were nearly ripe and buds had formed on the flax when the hail fell. "},{"num":32,"verse":"But the wheat and the spelt had not yet sprouted, so these crops were spared.)"},{"num":33,"verse":"Moses left Pharaoh and departed the city. He lifted up his hands to the Eternal and prayed. When he did, the thunder and hail and heavy rains stopped. "},{"num":34,"verse":"But as soon as Pharaoh saw that the weather had changed, and he and his servants were certain that the hail and thunder and heavy rains were no longer a threat, they became utterly defiant and Pharaoh hardened his stubborn heart once again. "},{"num":35,"verse":"Because his heart was as hard as stone, he refused to release the Israelites as he promised. This happened exactly as the Eternal One predicted through Moses."}]