[{"num":9,"verse":"Forsooth the Lord said to Moses, Enter thou to Pharaoh, and speak thou to him, (and say,) The Lord God of Hebrews saith these things, Deliver thou my people, that it make sacrifice to me (And the Lord said to Moses, Go thou to Pharaoh, and tell him, The Lord God of the Hebrews saith these things, Let my people go, so that they can worship me;)"},{"num":2,"verse":"that if thou forsakest yet, and withholdest them, (but if thou yet forsakest, and holdest onto them,)"},{"num":3,"verse":"lo! mine hand shall be on thy fields, (and) on the horses, and asses, and camels, and oxen, and sheep, a pestilence full grievous; (lo! my hand shall be upon thy fields, and upon the horses, and donkeys, and camels, and oxen, and sheep, with a horrible pestilence;)"},{"num":4,"verse":"and the Lord shall make a marvellous thing betwixt the possessions of Israel and the possessions of the Egyptians (and the Lord shall make a distinction between the Israelites’ possessions, and the Egyptians’ possessions), (so) that utterly nothing perish of these things that pertain to the sons of Israel."},{"num":5,"verse":"And the Lord ordained a time, and said, Tomorrow the Lord shall do this word in the land (Tomorrow the Lord shall do this thing in the land)."},{"num":6,"verse":"Therefore the Lord made this word in the tother day, and all the living beasts of the Egyptians were dead; forsooth utterly nothing perished of the beasts of the sons of Israel. (And so the Lord brought this about the next day, and all of the Egyptians’ beasts died; but none of the Israelites’ beasts perished.)"},{"num":7,"verse":"And Pharaoh sent to see (what had happened), (for) neither anything was dead of these things which Israel wielded; and the heart of Pharaoh was made full grievous, and he delivered not the people (but Pharaoh’s heart was hardened, and he would not let the people go)."},{"num":8,"verse":"And the Lord said to Moses and Aaron, Take ye your hands full of ashes of a chimney, and Moses sprinkle it into heaven before Pharaoh; (And the Lord said to Moses and Aaron, Take ye some handfuls of ashes from a chimney, and Moses toss it into the air before Pharaoh;)"},{"num":9,"verse":"and be there dust on all the land of Egypt; for why botches shall be in men, and in work beasts, and swelling bladders shall be in all the land of Egypt. (and let there be dust in all the land of Egypt; and let it bring forth sores of swelling boils on the people, and on the work beasts, in all the land of Egypt.)"},{"num":10,"verse":"And they took ashes of a chimney, and they stood before Pharaoh; and Moses sprinkled it into heaven; and wounds of swelling bladders were made in men, and in work beasts; (And so they took some ashes from a chimney, and they stood before Pharaoh; and Moses tossed it into the air; and sores of swelling boils were made on the people, and on the work beasts;)"},{"num":11,"verse":"and the witches might not stand before Moses, for the wounds, or sores, that were in them, and in all the land of Egypt. (and the witches could not stand up before Moses, because of the sores that were on them, and on all the Egyptians.)"},{"num":12,"verse":"And the Lord made hard the heart of Pharaoh, and he heard not them, as the Lord spake to Moses. (But the Lord hardened Pharaoh’s heart, and he would not listen to them, as the Lord had said to Moses.)"},{"num":13,"verse":"Also the Lord said to Moses, Rise thou early, and stand before Pharaoh, and thou shalt say to him, The Lord God of Hebrews saith these things, Deliver thou my people, that it make sacrifice to me; (And the Lord said to Moses, Rise thou up early, and stand before Pharaoh, and thou shalt say to him, The Lord God of the Hebrews saith these things, Let my people go, so that they can worship me;)"},{"num":14,"verse":"for in this time I shall send all my vengeances on thine heart, and on thy servants, and on thy people, that thou know, that none is like me in all [the] earth. (for at this time I shall send all my plagues onto thee, and onto thy servants, and onto thy people, so that thou know, that there is no one like me in all the earth.)"},{"num":15,"verse":"For now I shall hold forth mine hand, and I shall smite thee and thy people with pestilence, and thou shalt perish from the earth; (And now I shall stretch forth my hand, and I shall strike thee and thy people with pestilence, and thou shalt perish from off the earth;)"},{"num":16,"verse":"forsooth therefore I have set thee, that I show my strength in thee, and that my name be told (out) in each land. (yea, I have kept thee alive, only so that I could show my strength through thee, and so that my name would be spoken of in every land.)"},{"num":17,"verse":"Yet thou withholdest my people, and wilt not deliver it? (Yet still thou holdest onto my people, and wilt not let them go!)"},{"num":18,"verse":"Lo! tomorrow, in this same hour (at this same hour), I shall rain full much hail, what manner hail was not in Egypt, from the day in which it was founded, till into this present time."},{"num":19,"verse":"Therefore send thou (a command) right now, and gather (in) thy work beasts, and all things that thou hast in the field; for (those) men, and work beasts, and all things that be in fields withoutforth, and be not gathered (in) from the fields, and [the] hail fall on those, they shall (all) die."},{"num":20,"verse":"He that dreaded the word of the Lord (He who feared the word of the Lord), of the servants of Pharaoh, made his servants and (his) work beasts (to) flee into (their) houses;"},{"num":21,"verse":"soothly he that despised the Lord’s word, left his servants and his work beasts in the fields."},{"num":22,"verse":"And the Lord said to Moses, Hold forth thine hand into heaven, that hail be made in all the land of Egypt (Stretch forth thy hand toward the heavens, so that hail shall fall on all the land of Egypt), (yea,) on men, and on work beasts, and on each herb of the field in the land of Egypt."},{"num":23,"verse":"And Moses held forth the rod into heaven (And Moses stretched forth his staff toward the heavens); and the Lord gave thunders, and hail, and lightnings running about on (all) the land; and the Lord rained hail on the land of Egypt;"},{"num":24,"verse":"and hail and fire meddled together were borne forth; and it was of so much greatness, how great appeared never before in all the land of Egypt, since that people was made. (and hail and fire mixed, or mingled, together were brought forth; yea, it was so great, that never had such appeared before in all the land of Egypt, since that people were made.)"},{"num":25,"verse":"And the hail smote in all the land of Egypt all (the) things that were in the fields, from man till to work beast; and the hail smote all the herb of the field, and brake all the flax of the country;"},{"num":26,"verse":"only the hail felled not in the land of Goshen, where the sons of Israel were. (and only in the land of Goshen, where the Israelites lived, did no hail fall/was there no hail.)"},{"num":27,"verse":"And Pharaoh sent, and called (for) Moses and Aaron, and said to them, I have sinned also now (This time I have sinned); the Lord is just, and I and my people be wicked;"},{"num":28,"verse":"pray ye the Lord, that the thunders and hail of God cease, and I shall deliver you, and dwell ye no more here (and I shall let you go, and ye shall no longer remain here)."},{"num":29,"verse":"Moses said, When I shall go out of the city, I shall hold forth mine hands to the Lord, and [the] lightnings and (the) thunders shall cease, and (the) hail shall not be, (so) that thou know, that the earth is the Lord’s;"},{"num":30,"verse":"forsooth I know, that thou and thy servants dread not yet the Lord [God]. (but I know, that thou and thy servants do not yet fear the Lord God.)"},{"num":31,"verse":"Therefore the flax and barley was hurt, for the barley was green, and the flax had burgeoned then knops; (And so the flax and the barley were destroyed, for the barley was still green, and the flax had only then brought forth knops, or buds;)"},{"num":32,"verse":"forsooth wheat and beans were not hurt, for those were late sown. (but the wheat and the beans were not destroyed, for they were sown late.)"},{"num":33,"verse":"And Moses went out from Pharaoh, and from the city, and held forth his hands to the Lord, and (the) thunders and (the) hail ceased, and [the] rain dropped no more on the earth."},{"num":34,"verse":"Soothly Pharaoh saw that the rain had ceased, and the hail, and thunders, and he increased (his) sin; and the heart of him, and of his servants, was made grievous, (And when Pharaoh saw that the rain, and the hail, and the thunder, had ceased, he increased his sin; and his heart, and the hearts of his servants, were hardened,)"},{"num":35,"verse":"and his heart was made hard greatly; neither he let go the sons of Israel, as the Lord commanded by the hand of Moses. (yea, his heart was greatly hardened; and he still would not let the Israelites go, as the Lord had said through Moses.)"}]