[{"num":5,"verse":"Hiram king of Tyre sent his servants to Solomon, when he heard that he was anointed king in place of his father, for Hiram always loved David."},{"num":2,"verse":"And Solomon sent to Hiram, saying,"},{"num":3,"verse":"You know how David my father could not build a house to the Name of the Lord his God because wars were about him on every side, until the Lord put his foes under his feet."},{"num":4,"verse":"But now the Lord my God has given me rest on every side, so that there is neither adversary nor evil confronting me."},{"num":5,"verse":"And I purpose to build a house to the Name of the Lord my God, as the Lord said to David my father, Your son whom I will set on your throne in your place shall build the house to My Name and Presence."},{"num":6,"verse":"So, Hiram, command them to hew me cedar trees out of Lebanon; my servants shall join yours, and I will give you whatever wages you set for your servants. For you know that no one among us can equal the skill of the Sidon men in cutting timber."},{"num":7,"verse":"When Hiram heard the words of Solomon, he rejoiced greatly and said, Blessed be the Lord this day, Who has given David a wise son to be over this great people."},{"num":8,"verse":"And Hiram sent to Solomon, saying, I have considered the things for which you sent to me; I will do all you wish concerning the cedar and cypress timber."},{"num":9,"verse":"My servants shall bring the logs down from Lebanon to the sea, make them into rafts, and float them by sea to the place that you direct. I will have them released there, and you shall take them away. And you shall fulfill my desire by providing food for my household."},{"num":10,"verse":"So Hiram gave Solomon all the cedar and cypress trees he desired,"},{"num":11,"verse":"And Solomon gave Hiram 20,000 measures of wheat for food for his household, and 20 measures of pure, beaten oil. He gave these to Hiram yearly."},{"num":12,"verse":"The Lord gave Solomon wisdom, as He promised him; and there was peace between Hiram and Solomon, and they made a treaty."},{"num":13,"verse":"King Solomon raised a levy [of forced labor] out of all Israel; and the levy was 30,000 men."},{"num":14,"verse":"He sent them to Lebanon, 10,000 a month by divisions; one month they were in Lebanon and two months at home. Adoniram was over the levy."},{"num":15,"verse":"And Solomon had 70,000 burden bearers and 80,000 hewers [of stone] in the hill country of Judah,"},{"num":16,"verse":"Besides Solomon’s 3,300 overseers in charge of the people doing the work."},{"num":17,"verse":"The king commanded, and they hewed and brought out great, costly stones in order to lay the foundation of the house with dressed stone."},{"num":18,"verse":"Solomon’s builders and Hiram’s builders and the men of Gebal did the hewing and prepared the timber and stones to build the house."}]