[{"header":"Alliance with King Hiram"},{"num":5,"verse":"Now Hiram king of Tyre sent his servants to Solomon when he heard that they had anointed him king in place of his father, for Hiram had always been a friend of David."},{"num":2,"verse":"Then Solomon sent word to Hiram, saying,"},{"num":3,"verse":"“You know that David my father was unable to build a house for the name of the Lord his God because of the wars which surrounded him, until the Lord put them under the soles of his feet."},{"num":4,"verse":"But now the Lord my God has secured me rest on every side; there is neither adversary nor misfortune."},{"num":5,"verse":"So behold, I intend to build a house for the name of the Lord my God, just as the Lord spoke to David my father, saying, ‘Your son, whom I will put on your throne in your place, he will build the house for My name.’"},{"num":6,"verse":"Now then, issue orders that they cut cedars from Lebanon for me, and my servants will be with your servants; and I will give you wages for your servants in accordance with all that you say, for you yourself know that there is no one among us who knows how to cut timber like the Sidonians.”"},{"num":7,"verse":"When Hiram heard the words of Solomon, he greatly rejoiced; and he said, “Blessed be the Lord today, who has given to David a wise son over this great people.”"},{"num":8,"verse":"So Hiram sent word to Solomon, saying, “I have heard the message which you sent me; I will do everything you wish concerning the cedar and juniper timber."},{"num":9,"verse":"My servants will bring the timbers down from Lebanon to the sea; and I will have them made into rafts to go by sea to the place where you direct me, and I will have them broken up there, and you will carry them away. Then you shall do what I wish, by giving food to my household.”"},{"num":10,"verse":"So Hiram gave Solomon all that he wished of the cedar and juniper timber."},{"num":11,"verse":"Solomon then gave Hiram twenty thousand kors of wheat as food for his household, and twenty kors of pure oil; this is what Solomon would give Hiram year by year."},{"num":12,"verse":"And the Lord gave wisdom to Solomon, just as He promised him; and there was peace between Hiram and Solomon, and the two of them made a covenant."},{"header":"Conscription of Laborers"},{"num":13,"verse":"Now King Solomon conscripted forced laborers from all Israel; and the forced laborers numbered thirty thousand men."},{"num":14,"verse":"Then he sent them to Lebanon, ten thousand a month in shifts; they were in Lebanon for a month, and two months at home. And Adoniram was in charge of the forced laborers."},{"num":15,"verse":"Now Solomon had seventy thousand porters, and eighty thousand stonemasons in the mountains,"},{"num":16,"verse":"besides Solomon’s 3,300 chief deputies who were in charge of the project and ruled over the people who were doing the work."},{"num":17,"verse":"Then the king issued orders, and they quarried large stones, valuable stones, to lay the foundation of the house with cut stones."},{"num":18,"verse":"So Solomon’s builders and Hiram’s builders and the Gebalites cut the stones, and they prepared the timbers and the stones to build the house."}]