[{"num":2,"verse":"For gar you  yourselves autos know oida,  brothers adelphos,  that hoti · ho our hēmeis coming eisodos · ho to pros you hymeis was ginomai not ou in  vain kenos. "},{"num":2,"verse":"We  had  previously  suffered propaschō and kai been  shamefully  treated hybrizō in en Philippi Philippoi,  as kathōs you  know oida,  but alla we  had  the  courage parrēsiazomai in en · ho our hēmeis God theos to  declare laleō to pros you hymeis the ho gospel euangelion of ho God theos in en spite  of  great polys opposition agōn. "},{"num":3,"verse":"· ho For gar our hēmeis appeal paraklēsis was  not ou based ek on  deceit planē,  nor oude did it rise  from ek impure  motives akatharsia or oude by  way  of en trickery dolos, "},{"num":4,"verse":"but alla just  as kathōs we  have  been  approved dokimazō by hypo · ho God theos to  be  entrusted pisteuō with  the ho gospel euangelion,  so houtōs we  speak laleō,  not ou to hōs please areskō man anthrōpos,  but alla God theos who ho tests dokimazō · ho our hēmeis hearts kardia. "},{"num":5,"verse":"For gar we ginomai never oute came ginomai with en flattering kolakeia speech logos,  as kathōs you  know oida,  or oute with en a  pretext prophasis for  greed pleonexia— God theos is our  witness martys. "},{"num":6,"verse":"Neither oute did  we  seek zēteō praise doxa from ek men anthrōpos,  whether oute from apo you hymeis or oute from apo others allos. "},{"num":7,"verse":"Although  we  could dynamai have  made eimi demands en baros as hōs apostles apostolos of  Christ Christos,  we  were ginomai gentle nēpios among en mesos you hymeis,  like hōs ean a  mother trophos tenderly  nursing thalpō · ho her  own heautou children teknon. "},{"num":8,"verse":"So houtōs deep  was our  affection homeiromai for  you hymeis that  we  were  pleased eudokeō to  share metadidōmi with  you hymeis not ou only monon the ho gospel euangelion of ho God theos but alla · ho our  own heautou selves psychē as  well kai,  so dioti dear agapētos had  you  become ginomai to  us hēmeis. "},{"num":9,"verse":"For gar you  recall mnēmoneuō,  brothers adelphos,  · ho our hēmeis labor kopos and kai · ho toil mochthos.  We  worked ergazomai night nyx and kai day hēmera so  as pros not mē to  become  a  burden epibareō to  any tis of  you hymeis,  while  proclaiming kēryssō to eis you hymeis the ho gospel euangelion of ho God theos. "},{"num":10,"verse":"You hymeis are  witnesses martys,  and kai so is  · ho God theos,  how hōs devout hosiōs,  · kai upright dikaiōs,  and kai blameless amemptōs was  our  conduct ginomai toward  you hymeis · ho believers pisteuō— "},{"num":11,"verse":"how kathaper,  as hōs you  know oida, we treated  each hekastos one heis of  you hymeis as hōs a  father patēr would treat  his  own heautou children teknon. "},{"num":12,"verse":"So  we  exhorted parakaleō you hymeis,  · kai encouraged paramytheomai you,  and kai charged martyreō you  to eis · ho conduct peripateō yourselves hymeis in  a  manner  worthy axiōs of ho God theos,  who ho calls kaleō you hymeis into eis · ho his  own heautou kingdom basileia and kai glory doxa. "},{"num":13,"verse":"And kai for dia this houtos reason  we hēmeis also kai constantly adialeiptōs thank eucharisteō · ho God theos,  that hoti when  you  received paralambanō the  word logos of ho God theos which  you  heard akoē from para us hēmeis,  you  accepted dechomai it  not ou as  a  human anthrōpos word logos,  but alla as kathōs it  truly alēthōs is eimi, the  word logos of  God theos,  which hos even kai now  is  doing energeō its  work  in en you hymeis who ho believe pisteuō. "},{"num":14,"verse":"For gar you hymeis,  brothers adelphos,  became ginomai imitators mimētēs of  the ho churches ekklēsia of ho God theos in en Christ Christos Jesus Iēsous which ho are eimi in en · ho Judea Ioudaia;  because hoti you hymeis too kai suffered paschō the ho same autos things  from hypo · ho your  own idios countrymen symphyletēs,  even  as kathōs · kai they autos did  from hypo the ho Jews Ioudaios, "},{"num":15,"verse":"who ho · kai killed apokteinō the ho Lord kyrios Jesus Iēsous and kai the ho prophets prophētēs,  and kai have  driven  us hēmeis out ekdiōkō,  · kai who  are  displeasing mē to  God theos and kai oppose enantios all pas mankind anthrōpos, "},{"num":16,"verse":"who  prevent kōlyō us hēmeis from  speaking laleō to  the ho Gentiles ethnos that hina they  might  be  saved sōzō. Their  goal eis has  always pantote been  to  complete anaplēroō the  full  number  of  their autos · ho sins hamartia.  But de God’s  wrath orgē has  caught  up phthanō with epi them autos · ho at eis last telos! "},{"num":17,"verse":"As  for de us hēmeis,  brothers adelphos,  when  we  were  separated aporphanizō from apo you hymeis for pros a  short kairos time hōra— in  person prosōpon but  not ou in  heart kardia— we  were  all  the  more perissoterōs eager spoudazō,  with en intense polys longing epithumia, to see  you hymeis · ho in  person prosōpon. "},{"num":18,"verse":"For dioti we  wanted thelō to  come erchomai to pros you hymeis— I egō,  Paul Paulos,  · kai time hapax and kai again dis— but kai Satan Satanas hindered enkoptō us hēmeis.  · ho"},{"num":19,"verse":"For gar what tis is  our hēmeis hope elpis,  or ē joy chara,  or ē crown stephanos of  rejoicing kauchēsis before emprosthen · ho our hēmeis Lord kyrios Jesus Iēsous at en · ho his autos coming parousia? Is it  not ouchi indeed kai you hymeis? "},{"num":20,"verse":"Yes gar,  you hymeis are eimi · ho our hēmeis glory doxa and kai · ho joy chara! "}]