[{"header":"The spirit of our visit to you is well known to you all"},{"num":1,"verse":"My brothers, you know from your own experience that our visit to you was no failure. We had, as you also know, been treated abominably at Philippi, and we came on to you only because God gave us courage. We came to tell you the Gospel, whatever the opposition might be."},{"num":3,"verse":"Our message to you is true, our motives are pure, our conduct is absolutely above board. We speak under the solemn sense of being trusted by God with the Gospel. We do not aim to please men, but to please God who knows us through and through. No one could ever say, as again you know, that we used flattery to conceal greedy motives, and God himself is witness to our honesty. We made no attempt to win honour from men, either from you or from anybody else, though I suppose as Christ’s own messengers we might have done so. Our attitude among you was one of tenderness, rather like that of a devoted nurse among her babies. Because we loved you, it was a joy to us to give you not only the Gospel of God but our very hearts—so dear did you become to us. Our struggles and hard work, my brothers, must still be fresh in your minds. Day and night we worked so that our preaching of the Gospel to you might not cost you a penny. You are witnesses, as is God himself, that our life among you believers was honest, straightforward and above criticism. You will remember how we dealt with each one of you personally, like a father with his own children, stimulating your faith and courage and giving you instruction. Our only object was to help you to live lives worthy of the God who has called you to share the splendour of his kingdom."},{"num":13,"verse":"And so we are continually thankful that when you heard us preach the word of God you accepted it, not as a mere human message, but as it really is, God’s Word, a power in the lives of you who believe."},{"header":"You have experienced persecution like your Jewish brothers"},{"num":14,"verse":"When you suffered at the hands of your fellow-countrymen you were sharing the experience of the Judean Christian churches, who suffered persecution by the Jews. It was the Jews who killed their own prophets, the Jews who killed the Lord Jesus, and the Jews who drove out us, his messengers. Their present attitude is in opposition to both God and man. They refused to let us speak to those who were not Jews, to tell them the news of salvation. Alas, I fear they are completing the full tale of their sins and the wrath of God is over their heads."},{"header":"Absence has indeed made our hearts grow fonder"},{"num":17,"verse":"Since we have been physically separated from you, my brothers (though never for a moment separated in heart), we have longed all the more to see you. Yes, I, Paul, have longed to come and see you more than once—but somehow Satan prevented our coming."},{"num":19,"verse":"Yet who could take your place as our hope and joy and pride when Jesus comes? Who but you, as you will stand before him at his coming? Yes, you are indeed our pride and joy!"}]