[{"header":"The Divine Purpose, and Limited Role, of Ruling Authorities"},{"num":13,"verse":"Every person must be subject to the ruling authorities. There is no authority, you see, except from God, and those that exist have been put in place by God. "},{"num":2,"verse":"As a result, anyone who rebels against authority is resisting what God has set up, and those who resist will bring judgment on themselves. "},{"num":3,"verse":"For rulers hold no terrors for people who do good, but only for people who do evil."},{"num":4,"verse":"It is God’s servant, you see, for you and your good. But if you do evil, be afraid; the sword it carries is no empty gesture. It is God’s servant, you see: an agent of justice to bring his anger on evildoers. "},{"num":5,"verse":"That is why it is necessary to submit, not only to avoid punishment but because of conscience."},{"num":6,"verse":"That, too, is why you pay taxes. The officials in question are God’s ministers, attending to this very thing. "},{"num":7,"verse":"So pay each of them what is owed: tribute to those who collect it, revenue to those who collect it. Respect those who should be respected. Honour the people one ought to honour."},{"header":"Love, the Law and the Coming Day"},{"num":8,"verse":"Don’t owe anything to anyone, except the debt of mutual love. If you love your neighbour, you see, you have fulfilled the law. "},{"num":9,"verse":"Commandments like ‘don’t commit adultery, don’t kill, don’t steal, don’t covet’ – and any other commandment – are summed up in this: ‘Love your neighbour as yourself.’ "},{"num":10,"verse":"Love does no wrong to its neighbour; so love is the fulfilment of the law."},{"num":11,"verse":"This is all the more important because you know what time it is. The hour has come for you to wake up from sleep. Our salvation, you see, is nearer now than it was when first we came to faith. "},{"num":12,"verse":"The night is nearly over, the day is almost here. So let’s put off the works of darkness, and put on the armour of light. "},{"num":13,"verse":"Let’s behave appropriately, as in the daytime: not in wild parties and drunkenness, not in orgies and shameless immorality, not in bad temper and jealousy. "},{"num":14,"verse":"Instead, put on the Lord Jesus, the Messiah, and don’t make any allowance for the flesh and its lusts."}]