[{"num":13,"verse":"Let kol nefesh (every soul, person) be subject to the official governing authorities. For there is no memshalah (government) except given by Hashem, and the powers that be have been established by G-d."},{"num":2,"verse":"So then, he who opposes the authority has resisted the ordinance, official decree of G-d; and those who resist shall receive mishpat (judgment) on themselves."},{"num":3,"verse":"For rulers are not a cause of pachad (terror) to hitnahagut (conduct) that is of HaTov but HaRah. Do you want to be without pachad of memshalah (government)? Do HaTov, and you will have the commendation of the representative of the memshalah."},{"num":4,"verse":"For he is the mesharet (minister, servant) of Hashem to you for HaTov. But if you do HaRah, be afraid. For he does not bear the cherev (8:35) to no purpose. For he is the mesharet of Hashem, an avenger for Charon Af (1:18 2:8; 3:5; 4:15; 5:9; 9:22; 12:19; 13:4) against the evildoer."},{"num":5,"verse":"Wherefore it is necessary to be subject, not only on account of the Charon Af of Hashem, but also on account of matzpun (conscience)."},{"num":6,"verse":"For that is why you also pay tribute (taxes). For they are mesharetim of G-d engaged in this very task."},{"num":7,"verse":"Render to everyone their due: tribute to whom tribute is due, tax to whom tax; fear to whom fear is due, respect to whom respect."},{"num":8,"verse":"Owe, be indebted, obligated nothing to anyone except a choiv (debt) of ahavah (love); for he who has ahavah has fulfilled the Torah."},{"num":9,"verse":"For the mitzvoh, LO TIN’AF, LO TIRTZACH, LO TIGNOV, LO TACHMOD, SHEMOT 20:13-15,17; DEVARIM 5:17-19,21) and any other of the mitzvot (commandments) is akitzur (restated, in summary), in this dvar Torah, V’AHAVTA L’RE’ACHA KAMOCHA (\"You shall love your neighbor as yourself\" VAYIKRA 19:18.)"},{"num":10,"verse":"Ahavah (agape) does no wrong to the re’a (neighbor); therefore the fulfillment of the Torah is ahavah."},{"num":11,"verse":"Besides this, you have da’as of the zman, that it is already the hour for you to wake up from sheynah (sleep), for now is Yeshu’at Eloheinu nearer than when we became ma’aminim (believers)."},{"num":12,"verse":"The Lailah (Night) (of the old epoch) is far advanced, and HaYom [Yom HaDin, the Day of Judgment] is imminent, at hand. Let us therefore take off the dark cloak of the deeds of choshech, ridding ourselves of it, and let us put on the neshek (weapons 6:13) of Ohr (light)."},{"num":13,"verse":"Let us conduct ourselves decently as in HaYom (The Day), not in carousing and shichrut (drunkenness), not in zenut (fornication) and debauchery and zimmah (licentiousness), not in merivah (strife) and quarreling and anochiyut (selfishness) and kinah (jealousy)."},{"num":14,"verse":"But put on Rebbe, Melech HaMoshiach Yehoshua Adoneinu and make no provision for the basar (old fallen nature), to satisfy its ta’avot (lusts)."}]