[{"header":"The Gold Idol and Blazing Furnace"},{"num":3,"verse":"Now King Nebuchadnezzar had a gold statue made. That statue was 90 feet high and 9 feet wide. He set up the statue on the plain of Dura in the area of Babylon. "},{"num":2,"verse":"Then the king called the important leaders: the governors, assistant governors, captains of the soldiers, people who advised the king, keepers of the treasury, judges, rulers and all other officers in his kingdom. He wanted these men to come to the special service for the statue he had set up. "},{"num":3,"verse":"So they all came for the special service. And they stood in front of the statue that King Nebuchadnezzar had set up. "},{"num":4,"verse":"Then the man who made announcements for the king spoke in a loud voice. He said, “People, nations and men of every language, this is what you are commanded to do: "},{"num":5,"verse":"You will hear the sound of the horns, flutes, lyres, zithers, harps, pipes and all the other musical instruments. When this happens, you must bow down and worship the gold statue. This is the one King Nebuchadnezzar has set up. "},{"num":6,"verse":"Everyone must bow down and worship this gold statue. Anyone who doesn’t will be quickly thrown into a blazing furnace.”"},{"num":7,"verse":"Now people, nations and men who spoke every language were there. And they heard the sound of the horns, flutes, lyres, zithers, pipes and all the other musical instruments. So they bowed down and worshiped the gold statue that King Nebuchadnezzar had set up."},{"num":8,"verse":"Then some Babylonians came up to the king. They began speaking against the men of Judah. "},{"num":9,"verse":"They said to King Nebuchadnezzar, “Our king, live forever! "},{"num":10,"verse":"Our king, you gave a command. You said that everyone would hear the horns, lyres, zithers, harps, pipes and all the other musical instruments. Then they would have to bow down and worship the gold statue. "},{"num":11,"verse":"Anyone who wouldn’t do this was to be thrown into a blazing furnace. "},{"num":12,"verse":"Our king, there are some men of Judah who did not pay attention to your order. You made them important officers in the area of Babylon. Their names are Shadrach, Meshach and Abednego. They do not serve your gods. And they do not worship the gold statue you have set up.”"},{"num":13,"verse":"Nebuchadnezzar became very angry. He called for Shadrach, Meshach and Abednego. So those men were brought to the king. "},{"num":14,"verse":"And Nebuchadnezzar said, “Shadrach, Meshach and Abednego, is it true that you do not serve my gods? And is it true that you did not worship the gold statue I have set up? "},{"num":15,"verse":"Now, you will hear the sound of the horns, flutes, lyres, zithers, harps, pipes and all the other musical instruments. And you must be ready to bow down and worship the statue I made. That will be good. But if you do not worship it, you will be thrown quickly into the blazing furnace. Then no god will be able to save you from my power!”"},{"num":16,"verse":"Shadrach, Meshach and Abednego answered the king. They said, “Nebuchadnezzar, we do not need to defend ourselves to you. "},{"num":17,"verse":"You can throw us into the blazing furnace. The God we serve is able to save us from the furnace and your power. If he does this, it is good. "},{"num":18,"verse":"But even if God does not save us, we want you, our king, to know this: We will not serve your gods. We will not worship the gold statue you have set up.”"},{"num":19,"verse":"Then Nebuchadnezzar was furious with Shadrach, Meshach and Abednego. He ordered the furnace to be heated seven times hotter than usual. "},{"num":20,"verse":"Then he commanded some of the strongest soldiers in his army to tie up Shadrach, Meshach and Abednego. The king told the soldiers to throw them into the blazing furnace."},{"num":21,"verse":"So Shadrach, Meshach and Abednego were tied up and thrown into the blazing furnace. They were still wearing their robes, trousers, turbans and other clothes. "},{"num":22,"verse":"The king was very angry when he gave the command. And the furnace was made very hot. The fire was so hot that the flames killed the strong soldiers who took Shadrach, Meshach and Abednego there. "},{"num":23,"verse":"Firmly tied, Shadrach, Meshach and Abednego fell into the blazing furnace."},{"num":24,"verse":"Then King Nebuchadnezzar was very surprised and jumped to his feet. He asked the men who advised him, “Didn’t we tie up only three men? Didn’t we throw them into the fire?”"},{"num":25,"verse":"The king said, “Look! I see four men. They are walking around in the fire. They are not tied up, and they are not burned. The fourth man looks like a son of the gods.”"},{"num":26,"verse":"Then Nebuchadnezzar went to the opening of the blazing furnace. He shouted, “Shadrach, Meshach and Abednego, come out! Servants of the Most High God, come here!”"},{"num":27,"verse":"When they came out, the princes, assistant governors, governors and royal advisers crowded around them. They saw that the fire had not harmed their bodies. Their hair was not burned. Their robes were not burned. And they didn’t even smell like smoke."},{"num":28,"verse":"Then Nebuchadnezzar said, “Praise the God of Shadrach, Meshach and Abednego. Their God has sent his angel and saved his servants from the fire! These three men trusted their God. They refused to obey my command. And they were willing to die rather than serve or worship any god other than their own. "},{"num":29,"verse":"So I now make this law: The people of any nation or language must not say anything against the God of Shadrach, Meshach and Abednego. Anyone who does will be torn apart. And his house will be turned into a pile of stones. No other god can save his people like this.” "},{"num":30,"verse":"Then the king promoted Shadrach, Meshach and Abednego in the area of Babylon."}]