[{"header":"The Gold Idol and Blazing Furnace"},{"num":3,"verse":"King Nebuchadnezzar made a gold statue ninety feet high and nine feet wide and set it up on the plain of Dura in the area of Babylon. "},{"num":2,"verse":"Then he called for the leaders: the governors, assistant governors, captains of the soldiers, people who advised the king, keepers of the treasury, judges, rulers, and all other officers in his kingdom. He wanted them to come to the special service for the statue he had set up. "},{"num":3,"verse":"So they all came for the special service and stood in front of the statue that King Nebuchadnezzar had set up. "},{"num":4,"verse":"Then the man who made announcements for the king said in a loud voice, “People, nations, and those of every language, this is what you are commanded to do: "},{"num":5,"verse":"When you hear the sound of the horns, flutes, lyres, zithers, harps, pipes, and all the other musical instruments, you must bow down and worship the gold statue that King Nebuchadnezzar has set up. "},{"num":6,"verse":"Anyone who doesn’t bow down and worship will immediately be thrown into a blazing furnace.”"},{"num":7,"verse":"Now people, nations, and those who spoke every language were there. When they heard the sound of the horns, flutes, lyres, zithers, pipes, and all the other musical instruments, they bowed down and worshiped the gold statue King Nebuchadnezzar had set up."},{"num":8,"verse":"Then some Babylonians came up to the king and began speaking against the men of Judah. "},{"num":9,"verse":"They said to King Nebuchadnezzar, “O king, live forever! "},{"num":10,"verse":"O king, you gave a command that everyone who heard the horns, lyres, zithers, harps, pipes, and all the other musical instruments would have to bow down and worship the gold statue. "},{"num":11,"verse":"Anyone who wouldn’t do this was to be thrown into a blazing furnace. "},{"num":12,"verse":"O king, there are some men of Judah whom you made officers in the area of Babylon that did not pay attention to your order. Their names are Shadrach, Meshach, and Abednego. They do not serve your gods and do not worship the gold statue you have set up.”"},{"num":13,"verse":"Nebuchadnezzar became very angry and called for Shadrach, Meshach, and Abednego. When they were brought to the king, "},{"num":14,"verse":"Nebuchadnezzar said, “Shadrach, Meshach, and Abednego, is it true that you do not serve my gods nor worship the gold statue I have set up? "},{"num":15,"verse":"In a moment you will again hear the sound of the horns, flutes, lyres, zithers, harps, pipes, and all the other musical instruments. If you bow down and worship the statue I made, that will be good. But if you do not worship it, you will immediately be thrown into the blazing furnace. What god will be able to save you from my power then?”"},{"num":16,"verse":"Shadrach, Meshach, and Abednego answered the king, saying, “Nebuchadnezzar, we do not need to defend ourselves to you. "},{"num":17,"verse":"If you throw us into the blazing furnace, the God we serve is able to save us from the furnace. He will save us from your power, O king. "},{"num":18,"verse":"But even if God does not save us, we want you, O king, to know this: We will not serve your gods or worship the gold statue you have set up.”"},{"num":19,"verse":"Then Nebuchadnezzar was furious with Shadrach, Meshach, and Abednego, and he changed his mind. He ordered the furnace to be heated seven times hotter than usual. "},{"num":20,"verse":"Then he commanded some of the strongest soldiers in his army to tie up Shadrach, Meshach, and Abednego and throw them into the blazing furnace."},{"num":21,"verse":"So Shadrach, Meshach, and Abednego were tied up and thrown into the blazing furnace while still wearing their robes, trousers, turbans, and other clothes. "},{"num":22,"verse":"The king’s command was very strict, and the furnace was made so hot that the flames killed the strong soldiers who threw Shadrach, Meshach, and Abednego into the furnace. "},{"num":23,"verse":"Firmly tied, Shadrach, Meshach, and Abednego fell into the blazing furnace."},{"num":24,"verse":"Then King Nebuchadnezzar was so surprised that he jumped to his feet. He asked the men who advised him, “Didn’t we tie up only three men and throw them into the fire?”"},{"num":25,"verse":"The king said, “Look! I see four men walking around in the fire. They are not tied up, and they are not burned. The fourth man looks like a son of the gods.”"},{"num":26,"verse":"Then Nebuchadnezzar went to the opening of the blazing furnace and shouted, “Shadrach, Meshach, and Abednego, come out! Servants of the Most High God, come here!”"},{"num":27,"verse":"When they came out, the governors, assistant governors, captains of the soldiers, and royal advisers crowded around them and saw that the fire had not harmed their bodies. Their hair was not burned, their robes were not burned, and they didn’t even smell like smoke!"},{"num":28,"verse":"Then Nebuchadnezzar said, “Praise the God of Shadrach, Meshach, and Abednego. Their God has sent his angel and saved his servants from the fire! These three men trusted their God and refused to obey my command. They were willing to die rather than serve or worship any god other than their own. "},{"num":29,"verse":"So I now give this command: Anyone from any nation or language who says anything against the God of Shadrach, Meshach, and Abednego will be torn apart and have his house turned into a pile of stones. No other god can save his people like this.” "},{"num":30,"verse":"Then the king promoted Shadrach, Meshach, and Abednego in the area of Babylon."}]