[{"num":105,"verse":"1 He praiseth the singular grace of God, who hath of all the people of the world chosen a peculiar people to himself, and having chosen them, never ceaseth to do them good, even for his promise’s sake."},{"num":1,"verse":"Praise the Lord, and call upon his Name: declare his works among the people."},{"num":2,"verse":"Sing unto him, sing praise unto him, and talk of all his wondrous works."},{"num":3,"verse":"Rejoice in his holy Name, let the heart of them that seek the Lord, rejoice."},{"num":4,"verse":"Seek the Lord and his strength: seek his face continually."},{"num":5,"verse":"Remember his marvelous works that he hath done, his wonders, and the judgments of his mouth,"},{"num":6,"verse":"Ye seed of Abraham his servant, ye children of Jacob, which are his elect."},{"num":7,"verse":"He is the Lord our God: his judgments are through all the earth."},{"num":8,"verse":"He hath always remembered his covenant, and promise, that he made to a thousand generations,"},{"num":9,"verse":"Even that which he made with Abraham, and his oath unto Isaac:"},{"num":10,"verse":"And since hath confirmed it to Jacob for a law, and to Israel for an everlasting covenant,"},{"num":11,"verse":"Saying, Unto thee will I give the land of Canaan, the lot of your inheritance."},{"num":12,"verse":"Albeit they were few in number, yea very few, and strangers in the land,"},{"num":13,"verse":"And walked about from nation to nation, from one kingdom to another people,"},{"num":14,"verse":"Yet suffered he no man to do them wrong, but reproved Kings for their sakes, saying,"},{"num":15,"verse":"Touch not mine anointed, and do my Prophets no harm."},{"num":16,"verse":"Moreover, he called a famine upon the land, and utterly brake the staff of bread."},{"num":17,"verse":"But he sent a man before them: Joseph was sold for a slave."},{"num":18,"verse":"They held his feet in the stocks, and he was laid in irons,"},{"num":19,"verse":"Until his appointed time came, and the counsel of the Lord had tried him."},{"num":20,"verse":"The King sent and loosed him: even the Ruler of the people delivered him."},{"num":21,"verse":"He made him lord of his house, and ruler of all his substance,"},{"num":22,"verse":"That he should bind his princes unto his will, and teach his Ancients wisdom."},{"num":23,"verse":"Then Israel came to Egypt, and Jacob was a stranger in the land of Ham."},{"num":24,"verse":"And he increased his people exceedingly, and made them stronger than their oppressors."},{"num":25,"verse":"He turned their heart to hate his people, and to deal craftily with his servants."},{"num":26,"verse":"Then sent he Moses his servant, and Aaron whom he had chosen."},{"num":27,"verse":"They showed among them the message of his signs, and wonders in the land of Ham."},{"num":28,"verse":"He sent darkness, and made it dark: and they were not disobedient unto his commission."},{"num":29,"verse":"He turned their waters into blood, and slew their fish."},{"num":30,"verse":"Their land brought forth frogs, even in their King’s chambers."},{"num":31,"verse":"He spake, and there came swarms of flies and lice in all their quarters."},{"num":32,"verse":"He gave them hail for rain, and flames of fire in their land."},{"num":33,"verse":"He smote their vines also and their fig trees, and brake down the trees in their coasts."},{"num":34,"verse":"He spake and the grasshoppers came, and caterpillars innumerable,"},{"num":35,"verse":"And did eat up all the grass in their land, and devoured the fruit of their ground."},{"num":36,"verse":"He smote also all the firstborn in their land, even the beginning of all their strength."},{"num":37,"verse":"He brought them forth also with silver and gold, and there was none feeble among their tribes."},{"num":38,"verse":"Egypt was glad at their departing: for the fear of them had fallen upon them."},{"num":39,"verse":"He spread a cloud to be a covering, and fire to give light in the night."},{"num":40,"verse":"They asked, and he brought quails, and he filled them with the bread of heaven."},{"num":41,"verse":"He opened the rock, and the water flowed out, and ran in the dry places like a river."},{"num":42,"verse":"For he remembered his holy promise to Abraham his servant,"},{"num":43,"verse":"And he brought forth his people with joy, and his chosen with gladness,"},{"num":44,"verse":"And gave them the lands of the heathen, and they took the labors of the people in possession,"},{"num":45,"verse":"That they might keep his statutes, and observe his Laws. Praise ye the Lord."}]