[{"header":"God’s Work with Israel"},{"num":105,"verse":"O give thanks to the Lord. Call on His name. Make His works known among the people. "},{"num":2,"verse":"Sing to Him. Sing praises to Him. Tell of all His great works. "},{"num":3,"verse":"Honor His holy name. Let the heart of those who look to the Lord be glad. "},{"num":4,"verse":"Look for the Lord and His strength. Look for His face all the time. "},{"num":5,"verse":"Remember the great and powerful works that He has done. Keep in mind what He has decided and told us, "},{"num":6,"verse":"O children of His servant Abraham, O sons of Jacob, His chosen ones! "},{"num":7,"verse":"He is the Lord our God. What He has decided is in all the earth."},{"num":8,"verse":"He has remembered His agreement forever, the promise He made to last through a thousand families-to-come, "},{"num":9,"verse":"the agreement that He made with Abraham, and His promise to Isaac. "},{"num":10,"verse":"He gave it to Jacob as a Law, to Israel as an agreement that will last forever. "},{"num":11,"verse":"He said, “I will give the land of Canaan to you as your share,” "},{"num":12,"verse":"when they were only a few men in number and were strangers in it. "},{"num":13,"verse":"They went from nation to nation, from the people under one king to the people under another. "},{"num":14,"verse":"He did not allow anyone to hold power over them. And He spoke sharp words to kings because of them. "},{"num":15,"verse":"He said, “Do not touch My chosen ones. And do not hurt those who speak for Me.”"},{"num":16,"verse":"Then He called for a time of no food on the land. He cut off all their bread. "},{"num":17,"verse":"He sent a man, Joseph, before them who was sold as a servant. "},{"num":18,"verse":"They hurt his feet with chains. He was put in irons, "},{"num":19,"verse":"until what he had said would happen came to pass. The Word of the Lord tested him. "},{"num":20,"verse":"The king sent and had him taken out of prison. The ruler of many people set him free. "},{"num":21,"verse":"He made him the lord of his house and ruler over all he had. "},{"num":22,"verse":"He could punish the rulers as he pleased. And he taught wisdom to the wise. "},{"num":23,"verse":"Then Israel also came into Egypt. So Jacob stayed in the land of Ham. "},{"num":24,"verse":"And He made the number of His people grow until they were stronger than those who held power over them."},{"num":25,"verse":"He turned their hearts to hate His people and to make plans against His servants. "},{"num":26,"verse":"He sent Moses, His servant, and Aaron whom He had chosen. "},{"num":27,"verse":"They did His great works for them to see, powerful works in the land of Ham. "},{"num":28,"verse":"He sent darkness and made the land dark. They did not fight against what He told them to do. "},{"num":29,"verse":"He changed their water into blood, so their fish died. "},{"num":30,"verse":"Their land became covered with frogs, even in the rooms of their kings. "},{"num":31,"verse":"He spoke and there came many flies all over their land. "},{"num":32,"verse":"He gave them hail instead of rain, and lightning like fire in their land. "},{"num":33,"verse":"He destroyed their vines and fig trees and the trees of their country. "},{"num":34,"verse":"He spoke and the locusts came. There were too many to number. "},{"num":35,"verse":"They ate up all the plants in their country. They ate all the fruit of their land. "},{"num":36,"verse":"He killed all the first-born in their land, the first fruits of all their strength."},{"num":37,"verse":"Then He brought Israel out with silver and gold. And there was not one weak person among their families. "},{"num":38,"verse":"Egypt was glad when they left. For they had become afraid of Israel. "},{"num":39,"verse":"He spread a cloud for a covering, and fire to give light at night. "},{"num":40,"verse":"They asked, and He brought them quails for meat. And He filled them with the bread of heaven. "},{"num":41,"verse":"He opened the rock and water flowed out. It flowed in the desert like a river. "},{"num":42,"verse":"For He remembered His holy Word with Abraham His servant. "},{"num":43,"verse":"And He brought His people out with joy, His chosen ones with singing. "},{"num":44,"verse":"He gave them the lands of the nations. They were given what others had worked for, "},{"num":45,"verse":"so that they might do what He told them and keep His Law. Praise the Lord!"}]