[{"num":105,"verse":"Thank the Lord for all the glorious things he does; proclaim them to the nations. "},{"num":2,"verse":"Sing his praises and tell everyone about his miracles. "},{"num":3,"verse":"Glory in the Lord; O worshipers of God, rejoice."},{"num":4,"verse":"Search for him and for his strength, and keep on searching!"},{"num":5,"verse":"Think of the mighty deeds he did for us, his chosen ones—descendants of God’s servant Abraham, and of Jacob. Remember how he destroyed our enemies. "},{"num":7,"verse":"He is the Lord our God. His goodness is seen everywhere throughout the land. "},{"num":8,"verse":"Though a thousand generations pass he never forgets his promise, his covenant with Abraham and Isaac "},{"num":10,"verse":"and confirmed with Jacob. This is his never-ending treaty with the people of Israel: “I will give you the land of Canaan as your inheritance.” "},{"num":12,"verse":"He said this when they were but few in number, very few, and were only visitors in Canaan. "},{"num":13,"verse":"Later they were dispersed among the nations and were driven from one kingdom to another; "},{"num":14,"verse":"but through it all he would not let one thing be done to them apart from his decision. He destroyed many a king who tried! "},{"num":15,"verse":"“Touch not these chosen ones of mine,” he warned, “and do not hurt my prophets.”"},{"num":16,"verse":"He called for a famine on the land of Canaan, cutting off its food supply. "},{"num":17,"verse":"Then he sent Joseph as a slave to Egypt to save his people from starvation. "},{"num":18,"verse":"There in prison they hurt his feet with fetters and placed his neck in an iron collar "},{"num":19,"verse":"until God’s time finally came—how God tested his patience! "},{"num":20,"verse":"Then the king sent for him and set him free. "},{"num":21,"verse":"He was put in charge of all the king’s possessions. "},{"num":22,"verse":"At his pleasure he could imprison the king’s aides and teach the king’s advisors."},{"num":23,"verse":"Then Jacob (Israel) arrived in Egypt and lived there with his sons. "},{"num":24,"verse":"In the years that followed, the people of Israel multiplied explosively until they were a greater nation than their rulers. "},{"num":25,"verse":"At that point God turned the Egyptians against the Israelis; they hated and enslaved them."},{"num":26,"verse":"But God sent Moses as his representative, and Aaron with him, "},{"num":27,"verse":"to call down miracles of terror upon the land of Egypt. "},{"num":28,"verse":"They followed his instructions. He sent thick darkness through the land "},{"num":29,"verse":"and turned the nation’s water into blood, poisoning the fish. "},{"num":30,"verse":"Then frogs invaded in enormous numbers; they were found even in the king’s private rooms. "},{"num":31,"verse":"When Moses spoke, the flies and other insects swarmed in vast clouds from one end of Egypt to the other. "},{"num":32,"verse":"Instead of rain he sent down murderous hail, and lightning flashes overwhelmed the nation. "},{"num":33,"verse":"Their grapevines and fig trees were ruined; all the trees lay broken on the ground. "},{"num":34,"verse":"He spoke, and hordes of locusts came "},{"num":35,"verse":"and ate up everything green, destroying all the crops. "},{"num":36,"verse":"Then he killed the oldest child in each Egyptian home, their pride and joy—"},{"num":37,"verse":"and brought his people safely out from Egypt, loaded with silver and gold; there were no sick and feeble folk among them then. "},{"num":38,"verse":"Egypt was glad when they were gone, for the dread of them was great."},{"num":39,"verse":"He spread out a cloud above them to shield them from the burning sun and gave them a pillar of flame at night to give them light. "},{"num":40,"verse":"They asked for meat, and he sent them quail and gave them manna—bread from heaven. "},{"num":41,"verse":"He opened up a rock, and water gushed out to form a river through the dry and barren land; "},{"num":42,"verse":"for he remembered his sacred promises to Abraham his servant."},{"num":43,"verse":"So he brought his chosen ones singing into the Promised Land. "},{"num":44,"verse":"He gave them the lands of the Gentiles, complete with their growing crops; they ate what others planted. "},{"num":45,"verse":"This was done to make them faithful and obedient to his laws. Hallelujah!"}]