[{"header":"The Conquered Kings"},{"num":12,"verse":"Now these are the kings of the land whom Bnei-Yisrael defeated and possessed their land beyond the Jordan toward the sunrise, from the valley of the Arnon to Mount Hermon, and all the Arabah eastward: "},{"num":2,"verse":"King Sihon of the Amorites, who lived in Heshbon and ruled from Aroer, which is on the edge of the valley of the Arnon, and the middle of the valley, and half Gilead, even up to the Jabbok River, the border of the children of Ammon; "},{"num":3,"verse":"and the Arabah up to the Sea of Chinneroth eastward, and as far as the sea of the Arabah, the Salt Sea, eastward the way to Beth-jeshimoth, and on the south, at the foot of the slopes of Pisgah. "},{"num":4,"verse":"Also the territory of King Og of Bashan, one of the remnant of the Rephaim, who lived at Ashtaroth and at Edrei, "},{"num":5,"verse":"and ruled over Mount Hermon and Salcah and all Bashan, as far as the border of the Geshurites and the Maacathites, and half of Gilead, as far as the border of King Sihon of Heshbon. "},{"num":6,"verse":"Moses the servant of Adonai and Bnei-Yisrael defeated them, then Moses the servant of Adonai gave it as a possession to the Reubenites, Gadites, and half-tribe of Manasseh."},{"num":7,"verse":"Now these are the kings of the land whom Joshua and Bnei-Yisrael defeated beyond the Jordan westward, from Baal-gad in the valley of Lebanon to Mount Halak that goes up to Seir (Joshua gave it to the tribes of Israel for a possession according to their divisions: "},{"num":8,"verse":"in the hill country, in the lowland, in the Arabah, on the slopes, in the wilderness, and in the Negev, the Hittites, the Amorites, the Canaanites, the Perizzites, the Hivites and the Jebusites): "},{"num":9,"verse":"one king of Jericho, one king of Ai which was near Bethel, "},{"num":10,"verse":"one king of Jerusalem, one king of Hebron, "},{"num":11,"verse":"one king of Jarmuth, one king of Lachish, "},{"num":12,"verse":"one king of Eglon, one king of Gezer, "},{"num":13,"verse":"one king of Debir, one king of Geder, "},{"num":14,"verse":"one king of Hormah, one king of Arad, "},{"num":15,"verse":"one king of Libnah, one king of Adullam, "},{"num":16,"verse":"one king of Makkedah, one king of Bethel, "},{"num":17,"verse":"one king of Tappuah, one king of Hepher, "},{"num":18,"verse":"one king of Aphek, one king of Sharon, "},{"num":19,"verse":"one king of Madon, one king of Hazor, "},{"num":20,"verse":"one king of Shimron-meron, one king of Achshaph, "},{"num":21,"verse":"one king of Taanach, one king of Megiddo, "},{"num":22,"verse":"one king of Kedesh, one king of Jokneam in Carmel, "},{"num":23,"verse":"one king of Dor in the region of Dor, one king of Goiim in the Gilgal, "},{"num":24,"verse":"one king of Tirzah, for a total of 31 kings."}]