[{"header":"Darius Finds Cyrus’ Decree"},{"num":6,"verse":"Then King Darius issued a decree, and a search was conducted in Babylon in the archives where the treasures [and records] were stored. "},{"num":2,"verse":"In Ecbatana in the fortress (palace) in the province of Media, a scroll was found on which this was recorded: “Memorandum— "},{"num":3,"verse":"In the first year of King Cyrus, Cyrus the king issued a decree: ‘Concerning the house of God in Jerusalem, let the temple (house), the place where sacrifices are offered, be rebuilt and let its foundations be strongly laid, its height and its width each 60 cubits, "},{"num":4,"verse":"with three layers of huge stones and one layer of timbers. Let the cost be paid from the royal treasury. "},{"num":5,"verse":"Also let the gold and silver utensils of the house of God, which Nebuchadnezzar took from the temple in Jerusalem and brought to Babylon, be returned and brought back to their [proper] places in the temple in Jerusalem; and you shall put them in the house of God.’"},{"num":6,"verse":"“Now therefore, Tattenai, governor of the province west of the [Euphrates] River, Shethar-bozenai and your associates, the officials who are west of the River, keep far away from there. "},{"num":7,"verse":"Leave the work on this house of God alone; let the governor of the Jews and the Jewish elders rebuild this house of God on its site. "},{"num":8,"verse":"Also, I issue a decree as to what you are to do for these Jewish elders for the rebuilding of this house of God: the full cost is to be paid to these people from the royal treasury out of the taxes of the provinces west of the River, and that without delay. "},{"num":9,"verse":"Whatever is needed, including young bulls, rams, and lambs for the burnt offerings to the God of heaven, and wheat, salt, wine, and anointing oil, according to the request of the priests at Jerusalem, let it all be given to them daily without fail, "},{"num":10,"verse":"so that they may offer pleasing (sweet-smelling) sacrifices to the God of heaven and pray for the life of the king and his sons. "},{"num":11,"verse":"I have also issued a decree that if there is any man who violates this edict, a beam of timber shall be pulled from his house [and set up]; then he shall be impaled on it, and his house shall be turned into a refuse heap for this [violation]. "},{"num":12,"verse":"May the God who has caused His Name to dwell there overthrow any king or people who attempts to alter this command, so as to destroy this house of God in Jerusalem. I, Darius, have issued this decree; let it be carried out quickly and with due diligence.”"},{"header":"The Temple Completed and Dedicated"},{"num":13,"verse":"Then Tattenai, governor of the province west of the [Euphrates] River, with Shethar-bozenai and their associates carried out the decree with due diligence, just as King Darius had sent and commanded. "},{"num":14,"verse":"And the Jewish elders built and prospered through the prophesying of Haggai the prophet and Zechariah the son of Iddo. They finished their building as commanded by the God of Israel and in accordance with the decree of Cyrus and Darius and Artaxerxes king of Persia. "},{"num":15,"verse":"This temple was finished on the third day of the month of Adar, in the sixth year of the reign of King Darius."},{"num":16,"verse":"And all Israel—the priests, the Levites, and the rest of the [former] exiles—celebrated the dedication of this house of God with joy. "},{"num":17,"verse":"They offered at the dedication of this house of God 100 bulls, 200 rams, 400 lambs, and, as a sin offering for all Israel, 12 male goats, according to the number of Israel’s tribes. "},{"num":18,"verse":"Then they appointed the priests to their divisions and the Levites in their orders for the service of God at Jerusalem, as it is written in the book of Moses."},{"header":"The Passover Observed"},{"num":19,"verse":"The [former] exiles kept the Passover on the fourteenth [day] of the first month. "},{"num":20,"verse":"For the priests and the Levites had purified themselves together; all of them were [ceremonially] clean. So they slaughtered the Passover lamb for all the exiles, for their brothers the priests, and for themselves. "},{"num":21,"verse":"The Passover was eaten by the sons (descendants) of Israel (Jacob) who returned from exile and by all those who had separated themselves from the [ceremonial] uncleanness of the nations of the land to join them, in order to seek the Lord God of Israel. "},{"num":22,"verse":"They observed the Feast of Unleavened Bread for seven days with joy, for the Lord had caused them to rejoice and had turned the heart of the king of Assyria toward them, so that he encouraged them and strengthened their hands in the work of the house of God, the God of Israel."}]