[{"header":"The Decree of Darius"},{"num":6,"verse":"Then King Darius issued a decree, and a search was made in the archives, where the treasures were stored in Babylon. "},{"num":2,"verse":"And at Achmetha, in the palace that is in the province of Media, a scroll was found, and in it a record was written thus:"},{"header":"The Temple Completed and Dedicated"},{"num":13,"verse":"Then Tattenai, governor of the region beyond the River, Shethar-Boznai, and their companions diligently did according to what King Darius had sent. "},{"num":14,"verse":"So the elders of the Jews built, and they prospered through the prophesying of Haggai the prophet and Zechariah the son of Iddo. And they built and finished it, according to the commandment of the God of Israel, and according to the command of Cyrus, Darius, and Artaxerxes king of Persia. "},{"num":15,"verse":"Now the temple was finished on the third day of the month of Adar, which was in the sixth year of the reign of King Darius. "},{"num":16,"verse":"Then the children of Israel, the priests and the Levites and the rest of the descendants of the captivity, celebrated the dedication of this house of God with joy. "},{"num":17,"verse":"And they offered sacrifices at the dedication of this house of God, one hundred bulls, two hundred rams, four hundred lambs, and as a sin offering for all Israel twelve male goats, according to the number of the tribes of Israel. "},{"num":18,"verse":"They assigned the priests to their divisions and the Levites to their divisions, over the service of God in Jerusalem, as it is written in the Book of Moses."},{"header":"The Passover Celebrated(T)"},{"num":19,"verse":"And the descendants of the captivity kept the Passover on the fourteenth day of the first month. "},{"num":20,"verse":"For the priests and the Levites had purified themselves; all of them were ritually clean. And they slaughtered the Passover lambs for all the descendants of the captivity, for their brethren the priests, and for themselves. "},{"num":21,"verse":"Then the children of Israel who had returned from the captivity ate together with all who had separated themselves from the filth of the nations of the land in order to seek the Lord God of Israel. "},{"num":22,"verse":"And they kept the Feast of Unleavened Bread seven days with joy; for the Lord made them joyful, and turned the heart of the king of Assyria toward them, to strengthen their hands in the work of the house of God, the God of Israel."}]