[{"num":6,"verse":"King Darius did just as his officials recommended. He commanded that his archives and the treasure houses in Babylon be searched to determine the validity of the Jews’ story. "},{"num":2,"verse":"A scroll was found of a decree by King Cyrus in the fortress at Ecbatana, the summer residence of the Babylonian and Persian kings, in the province of Media."},{"num":3,"verse":"In his first year as king, King Cyrus issued this decree:"},{"num":13,"verse":"Tattenai, governor of the province west of the Euphrates, Shethar-bozenai, and their fellow officials followed King Darius’ command diligently. "},{"num":14,"verse":"The Jewish elders successfully finished the temple as the True God of Israel had commanded through the prophets Haggai and Zechariah (son of Iddo) and with the decree of the Persian kings Cyrus, Darius, and Artaxerxes on the third day of the month of Adar in the sixth year of King Darius’ reign, 515 b.c. "},{"num":16,"verse":"All the returning Jews—the priests, the Levites, and the laypeople—joyously celebrated the dedication of the True God’s temple "},{"num":17,"verse":"with dedication offerings of 100 bulls, 200 rams, and 400 lambs, and sin offerings of 12 male goats (one for each of the tribes of Israel so that all Israel, exiled and in Jerusalem, would be forgiven). "},{"num":18,"verse":"Having dedicated the temple itself, the Israelites followed the book of Moses and organized the priests and Levites according to their duties so the True God in Jerusalem could be served."},{"num":19,"verse":"The exiles observed their first Passover Feast in the new temple on the 14th day of the first month. "},{"num":20,"verse":"After the priests and Levites had purified themselves, the Levites slaughtered the Passover lamb on behalf of themselves and all the Jewish exiles. "},{"num":21,"verse":"Then the Jewish exiles and the proselytes who had abandoned their pagan nations to follow the Eternal God of Israel wholeheartedly ate the Passover feast. "},{"num":22,"verse":"For the next seven days, they all joyously participated in the Feast of Unleavened Bread because the Eternal had given them a reason to celebrate: He influenced the King of Assyria to encourage the Jews’ rebuilding of the True God of Israel’s temple."}]