[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the Lord hath done to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Render, as in margin of the English Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord hath done or performed for Himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The LXX. and Vulg. here needlessly change the text into, “the Lord hath done ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And given it to thy neighbour . . . David.—An evil spirit personating Samuel would not have spoken thus; he would not have wished to help David, “the man after God’s own heart,” to the throne of Israel; nor would an evil spirit have spoken in such solemn terms of the punishment due to rebellion against God.—Bishop Wordsworth, who argues against the supposition that the shade of Samuel was an evil spirit.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And given it to thy neighbour . . . David.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—An ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "evil ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "spirit personating Samuel would not have spoken thus; he would not have wished to help David, “the man after God’s own heart,” to the throne of Israel; nor would an evil spirit have spoken in such solemn terms of the punishment due to rebellion against God.—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Bishop Wordsworth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "who argues against the supposition that the shade of Samuel was an evil spirit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 28:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord hath rent the kingdom out of thy hand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Here the prophet foretels that Saul should that day be stripped of the kingdom, and that it should be given to David. Then follows what nothing but infinite, unerring prescience could predict; an exact, minute, precise account of all the circumstances of the then depending event! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because thou obeyedst not the voice of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Saul’s sin in killing the Lord’s priests, and in seeking to kill David, is not here mentioned, because the decree of taking the kingdom from him was passed before those sins were committed. Delaney asks here, “Would an impostor” (for such this apparition must have been, if it were not Samuel) “have been so very zealous for a strict observance of the law and commands of God; and so rigid in pronouncing divine vengeance upon the violation of them; and in the depth of his cunning have limited that vengeance to time, place, and person; and all this at no greater distance than the next day? These suppositions are too wild to be seriously confuted; they are the very reverse of what should and would have been done on such an occasion, had imposture interfered in it. Every one knows the business of impostors is to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flatter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "delude, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deceive, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to answer ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doubtfully; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to promise good and put off the evil; it was this woman’s business in a particular manner to act thus. Had she promised Saul victory, and the success had answered, she was sure of considerable advantage. He, who could have no benefit from priests or from prophets, would, doubtless, have had her in high honour, and with good reason. If he died in the battle, all was safe; and even if he escaped and was worsted, what she said would at least have been taken for an indication of good wishes to the king and to his people; and so would be more likely to escape any after inquiry. Whereas, if she prognosticated evil to the royal race, she was sure of destruction, if the event did not at once justify and save her.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:7-19 When we go from the plain path of duty, every thing draws us further aside, and increases our perplexity and temptation. Saul desires the woman to bring one from the dead, with whom he wished to speak; this was expressly forbidden, De 18:11. All real or pretended witchcraft or conjuration, is a malicious or an ignorant attempt to gain knowledge or help from some creature, when it cannot be had from the Lord in the path of duty. While Samuel was living, we never read of Saul's going to advise with him in any difficulties; it had been well for him if he had. But now he is dead, Bring me up Samuel. Many who despise and persecute God's saints and ministers when living, would be glad to have them again, when they are gone. The whole shows that it was no human fraud or trick. Though the woman could not cause Samuel's being sent, yet Saul's inquiry might be the occasion of it. The woman's surprise and terror proved that it was an unusual and unexpected appearance. Saul had despised Samuel's solemn warnings in his lifetime, yet now that he hoped, as in defiance of God, to obtain some counsel and encouragement from him, might not God permit the soul of his departed prophet to appear to Saul, to confirm his former sentence, and denounce his doom? The expression, Thou and thy sons shall be with me, means no more than that they shall be in the eternal world. There appears much solemnity in God's permitting the soul of a departed prophet to come as a witness from heaven, to confirm the word he had spoken on earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To him - Better, \"for Himself,\" as in the margin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8-14. bring me him up, whom I shall name unto thee—This pythoness united to the arts of divination a claim to be a necromancer (De 18:11); and it was her supposed power in calling back the dead of which Saul was desirous to avail himself. Though she at first refused to listen to his request, she accepted his pledge that no risk would be incurred by her compliance. It is probable that his extraordinary stature, the deference paid him by his attendants, the easy distance of his camp from En-dor, and the proposal to call up the great prophet and first magistrate in Israel (a proposal which no private individual would venture to make), had awakened her suspicions as to the true character and rank of her visitor. The story has led to much discussion whether there was a real appearance of Samuel or not. On the one hand, the woman's profession, which was forbidden by the divine law, the refusal of God to answer Saul by any divinely constituted means, the well-known age, figure, and dress of Samuel, which she could easily represent herself, or by an accomplice—his apparition being evidently at some distance, being muffled, and not actually seen by Saul, whose attitude of prostrate homage, moreover, must have prevented him distinguishing the person though he had been near, and the voice seemingly issuing out of the ground, and coming along to Saul—and the vagueness of the information, imparted much which might have been reached by natural conjecture as to the probable result of the approaching conflict—the woman's representation—all of this has led many to think that this was a mere deception. On the other hand, many eminent writers (considering that the apparition came before her arts were put in practice; that she herself was surprised and alarmed; that the prediction of Saul's own death and the defeat of his forces was confidently made), are of opinion that Samuel really appeared.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord hath done to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as it is explained in the following words; the pronoun relative put before the noun to which it belongs, as is usual in the Hebrew text, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Psa 87:105:19 Proverbs 7:7,8 Jer 40:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " Psa 87:105:19 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",8 Jer 40:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Otherwise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is put for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; such changes of persons being frequent among the Hebrews. Otherwise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. for the accomplishment of his counsel, and prediction, and oath, and for the glory of his justice and holiness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As he spake by me:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " still he nourisheth this persuasion in Saul, that it was the true Samuel that spake to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord hath done to him,.... To David, Saul's enemy, as he insinuated he was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as he spake by me; pretending to be the true Samuel, and wearing the guise of him, he speaks his very words, which he was well acquainted with, and could deliver exactly as he did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord hath rent the kingdom out of thine hand, and given it to thy neighbour; which words are expressed by Samuel, 1 Samuel 15:28, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the Lord hath rent the kingdom out of thine hand, and given it to thy neighbour; which words are expressed by Samuel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "even unto David; which is added by the apparition, by way of explanation, interpreting the words of David; which he might safely venture to do, seeing such a train of circumstances had occurred since the delivery of these words, which plainly made it appear he was intended. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "even unto David; which is added by the apparition, by way of explanation, interpreting the words of David; which he might safely venture to do, seeing such a train of circumstances had occurred since the delivery of these words, which plainly made it appear he was intended. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD hath done to {g} him, as he spake by me: for the LORD hath rent the kingdom out of thine hand, and given it to thy neighbour, even to David:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD hath done to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " him, as he spake by me: for the LORD hath rent the kingdom out of thine hand, and given it to thy neighbour, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to David:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) That is, to David.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. if the Sept. reading is adopted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 28:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": or it may refer to God, and mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "“for himself,”",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in fulfilment of His will. But the Sept. and Vulg. read ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "“to thee.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as he spake by me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 17-19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jehovah hath done to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, \"hath wrought for himself;\" but the LXX., Vulgate, and some MSS. read \"hath done ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to thee,\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as in ver. 18. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As he spake by me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Saul's rebellion is there said, in ver. 23, to be a crime as great as the witchcraft which he was at that time so zealously punishing; here, where the sentence is being carried into execution, Saul has himself become guilty of what in his better hours he so abominated. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jehovah will also deliver Israel with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, \"will deliver Israel also with thee,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the nation is to share thy punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Tomorrow shalt thou and thy sons be with me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall be dead. Whence this voice came it is difficult to say. St. Augustine thought that the woman really conjured up a demon, who took the form of Samuel. Maimonides treats the whole as the effect of Saul's diseased imagination; while many modern commentators regard it as a well played piece of jugglery on the part of the woman, who recognised Saul at once on his entrance, but professed not to know him till his name was revealed to her by the pretended apparition, in whose name she reproached him for his crimes, announced to him, what now all were convinced of, that David was to be his successor, and foretold his defeat and death. In the face of such a passage as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we cannot believe that the Bible would set before us an instance of witchcraft employed with the Divine sanction for holy purposes; but we can easily believe that the woman would gladly take a bitter revenge on the man who had cruelly put to death all persons reputed to have such powers as those to which she laid claim. The object of the narrative is plainly to set before us the completeness of Saul's moral downfall and debasement. Here is the man endowed with so many and so great gifts of genius, and who in so many things started so well and behaved so nobly, the victim of a despairing melancholy; his conscience is blackened with the wholesale massacre of the priesthood, his imagination is ever brooding over the sick fancy of treason plotted by his son-in-law, whom now he supposes to be in the Philistine camp; his enemies have invaded his territory in extraordinary numbers and upon new ground; to him it seems as if they have come to dethrone him and place his crown on  David's head. In this dire extremity his one wish is to pry into futurity and learn his fate. There is no submission to God, no sorrow for disobedience, no sign of even a wish for amendment; it is to unholy arts that he looks, simply that he may know what a few more hours will make known to all. Neglecting his duties as a general and king, instead of making wise preparation for the coming fight, he disguises himself, takes a dangerous and wearisome journey round the enemies' camp, arrives at his destination by night, and, exhausted with hunger and mental agitation, seeks there for the knowledge unattainable in any upright manner from a reputed witch. He has rejected God, lost all the strength and comfort of true religion, and is become the victim of abject superstition. Whether he were the victim also of the woman's arts, or of his own sick fantasy, is not a matter of much consequence; the interest of the narrative lies in the revelation it makes to us of Saul's mental and moral state; and scarcely is there in the whole of Scripture anything more tragic than this narrative, or any more intense picture of the depth of degradation to which a noble but perverse intellect is capable of falling. 1 Samuel 28:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Samuel said, \"Why hast thou disturbed me (sc., from my rest in Hades; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to bring me up?\" It follows, no doubt, from this that Samuel had been disturbed from his rest by Saul; but whether this had been effected by the conjuring arts of the witch, or by a miracle of God himself, is left undecided. Saul replied, \"I am sore oppressed, for the Philistines fight against me, and God has departed from me, and answers me no more, either by prophets or by dreams; then I had thee called (on the intensified form ואקראה, vid., Ewald, 228, c.), to make known to me what I am to do.\" The omission of any reference to the Urim is probably to be interpreted very simply from the brevity of the account, and not from the fact that Saul shrank from speaking about the oracle of the high priest, on account of the massacre of the priests which had taken place by his command. There is a contradiction, however, in Saul's reply: for if God had forsaken him, he could not expect any answer from Him; and if God did not reply to his inquiry through the regularly appointed media of His revelation, how could he hope to obtain any divine revelation through the help of a witch? \"When living prophets gave no answer, he thought that a dead one might be called up, as if a dead one were less dependent upon God than the living, or that, even in opposition to the will of God, he might reply through the arts of a conjuring woman. Truly, if he perceived that God was hostile to him, he ought to have been all the more afraid, lest His enmity should be increased by his breach of His laws. But fear and superstition never reason\" (Clericus). Samuel points out this contradiction (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"Why dost thou ask me, since Jehovah hath departed from thee, and is become thine enemy?\" The meaning is: How canst thou expect an answer under these circumstances from me, the prophet of Jehovah? ערך, from ער, signifies an enemy here (from עיר, fervour); and this meaning is confirmed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Chald.). There is all the less ground for any critical objection to the reading, as the Chaldee and Vulgate give a periphrastic rendering of \"enemy,\" whilst the lxx, Syr., and Arab. have merely paraphrased according to conjectures. Samuel then announced his fate (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"Jehovah hath performed for himself, as He spake by me (לו, for himself, which the lxx and Vulg. have arbitrarily altered into לך, σοί, tibi (to thee), is correctly explained by Seb. Schmidt, 'according to His grace, or to fulfil and prove His truth'); and Jehovah hath rent the kingdom out of thy hand, and given it to thy neighbour David.\" The perfects express the purpose of God, which had already been formed, and was now about to be fulfilled.",
        "children": []
      }
    ]
  }
]