[{"header":"The sabbatical year"},{"num":25,"verse":"The Lord said to Moses on Mount Sinai,"},{"num":2,"verse":"Speak to the Israelites and say to them: Once you enter the land that I am giving you, the land must celebrate a sabbath rest to the Lord."},{"num":3,"verse":"You will plant your fields for six years, and prune your vineyards and gather their crops for six years."},{"num":4,"verse":"But in the seventh year the land will have a special sabbath rest, a Sabbath to the Lord: You must not plant your fields or prune your vineyards."},{"num":5,"verse":"You must not harvest the secondary growth of your produce or gather the grapes of your freely growing vines. It will be a year of special rest for the land."},{"num":6,"verse":"Whatever the land produces during its sabbath will be your food—for you, for your male and female servants, and for your hired laborers and foreign guests who live with you,"},{"num":7,"verse":"as well as for your livestock and for the wild animals in your land. All of the land’s produce can be eaten."},{"header":"The Jubilee year"},{"num":8,"verse":"Count off seven weeks of years—that is, seven times seven—so that the seven weeks of years totals forty-nine years."},{"num":9,"verse":"Then have the trumpet blown on the tenth day of the seventh month. Have the trumpet blown throughout your land on the Day of Reconciliation."},{"num":10,"verse":"You will make the fiftieth year holy, proclaiming freedom throughout the land to all its inhabitants. It will be a Jubilee year for you: each of you must return to your family property and to your extended family."},{"num":11,"verse":"The fiftieth year will be a Jubilee year for you. Do not plant, do not harvest the secondary growth, and do not gather from the freely growing vines"},{"num":12,"verse":"because it is a Jubilee: it will be holy to you. You can eat only the produce directly out of the field."},{"num":13,"verse":"Each of you must return to your family property in this year of Jubilee."},{"num":14,"verse":"When you sell something to or buy something from your fellow citizen, you must not cheat each other."},{"num":15,"verse":"You will buy from your fellow citizen according to the number of years since the Jubilee; he will sell to you according to the number of years left for harvests."},{"num":16,"verse":"You will raise the price if there are more years, or lower the price if there are less years because it is the number of harvests that are being sold to you."},{"num":17,"verse":"You must not cheat each other but fear your God because I am the Lord your God."},{"num":18,"verse":"You will observe my rules, and you will keep my regulations and do them so that you can live securely on the land."},{"header":"Food during fallow years"},{"num":19,"verse":"The land will give its fruit so that you can eat your fill and live securely on it."},{"num":20,"verse":"Suppose you ask, “What will we eat in the seventh year if we don’t plant or gather our crops then?”"},{"num":21,"verse":"I will send my blessing on you in the sixth year so that it will make enough produce for three years."},{"num":22,"verse":"You can plant again in the eighth year and eat food from the previous year’s produce until the ninth year. Until its produce comes, you will eat the food from the previous year."},{"header":"Buying back family property"},{"num":23,"verse":"The land must not be permanently sold because the land is mine. You are just immigrants and foreign guests of mine."},{"num":24,"verse":"Throughout the whole land that you possess, you must allow for the land to be bought back."},{"num":25,"verse":"When one of your fellow Israelites faces financial difficulty and must sell part of their family property, the closest relative will come and buy back what their fellow Israelite has sold."},{"num":26,"verse":"If the person doesn’t have someone to buy it back, but then manages to afford buying it back,"},{"num":27,"verse":"they must calculate the years since its sale and refund the balance to the person to whom they sold it. Then it will go back to the family property."},{"num":28,"verse":"If they cannot afford to make a refund to the buyer, whatever was sold will remain in the possession of the buyer until the Jubilee year. It will be released in the Jubilee year, at which point it will return to the family property."},{"num":29,"verse":"When a person sells a home in a walled city, it may be bought back until a year after its sale. The period for buying it back will be one year."},{"num":30,"verse":"If it is not bought back before a full year has passed, the house in the walled city will belong to the buyer permanently and their descendants forever. It will not be released at the Jubilee."},{"num":31,"verse":"But houses in settlements that are unwalled will be considered as if they were country fields. They can be bought back, and they must be released at the Jubilee."},{"num":32,"verse":"Levites will always have the right to buy back homes in the levitical cities that are part of their family property."},{"num":33,"verse":"Levite property that can be bought back—houses sold in a city that is their family property—must be released at the Jubilee, because homes in levitical cities are the Levites’ family property among the Israelites."},{"num":34,"verse":"But the pastureland around their cities cannot be sold, because that is their permanent family property."},{"header":"Poor Israelites and slavery"},{"num":35,"verse":"If one of your fellow Israelites faces financial difficulty and is in a shaky situation with you, you must assist them as you would an immigrant or foreign guest so that they can survive among you."},{"num":36,"verse":"Do not take interest from them, or any kind of profit from interest, but fear your God so that your fellow Israelite can survive among you."},{"num":37,"verse":"Do not lend a poor Israelite money with interest or lend food at a profit."},{"num":38,"verse":"I am the Lord your God, who brought you out from the land of Egypt to give you Canaan’s land and to be your God."},{"num":39,"verse":"If one of your fellow Israelites faces financial difficulty with you and sells themselves to you, you must not make him work as a slave."},{"num":40,"verse":"Instead, they will be like a hired laborer or foreign guest to you. They will work for you until the Jubilee year,"},{"num":41,"verse":"at which point the poor Israelite along with their children will be released from you. They can return to their extended family and to their family property."},{"num":42,"verse":"You must do this because these people are my servants—I brought them out of Egypt’s land. They must not be sold as slaves."},{"num":43,"verse":"You will not harshly rule over them but must fear your God."},{"num":44,"verse":"Regarding male or female slaves that you are allowed to have: You can buy a male or a female slave from the nations that are around you."},{"num":45,"verse":"You can also buy them from the foreign guests who live with you and from their extended families that are with you, who were born in your land. These can belong to you as property."},{"num":46,"verse":"You can pass them on to your children as inheritance that they can own as permanent property. You can make these people work as slaves, but you must not rule harshly over your own people, the Israelites."},{"num":47,"verse":"If an immigrant or foreign guest prospers financially among you, but your fellow Israelite faces financial difficulty and so sells themselves to the immigrant or foreign guest, or to a descendant of a foreigner,"},{"num":48,"verse":"the Israelite will have the right to be bought back after they sold themselves. One of their relatives can buy them back:"},{"num":49,"verse":"their uncle or cousin can buy them back; one of their blood relatives from their family can buy them back; or they may be able to afford their own purchase."},{"num":50,"verse":"The Israelite will calculate with their owner the time from the year they were sold until the Jubilee year. The price of their release will be based on the number of years they were with the owner, as in the case of a hired laborer."},{"num":51,"verse":"If there are many years left before the Jubilee, the Israelite will pay for their purchase in proportion to their purchase price."},{"num":52,"verse":"If only a few years are left, they will calculate that and pay for their purchase according to the years of service."},{"num":53,"verse":"Regardless, the Israelite will be to the buyer like a yearly laborer; the buyer must not harshly rule over them in your sight."},{"num":54,"verse":"If the Israelite is not bought back in one of these ways, they and their children must be released in the Jubilee year"},{"num":55,"verse":"because the Israelites belong to me as servants. They are my servants—I brought them out of Egypt’s land; I am the Lord your God."}]