[[],[{"type":"header","content":"The Sabbatical Year and Year of Jubilee"},{"type":"prose","content":"The LORD then spoke to Moses on Mount Sinai, saying,"}],[{"type":"prose","content":"“Speak to the sons of Israel and say to them, ‘When you come into the land which I am going to give you, then the land shall have a Sabbath to the LORD."}],[{"type":"prose","content":"For six years you shall sow your field, and for six years you shall prune your vineyard and gather in its produce,"}],[{"type":"prose","content":"but during the seventh year the land shall have a Sabbath rest, a Sabbath to the LORD; you shall not sow your field nor prune your vineyard."}],[{"type":"prose","content":"You shall not reap your harvest’s aftergrowth, and you shall not gather your grapes of untrimmed vines; the land shall have a sabbatical year."}],[{"type":"prose","content":" you shall have the Sabbath  of the land as food; for yourself, your male and female slaves, and your hired worker and your foreign resident, those who live as strangers among you."}],[{"type":"prose","content":"Even your cattle and the animals that are in your land shall have all its produce to eat."}],[{"type":"prose","content":"‘You are also to count off seven Sabbaths of years for yourself, seven times seven years, so that you have the time of the seven Sabbaths of years, , forty-nine years."}],[{"type":"prose","content":"You shall then sound a ram’s horn abroad on the tenth day of the seventh month; on the Day of Atonement you shall sound a horn all through your land."}],[{"type":"prose","content":"So you shall consecrate the fiftieth year and proclaim a release throughout the land to all its inhabitants. It shall be a jubilee for you, and each of you shall return to his own property, and each of you shall return to his family."}],[{"type":"prose","content":"You shall have the fiftieth year as a jubilee; you shall not sow, nor harvest its aftergrowth, nor gather grapes  its untrimmed vines."}],[{"type":"prose","content":"For it is a jubilee; it shall be holy to you. You shall eat its produce from the field."}],[{"type":"prose","content":"‘On this year of jubilee each of you shall return to his own property."}],[{"type":"prose","content":"Furthermore, if you make a sale to your friend, or buy from your friend’s hand, you shall not wrong one another."}],[{"type":"prose","content":"Corresponding to the number of years after the jubilee, you shall buy from your friend; he is to sell to you according to the number of years of crops."}],[{"type":"prose","content":"In proportion to a greater number of years you shall increase its price, and in proportion to fewer years you shall decrease its price, because  the number of crops  he is selling to you."}],[{"type":"prose","content":"So you shall not wrong one another, but you shall fear your God; for I am the LORD your God."}],[{"type":"prose","content":"‘You shall therefore follow My statutes and keep My judgments so as to carry them out, so that you may live securely on the land."}],[{"type":"prose","content":"Then the land will yield its produce, so that you can eat your fill and live securely on it."}],[{"type":"prose","content":"But if you say, “What are we going to eat in the seventh year if we do not sow nor gather in our produce?”"}],[{"type":"prose","content":"then I will so order My blessing for you in the sixth year that it will bring forth the produce for three years."}],[{"type":"prose","content":"When you are sowing the eighth year, you can still eat old things from the produce, eating  until the ninth year when its produce comes in."}],[{"type":"header","content":"The Law of Redemption"},{"type":"prose","content":"‘The land, moreover, shall not be sold permanently, because the land is Mine; for you are  strangers and residents with Me."}],[{"type":"prose","content":"So for every piece of your property, you are to provide for the redemption of the land."}],[{"type":"prose","content":"‘If a fellow countryman of yours becomes so poor that he sells part of his property, then his closest redeemer is to come and buy back what his relative has sold."}],[{"type":"prose","content":"Or in case someone has no redeemer, but recovers to find sufficient means for its redemption,"}],[{"type":"prose","content":"then he shall calculate the years since its sale and refund the balance to the man to whom he sold it, and so return to his property."}],[{"type":"prose","content":"But if he has not found sufficient means to get it back for himself, then what he has sold shall remain in the hands of its purchaser until the year of jubilee; but at the jubilee it shall revert, so that he may return to his property."}],[{"type":"prose","content":"‘Likewise, if a man sells a dwelling house in a walled city, then his redemption right remains  until a full year after its sale; his right of redemption lasts a full year."}],[{"type":"prose","content":"But if it is not bought back for him within the space of a full year, then the house that is in the walled city passes permanently to its purchaser throughout his generations; it does not revert in the jubilee."}],[{"type":"prose","content":"The houses of the villages, however, which have no surrounding wall, shall be regarded as open fields; they have redemption rights and revert in the jubilee."}],[{"type":"prose","content":"As for the cities of the Levites, the Levites have a permanent right of redemption for the houses of the cities which are their possession."}],[{"type":"prose","content":"What, therefore, belongs to the Levites may be redeemed, and a house sale in the city of this possession reverts in the jubilee, because the houses of the cities of the Levites are their possession among the sons of Israel."}],[{"type":"prose","content":"But pasture fields of their cities shall not be sold, for that is their permanent possession."}],[{"type":"header","content":"Of Poor Countrymen"},{"type":"prose","content":"‘Now in case a countryman of yours becomes poor and his means among you falter, then you are to sustain him,  a stranger or a resident, so that he may live with you."}],[{"type":"prose","content":"Do not take  interest from him, but fear your God, so that your countryman may live with you."}],[{"type":"prose","content":"You shall not give him your silver at interest, nor your food for profit."}],[{"type":"prose","content":"I am the LORD your God, who brought you out of the land of Egypt to give you the land of Canaan,  to be your God."}],[{"type":"prose","content":"‘Now if a countryman of yours becomes so poor with regard to you that he sells himself to you, you shall not subject him to a slave’s service."}],[{"type":"prose","content":"He shall be with you as a hired worker, as  a foreign resident; he shall serve with you up to the year of jubilee."}],[{"type":"prose","content":"He shall then leave you, he and his sons with him, and shall go back to his family, so that he may return to the property of his forefathers."}],[{"type":"prose","content":"For they are My servants whom I brought out from the land of Egypt; they are not to be sold  a slave sale."}],[{"type":"prose","content":"You shall not rule over him with severity, but are to revere your God."}],[{"type":"prose","content":"As for your male and female slaves whom you may have—you may acquire male and female slaves from the  nations that are around you."}],[{"type":"prose","content":"You may also acquire  from the sons of the foreign residents who reside among you, and from their families who are with you, whom they will have produced in your land; they also may become your possession."}],[{"type":"prose","content":"You may also pass them on as an inheritance to your sons after you, to receive as a possession; you can use them as permanent slaves. But in respect to your countrymen, the sons of Israel, you shall not rule with severity over one another."}],[{"type":"header","content":"Of Redeeming a Person Who Is Poor"},{"type":"prose","content":"‘Now if the means of a stranger or of a foreign resident with you becomes sufficient, and a countryman of yours becomes poor in relation to him and sells himself to a stranger who is residing with you, or to the descendants of a stranger’s family,"}],[{"type":"prose","content":"then he shall have redemption right after he has been sold. One of his brothers may redeem him,"}],[{"type":"prose","content":"or his uncle, or his uncle’s son may redeem him, or one of his blood relatives from his family may redeem him; or if he prospers, he may redeem himself."}],[{"type":"prose","content":"He then, with his purchaser, shall calculate from the year when he sold himself to him up to the year of jubilee; and the price of his sale shall correspond to the number of years  like the days of a hired worker  he will be with him."}],[{"type":"prose","content":"If there are still many years , he shall refund part of his purchase price in proportion to them for his own redemption;"}],[{"type":"prose","content":"but if few years remain until the year of jubilee, he shall so calculate with him. In proportion to his years he is to refund  his redemption."}],[{"type":"prose","content":"He shall be with him like a worker hired year by year; he shall not rule over him with severity in your sight."}],[{"type":"prose","content":"Even if he is not redeemed by these means, he shall still leave in the year of jubilee, he and his sons with him."}],[{"type":"prose","content":"For the sons of Israel are My servants; they are My servants whom I brought out from the land of Egypt. I am the LORD your God."}]]