[{"header":"The Sabbath Year"},{"num":25,"verse":"While Moses was on Mount Sinai, the Lord said to him,"},{"num":2,"verse":"“Give the following instructions to the people of Israel. When you have entered the land I am giving you, the land itself must observe a Sabbath rest before the Lord every seventh year."},{"num":3,"verse":"For six years you may plant your fields and prune your vineyards and harvest your crops,"},{"num":4,"verse":"but during the seventh year the land must have a Sabbath year of complete rest. It is the Lord’s Sabbath. Do not plant your fields or prune your vineyards during that year."},{"num":5,"verse":"And don’t store away the crops that grow on their own or gather the grapes from your unpruned vines. The land must have a year of complete rest."},{"num":6,"verse":"But you may eat whatever the land produces on its own during its Sabbath. This applies to you, your male and female servants, your hired workers, and the temporary residents who live with you."},{"num":7,"verse":"Your livestock and the wild animals in your land will also be allowed to eat what the land produces."},{"header":"The Year of Jubilee"},{"num":8,"verse":"“In addition, you must count off seven Sabbath years, seven sets of seven years, adding up to forty-nine years in all."},{"num":9,"verse":"Then on the Day of Atonement in the fiftieth year, blow the ram’s horn loud and long throughout the land."},{"num":10,"verse":"Set this year apart as holy, a time to proclaim freedom throughout the land for all who live there. It will be a jubilee year for you, when each of you may return to the land that belonged to your ancestors and return to your own clan."},{"num":11,"verse":"This fiftieth year will be a jubilee for you. During that year you must not plant your fields or store away any of the crops that grow on their own, and don’t gather the grapes from your unpruned vines."},{"num":12,"verse":"It will be a jubilee year for you, and you must keep it holy. But you may eat whatever the land produces on its own."},{"num":13,"verse":"In the Year of Jubilee each of you may return to the land that belonged to your ancestors."},{"num":14,"verse":"“When you make an agreement with your neighbor to buy or sell property, you must not take advantage of each other."},{"num":15,"verse":"When you buy land from your neighbor, the price you pay must be based on the number of years since the last jubilee. The seller must set the price by taking into account the number of years remaining until the next Year of Jubilee."},{"num":16,"verse":"The more years until the next jubilee, the higher the price; the fewer years, the lower the price. After all, the person selling the land is actually selling you a certain number of harvests."},{"num":17,"verse":"Show your fear of God by not taking advantage of each other. I am the Lord your God."},{"num":18,"verse":"“If you want to live securely in the land, follow my decrees and obey my regulations."},{"num":19,"verse":"Then the land will yield large crops, and you will eat your fill and live securely in it."},{"num":20,"verse":"But you might ask, ‘What will we eat during the seventh year, since we are not allowed to plant or harvest crops that year?’"},{"num":21,"verse":"Be assured that I will send my blessing for you in the sixth year, so the land will produce a crop large enough for three years."},{"num":22,"verse":"When you plant your fields in the eighth year, you will still be eating from the large crop of the sixth year. In fact, you will still be eating from that large crop when the new crop is harvested in the ninth year."},{"header":"Redemption of Property"},{"num":23,"verse":"“The land must never be sold on a permanent basis, for the land belongs to me. You are only foreigners and tenant farmers working for me."},{"num":24,"verse":"“With every purchase of land you must grant the seller the right to buy it back."},{"num":25,"verse":"If one of your fellow Israelites falls into poverty and is forced to sell some family land, then a close relative should buy it back for him."},{"num":26,"verse":"If there is no close relative to buy the land, but the person who sold it gets enough money to buy it back,"},{"num":27,"verse":"he then has the right to redeem it from the one who bought it. The price of the land will be discounted according to the number of years until the next Year of Jubilee. In this way the original owner can then return to the land."},{"num":28,"verse":"But if the original owner cannot afford to buy back the land, it will remain with the new owner until the next Year of Jubilee. In the jubilee year, the land must be returned to the original owners so they can return to their family land."},{"num":29,"verse":"“Anyone who sells a house inside a walled town has the right to buy it back for a full year after its sale. During that year, the seller retains the right to buy it back."},{"num":30,"verse":"But if it is not bought back within a year, the sale of the house within the walled town cannot be reversed. It will become the permanent property of the buyer. It will not be returned to the original owner in the Year of Jubilee."},{"num":31,"verse":"But a house in a village—a settlement without fortified walls—will be treated like property in the countryside. Such a house may be bought back at any time, and it must be returned to the original owner in the Year of Jubilee."},{"num":32,"verse":"“The Levites always have the right to buy back a house they have sold within the towns allotted to them."},{"num":33,"verse":"And any property that is sold by the Levites—all houses within the Levitical towns—must be returned in the Year of Jubilee. After all, the houses in the towns reserved for the Levites are the only property they own in all Israel."},{"num":34,"verse":"The open pastureland around the Levitical towns may never be sold. It is their permanent possession."},{"header":"Redemption of the Poor and Enslaved"},{"num":35,"verse":"“If one of your fellow Israelites falls into poverty and cannot support himself, support him as you would a foreigner or a temporary resident and allow him to live with you."},{"num":36,"verse":"Do not charge interest or make a profit at his expense. Instead, show your fear of God by letting him live with you as your relative."},{"num":37,"verse":"Remember, do not charge interest on money you lend him or make a profit on food you sell him."},{"num":38,"verse":"I am the Lord your God, who brought you out of the land of Egypt to give you the land of Canaan and to be your God."},{"num":39,"verse":"“If one of your fellow Israelites falls into poverty and is forced to sell himself to you, do not treat him as a slave."},{"num":40,"verse":"Treat him instead as a hired worker or as a temporary resident who lives with you, and he will serve you only until the Year of Jubilee."},{"num":41,"verse":"At that time he and his children will no longer be obligated to you, and they will return to their clans and go back to the land originally allotted to their ancestors."},{"num":42,"verse":"The people of Israel are my servants, whom I brought out of the land of Egypt, so they must never be sold as slaves."},{"num":43,"verse":"Show your fear of God by not treating them harshly."},{"num":44,"verse":"“However, you may purchase male and female slaves from among the nations around you."},{"num":45,"verse":"You may also purchase the children of temporary residents who live among you, including those who have been born in your land. You may treat them as your property,"},{"num":46,"verse":"passing them on to your children as a permanent inheritance. You may treat them as slaves, but you must never treat your fellow Israelites this way."},{"num":47,"verse":"“Suppose a foreigner or temporary resident becomes rich while living among you. If any of your fellow Israelites fall into poverty and are forced to sell themselves to such a foreigner or to a member of his family,"},{"num":48,"verse":"they still retain the right to be bought back, even after they have been purchased. They may be bought back by a brother,"},{"num":49,"verse":"an uncle, or a cousin. In fact, anyone from the extended family may buy them back. They may also redeem themselves if they have prospered."},{"num":50,"verse":"They will negotiate the price of their freedom with the person who bought them. The price will be based on the number of years from the time they were sold until the next Year of Jubilee—whatever it would cost to hire a worker for that period of time."},{"num":51,"verse":"If many years still remain until the jubilee, they will repay the proper proportion of what they received when they sold themselves."},{"num":52,"verse":"If only a few years remain until the Year of Jubilee, they will repay a small amount for their redemption."},{"num":53,"verse":"The foreigner must treat them as workers hired on a yearly basis. You must not allow a foreigner to treat any of your fellow Israelites harshly."},{"num":54,"verse":"If any Israelites have not been bought back by the time the Year of Jubilee arrives, they and their children must be set free at that time."},{"num":55,"verse":"For the people of Israel belong to me. They are my servants, whom I brought out of the land of Egypt. I am the Lord your God."}]