[{"header":"[BEHAR]"},{"num":25,"verse":"And Hashem spoke unto Moshe in Mt. Sinai, saying,"},{"num":2,"verse":"Speak unto the Bnei Yisroel, and say unto them, When ye come into HaAretz which I give you, then shall HaAretz observe a Shabbos rest unto Hashem."},{"num":3,"verse":"Six years thou shalt sow thy sadeh, and six years thou shalt prune thy kerem, and gather in the fruit thereof;"},{"num":4,"verse":"But in the Shanah HaShevi’it shall be a Shabbos Shabbaton unto HaAretz, a Shabbos unto Hashem; thou shalt neither sow thy sadeh, nor prune thy kerem (vineyard)."},{"num":5,"verse":"That which groweth of its own accord of thy harvest thou shalt not reap, neither gather the grapes of thy untended vine; for it is Shnat Shabbaton unto HaAretz."},{"num":6,"verse":"And the Shabbos of HaAretz shall be food for you; for thee, and for thy eved, and for thy maid, and for thy hired servant, and for thy toshav (guest) that sojourneth with thee."},{"num":7,"verse":"And for thy cattle, and for the wild animal that are in thy land, shall all the tevuah (increase) thereof be to eat."},{"num":8,"verse":"And thou shalt count seven Shabbatot of shanim unto thee, seven times seven shanim; and the period of the sheva Shabbatot of shanim shall be unto thee forty and nine shanim."},{"num":9,"verse":"Then shalt thou cause the shofar to sound a broken blast on the tenth day of the seventh month, in the Yom HaKippurim shall ye make the shofar sound throughout all your land."},{"num":10,"verse":"And ye shall treat as kadosh the fiftieth year, and proclaim deror (freedom) throughout all the land unto all the inhabitants thereof; it shall be a Yovel (Jubilee) unto you; and ye shall return every man unto the ancestral heritage of his possession, and ye shall return every man unto his mishpochah."},{"num":11,"verse":"A Yovel shall that fiftieth year be unto you; ye shall not sow, neither reap that which groweth of itself in it, nor gather the grapes in it of thy untended vine,"},{"num":12,"verse":"For it is the Yovel; it shall be kodesh unto you; ye shall eat the tevuah (increase) thereof out of the sadeh."},{"num":13,"verse":"In this Shnat Yovel ye shall return every man unto his possession."},{"num":14,"verse":"And if thou sell ought unto thy neighbor, or buyest ought of thy neighbor’s hand, ye shall not take advantage of one another."},{"num":15,"verse":"According to the number of shanim after the Yovel thou shalt buy of thy neighbor, and according unto the number of shanim of the tevuot (harvests, increases) he shall sell unto thee."},{"num":16,"verse":"According to the multitude of shanim thou shalt increase the price thereof, and according to the fewness of shanim thou shalt diminish the price of it; for according to the number of the shanim of the tevuot doth he sell unto thee."},{"num":17,"verse":"Ye shall not therefore take advantage of one another; but thou shalt fear Eloheicha: for I am Hashem Eloheichem."},{"num":18,"verse":"Wherefore ye shall do My chukkot, and be shomer over My mishpatim, and do them; and ye shall dwell in HaAretz in safety."},{"num":19,"verse":"And HaAretz shall yield her pri, and ye shall eat your fill, and dwell therein in safety."},{"num":20,"verse":"And if ye shall say, What shall we eat in the shanah hashevi’it? Behold, we shall not sow, nor gather in our tevuah;"},{"num":21,"verse":"Then I will command Birkhati (My Blessing) upon you in the sixth year, and it shall bring forth the tevuah for shalosh hashanim."},{"num":22,"verse":"And ye shall sow the shanah hasheminit, and eat yet of tevuah yashan (old increase) until the ninth year; until her harvest come in, ye shall eat of the yashan (old)."},{"num":23,"verse":"HaAretz shall not be sold permanently: for HaAretz is Mine, for ye are gerim and toshavim with Me."},{"num":24,"verse":"And in all the eretz of your possession ye shall grant a Geulah for HaAretz."},{"num":25,"verse":"If thy brother become poor, and hath sold away some of his possession, and his Go’el HaKarov (Near Kinsman Redeemer) come to redeem it, then shall he redeem that which his brother sold."},{"num":26,"verse":"And if the man does not have for him a Go’el, and himself be able to effect the Geulah,"},{"num":27,"verse":"Then let him count the shanim from the sale thereof, and refund the balance unto the man to whom he sold it; that he may return unto his possession."},{"num":28,"verse":"But if he be not able to restore it to him, then that which is sold shall remain in the hand of him that hath bought it until the Shnat HaYovel; and in the Yovel it shall be returned, and he shall return unto his possession."},{"num":29,"verse":"And if a man sell a bais moshav in a walled city, then he retains the right of Geulah a full year after its sale; within a full year may he redeem it."},{"num":30,"verse":"And if it be not redeemed within the space of a full year, then the bais that is in the walled city shall be established forever to him that bought it throughout his dorot; it shall not return in the Yovel."},{"num":31,"verse":"But the batim (houses) of the villages which have no chomah (wall) round about them shall be considered as the fields of the country; Geulah shall be for it, and in the Yovel it must return."},{"num":32,"verse":"Notwithstanding, the towns of the Levi’im, and the batim (houses) of the towns of their possession, there is a Geulat Olam for the Levi’im."},{"num":33,"verse":"And what one will buy from the Levi’im, the bais that was sold, and the town of his possession, shall be released in the year of Yovel; for the batim of the towns of the Levi’im are their possession among the Bnei Yisroel."},{"num":34,"verse":"But the sadeh of the open land of their towns may not be sold; for it is their achuzzat olam (perpetual heritage)."},{"num":35,"verse":"And if thy brother become poor, and his hand fails with thee; then thou shalt strengthen him; yea, though he be a ger, or a toshav; that he may live among thee."},{"num":36,"verse":"Take thou no neshekh of him, or increase; but fear Eloheicha; that thy brother may live among thee."},{"num":37,"verse":"Thou shalt not lend him thy kesef at neshekh, nor give him thy food for increase."},{"num":38,"verse":"I am Hashem Eloheichem, which brought you forth out of Eretz Mitzrayim, to give you Eretz Kena’an, and to be Elohim unto you."},{"num":39,"verse":"And if thy brother that dwelleth by thee become poor, and be sold unto thee, thou shalt not compel him to do avodat eved;"},{"num":40,"verse":"But as a sakhir, and as a toshav, he shall be among thee, and shall serve thee unto the Shnat HaYovel."},{"num":41,"verse":"And then shall he depart from thee, both he and his banim with him, and shall return unto his own mishpochah, and unto the Achuzzat of his Avot shall he return."},{"num":42,"verse":"For they are My Eved, which I brought forth out of Eretz Mitzrayim; they shall not be sold in the manner of an eved."},{"num":43,"verse":"Thou shalt not rule over him with rigor; but shalt fear Eloheicha."},{"num":44,"verse":"Both thy bondmen, and thy bondmaids, which thou shalt have, shall be of the Goyim that are round about you; of them shall ye buy eved and amah."},{"num":45,"verse":"Moreover of the bnei hatoshavim that do sojourn among you, of them shall ye buy, and of their mishpachot that are among you, which they fathered in your land; and they shall be your possession."},{"num":46,"verse":"And ye shall take them as an inheritance for your banim after you, to inherit them for a possession; they shall be your bondmen forever; but over your brethren, the Bnei Yisroel, ye shall not rule one over another with rigor."},{"num":47,"verse":"And if a ger or toshav grow rich by thee, and thy brother that dwelleth by him grow poor, and sell himself unto the foreigner among thee, or to the eker (member) mishpachat of the ger;"},{"num":48,"verse":"After that he is sold, his Geulah remains; one of his brethren may redeem him,"},{"num":49,"verse":"Either his dod, or ben dod of him, may redeem him, or any that is near of kin unto him of his mishpachat may redeem him; or if he be able, he may redeem himself."},{"num":50,"verse":"And he shall reckon with him that bought him from the year that he was sold to him unto the Shnat HaYovel; and the price of his release shall be based on the number of shanim, according to the value of a sakhir’s pay shall it be with him."},{"num":51,"verse":"If there be yet many shanim remaining, according unto them he shall give for his Geulah the kesef that he was bought for."},{"num":52,"verse":"And if there remain but few shanim unto the Shnat HaYovel, then he shall count that, and according unto his shanim shall he pay the price of his Geulah."},{"num":53,"verse":"And as a sakhir hired shanah b’shanah shall he be with him; and the other shall not rule with rigor over him in thy sight."},{"num":54,"verse":"And if he be not redeemed in these shanim, then he shall be released in the Shnat HaYovel, both he, and his banim with him."},{"num":55,"verse":"For unto Me the Bnei Yisroel are avadim; they are My avadim whom I brought forth out of Eretz Mitzrayim: I am Hashem Eloheichem."}]