[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Arioch.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 2:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Daniel answered with counsel and wisdom — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This seems to be better rendered in the Vulgate, namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tunc Daniel requisivit de lege atque sententia ab Arioch — Then Daniel inquired of Arioch concerning the law and decree, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, which the king had made for destroying the wise men: that is, he inquired the reason of the decree and judgment issued against them; for as he had not been called in unto the king with the other wise men, he probably was ignorant of all that had passed with regard to the king’s dream. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "שׂעם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wisdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "usually signifies an edict, or public decree, set forth by authority. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Captain of the king’s guard — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Literally, chief of the king’s executioners. Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αρχιμαγειρω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the chief butcher [or chief cook.] The term ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "רב שׂבחיא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may probably mean, the leader of the guard appointed for capital punishments. Nor does this office seem to have been at all infamous; for Arioch had free access to the king, as we find, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And perhaps his office might be to execute any of the king’s commands on his subjects, whether they related to honour or dishonour, to life or to death. The same title is given to Nebuzar-adan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and from the character of the commander, it seems to mean a person of the first authority over the soldiery. Mr. Bruce (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Trav., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 455) speaks of an officer, called the executioner of the camp, whose business it was to attend at capital punishments; and this belonged only to a detachment of the royal Abyssinian army.” — Wintle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:14-23 Daniel humbly prayed that God would discover to him the king's dream, and the meaning of it. Praying friends are valuable friends; and it well becomes the greatest and best men to desire the prayers of others. Let us show that we value our friends, and their prayers. They were particular in prayer. And whatever we pray for, we can expect nothing but as the gift of God's mercies. God gives us leave in prayer to tell our wants and burdens. Their plea with God was, the peril they were in. The mercy Daniel and his fellows prayed for, was bestowed. The fervent prayers of righteous men avail much. Daniel was thankful to God for making known that to him, which saved the lives of himself and his fellows. How much more should we be thankful to God, for making known the great salvation of the soul to those who are not among the worldly wise and prudent!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Daniel answered - Margin, \"returned.\" The original literally is, \"returned counsel and wisdom,\" meaning, that he returned an answer which was replete with wisdom. It would seem probable that Arioch had communicated to Daniel the decree of the king, and had stated to him that he was involved in that decree, and must prepare to die.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Counsel and wisdom - That is, \"wise counsel.\" He evinced great prudence and discretion in what he said. He made such a suggestion to Arioch as, if acted on, would stay the execution of the sentence against all the wise men, and would secure the object which the king had in view. What was the exact nature of this answer is not mentioned. It is probable, however, that it was that he might be enabled to disclose the dream, and that he made this so plausible to Arioch, that he was disposed to allow him to make the trial. It is evident that Arioch would not have consented to arrest the execution of the sentence, unless it had appeared to him to be in the highest degree probable that he would be able to relieve the anxiety of the king. Knowing that the \"main\" object of the king was to obtain the interpretation of his dream, and seeing that this object was not any the more likely to be secured by the execution of this stern decree, and knowing the high favor with which Daniel had been received at court Daniel 1:19-21, he seems to have been willing to assume some measure of responsibility, and to allow Daniel to make his own representation to the king.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Counsel and wisdom - That is, \"wise counsel.\" He evinced great prudence and discretion in what he said. He made such a suggestion to Arioch as, if acted on, would stay the execution of the sentence against all the wise men, and would secure the object which the king had in view. What was the exact nature of this answer is not mentioned. It is probable, however, that it was that he might be enabled to disclose the dream, and that he made this so plausible to Arioch, that he was disposed to allow him to make the trial. It is evident that Arioch would not have consented to arrest the execution of the sentence, unless it had appeared to him to be in the highest degree probable that he would be able to relieve the anxiety of the king. Knowing that the \"main\" object of the king was to obtain the interpretation of his dream, and seeing that this object was not any the more likely to be secured by the execution of this stern decree, and knowing the high favor with which Daniel had been received at court ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:19-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he seems to have been willing to assume some measure of responsibility, and to allow Daniel to make his own representation to the king.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To Arioch the captain of the king's guard - Margin, \"chief of the executioners, or slaughter-men, or chief marshal.\" Greek, ἀρχιμαγείρῳ τοῦ βασιλέως  archimageirō tou basileōs - chief cook of the king. The Vulgate renders this,\" Then Daniel inquired respecting the law and the sentence of Arioch, the commander of the royal army.\" The Chaldee word rendered \"guard\" is טבחיא  ṭabâchayâ'. It is derived from טבח  ṭâbach, to slaughter; to kill animals; and then to kill or slay men. The \"noun,\" then, means a slaughterer or slayer; a cook; an executioner, or one who kills men at the will of a sovereign, or by due sentence of law. There can be no doubt that the word here refers to Arioch, as sent out to execute this sentence; yet we are not to regard hint as a mere executioner, or as we would a hangman, for undoubtedly the king would entrust this sentence to one who was of respectable, if not of high rank. It is probable that one of the principal officers of his body-guard would be entrusted with the execution of such a sentence. In 1 Samuel 8:13, the word is rendered \"cooks.\" It does not elsewhere occur. That he was not a \"mere\" executioner is apparent from the title given him in the next verse, where he is called \"the king's captain.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To Arioch the captain of the king's guard - Margin, \"chief of the executioners, or slaughter-men, or chief marshal.\" Greek, ἀρχιμαγείρῳ τοῦ βασιλέως  archimageirō tou basileōs - chief cook of the king. The Vulgate renders this,\" Then Daniel inquired respecting the law and the sentence of Arioch, the commander of the royal army.\" The Chaldee word rendered \"guard\" is טבחיא  ṭabâchayâ'. It is derived from טבח  ṭâbach, to slaughter; to kill animals; and then to kill or slay men. The \"noun,\" then, means a slaughterer or slayer; a cook; an executioner, or one who kills men at the will of a sovereign, or by due sentence of law. There can be no doubt that the word here refers to Arioch, as sent out to execute this sentence; yet we are not to regard hint as a mere executioner, or as we would a hangman, for undoubtedly the king would entrust this sentence to one who was of respectable, if not of high rank. It is probable that one of the principal officers of his body-guard would be entrusted with the execution of such a sentence. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the word is rendered \"cooks.\" It does not elsewhere occur. That he was not a \"mere\" executioner is apparent from the title given him in the next verse, where he is called \"the king's captain.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Which was gone forth to slay ... - He had gone to execute the decree, and its execution had already commenced. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which was gone forth to slay ... - He had gone to execute the decree, and its execution had already commenced. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. captain of the king's guard—commanding the executioners (Margin; and Ge 37:36, Margin).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Daniel answered with counsel and wisdom,.... In a discreet manner, using soft words and gentle language, humbly and modestly inquiring what should be the meaning of all this. The Vulgate Latin version is, \"he inquired of the law and decree\" (i); what was the reason of the king's orders, which this officer had in commission to execute; with which others agree: or, \"he made to return the counsel and decree\" (k), as some choose to render it; he stopped the execution of it for the present, by his inquiries and prudent behaviour but neither seem to agree with what follows; the first sense is best: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to Arioch the captain of the king's guards: there was a king of this name, Genesis 14:1, this man, according to the Septuagint version, and others that follow it, was the chief of the king's cooks; and Aben Ezra says the word in the Arabic language so signifies: or, as it may be rendered, \"the chief of the slaughterers\" (l); the executioners of malefactors, so Jarchi; he was the king's chief executioner, with which agrees the business he was now charged with: the Vulgate Latin version calls him the prince of the militia; and others the king's provost marshal: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to Arioch the captain of the king's guards: there was a king of this name, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this man, according to the Septuagint version, and others that follow it, was the chief of the king's cooks; and Aben Ezra says the word in the Arabic language so signifies: or, as it may be rendered, \"the chief of the slaughterers\" (l); the executioners of malefactors, so Jarchi; he was the king's chief executioner, with which agrees the business he was now charged with: the Vulgate Latin version calls him the prince of the militia; and others the king's provost marshal: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "which was gone forth to slay the wise men of Babylon; who by the king's order went forth from the court into the city, to slay all in Babylon who went under the character of wise men; they were not among those that could not answer the king's demand, since they declared none could do it; and therefore he ordered them all to be slain, as a set of useless men in his kingdom. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i)   \"interrogavit de lege et decreto\", V. L.; \"super consilio\", Munster, Calvin; \"de eo consilio\", Castalio. (k) \"Redire fecit consilium et statutum\", Pagninus, Montanus; \"reverti fecit\", Michaelis. (l)  \"principem carnificum\", Montanus, Grotius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i)   \"interrogavit de lege et decreto\", V. L.; \"super consilio\", Munster, Calvin; \"de eo consilio\", Castalio. (k) \"Redire fecit consilium et statutum\", Pagninus, Montanus; \"reverti fecit\", Michaelis. (l)  \"principem carnificum\", Montanus, Grotius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Daniel answered with counsel and wisdom to Arioch the captain of the king's guard, which was gone forth to slay the wise men of Babylon:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answered with counsel and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "returned counsel and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "tact",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taste",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so figuratively of the faculty which discriminates and selects what is suitable for a given occasion. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘And blessed be thy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ (R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "marg.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), of the tact displayed by Abigail in averting David’s vengeance from Nabal; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘and taketh away the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the elders;’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 26:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the same phrase as here), ‘than seven men ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answering with discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ (lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "returning discretion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Arioch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The name, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of an ancient king of Ellasar (Larsa, in S. Babylonia); and, no doubt, borrowed thence, both here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdt 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where it is the name of a ‘king of the Elymaeans’). “The name was Sumerian and not used at that period [Nebuchadnezzar’s] of Babylonian history” (Sayce, in Hastings’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. of the Bible, s.v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "captain of the king’s guard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘Captain of the guard’ is the same expression which occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 39:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., of an officer of Nebuchadnezzar, and (with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rab",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in Gen. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 39:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of an officer of Pharaoh. It is lit. ‘captain (or superintendent, chief) of the slaughterers’ (viz. of animals [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " executioners]): the royal butchers came in some way to form the royal body-guard (cf. W. R. Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "OTJC",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[206][207], p. 262 f.). The use of the same term in reference to two such different countries as Egypt and Babylon, shews that, though it happens only to be applied to foreigners, it was really a native Hebrew title.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[206] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "TJC.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " W. Robertson Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Old Testament in the Jewish Church",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ed. 2, 1892.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[207] W. Robertson Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Old Testament in the Jewish Church",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ed. 2, 1892.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Daniel answered with counsel and wisdom to Arioch the captain of the king's guard, which was gone forth to slay the wise men of Babylon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The text here does not seem to have differed much from the Egyptian recension, the translation of which we have in the Septuagint Version. \"Then Daniel spake with the counsel and knowledge which were his to Arioch the chief executioner [",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀρχὶ μαγείρῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'chief butcher,' used by Plutarch for 'chief cook'] of the king, to whom it was appointed to lead out the wise men (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σοφιστὰς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of Babylonia.\" The text before the Septuagint translators seems to have had ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "דילֵה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "deeleh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"which to him,\" equivalent to \"which he had.\" The LXX. text had ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "פקד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נפק",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Something may be said for this reading, as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the succeeding word may have occasioned the disappearance of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which might be regarded as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " defectively written. Theodotion agrees perfectly with the Massoretic text. The Peshitta is somewhat of a paraphrase in regard to the first clause, \"Then Daniel pacified and consulted, and said to Arioch the chief of the king's guard, who had gone out to slay the wise men of Babylon.\" It would seem as if there had been some confusion of the words here, though the meaning is not far from that of the other version. The Vulgate Version differs, \"Then Daniel asked about the law and sentence (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sentientia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") at Arioch, who had gone forth to slay the wise men of Babylon.\" The slate of matters implied here reveals to us the fact that several links of the story are awanting. There seems to have been absolute secrecy as to what had taken place in the royal council-chamber, and how absolute had been the failure of the Chaldean wise men to satisfy the demands of the king. We could imagine the strange turmoil that this would have caused in the college of young cadets of the various guilds of soothsayers and augurs, had it been announced that these great heads of their various orders had failed. News may have come of the wrath of the king, and close behind the angry sentence of extirpation, passed not only on those who had been the immediate occasions of the king's wrath, but on all the gull, is of wise men in Babylon. This must have filled those who belonged to the various guilds implicated, not only with terror, but with amazement. It was next brought to them that they, though only in the lower stages of these famous guilds, were doomed to a common destruction with the past masters of the craft. That this was allowed to reach these subalterns proves that popular opinion had not gone with the fiery edict of the king. Above all, Arioch, captain \"of the guard\" - \"of the cut-throats,\" as the Spanish translators have rendered it; \"chief butcher,\" as both Theodotion and the Septuagint render his title - acts as if he is not in favour of it. lie is compelled to do the king's bidding; but he is evidently bent on going about the realtor in such a leisurely fashion that the great body of the condemned may escape. We may stay to notice that the name Arioch is a genuine Babylonian name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Eri Aku",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Servant of the moon-god.\" Professor Bevan declares it is borrowed from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as his title is from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is singular that when the author's acquaintance with the earlier Scriptures was so full and accurate, he should drop into the blunders he is accused cf. In Genesis the executioner does not execute anybody; in Daniel he is represented as engaged in organizing the massacre. Daniel seems not to have waited till the terrible band of guardsmen-executioners arrived at the college where he and his friends were living, he goes direct to the chief of the band. The fact that he is not cut down immediately on his approach seems to argue that even the common guardsmen shrank from the duty imposed on them. Their horror and shrinking were perfectly natural. Let us suppose a company in a regiment of Irish Roman Catholics ordered to shoot down their own priests, and we may have some idea of the feelings of these soldiers. These augurs and soothsayers, these astrologers and magicians, had been their counsellors; they had been their intercessors with their deities. If they were all slaughtered, would not the sheer blank in their own lives be immense? There would be no one now to tell them, however falsely, of the future: no one to tell them what to do to propitiate the gods. But more, the gods might well be supposed to be enraged by the slaughter of so many of their special servants, and might be expected to pour down vengeance on the whole nation as well as on the king who had commanded it, but most of all on those who, under whatever compulsion, raised their sacrilegious hands against the priests of the holy gods. It is even not improbable that, once the immediate paroxysm of his fury had passed, Nebuchadnezzar would be appalled at what he had himself ordered, and would connive at delay, in the hope that, though late, these wise men might come to reason and tell him what he wished. Daniel seems to find  no difficulty in gaining access to the presence of Arioch. There are men who have a magnetic power over their fellows, and bend every one to their way, and still gain their affection. And Daniel seems pre-eminently to have been a man of this type. Personal good looks and suave manners had their own share, but something more was needed to carry a condemned man through the ranks of guards right into the presence of their chief. This is made all the more striking when we bear in mind that preparations were being made for the great massacre. Daniel 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Daniel's willingness to declare his dream to the king; his prayer for a revelation of the secret, and the answer to his prayer; his explanation before the king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 2:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:14",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Through Daniel's judicious interview of Arioch, the further execution of the royal edict was interrupted. וּטעם עטא התיב, he answered, replied, counsel and understanding, i.e., the words of counsel and understanding; cf. Proverbs 26:16. The name Arioch appears in Genesis 14:1 as the name of the king of Ellasar, along with the kings of Elam and Shinar. It is derived not from the Sanscr. ârjaka, venerabilis, but is probably formed from ארי, a lion, as נסרך from nisr  equals  נשׁר. רב־טבּחיּא is the chief of the bodyguard, which was regarded as the highest office of the kingdom (cf. Jeremiah 39:9, Jeremiah 39:11; Jeremiah 40:1.). It was his business to see to the execution of the king's commands; see 1 Kings 2:25; 2 Kings 25:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Through Daniel's judicious interview of Arioch, the further execution of the royal edict was interrupted. וּטעם עטא התיב, he answered, replied, counsel and understanding, i.e., the words of counsel and understanding; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The name Arioch appears in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the name of the king of Ellasar, along with the kings of Elam and Shinar. It is derived not from the Sanscr. ârjaka, venerabilis, but is probably formed from ארי, a lion, as נסרך from nisr  equals  נשׁר. רב־טבּחיּא is the chief of the bodyguard, which was regarded as the highest office of the kingdom (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). It was his business to see to the execution of the king's commands; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 2:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      }
    ]
  }
]