[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(21) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Changeth times—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He orders the events which occur at different times and seasons. Daniel refers to the dream which had been recently revealed to him, in which the changes of future times and seasons were depicted in so marvellous a way. “Times” are opposed to “seasons,” as circumstances of time may be contrasted with epochs of time. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He removeth.—Comp. 1Samuel 2:8.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "He removeth.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Wisdom . . .—Comp. Jeremiah 32:19.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Wisdom . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The wise—i.e., wise men generally. Wise men become what they are, not through their own study and natural ability, but by the grace and mercy of God.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The wise",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wise men generally. Wise men become what they are, not through their own study and natural ability, but by the grace and mercy of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:14-23 Daniel humbly prayed that God would discover to him the king's dream, and the meaning of it. Praying friends are valuable friends; and it well becomes the greatest and best men to desire the prayers of others. Let us show that we value our friends, and their prayers. They were particular in prayer. And whatever we pray for, we can expect nothing but as the gift of God's mercies. God gives us leave in prayer to tell our wants and burdens. Their plea with God was, the peril they were in. The mercy Daniel and his fellows prayed for, was bestowed. The fervent prayers of righteous men avail much. Daniel was thankful to God for making known that to him, which saved the lives of himself and his fellows. How much more should we be thankful to God, for making known the great salvation of the soul to those who are not among the worldly wise and prudent!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he changeth the times and the seasons - The object of this is to assert the general control of God in reference to all changes which occur. The assertion is made, undoubtedly, in view of the revolutions in empire which Daniel now saw, from the signification of the dream, were to take place under the Divine hand. Foreseeing now these vast changes denoted by different parts of the image ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:36-45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", stretching into far-distant times, Daniel was led to ascribe to God the control over \"all\" the revolutions which occur on earth. There is no essential difference between the words \"times\" and \"seasons.\" The words in Chaldee denote stated or appointed seasons; and the idea of times \"appointed, set, determined,\" enters into both. Times and seasons are not under the control of chance, but are bounded by established laws; and yet God, who appointed these laws, has power to change them, and all the changes which occur under those laws are produced by his agency. Thus the changes which occur in regard to day and night, spring and summer, autumn and winter, clouds and sunshine, health and sickness, childhood and youth, manhood and age, are under his control. Such changes, being in accordance with certain laws, may be regarded as \"appointed,\" or \"set,\" and yet the laws and the revolutions consequent on them are all under his control. So in regard to the revolutions of empire. By the arrangements of his providence he secures such revolutions as he shall see it to be best should occur, and in all of them his high hand should be regarded. The words \"seasons\" and \"times\" are of frequent occurrence in Daniel, and are sometimes used in a peculiar sense (see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but they seem here to be employed in their usual and general signification, to denote that \"all\" the revolutions which occur on earth are under his control.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He removeth kings, and setteth up kings - He has absolute control over all the sovereigns of the earth, to place on the throne whom he will, and to remove them when he pleases. This was doubtless suggested to Daniel, and was made the foundation of this portion of his hymn of praise, from what he was permitted to see in the disclosures made to him in the interpretation of the dream. He then saw (compare Daniel 2:37-45) that there would be most important revolutions of kingdoms under the hand of God, and being deeply impressed with these great prospective changes, he makes this general statement, that it was the prerogative of God to do this at pleasure. Nebuchadnezzar was brought to feel this, and to recognize it, when he said Daniel 4:17, \"The Most High ruleth in the kingdom of men, and giveth it to whomsoever he will;\" \"he doeth according to his will in the army of heaven, and among the inhabitants of the earth: none can stay his hand, or say unto him, What doest thou?\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He removeth kings, and setteth up kings - He has absolute control over all the sovereigns of the earth, to place on the throne whom he will, and to remove them when he pleases. This was doubtless suggested to Daniel, and was made the foundation of this portion of his hymn of praise, from what he was permitted to see in the disclosures made to him in the interpretation of the dream. He then saw (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:37-45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that there would be most important revolutions of kingdoms under the hand of God, and being deeply impressed with these great prospective changes, he makes this general statement, that it was the prerogative of God to do this at pleasure. Nebuchadnezzar was brought to feel this, and to recognize it, when he said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"The Most High ruleth in the kingdom of men, and giveth it to whomsoever he will;\" \"he doeth according to his will in the army of heaven, and among the inhabitants of the earth: none can stay his hand, or say unto him, What doest thou?\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 4:32, Daniel 4:35. This claim is often asserted for God in the Scriptures as a proof of his supremacy and greatness. \"For promotion cometh neither from the east, nor from the west, nor from the south: but God is the judge; he putteth down one, and setteth up another,\" Psalm 75:6-7. Compare 1 Samuel 2:7-8. Thus he claimed absolute control over Sennacherib to employ him at his pleasure in executing his purposes of punishment on the Hebrew nation Isaiah 10:5-7, and thus over Cyrus to execute his purposes on Babylon, and to restore his people to their land, Isaiah 45:1, following See also Isaiah 46:10-11. In this manner, all the kings of the earth may be regarded as under his control; and if the Divine plan were fully understood it would be found that each one has received his appointment under the Divine direction, to accomplish some important part in carrying forward the Divine plans to their fulfillment. A history of human affairs, showing the exact purpose of God in regard to each ruler who has occupied a throne, and the exact object which God designed to accomplish by placing \"him\" on the throne at the time when he did, would be a far more important and valuable history than any which has been written. Of many such rulers, like Cyrus, Sennacherib, Pilate, Henry VIII, Edward VI, and the Elector of Saxony, we can see the reason why they lived and reigned when they did; and doubtless God has had some important end to accomplish in the development of his great plans in the case of every one who has ever occupied a throne.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This claim is often asserted for God in the Scriptures as a proof of his supremacy and greatness. \"For promotion cometh neither from the east, nor from the west, nor from the south: but God is the judge; he putteth down one, and setteth up another,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 75:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus he claimed absolute control over Sennacherib to employ him at his pleasure in executing his purposes of punishment on the Hebrew nation ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and thus over Cyrus to execute his purposes on Babylon, and to restore his people to their land, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", following See also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this manner, all the kings of the earth may be regarded as under his control; and if the Divine plan were fully understood it would be found that each one has received his appointment under the Divine direction, to accomplish some important part in carrying forward the Divine plans to their fulfillment. A history of human affairs, showing the exact purpose of God in regard to each ruler who has occupied a throne, and the exact object which God designed to accomplish by placing \"him\" on the throne at the time when he did, would be a far more important and valuable history than any which has been written. Of many such rulers, like Cyrus, Sennacherib, Pilate, Henry VIII, Edward VI, and the Elector of Saxony, we can see the reason why they lived and reigned when they did; and doubtless God has had some important end to accomplish in the development of his great plans in the case of every one who has ever occupied a throne.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He giveth wisdom unto the wise ... - He is the source of all true wisdom and knowledge. This is often claimed for God in the Scriptures. Compare Proverbs 2:6-7 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He giveth wisdom unto the wise ... - He is the source of all true wisdom and knowledge. This is often claimed for God in the Scriptures. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 2:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For the Lord giveth wisdom;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Out of his mouth cometh knowledge and understanding.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He layeth up sound wisdom for the righteous;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He is a buckler to them that walk uprightly.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See also 1 Kings 3:9-12; Exodus 31:3. God claims to be the source of all wisdom and knowledge. He originally formed each human intellect, and made it what it is; he opens before it the paths of knowledge; he gives to it clearness of perception; he preserves its powers so that they do not become deranged; he has power to make suggestions, to direct the laws of association, to fix the mind on important thoughts, and to open before it new and interesting views of truth. And as it would be found, if the history could be written, that God has placed each monarch on the throne with a distinct reference to some important purpose in the development of his great plans, so probably it would be seen that each important work of genius which has been written; each invention in the arts; and each discovery in science has been, for a similar purpose, under his control. He has created the great intellect just at the time when it was needful that such a discovery or invention should be made, and having prepared the world for it by the course of events, the discovery or invention has occurred just at the time when, on the whole, it was most desirable that it should. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:9-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God claims to be the source of all wisdom and knowledge. He originally formed each human intellect, and made it what it is; he opens before it the paths of knowledge; he gives to it clearness of perception; he preserves its powers so that they do not become deranged; he has power to make suggestions, to direct the laws of association, to fix the mind on important thoughts, and to open before it new and interesting views of truth. And as it would be found, if the history could be written, that God has placed each monarch on the throne with a distinct reference to some important purpose in the development of his great plans, so probably it would be seen that each important work of genius which has been written; each invention in the arts; and each discovery in science has been, for a similar purpose, under his control. He has created the great intellect just at the time when it was needful that such a discovery or invention should be made, and having prepared the world for it by the course of events, the discovery or invention has occurred just at the time when, on the whole, it was most desirable that it should. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. changeth … times … seasons—\"He herein gives a general preparatory intimation, that the dream of Nebuchadnezzar is concerning the changes and successions of kingdoms\" [Jerome]. The \"times\" are the phases and periods of duration of empires (compare Da 7:25; 1Ch 12:32; 29:30); the \"seasons\" the fitting times for their culmination, decline, and fall (Ec 3:1; Ac 1:7; 1Th 5:1). The vicissitudes of states, with their times and seasons, are not regulated by chance or fate, as the heathen thought, but by God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "removed kings—(Job 12:18; Ps 75:6, 7; Jer 27:5; compare 1Sa 2:7, 8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "giveth wisdom—(1Ki 3:9-12; Jas 1:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " God made time; God made the sun, moon, and stars, the measure of time; he made the day and the night, and seasons of the year, yea, the revolutions and change of times; he can make bad times better, and turn night into day. He can make the sun go backward or stand still, as in Ahaz’s and Joshua’s time; it is the great part of God’s power and prerogative to change times. Daniel here attributes that to God which heathens attributed to nature, which they deified, or to chance; seeing that God only, that made all by his power, doth rule, and sometimes overrule all by his providence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he changeth the times and the season,.... Not only of day and night, summer and winter, and times and seasons of prosperity and adversity; but all the changes and revolutions in states and kingdoms, in all times and ages, are from him; and particularly those pointed at in the following dream, in the Babylonian, Persian, Grecian, and Roman monarchies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he removeth kings, and setteth up kings; he is King of kings, and Lord of lords; by him they reign, and continue on their thrones, as long as he pleases; and then he removes them by death or otherwise, and places others in their stead; and who are sometimes raised from a low estate; and this he does in the ordinary course of Providence; see Psalm 75:6 and particularly Daniel might have in view the removal of the Babylonian monarchs, and setting up kings of the race of the Medes and Persians; and then the degrading them, and advancing the Grecians to the height of monarchy; and then reducing of them, and raising the Romans to a greater degree of power and authority; and at last crushing them all in their turns, to make way for the kingdom of his Son: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he removeth kings, and setteth up kings; he is King of kings, and Lord of lords; by him they reign, and continue on their thrones, as long as he pleases; and then he removes them by death or otherwise, and places others in their stead; and who are sometimes raised from a low estate; and this he does in the ordinary course of Providence; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 75:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and particularly Daniel might have in view the removal of the Babylonian monarchs, and setting up kings of the race of the Medes and Persians; and then the degrading them, and advancing the Grecians to the height of monarchy; and then reducing of them, and raising the Romans to a greater degree of power and authority; and at last crushing them all in their turns, to make way for the kingdom of his Son: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "he giveth wisdom to the wise, and knowledge to them that know understanding: an increase of wisdom and knowledge, to wise politicians and counsellors of state, to form wise schemes of peace or war, to make wise laws, and govern kingdoms in a prudent manner; and to wise master builders or ministers of the word, to speak the wisdom of God in a mystery, to diffuse the knowledge of Christ everywhere, and make known the mysteries of grace to the sons of men; particularly to Daniel and his companions, who were wise and knowing men, the interpretation of the king's dream. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he giveth wisdom to the wise, and knowledge to them that know understanding: an increase of wisdom and knowledge, to wise politicians and counsellors of state, to form wise schemes of peace or war, to make wise laws, and govern kingdoms in a prudent manner; and to wise master builders or ministers of the word, to speak the wisdom of God in a mystery, to diffuse the knowledge of Christ everywhere, and make known the mysteries of grace to the sons of men; particularly to Daniel and his companions, who were wise and knowing men, the interpretation of the king's dream. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he changeth the times and the seasons: he removeth kings, and setteth up kings: he giveth wisdom unto the wise, and knowledge to them that know understanding:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the times and the seasons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] more exactly ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "seasons and times",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is, History does not move with the regularity of a clock: the order of things established at a given time is not necessarily permanent; it frequently happens that kings are overthrown and a new ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "régime",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is established.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he giveth wisdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The doxology now assumes special reference to Daniel’s own case. As Joseph ascribed his skill in interpreting dreams to God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so Daniel acknowledges that He is the source of wisdom to those who possess it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know understanding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he changeth the times and the seasons: he removeth kings, and setteth up kings: he giveth wisdom unto the wise, and knowledge to them that know understanding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In regard to this verse, Theodotion and the Septuagint only differ in this from the Massoretic text, that they omit the repetition of the word \"kings.\" The Peshitta has a different sense in the middle clause. \"He maketh (Peshitta, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ma'bed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") kings and confirmeth (Peshitta, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "maqeem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") kings\" The Syriac translators have evidently read ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מְחֲעְדֵה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "meh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " '",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "deh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"to remove,\" as ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מְהַעְבֵד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "meha'bed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " make\" The utter want of contrast in this reading condemns it. In regard to the Aramaic of this passage, the carrying on of the preformative ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the sign of the haphel conjugation, is a proof of the early date of the Aramaic. In later Aramaic, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gives place to ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " disappears after the other preformative as ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יַקְטֵל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יִאֲקְטֵל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Changeth times and seasons.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Nebuchadnezzar was anxious lest the time in which he might make advantageous use of the information conveyed by the dream should pass away, and a new \"time\" be established. Not improbably Nebuchadnezzar, like most heathens, imagined that his gods were limited by some unseen power like the Greek Fate, and, however wishful they might be to be propitious to their worshippers only in certain collocations of the heavenly bodies could they carry out their wish. God, the God of heaven, the God of the despised Hebrews, he it was who arranged the times and the seasons, he made the sun to rise, he makes summer and winter, he leads out the host of the stars, alike the star of Nebo and the star of Marduk. The two words \"time\" and \"season\" are nearly synonymous. Perhaps the first is more indefinite than the other. Our own opinion is that the first has more the idea of space of time, and the latter more of point of time; but really they are almost synonymous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "He removeth kings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and setteth up kings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In this there seems to be a special reference to the contents of the vision, which showed that in the time to come, not only kings but dynasties were to be set up and overthrown. The former clause regarded God as the God of nature. This looks u pen him as the God of providence, by whom \"kings reign, and princes decree justice.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "He giveth wisdom unto the wise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and knowledge to them that know understand-lag.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This address to God goes further. Daniel sees in the faculties and mental acquirements of men the manifestation of God. It is the inspiration of the Almighty that giveth understanding. All the power man has of acquiring knowledge, all the faculty he has for using that knowledge aright, all come from God. Daniel 2:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The evidence of the wisdom and power of God is here unfolded; and firs the manifestation of His power. He changes times and seasons. lxx, Theodot. καιροὺς καὶ χρόνους, would be more accurately χρόνους καὶ καιρούς, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the Peschito in these N. T. passages renders χρόνοι by the Syriac word which is equivalent to זמניּא, according to which עדּן is the more general expression for time  equals  circumstance of time, זמן for measured time, the definite point of time. The uniting together of the synonymous words gives expression to the thought: ex arbitrio Dei pendere revolutiones omnium omnino temporum, quaecunque et qualia-cunque illa fuerint. C. B. Mich. God's unlimited control over seasons and times is seen in this, that He sets up and casts down kings. Thus Daniel explains the revelation regarding the dream of Nebuchadnezzar made to him as announcing great changes in the kingdoms of the world, and revealing God as the Lord of time and of the world in their developments. All wisdom also comes from God. He gives to men disclosures regarding His hidden counsels. This Daniel had just experienced. Illumination dwells with God as it were a person, as Wisdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 8:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Kethiv נהירא is maintained against the Keri by נהירוּ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". With the perf. שׁרא the participial construction passes over into the temp. fin.; the perfect stands in the sense of the completed act. Therefore (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") praise and thanksgiving belong to God. Through the revelation of the secret hidden to the wise men of this world He has proved Himself to Daniel as the God of the fathers, as the true God in opposition to the gods of the heathen. וּכען  equals  ועתּה, and now.",
        "children": []
      }
    ]
  }
]