[{"header":"Who Can Join in Worship With the Lord’s People?"},{"num":23,"verse":"No man whose sex organs have been crushed or cut can join in worship with the Lord’s people."},{"num":2,"verse":"No one born to an unmarried woman can join in worship with the Lord’s people. That also applies to the person’s children for all time to come."},{"num":3,"verse":"The people of Ammon and Moab can’t join in worship with the Lord’s people. That also applies to their children after them for all time to come. "},{"num":4,"verse":"The Ammonites and Moabites didn’t come to meet you with food and water on your way out of Egypt. They even hired Balaam from Pethor in Aram Naharaim to put a curse on you. Balaam was the son of Beor. "},{"num":5,"verse":"The Lord your God wouldn’t listen to Balaam. Instead, he turned the curse into a blessing for you. He did it because he loves you. "},{"num":6,"verse":"So don’t make a peace treaty with the Ammonites and Moabites as long as you live."},{"num":7,"verse":"Don’t hate the people of Edom. They are your relatives. Don’t hate the people of Egypt. After all, you lived as outsiders in their country. "},{"num":8,"verse":"The great-grandchildren of the Edomites and Egyptians can join in worship with the Lord’s people."},{"header":"Keep the Camp of the Soldiers Pure and “Clean”"},{"num":9,"verse":"There will be times when you are at war with your enemies. And your soldiers will be in camp. Then keep away from anything that isn’t pure and “clean.” "},{"num":10,"verse":"Suppose semen flows from the body of one of your soldiers during the night. Then that will make him “unclean.” He must go outside the camp and stay there. "},{"num":11,"verse":"But as evening approaches, he must wash himself. When the sun goes down, he can return to the camp."},{"num":12,"verse":"Choose a place outside the camp where you can go to the toilet. "},{"num":13,"verse":"Keep a shovel among your tools. When you go to the toilet, dig a hole. Then cover up your waste. "},{"num":14,"verse":"The Lord your God walks around in your camp. He’s there to keep you safe. He’s also there to hand your enemies over to you. So your camp must be holy. Then he won’t see anything among you that is shameful. He won’t turn away from you."},{"header":"Several Other Laws"},{"num":15,"verse":"If a slave comes to you for safety, don’t hand them over to their master. "},{"num":16,"verse":"Let them live among you anywhere they want to. Let them live in any town they choose. Don’t treat them badly."},{"num":17,"verse":"A man or woman in Israel must not become a temple prostitute. "},{"num":18,"verse":"The Lord your God hates the money that men and women get for being prostitutes. So don’t take that money into the house of the Lord to pay what you promised to give."},{"num":19,"verse":"Don’t charge your own people any interest. Don’t charge them when they borrow money, food or anything else. "},{"num":20,"verse":"You can charge interest to people from another country. But don’t charge your own people. Then the Lord your God will bless you in everything you do. He will bless you in the land you are entering to take as your own."},{"num":21,"verse":"Don’t put off giving to the Lord your God everything you promise him. He will certainly require it from you. And you will be guilty of committing a sin. "},{"num":22,"verse":"But if you don’t make a promise, you won’t be guilty. "},{"num":23,"verse":"Make sure you do what you promised to do. With your own mouth you made the promise to the Lord your God. No one forced you to do it."},{"num":24,"verse":"When you enter your neighbor’s vineyard, you can eat all the grapes you want. But don’t put any of them in your basket. "},{"num":25,"verse":"When you enter your neighbor’s field, you can pick heads of grain. But don’t cut down their standing grain."}]