[{"header":"Various Laws"},{"num":23,"verse":"A man whose testicles are crushed or whose penis is cut off may never join the assembly of Yahweh."},{"num":2,"verse":"A man born from an illicit union may not join the assembly of Yahweh. No descendant of his may join the assembly of Yahweh for ten generations."},{"num":3,"verse":"Ammonites or Moabites may not join the assembly of Yahweh. Not one descendant of theirs may join the assembly of Yahweh for ten generations. "},{"num":4,"verse":"They cannot join because they didn’t greet you with food and water on your trip from Egypt. They even hired Balaam, son of Beor, from Pethor in Aram Naharaim, to curse you. "},{"num":5,"verse":"But Yahweh your Elohim refused to listen to Balaam. Instead, he turned Balaam’s curse into a blessing for you because Yahweh your Elohim loves you. "},{"num":6,"verse":"Never offer them peace or friendship as long as you live."},{"num":7,"verse":"Never consider the Edomites disgusting. They’re your relatives. Never consider the Egyptians disgusting. You once were foreigners living in their country. "},{"num":8,"verse":"Their grandchildren may join the assembly of Yahweh."},{"num":9,"verse":"When you’re at war and have set up camp to fight your enemies, stay away from anything that will make you unclean. "},{"num":10,"verse":"If one of your men becomes unclean from a nocturnal emission, he must go outside the camp and stay there. "},{"num":11,"verse":"Toward evening he must wash, and at sunset he may come back to camp."},{"num":12,"verse":"Choose a place outside the camp where you can go to relieve yourself. "},{"num":13,"verse":"You must carry a pointed stick as part of your equipment. When you go outside to squat, dig a hole with it. When you’re done, cover up your excrement. "},{"num":14,"verse":"Yahweh your Elohim moves around in your camp to protect you and hand your enemies over to you. So your camp must always be holy. This way, Yahweh will never see anything offensive among you and turn away from you."},{"num":15,"verse":"If a slave escapes from his master and comes to you, don’t return him to his master. "},{"num":16,"verse":"Let him stay with you and live among your people wherever he chooses, in any of your cities that seems best to him. Never mistreat him."},{"num":17,"verse":"No Israelite man or woman should ever become a temple prostitute. "},{"num":18,"verse":"Never bring gifts or money earned by prostitution into the house of Yahweh your Elohim as an offering you vowed to give. These earnings are disgusting to Yahweh your Elohim."},{"num":19,"verse":"Never charge another Israelite any interest on money, food, or anything else that is borrowed. "},{"num":20,"verse":"You may charge a foreigner interest, but not an Israelite. Then Yahweh your Elohim will bless you in everything you do once you’ve entered the land and taken possession of it."},{"num":21,"verse":"If you make a vow to Yahweh your Elohim, don’t avoid keeping it. Yahweh your Elohim expects you to keep it. You would be guilty of a sin if you didn’t. "},{"num":22,"verse":"If you didn’t make a vow, you would not be guilty. "},{"num":23,"verse":"Make sure you do what you said you would do in your vow. You freely chose to make your vow to Yahweh your Elohim."},{"num":24,"verse":"If you go into your neighbor’s vineyard, you may eat as many grapes as you like until you’re full. But never put any in your basket. "},{"num":25,"verse":"If you go into your neighbor’s grain field, you may pick grain by hand. But never use a sickle to cut your neighbor’s grain."}]