[{"header":"Greatness in the Kingdom(A)"},{"num":18,"verse":"At that time the disciples came to Jesus and asked, “Who is greatest in the kingdom of heaven?”"},{"num":2,"verse":"He called a little child and had him stand among them. "},{"num":3,"verse":"Then he said to them, “I can guarantee this truth: Unless you change and become like little children, you will never enter the kingdom of heaven. "},{"num":4,"verse":"Whoever becomes like this little child is the greatest in the kingdom of heaven. "},{"num":5,"verse":"And whoever welcomes a child like this in my name welcomes me."},{"header":"Causing Others to Lose Faith(B)"},{"num":6,"verse":"“These little ones believe in me. It would be best for the person who causes one of them to lose faith to be drowned in the sea with a large stone hung around his neck. "},{"num":7,"verse":"How horrible it will be for the world because it causes people to lose their faith. Situations that cause people to lose their faith will arise. How horrible it will be for the person who causes someone to lose his faith!"},{"num":8,"verse":"“If your hand or your foot causes you to lose your faith, cut it off and throw it away. It is better for you to enter life disabled or injured than to have two hands or two feet and be thrown into everlasting fire. "},{"num":9,"verse":"If your eye causes you to lose your faith, tear it out and throw it away. It is better for you to enter life with one eye than to have two eyes and be thrown into hellfire."},{"num":10,"verse":"“Be careful not to despise these little ones. I can guarantee that their angels in heaven always see the face of my Father, who is in heaven."},{"header":"The Lost Sheep(C)"},{"num":12,"verse":"“What do you think? Suppose a man has 100 sheep and one of them strays. Won’t he leave the 99 sheep in the hills to look for the one that has strayed? "},{"num":13,"verse":"I can guarantee this truth: If he finds it, he is happier about it than about the 99 that have not strayed. "},{"num":14,"verse":"In the same way, your Father in heaven does not want one of these little ones to be lost."},{"header":"Dealing with Believers When They Do Wrong"},{"num":15,"verse":"“If a believer does something wrong, go, confront him when the two of you are alone. If he listens to you, you have won back that believer. "},{"num":16,"verse":"But if he does not listen, take one or two others with you so that every accusation may be verified by two or three witnesses. "},{"num":17,"verse":"If he ignores these witnesses, tell it to the community of believers. If he also ignores the community, deal with him as you would a heathen or a tax collector. "},{"num":18,"verse":"I can guarantee this truth: Whatever you imprison, God will imprison. And whatever you set free, God will set free."},{"num":19,"verse":"“I can guarantee again that if two of you agree on anything here on earth, my Father in heaven will accept it. "},{"num":20,"verse":"Where two or three have come together in my name, I am there among them.”"},{"header":"Personally Forgiving Others"},{"num":21,"verse":"Then Peter came to Jesus and asked him, “Lord, how often do I have to forgive a believer who wrongs me? Seven times?”"},{"num":22,"verse":"Jesus answered him, “I tell you, not just seven times, but seventy times seven."},{"num":23,"verse":"“That is why the kingdom of heaven is like a king who wanted to settle accounts with his servants. "},{"num":24,"verse":"When he began to do this, a servant who owed him millions of dollars was brought to him. "},{"num":25,"verse":"Because he could not pay off the debt, the master ordered him, his wife, his children, and all that he had to be sold to pay off the account. "},{"num":26,"verse":"Then the servant fell at his master’s feet and said, ‘Be patient with me, and I will repay everything!’"},{"num":27,"verse":"“The master felt sorry for his servant, freed him, and canceled his debt. "},{"num":28,"verse":"But when that servant went away, he found a servant who owed him hundreds of dollars. He grabbed the servant he found and began to choke him. ‘Pay what you owe!’ he said."},{"num":29,"verse":"“Then that other servant fell at his feet and begged him, ‘Be patient with me, and I will repay you.’ "},{"num":30,"verse":"But he refused. Instead, he turned away and had that servant put into prison until he would repay what he owed."},{"num":31,"verse":"“The other servants who worked with him saw what had happened and felt very sad. They told their master the whole story."},{"num":32,"verse":"“Then his master sent for him and said to him, ‘You evil servant! I canceled your entire debt, because you begged me. "},{"num":33,"verse":"Shouldn’t you have treated the other servant as mercifully as I treated you?’"},{"num":34,"verse":"“His master was so angry that he handed him over to the torturers until he would repay everything that he owed. "},{"num":35,"verse":"That is what my Father in heaven will do to you if each of you does not sincerely forgive other believers.”"}]