[[],[{"type":"header","content":"Questions About the Greatest"},{"type":"prose","content":"At that time the disciples came to Jesus saying, “Who is the greatest in the kingdom of heaven?” "}],[{"type":"prose","content":"He called a child, had him stand among them, "}],[{"type":"prose","content":"and said, “I tell you the truth, unless you turn around and become like little children, you will never enter the kingdom of heaven! "}],[{"type":"prose","content":"Whoever then humbles himself like this little child is the greatest in the kingdom of heaven. "}],[{"type":"prose","content":"And whoever welcomes a child like this in my name welcomes me."}],[{"type":"prose","content":"“But if anyone causes one of these little ones who believe in me to sin, it would be better for him to have a huge millstone hung around his neck and to be drowned in the open sea. "}],[{"type":"prose","content":"Woe to the world because of stumbling blocks! It is necessary that stumbling blocks come, but woe to the person through whom they come. "}],[{"type":"prose","content":"If your hand or your foot causes you to sin, cut it off and throw it away. It is better for you to enter life crippled or lame than to have two hands or two feet and be thrown into eternal fire. "}],[{"type":"prose","content":"And if your eye causes you to sin, tear it out and throw it away. It is better for you to enter into life with one eye than to have two eyes and be thrown into fiery hell."},{"type":"header","content":"The Parable of the Lost Sheep"}],[{"type":"prose","content":"“See that you do not disdain one of these little ones. For I tell you that their angels in heaven always see the face of my Father in heaven. "}],[{"type":"prose","content":"What do you think? If someone owns a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the mountains and go look for the one that went astray? "}],[{"type":"prose","content":"And if he finds it, I tell you the truth, he will rejoice more over it than over the ninety-nine that did not go astray. "}],[{"type":"prose","content":"In the same way, your Father in heaven is not willing that one of these little ones be lost."},{"type":"header","content":"Restoring Christian Relationships"}],[{"type":"prose","content":"“If your brother sins, go and show him his fault when the two of you are alone. If he listens to you, you have regained your brother. "}],[{"type":"prose","content":"But if he does not listen, take one or two others with you, so that  . "}],[{"type":"prose","content":"If he refuses to listen to them, tell it to the church. If he refuses to listen to the church, treat him like a Gentile or a tax collector."}],[{"type":"prose","content":"“I tell you the truth, whatever you bind on earth will have been bound in heaven, and whatever you release on earth will have been released in heaven. "}],[{"type":"prose","content":"Again, I tell you the truth, if two of you on earth agree about whatever you ask, my Father in heaven will do it for you. "}],[{"type":"prose","content":"For where two or three are assembled in my name, I am there among them.”"}],[{"type":"prose","content":"Then Peter came to him and said, “Lord, how many times must I forgive my brother who sins against me? As many as seven times?” "}],[{"type":"prose","content":"Jesus said to him, “Not seven times, I tell you, but seventy-seven times!"},{"type":"header","content":"The Parable of the Unforgiving Slave"}],[{"type":"prose","content":"“For this reason, the kingdom of heaven is like a king who wanted to settle accounts with his slaves. "}],[{"type":"prose","content":"As he began settling his accounts, a man who owed 10,000 talents was brought to him. "}],[{"type":"prose","content":"Because he was not able to repay it, the lord ordered him to be sold, along with his wife, children, and whatever he possessed, and repayment to be made. "}],[{"type":"prose","content":"Then the slave threw himself to the ground before him, saying, ‘Be patient with me, and I will repay you everything.’ "}],[{"type":"prose","content":"The lord had compassion on that slave and released him, and forgave him the debt. "}],[{"type":"prose","content":"After he went out, that same slave found one of his fellow slaves who owed him 100 silver coins. So he grabbed him by the throat and started to choke him, saying, ‘Pay back what you owe me!’ "}],[{"type":"prose","content":"Then his fellow slave threw himself down and begged him, ‘Be patient with me, and I will repay you.’ "}],[{"type":"prose","content":"But he refused. Instead, he went out and threw him in prison until he repaid the debt. "}],[{"type":"prose","content":"When his fellow slaves saw what had happened, they were very upset and went and told their lord everything that had taken place. "}],[{"type":"prose","content":"Then his lord called the first slave and said to him, ‘Evil slave! I forgave you all that debt because you begged me! "}],[{"type":"prose","content":"Should you not have shown mercy to your fellow slave, just as I showed it to you?’ "}],[{"type":"prose","content":"And in anger his lord turned him over to the prison guards to torture him until he repaid all he owed. "}],[{"type":"prose","content":"So also my heavenly Father will do to you, if each of you does not forgive your brother from your heart.”"}]]