[{"num":18,"verse":"At the same time the disciples came to Jesus, saying, “Who is the greatest in the Kingdom of Heaven?”"},{"num":2,"verse":"And Jesus called a little child to Him, and set him in the midst of them,"},{"num":3,"verse":"and said, “Truly I say to you, unless you are converted, and become as little children, you shall not enter into the Kingdom of Heaven."},{"num":4,"verse":"“Whoever, therefore, shall humble himself as this little child, the same is the greatest in the Kingdom of Heaven."},{"num":5,"verse":"“And whoever shall receive one such little child in My Name, receives Me."},{"num":6,"verse":"“But whoever shall cause one of these little ones who believes in Me to stumble, it would be better for him if a millstone were hung around his neck, and he were drowned in the depths of the sea."},{"num":7,"verse":"“Woe to the world because of offenses. For it must be that snares shall come. But woe be to the man by whom the stumbling block comes."},{"num":8,"verse":"“Therefore, if your hand or your foot causes you to stumble, cut them off and cast them from you. It is better for you to enter into life lame, or maimed, than - having two hands or two feet - to be cast into everlasting fire."},{"num":9,"verse":"“And if your eye causes you to stumble, pluck it out and cast it from you. It is better for you to enter into life with one eye, than (having two eyes) to be cast into hell fire."},{"num":10,"verse":"“See that you do not despise one of these little ones. For I say to you that, in Heaven, their angels always behold the face of My Father Who is in Heaven."},{"num":11,"verse":"“For the Son of Man has come to save that which was lost."},{"num":12,"verse":"“What do you think? If a man has a hundred sheep, and one of them goes astray, does he not leave the ninety-nine, and go into the mountains, and seek those which have gone astray?"},{"num":13,"verse":"“And if he finds it? Truly I say to you, he rejoices more over that sheep than over the ninety-nine which did not go astray."},{"num":14,"verse":"“Nor is it the will of your Father Who is in Heaven that one of these little ones should perish."},{"num":15,"verse":"“Moreover, if your brother trespasses against you, go and tell him his fault between you and him alone. If he hears you, you have won your brother."},{"num":16,"verse":"“But if he does not hear you, take one or two with you. So that, by the mouths of two or three witnesses, every word may be confirmed."},{"num":17,"verse":"“And if he refuses to hear them, tell it to the church. And if he refuses to hear the church also, let him be as a heathen and a tax collector to you."},{"num":18,"verse":"“Truly I say to you that whatever you bind on Earth shall be bound in Heaven. And whatever you release on Earth, shall be released in Heaven."},{"num":19,"verse":"“Again, truly I say to you that if two of you shall agree on earth upon anything, whatever they shall desire shall be given to them by My Father Who is in Heaven."},{"num":20,"verse":"“For where two or three are gathered together in My Name, there I am in the midst of them.”"},{"num":21,"verse":"Then Peter came to Him, and said, “Master, how often shall my brother sin against me, and I shall forgive him - up to seven times?”"},{"num":22,"verse":"Jesus said to him, “I do not say to you, ‘Up to seven times’, but, ‘Up to seventy times seven times’."},{"num":23,"verse":"“Therefore, the Kingdom of Heaven is like a certain King, who would take an account of his servants."},{"num":24,"verse":"“And when he had begun to reckon, one was brought to him who owed him ten thousand talents."},{"num":25,"verse":"“And because he had nothing to pay, his lord commanded him to be sold - and his wife, and children, and all that he had - and the debt to be paid."},{"num":26,"verse":"“Therefore, the servant fell down and worshipped him, saying, ‘Lord, have patience with me and I will pay you all!’"},{"num":27,"verse":"“Then that servant’s lord had compassion and freed him. And forgave him the debt."},{"num":28,"verse":"“But when the servant had departed, he found one of his fellow servants who owed him a hundred denarii. And he laid hands on him, and choked him, saying, ‘Pay me that you owe!’"},{"num":29,"verse":"“Then his fellow servant fell down at his feet, and begged him, saying, ‘Have patience with me, and I will pay you all!’"},{"num":30,"verse":"“But he would not. And went and cast him into prison, until he should pay the debt."},{"num":31,"verse":"“And when his other fellow servants saw what was done, they were very sorry. And they came and declared to their lord all that was done."},{"num":32,"verse":"“Then his lord called him, and said to him, ‘O evil servant! I forgave you all that debt, because you begged me."},{"num":33,"verse":"“‘Ought not you also have had pity on your fellow servant, even as I had pity on you?’"},{"num":34,"verse":"“So his lord was angry, and delivered him to the jailers, until he should pay all that was due to him."},{"num":35,"verse":"“So likewise shall My Heavenly Father do to you, unless you forgive - from your hearts - each one his brother their trespasses.”"}]