[{"num":5,"verse":"Moses called together all Israel and said this to them: Listen, Israel, to the statutes and ordinances that I am speaking in your hearing today so that you learn them and are conscientious about carrying them out. "},{"num":2,"verse":"The Lord our God made a covenant with us at Horeb. "},{"num":3,"verse":"The Lord did not make this covenant with our fathers, but with us, with those who are here today, all of us who are living today. "},{"num":4,"verse":"Face-to-face the Lord spoke with you at the mountain from the middle of the fire. "},{"num":5,"verse":"At that time I was standing between the Lord and you to relate to you the word of the Lord, because you were afraid of the fire and you did not go up on the mountain."},{"num":22,"verse":"These are the words the Lord spoke to your whole assembly at the mountain from the middle of the fire, the thick cloud, and the gloom, with a loud voice, and he did not add anything. He wrote them on two tablets of stone and gave them to me. "},{"num":23,"verse":"When you heard the voice from the middle of the darkness while the mountain was burning with fire, you approached me—all the heads of your tribes and your elders."},{"num":24,"verse":"Then you said, “See how the Lord our God has shown us his glory and his greatness, and we have heard his voice from the middle of the fire. Today we have seen that a man can live even though God has spoken to him. "},{"num":25,"verse":"But now, why should we die, because this great fire will consume us? If we continue to hear the voice of the Lord our God any longer, we will die. "},{"num":26,"verse":"For who of all flesh has ever heard the voice of the living God speaking from the middle of fire as we have and has lived? "},{"num":27,"verse":"You go near and listen to everything that the Lord our God says, and then you speak to us everything that the Lord our God speaks to you, and we will hear and do it.”"},{"num":28,"verse":"The Lord heard what you said when you spoke to me. So the Lord said to me, “I heard what these people said when they spoke to you. Everything that they spoke to you is good. "},{"num":29,"verse":"If only this would be in their hearts—to fear me and to keep all my commandments always, so that it might go well for them and for their children continually. "},{"num":30,"verse":"Go and say to them, ‘Go back to your tents.’ "},{"num":31,"verse":"As for you, stand here with me and I will speak to you all the commands and the statutes and the ordinances that you are to teach them and that they are to do in the land that I am giving them as a possession. "},{"num":32,"verse":"Tell them: ‘Be conscientious about doing just as the Lord your God commanded you. Do not turn aside to the right or to the left. "},{"num":33,"verse":"Walk in every way the Lord your God has commanded you, so that you may live and it may be good for you and you may live long in the land that you will possess.’”"}]