[{"header":"The Ten Commandments(A)"},{"num":5,"verse":"Moses called all of Israel together and told them: “Listen, Israel! Today I’m going to announce God’s laws and regulations so that you will learn them and take care to obey them. "},{"num":2,"verse":"When the Lord our God made a covenant with us in Horeb, "},{"num":3,"verse":"it was not with our ancestors that the Lord made this covenant, but with us—we who are here today—all of us who are now living. "},{"num":4,"verse":"The Lord spoke to you face to face on the mountain from the fire. "},{"num":5,"verse":"I stood at that time as mediator between the Lord and you to declare his message to you, because you were afraid of the fire and would not go up the mountain. He said:"},{"header":"Moses Recalls God’s Warnings"},{"num":22,"verse":"“The Lord declared these commands in a loud voice to your entire assembly on the mountain from out of the fire and dark clouds, and nothing more was added. He inscribed them on two tablets of stone and gave them to me. "},{"num":23,"verse":"When you heard the voice from the darkness while the mountain was blazing, all the leaders and elders of your tribes came to me and said: "},{"num":24,"verse":"‘The Lord our God truly has displayed his glory and power, for we heard him from out of the fire today. We have witnessed how God spoke to human beings, yet they lived. "},{"num":25,"verse":"Now therefore, why should we die? This great fire will consume us. If we continue to listen to the voice of the Lord our God any longer, we’ll die. "},{"num":26,"verse":"For what mortal man has heard the voice of the living God speaking out of the fire like we did, and lived? "},{"num":27,"verse":"As for you, go near and listen to everything that the Lord our God will say to you, then repeat it to us, and we’ll listen and obey.’"},{"num":28,"verse":"“The Lord heard what you said. He told me: ‘I’ve heard what this people said. Everything they said was good. "},{"num":29,"verse":"If only they would commit to fear me and keep all my commands, then it will go well with them and their children forever."},{"num":30,"verse":"Go and tell them to return to their tents, "},{"num":31,"verse":"but you stand here with me and I’ll speak to you all the commands, decrees, and laws that you must teach them to observe in the land that I’m giving you to possess. "},{"num":32,"verse":"You must be careful to do what the Lord your God commanded you, turning neither to the left nor to the right. "},{"num":33,"verse":"You are to walk in every pathway that the Lord your God commanded you, so that life may go well for you, and so that you will prolong your days in the land that you will possess.’”"}]