[{"header":"Basic Stipulations"},{"num":5,"verse":"And then Moses summoned all of Israel and said to them, “Hear, Israel, the rules and the regulations that I am speaking in your ears today, and you shall learn them, and you must observe them diligently. "},{"num":2,"verse":"Yahweh our God made a covenant with us at Horeb. "},{"num":3,"verse":"It was not with our ancestors that Yahweh made this covenant, but with these of us who are here alive today. "},{"num":4,"verse":"Face to face Yahweh spoke with you at the mountain from the midst of the fire. "},{"num":5,"verse":"I was standing between Yahweh and you at that time to report to you the word of Yahweh, for you were afraid because of the presence of the fire, and so you did not go up the mountain. He said,"},{"num":6,"verse":"‘I am Yahweh your God, who brought you out from the land of Egypt, from the house of slavery. "},{"num":7,"verse":"There shall not be for you other gods besides me."},{"num":8,"verse":"‘You shall not make for yourself a divine image of any type of form that is in the heaven above or that is on the earth beneath or that is in the water under the earth."},{"num":9,"verse":"‘You shall not bow down to them, and you shall not serve them, for I, Yahweh your God, am a jealous God, punishing the guilt of fathers upon their children and upon the third and upon the fourth generation of those hating me, "},{"num":10,"verse":"but showing loyal love to thousands of those who love me and of those who keep my commandments."},{"num":11,"verse":"‘You shall not take up the name of Yahweh your God for a worthless purpose, for Yahweh will not leave unpunished anyone who uses his name for a worthless purpose."},{"num":12,"verse":"‘Observe the Sabbath day to make it holy, just as Yahweh your God has commanded you. "},{"num":13,"verse":"Six days you shall work, and you shall do all of your work, "},{"num":14,"verse":"but the seventh day is a Sabbath unto Yahweh your God; you shall not do any work, or your son, or your daughter, or your slave, or your slave woman, or your ox, or your donkey, or any of your domestic animals, or your resident alien who is in your towns, so that your slave and your slave woman may rest as you rest. "},{"num":15,"verse":"And you shall remember that you were a slave in the land of Egypt, and Yahweh your God brought you out with a strong hand and with an outstretched arm; therefore, Yahweh your God commanded you to keep the Sabbath."},{"num":16,"verse":"‘Honor your father and your mother, as Yahweh your God commanded you, so that it will be good for you in the land that Yahweh your God is giving to you."},{"num":17,"verse":"‘You shall not murder."},{"num":18,"verse":"‘And you shall not commit adultery."},{"num":19,"verse":"‘And you shall not steal."},{"num":20,"verse":"‘And you shall not falsely bear evidence against your neighbor."},{"num":21,"verse":"‘And you shall not covet the wife of your neighbor, and you shall not crave the house of your neighbor, his field or his slave or his slave woman or his ox and his donkey or anything that belongs to your neighbor.’"},{"num":22,"verse":"“These words Yahweh spoke to your whole assembly at the mountain from the midst of the fire and the very thick cloud with a loud voice, and he did not add anything, and then he wrote them on two tablets of stone and gave them to me. "},{"num":23,"verse":"And then when you heard the voice from the midst of the darkness, and as the mountain was burning with fire, and and all the heads of your tribes and your elders approached me, "},{"num":24,"verse":"you said, ‘Look, Yahweh our God has shown us his glory and his greatness, and we have heard his voice from the midst of the fire; this day we have seen that God can speak with a human being, yet he remains alive. "},{"num":25,"verse":"And so then why shall we die, for this great fire will consume us if we continue to hear the voice of Yahweh our God any longer, and so we shall die? "},{"num":26,"verse":"For who is there of all flesh who has heard the voice of the living God speaking from the midst of the fire as we have heard it and remained alive? "},{"num":27,"verse":"You go near and hear everything that Yahweh our God will say; and then you tell us all that Yahweh our God tells you, and we will listen, and we will do it.’"},{"num":28,"verse":"“And Yahweh heard the sound of your words when you spoke to me, and Yahweh said to me, ‘I have heard the sound of the words of this people that they have spoken to you; they are right with respect to all that they have spoken. "},{"num":29,"verse":"If only they had such a mind’; that is, to fear me and to keep all my commandments at all times, so that it will go well for them and for their children forever. "},{"num":30,"verse":"Go! Say to them, “Return to your tents.” "},{"num":31,"verse":"But you stand here with me, and let me tell you all of the commandments and the rules and the regulations that you shall teach them, so that they may do them in the land that I am giving to them to take possession of it.’"},{"num":32,"verse":"“So you must be careful to do just as Yahweh your God commanded you; you shall not turn to the right or to the left. "},{"num":33,"verse":"In exactly the path that Yahweh your God has commanded, you must go, so that you may live and it will go well for you and you may live long in the land that you will take possession of.”"}]