[{"header":"The Ten Commandments"},{"num":5,"verse":"Moses sent for all the Israelites. Here is what he said to them."},{"num":2,"verse":"The Lord our God made a covenant with us at Mount Horeb. "},{"num":3,"verse":"He didn’t make it only with our people of long ago. He also made it with us. In fact, he made it with all of us who are alive here today. "},{"num":4,"verse":"The Lord spoke to you face to face. His voice came out of the fire on the mountain. "},{"num":5,"verse":"At that time I stood between the Lord and you. I announced to you the Lord’s message. I did it because you were afraid of the fire. You didn’t go up the mountain."},{"num":6,"verse":"“I am the Lord your God. I brought you out of Egypt. That is the land where you were slaves."},{"num":22,"verse":"These are the commandments the Lord announced in a loud voice to your whole community. He gave them to you there on the mountain. He spoke out of the fire, cloud and deep darkness. He didn’t add anything else. Then he wrote the commandments on two stone tablets. And he gave them to me."},{"num":23,"verse":"The mountain was blazing with fire. You heard the voice coming out of the darkness. So your elders and all the leaders of your tribes came to me. "},{"num":24,"verse":"You said, “The Lord our God has shown us his glory and majesty. We have heard his voice coming out of the fire. Today we have seen that a person can still stay alive even if God speaks with them. "},{"num":25,"verse":"But why should we die? This great fire will burn us up. We’ll die if we hear the voice of the Lord our God again. "},{"num":26,"verse":"We have heard the voice of the living God. We’ve heard him speaking out of the fire. Has any other human being ever heard him speak like that and stayed alive? "},{"num":27,"verse":"Go near and listen to everything the Lord our God says. Then tell us what he tells you. We will listen and obey.”"},{"num":28,"verse":"The Lord heard you when you spoke to me. He said to me, “I have heard what these people said to you. Everything they said was good. "},{"num":29,"verse":"But I wish they would always have respect for me in their hearts. I wish they would always obey all my commands. Then things would go well with them and their children forever."},{"num":30,"verse":"“Go and tell them to return to their tents. "},{"num":31,"verse":"But you stay here with me. Then I will give you all my commands, rules and laws. You must teach the people to obey them in the land I am giving them as their very own.”"},{"num":32,"verse":"So be careful to do what the Lord your God has commanded you. Don’t turn away from his commands to the right or the left. "},{"num":33,"verse":"Live exactly as the Lord your God has commanded you to live. Then you will enjoy life in the land you will soon own. Things will go well with you there. You will live there for a long time."}]