[{"header":"The Ten Commandments(A)"},{"num":5,"verse":"Moses summoned all Israel and said to them: Israel, listen to the laws and rules I’m telling you today. Learn them and faithfully obey them."},{"num":2,"verse":"Yahweh our Elohim made a promise to us at Mount Horeb. "},{"num":3,"verse":"Yahweh didn’t make this promise to our ancestors, but to all of us who are alive here today. "},{"num":4,"verse":"Yahweh spoke to you face to face from the fire on the mountain. "},{"num":5,"verse":"I stood between Yahweh and you to tell you the word of Yahweh, because you were afraid of the fire and didn’t go up on the mountain. The Lord said:"},{"num":6,"verse":"“I am Yahweh your Elohim, who brought you out of slavery in Egypt."},{"num":7,"verse":"“Never have any other gods. "},{"num":8,"verse":"Never make your own carved idols or statues that represent any creature in the sky, on the earth, or in the water. "},{"num":9,"verse":"Never worship them or serve them, because I, Yahweh your Elohim, am El Kanna. I punish children for their parents’ sins to the third and fourth generation of those who hate me. "},{"num":10,"verse":"But I show mercy to thousands of generations of those who love me and obey my commandments."},{"num":11,"verse":"“Never use the name of Yahweh your Elohim carelessly. Yahweh will make sure that anyone who uses his name carelessly will be punished."},{"num":12,"verse":"“Observe the day of worship as a holy day. This is what Yahweh your Elohim has commanded you. "},{"num":13,"verse":"You have six days to do all your work. "},{"num":14,"verse":"The seventh day is the day of worship dedicated to Yahweh your Elohim. You, your sons, your daughters, your male and female slaves, your oxen, your donkeys—all of your animals—even the foreigners living in your city must never do any work on that day. In this way your male and female slaves can rest as you do. "},{"num":15,"verse":"Remember that you were slaves in Egypt and that Yahweh your Elohim used his mighty hand and powerful arm to bring you out of there. This is why Yahweh your Elohim has commanded you to observe the day of worship."},{"num":16,"verse":"“Honor your father and your mother as Yahweh your Elohim has commanded you. Then you will live for a long time, and things will go well for you in the land Yahweh your Elohim is giving you."},{"num":17,"verse":"“Never murder."},{"num":18,"verse":"“Never commit adultery."},{"num":19,"verse":"“Never steal."},{"num":20,"verse":"“Never avoid the truth when you testify about your neighbor."},{"num":21,"verse":"“Never desire to take your neighbor’s wife away from him."},{"num":22,"verse":"These are the commandments Yahweh spoke to your whole assembly on the mountain. He spoke in a loud voice from the fire, the cloud, and the gloomy darkness. Then he stopped speaking. He wrote the commandments on two stone tablets and gave them to me."},{"num":23,"verse":"But when you heard the voice coming from the darkness and saw the mountain blazing with fire, all the leaders and heads of your tribes came to me. "},{"num":24,"verse":"You said, “Yahweh our Elohim has let us see how great and glorious he is. We’ve heard his voice come from the fire. Today we’ve seen that people can live even if Elohim speaks to them. "},{"num":25,"verse":"Why should we die? This great fire will consume us! If we continue to hear the voice of Yahweh our Elohim, we’ll die! "},{"num":26,"verse":"Who has ever heard the voice of Elohim Chay speak from a fire, as we did, and lived? "},{"num":27,"verse":"Moses, go and listen to everything that Yahweh our Elohim says. Then tell us whatever Yahweh our Elohim tells you. We’ll listen and obey.”"},{"num":28,"verse":"When Yahweh heard the words that you spoke to me, Yahweh said, “I have heard what these people said to you. Everything they said was good. "},{"num":29,"verse":"If only they would fear me and obey all my commandments as long as they live! Then things would go well for them and their children forever."},{"num":30,"verse":"“Tell the people to go back to their tents. "},{"num":31,"verse":"But you stay here with me. I will give you all the commands, laws, and rules that you must teach them to obey in the land which I’m giving them to possess.”"},{"num":32,"verse":"So be careful to do what Yahweh your Elohim has commanded you. Never stop living this way. "},{"num":33,"verse":"Follow all the directions Yahweh your Elohim has given you. Then you will continue to live, life will go well for you, and you will live for a long time in the land that you are going to possess."}]