[{"header":"The Fall of Jerusalem(A)"},{"num":52,"verse":"Zedekiah was 21 years old when he began to rule, and he ruled for 11 years in Jerusalem. His mother’s name was Hamutal, daughter of Jeremiah from Libnah. "},{"num":2,"verse":"Zedekiah did what the Lord considered evil, as Jehoiakim had done. "},{"num":3,"verse":"The Lord became angry with Jerusalem and Judah and threw the people out of his sight."},{"num":4,"verse":"On the tenth day of the tenth month of the ninth year of Zedekiah’s reign, King Nebuchadnezzar of Babylon attacked Jerusalem with his entire army. They set up camp and built dirt ramps around the city walls. "},{"num":5,"verse":"The blockade of the city lasted until Zedekiah’s eleventh year as king. "},{"num":6,"verse":"On the ninth day of the fourth month, the famine in the city became so severe that the common people had no food."},{"num":7,"verse":"The enemy broke through the city walls, and all Judah’s soldiers fled. They left the city at night through the gate between the two walls beside the king’s garden. While the Babylonians were attacking the city from all sides, they took the road to the plain ⌞of Jericho⌟. "},{"num":8,"verse":"The Babylonian army pursued King Zedekiah and caught up with him in the plain of Jericho. His entire army had deserted him. "},{"num":9,"verse":"The Babylonians captured the king and brought him to the king of Babylon at Riblah in Hamath, where the king of Babylon passed sentence on him. "},{"num":10,"verse":"The king of Babylon slaughtered Zedekiah’s sons as Zedekiah watched. He also slaughtered all the officials of Judah at Riblah. "},{"num":11,"verse":"Then he blinded Zedekiah and put him in bronze shackles. The king of Babylon took him to Babylon and put him in a prison, where he stayed until he died."},{"num":12,"verse":"On the tenth day of the fifth month of Nebuchadnezzar’s nineteenth year as king of Babylon, Nebuzaradan, who was the captain of the guard and an officer of the king of Babylon, came to Jerusalem. "},{"num":13,"verse":"He burned down the Lord’s temple, the royal palace, and all the houses in Jerusalem. Every important building was burned down. "},{"num":14,"verse":"The entire Babylonian army that was with the captain of the guard tore down the walls around Jerusalem."},{"num":15,"verse":"Nebuzaradan, the captain of the guard, captured the few people left in the city, those who surrendered to the king of Babylon, and the rest of the population. "},{"num":16,"verse":"But Nebuzaradan, the captain of the guard, left some of the poorest people in the land to work in the vineyards and on the farms."},{"num":17,"verse":"The Babylonians broke apart the bronze pillars of the Lord’s temple, the stands, and the bronze pool in the Lord’s temple. They shipped all the bronze to Babylon. "},{"num":18,"verse":"They took the pots, shovels, snuffers, bowls, dishes, and all the bronze utensils used in the temple service. "},{"num":19,"verse":"The captain of the guard also took pans, incense burners, bowls, pots, lamp stands, dishes, and the bowls used for wine offerings. The captain of the guard took all of the trays and bowls that were made of gold or silver. "},{"num":20,"verse":"The bronze from the 2 pillars, the pool, and the 12 bronze bulls under the stands that King Solomon had made for the Lord’s temple couldn’t be weighed. "},{"num":21,"verse":"One pillar was 27 feet high and 18 feet in circumference. It was three inches thick and hollow. "},{"num":22,"verse":"The capital that was on it was 7½ feet high with a filigree and pomegranates around it. They were all made of bronze. The second pillar was the same. It also had pomegranates. "},{"num":23,"verse":"There were 96 pomegranates on the sides. The total number of pomegranates on the surrounding filigree was 100."},{"num":24,"verse":"The captain of the guard took the chief priest Seraiah, the second priest Zephaniah, and the 3 doorkeepers. "},{"num":25,"verse":"From the city he also took an army commander, 7 men who had access to the king whom he found in the city, the scribe who was in charge of the militia, and 60 common people whom he found in the city. "},{"num":26,"verse":"Nebuzaradan, the captain of the guard, took them and brought them to the king of Babylon at Riblah. "},{"num":27,"verse":"The king of Babylon executed them at Riblah in the territory of Hamath. So the people of Judah were captives as they left their land."},{"num":28,"verse":"These are the people Nebuchadnezzar took captive: In his seventh year as king, he took 3,023 Jews. "},{"num":29,"verse":"In his eighteenth year, Nebuchadnezzar took 832 people from Jerusalem. "},{"num":30,"verse":"In Nebuchadnezzar’s twenty-third year as king, Nebuzaradan, the captain of the guard, took away 745 Jews. In all, 4,600 people were taken away."},{"header":"King Jehoiakin Released from Prison(B)"},{"num":31,"verse":"On the twenty-fifth day of the twelfth month of the thirty-seventh year of the imprisonment of King Jehoiakin of Judah, King Evil Merodach of Babylon, in the first year of his reign, freed King Jehoiakin of Judah and released him from prison. "},{"num":32,"verse":"He treated him well and gave him a special position higher than the other kings who were with him in Babylon. "},{"num":33,"verse":"Jehoiakin no longer wore prison clothes, and he ate his meals in the king’s presence as long as he lived. "},{"num":34,"verse":"The king of Babylon gave him a daily food allowance as long as he lived."}]