[{"header":"The Fall of Jerusalem Reviewed(A)"},{"num":52,"verse":"Zedekiah was twenty-one years old when he began to reign, and he reigned eleven years in Jerusalem. And his mother’s name was Hamutal the daughter of Jeremiah of Libnah. "},{"num":2,"verse":"He did what was evil in the eyes of the Lord, according to all that Jehoiakim had done. "},{"num":3,"verse":"Through the anger of the Lord this came to pass in Jerusalem and Judah until He had cast them out from His presence."},{"num":4,"verse":"In the ninth year of his reign, in the tenth month, in the tenth day of the month, Nebuchadnezzar king of Babylon came, he and all his army, against Jerusalem, and laid siege to it; they built a siege wall all around it. "},{"num":5,"verse":"So the city was besieged until the eleventh year of King Zedekiah."},{"num":6,"verse":"In the fourth month, in the ninth day of the month, the famine was so severe in the city that there was no bread for the people of the land. "},{"num":7,"verse":"Then the city was breached, and all the men of war fled and went out of the city by night by way of the gate between the two walls, which was by the king’s garden, though the Chaldeans were all around the city, and they went by way of the Arabah. "},{"num":8,"verse":"But the army of the Chaldeans pursued after the king and overtook Zedekiah in the plains of Jericho, and all his army was scattered from him."},{"num":9,"verse":"Then they took the king and carried him up to the king of Babylon at Riblah in the land of Hamath where he passed sentence on him. "},{"num":10,"verse":"The king of Babylon slew the sons of Zedekiah before his eyes; he also slew all the officials of Judah in Riblah. "},{"num":11,"verse":"Then he put out the eyes of Zedekiah, and the king of Babylon bound him in chains and carried him to Babylon and put him in prison until the day of his death."},{"header":"The Temple Burned"},{"num":12,"verse":"Now in the fifth month, in the tenth day of the month, which was the nineteenth year of Nebuchadnezzar king of Babylon, Nebuzaradan the captain of the guard who served the king of Babylon came into Jerusalem, "},{"num":13,"verse":"and burned the house of the Lord, and the king’s house, and all the houses of Jerusalem. Even all the large houses, he burned with fire. "},{"num":14,"verse":"And all the army of the Chaldeans who were with the captain of the guard broke down all the walls of Jerusalem all around. "},{"num":15,"verse":"Then Nebuzaradan the captain of the guard carried away captive some of the poorest of the people, and the rest of the people who remained in the city, and those who fell away, who fell to the king of Babylon, and the rest of the multitude. "},{"num":16,"verse":"But Nebuzaradan the captain of the guard left some of the poorest of the land to be vinedressers and farmers."},{"num":17,"verse":"Also the pillars of bronze that were in the house of the Lord, and the stands, and the bronze sea that was in the house of the Lord, the Chaldeans broke and carried all their bronze to Babylon. "},{"num":18,"verse":"The cauldrons also, and the shovels, and the snuffers, and the bowls, and the spoons, and all the vessels of bronze with which they ministered, they took away. "},{"num":19,"verse":"The captain of the guard also took away the basins, and the fire pans, and the bowls, and the cauldrons, and the lampstands, and the spoons, and the cups, what was of fine gold, and what was of fine silver."},{"num":20,"verse":"The two pillars, one sea, and twelve bronze bulls that were under the bases, which King Solomon had made in the house of the Lord, the bronze of all these vessels was beyond weight. "},{"num":21,"verse":"Concerning the pillars: the height of one pillar was eighteen cubits, and it was twelve cubits in circumference and in thickness it was four fingers, and hollow. "},{"num":22,"verse":"A capital of bronze was upon it, and the height of one capital was five cubits, with network and pomegranates upon the capital all around, all of bronze. The second pillar also and the pomegranates were like these. "},{"num":23,"verse":"There were ninety-six pomegranates on the sides; all the pomegranates were a hundred upon the network all around."},{"header":"The Babylonian Exile"},{"num":24,"verse":"The captain of the guard took Seraiah the chief priest, and Zephaniah the second priest, and the three officers of the temple. "},{"num":25,"verse":"He also took out of the city one official who had charge of the men of war, and seven men of the advisers of the king who were found in the city, and the scribe of the commander of the army who mustered the people of the land, and sixty men of the people of the land who were found in the midst of the city. "},{"num":26,"verse":"So Nebuzaradan the captain of the guard took them and brought them to the king of Babylon to Riblah. "},{"num":27,"verse":"The king of Babylon struck them and put them to death in Riblah in the land of Hamath."},{"num":28,"verse":"These are the people whom Nebuchadnezzar carried away captive:"},{"header":"Jehoiachin Released(B)"},{"num":31,"verse":"In the thirty-seventh year of the captivity of Jehoiachin, king of Judah, in the twelfth month, on the twenty-fifth day of the month, Awel-Marduk, king of Babylon, in the first year of his reign lifted up the head of Jehoiachin king of Judah and brought him out of prison, "},{"num":32,"verse":"and spoke kindly to him, and set his throne above the throne of the kings who were with him in Babylon. "},{"num":33,"verse":"Therefore Jehoiachin changed his prison garments and continually ate meals before him all the days of his life. "},{"num":34,"verse":"For his allowance, there was a continual allowance given him by the king of Babylon, every day a portion all the days of his life until the day of his death."}]