[{"num":52,"verse":"Tzidkiyah was one and twenty years old when he began to reign, and he reigned eleven shanah in Yerushalayim. And shem immo was Chamutal bat Yirmeyah of Livnah."},{"num":2,"verse":"And he did that which was rah in the eyes of Hashem, according to all that Y’hoyakim had done."},{"num":3,"verse":"For because of the anger of Hashem it came to pass in Yerushalayim and Yehudah, that he finally cast them out from his presence. Tzidkiyah rebelled against HaMelech Bavel."},{"num":4,"verse":"And it came to pass in the ninth year of his reign, in the tenth month, in the tenth day of the month, that Nevuchadretzar Melech Bavel came, he and all his army, against Yerushalayim, and encamped against it, and built siege-works against it round about."},{"num":5,"verse":"So HaIr went under siege unto the eleventh year of Melech Tzidkiyah."},{"num":6,"verse":"And in the fourth month, in the ninth day of the month, the ra’av (famine) was severe in the Ir, so that there was no lechem for the Am HaAretz."},{"num":7,"verse":"Then the Ir was broken through, and all the anshei hamilchamah fled, and went forth out of the Ir by lailah by the way of the gate between the two walls, which was near the Gan HaMelech; (now the Kasdim [Chaldeans] were surrounding the Ir); and they fled by the derech HaAravah."},{"num":8,"verse":"But the army of the Kasdim (Chaldeans) pursued after HaMelech, and overtook Tzidkiyah in the plains of Yericho; and all his army was separated from him and scattered."},{"num":9,"verse":"Then they captured HaMelech, and carried him up unto Melech Bavel to Rivlah in Eretz Chamat; where he pronounced mishpatim upon him."},{"num":10,"verse":"And Melech Bavel slaughtered the Bnei Tzidkiyah before his eyes; he slaughtered also all the sarim (princes) of Yehudah in Rivlah."},{"num":11,"verse":"Then he put out the eyes of Tzidkiyah; and Melech Bavel bound him in chains, and carried him to Babylon, and put him in the bais hapekudot (prison house) till the yom moto (day of his death)."},{"num":12,"verse":"Now in the fifth month, in the tenth day of the month"},{"num":13,"verse":"And set fire to the Beis Hashem, and the Bais HaMelech (the palace); and all the batim (houses) of Yerushalayim, and all the bais hagadol, he burned with eish:"},{"num":14,"verse":"And all the army of the Kasdim (Chaldeans), that were with the captain of the guard, broke down all the chomot (walls) around Yerushalayim."},{"num":15,"verse":"Then Nevuzaradan the captain of the guard sent into the Golus certain of the poor of the people, and the remaining of the people that were left in the Ir, and the defectors to Melech Bavel, and the rest of the multitude."},{"num":16,"verse":"But Nevuzaradan the captain of the guard left certain of the poor of the land for koremim and for farmers."},{"num":17,"verse":"Also the Ammudei HaNechoshet that were in the Beis Hashem, and the moveable Stands, and the Yam Hanechoshet that was in the Beis Hashem, the Kasdim (Chaldeans) broke, and carried all the bronze of them to Babylon."},{"num":18,"verse":"The caldrons also, and the shovels, and the snuffers, and the basins, and the pans, and all the klei hanechoshet wherewith they ministered, they took away."},{"num":19,"verse":"And the cups, and the firepans [for incense], and the bowls, and the caldrons, and the menorahs, and the pans, and the bowls; that which were made of zahav, and that which made of kesef, the captain of the guard carried away."},{"num":20,"verse":"The two Ammudim, one Yam, and twelve bronze bulls that were under the bases, which HaMelech Sh’lomo had made in the Beis Hashem: the bronze of all these vessels was beyond weight."},{"num":21,"verse":"And concerning the Ammudim, the height of one ammud was eighteen cubits; and twelve cubits in circumference; and the thickness thereof was four fingers: it was hollow."},{"num":22,"verse":"And a capital of nechoshet was upon it; and the height of one capital was five cubits, with network and pomegranates upon the capitals round about, all of nechoshet. The second pillar also and the pomegranates were similar unto these."},{"num":23,"verse":"And there were ninety and six pomegranates on a side; and all the pomegranates upon the surrounding network were a me’ah (hundred)."},{"num":24,"verse":"And the captain of the guard took Serayah the Kohen HaRosh, and Tzephanyah the second kohen, and the three keepers of the door:"},{"num":25,"verse":"He took also out of the Ir the officer, which had the charge of the anshei hamilchamah; and seven men of them that were royal advisers which were found in the Ir; and the Sofer who was the chief officer in charge of conscripting the Am HaAretz; and threescore men of the Am HaAretz, that were found in the midst of the Ir."},{"num":26,"verse":"So Nevuzaradan the captain of the guard took them, and brought them to Melech Bavel to Rivlah."},{"num":27,"verse":"And Melech Bavel struck them, and put them to death in Rivlah in Eretz Chamat. Thus Yehudah was carried away captive out of his own land."},{"num":28,"verse":"This is the people whom Nevuchadretzar carried away captive: in the seventh year 3,023 Yehudim:"},{"num":29,"verse":"In the eighteenth year of Nevuchadretzar he carried away captive from Yerushalayim 832 nefesh:"},{"num":30,"verse":"In the three and twentieth year of Nevuchadretzar Nevuzaradan the captain of the guard carried away captive of the Yehudim 745 nefesh: the nefesh were 4,600 in all."},{"num":31,"verse":"And it came to pass in the seven and thirtieth year of the Golus of Y’hoyakhin Melech Yehudah, in the twelfth month, in the five and twentieth day of the month, that Eveel-Merodach Melech Bavel in the first year of his reign [562 B.C.E.] lifted up the head of Y’hoyakhin Melech Yehudah, and brought him forth out of prison [561 B.C.E.]."},{"num":32,"verse":"And spoke kindly unto him, and set his throne above the kisse of the melachim that were with him in Babylon,"},{"num":33,"verse":"And changed his prison garments: and he did continually eat lechem before him all the days of his life."},{"num":34,"verse":"And for his allowance, there was a regular allowance given him of the Melech Bavel, every day a portion until the yom moto (day of his death) all the days of his life."}]