[{"header":"Babylon Destroys Jerusalem"},{"num":52,"verse":"Zedekiah was 21 years old when he became king and he reigned 11 years in Jerusalem. His mother’s name was Hamutal the daughter of Jeremiah of Libnah. "},{"num":2,"verse":"And he did what was evil in Adonai’s eyes, just like all Jehoiakim had done. "},{"num":3,"verse":"Because of Adonai’s anger it came to the point in Jerusalem and Judah that He had them cast out of His presence."},{"num":4,"verse":"It came to pass in the ninth year of his reign in the tenth month, the tenth day of the month, that King Nebuchadnezzar of Babylon came—he and all his army—against Jerusalem, and besieged it. They built a siege wall all around it. "},{"num":5,"verse":"So the city was besieged until the eleventh year of King Zedekiah."},{"num":6,"verse":"In the fourth month, the ninth day of the month, the famine was so severe in the city, that there was no food for the people of the land. "},{"num":7,"verse":"Then the city was broken into, and all the men of war fled, going out of the city by night by the way of the gate between the two walls, which was near the king’s garden—even though the Chaldeans were all around the city. They were heading along the way of the Arabah."},{"num":8,"verse":"But the Chaldean army pursued the king and overtook Zedekiah in the desert plains of Jericho. Then all his army was scattered from him. "},{"num":9,"verse":"Then they took the king and brought him up to the king of Babylon at Riblah in the land of Hamath. He passed judgment on him."},{"num":10,"verse":"At Riblah, the king of Babylon slaughtered Zedekiah’s sons before his eyes, and also all the Judean leaders. "},{"num":11,"verse":"Then he put out Zedekiah’s eyes. Then the king of Babylon bound him in bronze chains, and brought him to Babylon, where he put him in prison until the day of his death."},{"num":12,"verse":"Now in the fifth month, the tenth day of the month—which was the nineteenth year of King Nebuchadnezzar, king of Babylon—Nebuzaradan the captain of the guard came into Jerusalem to represent the king of Babylon. "},{"num":13,"verse":"Then he burned the House of Adonai, the king’s house, and all the houses of Jerusalem. He burned every large house with fire. "},{"num":14,"verse":"Then all the Chaldean army, which was with the captain of the guard, broke down all the walls of Jerusalem all around."},{"num":15,"verse":"Then Nebuzaradan the captain of the guard carried into exile some of the poorest of the people, the rest of the people who were left in the city, the deserters who had defected to the king of Babylon, and what remained of the craftsmen. "},{"num":16,"verse":"But Nebuzaradan the captain of the guard left some of the poorest of the land to be vinedressers and plowmen."},{"num":17,"verse":"The Chaldeans smashed the bronze pillars of the House of Adonai, the stands and the bronze sea that were in the House of Adonai, and carried all the bronze to Babylon. "},{"num":18,"verse":"The pots, the shovels, the wick trimmers, the basins, the pans, and all the bronze articles for Temple service, they also took away. "},{"num":19,"verse":"The cups, the fire-pans, the basins, the pots, the menorot, the pans, and the drink offering bowls—whatever was gold or silver—the captain of the guard took away."},{"num":20,"verse":"As for the two pillars, one sea, and twelve bronze bulls that were under the stands that King Solomon had made for the House of Adonai—all these articles had bronze beyond weighing. "},{"num":21,"verse":"The height of one pillar was 18 cubits and it was twelve cubits in circumference and four fingers in its thickness—it was hollow. "},{"num":22,"verse":"There was a bronze capital on it—the height of one capital was five cubits, with latticework and pomegranates upon the capital all around, all of bronze. The second pillar was the same, with pomegranates. "},{"num":23,"verse":"There were 96 pomegranates on the outside; including all the pomegranates around the lattice, there were 100."},{"num":24,"verse":"Then the captain of the guard took Seraiah the kohen gadol, and Zephaniah the second kohen, and the three doorkeepers. "},{"num":25,"verse":"From the city he took an officer who had been appointed over the men of war as well as seven men who saw the king’s face, who were found in the city, the scribe of the commander of the army, who enlisted people of the land, and 60 men of the people of the land who were found within the city. "},{"num":26,"verse":"Nebuzaradan the captain of the guard took them and brought them to the king of Babylon to Riblah."},{"num":27,"verse":"The king of Babylon struck them down and put them to death at Riblah in the land of Hamath. Then Judah was led away into exile from its land."},{"num":28,"verse":"These are the people whom Nebucha-dnez-zar carried away captive: in the seventh year 3,023 Jews; "},{"num":29,"verse":"in Nebuchadnez-zar’s eighteenth year, 832 people from Jerusalem; "},{"num":30,"verse":"in the Nebuchadnezzar’s twenty-third year, Nebuzaradan the captain of the guard exiled 745 of the Jews—all together 4,600 people."},{"header":"Release of King Jehoiachin"},{"num":31,"verse":"Now it came to pass on the twenty-fifth day of the twelfth month of the thirty-seventh year of the captivity of Judah’s King Jehoiachin, that King Evil-merodach of Babylon, in the first year of his reign, lifted up the head of Judah’s King Jehoiachin, and released him out of prison. "},{"num":32,"verse":"He spoke kindly to him and gave him a throne above the throne of the kings who were with him in Babylon. "},{"num":33,"verse":"Then he changed out of his prison garments, dined regularly before him all the days of his life. "},{"num":34,"verse":"As for his allowance, a regular allowance was given to him by the king of Babylon, a portion for each day until the day of his death, all the days of his life."}]