[{"num":1,"verse":"¶ Now it came to pass at thirty years, in the fourth month, in the fifth day of the month, as I was among the captives by the river of Chebar, that the heavens were opened, and I saw visions of God."},{"num":2,"verse":"In the fifth day of the month, which was the fifth year of King Jehoiachin’s captivity,"},{"num":3,"verse":"the word of the LORD came expressly unto Ezekiel the priest, the son of Buzi, in the land of the Chaldeans by the river Chebar; and there the hand of the LORD came upon him."},{"num":4,"verse":"¶ And I looked, and, behold, a whirlwind came out of the north, and a great cloud, and a fire enfolding itself, and a brightness was about it, and out of the midst thereof as the colour of amber, out of the midst of the fire."},{"num":5,"verse":"Also out of the midst thereof came the likeness of four living creatures. And this was their appearance: they had the likeness of man."},{"num":6,"verse":"And each one had four faces, and four wings."},{"num":7,"verse":"And their feet were straight feet; and the sole of their feet was like the sole of a calf’s foot; and they sparkled like the colour of highly burnished brass."},{"num":8,"verse":"And they had the hands of a man under their wings on their four sides; and their faces and their wings on all four sides."},{"num":9,"verse":"With their wings they joined one to another; they did not return when they went; they went each one straight in the direction they were facing."},{"num":10,"verse":"And the likeness of their faces was human faces; and lion faces, on the right side; and they four had ox faces on the left side; likewise they four had eagle faces."},{"num":11,"verse":"Thus were their faces; and their wings were stretched upward; two wings of each one were joined one to another, and two covered their bodies."},{"num":12,"verse":"And they went each one straight forward in the direction they were facing: wherever the Spirit directed them to go, they went; and they did not return when they went."},{"num":13,"verse":"As for the likeness of the living creatures, their appearance was like burning coals of fire and like the appearance of lit torches; the fire went up and down among the living creatures and the brightness of the fire; and out of the fire went forth lightning."},{"num":14,"verse":"And the living creatures ran and turned as the appearance of lightnings."},{"num":15,"verse":"¶ Now as I beheld the living creatures, behold a wheel upon the earth with its four rims by the living creatures."},{"num":16,"verse":"The appearance of the wheels and their work was like unto the colour of a stone of Tarsis or beryl; and they four had one likeness; and their appearance and their workmanship was as it were a wheel in the middle of a wheel."},{"num":17,"verse":"When they went, they went upon their four sides: and they did not return when they went."},{"num":18,"verse":"And their ribs were high and dreadful, and full of eyes round about them in all four."},{"num":19,"verse":"And when the living creatures went, the wheels went with them: and when the living creatures were lifted up from the earth, the wheels were lifted up."},{"num":20,"verse":"Wherever the spirit wished to go, they went; wherever the spirit directed them, the wheels also rose up after them: for the spirit of the living creatures was in the wheels."},{"num":21,"verse":"When those went, these went; and when those stood, these stood; and when those were lifted up from the earth, the wheels were lifted up after them: for the spirit of the living creatures was in the wheels."},{"num":22,"verse":"And over the heads of each living creature there appeared a heaven like a marvellous crystal, stretched forth over their heads above."},{"num":23,"verse":"And under the heaven their wings were straight, one toward the other: each one had two, and another two which covered their bodies."},{"num":24,"verse":"And when they went, I heard the noise of their wings, like the noise of many waters, as the voice of the Almighty, when they went; the voice of the word, as the voice of an army. When they stood, they let down their wings."},{"num":25,"verse":"And there was heard a voice from the heaven that was over their heads, when they stood, and had let down their wings."},{"num":26,"verse":"¶ And above the heaven that was over their heads was the figure of a throne, as the appearance of a sapphire stone: and upon the figure of the throne was a likeness as the appearance of a man seated upon it."},{"num":27,"verse":"And I saw something that looked like the colour of amber, that appeared to have fire round about within it, which could be seen from his loins upward; and from his loins downward, I saw what looked like fire, and it had brightness round about"},{"num":28,"verse":"that looked like the bow of heaven that is in the clouds in the day of rain, so was the appearance of the brightness round about. This was the vision of the likeness of the glory of the LORD. And I saw it and fell upon my face, and I heard a voice of one that spoke."}]