[{"header":"Ezekiel Sees God’s Throne"},{"num":1,"verse":"On the fifth day of the fourth month in the thirtieth year, while I was by the Chebar River with the Jews who had been taken away from their land, the heavens were opened and I saw God in a special way. "},{"num":2,"verse":"(On the fifth day of the month in the fifth year that King Jehoiachin had been living in a strange land, "},{"num":3,"verse":"the Word of the Lord came to Ezekiel the religious leader, son of Buzi, in the land of the Babylonians by the Chebar River. There the hand of the Lord came upon him.)"},{"num":4,"verse":"I looked and saw a wind storm coming from the north. There was a big cloud with lightning coming from it and with a bright light around it. Inside the fire was something like shining brass, "},{"num":5,"verse":"and in the fire was what looked like four living beings. They looked like men, "},{"num":6,"verse":"but each of them had four faces and four wings. "},{"num":7,"verse":"Their legs were straight, and their feet were like those of a calf. They shined like bright brass. "},{"num":8,"verse":"Under their wings on their four sides were hands like a man’s. As for the faces and wings of the four of them, "},{"num":9,"verse":"their wings touched one another. Their faces did not turn when they moved. Each one moved straight ahead. "},{"num":10,"verse":"As for what their faces looked like, each of the four had the face of a man, the face of a lion on the right side, the face of a bull on the left side, and the face of an eagle. "},{"num":11,"verse":"Such were their faces. Their wings were spread out above. Each had two wings touching the wings of another, and two covering their bodies. "},{"num":12,"verse":"And each one went straight ahead. Every place where the spirit would go, they would go, without turning as they went. "},{"num":13,"verse":"Between the living beings there was something that looked like burning coals of fire, like fire lamps moving from side to side among the living beings. The fire was bright, and lightning was coming out of the fire. "},{"num":14,"verse":"And the living beings ran this way and that, like lightning."},{"num":15,"verse":"As I looked at the living beings, I saw one wheel on the earth beside each of the living beings with its four faces. "},{"num":16,"verse":"The way the wheels were made, they looked like shining chrysolite stone. All four of them looked the same. They were made to look as if one wheel were within another. "},{"num":17,"verse":"When they moved, they went in one of their four ways, without turning as they went. "},{"num":18,"verse":"The wheels were so high that they caused fear. And all four of them were full of eyes all around. "},{"num":19,"verse":"When the living beings moved, the wheels moved with them. And when the living beings rose from the earth, the wheels rose also. "},{"num":20,"verse":"Whatever way the spirit would go, they would go that way. And the wheels rose close beside them, for the spirit of the living beings was in the wheels. "},{"num":21,"verse":"When the living beings moved, they moved. When the beings stood still, they stood still. And when the beings rose up from the earth, the wheels rose close beside them. For the spirit of the living beings was in the wheels."},{"num":22,"verse":"Over the heads of the living beings there was something that looked like the sky. It shined like crystal and spread over their heads. "},{"num":23,"verse":"Under this covering their wings were spread out straight, one toward the other. Each one also had two wings covering their bodies on one side and on the other. "},{"num":24,"verse":"When they went, I heard the sound of their wings. They sounded like many waters, like the voice of the All-powerful. They sounded like the noise of an army camp. Whenever they stood still, they let down their wings. "},{"num":25,"verse":"A voice came from above the large covering over their heads. Whenever they stood still, they let down their wings."},{"num":26,"verse":"Above the large covering that was over their heads there was something that looked like a throne, and looked like it was made of sapphire. Sitting on the throne was what looked like a man. "},{"num":27,"verse":"Then I saw that there was something like shining brass from the center of his body and up to his head. It looked like fire all around within it. And from the center of his body and down to his feet I saw something like fire. There was a bright light shining all around Him."},{"num":28,"verse":"This light shining around Him looked like the rainbow in the clouds on a day of rain."}]