[{"num":1,"verse":"Now it came to pass in the thirtieth year, in the fourth month, in the fifth day of the month, while I was among those of the Golus by the Nahar Kevar, that Shomayim was opened, and I saw mar’ot Elohim."},{"num":2,"verse":"In the fifth day of the month, which was the fifth year of the Golus of HaMelech Yoyakhin [593 B.C.E.},"},{"num":3,"verse":"The Devar Hashem came expressly unto Yechezkel the kohen, ben Buzi, in Eretz Kasdim (Chaldeans) by the Nahar Kevar; and the Yad Hashem was there upon him."},{"num":4,"verse":"And I looked, and, hinei, a ruach se’arah came out of the tzafon, an anan gadol, and flashing fire, with brilliant light all about it, and out of the midst thereof something gleaming, shining out of the midst of the eish."},{"num":5,"verse":"Also out of the midst thereof came the demut (likeness) of four Chayos. And this was their appearance: they had the demut adam."},{"num":6,"verse":"And every one had arba’ah panim, and every one had arba kenafayim."},{"num":7,"verse":"And their regalim were regel yesharah; and the sole of their feet was like the sole of a regel egel; and they gleamed like the shining of burnished nechoshet."},{"num":8,"verse":"And they had the hands of an adam under their kenafayim on their four sides; and they four had their panim and their kenafayim."},{"num":9,"verse":"Their kenafayim were joined one to another; they turned not as they went; they went every one face forward."},{"num":10,"verse":"As for the demut of their panim, they four had the face of an adam, and the face of an aryeh, on the right side; and they four had the face of a shor on the left side; they four also had the face of a nesher."},{"num":11,"verse":"Thus were their panim; and their kenafayim were stretched upward; two wings of every one were joined one to another, and two covered their geviyot."},{"num":12,"verse":"And they went every one face forward; whither the Ruach was to go, they went; and they turned not when they went."},{"num":13,"verse":"As for the demut of the Chayos, their appearance was like coals of eish burning, and like the appearance of lapidim (torches); it spread back and forth among the Chayos; and the eish was brilliant, and out of the eish went forth barak (lightning)."},{"num":14,"verse":"And the Chayos ran and returned as the appearance of bazak (a flash of lightning)."},{"num":15,"verse":"Now as I beheld the Chayos, hinei there was one Ofan ba’aretz etzel the Chayos, with its four panim."},{"num":16,"verse":"The appearance of the Ofanim and their making was like unto the color of tarshish; and they four had one demut; and their appearance and their making was as it were an Ofan within an Ofan."},{"num":17,"verse":"Arba’at (four) sidedly they went; and they turned not as they went."},{"num":18,"verse":"As for their rims, they were so high that they were dreadful; and their rims were mele’ot einayim saviv (full of eyes round about) the four of them."},{"num":19,"verse":"And when the Chayos went, the Ofanim went beside them; and when the Chayos were lifted up from ha’aretz, the Ofanim were lifted up."},{"num":20,"verse":"Whithersoever the Ruach was to go, they went, thither was the Ruach to go; and the Ofanim were lifted facing them; for Ruach HaChayah was in the Ofanim."},{"num":21,"verse":"When those went, these went; and when those stood still, these stood still; and when those were lifted up from ha’aretz, the Ofanim were lifted up facing them; for the Ruach HaChayah was in the Ofanim."},{"num":22,"verse":"And the demut of the raki’a upon the rashei HaChayah was as the color of terrible ice crystal, spread out upward above their rashim."},{"num":23,"verse":"And under the raki’a were their kenafayim stretched out, the one toward the other; every one had two, which covered on this side, and every one had two, which covered on that side, their geviyot."},{"num":24,"verse":"And when they went, I heard the kol of their kenafayim, like the kol of mayim rabbim, as the Kol Shaddai, the voice of a tumult, as the sound of a machaneh; when they stood still, they let down their kenafayim."},{"num":25,"verse":"And there was a kol (voice) from the raki’a that was over their rosh, when they stood still, and had let down their kenafayim."},{"num":26,"verse":"And above the raki’a that was over their rosh was the demut kisse, as the appearance of a precious stone, a sapphire; and upon the demut hakisse was the demut like the appearance of adam above upon it."},{"num":27,"verse":"And I saw something gleaming, shining out like the appearance of eish; inside it all around, from the appearance of his loins even upward, and from the appearance of his loins even downward, I saw something like the appearance of eish, and it had radiance all around."},{"num":28,"verse":"As the appearance of the keshet (rainbow) that is in the anan in yom hageshem, so was the appearance of the radiance all around. This was the appearance of the demut Kavod Hashem. And when I saw it, I fell upon my face, and I heard a voice of one that spoke."}]