[{"num":8,"verse":"But the men of Efrayim complained to Gid‘on, “Why didn’t you call on us when you went to fight Midyan? Why did you treat us this way?” They were sharp in their criticism. "},{"num":2,"verse":"He answered by saying to them, “How can what I have done be compared with what you have done? Aren’t the grapes Efrayim leaves on the vines better than the ones Avi‘ezer harvests? "},{"num":3,"verse":"God handed over to you Midyan’s chiefs, ‘Orev and Ze’ev. What could I do that matches what you did?” By saying that, he appeased their anger at him."},{"num":4,"verse":"By now Gid‘on and his three hundred men had come to the Yarden and crossed over. They were exhausted but were still pursuing the enemy. "},{"num":5,"verse":"In Sukkot he asked the people there, “Please give some loaves of bread to the men following me, because they are exhausted, and I am pursuing Zevach and Tzalmuna the kings of Midyan.” "},{"num":6,"verse":"But the chiefs of Sukkot said, “You haven’t captured Zevach and Tzalmuna yet, so why should we give bread to your army?” "},{"num":7,"verse":"Gid‘on said: “If that’s your answer, then after Adonai has put Zevach and Tzalmuna in my hands, I will tear your flesh apart with desert thorns and thistles!”"},{"num":8,"verse":"From there he went up to P’nu’el and made the same request, and the people of P’nu’el gave the same answer as those of Sukkot. "},{"num":9,"verse":"So he answered the people of P’nu’el similarly, “When I return safe and sound, I will break down this tower!”"},{"num":10,"verse":"Now Zevach and Tzalmuna were in Karkor with their army, about 15,000 men, all that remained of the entire army of the people from the east; since 120,000 arms-bearing soldiers had fallen. "},{"num":11,"verse":"Gid‘on went up, using the route of the nomads east of Novach and Yogbehah, and struck down the army when they thought they were safe. "},{"num":12,"verse":"Zevach and Tzalmuna fled, but Gid‘on pursued them. Thus he captured the two kings of Midyan, Zevach and Tzalmuna, and routed their whole army in panic. "},{"num":13,"verse":"When Gid‘on the son of Yo’ash returned from the battle by way of the Heres Pass, "},{"num":14,"verse":"he captured a young man from Sukkot and asked him about the chiefs and leaders of Sukkot; he wrote down for him the names of seventy-seven of them. "},{"num":15,"verse":"Then he came to the people of Sukkot and said: “You insulted me when you said, ‘You haven’t captured Zevach and Tzalmuna yet, so why should we give bread to your exhausted men?’ Well, here are Zevach and Tzalmuna!” "},{"num":16,"verse":"And he took the leaders of the city and desert thorns and thistles, and used them to teach the people of Sukkot a lesson! "},{"num":17,"verse":"He also broke down the tower of P’nu’el and put the men of the city to death."},{"num":18,"verse":"Then he said to Zevach and Tzalmuna, “Tell me about the men you killed at Tavor.” They answered, “They looked like you, like a king’s sons.” "},{"num":19,"verse":"Gid‘on replied, “They were my brothers, my mother’s sons. As surely as Adonai is alive, I swear that if you had spared them, I would not kill you.” "},{"num":20,"verse":"Then he ordered his oldest son, Yeter, “Get up, and kill them!” But the boy didn’t draw his sword; being still a boy, he was afraid. "},{"num":21,"verse":"Then Zevach and Tzalmuna said, “You, do it. You, kill us. Let a grown man do what takes a grown man’s strength.” So Gid‘on got up and killed Zevach and Tzalmuna; then he took the ornamental crescents from around their camels’ necks."},{"num":22,"verse":"The men of Isra’el said to Gid‘on: “Rule over us, you, your son and your grandson, because you saved us from the power of Midyan. "},{"num":23,"verse":"Gid‘on replied, “Neither I nor my son will rule over you; Adonai will rule over you.” "},{"num":24,"verse":"Then he added, “But I have this request to make of you, that each of you would give me the earrings from the booty you have taken.” For the enemy soldiers had worn gold earrings, like all the other tribes descended from Yishma‘el. "},{"num":25,"verse":"They replied, “We’re glad to give them to you.” They spread out a robe, and each man threw in the earrings from his booty. "},{"num":26,"verse":"The gold earrings he requested weighed more than forty-two pounds; and this doesn’t include the crescents, pendants and purple cloth worn by the kings of Midyan and the chains around their camels’ necks. "},{"num":27,"verse":"Out of these things Gid‘on made a ritual vest, which he located in his city, ‘Ofrah. But all Isra’el turned it into an idol there, and it thus became a snare to Gid‘on and his family."},{"num":28,"verse":"This is how Midyan was defeated by Isra’el, so that they ceased to be a threat. The land had rest forty years during the lifetime of Gid‘on; "},{"num":29,"verse":"Yeruba‘al the son of Yo’ash returned to his home and stayed there."},{"num":30,"verse":"Gid‘on became the father of seventy sons, because he had many wives. "},{"num":31,"verse":"He also had a concubine in Sh’khem, and she too bore him a son, whom he called Avimelekh. "},{"num":32,"verse":"Gid‘on the son of Yo’ash died at a ripe old age and was buried in the tomb of his father Yo’ash, in ‘Ofrah of the Avi‘ezri."},{"num":33,"verse":"But as soon as Gid‘on was dead, the people of Isra’el again went astray after the ba‘alim and made Ba‘al-B’rit their god. "},{"num":34,"verse":"They forgot Adonai their God, who had saved them from the power of all their enemies on every side; "},{"num":35,"verse":"and they showed no kindness toward the family of Yeruba‘al, that is, Gid‘on, to repay them for all the good he had done for Isra’el."}]