[{"num":8,"verse":"The men of Ephraim asked Gideon, “Why did you treat us this way? Why didn’t you call us when you went to fight against Midian?” They argued angrily with Gideon."},{"num":2,"verse":"But he answered them, “I have not done as well as you! The small part you did was better than all that my people of Abiezer did. "},{"num":3,"verse":"God let you capture Oreb and Zeeb, the princes of Midian. How can I compare what I did with what you did?” When the men of Ephraim heard Gideon’s answer, they were not as angry anymore."},{"header":"Gideon Captures Two Kings"},{"num":4,"verse":"When Gideon and his three hundred men came to the Jordan River, they were tired, but they chased the enemy across to the other side. "},{"num":5,"verse":"Gideon said to the men of Succoth, “Please give my soldiers some bread because they are very tired. I am chasing Zebah and Zalmunna, the kings of Midian.”"},{"num":6,"verse":"But the leaders of Succoth said, “Why should we give your soldiers bread? You haven’t caught Zebah and Zalmunna yet.”"},{"num":7,"verse":"Then Gideon said, “The Lord will surrender Zebah and Zalmunna to me. After that, I will whip your skin with thorns and briers from the desert.”"},{"num":8,"verse":"Gideon left Succoth and went to the city of Peniel and asked them for food. But the people of Peniel gave him the same answer as the people of Succoth. "},{"num":9,"verse":"So Gideon said to the men of Peniel, “After I win the victory, I will return and pull down this tower.”"},{"num":10,"verse":"Zebah and Zalmunna and their army were in the city of Karkor. About fifteen thousand men were left of the armies of the peoples of the east. Already one hundred twenty thousand soldiers had been killed. "},{"num":11,"verse":"Gideon went up the road of those who live in tents east of Nobah and Jogbehah, and he attacked the enemy army when they did not expect it. "},{"num":12,"verse":"Zebah and Zalmunna, the kings of Midian, ran away, but Gideon chased and captured them and frightened away their army."},{"num":13,"verse":"Then Gideon son of Joash returned from the battle by the Pass of Heres. "},{"num":14,"verse":"Gideon captured a young man from Succoth and asked him some questions. So the young man wrote down for Gideon the names of seventy-seven officers and elders of Succoth."},{"header":"Gideon Punishes Succoth"},{"num":15,"verse":"When Gideon came to Succoth, he said to the people of that city, “Here are Zebah and Zalmunna. You made fun of me by saying, ‘Why should we give bread to your tired men? You have not caught Zebah and Zalmunna yet.’” "},{"num":16,"verse":"So Gideon took the elders of the city and punished them with thorns and briers from the desert. "},{"num":17,"verse":"He also pulled down the tower of Peniel and killed the people in that city."},{"num":18,"verse":"Gideon asked Zebah and Zalmunna, “What were the men like that you killed on Mount Tabor?”"},{"num":19,"verse":"Gideon said, “Those were my brothers, my mother’s sons. As surely as the Lord lives, I would not kill you if you had spared them.” "},{"num":20,"verse":"Then Gideon said to Jether, his oldest son, “Kill them.” But Jether was only a boy and was afraid, so he did not take out his sword."},{"num":21,"verse":"Then Zebah and Zalmunna said to Gideon, “Come on. Kill us yourself. As the saying goes, ‘It takes a man to do a man’s job.’” So Gideon got up and killed Zebah and Zalmunna and took the decorations off their camels’ necks."},{"header":"Gideon Makes an Idol"},{"num":22,"verse":"The people of Israel said to Gideon, “You saved us from the Midianites. Now, we want you and your son and your grandson to rule over us.”"},{"num":23,"verse":"But Gideon told them, “The Lord will be your ruler. I will not rule over you, nor will my son rule over you.” "},{"num":24,"verse":"He said, “I want you to do this one thing for me. I want each of you to give me a gold earring from the things you took in the fighting.” (The Ishmaelites wore gold earrings.)"},{"num":25,"verse":"They said, “We will gladly give you what you want.” So they spread out a coat, and everyone threw down an earring from what he had taken. "},{"num":26,"verse":"The gold earrings weighed about forty-three pounds. This did not count the decorations, necklaces, and purple robes worn by the kings of Midian, nor the chains from the camels’ necks. "},{"num":27,"verse":"Gideon used the gold to make a holy vest, which he put in his hometown of Ophrah. But all the Israelites were unfaithful to God and worshiped it, so it became a trap for Gideon and his family."},{"header":"The Death of Gideon"},{"num":28,"verse":"So Midian was under the rule of Israel; they did not cause trouble anymore. And the land had peace for forty years, as long as Gideon was alive."},{"num":29,"verse":"Gideon son of Joash went to his home to live. "},{"num":30,"verse":"He had seventy sons of his own, because he had many wives. "},{"num":31,"verse":"He had a slave woman who lived in Shechem, and he had a son by her, whom he named Abimelech. "},{"num":32,"verse":"So Gideon son of Joash died at a good old age. He was buried in the tomb of Joash, his father, in Ophrah, where the Abiezrites live."},{"num":33,"verse":"As soon as Gideon died, the people of Israel were again unfaithful to God and followed the Baals. They made Baal-Berith their god. "},{"num":34,"verse":"The Israelites did not remember the Lord their God, who had saved them from all their enemies living all around them. "},{"num":35,"verse":"And they were not kind to the family of Jerub-Baal, also called Gideon, for all the good he had done for Israel."}]