[[],[{"type":"header","content":"Gideon Kills Zebah and Zalmunna"},{"type":"prose","content":"Then the people of Ephraim asked Gideon, “Why have you treated us this way? Why didn’t you send for us when you first went out to fight the Midianites?” And they argued heatedly with Gideon."}],[{"type":"prose","content":"But Gideon replied, “What have I accomplished compared to you? Aren’t even the leftover grapes of Ephraim’s harvest better than the entire crop of my little clan of Abiezer?"}],[{"type":"prose","content":"God gave you victory over Oreb and Zeeb, the commanders of the Midianite army. What have I accomplished compared to that?” When the men of Ephraim heard Gideon’s answer, their anger subsided."}],[{"type":"prose","content":"Gideon then crossed the Jordan River with his 300 men, and though exhausted, they continued to chase the enemy."}],[{"type":"prose","content":"When they reached Succoth, Gideon asked the leaders of the town, “Please give my warriors some food. They are very tired. I am chasing Zebah and Zalmunna, the kings of Midian.”"}],[{"type":"prose","content":"But the officials of Succoth replied, “Catch Zebah and Zalmunna first, and then we will feed your army.”"}],[{"type":"prose","content":"So Gideon said, “After the  gives me victory over Zebah and Zalmunna, I will return and tear your flesh with the thorns and briers from the wilderness.”"}],[{"type":"prose","content":"From there Gideon went up to Peniel and again asked for food, but he got the same answer."}],[{"type":"prose","content":"So he said to the people of Peniel, “After I return in victory, I will tear down this tower.”"}],[{"type":"prose","content":"By this time Zebah and Zalmunna were in Karkor with about 15,000 warriors—all that remained of the allied armies of the east, for 120,000 had already been killed."}],[{"type":"prose","content":"Gideon circled around by the caravan route east of Nobah and Jogbehah, taking the Midianite army by surprise."}],[{"type":"prose","content":"Zebah and Zalmunna, the two Midianite kings, fled, but Gideon chased them down and captured all their warriors."}],[{"type":"prose","content":"After this, Gideon returned from the battle by way of Heres Pass."}],[{"type":"prose","content":"There he captured a young man from Succoth and demanded that he write down the names of all the seventy-seven officials and elders in the town."}],[{"type":"prose","content":"Gideon then returned to Succoth and said to the leaders, “Here are Zebah and Zalmunna. When we were here before, you taunted me, saying, ‘Catch Zebah and Zalmunna first, and then we will feed your exhausted army.’”"}],[{"type":"prose","content":"Then Gideon took the elders of the town and taught them a lesson, punishing them with thorns and briers from the wilderness."}],[{"type":"prose","content":"He also tore down the tower of Peniel and killed all the men in the town."}],[{"type":"prose","content":"Then Gideon asked Zebah and Zalmunna, “The men you killed at Tabor—what were they like?”“Like you,” they replied. “They all had the look of a king’s son.”"}],[{"type":"prose","content":"“They were my brothers, the sons of my own mother!” Gideon exclaimed. “As surely as the  lives, I wouldn’t kill you if you hadn’t killed them.”"}],[{"type":"prose","content":"Turning to Jether, his oldest son, he said, “Kill them!” But Jether did not draw his sword, for he was only a boy and was afraid."}],[{"type":"prose","content":"Then Zebah and Zalmunna said to Gideon, “Be a man! Kill us yourself!” So Gideon killed them both and took the royal ornaments from the necks of their camels."},{"type":"header","content":"Gideon’s Sacred Ephod"}],[{"type":"prose","content":"Then the Israelites said to Gideon, “Be our ruler! You and your son and your grandson will be our rulers, for you have rescued us from Midian.”"}],[{"type":"prose","content":"But Gideon replied, “I will not rule over you, nor will my son. The  will rule over you!"}],[{"type":"prose","content":"However, I do have one request—that each of you give me an earring from the plunder you collected from your fallen enemies.” (The enemies, being Ishmaelites, all wore gold earrings.)"}],[{"type":"prose","content":"“Gladly!” they replied. They spread out a cloak, and each one threw in a gold earring he had gathered from the plunder."}],[{"type":"prose","content":"The weight of the gold earrings was forty-three pounds, not including the royal ornaments and pendants, the purple clothing worn by the kings of Midian, or the chains around the necks of their camels."}],[{"type":"prose","content":"Gideon made a sacred ephod from the gold and put it in Ophrah, his hometown. But soon all the Israelites prostituted themselves by worshiping it, and it became a trap for Gideon and his family."}],[{"type":"prose","content":"That is the story of how the people of Israel defeated Midian, which never recovered. Throughout the rest of Gideon’s lifetime—about forty years—there was peace in the land."}],[{"type":"prose","content":"Then Gideon son of Joash returned home."}],[{"type":"prose","content":"He had seventy sons born to him, for he had many wives."}],[{"type":"prose","content":"He also had a concubine in Shechem, who gave birth to a son, whom he named Abimelech."}],[{"type":"prose","content":"Gideon died when he was very old, and he was buried in the grave of his father, Joash, at Ophrah in the land of the clan of Abiezer."}],[{"type":"prose","content":"As soon as Gideon died, the Israelites prostituted themselves by worshiping the images of Baal, making Baal-berith their god."}],[{"type":"prose","content":"They forgot the  their God, who had rescued them from all their enemies surrounding them."}],[{"type":"prose","content":"Nor did they show any loyalty to the family of Jerub-baal (that is, Gideon), despite all the good he had done for Israel."}]]