[{"num":4,"verse":"Gideon came to the Jordan, he and his 300 men, all of them tired and hungry, but they crossed to continue the chase. "},{"num":5,"verse":"So he spoke to the people of Succoth."},{"num":8,"verse":"From Succoth, Gideon went up to Penuel and had the same conversation with them, asking for bread and being answered by the men of Penuel just as by the men of Succoth."},{"num":10,"verse":"Zebah and Zalmunna were in Karkor with an army of about 15,000 men, all that was left from the armies of the east, for they had lost 120,000 soldiers. "},{"num":11,"verse":"Gideon approached them by the caravan trail east of Nobah and Jogbehah, and he attacked them when they least expected it. "},{"num":12,"verse":"When Zebah and Zalmunna fled, he followed and captured them, throwing their forces into complete disarray."},{"num":13,"verse":"When Gideon, son of Joash, returned from fighting by way of the Heres Pass, "},{"num":14,"verse":"he captured and questioned a boy from Succoth and got from him the names of 77 leaders and elders of the town."},{"num":15,"verse":"Then Gideon came to Succoth."},{"num":16,"verse":"So he took the leaders of the city, and with the desert thorns and thistles, he flailed the flesh of the men of Succoth. "},{"num":17,"verse":"He also shattered the tower of Penuel and killed the men of the town."},{"num":18,"verse":"Then Gideon approached the two kings, Zebah and Zalmunna."},{"num":20,"verse":"Gideon directed his firstborn son, Jether, to kill them, but Jether was afraid and couldn’t draw his sword since he was only a boy."},{"num":22,"verse":"Then the people of Israel spoke to Gideon."},{"num":26,"verse":"and the weight of the gold earrings was over 42 pounds of gold, which does not include the crescents, the ornaments, and the purple garments they had taken from the kings of Midian, and the collars they had taken from the necks of their camels."},{"num":27,"verse":"Gideon made it into a priestly vest, sometimes used in seeking oracles, and put it in his hometown of Ophrah. But the people of Israel made an idol of it, and it became a snare to Gideon and to his family as well."},{"num":28,"verse":"This is how Midian was subdued by the people of Israel, and Midian never lifted up its head to trouble them again. During the time of Gideon, the land had 40 years of peace. "},{"num":29,"verse":"Jerubbaal (Gideon), son of Joash, went to live in his own home. "},{"num":30,"verse":"Gideon had 70 sons who were his own children, for he had many wives and concubines, "},{"num":31,"verse":"and his concubine in Shechem bore him a son whom he named Abimelech."},{"num":32,"verse":"Gideon, son of Joash, died after many years of life and was buried with his father Joash at Ophrah in the land of the Abiezrites."},{"num":33,"verse":"As soon as Gideon died, the Israelites turned away from the Lord, and they began to prostitute themselves again to the Baals. They made Baal-berith their chief god. "},{"num":34,"verse":"The people of Israel did not remember the Eternal One, their True God, who had rescued them from the oppression of enemies on every side, "},{"num":35,"verse":"and they were not kind to the house of Jerubbaal (Gideon) despite all the good he had done for Israel."}]