[{"header":"Controversy about the Law"},{"num":15,"verse":"Then some men came down from Judea and started to teach the brothers, “Unless you are circumcised according to the Law of Moses, you can’t be saved.” "},{"num":2,"verse":"Paul and Barnabas had quite a dispute and argument with them. So Paul and Barnabas and some of the others were appointed to go up to Jerusalem to confer with the apostles and elders about this question. "},{"num":3,"verse":"They were sent on their way by the church, and as they were going through Phoenicia and Samaria they told of the conversion of the gentiles and brought great joy to all the brothers. "},{"num":4,"verse":"When they arrived in Jerusalem, they were welcomed by the church, the apostles, and the elders, and they reported everything that God had done through them. "},{"num":5,"verse":"But some believers from the party of the Pharisees stood up and said, “The gentiles must be circumcised and ordered to keep the Law of Moses.”"},{"num":6,"verse":"So the apostles and the elders met to look into this claim. "},{"num":7,"verse":"After a lengthy debate, Peter stood up and told them, “Brothers, you know that in the early days, God chose me to be the one among you through whom the gentiles would hear the message of the gospel and believe. "},{"num":8,"verse":"God, who knows everyone’s heart, showed them he approved by giving them the Holy Spirit, just as he did to us. "},{"num":9,"verse":"He made no distinction between them and us, because of their faith-cleansed hearts. "},{"num":10,"verse":"So why do you test God by putting on the disciples’ neck a yoke that neither our ancestors nor we could carry? "},{"num":11,"verse":"We certainly believe that it is through the grace of the Lord Jesus, the Messiah, that we are saved, just as they are.”"},{"num":12,"verse":"The whole crowd was silent as they listened to Barnabas and Paul tell about all the signs and wonders that God had done through them among the gentiles. "},{"num":13,"verse":"After Paul and Barnabas had finished speaking, James responded, “Brothers, listen to me: "},{"num":14,"verse":"Simeon has explained how God first showed his concern for the gentiles by taking from among them a people for his name. "},{"num":15,"verse":"This agrees with the words of the prophets. As it is written,"},{"num":19,"verse":"“Therefore, I have decided that we should not trouble these gentiles who are turning to God. "},{"num":20,"verse":"Instead, we should write to them to keep away from things polluted by idols, from sexual immorality, from anything strangled, and from blood. "},{"num":21,"verse":"After all, Moses has had people to proclaim him in every city for generations, and on every Sabbath his books are read aloud in the synagogues.”"},{"header":"The Reply of the Church"},{"num":22,"verse":"Then the apostles, the elders, and the whole church decided to choose some of their men to send with Paul and Barnabas to Antioch. These were Judas, who was called Barsabbas, and Silas, who were leaders among the brothers. "},{"num":23,"verse":"They wrote this letter for them to deliver:"},{"num":24,"verse":"We have heard that some men, coming from us without instructions from us, have said things to trouble you and have unsettled you. "},{"num":25,"verse":"So we have unanimously decided to choose men and send them to you with our dear Barnabas and Paul, "},{"num":26,"verse":"who have risked their lives for the sake of our Lord Jesus, the Messiah. "},{"num":27,"verse":"We have therefore sent Judas and Silas to tell you the same things by word of mouth. "},{"num":28,"verse":"For it seemed good to the Holy Spirit and to us not to place on you any burden but these essential requirements: "},{"num":29,"verse":"to keep away from food sacrificed to idols, from blood, from anything strangled, and from sexual immorality. If you avoid these things, you will do well. Goodbye.”"},{"num":30,"verse":"So the men were sent on their way and arrived in Antioch. They gathered the congregation together and delivered the letter. "},{"num":31,"verse":"When the people read it, they were pleased with how the letter encouraged them. "},{"num":32,"verse":"Then Judas and Silas, who were also prophets, said a lot to encourage and strengthen the brothers. "},{"num":33,"verse":"After staying there for some time, they were sent back with a greeting from the brothers to those who had sent them. "},{"num":35,"verse":"Both Paul and Barnabas remained in Antioch to teach and proclaim the word of the Lord, as did many others."},{"header":"Paul and Barnabas Disagree"},{"num":36,"verse":"A few days later, Paul told Barnabas, “Let’s go back and visit the brothers in every town where we proclaimed the word of the Lord and see how they’re doing.” "},{"num":37,"verse":"Barnabas wanted to take along John, who was called Mark, "},{"num":38,"verse":"but Paul did not think it was right to take along the man who had deserted them in Pamphylia and who had not gone with them into the work. "},{"num":39,"verse":"The disagreement was so sharp that they parted ways. Barnabas took Mark and sailed to Cyprus, "},{"num":40,"verse":"while Paul chose Silas and left after the brothers had entrusted him to the grace of the Lord. "},{"num":41,"verse":"He went through Syria and Cilicia and strengthened the churches."}]