[{"header":"Is Circumcision Necessary?"},{"num":15,"verse":"Some people came from Judaea to Antioch and, on arrival, began to teach the Christians that they could not be saved unless they were circumcised according to the custom of Moses. "},{"num":2,"verse":"This caused considerable uproar and dispute between them and Paul and Barnabas, and the church decided to send Paul and Barnabas, and some others from their fellowship, to the apostles and elders in Jerusalem, to try to sort out the problem. "},{"num":3,"verse":"So they were sent off by the church. They travelled through Phoenicia and Samaria, telling people as they went about the conversion of the Gentiles. They brought great joy to the Christian communities."},{"num":4,"verse":"When they arrived in Jerusalem they were welcomed by the church, the apostles and the elders, and they told them all the things that God had done with them. "},{"num":5,"verse":"But some believers from the party of the Pharisees stood up."},{"num":6,"verse":"The apostles and elders gathered together to see what to do about this matter. "},{"num":7,"verse":"After considerable argument, Peter got up."},{"num":8,"verse":"And God, who knows the heart, bore them witness, by giving them the holy spirit just as he did to us. "},{"num":9,"verse":"He made no distinction between us and them, but he purified their hearts through faith. "},{"num":10,"verse":"So now, why are you putting God to the test, by placing a yoke on the disciples’ neck which neither we nor our ancestors have been able to bear? "},{"num":11,"verse":"Rather, we believe that it is by the grace of the Lord Jesus that we shall be saved, just like them.’"},{"header":"The Judgment of James"},{"num":12,"verse":"The whole company was silent, and listened to Barnabas and Paul describing the signs and wonders which God had done through them among the Gentiles. "},{"num":13,"verse":"After they had finished, James replied."},{"num":14,"verse":"Symeon has explained how, at the beginning, God graciously favoured the Gentiles, to take from them a people for his own name. "},{"num":15,"verse":"This, indeed, is in accordance with the words of the prophets, which say,"},{"num":19,"verse":"‘Therefore this is my judgment: we should not cause extra difficulties for those of the Gentiles who have turned to God. "},{"num":20,"verse":"Rather, we should send them a message, warning them to keep away from things that have been polluted by idols, from fornication, from what has been strangled, and from blood. "},{"num":21,"verse":"Moses, after all, has from ancient times had people proclaiming him from city to city, since he is read in the synagogues sabbath after sabbath.’"},{"header":"The Letter to the Churches"},{"num":22,"verse":"Then the apostles and elders, with the whole assembly, decided to send people from their number, Judas Barsabbas and Silas (men well thought of by the Christian community) to Antioch with Paul and Barnabas. "},{"num":23,"verse":"They sent a letter with them, which read as follows."},{"num":24,"verse":"Since we have heard that some of our number (not, however, sent by us) have been saying things which have troubled you, causing you distress of heart, "},{"num":25,"verse":"we resolved unanimously that it would be best to send to you men whom we have chosen, together with our beloved Barnabas and Paul, "},{"num":26,"verse":"who have risked their lives for the name of the Messiah, the Lord Jesus. "},{"num":27,"verse":"So we have sent Judas and Silas, and they will tell you the same things face to face. "},{"num":28,"verse":"For it seemed good to the holy spirit and to us not to lay any burden on you beyond the following necessary things: "},{"num":29,"verse":"that you should abstain from what has been sacrificed to idols, from blood, from what has been strangled, and from fornication. If you keep yourselves from these, you will do well. Farewell.’"},{"num":30,"verse":"So they went off and came down to Antioch, where they gathered the people together and presented the letter. "},{"num":31,"verse":"When they read it, they were delighted with the message it contained. "},{"num":32,"verse":"Judas and Silas, who were themselves prophets, said a good deal to encourage the brothers and sisters, and they gave them strength. "},{"num":33,"verse":"When they had spent some time there, they left the family in peace and returned to those who had sent them. "},{"num":35,"verse":"But Paul and Barnabas stayed on in Antioch, teaching and preaching the word of the Lord, with many others as well."},{"header":"A Huge Row"},{"num":36,"verse":"After some days, Paul said to Barnabas, ‘Let’s go back and visit the brothers and sisters in all the various cities where we preached the word of the Lord, and see how they are doing.’"},{"num":37,"verse":"Barnabas wanted to take John, called Mark, along with them. "},{"num":38,"verse":"But Paul reckoned that it was not a good idea to take with them someone who had left them in Pamphylia and had not gone on with them to the rest of the work. "},{"num":39,"verse":"There was a huge row, which resulted in them splitting up. Barnabas took Mark and sailed off for Cyprus. "},{"num":40,"verse":"Paul chose Silas, and went off, having been commended by the church to the grace of the Lord. "},{"num":41,"verse":"They went through Syria and Cilicia, strengthening the churches."}]