[{"num":15,"verse":"And some men came down from Yehudah to Syrian Antioch and were teaching the Achim b’Moshiach that if you lack the bris milah as prescribed by Moshe Rabbenu, it is impossible for you to come to Yeshu’at Eloheinu."},{"num":2,"verse":"Now this brought them into a dispute and a debate of no little proportion with Rav Sha’ul and Bar-Nabba, who were appointed to go up with some others from them to bring this she’elah (question) before the Moshiach’s Shlichim and Zekenim in Yerushalayim."},{"num":3,"verse":"Then having been sent on their way by the Kehillah, they were passing through both Phoenicia and Shomron telling in detail how the Nations were turning to Hashem and they were bringing great simcha to all the Achim b’Moshiach."},{"num":4,"verse":"And having come to Yerushalayim, they were there received by Moshiach’s Kehillah and the Moshiach’s Shlichim and the Zekenim, and they reported what things Hashem had done with them."},{"num":5,"verse":"But some of the ma’aminim hameshichiyim from the kat of the Perushim rose up, saying, \"It is necessary to give the Goyim the bris milah and to command them to be shomer mitzvot, keeping the Torah of Moshe Rabbenu.\""},{"num":6,"verse":"And the Moshiach’s Shlichim and the Zekenim were gathered together as a council to consider this matter."},{"num":7,"verse":"And after much deliberation had taken place, Moshiach’s Shliach Shimon Kefa got up. Kefa said to them, \"Anashim, Achim b’Moshiach, you have da’as that in the early days Hashem chose that among you I would be the one and through my mouth the Goyim would hear the dvar Hashem of the Besuras HaGeulah and would come to emunah [in the Orthodox Jewish faith]."},{"num":8,"verse":"\"And the One who has da’as of levavot, Hashem, bore solemn edut and stood as their witness, having given the non-Jews the Ruach Hakodesh just as Hashem did also to us Jews [Acts 2:4; 10:46; 11:15-16]."},{"num":9,"verse":"\"And in making tehorot their levavot by emunah, in this respect Hashem did not differentiate between us Jews and those non-Jews."},{"num":10,"verse":"\"Therefore, now why are you testing Hashem by laying an ol (yoke) upon the neck of the talmidim which neither Avoteinu nor we were able to bear? [Dt 9:5-6; Jer 31:31-34]"},{"num":11,"verse":"\"On the contrary, Anu Ma’aminim (We believe) that we Jews come to Yeshu’at Eloheinu by the Chen v’Chesed Hashem of the Rebbe, Melech HaMoshiach Adoneinu in the same Derech Hashem as those non-Jews do also.\" [Ro 3:9,30; Ga.3:12-13; Isa 53:9-12; Pp.3:9; Dt 9:4-6; Lk 18:11-12]"},{"num":12,"verse":"And then all the multitude was silent and they were listening to Bar-Nabba and Rav Sha’ul describing what otot and moftim Hashem did among the Nations through them."},{"num":13,"verse":"And after Rav Sha’ul and Bar-Nabba fell silent, Moshiach’s Shliach Ya’akov [see p.848] responded, saying, \"Anashim, Achim b’Moshiach, listen to me."},{"num":14,"verse":"\"Shimon explained how Hashem first concerned Himself to receive from the Nations a people for SHMO [ZECHARYAH 6:12]."},{"num":15,"verse":"\"And this is in agreement with the dvarim of the Nevi’im, just as it has been written,"},{"num":16,"verse":"‘After these things I will return and AKIM ES SUKKAT DOVID HANOFELET VHARISOTAV AKIM U’VENITIHA (\"I will restore the tent of Dovid which has fallen and the things having been torn down of it I will rebuild and I will restore it\"),"},{"num":17,"verse":"“So that the she’erit (remnant) of anashim might seek Hashem and all the GOYIM who are called by my Name,"},{"num":18,"verse":"“Says the L-rd, who makes these things known from long ago. [Amos 9:11f Targum HaShivim, 12; Jer 12:15; Isa 45:21]"},{"num":19,"verse":"\"Therefore, it is my judgment not to trouble the ones from the Goyim turning in teshuva to Hashem,"},{"num":20,"verse":"\"But to write to them to keep away from the pollution of elilim and of zenut and of the thing strangled and of dahm. [Lv 3:17; 7:26; 17:10 13; 19:26; Dt 12:16,23]"},{"num":21,"verse":"\"For Moshe Rabbenu from ancient dorot in every shtetl has his maggidim and in the shuls every Shabbos he has been read.\""},{"num":22,"verse":"Then it was mekabel (received) by the Moshiach’s Shlichim and the Zekenim with the entire Kehillah to choose anashim from them to send to Syrian Antioch with Rav Sha’ul and Bar-Nabba, also Yehudah called Bar-Sabba, and Sila, all manhigim among the Achim b’Moshiach,"},{"num":23,"verse":"With the following iggeret: \"From the Achim b’Moshiach, Moshiach’s Shlichim and the Zekenim: to the Achim b’Moshiach throughout Antioch and Syria and Cilicia, to those from among the Nations, Shalom!"},{"num":24,"verse":"\"Vi-bahlt (since) we heard that certain men had gone out from us, though not having any directives from us, and have given you mitzvot with dvarim unsettling your nefashot (souls),"},{"num":25,"verse":"\"It was mekabel to us, having come to achdus in mind and having chosen anashim to send to you, along with our beloved chaverim Bar-Nabba and Sha’ul"},{"num":26,"verse":"\"Anashim who have imperiled their lives for haShem of Moshiach Adoneinu Yehoshua"},{"num":27,"verse":"\"Therefore we have sent Yehudah and Sila, and they too will confirm us in person by word of mouth."},{"num":28,"verse":"\"For it was mekabel to the Ruach Hakodesh and to us to lay no heavier burden upon you who are from the Nations except these necessary things:"},{"num":29,"verse":"\"That you non-Jewish ma’aminim hameshichiyim keep away from meat sacrificed to elilim, and dahm, and what is strangled, and zenut. If you are shomer to avoid these, you will do well. Shalom!\""},{"num":30,"verse":"Therefore, having been dismissed, they went down to Syrian Antioch, and having gathered together the multitude, they delivered the iggeret."},{"num":31,"verse":"And having read it, there was a response of simcha gedolah at the exhortation."},{"num":32,"verse":"Both Yehudah and Sila, being themselves nevi’im hameshichiyim also, with many dvarim comforted the Achim b’Moshiach and gave them chizzuk."},{"num":33,"verse":"And after they had spent considerable time, they were dismissed with shalom from the Achim b’Moshiach and sent back to the ones having dispatched them. [1Sm 1:17]"},{"num":34,"verse":"[Notwithstanding it seemed tov to Sila to remain there.]"},{"num":35,"verse":"And Rav Sha’ul and Bar-Nabba were staying in Syrian Antioch saying shiurim and drashot with also many others, the content of these being the dvar Hashem."},{"num":36,"verse":"And after some yamim Rav Sha’ul said to Bar-Nabba, \"Let’s return, then, and visit the Achim b’Moshiach throughout every city in which we proclaimed the dvar Hashem to see how they are doing.\""},{"num":37,"verse":"And Bar-Nabba was deciding to take along also Yochanan called Markos."},{"num":38,"verse":"But Rav Sha’ul was insisting not to take along this one, the one having withdrawn from them from Pamphylia, not having gone with them to the avodas kodesh ministry of the Moshiach’s Shlichus."},{"num":39,"verse":"And there was a sharp disagreement so that they were separated from one another, and Bar-Nabba took Markos and sailed away to Cyprus."},{"num":40,"verse":"And Rav Sha’ul chose Sila and departed, having been commended to the Chen v’Chesed Hashem by the Achim b’Moshiach."},{"num":41,"verse":"And they were traveling through Syria and Cilicia strengthening the Moshiach’s Kehillot."}]