[{"header":"Jesus Tells The Crowds: Do Not Act Like The Scribes And Pharisees"},{"num":23,"verse":"Then Jesus spoke to the crowds and to His disciples, "},{"num":2,"verse":"saying— “The scribes and the Pharisees sat-down on the seat of Moses. "},{"num":3,"verse":"Therefore, do and be keeping all that they tell you. But do not be acting in accordance with their works. For they say things and do not do them. "},{"num":4,"verse":"And they bind-up heavy and hard-to-bear burdens and lay them on the shoulders of people. But they are not willing to move them with their finger. "},{"num":5,"verse":"And they do all their works so-as to be seen by people. For they widen their phylacteries and lengthen their tassels. "},{"num":6,"verse":"And they love the place-of-honor at the banquets, and the seats-of-honor in the synagogues, "},{"num":7,"verse":"and the greetings in the marketplaces, and to be called ‘Rabbi’ by people. "},{"num":8,"verse":"But you— do not be called ‘Rabbi’. For One is your Teacher, and you are all brothers. "},{"num":9,"verse":"And do not call one on earth your father. For One is your Father— the heavenly One. "},{"num":10,"verse":"Nor be called master-teachers, because your master-teacher is One— the Christ. "},{"num":11,"verse":"But the greater of you shall be your servant. "},{"num":12,"verse":"And whoever will exalt himself will be humbled, and whoever will humble himself will be exalted."},{"header":"Woe To You, Scribes And Pharisees. You Are Blind Guides. How Will You Escape Hell?"},{"num":13,"verse":"“But woe to you, scribes and Pharisees, hypocrites, because you are shutting the kingdom of the heavens in-front-of  people. For you are not entering, nor are you permitting the ones entering to enter. "},{"num":14,"verse":" "},{"num":15,"verse":"Woe to you, scribes and Pharisees, hypocrites, because you go-around the sea and the dry land to make one proselyte. And when he becomes one, you make him a son of Gehenna double-more than you. "},{"num":16,"verse":"Woe to you, blind guides— the ones saying, ‘Whoever swears-an-oath by the temple, it is nothing. But whoever swears-an-oath by the gold of the temple, he is obligated’. "},{"num":17,"verse":"Foolish and blind ones! For which is greater, the gold, or the temple having sanctified the gold? "},{"num":18,"verse":"And, ‘Whoever swears-an-oath by the altar, it is nothing. But whoever swears-an-oath by the gift on it, he is obligated’. "},{"num":19,"verse":"Blind ones! For which is greater, the gift, or the altar sanctifying the gift? "},{"num":20,"verse":"Therefore, the one having sworn by the altar is swearing by it and by all the things on it. "},{"num":21,"verse":"And the one having sworn by the temple is swearing by it and by the One dwelling-in it. "},{"num":22,"verse":"And the one having sworn by heaven is swearing by the throne of God and by the One sitting on it. "},{"num":23,"verse":"Woe to you, scribes and Pharisees, hypocrites, because you are giving-a-tenth-of the mint and the dill and the cummin, and you neglected the weightier things of the Law— the justice, and the mercy, and the faithfulness. But you ought-to-have done these things, and not be neglecting those things. "},{"num":24,"verse":"Blind guides— the ones straining-out the gnat, but swallowing the camel! "},{"num":25,"verse":"Woe to you, scribes and Pharisees, hypocrites, because you cleanse the outside of the cup and the dish, but inside they are full from [your] plundering and self-indulgence. "},{"num":26,"verse":"Blind Pharisee— first cleanse the inside of the cup, in order that the outside of it may also become clean! "},{"num":27,"verse":"Woe to you, scribes and Pharisees, hypocrites, because you are similar to burial-places having been whitewashed, which outside appear beautiful, but inside are full of bones of dead ones and all impurity! "},{"num":28,"verse":"So also you outside appear righteous to people— but inside you are full of hypocrisy and lawlessness! "},{"num":29,"verse":"Woe to you, scribes and Pharisees, hypocrites, because you build the burial-places of the prophets and adorn the tombs of the righteous ones, "},{"num":30,"verse":"and say, ‘If we had been in the days of our fathers, we would not have been their partners in the blood of the prophets’. "},{"num":31,"verse":"So then, you are testifying concerning yourselves that you are sons of the ones having murdered the prophets. "},{"num":32,"verse":"And you— fill-up the measure of your fathers! "},{"num":33,"verse":"Snakes, brood of vipers, how may you escape from the condemnation of  Gehenna?"},{"header":"God Will Avenge The Blood of All The Righteous On You. Your House Is Left Desolate"},{"num":34,"verse":"“For this reason behold, I am sending-forth prophets and wise ones and scribes to you— some of them you will kill and crucify, and some of them you will whip in your synagogues and persecute from city to city— "},{"num":35,"verse":"so that all the righteous blood being shed on the earth may come upon you: from the blood of Abel the righteous one, up to the blood of Zechariah, son of Berechiah, whom you murdered between the temple and the altar. "},{"num":36,"verse":"Truly I say to you, all these things will come upon this generation. "},{"num":37,"verse":"Jerusalem, Jerusalem, the one killing the prophets and stoning the ones having been sent-forth to her. How often I wanted to gather together your children the way a hen gathers together her chicks under her wings, and you did not want it. "},{"num":38,"verse":"Behold— your house is being left to you desolate. "},{"num":39,"verse":"For I say to you, you will by no means see Me from now on until you say, ‘Blessed is the One coming in the name of the Lord’”."}]