[{"header":"Jesus Criticizes the Religious Leaders(A)"},{"num":23,"verse":"Then Jesus spoke to the people and to his followers. He said,"},{"num":2,"verse":"“The teachers of the law and the Pharisees have the authority to tell you what the Law of Moses says."},{"num":3,"verse":"So you should obey them. Do everything they tell you to do. But their lives are not good examples for you to follow. They tell you to do things, but they don’t do those things themselves."},{"num":4,"verse":"They make strict rules that are hard for people to obey. They try to force others to obey all their rules. But they themselves will not try to follow any of those rules."},{"num":5,"verse":"“The only reason they do what they do is for other people to see them. They make the little Scripture boxes they wear bigger and bigger. And they make the tassels on their prayer clothes long enough for people to notice them."},{"num":6,"verse":"These men love to have the places of honor at banquets and the most important seats in the synagogues."},{"num":7,"verse":"They love for people to show respect to them in the marketplaces and to call them ‘Teacher.’"},{"num":8,"verse":"“But you must not be called ‘Teacher.’ You are all equal as brothers and sisters. You have only one Teacher."},{"num":9,"verse":"And don’t call anyone on earth ‘Father.’ You have one Father. He is in heaven."},{"num":10,"verse":"And you should not be called ‘Master.’ You have only one Master, the Messiah."},{"num":11,"verse":"Whoever serves you like a servant is the greatest among you."},{"num":12,"verse":"People who think they are better than others will be made humble. But people who humble themselves will be made great."},{"num":13,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites! You close the way for people to enter God’s kingdom. You yourselves don’t enter, and you stop those who are trying to enter."},{"num":14,"verse":""},{"num":15,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites. You travel across the seas and across different countries to find one person who will follow your ways. When you find that person, you make him worse than you are. And you are so bad that you belong in hell!"},{"num":16,"verse":"“It will be bad for you teachers of the law and you Pharisees! You guide the people, but you are blind. You say, ‘If anyone uses the name of the Temple to make a promise, that means nothing. But anyone who uses the gold that is in the Temple to make a promise must keep that promise.’"},{"num":17,"verse":"You are blind fools! Can’t you see that the Temple is greater than the gold on it? It’s the Temple that makes the gold holy!"},{"num":18,"verse":"“And you say, ‘If anyone uses the altar to make a promise, that means nothing. But anyone who uses the gift on the altar to make a promise must keep that promise.’"},{"num":19,"verse":"You are blind! Can’t you see that the altar is greater than any gift on it? It’s the altar that makes the gift holy!"},{"num":20,"verse":"Whoever uses the altar to make a promise is really using the altar and everything on the altar."},{"num":21,"verse":"And anyone who uses the Temple to make a promise is really using the Temple and God, who lives in it."},{"num":22,"verse":"Whoever uses heaven to make a promise is using God’s throne and the one who is seated on it."},{"num":23,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites! You give God a tenth of the food you get, even your mint, dill, and cumin. But you don’t obey the really important teachings of the law—being fair, showing mercy, and being faithful. These are the things you should do. And you should also continue to do those other things."},{"num":24,"verse":"You guide the people, but you are blind! Think about a man picking a little fly out of his drink and then swallowing a camel! You are like that."},{"num":25,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites! You wash clean the outside of your cups and dishes. But inside they are full of what you got by cheating others and pleasing yourselves."},{"num":26,"verse":"Pharisees, you are blind! First make the inside of the cup clean and good. Then the outside of the cup will also be clean."},{"num":27,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites! You are like tombs that are painted white. Outside they look fine, but inside they are full of dead people’s bones and all kinds of filth."},{"num":28,"verse":"It is the same with you. People look at you and think you are godly. But on the inside you are full of hypocrisy and evil."},{"num":29,"verse":"“It will be bad for you teachers of the law and you Pharisees! You are hypocrites! You build tombs for the prophets. And you show honor to the graves of the godly people who were killed."},{"num":30,"verse":"And you say, ‘If we had lived during the time of our ancestors, we would not have helped them kill these prophets.’"},{"num":31,"verse":"So you give proof that you are descendants of those who killed the prophets."},{"num":32,"verse":"And you will finish the sin that your ancestors started!"},{"num":33,"verse":"“You are snakes! You are from a family of poisonous snakes! You will not escape God. You will all be judged guilty and go to hell!"},{"num":34,"verse":"So I tell you this: I send to you prophets and teachers who are wise and know the Scriptures. You will kill some of them. You will hang some of them on crosses. You will beat some of them in your synagogues. You will chase them from town to town."},{"num":35,"verse":"“So you will be guilty for the death of all the good people who have been killed on earth. You will be guilty for the killing of that godly man Abel. And you will be guilty for the killing of Zechariah son of Berachiah. He was killed between the Temple and the altar. You will be guilty for the killing of all the good people who lived between the time of Abel and the time of Zechariah."},{"num":36,"verse":"Believe me when I say that all these things will happen to you people who are living now."},{"header":"Jesus Warns the People of Jerusalem(B)"},{"num":37,"verse":"“O Jerusalem, Jerusalem! You kill the prophets. You stone to death those that God has sent to you. Many, many times I wanted to help your people. I wanted to gather them together as a hen gathers her chicks under her wings. But you did not let me."},{"num":38,"verse":"Now your house will be left completely empty."},{"num":39,"verse":"I tell you, you will not see me again until that time when you will say, ‘Welcome! God bless the one who comes in the name of the Lord.’”"}]