[{"num":23,"verse":"Then tote · ho Jesus Iēsous spoke laleō to  the ho crowds ochlos and kai to ho his autos disciples mathētēs, "},{"num":2,"verse":"saying legō, “ The ho scribes grammateus and kai the ho Pharisees Pharisaios now  sit kathizō on epi the ho chair kathedra of  Moses Mōysēs. "},{"num":3,"verse":"Therefore oun put  into  practice poieō and kai continue  to  do tēreō whatever hosos ean they  tell legō you hymeis;  but de do poieō not mē imitate poieō what kata they autos · ho do ergon,  for gar they  teach legō but kai do  not ou practice poieō. "},{"num":4,"verse":"For de they  tie desmeuō up  heavy barys burdens phortion,  · kai hard  to  bear dysbastaktos,  and kai lay epitithēmi them  on epi · ho people’ s anthrōpos shoulders ōmos,  · ho but de they thelō themselves autos are thelō not ou willing thelō to  move kineō them autos with ho their autos finger daktylos. "},{"num":5,"verse":"They  do poieō all pas · de · ho their autos deeds ergon to pros · ho be  seen theaomai by ho others anthrōpos:  they  make platynō · ho their autos phylacteries phylaktērion broad  and kai their ho tassels kraspedon long megalynō, "},{"num":6,"verse":"they  love phileō · de the ho place prōtoklisia of  honor  at en · ho banquets deipnon and kai the ho most  important  seats prōtokathedria in en the ho synagogues synagōgē, "},{"num":7,"verse":"and kai · ho greetings aspasmos in en the ho marketplaces agora,  and kai to  be  called kaleō ‘ Rabbi rhabbi’  by hypo · ho others anthrōpos. "},{"num":8,"verse":"But de you hymeis are  not mē to  be  called kaleō ‘ Rabbi rhabbi,’  for gar you hymeis have eimi but  one heis · ho teacher didaskalos,  and de you hymeis are eimi all pas brothers adelphos. "},{"num":9,"verse":"And kai do  not mē call kaleō anyone  on epi earth gē your hymeis ‘ father patēr,’  · ho for gar you hymeis have eimi but  one heis · ho Father patēr, and  he ho is in  heaven ouranios. "},{"num":10,"verse":"Nor mēde should  you  be  called kaleō ‘ instructors kathēgētēs,’  because hoti Christ Christos is eimi your hymeis only heis instructor kathēgētēs.  · ho"},{"num":11,"verse":"The ho · de greatest megas among  you hymeis will  be eimi your hymeis servant diakonos. "},{"num":12,"verse":"And de whoever hostis will  exalt hypsoō himself heautou will  be  humbled tapeinoō,  and kai whoever hostis will  humble tapeinoō himself heautou will  be  exalted hypsoō. "},{"num":13,"verse":"“ But de woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  shut kleiō the ho kingdom basileia of ho heaven ouranos in  men’ s anthrōpos faces emprosthen.  · ho For gar you hymeis neither ou enter eiserchomai yourselves  nor oude allow aphiēmi those ho who  would  enter eiserchomai to  go eiserchomai in . "},{"num":15,"verse":"“ Woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  travel periagō over  · ho sea thalassa and kai · ho land xēros to  gain poieō a  single heis convert prosēlytos;  and kai when hotan he  becomes ginomai one,  you  make poieō him autos twice  as  much diplous a  son hyios of  hell geenna as diplous yourselves hymeis. "},{"num":16,"verse":"“ Woe ouai to  you hymeis,  blind typhlos guides hodēgos who ho say legō, ‘ If  someone hos an swears omnyō by en the ho temple naos it  means eimi nothing oudeis;  but de if  someone hos swears omnyō by en the ho gold chrysos of  the ho temple naos,  he  is  bound opheilō by his oath.’ "},{"num":17,"verse":"You  fools mōros and kai blind typhlos men !  For gar which tis is eimi greater megas,  the ho gold chrysos or ē the ho temple naos that ho makes  the ho gold chrysos sacred hagiazō? "},{"num":18,"verse":"And kai you say, ‘ If  someone hos an swears omnyō by en the ho altar thusiastērion it  means eimi nothing oudeis;  but de if  someone hos swears omnyō by en the ho gift dōron that ho is  on epanō it autos,  he  is  bound opheilō by his oath.’ "},{"num":19,"verse":"How  blind typhlos you  are!  For gar which tis is  greater megas,  the ho gift dōron or ē the ho altar thusiastērion that ho makes  the ho gift dōron sacred hagiazō? "},{"num":20,"verse":"So oun the ho one  who  swears omnyō by en the ho altar thusiastērion,  swears omnyō not only  by en it autos but kai by en everything pas · ho on epanō it autos. "},{"num":21,"verse":"And kai the ho one  who  swears omnyō by en the ho temple naos,  swears omnyō not only  by en it autos but kai by en the ho one  who  dwells katoikeō there autos. "},{"num":22,"verse":"And kai the ho one  who  swears omnyō by en · ho heaven ouranos,  swears omnyō not only  by en the ho throne thronos of ho God theos but kai by en the ho one  who  sits kathēmai on epanō it autos. "},{"num":23,"verse":"“ Woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  tithe apodekatoō · ho mint hēdyosmon and kai · ho dill anēthon and kai · ho cumin kyminon,  and kai have  neglected aphiēmi the ho weightier barys matters  of  the ho law nomos:  · ho justice krisis and kai · ho mercy eleos and kai · ho faithfulness pistis.  These houtos · de you  ought dei to  have  done poieō without mē neglecting aphiēmi the  former kakeinos. "},{"num":24,"verse":"You  blind typhlos guides hodēgos!  · ho You  strain diylizō out  the ho gnat kōnōps but de gulp  down katapinō the ho camel kamēlos! "},{"num":25,"verse":"“ Woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  clean katharizō off  the ho outside exōthen of  the ho cup potērion and kai the ho plate paropsis while de inside esōthen they  are  full gemō of ek greed harpagē and kai self-indulgence akrasia. "},{"num":26,"verse":"You  blind typhlos Pharisee Pharisaios!  First prōton clean katharizō the ho inside entos of  the ho cup potērion,  so hina that  its autos outside ektos may  become ginomai clean katharos too kai.  · ho"},{"num":27,"verse":"“ Woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  are  like paromoiazō whitewashed koniaō tombs taphos that hostis look phainō beautiful hōraios on  the  outside exōthen but de on  the  inside esōthen are  full gemō of  dead  men’ s nekros bones osteon and kai all pas kinds  of  filth akatharsia. "},{"num":28,"verse":"So houtōs you hymeis also kai outwardly exōthen appear phainō to ho others anthrōpos as  righteous dikaios but de within esōthen you  are eimi full mestos of  hypocrisy hypokrisis and kai lawlessness anomia. "},{"num":29,"verse":"“ Woe ouai to  you hymeis,  scribes grammateus and kai Pharisees Pharisaios,  hypocrites hypokritēs,  because hoti you  build oikodomeō the ho tombs taphos of  the ho prophets prophētēs and kai decorate kosmeō the ho graves mnēmeion of  the ho righteous dikaios, "},{"num":30,"verse":"and kai you  say legō, ‘ If ei we  had  lived eimi in en the ho days hēmera of ho our hēmeis fathers patēr,  we  would an not ou have eimi taken  part  with koinōnos them autos in en shedding  the ho blood haima of  the ho prophets prophētēs.’ "},{"num":31,"verse":"By hōste saying  this  you  testify martyreō against  yourselves heautou that hoti you  are eimi descendants hyios of  those ho who  murdered phoneuō the ho prophets prophētēs. "},{"num":32,"verse":"Fill plēroō up  then kai the ho measure metron of ho your hymeis fathers’ patēr guilt. "},{"num":33,"verse":"You  snakes ophis!  You  brood gennēma of  vipers echidna!  How pōs will  you  escape pheugō from apo · ho being  condemned krisis to  · ho hell geenna? "},{"num":34,"verse":"Therefore dia houtos I egō am  sending apostellō you hymeis prophets prophētēs and kai wise sophos men  and kai scribes grammateus,  some  of ek whom autos you  will  kill apokteinō and kai crucify stauroō,  and kai some ek of  whom autos you  will  flog mastigoō in en · ho your hymeis synagogues synagōgē and kai pursue diōkō from apo town polis to eis town polis, "},{"num":35,"verse":"so hopōs that  upon epi you hymeis will  come erchomai all pas the  righteous dikaios blood haima shed ekchunnomai on epi · ho earth gē,  from apo the ho blood haima of  righteous dikaios Abel Habel · ho to heōs the ho blood haima of  Zechariah Zacharias son hyios of  Barachiah Barachias,  whom hos you  murdered phoneuō between metaxy the ho sanctuary naos and kai the ho altar thusiastērion. "},{"num":36,"verse":"I  tell legō you hymeis the  truth amēn,  all pas these  things houtos will  come hēkō upon epi · ho this houtos generation genea. "},{"num":37,"verse":"“ Jerusalem Ierousalēm,  O  Jerusalem Ierousalēm,  you  who ho kill apokteinō the ho prophets prophētēs and kai stone lithoboleō those ho who  are  sent apostellō to pros you autos!  How posakis often  have  I  wanted thelō to  gather episynagō · ho your sy children teknon together  as hos tropos a  hen ornis gathers episynagō · ho her autos chicks nossion under hypo her ho wings pteryx,  but kai you  were  not ou willing thelō! "},{"num":38,"verse":"Look idou,  your hymeis house oikos is  left aphiēmi to  you hymeis · ho desolate erēmos! "},{"num":39,"verse":"For gar I  say legō to  you hymeis, you will  not ou mē see  me egō from apo now arti until heōs an you  say legō, ‘ Blessed eulogeō is  he ho who  comes erchomai in en the  name onoma of  the  Lord kyrios.’” "}]