[{"header":"He publicly warns the people against their religious leaders"},{"num":1,"verse":"Then Jesus addressed the crowds and his disciples. “The scribes and the Pharisees speak with the authority of Moses,” he told them, “so you must do what they tell you and follow their instructions. But you must not imitate their lives! For they preach but do not practise. They pile up back-breaking burdens and lay them on other men’s shoulders—yet they themselves will not raise a finger to move them. Their whole lives are planned with an eye to effect. They increase the size of their phylacteries and lengthen the tassels of their robes; they love seats of honour at dinner parties and front places in the synagogues. They love to be greeted with respect in public places and to have men call them ‘rabbi!’ Don’t you ever be called ‘rabbi’—you have only one teacher, and all of you are brothers. And don’t call any human being ‘father’—for you have one Father and he is in Heaven. And you must not let people call you ‘leaders’—you have only one leader, Christ! The only ‘superior’ among you is the one who serves the others. For every man who promotes himself will be humbled, and every man who learns to be humble will find promotion."},{"num":13,"verse":"“But alas for you, you scribes and Pharisees, play-actors that you are! You lock the door of the kingdom of Heaven in men’s faces; you will not go in yourselves neither will you allow those at the door to go inside."},{"num":15,"verse":"“Alas for you, you scribes and Pharisees, play-actors! You scour sea and land to make a single convert, and then you make him twice as ripe for destruction as you are yourselves."},{"num":16,"verse":"“Alas for you, you blind leaders! You say, ‘if anyone swears by the Temple it amounts to nothing, but if he swears by the gold of the Temple he is bound by his oath.’ You blind fools, which is the more important, the gold or the Temple which sanctifies the gold? And you say, ‘If anyone swears by the altar it doesn’t matter, but if he swears by the gift placed on the altar he is bound by his oath.’ Have you no eyes—which is more important, the gift, or the altar which sanctifies the gift? Any man who swears by the altar is swearing by the altar and whatever is offered upon it; and anyone who swears by the Temple is swearing by the Temple and by him who dwells in it; and anyone who swears by Heaven is swearing by the throne of God and by the one who sits upon that throne."},{"num":23,"verse":"“Alas for you, scribes and Pharisees, you utter frauds! For you pay your tithe on mint and aniseed and cummin, and neglect the things which carry far more weight in the Law—justice, mercy and good faith. These are the things you should have observed—without neglecting the others. You call yourselves leaders, and yet you can’t see an inch before your noses, for you filter out the mosquito and swallow the camel."},{"num":25,"verse":"“What miserable frauds you are, you scribes and Pharisees! You clean the outside of the cup and the dish, while the inside is full of greed and self-indulgence. Can’t you see, Pharisee? First wash the inside of a cup, and then you can clean the outside."},{"num":27,"verse":"“Alas for you, you hypocritical scribes and Pharisees! You are like white-washed tombs, which look fine on the outside but inside are full of dead men’s bones and all kinds of rottenness. For you appear like good men on the outside—but inside you are a mass of pretence and wickedness."},{"num":29,"verse":"“What miserable frauds you are, you scribes and Pharisees! You build tombs for the prophets, and decorate monuments for good men of the past, and then say, ‘If we had lived in the times of our ancestors we should never have joined in the killing of the prophets.’ Yes, ‘your ancestors’—that shows you to be sons indeed of those who murdered the prophets. Go ahead then, and finish off what your ancestors tried to do! You serpents, you viper’s brood, how do you think you are going to avoid being condemned to the rubbish-heap? Listen to this: I am sending you prophets and wise and learned men; and some of these you will kill and crucify, others you will flog in your synagogues and hunt from town to town. So that on your hands is all the innocent blood spilt on this earth, from the blood of Abel the good to the blood of Zachariah, Barachiah’s son, whom you murdered between the sanctuary and the altar. Yes, I tell you that all this will be laid at the doors of this generation."},{"header":"Jesus mourns over Jerusalem, and foretells its destruction"},{"num":37,"verse":"“Oh, Jerusalem, Jerusalem! You murder the prophets and stone the messengers that are sent to you. How often have I longed to gather your children round me like a bird gathering her brood together under her wing—and you would never have it. Now all you have left is your house. I tell you that you will never see me again till the day when you cry, ‘Blessed is he who comes in the name of the Lord!’”"}]