[{"num":17,"verse":"Better to eat a dry crust of bread with peace of mind than have a banquet in a house full of trouble."},{"num":2,"verse":"A shrewd servant will gain authority over a master's worthless son and receive a part of the inheritance."},{"num":3,"verse":"Gold and silver are tested by fire, and a person's heart is tested by the Lord."},{"num":4,"verse":"Evil people listen to evil ideas, and liars listen to lies."},{"num":5,"verse":"If you make fun of poor people, you insult the God who made them. You will be punished if you take pleasure in someone's misfortune."},{"num":6,"verse":"Grandparents are proud of their grandchildren, just as children are proud of their parents."},{"num":7,"verse":"Respected people do not tell lies, and fools have nothing worthwhile to say."},{"num":8,"verse":"Some people think a bribe works like magic; they believe it can do anything."},{"num":9,"verse":"If you want people to like you, forgive them when they wrong you. Remembering wrongs can break up a friendship."},{"num":10,"verse":"An intelligent person learns more from one rebuke than a fool learns from being beaten a hundred times."},{"num":11,"verse":"Death will come like a cruel messenger to wicked people who are always stirring up trouble."},{"num":12,"verse":"It is better to meet a mother bear robbed of her cubs than to meet some fool busy with a stupid project."},{"num":13,"verse":"If you repay good with evil, you will never get evil out of your house."},{"num":14,"verse":"The start of an argument is like the first break in a dam; stop it before it goes any further."},{"num":15,"verse":"Condemning the innocent or letting the wicked go—both are hateful to the Lord."},{"num":16,"verse":"It does a fool no good to spend money on an education, because he has no common sense."},{"num":17,"verse":"Friends always show their love. What are relatives for if not to share trouble?"},{"num":18,"verse":"Only someone with no sense would promise to be responsible for someone else's debts."},{"num":19,"verse":"To like sin is to like making trouble. If you brag all the time, you are asking for trouble."},{"num":20,"verse":"Anyone who thinks and speaks evil can expect to find nothing good—only disaster."},{"num":21,"verse":"There is nothing but sadness and sorrow for parents whose children do foolish things."},{"num":22,"verse":"Being cheerful keeps you healthy. It is slow death to be gloomy all the time."},{"num":23,"verse":"Corrupt judges accept secret bribes, and then justice is not done."},{"num":24,"verse":"An intelligent person aims at wise action, but a fool starts off in many directions."},{"num":25,"verse":"Foolish children bring grief to their fathers and bitter regrets to their mothers."},{"num":26,"verse":"It is not right to make an innocent person pay a fine; justice is perverted when good people are punished."},{"num":27,"verse":"Those who are sure of themselves do not talk all the time. People who stay calm have real insight. "},{"num":28,"verse":"After all, even fools may be thought wise and intelligent if they stay quiet and keep their mouths shut."}]