[{"num":1,"verse":"Better is a dry morsel, if peace be with it, than an house full of sacrifices with strife."},{"num":2,"verse":"A discrete servant shall have rule over a lewd son, and he shall divide the heritage among the brethren."},{"num":3,"verse":"As is the fining pot for silver, and the furnace for gold, so the Lord trieth the hearts."},{"num":4,"verse":"The wicked giveth heed to false lips, and a liar hearkeneth to the naughty tongue."},{"num":5,"verse":"He that mocketh the poor, reproacheth him that made him: and he that rejoiceth at destruction, shall not be unpunished."},{"num":6,"verse":"Children’s children are the crown of the elders: and the glory of the children are their fathers."},{"num":7,"verse":"High talk becometh not a fool, much less a lying talk a prince."},{"num":8,"verse":"A reward is as a stone pleasant in the eyes of them that have it: it prospereth, whithersoever it turneth."},{"num":9,"verse":"He that covereth a transgression, seeketh love: but he that repeateth a matter, separateth the prince."},{"num":10,"verse":"A reproof entereth more into him that hath understanding, than an hundred stripes into a fool."},{"num":11,"verse":"A seditious person seeketh only evil, and a cruel messenger shall be sent against him."},{"num":12,"verse":"It is better for a man to meet a bear robbed of her whelps, than a fool in his folly."},{"num":13,"verse":"He that rewardeth evil for good, evil shall not depart from his house."},{"num":14,"verse":"The beginning of strife is as one that openeth the waters: therefore, or the contention be meddled with, leave off."},{"num":15,"verse":"He that justifieth the wicked, and he that condemneth the just, even they both are abomination to the Lord."},{"num":16,"verse":"Wherefore is there a price in the hand of the fool to get wisdom, and he hath none heart?"},{"num":17,"verse":"A friend loveth at all times; and a brother is born for adversity."},{"num":18,"verse":"A man destitute of understanding, toucheth the hand, and becometh surety for his neighbor."},{"num":19,"verse":"He loveth transgression that loveth strife: and he that exalteth his gate, seeketh destruction."},{"num":20,"verse":"The froward heart findeth no good: and he that hath a naughty tongue, shall fall into evil."},{"num":21,"verse":"He that begetteth a fool, getteth himself sorrow, and the father of a fool can have no joy."},{"num":22,"verse":"A joyful heart causeth good health: but a sorrowful mind drieth the bones."},{"num":23,"verse":"A wicked man taketh a gift out of the bosom to wrest the ways of judgment."},{"num":24,"verse":"Wisdom is in the face of him that hath understanding: but the eyes of a fool are in the corners of the world."},{"num":25,"verse":"A foolish son is a grief unto his father, and a heaviness to her that bare him."},{"num":26,"verse":"Surely it is not good to condemn the just, nor that the princes should smite such for equity."},{"num":27,"verse":"He that hath knowledge, spareth his words, and a man of understanding is of an excellent spirit."},{"num":28,"verse":"Even a fool, (when he holdeth his peace) is counted wise, and he that stoppeth his lips, prudent."}]