[{"num":17,"verse":"A dry piece of food with peace and quiet is better than a house full of food with fighting."},{"num":2,"verse":"A servant who is wise in what he does will rule over a son who acts in shame. He will share in what is given as one of the brothers."},{"num":3,"verse":"The melting-pot is for silver and the hot fire is for gold, but the Lord tests hearts."},{"num":4,"verse":"A wrong-doer listens to sinful lips. A liar listens to a tongue that destroys."},{"num":5,"verse":"He who laughs at the poor brings shame to his Maker. He who is glad at trouble will be punished."},{"num":6,"verse":"Grandchildren are the pride and joy of old men and a son is proud of his father."},{"num":7,"verse":"Fine speaking is not right for a fool. Even worse are lying lips to a ruler."},{"num":8,"verse":"Being paid in secret for wrong-doing is like a stone of much worth to the one who has it. Wherever he turns, he does well."},{"num":9,"verse":"He who covers a sin looks for love. He who tells of trouble separates good friends."},{"num":10,"verse":"A man of understanding learns more from being told the right thing to do than a fool learns from being beaten a hundred times."},{"num":11,"verse":"A man who will not obey looks only for what is bad. So one who has no loving-pity will be sent against him."},{"num":12,"verse":"A man meeting a bear robbed of her little ones is better than meeting a fool in his foolish way."},{"num":13,"verse":"If a man returns bad for good, trouble will not leave his house."},{"num":14,"verse":"The beginning of trouble is like letting out water. So stop arguing before fighting breaks out."},{"num":15,"verse":"He who says that the sinful are right, and he who says those who do right are wrong, both are hated by the Lord."},{"num":16,"verse":"It does a fool no good to try to buy wisdom, when he has no understanding."},{"num":17,"verse":"A friend loves at all times. A brother is born to share troubles."},{"num":18,"verse":"A man without good thinking makes promises, and becomes a trust for what another man owes his neighbor."},{"num":19,"verse":"He who loves sin loves making trouble. He who opens his door wide for trouble is looking for a way to be destroyed."},{"num":20,"verse":"He who has a sinful heart finds no good. He who has a sinful tongue falls into sin."},{"num":21,"verse":"A foolish son is a sorrow to his father, and the father of a fool has no joy."},{"num":22,"verse":"A glad heart is good medicine, but a broken spirit dries up the bones."},{"num":23,"verse":"A sinful man receives pay in secret to change the right way into wrong-doing."},{"num":24,"verse":"Wisdom is with the one who has understanding, but the eyes of a fool are on the ends of the earth."},{"num":25,"verse":"A foolish son is a sorrow to his father, and trouble to her who gave birth to him."},{"num":26,"verse":"It is not good to punish those who are right with God, and it is wrong to beat men of honor for being faithful."},{"num":27,"verse":"He who is careful in what he says has much learning, and he who has a quiet spirit is a man of understanding."},{"num":28,"verse":"Even a fool, when he keeps quiet, is thought to be wise. When he closes his lips, he is thought of as a man of understanding."}]