[{"header":"No Greater Love—in Good Fruit"},{"num":15,"verse":"“I am the true vine, and my Father is the gardener. "},{"num":2,"verse":"Every branch in me that does not bear fruit, he is going to cut off. And he prunes every branch that does bear fruit, so that it will bear more fruit."},{"num":3,"verse":"“You are already clean because of the word I have spoken to you. "},{"num":4,"verse":"Remain in me, and I am going to remain in you. A branch cannot bear fruit by itself; it must remain in the vine. Likewise, you cannot bear fruit unless you remain in me."},{"num":5,"verse":"“I am the Vine; you are the branches. The one who remains in me and I in him is the one who bears much fruit, because without me you can do nothing. "},{"num":6,"verse":"If anyone does not remain in me, he is thrown away like a branch and withers. Such branches are gathered, thrown into the fire, and burned. "},{"num":7,"verse":"If you remain in me and my words remain in you, ask whatever you wish, and it will be done for you. "},{"num":8,"verse":"My Father is glorified by this: that you continue to bear much fruit and prove to be my disciples."},{"num":9,"verse":"“As the Father has loved me, so also I have loved you. Remain in my love. "},{"num":10,"verse":"If you hold on to my commands, you will remain in my love, just as I have held on to my Father’s commands and remain in his love. "},{"num":11,"verse":"I have told you these things so that my joy would continue to be in you and that your joy would be complete."},{"num":12,"verse":"“This is my command: Love one another as I have loved you. "},{"num":13,"verse":"No one has greater love than this: that someone lays down his life for his friends. "},{"num":14,"verse":"You are my friends if you continue to do the things I instruct you. "},{"num":15,"verse":"I no longer call you servants, because a servant does not know what his master is doing. But I have called you friends, because everything that I heard from my Father, I have made known to you. "},{"num":16,"verse":"You did not choose me, but I chose you and appointed you to go and bear fruit, fruit that will endure, so that the Father will give you whatever you ask in my name. "},{"num":17,"verse":"These things I am instructing you, so that you love one another."},{"num":18,"verse":"“If the world hates you, you know that it hated me first. "},{"num":19,"verse":"If you were of the world, the world would love its own. However, because you are not of the world, but I have chosen you out of it, for that very reason the world hates you. "},{"num":20,"verse":"Remember the saying I told you: ‘A servant is not greater than his master.’ If they persecuted me, they will persecute you too. If they held on to my word, they will hold on to yours as well. "},{"num":21,"verse":"But they will do all these things to you on account of my name, because they do not know the one who sent me. "},{"num":22,"verse":"If I had not come and spoken to them, they would have no sin. But now they have no excuse for their sin. "},{"num":23,"verse":"The one who hates me also hates my Father. "},{"num":24,"verse":"If I had not done the works among them that no one else did, they would not be guilty of sin. But now they have seen and hated both me and my Father. "},{"num":25,"verse":"This was to fulfill the word which is written in their Law: ‘They hated me for no reason.’"},{"num":26,"verse":"“When the Counselor comes, whom I will send to you from the Father—the Spirit of truth, who proceeds from the Father—he will testify about me. "},{"num":27,"verse":"And you also are going to testify, because you have been with me from the beginning.”"}]