[{"num":15,"verse":"“ I egō am eimi the ho true alēthinos vine ampelos,  · ho and kai · ho my egō Father patēr is eimi the ho vine-grower geōrgos. "},{"num":2,"verse":"Every pas branch klēma in en me egō that  bears pherō no mē fruit karpos he  cuts airō off ,  but kai every pas branch that  does  bear pherō · ho fruit karpos he  prunes kathairō,  so hina that  it  may  bear pherō more polys fruit karpos. "},{"num":3,"verse":"By  this  time ēdē you hymeis are eimi clean katharos because dia of  the ho message logos that hos I  have  spoken laleō to  you hymeis. "},{"num":4,"verse":"Abide menō in en me egō and  I kagō will abide  in en you hymeis.  Just kathōs as  the ho branch klēma is  not ou able dynamai to  bear pherō fruit karpos by apo itself heautou,  unless ean mē it  abides menō in en the ho vine ampelos,  so houtōs neither oude can  you hymeis unless ean mē you  abide menō in en me egō. "},{"num":5,"verse":"I egō am eimi the ho vine ampelos;  you hymeis are  the ho branches klēma.  The ho one  who  abides menō in en me egō and kagō I  in en him autos bears pherō much polys fruit karpos,  for hoti apart chōris from  me egō you  can dynamai do poieō nothing oudeis. "},{"num":6,"verse":"If ean anyone tis does  not mē abide menō in en me egō, he is  like hōs a  branch klēma that  is  thrown ballō away exō · ho and kai withers xērainō;  · kai men  gather synagō them autos and kai throw ballō them  into eis the ho fire pyr,  and kai they  are  burned kaiō. "},{"num":7,"verse":"If ean you  abide menō in en me egō and kai · ho my egō words rhēma abide menō in en you hymeis,  ask aiteō whatever hos ean you  wish thelō and kai it  will  be  done ginomai for  you hymeis. "},{"num":8,"verse":"My egō Father patēr is  glorified doxazō in en this houtos,  · ho that hina you  bear pherō much polys fruit karpos and kai become ginomai my emos disciples mathētēs. "},{"num":9,"verse":"As kathōs the ho Father patēr has  loved agapaō me egō,  I  have agapaō also kagō loved agapaō you hymeis;  abide menō in en · ho my emos love agapē.  · ho"},{"num":10,"verse":"If ean you  keep tēreō · ho my egō commandments entolē,  you  will  abide menō in en · ho my egō love agapē,  just kathōs as  I egō have  kept tēreō · ho my egō Father’ s patēr commandments entolē · ho and kai abide menō in en his autos · ho love agapē. "},{"num":11,"verse":"These houtos things  I  have  spoken laleō to  you hymeis,  that hina · ho my emos joy chara · ho may  be eimi in en you hymeis and kai that  · ho your hymeis joy chara may  be  complete plēroō. "},{"num":12,"verse":"“ This houtos is eimi · ho my emos commandment entolē:  · ho Love agapaō one allēlōn another ,  as kathōs I  have  loved agapaō you hymeis. "},{"num":13,"verse":"Greater megas love agapē has echō no  one oudeis than  this houtos,  that hina a  person tis lays  down tithēmi · ho his autos life psychē for hyper · ho his autos friends philos. "},{"num":14,"verse":"You hymeis are eimi my egō friends philos if ean you  do poieō the  things hos I egō command entellō you hymeis. "},{"num":15,"verse":"No ouketi longer  do  I  call legō you hymeis servants,  for hoti a ho servant  does  not ou know oida what tis his autos master kyrios is  doing poieō;  · ho but de I  have  called legō you hymeis friends philos,  because hoti all pas that hos I  have  heard akouō from para · ho my egō Father patēr I  have  made  known gnōrizō to  you hymeis. "},{"num":16,"verse":"You hymeis did eklegomai not ou choose eklegomai me egō,  but alla I egō chose eklegomai you hymeis and kai appointed tithēmi you hymeis that hina you hymeis should  go hypagō and kai bear pherō fruit karpos and kai that  · ho your hymeis fruit karpos should  remain menō,  so hina that  the ho Father patēr may  give didōmi you hymeis whatever hos tis you  ask aiteō in en · ho my egō name onoma. "},{"num":17,"verse":"These houtos things  I  command entellō you hymeis,  so hina that  you  may  love agapaō one allēlōn another . "},{"num":18,"verse":"“ If ei the ho world kosmos hates miseō you hymeis,  be  aware ginōskō that hoti it  has  hated miseō me egō before prōton it hated  you hymeis. "},{"num":19,"verse":"If ei you  belonged eimi to ek the ho world kosmos,  the ho world kosmos would an love  you phileō as  · ho its idios own ;  but de because hoti you  do eimi not ou belong eimi to ek the ho world kosmos,  but alla I egō chose eklegomai you hymeis out ek of  the ho world kosmos,  for dia this houtos reason  the ho world kosmos hates miseō you hymeis. "},{"num":20,"verse":"Remember mnēmoneuō the ho saying logos that hos I egō told legō you hymeis, ‘The servant  is eimi not ou greater megas than ho his autos master kyrios.’  If ei they  have  persecuted diōkō me egō,  they  will diōkō also kai persecute diōkō you hymeis;  if ei they  have  kept tēreō · ho my egō word logos,  they  will  keep tēreō yours hymeteros as kai well .  · ho"},{"num":21,"verse":"But alla all pas these houtos things  they  will  do poieō to eis you hymeis on dia account  of  · ho my egō name onoma,  because hoti they  do  not ou know oida the ho one  who  sent pempō me egō. "},{"num":22,"verse":"If ei I  had  not mē come erchomai and kai spoken laleō to  them autos,  they  would echō not ou be  guilty  of echō sin hamartia;  but de now nyn they  have echō no ou excuse prophasis for peri · ho their autos sin hamartia. "},{"num":23,"verse":"The ho one  who  hates miseō me egō hates miseō my egō Father patēr also kai.  · ho"},{"num":24,"verse":"If ei I  had poieō not mē done poieō among en them autos the ho works ergon that hos no oudeis one  else allos had  done poieō,  they  would echō not ou be  guilty  of echō sin hamartia;  but de now nyn · kai they  have  seen horaō the works  and kai have  hated miseō both kai me egō and kai · ho my egō Father patēr. "},{"num":25,"verse":"However alla,  the ho word logos that ho is  written graphō in en their autos law nomos had  to  be  fulfilled plēroō:  · ho ‘ They  hated miseō me egō without dōrean a  cause .’ "},{"num":26,"verse":"“But  when hotan the ho Paraclete paraklētos comes erchomai,  whom hos I egō will  send pempō to  you hymeis from para the ho Father patēr,  the ho Spirit pneuma of ho truth alētheia who hos comes  forth ekporeuomai from para the ho Father patēr,  he ekeinos will  bear  witness martyreō about peri me egō. "},{"num":27,"verse":"And de you hymeis also kai are  to  bear  witness martyreō because hoti you  have  been eimi with meta me egō from apo the  beginning archē. "}]