[{"num":15,"verse":"I am HaGefen HaAmittit (the true vine)[TEHILLIM 80:8-20; YESHAYAH 5:1-7; YECHEZKEL 19:10] and HaAv of me is the Korem (vineyard proprietor)."},{"num":2,"verse":"Every sarig (shoot, branch) in me not bearing p’ri [TEHILLIM 92:14] He takes it away, and every sarig bearing p’ri He prunes that it may bear much p’ri."},{"num":3,"verse":"You are already metoharim (clean) because of the dvar which I have spoken to you."},{"num":4,"verse":"Remain in me and I in you. As the sarig is not able to bear p’ri from itself, unless it remains on the gefen (vine), so neither are you, unless you remain in me."},{"num":5,"verse":"Ani Hu (I am) HaGefen; you are the sarigim (branches). The one remaining in me and I in him, this one bears much p’ri, because apart from me you are not able to do anything."},{"num":6,"verse":"Unless someone remains in me, he is cast out as the sarig and is dried up and they gather them, and into the Eish they throw them, and they are burned. [YECHEZKEL 15:1-8; 19:10]"},{"num":7,"verse":"If you remain in me and the dvarim of me remain in you, whatever you want, ask, and it will be done for you!"},{"num":8,"verse":"By this HaAv of me was given kavod, that much p’ri you bear, and so be my talmidim."},{"num":9,"verse":"As HaAv has ahavah for me, so I have ahavah for you. Remain in my ahavah [see Yd verse 21]."},{"num":10,"verse":"If you are shomer of my mitzvot, you will remain in my ahavah, as I of the mitzvot of HaAv of me have been shomer, and I remain in His ahavah."},{"num":11,"verse":"These things I have spoken to you that the simcha of me may be in you and the simcha of you may be made shleimah."},{"num":12,"verse":"This is my mitzvah for you, that you have ahavah (agape) one for the other, as I have ahavah (agape) for you."},{"num":13,"verse":"Ahavah (agape) gedolah than this no one has, that someone lay down his neshamah for his chaverim [BERESHIS 44:33]."},{"num":14,"verse":"You are my chaverim, if you are shomer oner my mitzvot. [IYOV 16:20; MISHLE 18:24]"},{"num":15,"verse":"No longer do I call you avadim, because the eved does not have da’as of what his Adon is doing. But you I have called chaverim, because all things which I heard from HaAv of me, of all these things I gave you da’as. [SHEMOT 33:11]"},{"num":16,"verse":"It was not that you chose me, but I chose you, and have given you s’michah that you go and bear p’ri and the p’ri of you remain, that whatever you ask HaAv b’Shem of me (Rebbe, Melech HaMoshiach), HaAv may give it to you."},{"num":17,"verse":"I am giving you these mitzvot, that you have ahavah (agape) one for the other."},{"num":18,"verse":"If the Olam Hazeh has sin’as chinom (hatred without cause) for you, [YESHAYAH 66:5] be aware it has had sin’as chinom for me before you."},{"num":19,"verse":"If you were of the Olam Hazeh, the Olam Hazeh would have had ahavah for its own. But because from the Olam Hazeh you are not, but I chose you out of the Olam Hazeh, therefore the Olam Hazeh has sin’as chinom for you [1Yn 4:5; Yn 17:14]."},{"num":20,"verse":"Put in zikaron (remembrance) the dvar which I told you, An eved is not gadol (greater) than his Adon. If they brought redifah (persecution) on me, they will also bring redifah on you. If over my dvar they were shomer, also over yours they will be shomer."},{"num":21,"verse":"But all these things they will do to you on account of the Shem of me [YESHAYAH 66:5], because they do not have da’as of the One having sent me."},{"num":22,"verse":"If I did not come and speak to them, [YECHEZKEL 2:5] they would not have chet; but now they have no ptur (excuse) for their chet."},{"num":23,"verse":"The one having sin’as chinom (hatred without cause) for me (Rebbe, Melech HaMoshiach) has sin’as chinom for HaAv of me."},{"num":24,"verse":"If I did not do pe’ulot among them which no other man did, they would not have chet; but now they have beheld and they have had sin’as chinom for both me and HaAv of me."},{"num":25,"verse":"But this was that the dvar having been written in their Torah might be fulfilled, SONE’AI CHINOM ATZMU (They are many hating me without cause). [TEHILLIM 69:4 5; 35:19; 109:3]"},{"num":26,"verse":"But when the Melitz Yosher (Praklit, Advocate, Counselor, Helper in Court) comes, whom I will send to you from HaAv, the Ruach Hakodesh, the Ruach HaEmes, who proceeds from HaAv, that one will gives solemn edut (testimony) about me."},{"num":27,"verse":"And you [Shlichim] will give solemn edut (testimony) also, because from the beginning you are with me."}]