[{"header":"The Seventh Year(A)"},{"num":15,"verse":"“At the end of every seventh year you are to cancel the debts of those who owe you money. "},{"num":2,"verse":"This is how it is to be done. Each of you who has lent money to any Israelite is to cancel the debt; you must not try to collect the money; the Lord himself has declared the debt canceled. "},{"num":3,"verse":"You may collect what a foreigner owes you, but you must not collect what any of your own people owe you."},{"num":4,"verse":"“The Lord your God will bless you in the land that he is giving you. Not one of your people will be poor "},{"num":5,"verse":"if you obey him and carefully observe everything that I command you today. "},{"num":6,"verse":"The Lord will bless you, as he has promised. You will lend money to many nations, but you will not have to borrow from any; you will have control over many nations, but no nation will have control over you."},{"num":7,"verse":"“If in any of the towns in the land that the Lord your God is giving you there are Israelites in need, then do not be selfish and refuse to help them. "},{"num":8,"verse":"Instead, be generous and lend them as much as they need. "},{"num":9,"verse":"Do not refuse to lend them something, just because the year when debts are canceled is near. Do not let such an evil thought enter your mind. If you refuse to make the loan, they will cry out to the Lord against you, and you will be held guilty. "},{"num":10,"verse":"Give to them freely and unselfishly, and the Lord will bless you in everything you do. "},{"num":11,"verse":"There will always be some Israelites who are poor and in need, and so I command you to be generous to them."},{"header":"The Treatment of Slaves(D)"},{"num":12,"verse":"“If any Israelites, male or female, sell themselves to you as slaves, you are to release them after they have served you for six years. When the seventh year comes, you must let them go free. "},{"num":13,"verse":"When you set them free, do not send them away empty-handed. "},{"num":14,"verse":"Give to them generously from what the Lord has blessed you with—sheep, grain, and wine. "},{"num":15,"verse":"Remember that you were slaves in Egypt and the Lord your God set you free; that is why I am now giving you this command."},{"num":16,"verse":"“But your slave may not want to leave; he may love you and your family and be content to stay. "},{"num":17,"verse":"Then take him to the door of your house and there pierce his ear; he will then be your slave for life. Treat your female slave in the same way. "},{"num":18,"verse":"Do not be resentful when you set slaves free; after all, they have served you for six years at half the cost of hired servants. Do this, and the Lord your God will bless you in all that you do."},{"header":"The First-Born Cattle and Sheep"},{"num":19,"verse":"“Set aside for the Lord your God all the first-born males of your cattle and sheep; don't use any of these cattle for work and don't shear any of these sheep. "},{"num":20,"verse":"Each year you and your family are to eat them in the Lord's presence at the one place of worship. "},{"num":21,"verse":"But if there is anything wrong with the animals, if they are crippled or blind or have any other serious defect, you must not sacrifice them to the Lord your God. "},{"num":22,"verse":"You may eat such animals at home. All of you, whether ritually clean or unclean, may eat them, just as you eat deer or antelope. "},{"num":23,"verse":"But do not use their blood for food; instead, you must pour it out on the ground like water."}]