[{"header":"The Special Seventh Year"},{"num":15,"verse":"At the end of every seven years, you must forget about collecting what people owe you. "},{"num":2,"verse":"This is how you must do it: Everyone who has loaned money must forget the loan. He must not make his neighbor or brother pay it back. This is the Lord’s time for canceling what people owe. "},{"num":3,"verse":"You may make a foreigner pay what he owes you. But you must not collect what your brother owes you. "},{"num":4,"verse":"But there should be no poor people among you. The Lord your God will richly bless you in the land he is giving you to own. "},{"num":5,"verse":"He will bless you if you obey him completely. But you must be careful to obey all the commands I am giving you today. "},{"num":6,"verse":"The Lord your God will bless you as he promised. You will lend to other nations. But you will not need to borrow from them. You will rule over many nations. But none will rule over you."},{"num":7,"verse":"There might be a poor man among you. He might be in one of the towns of the land the Lord your God is giving you. Do not be selfish or greedy toward your poor brother. "},{"num":8,"verse":"But give freely to him. Freely lend him whatever he needs. "},{"num":9,"verse":"Beware of evil thoughts. Don’t think, “The seventh year is near. It’s the year to forget what people owe.” You might be mean to your needy brother. You might not give him anything. Then he will complain to the Lord about you. And the Lord will find you guilty of sin. "},{"num":10,"verse":"Give freely to the poor person. Do not wish that you didn’t have to give. The Lord your God will bless your work and everything you touch. "},{"num":11,"verse":"There will always be poor people in the land. So I command you to give freely to your brothers. Give freely to the poor and needy in your land."},{"header":"Letting Slaves Go Free"},{"num":12,"verse":"One of your own people might sell himself to you as a slave. It may be a Hebrew man or woman. That person will serve you for six years. The seventh year you must let him go free. "},{"num":13,"verse":"And when you let him go, don’t send him away without anything. "},{"num":14,"verse":"Give him some of your sheep, your grain and your wine. Give to him as the Lord has given to you. "},{"num":15,"verse":"Remember that you were slaves in Egypt. And the Lord your God saved you. That is why I am commanding this to you today."},{"num":16,"verse":"But your slave might say to you, “I don’t want to leave you.” He might love you and your family. He might have a good life with you. "},{"num":17,"verse":"If he does this, stick an awl through his ear into the door. He will be your slave for life. Also do this to a woman slave."},{"num":18,"verse":"Do not think of it as a hard thing when you let your slave go free. After all, he served you six years. You paid him only half what a hired person would cost. The Lord your God will bless you in everything you do."},{"header":"Rules About Firstborn Animals"},{"num":19,"verse":"Save all the first male animals born to your herds and flocks. They are for the Lord your God. Do not work the first calf born to your oxen. And do not cut off the wool from the first lamb born to your sheep. "},{"num":20,"verse":"Each year you and your family are to eat these animals. Eat them in the presence of the Lord your God. Eat them in the place he will choose to be worshiped. "},{"num":21,"verse":"An animal might have something wrong with it. It might be crippled or blind. It might have some other thing wrong with it. Do not sacrifice it to the Lord your God. "},{"num":22,"verse":"But you may eat that animal in your own town. Both clean and unclean people may eat it. It would be like eating a gazelle or a deer. "},{"num":23,"verse":"But don’t eat its blood. Pour it out on the ground like water."}]