[[],[],[{"type":"prose","content":" spoke to Moses: “Tell Aaron and his sons to treat the holy offerings that the Israelites consecrate to me with reverence so they won’t desecrate my holy name. I am ."}],[{"type":"prose","content":"“Tell them, From now on, if any of your descendants approaches in a state of ritual uncleanness the holy offerings that the Israelites consecrate to , he will be cut off from my presence. I am ."}],[{"type":"prose","content":"“Each and every one of Aaron’s descendants who has an infectious skin disease or a discharge may not eat any of the holy offerings until he is clean. Also, if he touches anything defiled by a corpse, or has an emission of semen, or is contaminated by touching a crawling creature, or touches a person who is contaminated for whatever reason—a person who touches any such thing will be ritually unclean until evening and may not eat any of the holy offerings unless he has washed well with water. After the sun goes down he is clean and may go ahead and eat the holy offerings; they are his food. But he must not contaminate himself by eating anything found dead or torn by wild animals. I am ."}],[{"type":"prose","content":"“The priests must observe my instructions lest they become guilty and die by treating the offerings with irreverence. I am  who makes them holy."}],[{"type":"prose","content":"“No layperson may eat anything set apart as holy. Nor may a priest’s guest or his hired hand eat anything holy. But if a priest buys a slave, the slave may eat of it; also the slaves born in his house may eat his food. If a priest’s daughter marries a layperson, she may no longer eat from the holy contributions. But if the priest’s daughter is widowed or divorced and without children and returns to her father’s household as before, she may eat of her father’s food. But no layperson may eat of it."}],[{"type":"prose","content":"“If anyone eats from a holy offering accidentally, he must give back the holy offering to the priest and add twenty percent to it."}],[{"type":"prose","content":"“The priests must not treat with irreverence the holy offerings of the Israelites that they contribute to  lest they desecrate themselves and make themselves guilty when they eat the holy offerings. I am  who makes them holy.”* * *"}],[{"type":"prose","content":" spoke to Moses: “Tell Aaron and his sons and all the People of Israel, Each and every one of you, whether native born or foreigner, who presents a Whole-Burnt-Offering to  to fulfill a vow or as a Freewill-Offering, must make sure that it is a male without defect from cattle, sheep, or goats for it to be acceptable. Don’t try slipping in some creature that has a defect—it won’t be accepted. Whenever anyone brings an offering from cattle or sheep as a Peace-Offering to  to fulfill a vow or as a Freewill-Offering, it has to be perfect, without defect, to be acceptable. Don’t try giving  an animal that is blind, crippled, mutilated, an animal with running sores, a rash, or mange. Don’t place any of these on the Altar as a gift to . You may, though, offer an ox or sheep that is deformed or stunted as a Freewill-Offering, but it is not acceptable in fulfilling a vow. Don’t offer to  an animal with bruised, crushed, torn, or cut-off testicles. Don’t do this in your own land but don’t accept them from foreigners and present them as food for your  either. Because of deformities and defects they will not be acceptable.”"}],[{"type":"prose","content":" spoke to Moses: “When a calf or lamb or goat is born, it is to stay with its mother for seven days. After the eighth day, it is acceptable as an offering, a gift to . Don’t slaughter both a cow or ewe and its young on the same day. When you sacrifice a Thanksgiving-Offering to , do it right so it will be acceptable. Eat it on the same day; don’t leave any leftovers until morning. I am ."}],[{"type":"prose","content":"“Do what I tell you;  what I tell you. I am ."}],[{"type":"prose","content":"“Don’t desecrate my holy name. I insist on being treated with holy reverence among the People of Israel. I am  who makes you holy and brought you out of Egypt to be your God. I am .”"}]]