[{"header":"Eating the Priests’ Share of the Sacrifice"},{"num":22,"verse":"Yahweh spoke to Moses, "},{"num":2,"verse":"“Tell Aaron and his sons that they must respect the holy offerings which the Israelites set apart for me. In this way they will not dishonor my holy name. I am Yahweh."},{"num":3,"verse":"“Tell them: In future generations if any of your descendants, while unclean, comes near the holy offerings the Israelites set apart for Yahweh, that person must be excluded from my presence. I am Yahweh."},{"num":4,"verse":"“No descendant of Aaron who has a skin disease or a discharge may eat any of the holy offerings until he is clean. Any person who has an emission of semen or touches a dead body, "},{"num":5,"verse":"an unclean swarming creature or an unclean person "},{"num":6,"verse":"will be unclean until evening. He must not eat any of the holy offerings unless he has washed himself. "},{"num":7,"verse":"When the sun has set, he will be clean. Then he may eat the holy offerings because they are his food. "},{"num":8,"verse":"He must never eat the meat of an animal that dies naturally or is killed by wild animals. It will make him unclean. I am Yahweh. "},{"num":9,"verse":"The priests must do what I order, or their sin will bring them death because they dishonored a holy offering. I am Yahweh, who sets them apart as holy."},{"num":10,"verse":"“Laypeople must never eat any holy offering, even if they are visiting a priest or are working for him. "},{"num":11,"verse":"But if a priest buys a slave, the slave and anyone born in his household may eat the priest’s food. "},{"num":12,"verse":"However, if a priest’s daughter marries a layman, she must never eat the food taken from the holy contributions. "},{"num":13,"verse":"If a priest’s daughter is widowed or divorced, doesn’t have any children, and comes back to live in her father’s home, she may eat her father’s food. But a layperson must never eat it."},{"num":14,"verse":"“Those who eat a holy offering by mistake must give another holy offering to the priest and add one-fifth more to it. "},{"num":15,"verse":"Priests must not dishonor the holy offerings that the Israelites contribute to Yahweh. "},{"num":16,"verse":"They must make those people pay the penalty for their guilt because they have eaten the priests’ holy offerings. I am Yahweh, who sets them apart as holy.”"},{"header":"Animals Accepted for Sacrifice"},{"num":17,"verse":"Yahweh spoke to Moses, "},{"num":18,"verse":"“Tell Aaron, his sons, and all the Israelites: Israelites or foreigners may bring burnt offerings to Yahweh for anything they vowed or as freewill offerings. "},{"num":19,"verse":"The offering must be a male that has no defects from your cattle, sheep, or goats in order to be accepted. "},{"num":20,"verse":"Never bring any animal with a physical defect, because it will not be accepted on your behalf. "},{"num":21,"verse":"A person may bring Yahweh a fellowship offering to fulfill a vow or for a freewill offering. Whether it is from the cattle, sheep, or goats, it must be an animal that has no defects in order to be accepted. It must never be an animal that has defects. "},{"num":22,"verse":"Never bring Yahweh an animal that is blind, has broken bones, cuts, warts, scabs, or ringworm. Never give Yahweh any of these in a sacrifice by fire on the altar. "},{"num":23,"verse":"You may use a bull or a sheep with a deformity or one that is stunted in growth as a freewill offering. However, it will not be accepted for a vow. "},{"num":24,"verse":"Never bring Yahweh an animal that has bruised, crushed, torn out, or cut out testicles. Never do any of these things to an animal in your land. "},{"num":25,"verse":"Never bring any kind of castrated animal received from a foreigner as a food offering for your Elohim. A castrated animal will not be accepted on your behalf because castration is a physical defect.”"},{"num":26,"verse":"Yahweh spoke to Moses, "},{"num":27,"verse":"“When a calf, a lamb, or a goat is born, it must stay with its mother for seven days. From the eighth day on it may be accepted as a sacrifice by fire to Yahweh. "},{"num":28,"verse":"Never slaughter a cow or a sheep and its young the same day."},{"num":29,"verse":"“When you sacrifice a thank offering to Yahweh, do it in the proper way. "},{"num":30,"verse":"Eat it the same day. Never leave any of it until morning. I am Yahweh."},{"num":31,"verse":"“Carefully obey my commands. I am Yahweh. "},{"num":32,"verse":"Never dishonor my holy name. I will show my holiness among the Israelites. I am Yahweh, who sets you apart as holy. "},{"num":33,"verse":"I brought you out of Egypt to be your Elohim. I am Yahweh.”"}]