[[],[{"type":"header","content":"Thankfulness for Spiritual Attainments"},{"type":"prose","content":"Paul, an apostle (special messenger, personally chosen representative) of Christ Jesus (the Messiah, the Anointed) by the will of God, and Timothy our brother,"}],[{"type":"prose","content":"To the saints and faithful believers in Christ [who are] at Colossae: Grace to you and peace [inner calm and spiritual well-being] from God our Father."}],[{"type":"prose","content":"We give thanks to God, the Father of our Lord Jesus Christ, as we pray always for you, "}],[{"type":"prose","content":"for we have heard of your faith in Christ Jesus [how you lean on Him with absolute confidence in His power, wisdom, and goodness], and of the [unselfish] love which you have for all the saints (God’s people); "}],[{"type":"prose","content":"because of the [confident] hope [of experiencing that] which is reserved  waiting for you in heaven. You previously heard of this  in the message of truth, the gospel [regarding salvation] "}],[{"type":"prose","content":"which has come to you. Indeed, just as in the whole world  is constantly bearing fruit and spreading [by God’s power], just as  among you ever since the day you first heard  and understood the grace of God in truth [becoming thoroughly and deeply acquainted with it]. "}],[{"type":"prose","content":"You learned it from [our representative] Epaphras, our beloved fellow bond-servant, who is a faithful minister of Christ on our behalf "}],[{"type":"prose","content":"and he also has told us of your love [well-grounded and nurtured] in the [Holy] Spirit."}],[{"type":"prose","content":"For this reason, since the day we heard about it, we have not stopped praying for you, asking [specifically] that you may be filled with the knowledge of His will in all spiritual wisdom [with insight into His purposes], and in understanding [of spiritual things], "}],[{"type":"prose","content":"so that you will walk in a manner worthy of the Lord [displaying admirable character, moral courage, and personal integrity], to [fully] please  in all things, bearing fruit in every good work and steadily growing in the knowledge of God [with deeper faith, clearer insight and fervent love for His precepts]; "}],[{"type":"prose","content":"[we pray that you may be] strengthened  invigorated with all power, according to His glorious might, to attain every kind of endurance and patience with joy; "}],[{"type":"prose","content":"giving thanks to the Father, who has qualified us to share in the inheritance of the saints (God’s people) in the Light."},{"type":"header","content":"The Incomparable Christ"}],[{"type":"prose","content":"For He has rescued us  has drawn us to Himself from the dominion of darkness, and has transferred us to the kingdom of His beloved Son, "}],[{"type":"prose","content":"in whom we have redemption [because of His sacrifice, resulting in] the forgiveness of our sins [and the cancellation of sins’ penalty]."}],[{"type":"prose","content":"He is the exact living image [the essential manifestation] of the unseen God [the visible representation of the invisible], the firstborn [the preeminent one, the sovereign, and the originator] of all creation. "}],[{"type":"prose","content":"For by Him all things were created in heaven and on earth, [things] visible and invisible, whether thrones or dominions or rulers or authorities; all things were created  exist through Him [that is, by His activity] and for Him. "}],[{"type":"prose","content":"And He Himself existed  is before all things, and in Him all things hold together. [His is the controlling, cohesive force of the universe.] "}],[{"type":"prose","content":"He is also the head [the life-source and leader] of the body, the church; and He is the beginning, the firstborn from the dead, so that He Himself will occupy the first place [He will stand supreme and be preeminent] in everything. "}],[{"type":"prose","content":"For it pleased the  for all the fullness [of deity—the sum total of His essence, all His perfection, powers, and attributes] to dwell [permanently] in Him (the Son), "}],[{"type":"prose","content":"and through [the intervention of] the Son to reconcile all things to Himself, making peace [with believers] through the blood of His cross; through Him, [I say,] whether things on earth or things in heaven."}],[{"type":"prose","content":"And although you were at one time estranged  alienated and hostile-minded [toward Him],  in evil things, "}],[{"type":"prose","content":"yet Christ has now reconciled you [to God] in His physical body through death, in order to present you before the Father holy and blameless and beyond reproach— "}],[{"type":"prose","content":"[and He will do this] if you continue in the faith, well-grounded and steadfast, and not shifting away from the [confident] hope [that is a result] of the gospel that you have heard, which was proclaimed in all creation under heaven, and of which [gospel] I, Paul, was made a minister."}],[{"type":"prose","content":"Now I rejoice in my sufferings on your behalf. And with my own body I supplement whatever is lacking [on our part] of Christ’s afflictions, on behalf of His body, which is the church. "}],[{"type":"prose","content":"In  I was made a minister according to the stewardship which God entrusted to me for your sake, so that I might make the word of God fully known [among you]— "}],[{"type":"prose","content":", the mystery which was hidden [from angels and mankind] for ages and generations, but has now been revealed to His saints (God’s people). "}],[{"type":"prose","content":"God [in His eternal plan] chose to make known to them how great for the Gentiles are the riches of the glory of this mystery, which is Christ in  among you, the hope  guarantee of [realizing the] glory. "}],[{"type":"prose","content":"We proclaim Him, warning and instructing everyone in all wisdom [that is, with comprehensive insight into the word and purposes of God], so that we may present every person complete in Christ [mature, fully trained, and perfect in Him—the Anointed]. "}],[{"type":"prose","content":"For this I labor [often to the point of exhaustion], striving with His power  energy, which so greatly works within me."}]]