[{"header":"Greeting"},{"num":1,"verse":"Paul, an apostle of Christ Jesus by the will of God, and Timothy our brother,"},{"num":2,"verse":"To the holy and faithful brothers in Christ at Colossae:"},{"header":"Paul’s Prayer for the Colossians"},{"num":3,"verse":"We always thank God, the Father of our Lord Jesus Christ, when we pray for you, "},{"num":4,"verse":"because we have heard of your faith in Christ Jesus and the love that you have for all the saints "},{"num":5,"verse":"because of the hope that is stored up for you in heaven. You have already heard about this in the word of truth, the gospel "},{"num":6,"verse":"that is present with you now. The gospel is bearing fruit and growing in the entire world, just as it also has been doing among you from the day you heard it and came to know the grace of God in truth. "},{"num":7,"verse":"You learned this from Epaphras, our dear fellow servant, who is a faithful minister of Christ on your behalf. "},{"num":8,"verse":"He is the one who told us about your love in the Spirit."},{"num":9,"verse":"For this reason, from the day we heard about your love, we also have not stopped praying for you. We keep asking that you would be filled with the knowledge of his will in all wisdom and spiritual understanding, "},{"num":10,"verse":"so that you might live in a way that is worthy of the Lord. Our goal is that you please him by bearing fruit in every kind of good work and by growing in the knowledge of God, "},{"num":11,"verse":"as you are being strengthened with all power because of his glorious might working in you. Then you will have complete endurance and patience, joyfully "},{"num":12,"verse":"giving thanks to the Father, who qualified us to share in the inheritance of the saints in the kingdom of light."},{"header":"What the Father Did Through Christ"},{"num":13,"verse":"The Father rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves, "},{"num":14,"verse":"in whom we have redemption, the forgiveness of sins."},{"num":15,"verse":"He is the image of the invisible God, the firstborn over all creation, "},{"num":16,"verse":"for in him all things were created, in heaven and on earth, things seen and unseen, whether thrones or dominions or rulers or authorities; all things have been created through him and for him. "},{"num":17,"verse":"He is before all things, and all things hold together in him."},{"num":18,"verse":"He is also the head of the body, the church. He is the beginning, the firstborn from the dead, so that in all things he might have the highest rank. "},{"num":19,"verse":"For God was pleased to have all his fullness dwell in him, "},{"num":20,"verse":"and through him to reconcile all things to himself (whether things on earth or in heaven) by making peace through the blood of his cross."},{"header":"Reconciled Through Christ’s Death"},{"num":21,"verse":"At one time, you were alienated from God and hostile in your thinking as expressed through your evil deeds. "},{"num":22,"verse":"But now Christ reconciled you in his body of flesh through death, in order to present you holy, blameless, and faultless before him— "},{"num":23,"verse":"if you continue steadfast and firm in faith, without being moved away from the hope of the gospel. This is the gospel that you heard, which has been proclaimed in all creation under heaven, and of which I, Paul, have become a minister."},{"header":"Paul’s Service in Preaching the Gospel"},{"num":24,"verse":"Now I rejoice in my sufferings on your behalf, and in my flesh I am filling up what is lacking in the afflictions of Christ on behalf of his body, which is the church. "},{"num":25,"verse":"I became a minister of the church for your benefit when God gave me the task of fully proclaiming the word of God, "},{"num":26,"verse":"namely, the mystery that was hidden for past ages and generations, but now has been revealed to his saints. "},{"num":27,"verse":"God wanted to make known to them what is the wealth of the glory of this mystery among the Gentiles—this mystery, which is Christ in you, the hope of glory."},{"num":28,"verse":"We proclaim him as we admonish and teach everyone with all wisdom, so that we might present everyone perfect in Christ. "},{"num":29,"verse":"This is the goal I am laboring to reach, striving with his strength, which is powerfully at work in me."}]