[{"num":1,"verse":"Sha’ul a Shliach of Rebbe, Melech HaMoshiach Yehoshua through the ratzon Hashem [1:9] and Timotiyos the Ach b’Moshiach;"},{"num":2,"verse":"To the Kadoshim in Colossae, the Achim b’Moshiach, the Achim HaNe’emanim. Chen v’Chesed Hashem to you and shalom from Elohim Avinu."},{"num":3,"verse":"Hodinu l’Hashem (we give thanks to Hashem) Elohim HaAv of Adoneinu Rebbe, Melech HaMoshiach Yehoshua, davening always concerning you,"},{"num":4,"verse":"Having heard of your emunah in Rebbe, Melech HaMoshiach Yehoshua and the ahavah which you have for all the Kadoshim"},{"num":5,"verse":"On account of the tikvah (hope) being laid up for you in Shomayim, the tikvah which you heard of before in the Dvar HaEmes, the Besuras HaGeulah"},{"num":6,"verse":"That has come to you, as also in all the Olam Hazeh it is bearing p’ri and growing, so also in you, from the day you heard it and began to have saving da’as of the Chen v’Chesed Hashem in actuality."},{"num":7,"verse":"This you learned from Epaphras, [4:12] our chaver and fellow eved, who is ne’eman (faithful), who is a trusted keli kodesh (minister) of Rebbe, Melech HaMoshiach for you."},{"num":8,"verse":"Epaphras also revealed to us your ahavah in the Ruach Hakodesh."},{"num":9,"verse":"Therefore, we also, from the day that we heard, do not cease davening for you and offering tefillos that you be filled with da’as of the ratzon Hashem [1:1] in all chochmah and binah in the Ruach Hakodesh."},{"num":10,"verse":"And this is the purpose: that you walk in hitnahagut (conduct) worthy of Adoneinu in every way pleasing to him in every mitzvoh bearing p’ri in the da’as of Hashem,"},{"num":11,"verse":"With all ko’ach being empowered according to the gevurah (power) of his kavod for all zitzfleisch (patience) and savlanut (longsuffering) with lev same’ach (glad heart),"},{"num":12,"verse":"Giving todot to Elohim HaAv. Elohim HaAv is the One who has qualified you for the share of the allotted nachalah (inheritance, TEHILLIM 16:5-6) of the Kadoshim in Ohr (Light);"},{"num":13,"verse":"Elohim HaAv is the One who rescued nafsheinu (our souls) from the memshalet (dominion) of Choshech and transferred us into the Malchut of the Ben HaElohim of His ahavah,"},{"num":14,"verse":"In whom we have the pedut (redemption, Geulah release on payment of ransom) through the [kapporah] dahm of Moshiach the selicha (forgiveness) of chatoteinu (our sins)."},{"num":15,"verse":"Rebbe, Melech HaMoshiach is the demut (BERESHIS 1:26-27; Pp 2:6) of the invisible G-d, the Bechor [TEHILLIM 89:27], the Yoresh (Heir) of kol hanivrah (all creation),"},{"num":16,"verse":"Because in Him were created all things in Shomayim and on Ha’Aretz, the visible and the nistar (hidden), whether thrones or dominions, whether rulers or authorities, all things through Him and for Him have been created. [TEHILLIM 33:6]"},{"num":17,"verse":"And Moshiach is before all things, and all things in Moshiach have been held together; [MISHLE 8:23-27; 30:4]"},{"num":18,"verse":"And Moshiach is the Rosh [MISHLE 8:22; 30:4] of the Geviyah (Body) [Gn 47:18; Ps 16:9-10; Isa 53:11; Job 19:25-27], and the Geviyah (nevilah, DEVARIM 21:23) is Moshiach’s Brit Chadasha Kehillah; Moshiach is its Reshit, the Bechor from the Mesim, that Moshiach might be in everything pre-eminent, [TEHILLIM 89:27]"},{"num":19,"verse":"Because Hashem was pleased that all His fullness have its mishkan (tabernacle) in Moshiach,"},{"num":20,"verse":"And through Moshiach to bring ritztzuy (reconciliation, cessation of enmity, hostility between a wrathful holy G-d and sinful Bnei Adam) between all things and Himself, having made shalom through the dahm of the kapporah of HaEtz HaMoshiach [Dt 21:23; Isa 52:15; Lv 16:15-16], whether the things on HaAretz or the things in HaShomayim."},{"num":21,"verse":"And you, once having been alienated and oyvim (enemies) in the mind by ma’asim hara’im (evil deeds),"},{"num":22,"verse":"Yet now Moshiach reconciled in the Guf (body) [1:18] of his basar [TEHILLIM 16:9-10] through Moshiach’s histalkus [Dan 9:26; Isa 53:8-9] to present you, Kadoshim holy and without mum (defect, VAYIKRA 22:20) and without reproach before Him,"},{"num":23,"verse":"Provided you remain in the [correct Orthodox Jewish] Emunah [Faith, the Emunah of the true Dat HaYehudit], having been founded in it and securely established and not moving away from the tikvah (hope) of the Besuras HaGeulah which you heard, the Besuras HaGeulah which has been proclaimed in kol hanivrah (all creation) under Shomayim, the Besuras HaGeulah of which I, Rav Sha’ul, became a keli kodesh (minister)."},{"num":24,"verse":"Now with lev same’ach (glad heart) and chedvah (rejoicing) I rejoice in my suffering tzoros on behalf of you. And I am mashlim (supply what is deficient) the things lacking of the Chevlei Moshiach in my basar on behalf of the basar of Moshiach [1:18] which is the Brit Chadasha Kehillah,"},{"num":25,"verse":"Of which I became a keli kodesh [1:23] according to the pekudat Hashem (stewardship of G-d, His shlichus commission) which was given to me for you, to carry to shleimut (wholeness, completion) the Dvar Hashem"},{"num":26,"verse":"The raz (mystery) having been hidden from olamim and from dor v’dor, but now made manifest to the Kadoshim of Moshiach,"},{"num":27,"verse":"To whom Hashem wanted to make hisgalus of what is the spiritual osher of the kavod of this raz among the non-Jews: Moshiach in you, the tikvah of kavod."},{"num":28,"verse":"It is Moshiach who is the subject of our hattafah (preaching), warning every man and teaching every man in all chochmah, that we may present every man Bnei Chayil mature in Moshiach."},{"num":29,"verse":"For this also I toil, striving according to the hitlahavut (inspiration, enthusiasm) of Him working in me with gevurah."}]