[[],[{"type":"header","content":"The Tongue Is a Fire"},{"type":"prose","content":"Not many [of you] should become teachers [serving in an official teaching capacity], my brothers and sisters, for you know that we [who are teachers] will be judged by a higher standard [because we have assumed greater accountability and more condemnation if we teach incorrectly]. "}],[{"type":"prose","content":"For we all stumble  sin in many . If anyone does not stumble in what he says [never saying the wrong thing], he is a perfect man [fully developed in character, without serious flaws], able to bridle his whole body  rein in his entire nature [taming his human faults and weaknesses]. "}],[{"type":"prose","content":"Now if we put bits into the horses’ mouths to make them obey us, we guide their whole body as well. "}],[{"type":"prose","content":"And look at the ships. Even though they are so large and are driven by strong winds, they are still directed by a very small rudder wherever the impulse of the helmsman determines. "}],[{"type":"prose","content":"In the same sense, the tongue is a small part of the body, and yet it boasts of great things.See [by comparison] how great a forest is set on fire by a small spark! "}],[{"type":"prose","content":"And the tongue is [in a sense] a fire, the  world of injustice  unrighteousness; the tongue is set among our members as that which contaminates the entire body, and sets on fire the course of our life [the cycle of man’s existence], and is itself set on fire by hell (Gehenna). "}],[{"type":"prose","content":"For every species of beasts and birds, of reptiles and sea creatures, is tamed and has been tamed by the human race. "}],[{"type":"prose","content":"But no one can tame the  tongue; it is a restless evil [undisciplined, unstable], full of deadly poison. "}],[{"type":"prose","content":"With it we bless our Lord and Father, and with it we curse men, who have been made in the likeness of God. "}],[{"type":"prose","content":"Out of the same mouth come  blessing and cursing. These things, my brothers, should not be this way [for we have a moral obligation to speak in a manner that reflects our fear of God and profound respect for His precepts]. "}],[{"type":"prose","content":"Does a spring send out from the same opening  fresh and bitter ? "}],[{"type":"prose","content":"Can a fig tree, my brothers, produce olives, or a grapevine produce figs? Nor can salt water produce fresh."},{"type":"header","content":"Wisdom from Above"}],[{"type":"prose","content":"Who among you is wise and intelligent? Let him by his good conduct show his [good] deeds with the gentleness  humility of  wisdom. "}],[{"type":"prose","content":"But if you have bitter jealousy and selfish ambition in your hearts, do not be arrogant, and [as a result] be in defiance of the truth. "}],[{"type":"prose","content":"This [superficial] wisdom is not that which comes down from above, but is earthly (secular), natural (unspiritual),  demonic. "}],[{"type":"prose","content":"For where jealousy and selfish ambition exist, there is disorder [unrest, rebellion] and every evil thing  morally degrading practice. "}],[{"type":"prose","content":"But the wisdom from above is first pure [morally and spiritually undefiled], then peace-loving [courteous, considerate], gentle, reasonable [and willing to listen], full of compassion and good fruits. It is unwavering, without [self-righteous] hypocrisy [and self-serving guile]. "}],[{"type":"prose","content":"And the seed whose fruit is righteousness (spiritual maturity) is sown in peace by those who make peace [by actively encouraging goodwill between individuals]."}]]