[{"header":"The Tongue"},{"num":3,"verse":"My friends, we should not all try to become teachers. In fact, teachers will be judged more strictly than others. "},{"num":2,"verse":"All of us do many wrong things. But if you can control your tongue, you are mature and able to control your whole body."},{"num":3,"verse":"By putting a bit into the mouth of a horse, we can turn the horse in different directions. "},{"num":4,"verse":"It takes strong winds to move a large sailing ship, but the captain uses only a small rudder to make it go in any direction. "},{"num":5,"verse":"Our tongues are small too, and yet they brag about big things."},{"num":6,"verse":"The tongue is like a spark. It is an evil power that dirties the rest of the body and sets a person’s entire life on fire with flames that come from hell itself. "},{"num":7,"verse":"All kinds of animals, birds, reptiles, and sea creatures can be tamed and have been tamed. "},{"num":8,"verse":"But our tongues get out of control. They are restless and evil, and always spreading deadly poison."},{"num":9,"verse":"My dear friends, with our tongues we speak both praises and curses. We praise our Lord and Father, and we curse people who were created to be like God, and this isn’t right. "},{"num":11,"verse":"Can clean water and dirty water both flow from the same spring? "},{"num":12,"verse":"Can a fig tree produce olives or a grapevine produce figs? Does fresh water come from a well full of salt water?"},{"header":"Wisdom from Above"},{"num":13,"verse":"Are any of you wise or sensible? Then show it by living right and by being humble and wise in everything you do. "},{"num":14,"verse":"But if your heart is full of bitter jealousy and selfishness, don’t brag or lie to cover up the truth. "},{"num":15,"verse":"That kind of wisdom doesn’t come from above. It is earthly and selfish and comes from the devil himself. "},{"num":16,"verse":"Whenever people are jealous or selfish, they cause trouble and do all sorts of cruel things. "},{"num":17,"verse":"But the wisdom that comes from above leads us to be pure, friendly, gentle, sensible, kind, helpful, genuine, and sincere. "},{"num":18,"verse":"When peacemakers plant seeds of peace, they will harvest justice."}]