[{"header":"Abimelek"},{"num":9,"verse":"Abimelek was the son of Jerub-Baal. He went to his mother’s brothers in Shechem. He spoke to them and to all the members of his mother’s family group. He said, "},{"num":2,"verse":"“Speak to all the citizens of Shechem. Tell them, ‘You can have all 70 of Jerub-Baal’s sons rule over you. Or you can have just one man rule over you. Which would you rather have?’ Remember, I’m your own flesh and blood.”"},{"num":3,"verse":"The brothers told all of that to the citizens of Shechem. Then the people decided to follow Abimelek. They said, “He’s related to us.” "},{"num":4,"verse":"They gave him 28 ounces of silver. They had taken it from the temple of the god named Baal-Berith. Abimelek used it to hire some men. They were wild and weren’t good for anything. They became his followers. "},{"num":5,"verse":"Abimelek went to his father’s home in Ophrah. There on a big rock he murdered his 70 brothers. All of them were the sons of Jerub-Baal. But Jotham escaped by hiding. He was Jerub-Baal’s youngest son. "},{"num":6,"verse":"All the citizens of Shechem and Beth Millo came together. They gathered at the stone pillar that was beside the large tree in Shechem. They wanted to crown Abimelek as their king."},{"num":7,"verse":"Jotham was told about it. So he climbed up on top of Mount Gerizim. He shouted down to them, “Citizens of Shechem! Listen to me! Then God will listen to you. "},{"num":8,"verse":"One day the trees went out to anoint a king for themselves. They said to an olive tree, ‘Be our king.’"},{"num":9,"verse":"“But the olive tree answered, ‘Should I give up my olive oil? It’s used to honor gods and people alike. Should I give that up just to rule over the trees?’"},{"num":10,"verse":"“Next, the trees said to a fig tree, ‘Come and be our king.’"},{"num":11,"verse":"“But the fig tree replied, ‘Should I give up my fruit? It’s so good and sweet. Should I give that up just to rule over the trees?’"},{"num":12,"verse":"“Then the trees said to a vine, ‘Come and be our king.’"},{"num":13,"verse":"“But the vine answered, ‘Should I give up my wine? It cheers up gods and people alike. Should I give that up just to rule over the trees?’"},{"num":14,"verse":"“Finally, all the trees spoke to a bush that had thorns. They said, ‘Come and be our king.’"},{"num":15,"verse":"“The bush asked the trees, ‘Do you really want to anoint me as king over you? If you do, come and rest in my shade. But if you don’t, I will destroy you! Fire will come out of me and burn up the cedar trees of Lebanon!’"},{"num":16,"verse":"“Did you act in an honest way when you made Abimelek your king? Did you really do the right thing? Have you been fair to Jerub-Baal and his family? Have you given him the honor he’s worthy of? "},{"num":17,"verse":"Remember that my father fought for you. He put his life in danger for you. He saved you from the power of Midian. "},{"num":18,"verse":"But today you have turned against my father’s family. You have murdered his 70 sons on a big rock. Abimelek is only the son of my father’s female slave. But you have made him king over the citizens of Shechem. You have done that because he’s related to you. "},{"num":19,"verse":"Have you citizens of Shechem and Beth Millo acted in an honest way toward Jerub-Baal? Have you done the right thing to his family today? If you have, may you be happy with Abimelek! And may he be happy with you! "},{"num":20,"verse":"But if you haven’t, let fire come out from Abimelek and burn you up! And let fire come out from you and burn Abimelek up!”"},{"num":21,"verse":"Then Jotham ran away. He escaped to a town named Beer. He lived there because he was afraid of his brother Abimelek."},{"num":22,"verse":"Abimelek ruled over Israel for three years. "},{"num":23,"verse":"Then God stirred up trouble between Abimelek and the citizens of Shechem. So they turned against Abimelek. They decided not to follow him anymore. "},{"num":24,"verse":"God made that happen because of what Abimelek had done to Jerub-Baal’s 70 sons. He had spilled their blood. God wanted to punish their brother Abimelek for doing that. He also wanted to punish the citizens of Shechem. They had helped Abimelek murder his brothers. "},{"num":25,"verse":"The citizens of Shechem didn’t want Abimelek to be their ruler anymore. So they hid some men on top of the hills. They wanted them to attack and rob everyone who passed by. Abimelek was told about it."},{"num":26,"verse":"Gaal and his relatives moved into Shechem. Gaal was the son of Ebed. The citizens of Shechem put their trust in Gaal. "},{"num":27,"verse":"The people of Shechem went out into the fields. They gathered the grapes. They pressed the juice out of them by stomping on them. Then they held a feast in the temple of their god. While they were eating and drinking, they cursed Abimelek. "},{"num":28,"verse":"Then Gaal, the son of Ebed, said, “Who is Abimelek? And who is Shechem? Why should we citizens of Shechem be under Abimelek’s rule? Isn’t he Jerub-Baal’s son? Isn’t Zebul his helper? It would be better to serve the family of Hamor. He was the father of Shechem. So why should we serve Abimelek? "},{"num":29,"verse":"I wish these people were under my command. Then I would get rid of Abimelek. I would say to him, ‘Call out your whole army!’ ”"},{"num":30,"verse":"Zebul was the governor of Shechem. He heard about what Gaal, the son of Ebed, had said. So he was very angry. "},{"num":31,"verse":"Zebul secretly sent messengers to Abimelek. They said, “Gaal, the son of Ebed, has come to Shechem. His relatives have come with him. They are stirring up the city against you. "},{"num":32,"verse":"So come with your men during the night. Hide in the fields and wait. "},{"num":33,"verse":"In the morning at sunrise, attack the city. Gaal and his men will come out against you. Then take that opportunity to attack them.”"},{"num":34,"verse":"So Abimelek and all his troops started out at night. They went into their hiding places near Shechem. Abimelek had separated them into four fighting groups. "},{"num":35,"verse":"Gaal, the son of Ebed, had already gone out. He was standing at the entrance of the city gate. He had arrived there just as Abimelek and his troops came out of their hiding places."},{"num":36,"verse":"Gaal saw them. He said to Zebul, “Look! People are coming down from the tops of the mountains!”"},{"num":37,"verse":"But Gaal spoke up again. He said, “Look! People are coming down from the central hill. Another group is coming from the direction of the fortune tellers’ tree.”"},{"num":38,"verse":"Then Zebul said to Gaal, “Where is your big talk now? You said, ‘Who is Abimelek? Why should we be under his rule?’ Aren’t these the people you made fun of? Go out and fight against them!”"},{"num":39,"verse":"So Gaal led the citizens out of Shechem. They fought against Abimelek. "},{"num":40,"verse":"He chased Gaal from the field of battle. Abimelek chased them all the way to the entrance of the city gate. Many men were killed as they ran away. "},{"num":41,"verse":"Abimelek stayed in Arumah. And Zebul drove Gaal and his relatives out of Shechem."},{"num":42,"verse":"The next day the people of Shechem went out to work in the fields. Abimelek was told about it. "},{"num":43,"verse":"So he gathered his men together. He separated them into three fighting groups. Then he hid them in the fields and told them to wait. When he saw the people coming out of the city, he got up to attack them. "},{"num":44,"verse":"Abimelek and the men with him ran forward. They placed themselves at the entrance of the city gate. Then the other two groups attacked the people in the fields. There they struck them down. "},{"num":45,"verse":"Abimelek kept up his attack against the city all day long. He didn’t stop until he had captured it. Then he killed its people. He destroyed the city. He scattered salt on it to make sure that nothing would be able to grow there."},{"num":46,"verse":"The citizens in the tower of Shechem heard about what was happening. So they went to the safest place in the temple of the god named El-Berith. "},{"num":47,"verse":"Abimelek heard that they had gathered together there. "},{"num":48,"verse":"He and all his men went up Mount Zalmon. He got an ax and cut off some branches. He carried them on his shoulders. He ordered the men with him to do the same thing. “Quick!” he said. “Do what you have seen me do!” "},{"num":49,"verse":"So all the men cut branches and followed Abimelek. They piled them against the place where the people had gone for safety. Then they set the place on fire with the people still inside. There were about 1,000 men and women in the tower of Shechem. All of them died."},{"num":50,"verse":"Next, Abimelek went to Thebez. He surrounded it. Then he attacked it and captured it. "},{"num":51,"verse":"But inside the city there was a strong tower. All the people in the city had run to it for safety. All the men and women had gone into it. They had locked themselves in. They had climbed up on the roof of the tower. "},{"num":52,"verse":"Abimelek went to the tower and attacked it. He approached the entrance to the tower to set it on fire. "},{"num":53,"verse":"But a woman dropped a large millstone on him. It broke his head open."},{"num":54,"verse":"He quickly called out to the man carrying his armor. He said, “Pull out your sword and kill me. Then people can’t say, ‘A woman killed him.’ ” So his servant stuck his sword through him. And Abimelek died. "},{"num":55,"verse":"When the Israelites saw he was dead, they went home."},{"num":56,"verse":"That’s how God punished Abimelek for the evil thing he had done to his father. He had murdered his 70 brothers. "},{"num":57,"verse":"God also made the people of Shechem pay for all the evil things they had done. The curse of Jotham came down on them. He was the son of Jerub-Baal."}]