[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The second time.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No dates are given, but the implied interval must have been long enough for the girdle to become foul, while the prophet apparently waited for an explanation of the strange command.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-11 It was usual with the prophets to teach by signs. And we have the explanation, ver. 9-11. The people of Israel had been to God as this girdle. He caused them to cleave to him by the law he gave them, the prophets he sent among them, and the favours he showed them. They had by their idolatries and sins buried themselves in foreign earth, mingled among the nations, and were so corrupted that they were good for nothing. If we are proud of learning, power, and outward privileges, it is just with God to wither them. The minds of men should be awakened to a sense of their guilt and danger; yet nothing will be effectual without the influences of the Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A linen girdle - The appointed dress of the priestly order (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ...).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Put it not in water - i. e., do not wash it, and so let it represent the deep-grained pollution of the people. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Put it not in water - i. e., do not wash it, and so let it represent the deep-grained pollution of the people. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 13",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jer 13:1-27. Symbolical Prophecy (Jer 13:1-7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Many of these figurative acts being either not possible, or not probable, or decorous, seem to have existed only in the mind of the prophet as part of his inward vision. [So Calvin]. The world he moved in was not the sensible, but the spiritual, world. Inward acts were, however, when it was possible and proper, materialized by outward performance, but not always, and necessarily so. The internal act made a naked statement more impressive and presented the subject when extending over long portions of space and time more concentrated. The interruption of Jeremiah's official duty by a journey of more than two hundred miles twice is not likely to have literally taken place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. put it upon thy loins, &c.—expressing the close intimacy wherewith Jehovah had joined Israel and Judah to Him (Jer 13:11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "linen—implying it was the inner garment next the skin, not the outer one.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "put it not in water—signifying the moral filth of His people, like the literal filth of a garment worn constantly next the skin, without being washed (Jer 13:10). Grotius understands a garment not bleached, but left in its native roughness, just as Judah had no beauty, but was adopted by the sole grace of God (Eze 16:4-6). \"Neither wast thou washed in water,\" &c.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the word of the Lord,.... The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the word of prophecy from before the Lord:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "came unto me the second time, saying; what distance of time there was between this order and the former is not known. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "came unto me the second time, saying; what distance of time there was between this order and the former is not known. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the word of the LORD came unto me the second time, saying,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The spoilt girdle. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus spake Jahveh unto me: Go and buy thee a linen girdle, and put it upon thy loins, but into the water thou shalt not bring it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So I bought the girdle, according to the word of Jahveh, and put it upon my loins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then came the word of Jahveh to me the second time, saying: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Take the girdle which thou hast bought, which is upon thy loins, and arise, and go to the Euphrates, and hide it there in a cleft of the rock. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So I went and hid it, as Jahveh had commanded me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it came to pass after many days, that Jahveh said unto me: Arise, go to the Euphrates, and bring thence the girdle which I commanded thee to hide there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I went to the Euphrates, and digged, and took the girdle from the place where I had hid it; and, behold, the girdle was marred, was good for nothing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the word of Jahveh came to me, saying: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus hath Jahveh said, After this manner will I mar the pride of Judah, and the great pride of Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This evil people, which refuse to hear my words, which walk in the stubbornness of their heart, and walk after other gods, to serve them and to worship them, it shall be as this girdle which is good for nothing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For as the girdle cleaves to the loins of a man, so have I caused to cleave unto me the whole house of Israel and the whole house of Judah, saith Jahveh; that it might be to me for a people and for a name, for a praise and for an ornament; but they hearkened not.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With regard to the symbolical action imposed on the prophet and performed by him, the question arises, whether the thing took place in outward reality, or was only an occurrence in the spirit, in the inward vision. The first view seems to be supported by the wording of the passage, namely, the twice repeated account of the prophet's journey to the Phrat on the strength of a twice repeated divine command. But on the other hand, it has been found very improbable that \"Jeremiah should twice have made a journey to the Euphrates, merely to prove that a linen girdle, if it lie long in the damp, becomes spoilt, a thing he could have done much nearer home, and which besides everybody knew without experiment\" (Graf.). On this ground Ros., Graf, etc., hold the matter for a parable or an allegorical tale, But this view depends for support on the erroneous assumption that the specification of the Euphrates is of no kind of importance for the matter in hand; whereas the contrary may be gathered from the four times repeated mention of the place. Nor is anything proved against the real performance of God's command by the remark, that the journey thither and back on both occasions is spoken of as if it were a mere matter of crossing a field. The Bible writers are wont to set forth such external matters in no very circumstantial way. And the great distance of the Euphrates - about 250 miles - gives us no sufficient reason for departing from the narrative as we have it before us, pointing as it does to a literal and real carrying out of God's command, and to relegate the matter to the inward region of spiritual vision, or to take the narrative for an allegorical tale. - Still less reason is to be found in arbitrary interpretations of the name, such as, after Bochart's example, have been attempted by Ven., Hitz., and Ew. The assertion that the Euphrates is called נהר פּרת everywhere else, including Jeremiah 46:2, Jeremiah 46:6,Jeremiah 46:10, loses its claim to conclusiveness from the fact that the prefaced rhn is omitted in Genesis 2:14; Jeremiah 51:63. And even Ew. observes, that \"fifty years later a prophet understood the word of the Euphrates at Jeremiah 51:63.\" Now even if Jeremiah 51:63 had been written by another prophet, and fifty years later (which is not the case, see on Jeremiah 50ff.), the authority of this prophet would suffice to prove every other interpretation erroneous; even although the other attempts at interpretation had been more than the merest fancies. Ew. remarks, \"It is most amazing that recent scholars (Hitz. with Ven. and Dahl.) could seriously come to adopt the conceit that פּרת is one and the same with אפּרת (Genesis 48:7), and so with Bethlehem;\" and what he says is doubly relevant to his own rendering. פּרת, he says, is either to be understood like Arab. frt, of fresh water in general, or like frdt, a place near the water, a crevice opening from the water into the land - interpretations so far fetched as to require no serious refutation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With regard to the symbolical action imposed on the prophet and performed by him, the question arises, whether the thing took place in outward reality, or was only an occurrence in the spirit, in the inward vision. The first view seems to be supported by the wording of the passage, namely, the twice repeated account of the prophet's journey to the Phrat on the strength of a twice repeated divine command. But on the other hand, it has been found very improbable that \"Jeremiah should twice have made a journey to the Euphrates, merely to prove that a linen girdle, if it lie long in the damp, becomes spoilt, a thing he could have done much nearer home, and which besides everybody knew without experiment\" (Graf.). On this ground Ros., Graf, etc., hold the matter for a parable or an allegorical tale, But this view depends for support on the erroneous assumption that the specification of the Euphrates is of no kind of importance for the matter in hand; whereas the contrary may be gathered from the four times repeated mention of the place. Nor is anything proved against the real performance of God's command by the remark, that the journey thither and back on both occasions is spoken of as if it were a mere matter of crossing a field. The Bible writers are wont to set forth such external matters in no very circumstantial way. And the great distance of the Euphrates - about 250 miles - gives us no sufficient reason for departing from the narrative as we have it before us, pointing as it does to a literal and real carrying out of God's command, and to relegate the matter to the inward region of spiritual vision, or to take the narrative for an allegorical tale. - Still less reason is to be found in arbitrary interpretations of the name, such as, after Bochart's example, have been attempted by Ven., Hitz., and Ew. The assertion that the Euphrates is called נהר פּרת everywhere else, including ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", loses its claim to conclusiveness from the fact that the prefaced rhn is omitted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:63",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And even Ew. observes, that \"fifty years later a prophet understood the word of the Euphrates at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:63",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".\" Now even if ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:63",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " had been written by another prophet, and fifty years later (which is not the case, see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "ff.), the authority of this prophet would suffice to prove every other interpretation erroneous; even although the other attempts at interpretation had been more than the merest fancies. Ew. remarks, \"It is most amazing that recent scholars (Hitz. with Ven. and Dahl.) could seriously come to adopt the conceit that פּרת is one and the same with אפּרת (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and so with Bethlehem;\" and what he says is doubly relevant to his own rendering. פּרת, he says, is either to be understood like Arab. frt, of fresh water in general, or like frdt, a place near the water, a crevice opening from the water into the land - interpretations so far fetched as to require no serious refutation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "More important than the question as to the formal nature of the emblematical action is that regarding its meaning; on which the views of commentators are as much divided. from the interpretation in Jeremiah 13:9-11 thus much is clear, that the girdle is the emblem of Israel, and that the prophet, in putting on and wearing this girdle, illustrates the relation of God to the folk of His covenant (Israel and Judah). The further significance of the emblem is suggested by the several moments of the action. The girdle does not merely belong to a man's adornment, but is that part of his clothing which he must put on when about to undertake any laborious piece of work. The prophet is to buy and put on a linen girdle. פּשׁתּים, linen, was the material of the priests' raiment, Ezekiel 44:17., which in Exodus 28:40; Exodus 39:27. is called שׁשׁ, white byssus, or בּד, linen. The priest's girdle was not, however, white, but woven parti-coloured, after the four colours of the curtains of the sanctuary, Exodus 28:40; Exodus 39:29. Wool (צמר) is in Ezekiel 44:18 expressly excluded, because it causes the body to sweat. The linen girdle points, therefore, to the priestly character of Israel, called to be a holy people, a kingdom of priests (Exodus 19:6). \"The purchased white girdle of linen, a man's pride and adornment, is the people bought out of Egypt, yet in its innocence as it was when the Lord bound it to Himself with the bands of love\" (Umbr.). The prohibition that follows, \"into water thou shalt not bring it,\" is variously interpreted. Chr. B. Mich. says: forte ne madefiat et facilius dein computrescat; to the same effect Dahl., Ew., Umbr., Graf: to keep it safe from the hurtful effects of damp. A view which refutes itself; since washing does no kind of harm to the linen girdle, but rather makes it again as good as new. Thus to the point writes Ng., remarking justly at the same time, that the command not to bring the girdle into the water plainly implies that the prophet would have washed it when it had become soiled. This was not to be. The girdle was to remain dirty, and as such to be carried to the Euphrates, in order that, as Ros. and Maur. observed, it might symbolize sordes quas contraxerit populus in dies majores, mores populi magis magisque lapsi, and that the carrying of the soiled girdle to the Euphrates might set forth before the eyes of the people what awaited it, after it had long been borne by God covered with the filth of its sins. - The just appreciation of this prohibition leads us easily to the true meaning of the command in Jeremiah 13:4, to bring the girdle that was on his loins to the Euphrates, and there to conceal it in a cleft in the rock, where it decays. But it is signifies, as Chr. B. Mich., following Jerome, observes, populi Judaici apud Chaldaeos citra Euphratem captivitas et exilium. Graf has objected: \"The corruptness of Israel was not a consequence of the Babylonish captivity; the latter, indeed, came about in consequence of the existing corruptness.\" But this objection stands and falls with the amphibolia of the word corruptness, decay. Israel was, indeed, morally decayed before the exile; but the mouldering of the girdle in the earth by the Euphrates signifies not the moral but the physical decay of the covenant people, which, again, was a result of the moral decay of the period during which God had, in His long-suffering, borne the people notwithstanding their sins. Wholly erroneous is the view adopted by Gr. from Umbr.: the girdle decayed by the water is the sin-stained people which, intriguing with the foreign gods, had in its pride cast itself loose from its God, and had for long imagined itself secure under the protection of the gods of Chaldea. The hiding of the girdle in the crevice of a rock by the banks of the Euphrates would have been the most unsuitable emblem conceivable for representing the moral corruption of the people. Had the girdle, which God makes to decay by the Euphrates, loosed itself from him and imagined it could conceal itself in a foreign land? as Umbr. puts the case. According to the declaration, Jeremiah 13:9, God will mar the great pride of Judah and Jerusalem, even as the girdle had been marred, which had at His command been carried to the Euphrates and hid there. The carrying of the girdle to the Euphrates is an act proceeding from God, by which Israel is marred; the intriguing of Israel with strange gods in the land of Canaan was an act of Israel's own, against the will of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "More important than the question as to the formal nature of the emblematical action is that regarding its meaning; on which the views of commentators are as much divided. from the interpretation in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:9-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thus much is clear, that the girdle is the emblem of Israel, and that the prophet, in putting on and wearing this girdle, illustrates the relation of God to the folk of His covenant (Israel and Judah). The further significance of the emblem is suggested by the several moments of the action. The girdle does not merely belong to a man's adornment, but is that part of his clothing which he must put on when about to undertake any laborious piece of work. The prophet is to buy and put on a linen girdle. פּשׁתּים, linen, was the material of the priests' raiment, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 44:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., which in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 39:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". is called שׁשׁ, white byssus, or בּד, linen. The priest's girdle was not, however, white, but woven parti-coloured, after the four colours of the curtains of the sanctuary, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 39:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Wool (צמר) is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 44:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " expressly excluded, because it causes the body to sweat. The linen girdle points, therefore, to the priestly character of Israel, called to be a holy people, a kingdom of priests (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"The purchased white girdle of linen, a man's pride and adornment, is the people bought out of Egypt, yet in its innocence as it was when the Lord bound it to Himself with the bands of love\" (Umbr.). The prohibition that follows, \"into water thou shalt not bring it,\" is variously interpreted. Chr. B. Mich. says: forte ne madefiat et facilius dein computrescat; to the same effect Dahl., Ew., Umbr., Graf: to keep it safe from the hurtful effects of damp. A view which refutes itself; since washing does no kind of harm to the linen girdle, but rather makes it again as good as new. Thus to the point writes Ng., remarking justly at the same time, that the command not to bring the girdle into the water plainly implies that the prophet would have washed it when it had become soiled. This was not to be. The girdle was to remain dirty, and as such to be carried to the Euphrates, in order that, as Ros. and Maur. observed, it might symbolize sordes quas contraxerit populus in dies majores, mores populi magis magisque lapsi, and that the carrying of the soiled girdle to the Euphrates might set forth before the eyes of the people what awaited it, after it had long been borne by God covered with the filth of its sins. - The just appreciation of this prohibition leads us easily to the true meaning of the command in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to bring the girdle that was on his loins to the Euphrates, and there to conceal it in a cleft in the rock, where it decays. But it is signifies, as Chr. B. Mich., following Jerome, observes, populi Judaici apud Chaldaeos citra Euphratem captivitas et exilium. Graf has objected: \"The corruptness of Israel was not a consequence of the Babylonish captivity; the latter, indeed, came about in consequence of the existing corruptness.\" But this objection stands and falls with the amphibolia of the word corruptness, decay. Israel was, indeed, morally decayed before the exile; but the mouldering of the girdle in the earth by the Euphrates signifies not the moral but the physical decay of the covenant people, which, again, was a result of the moral decay of the period during which God had, in His long-suffering, borne the people notwithstanding their sins. Wholly erroneous is the view adopted by Gr. from Umbr.: the girdle decayed by the water is the sin-stained people which, intriguing with the foreign gods, had in its pride cast itself loose from its God, and had for long imagined itself secure under the protection of the gods of Chaldea. The hiding of the girdle in the crevice of a rock by the banks of the Euphrates would have been the most unsuitable emblem conceivable for representing the moral corruption of the people. Had the girdle, which God makes to decay by the Euphrates, loosed itself from him and imagined it could conceal itself in a foreign land? as Umbr. puts the case. According to the declaration, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", God will mar the great pride of Judah and Jerusalem, even as the girdle had been marred, which had at His command been carried to the Euphrates and hid there. The carrying of the girdle to the Euphrates is an act proceeding from God, by which Israel is marred; the intriguing of Israel with strange gods in the land of Canaan was an act of Israel's own, against the will of God.",
            "children": []
          }
        ]
      }
    ]
  }
]