[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:13-27 This appearance of Jesus to the two disciples going to Emmaus, happened the same day that he rose from the dead. It well becomes the disciples of Christ to talk together of his death and resurrection; thus they may improve one another's knowledge, refresh one another's memory, and stir up each other's devout affections. And where but two together are well employed in work of that kind, he will come to them, and make a third. Those who seek Christ, shall find him: he will manifest himself to those that inquire after him; and give knowledge to those who use the helps for knowledge which they have. No matter how it was, but so it was, they did not know him; he so ordering it, that they might the more freely discourse with him. Christ's disciples are often sad and sorrowful, even when they have reason to rejoice; but through the weakness of their faith, they cannot take the comfort offered to them. Though Christ is entered into his state of exaltation, yet he notices the sorrows of his disciples, and is afflicted in their afflictions. Those are strangers in Jerusalem, that know not of the death and sufferings of Jesus. Those who have the knowledge of Christ crucified, should seek to spread that knowledge. Our Lord Jesus reproved them for the weakness of their faith in the Scriptures of the Old Testament. Did we know more of the Divine counsels as far as they are made known in the Scriptures, we should not be subject to the perplexities we often entangle ourselves in. He shows them that the sufferings of Christ were really the appointed way to his glory; but the cross of Christ was that to which they could not reconcile themselves. Beginning at Moses, the first inspired writer of the Old Testament, Jesus expounded to them the things concerning himself. There are many passages throughout all the Scriptures concerning Christ, which it is of great advantage to put together. We cannot go far in any part, but we meet with something that has reference to Christ, some prophecy, some promise, some prayer, some type or other. A golden thread of gospel grace runs through the whole web of the Old Testament. Christ is the best expositor of Scripture; and even after his resurrection, he led people to know the mystery concerning himself, not by advancing new notions, but by showing how the Scripture was fulfilled, and turning them to the earnest study of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Two of them.\" Two of the disciples. The name of one of them was \"Cleopas,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Many have supposed that the other was Luke, and that he omitted his own name from modesty. Others have supposed that it was Peter. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is no evidence to guide us here. Dr. Lightfoot has shown that \"Cleopas\" is the same name as \"Alpheus,\" who was the father of the apostle James, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Emmaus - In regard to the locality of Emmaus, it seems quite probable that it is the same village which is referred to by Josephus (\"Jewish Wars,\" vii. 6, Section 6), who states that, after the destruction of Jerusalem, Titus gave \"Emmaus,\" distant from Jerusalem threescore furlongs, to 800 of his troops, whom he had dismissed from his army, for their habitation. Dr. Thomson (\"The Land and the Book,\" vol. ii. p. 307, 540) regards it as the present Kuriet el 'Aineb, which Dr. Robinson identifies with Kirjath-jearim. Of this place he says: \"Kuriet el 'Aineb itself would be the proper distance from Jerusalem, and being on the road to Jaffa, and on the dividing ridge between the plain and the mountains, the Roman emperor might have deemed it an advantageous post for a colony made up of his disbanded soldiers, who could keep in check the surrounding country. Certain it is that in these later ages the occupants of this place have controlled the whole adjacent region, and for many a generation exercised their lawless tyranny upon helpless pilgrims.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"It took just three hours' moderate riding from Kuriet el 'Aineb to Jerusalem: first, a long descent into Wady Hanina, which passes between it and Soba; then a similar ascent, succeeded by a very steep pass, and a very slippery path down to Kulonia. At this place are some heavy foundations of church, convent, or castle by the road-side, which may be of almost any age, and also gardens of fruit-trees, irrigated by a fountain of excellent water. Kulonia is on a hill north of the road, and appears in a fair way to become a ruin itself before long. The path then winds up a valley, and stretches over a dreary waste of bare rocks until within a mile of the city, when the view opens upon its naked ramparts and the mysterious regions toward the Dead Sea.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Threescore furlongs - Sixty furlongs, or about seven or eight miles. It is not certain that these were apostles, but the contrary seems to be implied in Luke 24:33. See the notes at that verse. If they were not, it is probable that they were intimate disciples, who may have been much with the Saviour during the latter part of his ministry and the closing scenes of his life. But it is wholly unknown why they were going to Emmaus. It may have been that this was their native place, or that they had friends in the vicinity. They seem to have given up all for lost, and to have come to the conclusion that Jesus was not the Messiah, though they naturally conversed about it, and there were many things which they could not explain. Their Master had been crucified contrary to their expectation, their hopes dashed, their anticipation disappointed, and they were now returning in sadness, and very naturally conversed, in the way, of the things which had happened in Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Threescore furlongs - Sixty furlongs, or about seven or eight miles. It is not certain that these were apostles, but the contrary seems to be implied in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See the notes at that verse. If they were not, it is probable that they were intimate disciples, who may have been much with the Saviour during the latter part of his ministry and the closing scenes of his life. But it is wholly unknown why they were going to Emmaus. It may have been that this was their native place, or that they had friends in the vicinity. They seem to have given up all for lost, and to have come to the conclusion that Jesus was not the Messiah, though they naturally conversed about it, and there were many things which they could not explain. Their Master had been crucified contrary to their expectation, their hopes dashed, their anticipation disappointed, and they were now returning in sadness, and very naturally conversed, in the way, of the things which had happened in Jerusalem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14-16. communed and reasoned—exchanged views and feelings, weighing afresh all the facts, as detailed in Lu 24:18-24.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "drew near—coming up behind them as from Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "eyes holden—Partly He was \"in another form\" (Mr 16:12), and partly there seems to have been an operation on their own vision; though certainly, as they did not believe that He was alive, His company as a fellow traveller was the last thing they would expect,",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " There is nothing more ordinary, than for persons walking and riding upon roads to make the present news of the time. The subject of their discourse. There had great things happened in Jerusalem, the death of our Saviour was such; and those things which attended his death were very extraordinary; and it is not at all to be wondered that a discourse of them should fill every mouth, especially every disciple’s mouth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they talked together,.... As they went along, on their journey: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of all these things which had happened; concerning their dear Lord and master, Jesus Christ; how that he had been betrayed by Judas, one of his disciples; had been led bound, first to Annas, and then Caiaphas, the high priest, in whose palace he had been condemned to death; how that he was delivered by the chief priests and elders, to Pontius Pilate, the Roman governor of whom they requested, that he might be crucified: they very likely discoursed also, about the ignominious treatment he met with, both in the high priest's palace and: in Pilate's hall; and how at last he was crucified between two thieves, and was dead and buried; and particularly, they might be talking together of what they had heard that morning from the women, that had been at the sepulchre of Christ, and reported that he was risen. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "of all these things which had happened; concerning their dear Lord and master, Jesus Christ; how that he had been betrayed by Judas, one of his disciples; had been led bound, first to Annas, and then Caiaphas, the high priest, in whose palace he had been condemned to death; how that he was delivered by the chief priests and elders, to Pontius Pilate, the Roman governor of whom they requested, that he might be crucified: they very likely discoursed also, about the ignominious treatment he met with, both in the high priest's palace and: in Pilate's hall; and how at last he was crucified between two thieves, and was dead and buried; and particularly, they might be talking together of what they had heard that morning from the women, that had been at the sepulchre of Christ, and reported that he was risen. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they talked together of all these things which had happened.",
        "children": []
      }
    ]
  }
]