[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Into the hands of sinful men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The adjective does not appear in the earlier report. It is probably used here, more or less, in its popular Jewish meaning, as applied to “sinners of the Gentiles” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE FIRST EASTER SUNRISELuke 24:1 - Luke 24:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE FIRST EASTER SUNRISE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " No Evangelist narrates the act of Resurrection. Apocryphal Gospels cannot resist the temptation of describing it. Why did the Four preserve such singular reticence about what would have been irresistible to ‘myth’ makers? Because they were not myth-makers, but witnesses, and had nothing to say as to an act that no man had seen. No doubt, the Resurrection took place in the earliest hours of the first day of the week. The Sun of Righteousness rose before the Easter Day sun. It was midsummer day for Him, while it was but spring for earth’s calendar. That early rising has no setting to follow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The divergences of the Evangelists reach their maximum in the accounts of the Resurrection, as is natural if we realise the fragmentary character of all the versions, the severely condensed style of Matthew’s, the incompleteness of the genuine Mark’s, the evidently selective purpose in Luke’s, and the supplementary design of John’s. If we add the perturbed state of the disciples, their separation from each other, and the number of distinct incidents embraced in the records, we shall not wonder at the differences, but see in them confirmation of the good faith of the witnesses, and a reflection of the hurry and wonderfulness of that momentous day. Differences there are; contradictions there are not, except between the doubtful verses added to Mark and the other accounts. We cannot put all the pieces together, when we have only them to guide us. If we had a complete and independent narrative to go by, we could, no doubt, arrange our fragments. But the great certainties are unaffected by the small divergences, and the points of agreement are vital. They are, for example, that none saw the Resurrection, that the first to know of it were the women, that angels appeared to them at the tomb, that Jesus showed Himself first to Mary Magdalene, that the reports of the Resurrection were not believed. Whether the group with whom this passage has to do were the same as that whose experience Matthew records we leave undetermined. If so, they must have made two visits to the tomb, and two returns to the Apostles,-one, with only the tidings of the empty sepulchre, which Luke tells; one, with the tidings of Christ’s appearance, as in Matthew. But harmonistic considerations do not need to detain us at present.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Sorrow and love are light sleepers, and early dawn found the brave women on their way. Nicodemus had bound spices in with the body, and these women’s love-gift was as ‘useless’ and as fragrant as Mary’s box of ointment. Whatever love offers, love welcomes, though Judas may ask ‘To what purpose is this waste?’ Angel hands had rolled away the stone, not to allow of Jesus’ exit, for He had risen while it was in its place, but to permit the entrance of the ‘witnesses of the Resurrection.’ So little did these women dream of such a thing that the empty tomb brought no flash of joy, but only perplexity to their wistful gaze. ‘What does it mean?’ was their thought. They and all the disciples expected nothing less than they did a Resurrection, therefore their testimony to it is the more reliable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke marks the appearance of the angels as sudden by that ‘behold.’ They were not seen approaching, but at one moment the bewildered women were alone, looking at each other with faces of dreary wonder, and the next, ‘two men’ were standing beside them, and the tomb was lighted by the sheen of their dazzling robes. Much foolish fuss has been made about the varying reports of the angels, and ‘contradictions’ have been found in the facts that some saw them and some did not, that some saw one and some saw two, that some saw them seated and some saw them standing, and so on. We know so little of the laws that govern angelic appearances that our opinion as to the probability or veracity of the accounts is mere guess-work. Where should a flight of angels have gathered and hovered if not there? And should they not ‘sit in order serviceable’ about the tomb, as around the ‘stable’ at Bethlehem? Their function was to prepare a way in the hearts of the women for the Lord Himself, to lessen the shock,-for sudden joy shocks and may hurt,-as well as to witness that these ‘things angels desire to look into.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Their message flooded the women’s hearts with better light than their garments had spread through the tomb. Luke’s version of it agrees with Mark and Matthew in the all-important central part, ‘He is not here, but is risen’ {though these words in Luke are not beyond doubt}, but diverges from them otherwise. Surely the message was not the mere curt announcement preserved by any one of the Evangelists. We may well believe that much more was said than any or all of them have recorded. The angels’ question is half a rebuke, wholly a revelation, of the essential nature of ‘the Living One,’ who was so from all eternity, but is declared to be so by His rising, of the incongruity of supposing that He could be gathered to, and remain with, the dim company of the dead, and a blessed word, which turns sorrow into hope, and diverts sad eyes from the grave to the skies, for all the ages since and to come. The angels recall Christ’s prophecies of death and resurrection, which, like so many of His words to the disciples and to us, had been heard, and not heard, being neglected or misinterpreted. They had questioned ‘what the rising from the dead should mean,’ never supposing that it meant exactly what it said. That way of dealing with Christ’s words did not end on the Easter morning, but is still too often practised.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we are to follow Luke’s account, we must recognise that the women in a company, as well as Mary Magdalene separately, came back first with the announcement of the empty tomb and the angels’ message, and later with the full announcement of having seen the Lord. But apart from the complexities of attempted combination of the narratives, the main point in all the Evangelists is the disbelief of the disciples, ‘Idle tales,’ said they, using a very strong word which appears only here in the New Testament, and likens the eager story of the excited women to a sick man’s senseless ramblings. That was the mood of the whole company, apostles and all. Is that mood likely to breed hallucinations? The evidential value of the disciples’ slowness to believe cannot be overrated.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Peter’s race to the sepulchre, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is omitted by several good authorities, and is, perhaps, spurious here. If allowed to stand as Luke’s, it seems to show that the Evangelist had a less complete knowledge of the facts than John. Mark, Peter’s ‘interpreter,’ has told us of the special message to him from the risen, but as yet unseen, Lord, and we may well believe that that quickened his speed. The assurance of forgiveness and the hope of a possible future that might cover over the cowardly past, with the yearning to sob his heart out on the Lord’s breast, sent him swiftly to the tomb. Luke does not say that he went in, as John, with one of his fine touches, which bring out character in a word, tells us that he did; but he agrees with John in describing the effect of what Peter saw as being only ‘wonder,’ and the result as being only that he went away pondering over it all, and not yet able to grasp the joy of the transcendent fact. Perhaps, if he had not had a troubled conscience, he would have had a quicker faith. He was not given to hesitation, but his sin darkened his mind. He needed that secret interview, of which many knew the fact but none the details, ere he could feel the full glow of the Risen Sun thawing his heart and scattering his doubts like morning mists on the hills.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-12 See the affection and respect the women showed to Christ, after he was dead and buried. Observe their surprise when they found the stone rolled away, and the grave empty. Christians often perplex themselves about that with which they should comfort and encourage themselves. They look rather to find their Master in his grave-clothes, than angels in their shining garments. The angels assure them that he is risen from the dead; is risen by his own power. These angels from heaven bring not any new gospel, but remind the women of Christ's words, and teach them how to apply them. We may wonder that these disciples, who believed Jesus to be the Son of God and the true Messiah, who had been so often told that he must die, and rise again, and then enter into his glory, who had seen him more than once raise the dead, yet should be so backward to believe his raising himself. But all our mistakes in religion spring from ignorance or forgetfulness of the words Christ has spoken. Peter now ran to the sepulchre, who so lately ran from his Master. He was amazed. There are many things puzzling and perplexing to us, which would be plain and profitable, if we rightly understood the words of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. Saying, &c.—How remarkable it is to hear angels quoting a whole sentence of Christ's to the disciples, mentioning where it was uttered, and wondering it was not fresh in their memory, as doubtless it was in theirs! (1Ti 3:16, \"seen of angels,\" and 1Pe 1:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 24:4\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Saying, the son of man must be delivered into the hands of sinful men,.... As Christ was, who is intended by the son of man, he being the son of David, and the son of Abraham, and the son of Adam, though he was the seed of the woman, and born of a virgin; he was truly man, and subject to the infirmities of men; for this is sometimes used as a diminutive expression, though a title of the Messiah in the Old Testament, and regards him in his state of humiliation. He was delivered into the hands of the band of men and officers by Judas, who came against him with swords and staves, as against a thief; and by the Jews to Pontius Pilate, the Roman governor, a very wicked man; and by him, to the will of the Jews, who, with wicked hands, took him, and slew him; and into the hands of the Roman soldiers, who crucified him, and who may more especially be meant by sinful men, the Gentiles; and especially Heathen soldiers, being reckoned by the Jews notorious sinners: to be among sinners, in the company of such sinful men, must needs be very disagreeable to the holy and harmless Lamb of God; but to be in their hands, and at their mercy, whose tender mercies are cruel, must be very afflicting: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and be crucified: which was a Roman death, and a very shameful, and painful one: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the third day rise again; it is for the sake of this chiefly that the angels put the women in mind of this whole paragraph, which so fully confirms their testimony of his resurrection; and which the women might be assured of, upon calling to mind these words, which they themselves had heard from Christ's mouth; and it being now the third day since the death of Christ. The words declare, that all these things must be; that there was a necessity of them; partly on account of the decrees of God, by which it was determined they should be; and partly on account of the covenant engagements of Christ, in which he agreed unto them; and also, by reason of the prophecies of the Old Testament, which gave out, that thus it must be; yea, our Lord's own predictions made them necessary; and the law and justice of God required them; or otherwise, the salvation of God's people could not have been obtained. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the third day rise again; it is for the sake of this chiefly that the angels put the women in mind of this whole paragraph, which so fully confirms their testimony of his resurrection; and which the women might be assured of, upon calling to mind these words, which they themselves had heard from Christ's mouth; and it being now the third day since the death of Christ. The words declare, that all these things must be; that there was a necessity of them; partly on account of the decrees of God, by which it was determined they should be; and partly on account of the covenant engagements of Christ, in which he agreed unto them; and also, by reason of the prophecies of the Old Testament, which gave out, that thus it must be; yea, our Lord's own predictions made them necessary; and the law and justice of God required them; or otherwise, the salvation of God's people could not have been obtained. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Saying, The Son of man must be delivered into the hands of sinful men, and be crucified, and the third day rise again.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν υἱὸν τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: standing before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι δεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be taken as an accusative of reference = saying as to the Son of Man that, etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνθρώπων ἁμαρτωλῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", sinful men, not necessarily Gentiles only (Meyer, J. Weiss, etc.), but men generally (Hahn) Jesus actually expressed Himself in much more definite terms.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὸν Υἱὸν τοῦ ἀνθρώπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This is repeated from the discourses which were delivered by the Lord before His passion. But the Lord Himself did not give Himself the appellation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", after His resurrection, but either spake in the first person, or else employed the express appellation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἁμαρτωλῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of sinful men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") viz. the Gentiles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 24:7",
        "children": []
      }
    ]
  }
]