[[],[{"type":"header","content":"Peter Reports at Jerusalem"},{"type":"prose","content":"Now the apostles and the believers who were throughout Judea heard [with astonishment] that the Gentiles also had received  accepted the word of God [the message concerning salvation through Christ]. "}],[{"type":"prose","content":"So when Peter went up to Jerusalem, those of the circumcision [certain Jewish believers who followed the Law] took issue with him [for violating Jewish customs], "}],[{"type":"prose","content":"saying, “You went to uncircumcised men and [even] ate with them!” "}],[{"type":"prose","content":"But Peter began [at the beginning] and explained [the events] to them step by step, saying, "}],[{"type":"prose","content":"“I was in the city of Joppa praying; and in a trance I saw a vision of an object coming down from heaven, like a huge sheet being lowered by the four corners; and [it descended until] it came right down to me, "}],[{"type":"prose","content":"and looking closely at it, I saw  the four-footed animals of the earth and the wild beasts and the crawling creatures and the birds of the air [both clean and unclean according to the Law], "}],[{"type":"prose","content":"and I also heard a voice saying to me, ‘Get up, Peter; kill and eat.’ "}],[{"type":"prose","content":"But I said, ‘Not at all, Lord; for nothing common (unholy) or [ceremonially] unclean has ever entered my mouth.’ "}],[{"type":"prose","content":"But the voice from heaven answered a second time, ‘What God has cleansed  pronounced clean, no longer consider common (unholy).’ "}],[{"type":"prose","content":"This happened three times, and everything was drawn up again into heaven. "}],[{"type":"prose","content":"And right then the three men who had been sent to me from Caesarea arrived at the house where we were . "}],[{"type":"prose","content":"The Spirit told me to go with them without the slightest hesitation. So these six brothers also went with me and we went to the man’s house. "}],[{"type":"prose","content":"And Cornelius told us how he had seen the angel standing in his house, saying, ‘Send  to Joppa and have Simon, who is also called Peter, brought here; "}],[{"type":"prose","content":"he will bring a message to you by which you will be saved [and granted eternal life], you and all your household.’ "}],[{"type":"prose","content":"When I began to speak, the Holy Spirit fell on them just as  on us at the beginning [at Pentecost]. "}],[{"type":"prose","content":"Then I remembered the word of the Lord, how He used to say,  "}],[{"type":"prose","content":"So, if God gave Gentiles the same gift [equally] as He gave us after we accepted  believed  trusted in the Lord Jesus Christ [as Savior], who was I to interfere  stand in God’s way?” "}],[{"type":"prose","content":"When they heard this, they quieted down and glorified  praised God, saying, “Then God has also granted to the Gentiles repentance  to  life [that is, real life after earthly death].”"}],[{"type":"header","content":"The Church at Antioch"},{"type":"prose","content":"So then [since they were unaware of these developments] those who were scattered because of the persecution that occurred in connection with [the stoning of] Stephen traveled as far as Phoenicia and Cyprus and Antioch, without telling the message [of salvation through Christ] to anyone except Jews. "}],[{"type":"prose","content":"But there were some of them, men of Cyprus and Cyrene, who came to Antioch and  speaking to the Greeks as well, proclaiming [to them] the good news about the Lord Jesus. "}],[{"type":"prose","content":"And the hand (the power and presence) of the Lord was with them, and a great number who believed turned to the Lord [for salvation, accepting and drawing near to Jesus as Messiah and Savior]. "}],[{"type":"prose","content":"The news of this reached the ears of the church in Jerusalem, and they sent Barnabas to Antioch. "}],[{"type":"prose","content":"When he arrived and saw the grace of God [that was bestowed on them], he rejoiced and  to encourage them all with an unwavering heart to stay true  devoted to the Lord. "}],[{"type":"prose","content":"For Barnabas was a good man [privately and publicly—his godly character benefited both himself and others] and  full of the Holy Spirit and full of faith [in Jesus the Messiah, through whom believers have everlasting life]. And a great number of people were brought to the Lord. "}],[{"type":"prose","content":"And Barnabas left for Tarsus to search for Saul; "}],[{"type":"prose","content":"and when he found him, he brought him back to Antioch. For an entire year they met [with others] in the church and instructed large numbers; and it was in Antioch that the disciples were first called Christians."}],[{"type":"prose","content":"Now at this time some prophets came down from Jerusalem to Antioch. "}],[{"type":"prose","content":"One of them named Agabus stood up and prophesied through the [Holy] Spirit that a severe famine would come on the entire world. And this did happen during the reign of Claudius. "}],[{"type":"prose","content":"So the disciples decided to send , each according to his individual ability, to the believers who lived in Judea. "}],[{"type":"prose","content":"And this they did, sending the contribution to the elders by Barnabas and Saul."}]]