[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 9:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 9:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The fig-tree said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Gideon refused this honour, both for himself, and for his sons; and the sons of Gideon, whom Abimelech had slain, upon pretence of their affecting the kingdom, were as far from such thoughts as their father.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:7-21 There was no occasion for the trees to choose a king, they are all the trees of the Lord which he has planted. Nor was there any occasion for Israel to set a king over them, for the Lord was their King. Those who bear fruit for the public good, are justly respected and honoured by all that are wise, more than those who merely make a figure. All these fruit-trees gave much the same reason for their refusal to be promoted over the trees; or, as the margin reads it, to go up and down for the trees. To rule, involves a man in a great deal both of toil and care. Those who are preferred to public trust and power, must forego all private interests and advantages, for the good of others. And those advanced to honour and dignity, are in great danger of losing their fruitfulness. For which reason, they that desire to do good, are afraid of being too great. Jotham compares Abimelech to the bramble or thistle, a worthless plant, whose end is to be burned. Such a one was Abimelech.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Honour God and man - Alluding to the constant use of oil in the meat-offerings ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:1-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in the holy ointment ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In like manner, the allusion in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to the drink-offerings of wine. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jud 9:7-21. Jotham by a Parable Reproaches Them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7. he … stood in the top of mount Gerizim and lifted up his voice—The spot he chose was, like the housetops, the public place of Shechem; and the parable [Jud 9:8-15] drawn from the rivalry of the various trees was appropriate to the diversified foliage of the valley below. Eastern people are exceedingly fond of parables and use them for conveying reproofs, which they could not give in any other way. The top of Gerizim is not so high in the rear of the town, as it is nearer to the plain. With a little exertion of voice, he could easily have been heard by the people of the city; for the hill so overhangs the valley, that a person from the side or summit would have no difficulty in speaking to listeners at the base. Modern history records a case, in which soldiers on the hill shouted to the people in the city and endeavored to instigate them to an insurrection. There is something about the elastic atmosphere of an Eastern clime which causes it to transmit sound with wonderful celerity and distinctness [Hackett].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My sweetness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for which that fruit is particularly commended. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the fig tree said unto them,.... Rejecting the offer made: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "should I forsake my sweetness and my good fruit; for such the fruit of the fig tree is, sweet and good: so Julian (d) the emperor shows from various authors, Aristophanes, Herodotus, and Homer, that nothing is sweeter than figs, excepting honey, and that no kind of fruit is better, and, where they are, no good is wanting: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and go to be promoted over the trees? the same is designed by this as the former. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Opera, par. 2. ep. 24. Sarapioni, p. 142. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Opera, par. 2. ep. 24. Sarapioni, p. 142. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my sweetness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The early ripe fig, especially, was and is esteemed for its flavour; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Judges 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Jotham, who had escaped after the murder, was told of the election which had taken place, he went to the top of Mount Gerizim, which rises as a steep wall of rock to the height of about 800 feet above the valley of Shechem on the south side of the city (Rob. iii. p. 96), and cried with a loud voice, \"Hearken to me, ye lords of Shechem, and God will also hearken to you.\" After this appeal, which calls to mind the language of the prophets, he uttered aloud a fable of the trees which wanted to anoint a king over them-a fable of true prophetic significance, and the earliest with which we are acquainted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:8-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To the appeal which is made to them in succession to become king over the trees, the olive tree, the fig tree, and the vine all reply: Shall we give up our calling, to bear valuable fruits for the good and enjoyment of God and men, and soar above the other trees? The briar, however, to which the trees turn last of all, is delighted at the unexpected honour that is offered it, and says, \"Will ye in truth anoint me king over you? Then come and trust in my shadow; but if not, let fire go out of the briar and consume the cedars of Lebanon.\" The rare form מלוכה (Chethib, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") also occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : see Ewald, 228, b.). מלכי (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is also rare (see Ewald, 226, b). The form החדלתּי (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which is quite unique, is not \"Hophal or Hiphil, compounded of ההחד or ההחד\" (Ewald, 51, c), for neither the Hophal nor the Hiphil of חדל occurs anywhere else; but it is a simple Kal, and the obscure o sound is chosen instead of the a sound for the sake of euphony, i.e., to assist the pronunciation of the guttural syllables which follow one after another. The meaning of the fable is very easy to understand. The olive tree, fig tree, and vine do not represent different historical persons, such as the judges Othniel, Deborah, and Gideon, as the Rabbins affirm, but in a perfectly general way the nobler families or persons who bring forth fruit and blessing in the calling appointed them by God, and promote the prosperity of the people and kingdom in a manner that is well-pleasing to God and men. Oil, figs, and wine were the most valuable productions of the land of Canaan, whereas the briar was good for nothing but to burn. The noble fruit-trees would not tear themselves from the soil in which they had been planted and had borne fruit, to soar (נוּע, float about) above the trees, i.e., not merely to rule over the trees, but obire et circumagi in rebus eorum curandis. נוּע includes the idea of restlessness and insecurity of existence. The explanation given in the Berleb. Bible, \"We have here what it is to be a king, to reign or be lord over many others, namely, very frequently to do nothing else than float about in such restlessness and distraction of thoughts, feelings, and desires, that very little good or sweet fruit ever falls to the ground,\" if not a truth without exception so far as royalty is concerned, is at all events perfectly true in relation to what Abimelech aimed at and attained, to be a king by the will of the people and not by the grace of God. Wherever the Lord does not found the monarchy, or the king himself does not lay the foundations of his government in God and the grace of God, he is never anything but a tree, moving about above other trees without a firm root in a fruitful soil, utterly unable to bear fruit to the glory of God and the good of men. The expression \"all the trees\" is to be carefully noticed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"All the trees\" say to the briar, Be king over us, whereas in the previous verse only \"the trees\" are mentioned. This implies that of all the trees not one was willing to be king himself, but that they were unanimous in transferring the honour to the briar. The briar, which has nothing but thorns upon it, and does not even cast sufficient shadow for any one to lie down in its shadow and protect himself from the burning heat of the sun, is an admirable simile for a worthless man, who can do nothing but harm. The words of the briar, \"Trust in my shadow,\" seek refuge there, contain a deep irony, the truth of which the Shechemites were very soon to discover. \"And if not,\" i.e., if ye do not find the protection you expect, fire will go out of the briar and consume the cedars of Lebanon, the largest and noblest trees. Thorns easily catch fire (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The most insignificant and most worthless man can be the cause of harm to the mightiest and most distinguished. ",
        "children": []
      }
    ]
  }
]