[{"header":"Chapter 13"},{"num":1,"verse":"The Crime of Amnon. Sometime later the following events occurred. David’s son Absalom had a beautiful sister whose name was Tamar, and David’s son Amnon fell madly in love with her."},{"num":2,"verse":"Amnon was obsessed with her to the point that he became ill because of his love for his sister Tamar, since she was a virgin and Amnon felt it was impossible for him even to approach her."},{"num":3,"verse":"However, Amnon had a friend whose name was Jonadab. He was the son of David’s brother Shimeah, and he was an extremely devious man."},{"num":4,"verse":"He asked Amnon: “O son of the king, why do you appear to be so depressed morning after morning? Will you not tell me?” Amnon replied: “I am in love with Tamar, the sister of my brother Absalom.”"},{"num":5,"verse":"Then Jonadab said to him: “Lie down on your bed and pretend to be ill. When your father comes to visit you, say to him: ‘Please let my sister come and give me something to eat. Ask her to prepare the food in my presence for me to see and then eat it from her hand.’ ”"},{"num":6,"verse":"And so Amnon lay down and pretended to be ill. When the king came to visit him, Amnon said: “Please let my sister Tamar come and make some cakes before my eyes so that I can receive some nourishment from her hand.”"},{"num":7,"verse":"Then David sent a message to Tamar in the palace, saying: “Go to your brother Amnon’s house and prepare some food for him.”"},{"num":8,"verse":"Therefore, Tamar went to the house of her brother Amnon and found him lying in bed. She took dough and kneaded it, made some cakes while he watched, and baked the cakes."},{"num":9,"verse":"Then Tamar took the pan and set out the cakes before him, but he refused to eat and ordered everyone else to leave the room."},{"num":10,"verse":"Thereupon, Amnon said to Tamar: “Bring the food into the bedroom so that I may eat from your hand.” Therefore, Tamar took the cakes she had made and brought them into the bedroom to Amnon her brother."},{"num":11,"verse":"However, when she offered them to him to eat, he took hold of her and said: “Come to bed with me, my sister.”"},{"num":12,"verse":"She answered him: “No, my brother! Do not force me! Such repulsive acts are not done in Israel. Do not commit such a vile act!"},{"num":13,"verse":"And as for me, where could I go to hide my shame? Moreover, you would be disgraced in Israel. Therefore, I beg you to speak to the king. He will not refuse you permission to marry me.”"},{"num":14,"verse":"Despite her entreaty, he would not listen to her. Rather, he overpowered her and raped her."},{"num":15,"verse":"Then Amnon was seized with intense hatred for her, a hatred that was far greater than the love he had had for her. “Get up and leave,” he said."},{"num":16,"verse":"But she answered: “No, my brother. If you send me away, that would be an even greater wrong than the other wrong you perpetrated against me.” However, he refused to listen to her."},{"num":17,"verse":"Then Amnon summoned his personal attendant and said: “Take this woman out of my presence and bolt the door after her!”"},{"num":18,"verse":"She was wearing a long gown with sleeves, for this is how the virgin daughters of the king were clothed in those days."},{"num":19,"verse":"Tamar put ashes on her head and tore the long gown that she was wearing. Then, putting her hand on her head, she went away, weeping loudly."},{"num":20,"verse":"Her brother Absalom said to her: “Has your brother Amnon been with you? Be quiet now, my sister. He is your brother. Do not take this to heart.” Then Tamar, forlorn and inconsolable, went to live in the house of her brother Absalom."},{"num":21,"verse":"When King David learned about all this, he became extremely angry. However, he did not punish his son Amnon because he was his firstborn and he loved him."},{"num":22,"verse":"But Absalom refused to say a single word to Amnon, either good or bad, since he hated Amnon because he had raped his sister Tamar."},{"num":23,"verse":"Absalom’s Plot. Two years later, when Absalom had sheep-shearers at Baal-hazor, near Ephraim, he invited all of the king’s sons."},{"num":24,"verse":"Absalom went to the king and said: “Your servant has summoned the sheep-shearers to work. Will your majesty and his retinue please come?”"},{"num":25,"verse":"The king replied: “No, my son. If we all were to go, we would prove to be a burden to you.” Absalom continued to urge him, but the king still refused to go, although he gave him his blessing."},{"num":26,"verse":"Absalom then said: “If you will not come, then please allow my brother Amnon to go with us.” The king replied: “Why should he go with you?”"},{"num":27,"verse":"However, Absalom continued to urge him, until finally the king allowed Amnon and all the other princes to go."},{"num":28,"verse":"Absalom prepared a feast fit for a king, and he instructed his servants: “Watch carefully! When Amnon is merry with wine and I say to you: ‘Strike down Amnon,’ then slay him. Do not be afraid. You will simply be obeying my command. Be courageous and act valiantly!”"},{"num":29,"verse":"The Death of Amnon. When the servants of Absalom did to Amnon as Absalom had commanded, then all of the king’s sons leapt to their feet, mounted their mules, and fled."},{"num":30,"verse":"While they were still on the road, a report came to David that Absalom had slain all of the king’s sons and that not a single one of them had survived."},{"num":31,"verse":"The king stood up, tore his garments, and threw himself on the ground. All of his servants who were standing around him also tore their garments."},{"num":32,"verse":"However, Jonadab, the son of David’s brother Shimeah, said: “Let not my lord think that all the young princes, the sons of the king, have been killed. Amnon alone is dead, for Absalom has been determined to exact vengeance ever since the day that Amnon raped his sister Tamar."},{"num":33,"verse":"Therefore, my lord the king should not believe the report that all of the king’s sons are dead. Only Amnon is dead.”"},{"num":34,"verse":"Meanwhile Absalom had fled. When the man on sentry duty looked up, he saw a large group of people coming down the hill from the direction of Horonaim. Immediately he hastened to the king and reported: “I have seen men coming down the hill from Horonaim.”"},{"num":35,"verse":"Jonadab said to the king: “Behold, the king’s sons have returned, just as I said they would.”"},{"num":36,"verse":"No sooner had he finished speaking than the king’s sons arrived, weeping aloud. The king and all his servants also wept bitterly."},{"num":37,"verse":"Absalom, who had taken flight, went to Talmai, the son of Ammihud, the king of Geshur,"},{"num":38,"verse":"and he remained in Geshur for three years."},{"num":39,"verse":"Efforts for Absalom’s Return. During all that time, David mourned over his son, but once he became reconciled to the death of Amnon, he yearned to be reconciled with Absalom."}]