[{"header":"Chapter 7"},{"num":1,"verse":"Do Not Judge. “Do not judge, so that you in turn may not be judged."},{"num":2,"verse":"For you will be judged in the same way that you judge others, and the measure that you use for others will be used to measure you."},{"num":3,"verse":"“Why do you take note of the splinter in your brother’s eye but do not notice the wooden plank in your own eye?"},{"num":4,"verse":"How can you say to your brother, ‘Let me remove that splinter from your eye,’ while all the time the wooden plank remains in your own?"},{"num":5,"verse":"You hypocrite! First remove the wooden plank from your own eye, and then you will be able to see clearly enough to remove the splinter from your brother’s eye."},{"num":6,"verse":"Do Not Profane Sacred Things. “Do not give to dogs anything that is holy. And do not cast your pearls before swine, lest they trample them under their feet and then proceed to tear you to pieces."},{"num":7,"verse":"Ask, Seek, Knock. “Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you."},{"num":8,"verse":"For everyone who asks will receive, and those who seek will find, and to those who knock the door will be opened."},{"num":9,"verse":"“Is there anyone among you who would give a stone to his son if he asks for bread,"},{"num":10,"verse":"or hand him a snake if he asks for a fish?"},{"num":11,"verse":"If you then, despite your evil nature, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask him!"},{"num":12,"verse":"The Golden Rule of Love.“In everything, deal with others as you would like them to deal with you. This is the Law and the Prophets."},{"num":13,"verse":"The Two Ways.“Enter through the narrow gate, for the gate is wide and the road broad that leads to destruction, and those who enter through it are many."},{"num":14,"verse":"But small is the gate and narrow the road that leads to life, and those who find it are few in number."},{"num":15,"verse":"False Prophets and True Disciples.“Be on guard against false prophets who come to you disguised in sheep’s clothing, but who inwardly are ravenous wolves."},{"num":16,"verse":"By their fruits you will know them. Does one pick grapes from thornbushes or figs from thistles?"},{"num":17,"verse":"In the same way, every good tree bears good fruit, but a rotten tree produces bad fruit."},{"num":18,"verse":"A good tree cannot bear bad fruit, nor can a bad tree bear good fruit."},{"num":19,"verse":"Every tree that does not bear good fruit is cut down and thrown into the fire."},{"num":20,"verse":"Thus, by their fruits you will know them."},{"num":21,"verse":"“Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but only the one who does the will of my heavenly Father."},{"num":22,"verse":"Many will say to me on that day, ‘Lord, Lord, did we not prophesy in your name? Did we not drive out demons in your name? Did we not perform many miracles in your name?’"},{"num":23,"verse":"Then I will tell them plainly, ‘I never knew you. Depart from me, you evildoers!’"},{"num":24,"verse":"The Wise and Foolish Builders.“Everyone who hears these words of mine and acts in accordance with them will be like a wise man who constructed his house on a rock foundation."},{"num":25,"verse":"The rain came down, the flood waters rose, and fierce winds battered that house. However, it did not collapse, because it had its foundations on rock."},{"num":26,"verse":"“In contrast, everyone who hears these words of mine and does not act in accordance with them will be like a fool who constructed his house on a foundation of sand."},{"num":27,"verse":"The rain came down, the flood waters rose, and the winds blew and buffeted that house. And it collapsed with a great crash.”"},{"num":28,"verse":"The Authority of Jesus. When Jesus had finished this discourse, the crowds were astounded at his teaching,"},{"num":29,"verse":"because he taught them as one who had authority, and not as their scribes."}]