[{"header":"Judging Others"},{"num":7,"verse":"“Do not judge, so that you may not be judged. "},{"num":2,"verse":"For with the judgment you make you will be judged, and the measure you give will be the measure you get. "},{"num":3,"verse":"Why do you see the speck in your neighbor’s eye, but do not notice the log in your own eye? "},{"num":4,"verse":"Or how can you say to your neighbor, ‘Let me take the speck out of your eye,’ while the log is in your own eye? "},{"num":5,"verse":"You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your neighbor’s eye."},{"header":"Profaning the Holy"},{"num":6,"verse":"“Do not give what is holy to dogs; and do not throw your pearls before swine, or they will trample them under foot and turn and maul you."},{"header":"Ask, Search, Knock"},{"num":7,"verse":"“Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you. "},{"num":8,"verse":"For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. "},{"num":9,"verse":"Is there anyone among you who, if your child asks for bread, will give a stone? "},{"num":10,"verse":"Or if the child asks for a fish, will give a snake? "},{"num":11,"verse":"If you then, who are evil, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask him!"},{"header":"The Golden Rule"},{"num":12,"verse":"“In everything do to others as you would have them do to you; for this is the law and the prophets."},{"header":"The Narrow Gate"},{"num":13,"verse":"“Enter through the narrow gate; for the gate is wide and the road is easy that leads to destruction, and there are many who take it. "},{"num":14,"verse":"For the gate is narrow and the road is hard that leads to life, and there are few who find it."},{"header":"A Tree and Its Fruit"},{"num":15,"verse":"“Beware of false prophets, who come to you in sheep’s clothing but inwardly are ravenous wolves. "},{"num":16,"verse":"You will know them by their fruits. Are grapes gathered from thorns, or figs from thistles? "},{"num":17,"verse":"In the same way, every good tree bears good fruit, but the bad tree bears bad fruit. "},{"num":18,"verse":"A good tree cannot bear bad fruit, nor can a bad tree bear good fruit. "},{"num":19,"verse":"Every tree that does not bear good fruit is cut down and thrown into the fire. "},{"num":20,"verse":"Thus you will know them by their fruits."},{"header":"Concerning Self-Deception"},{"num":21,"verse":"“Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but only the one who does the will of my Father in heaven. "},{"num":22,"verse":"On that day many will say to me, ‘Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many deeds of power in your name?’ "},{"num":23,"verse":"Then I will declare to them, ‘I never knew you; go away from me, you evildoers.’"},{"header":"Hearers and Doers"},{"num":24,"verse":"“Everyone then who hears these words of mine and acts on them will be like a wise man who built his house on rock. "},{"num":25,"verse":"The rain fell, the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on rock. "},{"num":26,"verse":"And everyone who hears these words of mine and does not act on them will be like a foolish man who built his house on sand. "},{"num":27,"verse":"The rain fell, and the floods came, and the winds blew and beat against that house, and it fell—and great was its fall!”"},{"num":28,"verse":"Now when Jesus had finished saying these things, the crowds were astounded at his teaching, "},{"num":29,"verse":"for he taught them as one having authority, and not as their scribes."}]