[{"num":7,"verse":"“Don’t criticize, and then you won’t be criticized. "},{"num":2,"verse":"For others will treat you as you treat them. "},{"num":3,"verse":"And why worry about a speck in the eye of a brother when you have a board in your own? "},{"num":4,"verse":"Should you say, ‘Friend, let me help you get that speck out of your eye,’ when you can’t even see because of the board in your own? "},{"num":5,"verse":"Hypocrite! First get rid of the board. Then you can see to help your brother."},{"num":6,"verse":"“Don’t give holy things to depraved men. Don’t give pearls to swine! They will trample the pearls and turn and attack you."},{"num":7,"verse":"“Ask, and you will be given what you ask for. Seek, and you will find. Knock, and the door will be opened. "},{"num":8,"verse":"For everyone who asks, receives. Anyone who seeks, finds. If only you will knock, the door will open. "},{"num":9,"verse":"If a child asks his father for a loaf of bread, will he be given a stone instead? "},{"num":10,"verse":"If he asks for fish, will he be given a poisonous snake? Of course not! "},{"num":11,"verse":"And if you hard-hearted, sinful men know how to give good gifts to your children, won’t your Father in heaven even more certainly give good gifts to those who ask him for them?"},{"num":12,"verse":"“Do for others what you want them to do for you. This is the teaching of the laws of Moses in a nutshell."},{"num":13,"verse":"“Heaven can be entered only through the narrow gate! The highway to hell is broad, and its gate is wide enough for all the multitudes who choose its easy way. "},{"num":14,"verse":"But the Gateway to Life is small, and the road is narrow, and only a few ever find it."},{"num":15,"verse":"“Beware of false teachers who come disguised as harmless sheep, but are wolves and will tear you apart. "},{"num":16,"verse":"You can detect them by the way they act, just as you can identify a tree by its fruit. You need never confuse grapevines with thorn bushes or figs with thistles. "},{"num":17,"verse":"Different kinds of fruit trees can quickly be identified by examining their fruit. "},{"num":18,"verse":"A variety that produces delicious fruit never produces an inedible kind. And a tree producing an inedible kind can’t produce what is good. "},{"num":19,"verse":"So the trees having the inedible fruit are chopped down and thrown on the fire. "},{"num":20,"verse":"Yes, the way to identify a tree or a person is by the kind of fruit produced."},{"num":21,"verse":"“Not all who sound religious are really godly people. They may refer to me as ‘Lord,’ but still won’t get to heaven. For the decisive question is whether they obey my Father in heaven. "},{"num":22,"verse":"At the Judgment many will tell me, ‘Lord, Lord, we told others about you and used your name to cast out demons and to do many other great miracles.’ "},{"num":23,"verse":"But I will reply, ‘You have never been mine. Go away, for your deeds are evil.’"},{"num":24,"verse":"“All who listen to my instructions and follow them are wise, like a man who builds his house on solid rock. "},{"num":25,"verse":"Though the rain comes in torrents, and the floods rise and the storm winds beat against his house, it won’t collapse, for it is built on rock."},{"num":26,"verse":"“But those who hear my instructions and ignore them are foolish, like a man who builds his house on sand. "},{"num":27,"verse":"For when the rains and floods come, and storm winds beat against his house, it will fall with a mighty crash.” "},{"num":28,"verse":"The crowds were amazed at Jesus’ sermons, "},{"num":29,"verse":"for he taught as one who had great authority, and not as their Jewish leaders."}]