[{"header":"Do Not Judge"},{"num":7,"verse":"“Refuse to be a critic full of bias toward others, and you will not be judged. "},{"num":2,"verse":"For you’ll be judged by the same standard that you’ve used to judge others. The measurement you use on them will be used on you. "},{"num":3,"verse":"Why would you focus on the flaw in someone else’s life and fail to notice the glaring flaws of your own? "},{"num":4,"verse":"How could you say to your friend, ‘Let me show you where you’re wrong,’ when you’re guilty of even more? "},{"num":5,"verse":"You’re being hypercritical and a hypocrite! First acknowledge and deal with your own ‘blind spots,’ and then you’ll be capable of dealing with the ‘blind spot’ of your friend."},{"num":6,"verse":"“Who would hang earrings on a dog’s ear or throw pearls in front of wild pigs? They’ll only trample them under their feet and then turn around and tear you to pieces!"},{"num":7,"verse":"“Ask, and the gift is yours. Seek, and you’ll discover. Knock, and the door will be opened for you. "},{"num":8,"verse":"For every persistent one will get what he asks for. Every persistent seeker will discover what he longs for. And everyone who knocks persistently will one day find an open door."},{"num":9,"verse":"“Do you know of any parent who would give his hungry child, who asked for food, a plate of rocks instead? "},{"num":10,"verse":"Or when asked for a piece of fish, what parent would offer his child a snake instead? "},{"num":11,"verse":"If you, imperfect as you are, know how to lovingly take care of your children and give them what’s best, how much more ready is your heavenly Father to give wonderful gifts to those who ask him?”"},{"header":"The Golden Rule"},{"num":12,"verse":"“In everything you do, be careful to treat others in the same way you’d want them to treat you, for that is the essence of all the teachings of the Law and the Prophets."},{"num":13,"verse":"Enter through the narrow gate because the wide gate and broad path is the way that leads to destruction—nearly everyone chooses that crowded road! "},{"num":14,"verse":"The narrow gate and the difficult way leads to eternal life—so few even find it!”"},{"header":"False Prophets"},{"num":15,"verse":"“Constantly be on your guard against phony prophets. They come disguised as lambs, appearing to be genuine, but on the inside they are like wild, ravenous wolves! "},{"num":16,"verse":"You can spot them by their actions, for the fruits of their character will be obvious. You won’t find sweet grapes hanging on a thorn bush, and you’ll never pick good fruit from a tumbleweed. "},{"num":17,"verse":"So if the tree is good, it will produce good fruit; but if the tree is bad, it will bear only rotten fruit and deserves to be cut down and burned. "},{"num":20,"verse":"You’ll know them by the obvious fruit of their lives and ministries.”"},{"header":"Jesus Warns of Pretenders"},{"num":21,"verse":"“Not everyone who says to me, ‘Lord, Lord,’ will enter into heaven’s kingdom. It is only those who persist in doing the will of my heavenly Father. "},{"num":22,"verse":"On the day of judgment many will say to me, ‘Lord, Lord, don’t you remember us? Didn’t we prophesy in your name? Didn’t we cast out demons and do many miracles in your name?’ "},{"num":23,"verse":"But I will have to say to them, ‘Go away from me, you lawless rebels! I’ve never been joined to you!’"},{"num":24,"verse":"“Everyone who hears my teaching and applies it to his life can be compared to a wise man who built his house on an unshakable foundation. "},{"num":25,"verse":"When the rains fell and the flood came, with fierce winds beating upon his house, it stood firm because of its strong foundation."},{"num":26,"verse":"“But everyone who hears my teaching and does not apply it to his life can be compared to a foolish man who built his house on sand. "},{"num":27,"verse":"When it rained and rained and the flood came, with wind and waves beating upon his house, it collapsed and was swept away.”"},{"num":28,"verse":"By the time Jesus finished speaking, the crowds were awestruck by his teaching, "},{"num":29,"verse":"because his words carried such great authority, quite unlike the religious scholars."}]