[{"num":7,"verse":"Do not judge others, then you will not be judged."},{"num":2,"verse":"The way you judge others, that is the way you will be judged. How much you give to others is how much will be given to you."},{"num":3,"verse":"`Why do you look at the spot of dust in your brother's eye? But you do not see a big stick in your own eye!"},{"num":4,"verse":"Why do you say to your brother, \"Let me take the dust out of your eye\"? And all the time you have that stick in your own eye!"},{"num":5,"verse":"You are not true to yourselves! First take the stick out of your own eye. Then you will be able to see to take the dust out of your brother's eye."},{"num":6,"verse":"`Do not give what is holy to dogs. Do not throw your fine stones to pigs. They will walk all over them, and then turn and hurt you.'"},{"num":7,"verse":"`Ask, and you will get what you ask for. Look, and you will find what you look for. Knock, and the door will be opened for you."},{"num":8,"verse":"Everyone who asks will get. The one who looks will find. And the one who knocks will have the door opened for him."},{"num":9,"verse":"`If your son asks for bread, will any of you give him a stone?"},{"num":10,"verse":"Or if he asks for a fish, will you give him a snake?"},{"num":11,"verse":"You are wrong, and yet you know how to give good things to your children. Much more, your Father in heaven will give good things to those who ask him."},{"num":12,"verse":"`Do to other people what you want them to do to you. That is what the law and the writings of the prophets say.'"},{"num":13,"verse":"`Go in by the small gate. The gate is big and the road is wide that goes to death. Many people go that way."},{"num":14,"verse":"The gate is small and the road is not wide that goes to life. Not many people find it.'"},{"num":15,"verse":"`Take care. There are prophets who are not true. They come to you dressed like sheep, but inside they are like wolves, bad animals that kill sheep."},{"num":16,"verse":"You will know them by the things they do. People do not pick fruit like grapes from thistles. They do not pick fruit like figs from thorn trees."},{"num":17,"verse":"In the same way, every good tree has good fruit. But a bad tree has bad fruit."},{"num":18,"verse":"A good tree cannot have bad fruit, and a bad tree cannot have good fruit."},{"num":19,"verse":"Every tree that does not have good fruit is cut down and thrown into a fire."},{"num":20,"verse":"So you will know them by the things they do, good or bad fruit.'"},{"num":21,"verse":"`Some people say to me, \"Lord, Lord\". But not all who say that will go into the kingdom of heaven. Only those who do what my Father in heaven wants, will go in."},{"num":22,"verse":"Many people will say to me on that day, \"Lord, Lord, did we not speak in your name? Did we not drive bad spirits out of people in your name? Did we not do big works in your name?\""},{"num":23,"verse":"Then I will say to them, \"I never knew you. Go away from me! What you do is very wrong!\" '"},{"num":24,"verse":"`Everyone who hears what I say and obeys me will be like a man who has good sense. He built his house on a rock."},{"num":25,"verse":"It rained hard. The water in the rivers came up high. The winds were strong and beat on the house. But it did not fall down. It was built on a rock."},{"num":26,"verse":"But everyone who hears what I say and does not obey me, will be like a man who has no sense. He built his house on the sand."},{"num":27,"verse":"It rained hard. The water in the rivers came up high. The winds were strong and beat on the house. It fell down with a loud noise!'"},{"num":28,"verse":"Jesus finished saying all these things. The people were surprised at his teaching."},{"num":29,"verse":"He taught them as if he had the right to teach them. He did not teach like their scribes."}]