[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His cheeks are as a bed of spices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Probably with allusion to the beard perfumed (Marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "towers of perfumes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 133:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lilies.—Comp. “He pressed the blossom of his lips to mine “(Tennyson, (Enone).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Lilies.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Comp. “He pressed the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "blossom ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of his lips to mine “(Tennyson, (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Enone",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:9-16 Even those who have little acquaintance with Christ, cannot but see amiable beauty in others who bear his image. There are hopes of those who begin to inquire concerning Christ and his perfections. Christians, who are well acquainted with Christ themselves, should do all they can to make others know something of him. Divine glory makes him truly lovely in the eyes of all who are enlightened to discern spiritual things. He is white in the spotless innocence of his life, ruddy in the bleeding sufferings he went through at his death. This description of the person of the Beloved, would form, in the figurative language of those times, a portrait of beauty of person and of grace of manners; but the aptness of some of the allusions may not appear to us. He shall come to be glorified in his saints, and to be admired in all that believe. May his love constrain us to live to his glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sweet flowers - Better as in the margin, i. e., plants with fragrant leaves and flowers trained on trellis-work.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Like lilies - Are lilies dropping liquid myrrh (see the Sol 5:5 note). Perhaps the fragrance of the flowers, or the delicate curl of the lip-like petals, is here the point of comparison, rather than the color. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Like lilies - Are lilies dropping liquid myrrh (see the Sol 5:5 note). Perhaps the fragrance of the flowers, or the delicate curl of the lip-like petals, is here the point of comparison, rather than the color. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. cheeks—the seat of beauty, according to the Hebrew meaning [Gesenius]. Yet men smote and spat on them (Isa 50:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bed—full, like the raised surface of the garden bed; fragrant with ointments, as beds with aromatic plants (literally, \"balsam\").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sweet flowers—rather, \"terraces of aromatic herbs\"—\"high-raised parterres of sweet plants,\" in parallelism to \"bed,\" which comes from a Hebrew root, meaning \"elevation.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lips—(Ps 45:2; Joh 7:46).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lilies—red lilies. Soft and gentle (1Pe 2:22, 23). How different lips were man's (Ps 22:7)!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dropping … myrrh—namely, His lips, just as the sweet dewdrops which hang in the calyx of the lily.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His cheeks; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his face or countenance, an eminent part whereof is the cheeks, in which the beauty or deformity of a face doth much consist. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a bed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which being higher than other parts of the garden, fitly represents the cheeks, which are higher than other parts of the face. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of spices; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not of dry spices, for they are not in beds; but of aromatical flowers, which delight both the eye with a pleasant prospect, and the smell with their fragrancy. This may also signify the down or hair upon the Bridegroom’s cheeks, which is the evidence of his mature and vigorous age, and may denote that Christ’s sweetness and gentleness is accompanied with majesty, and gravity, and just severity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sweet flowers:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this may be added to explain the former phrase. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "towers of perfumes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. boxes in which perfumes were put, which by their height or form had some resemblance to a turret. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His lips like lilies; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " beautiful and pleasant. Or this is meant of that sort of lilies which were of a red or purple colour, as ancient writers affirm, and so signify the grateful colour of the lips. This may note that grace which was poured into Christ’s lips, and which flowed from them in sweet and excellent discourses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Dropping sweet smelling myrrh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only graceful to the eye, as lilies are, but also fragrant to the smell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His cheeks are as a bed of spices, as sweet flowers,.... Which may intend the presence of Christ with his people in his word and ordinances; often called his \"face\", which he shows, and they seek after, than which nothing is more desirable; walking in the light of his countenance is preferable to walking among spicy beds, where fragrant plants and odoriferous flowers grow: or the cheeks, being the seat of modesty and blushing, may denote the great humility of Christ, seen in his assumption of our nature, throughout the whole course of his life, and especially at his death, and which renders him very delightful to his people; how lovely does the meek and lowly Jesus look! how beautiful are those blushing cheeks of his, who, being equal with God, took upon him the form of a servant! The cheeks may intend not bare cheeks, but with the hair growing upon them, the hair of the beard; which puts forth itself, and grows upon the cheeks or \"jaws\" (o), as it may be rendered, which makes a man look graceful and majestic; so Aben Ezra interprets the word of the beard, and so many Christian (p) interpreters, which puts out like aromatic plants on spicy beds. This was literally true of Christ, who was a grown man when he suffered, and gave his cheeks to the smiters, and who plucked off the hair of his beard: and in a mystical sense it may intend either believers in Christ, who are the hair of his cheeks, as well as of his head; and who, like spicy beds and fragrant flowers, are odoriferous to Christ and to one another; or \"as towers of perfumes\" (q) as some, which ascend upwards in the exercise of faith, hope, and love: or rather the graces of the Spirit in Christ, as man and Mediator; which, like the hair of the beard, are in Christ, in great numbers, without measure, and make him very lovely and graceful; and are like beds of spices and sweet flowers, for the variety and sweet smelling savour of them. Though it seems, best of all, to be expressive of the manliness, courage, prudence, gravity, and majesty of Christ; of which the beard, thick set and well grown, is an indication; all which appeared in the whole conduct and deportment of Christ among men; in his ministry, in his life and conversation, at his apprehension, arraignment, condemnation, sufferings, and death. The cheeks rising, and being a little elevated, are fitly described by beds in a garden, by \"towers of perfumes\", or fragrant flowers and fruit trees, reared up in the form of towers, or pyramids; or by a dish of fruit preserves, placed in such a figure: and the hair of the cheeks, or beard, are aptly represented by spices, rising up from a bed of them; and all denote the beauty, savour, and majesty of Christ. Or, as the Vulgate Latin version, \"as beds of spices set by confectioners\"; not as aromatic plants, set in rows by the gardener; but the spices themselves, set in rows by the confectioner in vessels (r), placed in his shop in rows to be sold; which being of various colours, especially white and red, the cheeks, for colour and eminence, are compared unto them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his lips like lilies dropping sweet smelling myrrh; by which are meant the words of Christ, which drop from his lips; which are like lilies, for their purity, thinness, and beautiful colour: the words of Christ are pure words, free from all pollution, deceit, and human mixtures; nor are his lips big with his own praises, but with expressions of regard for his Father's glory; and are very pleasant, gracious, and graceful. But then the comparison is not between them and white lilies, for not white, but red lips, are accounted the most beautiful; see Sol 4:3; wherefore rather red or purple lilies are respected, such as Pliny (s), and other writers (t), speak of; such as grew in Syria (u), a neighbouring country; and also in Egypt (w) grew lilies like to roses. Some (x) think the allusion is to crowns, made of red or purple lilies, wore at nuptial festivals, on which were poured oil of myrrh, and so dropped from them; but the phrase, \"dropping sweet smelling myrrh\", is not in construction with \"lilies\", but with \"lips\": signifying, that the lips or words of Christ were like to lilies; not so much or not only for their thinness and colour, as for the sweet smell of them, very odorous, grateful, and acceptable; as are the doctrines of peace, pardon, righteousness, life, and salvation, to sensible souls, delivered in the ministry of the word: the manner of which delivery of them is expressed by \"dropping\"; gradually, by little and little, as Christ's church and people can bear them; seasonably, and at proper times, as their wants require constantly, as while Christ was here or, earth, so now he is in heaven, by his ministers, in all ages, to the end of the world; and yet sweetly and gently refreshing, and making fruitful; see Deuteronomy 32:2. Moreover, the kisses of Christ's lips, or the manifestations of his love, may be taken into the sense of this clause; which together with the grateful matter and graceful manner of his words, render him very acceptable to his church; see Sol 1:2; and such a sentiment is expressed, in much the same language, by others (y). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "his lips like lilies dropping sweet smelling myrrh; by which are meant the words of Christ, which drop from his lips; which are like lilies, for their purity, thinness, and beautiful colour: the words of Christ are pure words, free from all pollution, deceit, and human mixtures; nor are his lips big with his own praises, but with expressions of regard for his Father's glory; and are very pleasant, gracious, and graceful. But then the comparison is not between them and white lilies, for not white, but red lips, are accounted the most beautiful; see Sol 4:3; wherefore rather red or purple lilies are respected, such as Pliny (s), and other writers (t), speak of; such as grew in Syria (u), a neighbouring country; and also in Egypt (w) grew lilies like to roses. Some (x) think the allusion is to crowns, made of red or purple lilies, wore at nuptial festivals, on which were poured oil of myrrh, and so dropped from them; but the phrase, \"dropping sweet smelling myrrh\", is not in construction with \"lilies\", but with \"lips\": signifying, that the lips or words of Christ were like to lilies; not so much or not only for their thinness and colour, as for the sweet smell of them, very odorous, grateful, and acceptable; as are the doctrines of peace, pardon, righteousness, life, and salvation, to sensible souls, delivered in the ministry of the word: the manner of which delivery of them is expressed by \"dropping\"; gradually, by little and little, as Christ's church and people can bear them; seasonably, and at proper times, as their wants require constantly, as while Christ was here or, earth, so now he is in heaven, by his ministers, in all ages, to the end of the world; and yet sweetly and gently refreshing, and making fruitful; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moreover, the kisses of Christ's lips, or the manifestations of his love, may be taken into the sense of this clause; which together with the grateful matter and graceful manner of his words, render him very acceptable to his church; see Sol 1:2; and such a sentiment is expressed, in much the same language, by others (y). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) \"maxillae ejus\", Pagninus, Montanus, Marckius, Michaelis. (p) Sanctius, Cocceius, Ainsworth, Marckius, Michaelis. (q)  \"turribus pigmentorum\", Marckius; \"condimentorum\", Schmidt, Michaelis. (r) Vid. Fortunat. Scacchi Eleochrys. Sacr. l. 1. c. 18. p. 90. (s) Nat. Hist. l. 21. c. 5. (t) Theophrast. apud Athenaei Deipnosophist. l. 15. c. 8. p. 681. Maimon. in Misn. Sheviith, c. 7. s. 6. & Alshech in loc. Midrash Esther, s. 4. fol. 91. 1.((u) Dioscorides, l. 1. c. 163. Apud Fortunat. Scacch. ut supra, (Eleochrys. Sacr.) l. 1. c. 27. p. 134. (w) Herodot. Euterpe, sive l. 2. c. 92. (x) Scacch. ibid. l. 1. c. 28. p. 138, 139. (y) \"Olent tua basia myrrham\", Martial. Epigr. l. 2. Ep. 10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) \"maxillae ejus\", Pagninus, Montanus, Marckius, Michaelis. (p) Sanctius, Cocceius, Ainsworth, Marckius, Michaelis. (q)  \"turribus pigmentorum\", Marckius; \"condimentorum\", Schmidt, Michaelis. (r) Vid. Fortunat. Scacchi Eleochrys. Sacr. l. 1. c. 18. p. 90. (s) Nat. Hist. l. 21. c. 5. (t) Theophrast. apud Athenaei Deipnosophist. l. 15. c. 8. p. 681. Maimon. in Misn. Sheviith, c. 7. s. 6. & Alshech in loc. Midrash Esther, s. 4. fol. 91. 1.((u) Dioscorides, l. 1. c. 163. Apud Fortunat. Scacch. ut supra, (Eleochrys. Sacr.) l. 1. c. 27. p. 134. (w) Herodot. Euterpe, sive l. 2. c. 92. (x) Scacch. ibid. l. 1. c. 28. p. 138, 139. (y) \"Olent tua basia myrrham\", Martial. Epigr. l. 2. Ep. 10. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "His cheeks are as a bed of spices, as sweet flowers: his lips like lilies, dropping sweet smelling myrrh.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a bed of spices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a bed of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "balsam shrubs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Probably we should read the plur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beds",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to correspond with the plur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cheeks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Heb. for ‘bed’ is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘arûghâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " derived from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘âragh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘to mount up,’ and signifying a raised flower-bed. Cp. Driver on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel, Camb. Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 47. The points of comparison are the rounded form and the variegated colour.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as sweet flowers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is rather a paraphrase than a translation. As they stand, the Heb. words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mighdĕlôth merqâchîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mean ‘towers of perfume herbs.’ ‘Towers’ is taken to be a synonym of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘arûghôth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but if these are only raised garden-beds, this can hardly be. Probably we should read with the LXX, Targ. Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "meghaddĕlôth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mighdĕlôth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "rearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "producing perfumes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The point of the comparison is the growth of a perfumed beard on the cheeks.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "like ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lilies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The redness of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shôshannâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the point here. Tristram thinks it is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anemone coronaria",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sweet smelling myrrh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "liquid myrrh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V.), i.e. the finest myrrh, that oozes from the bark of itself. Cp. note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon 5:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Song of Solomon 5:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reference is to the perfume of the breath (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Song of Solomon 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13a His cheeks like a bed of sweet herbs,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "       Towers of spicy plants.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A flower-bed is called ערוּגה, from ערג, to be oblique, inclined. His cheeks are like such a soft raised bed, and the impression their appearance makes is like the fragrance which flows from such a bed planted with sweet-scented flowers. Migedaloth are the tower-like or pyramidal mounds, and merkahhim are the plants used in spicery. The point of comparison here is thus the soft elevation; perhaps with reference to the mingling of colours, but the word chosen (merkahhim) rather refers to the lovely, attractive, heart-refreshing character of the impression. The Venet., keeping close to the existing text: αἱ σιαγόνες αὐτοῦ ὡς πρασιὰ τοῦ ἀρώματος πύργοι ἀρωματισμῶν (thus not a̓ρωματιστῶν] according to Gebhardt's just conjecture). But is the punctuation here correct? The sing. כערוגת is explained from this, that the bed is presented as sloping from its height downward on two parallel sides; but the height would then be the nose dividing the face, and the plur. would thus be more suitable; and the lxx, Symm., and other ancient translators have, in fact, read כערוגת. But still less is the phrase migdeloth merkahhim to be comprehended; for a tower, however diminutive it may be, it not a proper figure for a soft elevation, nor even a graduated flowery walk, or a terraced flowery hill, - a tower always presents, however round one may conceive it, too much the idea of a natural chubbiness, or of a diseased tumour. Therefore the expression used by the lxx, φύουσαι μυρεψικά, i.e., מרק' מהדּלות, commends itself. Thus also Jerome: sicut areolae aromatum consitae a pigmentariis, and the Targ. (which refers לחיים allegorically to the לוּחי of the law, and merkahhim to the refinements of the Halacha): \"like the rows of a garden of aromatic plants which produce (gignentes) deep, penetrating sciences, even as a (magnificent) garden, aromatic plants.\" Since we read מגדּלות כערוגת, we do not refer migadloth, as Hitzig, who retains כערוגת, to the cheeks, although their name, like that of the other members (e.g., the ear, hand, foot), may be fem. (Bttch. 649), but to the beds of spices; but in this carrying forward of the figure we find, as he does, a reference to the beard and down on the cheeks. גּדּל is used of suffering the hair to grow, Numbers 6:5, as well as of cultivating plants; and it is a similar figure when Pindar, Nem. v. 11, compares the milk-hair of a young man to the fine woolly down of the expanding vine-leaves (vid., Passow). In merkahhim there scarcely lies anything further than that this flos juventae on the blooming cheeks gives the impression of the young shoots of aromatic plants; at all events, the merkahhim, even although we refer this feature in the figure to the fragrance of the unguents on the beard, are not the perfumes themselves, to which megadloth is not appropriate, but fragrant plants, so that in the first instance the growth of the beard is in view with the impression of its natural beauty.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A flower-bed is called ערוּגה, from ערג, to be oblique, inclined. His cheeks are like such a soft raised bed, and the impression their appearance makes is like the fragrance which flows from such a bed planted with sweet-scented flowers. Migedaloth are the tower-like or pyramidal mounds, and merkahhim are the plants used in spicery. The point of comparison here is thus the soft elevation; perhaps with reference to the mingling of colours, but the word chosen (merkahhim) rather refers to the lovely, attractive, heart-refreshing character of the impression. The Venet., keeping close to the existing text: αἱ σιαγόνες αὐτοῦ ὡς πρασιὰ τοῦ ἀρώματος πύργοι ἀρωματισμῶν (thus not a̓ρωματιστῶν] according to Gebhardt's just conjecture). But is the punctuation here correct? The sing. כערוגת is explained from this, that the bed is presented as sloping from its height downward on two parallel sides; but the height would then be the nose dividing the face, and the plur. would thus be more suitable; and the lxx, Symm., and other ancient translators have, in fact, read כערוגת. But still less is the phrase migdeloth merkahhim to be comprehended; for a tower, however diminutive it may be, it not a proper figure for a soft elevation, nor even a graduated flowery walk, or a terraced flowery hill, - a tower always presents, however round one may conceive it, too much the idea of a natural chubbiness, or of a diseased tumour. Therefore the expression used by the lxx, φύουσαι μυρεψικά, i.e., מרק' מהדּלות, commends itself. Thus also Jerome: sicut areolae aromatum consitae a pigmentariis, and the Targ. (which refers לחיים allegorically to the לוּחי of the law, and merkahhim to the refinements of the Halacha): \"like the rows of a garden of aromatic plants which produce (gignentes) deep, penetrating sciences, even as a (magnificent) garden, aromatic plants.\" Since we read מגדּלות כערוגת, we do not refer migadloth, as Hitzig, who retains כערוגת, to the cheeks, although their name, like that of the other members (e.g., the ear, hand, foot), may be fem. (Bttch. 649), but to the beds of spices; but in this carrying forward of the figure we find, as he does, a reference to the beard and down on the cheeks. גּדּל is used of suffering the hair to grow, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as well as of cultivating plants; and it is a similar figure when Pindar, Nem. v. 11, compares the milk-hair of a young man to the fine woolly down of the expanding vine-leaves (vid., Passow). In merkahhim there scarcely lies anything further than that this flos juventae on the blooming cheeks gives the impression of the young shoots of aromatic plants; at all events, the merkahhim, even although we refer this feature in the figure to the fragrance of the unguents on the beard, are not the perfumes themselves, to which megadloth is not appropriate, but fragrant plants, so that in the first instance the growth of the beard is in view with the impression of its natural beauty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "13b His lips lilies,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "       Dropping with liquid myrrh.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lilies, viz., red lilies (vid., under Sol 2:1), unless the point of comparison is merely loveliness associated with dignity. She thinks of the lips as speaking. All that comes forth from them, the breath in itself, and the breath formed into words, is עבר מור, most precious myrrh, viz., such as of itself wells forth from the bark of the balsamodendron. עבר, the running over of the eyes (cf. myrrha in lacrimis, the most highly esteemed sort, as distinguished from myrrha in granis), with which Dillmann combines the Aethiop. name for myrrh, karbê (vid., under Song _Num 5:5). ",
        "children": []
      }
    ]
  }
]