[{"header":"Property Rights"},{"num":22,"verse":"“If a man steals an ox or sheep and kills or sells it, he shall make restitution of five oxen for an ox or four sheep for a sheep."},{"num":2,"verse":"“If a thief is caught breaking in [after dark] and is struck [by the owner] so that he dies, there shall be no bloodguilt for him. "},{"num":3,"verse":"But if the sun has risen, there will be bloodguilt for him. The thief [if he lives] must make [full] restitution; if he has nothing, then he shall be sold [as a slave to make restitution] for his theft. "},{"num":4,"verse":"If the animal that he stole is found alive in his possession, whether it is ox or donkey or sheep, he shall pay double [for it]."},{"num":5,"verse":"“If a man causes a field or vineyard to be grazed bare or lets his livestock loose so that it grazes in another man’s field, he shall make restitution from the best of his own field and the best of his own vineyard."},{"num":6,"verse":"“If fire breaks out and spreads to thorn bushes so that the stacked grain or standing grain or the field is consumed, he who started the fire shall make full restitution."},{"num":7,"verse":"“If a man gives his neighbor money or [other] goods to keep [for him while he is away] and it is stolen from the neighbor’s house, then, if the thief is caught, he shall pay double [for it]. "},{"num":8,"verse":"If the thief is not caught, the owner of the house shall appear before the judges [who act in God’s name], to determine whether or not he had stolen his neighbor’s goods. "},{"num":9,"verse":"For every offense involving property, whether it concerns ox, donkey, sheep, clothing, or any piece of lost property, which another identifies as his, the case of both parties shall come before the judges [who act in God’s name]. Whomever the judges pronounce guilty shall pay double to his neighbor."},{"num":10,"verse":"“If a man gives his neighbor a donkey or an ox or a sheep or any [other] animal to keep [for him], and it dies or is injured or taken away while no one is looking, "},{"num":11,"verse":"then an oath before the Lord shall be made by the two of them that he has not taken his neighbor’s property; and the owner of it shall accept his word and not require him to make restitution. "},{"num":12,"verse":"But if it is actually stolen from him [when in his care], he shall make restitution to its owner. "},{"num":13,"verse":"If it is torn to pieces [by some predator or by accident], let him bring the mangled carcass as evidence; he shall not make restitution for what was torn to pieces."},{"num":14,"verse":"“And if a man borrows an animal from his neighbor, and it gets injured or dies while its owner is not with it, the borrower shall make full restitution. "},{"num":15,"verse":"But if the owner is with it [when the damage is done], the borrower shall not make restitution. If it was hired, the damage is included in [the price of] its fee."},{"header":"Various Laws"},{"num":16,"verse":"“If a man seduces a virgin who is not betrothed, and lies with her, he must pay a dowry (marriage price) for her to be his wife. "},{"num":17,"verse":"If her father absolutely refuses to give her to him, he must [still] pay money equivalent to the dowry of virgins."},{"num":18,"verse":"“You shall not allow a woman who practices sorcery to live."},{"num":19,"verse":"“Whoever lies with an animal must be put to death."},{"num":20,"verse":"“He who sacrifices to any god, other than to the Lord alone, shall be put under a ban (designated) for destruction (execution)."},{"num":21,"verse":"“You shall not wrong a stranger or oppress him, for you were strangers in the land of Egypt. "},{"num":22,"verse":"You shall not harm or oppress any widow or fatherless child. "},{"num":23,"verse":"If you harm or oppress them in any way, and they cry at all to Me [for help], I will most certainly hear their cry; "},{"num":24,"verse":"and My wrath shall be kindled and burn; I will kill you with the sword, and your wives shall become widows and your children fatherless."},{"num":25,"verse":"“If you lend money to any one of My people with you who is poor, you shall not act as a creditor (professional moneylender) to him; you shall not charge him interest. "},{"num":26,"verse":"If you ever take your [poor] neighbor’s robe in pledge, you must return it to him before sunset, "},{"num":27,"verse":"for that is his only covering; it is his clothing for his body. In what shall he sleep? And when he cries to Me [for help], I will hear him, for I am compassionate and gracious."},{"num":28,"verse":"“You shall not curse God, nor curse the ruler of your people [since he administers God’s law]."},{"num":29,"verse":"“You shall not delay the offering from your harvest and your vintage. You shall give (consecrate, dedicate) to Me the firstborn of your sons. "},{"num":30,"verse":"You shall do the same with your oxen and with your sheep. It shall be with its mother for seven days; on the eighth day you shall give it [as an offering] to Me."},{"num":31,"verse":"“You shall be holy men to Me; therefore you shall not eat meat [from any animal] that has been torn to pieces [by predators] in the field; you shall throw it to the dogs."}]