[{"num":22,"verse":"The Lord continued, “Whenever someone steals a bull or a sheep and butchers it or sells it, he must make up for the loss with five head of cattle to replace the bull or four sheep to replace the sheep."},{"num":2,"verse":"“If anyone catches a thief breaking in and hits him so that he dies, he is not guilty of murder. "},{"num":3,"verse":"But if it happens after sunrise, he is guilty of murder."},{"num":4,"verse":"But if the stolen animal is found alive in his possession, whether it’s a bull, donkey, or a sheep, he must make up for the loss with double the amount."},{"num":5,"verse":"“Whenever someone lets his livestock graze in a field or a vineyard, and they stray and graze in another person’s field, he must make up for what the damaged field was expected to produce. But if he lets them ruin the whole field with their grazing, he must make up from his own field for the loss with the best from his field and vineyard."},{"num":6,"verse":"“Whenever a fire starts and spreads into the underbrush so that it burns up stacked or standing grain or ruins a field, the person who started the fire must make up for the loss."},{"num":7,"verse":"“This is what you must do whenever someone gives his neighbor silver or other valuables to keep for him, and they are stolen from that person’s house: If the thief is caught, he must make up for the loss with double the amount. "},{"num":8,"verse":"If the thief is not caught, the owner of the house must be brought to Elohim to find out whether or not he took his neighbor’s valuables. "},{"num":9,"verse":"If there is a dispute over the ownership of a bull, a donkey, a sheep, an article of clothing, or any other lost property which two people claim as their own, both people must bring their case to Elohim. The one whom Elohim declares guilty must make up for his neighbor’s loss with double the amount."},{"num":10,"verse":"“This is what you must do whenever someone gives his neighbor a donkey, a bull, a sheep, or any other kind of animal to keep for him, and it dies, is injured, or is captured in war, and there are no witnesses. "},{"num":11,"verse":"The case between them must be settled by swearing an oath to Yahweh that the neighbor did not take the other person’s animal. The owner must accept the oath. The neighbor doesn’t have to make up for the loss. "},{"num":12,"verse":"But if the animal was stolen from the neighbor, he must make up for the owner’s loss. "},{"num":13,"verse":"If it was killed by a wild animal, he must bring in the dead body as evidence. He doesn’t have to make up for an animal that has been killed."},{"num":14,"verse":"“Whenever someone borrows an animal from his neighbor, and it is injured or dies while the owner is not present, the borrower must make up for the loss. "},{"num":15,"verse":"If the owner is with the animal, the borrower doesn’t have to make up for the loss. If it is rented, the rental fee covers the loss."},{"header":"Laws for Living as God’s Holy People"},{"num":16,"verse":"“Whenever a man seduces a virgin who is not engaged to anyone and has sexual intercourse with her, he must pay the bride-price and marry her. "},{"num":17,"verse":"If her father absolutely refuses to give her to him, he must pay an amount of money equal to the bride-price for virgins."},{"num":18,"verse":"“Never let a witch live."},{"num":19,"verse":"“Whoever has sexual intercourse with an animal must be put to death."},{"num":20,"verse":"“Whoever sacrifices to any god except Yahweh must be condemned and destroyed."},{"num":21,"verse":"“Never mistreat or oppress foreigners, because you were foreigners living in Egypt."},{"num":22,"verse":"“Never take advantage of any widow or orphan. "},{"num":23,"verse":"If you do and they cry out to me, you can be sure that I will hear their cry. "},{"num":24,"verse":"I will become angry and have you killed in combat. Then your wives and children will become widows and orphans."},{"num":25,"verse":"“If you lend money to my people—to any poor person among you—never act like a moneylender. Charge no interest. "},{"num":26,"verse":"If you take any of your neighbor’s clothes as collateral, give it back to him by sunset. "},{"num":27,"verse":"It may be the only clothes he has to cover his body. What else will he sleep in? When he cries out to me, I will listen because I am compassionate."},{"num":28,"verse":"“Never show disrespect for Elohim or curse a leader of your people."},{"num":29,"verse":"“Never withhold your best wine from me."},{"num":30,"verse":"You must do the same with your cattle and your sheep. They will stay with their mothers seven days, but on the eighth day you must give them to me."},{"num":31,"verse":"“You must be my holy people. Never eat the meat of an animal that has been killed by wild animals out in the countryside. Throw it to the dogs.”"}]