[{"num":19,"verse":"Better is the poor man, that walketh in his simplicity, than a rich man that is perverse in his lips, and unwise."},{"num":2,"verse":"Where there is no knowledge of the soul, there is no good: and he that is hasty with his feet shall stumble."},{"num":3,"verse":"The folly of a man supplanteth his seeps: and he fretteth in his mind against God."},{"num":4,"verse":"Riches make many friends: but from the poor man, even they whom he had, depart."},{"num":5,"verse":"A false witness shall not be unpunished: and he that speaketh lies shall not escape."},{"num":6,"verse":"Many honour the person of him that is mighty, and are friends of him that giveth gifts."},{"num":7,"verse":"The brethren of the poor man hate him: moreover also his friends have departed far from him. He that followeth after words only, shall have nothing."},{"num":8,"verse":"But he that possesseth a mind, loveth his own soul, and he that keepeth prudence shall find good things."},{"num":9,"verse":"A false witness shall not be unpunished: and he that speaketh lies, shall perish."},{"num":10,"verse":"Delicacies are not seemly for a fool: nor for a servant to have rule over princes."},{"num":11,"verse":"The learning of a man is known by patience and his glory is to pass over wrongs."},{"num":12,"verse":"As the roaring of a lion, so also is the anger of a king: and his cheerfulness as the dew upon the grass."},{"num":13,"verse":"A foolish son is the grief of his father: and a wrangling wife is like a roof continually dropping through."},{"num":14,"verse":"House and riches are given by parents: but a prudent wife is properly from the Lord."},{"num":15,"verse":"Slothfulness casteth into a deep sleep, and an idle soul shall suffer hunger."},{"num":16,"verse":"He that keepeth the commandment, keepeth his own soul: but he that neglecteth his own way, shall die."},{"num":17,"verse":"He that hath mercy on the poor, lendeth to the Lord: and he will repay him."},{"num":18,"verse":"Chastise thy son, despair not: but to the killing of him set not thy soul."},{"num":19,"verse":"He that is impatient, shall suffer damage: and when he shall take away he shall add another thing."},{"num":20,"verse":"Hear counsel, and receive instruction, that thou mayst be wise in thy latter end."},{"num":21,"verse":"There are many thoughts in the heart of a man: but the will of the Lord shall stand firm."},{"num":22,"verse":"A needy man is merciful: and better is the poor than the lying man."},{"num":23,"verse":"The fear of the Lord is unto life: and he shall abide in fulness without being visited with evil."},{"num":24,"verse":"The slothful hideth his hand under his armpit, and will not so much as bring it to his mouth."},{"num":25,"verse":"The wicked man being; scourged, the fool shall be wiser: but if thou rebuke a wise man he will understand discipline."},{"num":26,"verse":"He that afflicteth his father, and chaseth away his mother, is infamous and unhappy."},{"num":27,"verse":"Cease not, O my son, to hear instruction, and be not ignorant of the words of knowledge."},{"num":28,"verse":"An unjust witness scorneth judgment: and the mouth of the wicked devoureth iniquity."},{"num":29,"verse":"Judgments are prepared for scorners: and striking hammers for the bodies of fools."}]