[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3, 4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Had power.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Should be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strove.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Prayers and tears were the weapons used in the memorable struggle for pardon, reconciliation, peace in the self-conquest as well as the God-conquest which was achieved. “At Bethel He (Jehovah) found him (Jacob)” not once only, but on repeated occasions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),and in the subsequent history of the children of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 12:3. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He took his brother by the heel in the womb — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From the mentioning of Jacob in the foregoing verse, the prophet takes occasion to put his posterity in mind of the particular favours God had bestowed upon him; partly with a view to encourage them to imitate him in endeavouring to obtain the like blessings, and partly to convince them of their ingratitude and degeneracy from him. His taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his brother by the heel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signified his striving, by a divine instinct, for the birthright and blessing. Even before his birth he reached forth his hand to catch hold of it, as it were, and if possible to prevent his brother. It denoted, also, that he should prevail at last, gain his point, and in process of time become greater than his brother. And this prognostic of his prevalence and superiority was the effect of God’s will and power, and not of Jacob’s, who was not then in a capacity of acting of himself: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is justly observed here, by Bishop Horsley, that his “taking his brother by the heel is not mentioned in disparagement of the patriarch. On the contrary, the whole of these two verses is a commemoration of God’s kindness for the ancestor of the Israelites, on which the prophet founds an animated exhortation to them, to turn to that God from whom they might expect so much favour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By his strength he had power with God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This alludes to his wrestling with the angel, as recorded Genesis 32. That bodily strength, wherewith he was endued by God, and enabled to wrestle with this heavenly being, was a token of the strength of his faith, and of the fervency of his spirit in prayer. This is mentioned here by the prophet, as another instance of God’s favour to Jacob. He not only, when an infant in the womb, was enabled to perform the emblematical action just mentioned; but, in his adult age, he was endued with such supernatural strength of mind and body, that he was enabled to continue wrestling till he obtained the blessing. The prophet, in this clause, alludes to those words of his, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will not let thee go except thou bless me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "intimating the strength of his faith, and prevalency of his prayers with God. The words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He had power with God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and those that follow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He had power over the angel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are equivalent; and plainly prove that this person, who assumed a human shape, was really God, that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "angel of the covenant, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "by whom all the divine appearances recorded in the Old Testament were performed; the affairs of the church being ordered by him from the beginning. This subject is learnedly handled by Dr. Allix in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judgment of the Jewish Church, against the Unitarians, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "chap. 13.-15., by Archbishop Tenison in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Discourses of Idolatry, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "chap. 14., and by Bishop Bull in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Defence of the Nicene Faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-6 Ephraim feeds himself with vain hopes of help from man, when he is at enmity with God. The Jews vainly thought to secure the Egyptians by a present of the produce of their country. Judah is contended with also. God sees the sin of his own people, and will reckon with them for it. They are put in mind of what Jacob did, and what God did for him. When his faith upon the Divine promise prevailed above his fears, then by his strength he had power with God. He is Jehovah, the same that was, and is, and is to come. What was a revelation of God to one, is his memorial to many, to all generations. Then let those who have gone from God, be turned to him. Turn thou to the Lord, by repentance and faith, as thy God. Let those that are converted to him, walk with him in all holy conversation and godliness. Let us wrestle with Him for promised blessings, determined not to give over till we prevail; and let us seek Him in his ordinances.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He took his brother by the heel in the womb - Whether or no the act of Jacob was beyond the strength, ordinarily given to infants in the womb, the meaning of the act was beyond man's wisdom to declare. Whence the Jews paraphrased , \"Was it not predicted of your lather Jacob, before he was born, that he should become greater than his brother?\" Yet this was not fulfilled until more than 500 years afterward, nor completely until the time of David. These gifts were promised to Jacob out of the free mercy of God, antecedent to all deserts. But Jacob, thus chosen without desert, showed forth the power of faith; \"By his strength he had power with God.\" : \"The strength by which he did this, was God's strength, as well as that by which God contended with him; yet it is well called his, as being by God given to him. \"Yet he had power with God,\" God so ordering it, that the strength which was in Jacob, should put itself forth with greater force, than that in the assumed body, whereby He so dealt with Jacob. God, as it were, bore the office of two persons, showing in Jacob more strength than He put forth in the Angel.\" \"By virtue of that faith in Jacob, it is related that God \"could\" not prevail against him. He could not because he would not overthrow his faith and constancy. By the touch in the hollow of his thigh, He but added strength to his faith, showing him who it was who wrestled with him, and that He willed to bless him.\" For thereon Jacob said those words which have become a proverb of earnest supplication, \"I will not let thee go, except thou bless me, and, I have seen God, face to face, and my life is preserved\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". : \"He was strengthened by the blessing of Him whom he overcame.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. He—Jacob, contrasted with his degenerate descendants, called by his name, Jacob (Ho 12:2; compare Mic 2:7). He took Esau by the heel in the womb in order to obtain, if possible, the privileges of the first-born (Ge 25:22-26), whence he took his name, Jacob, meaning \"supplanter\"; and again, by his strength, prevailed in wrestling with God for a blessing (Ge 32:24-29); whereas ye disregard My promises, putting your confidence in idols and foreign alliances. He conquered God, ye are the slaves of idols. Only have Jehovah on your side, and ye are stronger than Edom, or even Assyria. So the spiritual Israel lays hold of the heel of Jesus, \"the First-born of many brethren,\" being born again of the Holy Spirit. Having no right in themselves to the inheritance, they lay hold of the bruised heel, the humanity of Christ crucified, and let not go their hold of Him who is not, as Esau, a curse (Heb 12:16, 17), but, by becoming a curse for us, is a blessing to us.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "power with God—referring to his name, \"Israel,\" prince of God, acquired on that occasion (compare Mt 11:12). As the promised Canaan had to be gained forcibly by Israel, so heaven by the faithful (Re 3:21; compare Lu 13:24). \"Strive,\" literally, \"as in the agony of a contest.\" So the Canaanitess (Mt 15:22).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his strength—which lay in his conscious weakness, whence, when his thigh was put out of joint by God, he hung upon Him. To seek strength was his object; to grant it, God's. Yet God's mode of procedure was strange. In human form He tries as it were to throw Jacob down. When simple wrestling was not enough, He does what seems to ensure Jacob's fall, dislocating his thigh joint, so that he could no longer stand. Yet it was then that Jacob prevailed. Thus God teaches us the irresistible might of conscious weakness. For when weak in ourselves, we are strong by His strength put in us (Job 23:6; Isa 27:5; 2Co 12:9, 10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "took his brother, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Esau, by the heel in the womb: the matter of fact you have ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 25:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; the design of mentioning it in this place is to mind them of that goodness which God showed to them in their father Jacob, who was by a miracle foretold to be superior to Esau, that he and his should have the birth-right: this.should never be forgotten. The true worship of God they should have preserved, since in the priesthood, part of the primogeniture, it was included both as privilege and duty; justice and equity they should have maintained as a flower of the crown and kingly authority included in the birth-right, and a double portion or share in God’s blessings was theirs too. But all these blessings are forfeited by their apostacy, for which at once they should blush, repent, and humble themselves, and at last remember their primogeniture, and labour to recover to a temper worthy this their original. Jacob strove for the blessing in the womb, but you profanely neglect it in full age. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By his strength; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this strength was not of nature, But of grace, a fruit of the Divine love and election, strength from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He had power with God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strength received of God was well employed betimes, in it he wrestled for and obtained the blessing; but you let it slip out of your hands, and sin it away. There was somewhat of heroic, a conqueror from his birth, but you are revolters from the womb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He took his brother by the heel in the womb,.... That is, Jacob took his brother Esau by the heel, as he came forth from his mother's womb; the history of it is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is here observed, upon mentioning the name of Jacob in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", meaning the posterity, of the patriarch; but here he himself is intended, and occasionally taken notice of, to show how very different his posterity were from him, and how sadly degenerated; as well as to upbraid them with ingratitude, whose ancestors, and they also, had received such and so many favours from the Lord; Jacob the patriarch was a hero from the womb, but they transgressors from it; this action of his observed was a presage and pledge of his having the superiority of his brother, and of his getting the birthright and blessing from him. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"prophet, say unto them, was it not said of Jacob, before he was born, that he would be greater than his brother?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "see Romans 9:11. In this action there was something divine, miraculous, and preternatural; it was not the effort of nature merely, but contrary to it, or at least above it; and not done by chance, but ordered by the providence of God, as a prediction and testification of his future greatness, and even of his posterity's, in times yet to come, as Kimchi observes, who refers to Obadiah 1:18; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this action there was something divine, miraculous, and preternatural; it was not the effort of nature merely, but contrary to it, or at least above it; and not done by chance, but ordered by the providence of God, as a prediction and testification of his future greatness, and even of his posterity's, in times yet to come, as Kimchi observes, who refers to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and by his strength he had power with God; the Targum is, with the angel, as in Hosea 12:4; he is called a man in the history of this event in Genesis 32:24; not that he was a mere man, since he is here expressly called God, and afterwards the Lord God of hosts; and there it is evident, from the context, he was a divine Person, and no other than the Son of God; who, though not as yet incarnate, appeared in a human form, as a presage of his future incarnation; though this was not a mere apparition, spectre, or phantasm, as Josephus (t) calls it; for it was not in a dream, or in a visionary way, that this wrestling and striving was between this divine Person in this form and Jacob, but in reality; it was a real substance which the Son of God formed, animated, actuated, and assumed, for that time and purpose, and then laid it aside; which touched Jacob, and he touched that, laid hold on it, and held it fast, and strove with it, and had power over it, and over God in it; even over him that is God over all, the true God and eternal life, the Lord Jesus Christ; not a created God, or God by office, but by nature; as the perfections that are in him, and the works and worship ascribed to him, declare: now Jacob had power over him \"by his strength\"; not by his natural strength; either of his body, which could not have been equal to the strength of this human body assumed for the time, as it was used and managed by a divine Person, unless he had been extraordinarily assisted and strengthened; or of his mind and soul, not by any spiritual strength he had of himself; but by what he had from this divine Person, with whom he wrestled; who put strength into him, and supported and increased the power and strength of faith in prayer; so that he prevailed over him, and got the blessing, for which reason his name was called Israel, Genesis 32:28. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and by his strength he had power with God; the Targum is, with the angel, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; he is called a man in the history of this event in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not that he was a mere man, since he is here expressly called God, and afterwards the Lord God of hosts; and there it is evident, from the context, he was a divine Person, and no other than the Son of God; who, though not as yet incarnate, appeared in a human form, as a presage of his future incarnation; though this was not a mere apparition, spectre, or phantasm, as Josephus (t) calls it; for it was not in a dream, or in a visionary way, that this wrestling and striving was between this divine Person in this form and Jacob, but in reality; it was a real substance which the Son of God formed, animated, actuated, and assumed, for that time and purpose, and then laid it aside; which touched Jacob, and he touched that, laid hold on it, and held it fast, and strove with it, and had power over it, and over God in it; even over him that is God over all, the true God and eternal life, the Lord Jesus Christ; not a created God, or God by office, but by nature; as the perfections that are in him, and the works and worship ascribed to him, declare: now Jacob had power over him \"by his strength\"; not by his natural strength; either of his body, which could not have been equal to the strength of this human body assumed for the time, as it was used and managed by a divine Person, unless he had been extraordinarily assisted and strengthened; or of his mind and soul, not by any spiritual strength he had of himself; but by what he had from this divine Person, with whom he wrestled; who put strength into him, and supported and increased the power and strength of faith in prayer; so that he prevailed over him, and got the blessing, for which reason his name was called Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Antiqu. l. 1. c. 20. sect. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Antiqu. l. 1. c. 20. sect. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He took his brother by the heel in the womb, and by his strength he had {d} power with God:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He took his brother by the heel in the womb, and by his strength he had ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " power with God:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Seeing that God in this way preferred Jacob their father, Judah's ingratitude was the more to be abhorred.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He took his brother by the heel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As if Jacob meant, The Supplanter. The same verb is used by Esau in an unfavourable sense in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but Hosea here evidently means to edify his people by the allusion. Observe that Jacob is described as the head and representative of his family (comparing this with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 12:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had power with God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "contended with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Again an etymological allusion, ‘Israel’ being explained (rightly or wrongly) as ‘God’s combatant.’ The word used for God is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "elôhîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is applicable to any divine or superhuman form (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hence in the next verse we find ‘angel’, or, rendering etymologically, ‘administrator’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mal’akh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), substituted for it, to prevent misunderstanding. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3–6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Two episodes (for a third, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 12:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the history of Jacob are applied to the spiritual wants of his descendants. Jacob in the very womb seemed ambitious of the blessing, and when a grown man, he wrestled with the angel for a still higher blessing than before. But, as we are led to interpret the prophet’s thought, the Israelites, instead of justifying their name, and ‘waiting upon their God’, have denied Jehovah, and sought for weak human help.—The parallel passages in Genesis are ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:26",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:28",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (both ascribed to ‘the Jehovist’), though we cannot conclude with positive certainty that they were known to Hosea, for in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 12:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " he introduces a detail not mentioned in Genesis. Hosea ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " have drawn from oral tradition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He took his brother by the heel in the womb, and by his strength he had power",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "was a prince",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "behaved himself princely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God. In this verse and the following the prophet looks away back into the far-distant past; and this retrospect, which is suggested by the names Jacob and Israel, reminds him of two well-known events in the life of the patriarch-The meaning and intention of this reminiscence are differently interpreted. The two leading views are the following: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Some are of opinion that the prophet means to give an example by way of warning, and to mention a trait of Jacob's overreaching cunning, and likewise of his violence, and thereby show that Jacob had incurred guilt in a manner resembling that of the then present generation; that is to say, his conduct had been like to theirs in deceit, lying, and violence. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " according to others, and we agree with them, the object of the prophet in these verses is to admonish them to imitate the conduct of their progenitor, and to remind them of the distinction which he had obtained thereby, as an encourage-merit to them to go and do likewise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Another interpretation, somewhat similar to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is that of those who admit that Jacob's laying hold of his brother's heel in the womb is proposed to his posterity by the prophet for the purpose of emulation and encouragement, at the same time to exhibit God's electing grace from eternity. Thus Jerome: \"While he was yet in the womb of Rebekah, he laid hold of his brother's heel, not by his own strength, it is true, who was incapable of perception, but by the mercy of God, who knows and loves those whom he has predestinated.\" So also Rashi: \"All this I have done to him; he took his brother by the heel for a sign that he would prevail over him.\" Calvin explains more fully thus: \"Their ingratitude is showed in this, that they did not acknowledge that they had been anticipated, in the person of their father Jacob, by the gratuitous mercy of God. The first history is indeed referred to for this end, that the posterity of Jacob might understand that they had been elected by God before they were born. For Jacob did not, by choice or design, lay hold of the heel of his brother in his mother's womb; but it was an extraordinary thing. It was, then, God who guided the hand of the infant and by this sign testified his adoption to be gratuitous. In short, by saying that Jacob held the foot of his brother in his mother's womb, the same thing is intended as if God had reminded the Israelites that they did not excel other people by their own virtue or that of their parents, but that God of his own good pleasure had chosen them.\" Aben Ezra and Kimchi explain the seizing of Esau's heel by Jacob as owing to the impartation of Divine power, but as a sign of victory over his enemies. We must reject ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the following reasons: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The reference is not to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jacob's",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " overreaching Esau is recorded, but to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is written, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "After",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that came his brother out, and his hand took hold on Esau's heel;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the patriarchs are always exhibited as patterns of piety - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "besides, Ho",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "sea never employs the name Israel in any but an honorable sense. We must elect between ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and we incline to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the gist of the passage is to exhibit Jacob's earnestness in seeking the Divine blessing as an example to his posterity. Already in his mother's womb, before he saw the light of the world even in his condition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "unconsciousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he had laid hold of the heel of his elder brother Esau, in order to anticipate him as the firstborn, and thereby appropriate the Divine promises. The second clause describes how with zeal, by labor and effort, he had struggled for the position of pre-eminence, sorely struggling for the Divine blessing. In the maturity of his manhood he wrestled with God, or rather with the angel of the covenant, and prevailed so that his name was changed to Israel. This picture the prophet presents to Jacob's posterity for their imitation, with implied promise of like happy result. Though Aben Ezra and Kimchi, in their exposition of the verse, rather explain in their own way the significance of the original event as recorded in Genesis than the application which the prophet here makes of it, yet it may not be out of place to subjoin their comments, which are as follows: Aben Ezra, \"With respect to him who explains 'in the womb' in the sense that Jehovah then decreed the matter of the birthright and blessing, I know not how the meaning of 'in the womb' bears on that, as the Scripture ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "says",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'Before I formed thee in the womb I knew thee.' According to my opinion it should be taken according to its literal sense, that ' he took his brother by the heel in the womb; ' and this is made clear by' and his hand took hold on Esau's heel.' Now the purport is, 'Why do the sons of Jacob not remember that I chose their father, and effected preeminence for him over all that are born? For when he was in the womb I gave him strength to lay hold of the heel, and this was as the working of a miracle, for the fetus has, in the womb and at the time of the opening of the matrix, no strength to lay hold of anything until it comes forth from the womb into the air of the world. And lo! when he was in the womb I gave him strength; and afterwards he wrestled with the angel, and he (the angel) did not prevail over him, although one angel ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "slew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the whole host of Assyria, and from his sight the children of men flee in terror as David who was frightened; how much ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it to wrestle with him.' The meaning is that all the children of the world should know that his (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jacob's",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seed shall endure for ever, and in the end conquer his enemies. But Ephraim thinks that Ephraim himself has found the power.\" The comment of Kimchi on the first part of the verse is much the same with that of Aben Ezra just cited; while on the concluding clause he remarks, \"And yet another sign I have shown him to be a sign to his children after him, for I gave him strength to wrestle with the angel and to be a prince in relation to him as if he was in the same rank with him. And this sign I showed him that his sons would be the portion of Jehovah alone, that star and angel should not prevail over them all the time they would do my pleasure, and by the signs of the heavens they should not be terrified, for they have no strength (physical) nor power (moral) over them, because the providence of God most blessed cleaves to them during all the period they would do my will, nor shall they succumb to any accident of time.\" Hosea 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"He held his brother's heel in the womb, and in his man's strength he fought with God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He fought against the angel, and overcame; wept, and prayed to Him: at Bethel he found Him, and there He talked with us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And Jehovah, God of hosts, Jehovah is His remembrance.\" The name Jacob, which refers to the patriarch himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", forms the link between ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Israelites, as descendants of Jacob, were to strive to imitate the example of their forefather. His striving hard for the birthright, and his wrestling with God, in which he conquered by prayer and supplication, are types and pledges of salvation to the tribes of Israel which bear his name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"He shows what good Jacob received, and the son is named in the father: he calls to remembrance the ancient history, that they may see both the mercy of God towards Jacob, and his resolute firmness towards the Lord.\" - Jerome.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "עקב, a denom. from עקב, \"to hold the heel\"  equals  אחז בּעקב in Genesis 25:26, which the prophet has in his mind, not \"to overreach,\" as in Genesis 27:36 and Jeremiah 9:3. For the wrestling with God, mentioned in the second clause of the verse, proves most indisputably that Jacob's conduct is not held up before the people for a warning, as marked by cunning or deceit, as Umbreit and Hitzig suppose, but is set before them for their imitation, as an eager attempt to secure the birthright and the blessing connected with it. This shows at the same time, that the holding of the heel in the mother's womb is not quoted as a proof of the divine election of grace, and, in fact, that there is no reference at all to the circumstance, that \"even when Jacob was still in his mother's womb, he did this not by his own strength, but by the mercy of God, who knows and loves those whom He has predestinated\" (Jerome). בּאונו, is his manly strength (cf. Genesis 49:3) he wrestled with God (Genesis 32:25-29). This conflict (for the significance of which in relation to Jacob's spiritual life, see the discussion at Genesis l.c.) is more fully described in Hosea 12:4, for the Israelites to imitate. מלאך is the angel of Jehovah, the revealer of the invisible God (see the Commentary on the Pentateuch, pp. 118ff. transl.). ויּכל is from Genesis 32:29. The explanatory clause, \"he wept, and made supplication to Him\" (after Genesis 32:27), gives the nature of the conflict. It was a contest with the weapons of prayer; and with these he conquered. These weapons are also at the command of the Israelites, if they will only use them. The fruit of the victory was, that he (Jacob) found Him (God) at Bethel. This does not refer to the appearance of God to Jacob on his flight to Mesopotamia (Genesis 28:11), but to that recorded in Genesis 35:9., when God confirmed his name of Israel, and renewed the promises of His blessing. And there, continues the prophet, He (God) spake with us; i.e., not there He speaks with us still, condemning by His prophets the idolatry at Bethel (Amos 5:4-5), as Kimchi supposes; but, as the imperfect ידבּר corresponds to ימצאנּוּ, \"there did He speak to us through Jacob,\" i.e., what He there said to Jacob applies to us.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "עקב, a denom. from עקב, \"to hold the heel\"  equals  אחז בּעקב in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which the prophet has in his mind, not \"to overreach,\" as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the wrestling with God, mentioned in the second clause of the verse, proves most indisputably that Jacob's conduct is not held up before the people for a warning, as marked by cunning or deceit, as Umbreit and Hitzig suppose, but is set before them for their imitation, as an eager attempt to secure the birthright and the blessing connected with it. This shows at the same time, that the holding of the heel in the mother's womb is not quoted as a proof of the divine election of grace, and, in fact, that there is no reference at all to the circumstance, that \"even when Jacob was still in his mother's womb, he did this not by his own strength, but by the mercy of God, who knows and loves those whom He has predestinated\" (Jerome). בּאונו, is his manly strength (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") he wrestled with God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:25-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This conflict (for the significance of which in relation to Jacob's spiritual life, see the discussion at Genesis l.c.) is more fully described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for the Israelites to imitate. מלאך is the angel of Jehovah, the revealer of the invisible God (see the Commentary on the Pentateuch, pp. 118ff. transl.). ויּכל is from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The explanatory clause, \"he wept, and made supplication to Him\" (after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), gives the nature of the conflict. It was a contest with the weapons of prayer; and with these he conquered. These weapons are also at the command of the Israelites, if they will only use them. The fruit of the victory was, that he (Jacob) found Him (God) at Bethel. This does not refer to the appearance of God to Jacob on his flight to Mesopotamia (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but to that recorded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., when God confirmed his name of Israel, and renewed the promises of His blessing. And there, continues the prophet, He (God) spake with us; i.e., not there He speaks with us still, condemning by His prophets the idolatry at Bethel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as Kimchi supposes; but, as the imperfect ידבּר corresponds to ימצאנּוּ, \"there did He speak to us through Jacob,\" i.e., what He there said to Jacob applies to us.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Let it be carefully observed, that God is said to have talked at Bethel not with Jacob only, but with all his posterity. That is to say, the things which are here said to have been done by Jacob, and to have happened to him, had not regard to himself only, but to all the race that sprang from him, and were signs of the good fortune which they either would, or certainly might enjoy\" (Lackemacher in Rosenmller's Scholia).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The explanation of this is given in Hosea 12:5, where the name is recalled in which God revealed Himself to Moses, when He first called him (Exodus 3:15), i.e., in which He made known to him His true nature. Yehōvâh zikhrō is taken literally from זה זכרי לדר דּר; but there the name Jehovah is still further defined by \"the God of Abraham, Isaac, and Jacob,\" here by \"the God of hosts.\" This difference needs consideration. The Israelites in the time of Moses could only put full confidence in the divine call of Moses to be their deliverer out of the bondage of Egypt, on the ground that He who called him was the God who had manifested Himself to the patriarchs as the God of salvation; but for the Israelites of Hosea's time, the strength of their confidence in Jehovah arose from the fact that Jehovah was the God of hosts, i.e., the God who, because He commands the forces of heaven, both visible and invisible, rules with unrestricted omnipotence on earth as well as in heaven (see at 1 Samuel 1:3). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The explanation of this is given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the name is recalled in which God revealed Himself to Moses, when He first called him (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., in which He made known to him His true nature. Yehōvâh zikhrō is taken literally from זה זכרי לדר דּר; but there the name Jehovah is still further defined by \"the God of Abraham, Isaac, and Jacob,\" here by \"the God of hosts.\" This difference needs consideration. The Israelites in the time of Moses could only put full confidence in the divine call of Moses to be their deliverer out of the bondage of Egypt, on the ground that He who called him was the God who had manifested Himself to the patriarchs as the God of salvation; but for the Israelites of Hosea's time, the strength of their confidence in Jehovah arose from the fact that Jehovah was the God of hosts, i.e., the God who, because He commands the forces of heaven, both visible and invisible, rules with unrestricted omnipotence on earth as well as in heaven (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]