[{"num":19,"verse":"Pilate, when Christ was scourged, 2 and crowned with thorns, 4 was desirous to let him loose: 8 but being overcome with the outrage of the Jews, 16 he delivereth him to be crucified. 26 Jesus committeth his mother to the disciple. 30 Having tasted vinegar, he dieth: 34 and being dead, his side is pierced with a spear. 40 He is buried."},{"num":1,"verse":"Then Pilate took Jesus and scourged him."},{"num":2,"verse":"And the soldiers platted a crown of thorns, and put it on his head, and they put on him a purple garment,"},{"num":3,"verse":"And said, Hail King of the Jews. And they smote him with their rods."},{"num":4,"verse":"Then Pilate went forth again, and said unto them, Behold, I bring him forth to you, that ye may know, that I find no fault in him at all."},{"num":5,"verse":"Then came Jesus forth wearing a crown of thorns, and a purple garment. And Pilate said unto them, Behold the man."},{"num":6,"verse":"Then when the high Priests and officers saw him, they cried, saying, Crucify, crucify him. Pilate said unto them, Take ye him, and crucify him: for I find no fault in him."},{"num":7,"verse":"The Jews answered him, We have a law, and by our law he ought to die, because he made himself the Son of God."},{"num":8,"verse":"¶ When Pilate then heard that word, he was the more afraid,"},{"num":9,"verse":"And went again into the common hall, and said unto Jesus, Whence art thou? But Jesus gave him none answer."},{"num":10,"verse":"Then said Pilate unto him, Speakest thou not unto me? Knowest thou not that I have power to crucify thee, and have power to loose thee?"},{"num":11,"verse":"Jesus answered, Thou couldest have no power at all against me, except it were given thee from above: therefore he that delivered me unto thee, hath the greater sin. "},{"num":12,"verse":"From thenceforth Pilate sought to loose him, but the Jews cried, saying, If thou deliver him, thou art not Caesar’s friend: for whosoever maketh himself a King, speaketh against Caesar."},{"num":13,"verse":"¶ When Pilate heard this word, he brought Jesus forth, and sat down in the judgment seat in a place called the pavement, and in Hebrew, Gabbatha."},{"num":14,"verse":"And it was the Preparation of the Passover, and about the sixth hour: and he said unto the Jews, Behold your King."},{"num":15,"verse":"But they cried, Away with him, away with him, crucify him. Pilate said unto them, Shall I crucify your King? The high Priests answered, We have no King but Caesar."},{"num":16,"verse":"Then delivered he him unto them, to be crucified. And they took Jesus, and led him away."},{"num":17,"verse":"And he bare his own cross, and came into a place named of dead men’s skulls, which is called in Hebrew, Golgotha:"},{"num":18,"verse":"Where they crucified him, and two other with him, on either side one, and Jesus in the midst."},{"num":19,"verse":"¶ And Pilate wrote also a title, and put it on the cross, and it was written, JESUS OF NAZARETH THE KING OF THE JEWS."},{"num":20,"verse":"This title then read many of the Jews: for the place where Jesus was crucified, was near to the city: and it was written in Hebrew, Greek, and Latin."},{"num":21,"verse":"Then said the high Priests of the Jews to Pilate, Write not, The King of the Jews, but that he said, I am the King of the Jews."},{"num":22,"verse":"Pilate answered, What I have written, I have written."},{"num":23,"verse":"¶ Then the soldiers, when they had crucified Jesus, took his garments (and made four parts, to every soldier a part) and his coat: and the coat was without seam woven from the top throughout."},{"num":24,"verse":"¶ Therefore they said one to another, Let us not divide it, but cast lots for it, whose it shall be. This was that the Scripture might be fulfilled, which saith, They parted my garments among them, and on my coat did cast lots. So the soldiers did these things indeed."},{"num":25,"verse":"¶ Then stood by the cross of Jesus his mother, and his mother’s sister, Mary the wife of Clopas, and Mary Magdalene."},{"num":26,"verse":"And when Jesus saw his mother, and the disciple standing by, whom he loved, he said unto his mother, Woman, behold thy son. "},{"num":27,"verse":"Then said he to the disciple, Behold thy mother: and from that hour, the disciple took her home unto him."},{"num":28,"verse":"¶ After, when Jesus knew that all things were performed, that the Scripture might be fulfilled, he said, I thirst. "},{"num":29,"verse":"And there was set a vessel full of vinegar: and they filled a sponge with vinegar: and put it about an Hyssop stalk, and put it to his mouth."},{"num":30,"verse":"Now when Jesus had received of the vinegar, he said, It is finished, and bowed his head, and gave up the ghost."},{"num":31,"verse":"The Jews then (because it was the Preparation, that the bodies should not remain upon the cross on the Sabbath day: for that Sabbath was an high day) besought Pilate that their legs might be broken, and that they might be taken down."},{"num":32,"verse":"Then came the soldiers and brake the legs of the first, and of the other, which was crucified with Jesus."},{"num":33,"verse":"But when they came to Jesus, and saw that he was dead already, they brake not his legs."},{"num":34,"verse":"But one of the soldiers with a spear pierced his side, and forthwith came there out blood and water."},{"num":35,"verse":"And he that saw it, bare record, and his record is true: and he knoweth that he saith true, that ye might believe it."},{"num":36,"verse":"For these things were done, that the Scripture should be fulfilled, Not a bone of him shall be broken."},{"num":37,"verse":"And again another Scripture saith, They shall see him whom they have thrust through."},{"num":38,"verse":"And after these things, Joseph of Arimathea (who was a disciple of Jesus, but secretly for fear of the Jews) besought Pilate that he might take down the body of Jesus. And Pilate gave him license. He came then and took Jesus’ body."},{"num":39,"verse":"And there came also Nicodemus (which first came to Jesus by night) and brought of myrrh and aloes mingled together about an hundred pounds."},{"num":40,"verse":"Then took they the body of Jesus, and wrapped it in linen clothes with the odors, as the manner of the Jews is to bury."},{"num":41,"verse":"And in that place where Jesus was crucified, was a garden, and in the garden a new sepulcher, wherein was never man yet laid."},{"num":42,"verse":"There then laid they Jesus, because of the Jews’ Preparation day, for the sepulcher was near."}]