[{"header":"Here’s the Man!"},{"num":19,"verse":"So Pilate then took Jesus and had him flogged. "},{"num":2,"verse":"The soldiers wove a crown of thorns, put it on his head, and dressed him up in a purple robe. "},{"num":3,"verse":"Then they came up to him and said, ‘Hail, King of the Jews!’ And they slapped him."},{"num":4,"verse":"Pilate went out again."},{"num":5,"verse":"So Jesus came out, wearing the crown of thorns and the purple cloak."},{"num":6,"verse":"So when the chief priests and their attendants saw him, they gave a great shout."},{"num":7,"verse":"‘We’ve got a law,’ replied the Judaeans, ‘and according to that law he deserves to die! He made himself the son of God!’"},{"header":"No King but Caesar"},{"num":8,"verse":"When Pilate heard that, he was all the more afraid. "},{"num":9,"verse":"He went back into the Praetorium and spoke to Jesus."},{"num":10,"verse":"So Pilate addressed him again."},{"num":11,"verse":"‘You couldn’t have any authority at all over me’, replied Jesus, ‘unless it was given to you from above. That’s why the person who handed me over to you is guilty of a greater sin.’"},{"num":12,"verse":"From that moment on, Pilate tried to let him go."},{"num":13,"verse":"So when Pilate heard them saying that, he brought Jesus out and sat down at the official judgment seat, called The Pavement (in Hebrew, ‘Gabbatha’). "},{"num":14,"verse":"It was the Preparation day of the Passover, and it was about midday."},{"num":15,"verse":"‘Take him away!’ they shouted. ‘Take him away! Crucify him!’"},{"num":16,"verse":"Then he handed him over to them to be crucified."},{"header":"The King of the Jews"},{"num":17,"verse":"He carried his own cross, and went to the spot called ‘Skull Place’ (in Hebrew, ‘Golgotha’). "},{"num":18,"verse":"That was where they crucified him. They also crucified two others, one on either side of him, with Jesus in the middle."},{"num":19,"verse":"Pilate wrote a notice and had it placed on the cross:"},{"num":20,"verse":"Lots of the Judaeans read this notice, because the place where Jesus was crucified was close to the city. It was written in Hebrew, Latin and Greek."},{"num":21,"verse":"So the chief priests said to Pilate, ‘Don’t write “The King of the Jews”! Write that he said, “I am the King of the Jews”!’"},{"num":22,"verse":"‘What I’ve written,’ replied Pilate, ‘I’ve written.’"},{"num":23,"verse":"When the soldiers had crucified Jesus, they took his clothes and divided them into four parts, giving each soldier one part. When they came to his tunic, they found that it was a single piece of cloth, woven from top to bottom."},{"num":24,"verse":"‘Let’s not tear it,’ they said to each other. ‘Let’s throw lots for it, to see who’s going to have it.’"},{"header":"The Death of Jesus"},{"num":25,"verse":"Jesus’ mother was standing beside his cross. So was her sister, Mary the wife of Clopas, with Mary Magdalene too. "},{"num":26,"verse":"Jesus saw his mother, and the disciple he specially loved, standing there."},{"num":27,"verse":"Then he spoke to the disciple."},{"num":28,"verse":"After this, Jesus knew that everything had at last been completed."},{"num":29,"verse":"There was a jar there full of sour wine. So they put a sponge filled with the sour wine on a hyssop rod and lifted it to his mouth. "},{"num":30,"verse":"Jesus drank it."},{"header":"Blood and Water"},{"num":31,"verse":"It was the day of Preparation. The coming sabbath was a very special one, and the Judaeans were anxious that the bodies should not remain on the cross during the sabbath. So they asked Pilate to have the legs of the crucified men broken, and their bodies taken away."},{"num":32,"verse":"So the soldiers came and broke the legs of the men who were crucified with Jesus, first the one, then the other. "},{"num":33,"verse":"But when they came to Jesus, they saw that he was already dead, so they didn’t break his legs. "},{"num":34,"verse":"Instead, one of the soldiers thrust a spear into his side, and blood and water came out. "},{"num":35,"verse":"(The one who saw it is giving evidence, and his evidence is true. He knows he’s speaking the truth, so that you too may believe.) "},{"num":36,"verse":"These things, you see, came about so that the Bible might come true: ‘No bone of his will be broken.’ "},{"num":37,"verse":"And, again, another passage in the Bible says, ‘They shall look on the one whom they pierced.’"},{"header":"The Burial of Jesus"},{"num":38,"verse":"After this, Joseph of Arimathea asked Pilate if he could take Jesus’ body away. He was a disciple of Jesus, but he kept it secret because he was afraid of the Judaeans. Pilate gave him permission. So he came and took his body. "},{"num":39,"verse":"Nicodemus came too (the man who, at first, had visited Jesus by night). He brought a concoction of myrrh and aloes, about a hundred pounds in weight. "},{"num":40,"verse":"They took Jesus’ body, and wrapped it up in cloths with the spices, according to the normal Judaean burial custom."},{"num":41,"verse":"There was a garden in the place where he was crucified. In the garden, there was a new tomb in which nobody had ever been buried. "},{"num":42,"verse":"So, because the tomb was nearby, and because of the Judaean day of Preparation, they buried Jesus there."}]