[{"num":19,"verse":"Therefore, then, Pilate took Rebbe, Melech HaMoshiach and had him scourged. [DEVARIM 25:3; YESHAYAH 50:6; 53:5]"},{"num":2,"verse":"And the [Roman] chaiyalim (soldiers), having woven a wreath out of thorns, put it on his rosh and a purple [royal] robe they threw around Rebbe, Melech HaMoshiach."},{"num":3,"verse":"And they were coming up to Rebbe, Melech HaMoshiach, and they were saying, Hail! You Melech HaYehudim! And they were repeatedly striking him in the face."},{"num":4,"verse":"And Pilate went outside again and says to them, Hinei, I bring him outside to you, in order that you may have da’as that I find no avon (offense), no cause for punishment, in him."},{"num":5,"verse":"Therefore, Rebbe, Melech HaMoshiach came forth outside, wearing the wreath of thorns and the purple robe. And Pilate says to them, Hinei HaIsh! (ZECHARYAH 6:12)"},{"num":6,"verse":"Therefore, when the Rashei Hakohanim and the mesharetim saw Rebbe, Melech HaMoshiach, they cried out, saying, Hang him on HaEtz! Hang him on HaEtz! Pilate says to them, You take him and you hang him on HaEtz! I find no avon in him. [DEVARIM 21:22]"},{"num":7,"verse":"In reply, those of Yehudah said, We have a Torah and, according to the Torah, he must die [VAYIKRA 24:16], because he made himself to be the Ben HaElohim."},{"num":8,"verse":"Therefore, when Pilate heard this dvar he was afraid even more."},{"num":9,"verse":"And Pilate entered into the Praetorium again and says to Rebbe, Melech HaMoshiach, From where are you? But Rebbe, Melech HaMoshiach did not give an answer (YESHAYAH 53:7)."},{"num":10,"verse":"Therefore, Pilate says to Rebbe, Melech HaMoshiach, To me you do not speak? Do you not have da’as that I have samchut (authority) to free you and I have samchut (authority) to hang you on HaEtz?"},{"num":11,"verse":"In reply, Rebbe, Melech HaMoshiach answered him, You do not have samchut (authority) against me at all, except it had been given to you from above; therefore, the avon is gadol, is even greater, the avon of the one having handed me over to you."},{"num":12,"verse":"From this point, Pilate began seeking to free Rebbe, Melech HaMoshiach; but those of Yehudah cried out, saying, If this man you free, you are no friend of Caesar’s; everyone making himself a Melech speaks against Caesar."},{"num":13,"verse":"Therefore, Pilate, having heard these dvarim, led Rebbe, Melech HaMoshiach out, and Pilate sat down upon a tribunal (seat of judgment) in a place being called The Pavement ([Aramaic] Gabta)."},{"num":14,"verse":"Now Erev Pesach was fast approaching, the sha’ah (hour, time) being about the shishit (sixth, the sixth hour, about noon, i.e.,with Erev Pesach coming at sundown), and Pilate says to those of Yehudah, Hinei your Melech!"},{"num":15,"verse":"Therefore, these cried out, Away, away, hang him on HaEtz! Pilate says to them, Shall I hang on HaEtz your Melech? In reply, the Kohen Gadol said, We do not have a Melech except Caesar."},{"num":16,"verse":"Then, therefore, Pilate delivered Rebbe, Melech HaMoshiach to them that he should be hanged on HaEtz. [DEVARIM 21:22] Therefore, they took Rebbe, Melech HaMoshiach."},{"num":17,"verse":"And carrying by himself HaEtz (The Tree) [BERESHIS 22:6; DEVARIM 21:23], he went out to the place being called Mekom HaGulgolet (Place of the Skull), which is called in Aramaic Gulgolta."},{"num":18,"verse":"There they hanged Rebbe, Melech HaMoshiach on HaEtz and with him two others on this side and on that side, and, in the middle, Rebbe, Melech HaMoshiach."},{"num":19,"verse":"And, also, Pilate wrote out an inscription and had it placarded on top of HaEtz (The Tree). And what it said was, YEHOSHUA, THE ONE FROM NATZERET, MELECH HAYEHUDIM."},{"num":20,"verse":"This inscription, therefore, many of those of Yehudah read, because the place where Rebbe, Melech HaMoshiach was hanged on HaEtz was near the Ir (City). And it had been written in Ivrit, in Latin, and in Greek."},{"num":21,"verse":"Therefore, the Judean Rashei Hakohanim were saying to Pilate, Do not write Melech HaYehudim. Rather write, That one said I am Melech HaYehudim."},{"num":22,"verse":"In reply, Pilate said, What I have written, I have written [1Chr 21:17; Isa 53:8]."},{"num":23,"verse":"Therefore the chaiyalim (soldiers), when they hanged Rebbe, Melech HaMoshiach on HaEtz, took his garments and divided them into arba’ah (four) parts, to each chaiyal (soldier) a part. They also took his kesones (VAYIKRA 16:4; TEHILLIM 110:4). Now the kesones was seamless, woven from the top in one piece."},{"num":24,"verse":"Therefore, they said to one another, Let us not tear it but let us cast lots for it (ESTHER 3:7) to see whose it will be. They did this in order that the Kitvei Hakodesh might be fulfilled, that which says, YECHALKU VEGADAI LAHEM V’AL LEVUSHI YAPILU GORAL (They divide my garments among them and for my clothing they cast lots.) [TEHILLIM 22:19 (18), SHEMOT 28:32] Therefore the chaiyalim did these things."},{"num":25,"verse":"But there had stood beside HaEtz (Tree) of Rebbe, Melech HaMoshiach his Em (Mother) and the achot (sister) of his Em, and Miryam the wife of Klofah, and Miryam from Magdala."},{"num":26,"verse":"Rebbe, Melech HaMoshiach, therefore, having seen his Em (Mother) and the talmid haahuv having stood by, says to his Em, Isha, hinei your ben!"},{"num":27,"verse":"Then Rebbe, Melech HaMoshiach says to the talmid haahuv, Hinei, Imecha (your Mother)! And from that sha’ah (hour, time) the talmid took her into his own bais."},{"num":28,"verse":"After this, having had da’as that already everything has become shleimah, Rebbe, Melech HaMoshiach, that the Kitvei Hakodesh may be fulfilled, says, Ani tzameh (I thirst) [TEHILLIM 22:16(15)]."},{"num":29,"verse":"A k’li (vessel) full of sour wine chometz vinegar was set there [TEHILLIM 69:22(21)]. The sponge full of vinegar having been wrapped around a hyssop branch [SHEMOT 12:22] they brought to his mouth."},{"num":30,"verse":"Therefore, when Rebbe, Melech HaMoshiach received the vinegar, he said, Nishlam! (It is finished!) [IYOV 19:26-27 TARGUM HASHIVIM] And having bowed his rosh, Rebbe, Melech HaMoshiach gave up his neshamah."},{"num":31,"verse":"Therefore, those of Yehudah, vi-bahlt (since) it was Preparation Day [with Chag and Shabbos fast approaching], they did not want the geviyot to be left on HaEtz (Tree) [Ex 12:16; Dt 21:22-23; Josh 8:29; 10:26-27] during Shabbos, for it was Shabbat HaGadol [VAYIKRA 23:11], requested Pilate to have the legs broken and the geviyot taken away."},{"num":32,"verse":"Therefore the chaiyalim (soldiers) came and broke the first man’s legs and then the other one hanging on HaEtz."},{"num":33,"verse":"But having come to Rebbe, Melech HaMoshiach, when they saw that he was already niftar (deceased), they did not break his legs."},{"num":34,"verse":"But one of the chaiyalim pierced [ZECHARYAH 12:10] his side with a romakh (spear) and immediately out came dahm and mayim."},{"num":35,"verse":"And the ed re’iyah (eyewitness) of this has given solemn edut (testimony). And his edut is ne’emanah (trustworthy). And that one has da’as that he speaks Emes that you might have emunah."},{"num":36,"verse":"For these things happened that the Kitvei Hakodesh [19:24, 28,37] might be fulfilled, V’ETZEM LO TISHBERU VO (And not a bone of him shall be broken). [SHEMOT 12:46; BAMIDBAR 9:12; TEHILLIM 34:20-21]"},{"num":37,"verse":"And again the Kitvei Hakodesh says, V’HIBITU on him ES ASHER DAKARU (And they will look on him whom they pierced.) [ZECHARYAH 12:10]"},{"num":38,"verse":"Now after these things, Yosef from Ramatayim, being a talmid of Rebbe, Melech HaMoshiach, but besod (in secret) because of fear of those of Yehudah, requested Pilate that he might take the gufat Yehoshua (Ps 16:9-10; Job 19:25-27; Isa 53:11) and Pilate allowed it. Yosef from Ramatayim came, therefore, and took the gufat Yehoshua."},{"num":39,"verse":"And also Rav Nakdimon came, the one having come first to Rebbe, Melech HaMoshiach balailah, bearing a mixture of myrrh and aloes, about one hundred pounds."},{"num":40,"verse":"Therefore, they took the Guf HaYeshua (Body of Yehoshua) and bound it in linen clothes with spices as is the burial minhag with the Yehudim."},{"num":41,"verse":"Now there was in the place where Rebbe, Melech HaMoshiach was pierced on HaEtz a gahn (garden) and in the gahn a kever chadash (new tomb) in which never yet anyone had been placed."},{"num":42,"verse":"And so, because it was Preparation Day for those of Yehudah and because the kever was nearby, they laid Moshiach there."}]