[[],[{"type":"prose","content":"Then, therefore, did Pilate take Jesus and scourge [him],"}],[{"type":"prose","content":"and the soldiers having plaited a crown of thorns, did place [it] on his head, and a purple garment they put around him,"}],[{"type":"prose","content":"and said, `Hail! the king of the Jews;' and they were giving him slaps."}],[{"type":"prose","content":"Pilate, therefore, again went forth without, and saith to them, `Lo, I do bring him to you without, that ye may know that in him I find no fault;'"}],[{"type":"prose","content":"Jesus, therefore, came forth without, bearing the thorny crown and the purple garment; and he saith to them, `Lo, the man!'"}],[{"type":"prose","content":"When, therefore, the chief priests and the officers did see him, they cried out, saying, `Crucify, crucify;' Pilate saith to them, `Take ye him -- ye, and crucify; for I find no fault in him;'"}],[{"type":"prose","content":"the Jews answered him, `We have a law, and according to our law he ought to die, for he made himself Son of God.'"}],[{"type":"prose","content":"When, therefore, Pilate heard this word, he was the more afraid,"}],[{"type":"prose","content":"and entered again to the praetorium, and saith to Jesus, `Whence art thou?' and Jesus gave him no answer."}],[{"type":"prose","content":"Pilate, therefore, saith to him, `To me dost thou not speak? hast thou not known that I have authority to crucify thee, and I have authority to release thee?'"}],[{"type":"prose","content":"Jesus answered, `Thou wouldst have no authority against me, if it were not having been given thee from above; because of this, he who is delivering me up to thee hath greater sin.'"}],[{"type":"prose","content":"From this [time] was Pilate seeking to release him, and the Jews were crying out, saying, `If this one thou mayest release, thou art not a friend of Caesar; every one making himself a king, doth speak against Caesar.'"}],[{"type":"prose","content":"Pilate, therefore, having heard this word, brought Jesus without -- and he sat down upon the tribunal -- to a place called, `Pavement,' and in Hebrew, Gabbatha;"}],[{"type":"prose","content":"and it was the preparation of the passover, and as it were the sixth hour, and he saith to the Jews, `Lo, your king!'"}],[{"type":"prose","content":"and they cried out, `Take away, take away, crucify him;' Pilate saith to them, `Your king shall I crucify?' the chief priests answered, `We have no king except Caesar.'"}],[{"type":"prose","content":"Then, therefore, he delivered him up to them, that he may be crucified, and they took Jesus and led [him] away,"}],[{"type":"prose","content":"and bearing his cross, he went forth to the place called [Place] of a Skull, which is called in Hebrew Golgotha;"}],[{"type":"prose","content":"where they crucified him, and with him two others, on this side, and on that side, and Jesus in the midst."}],[{"type":"prose","content":"And Pilate also wrote a title, and put [it] on the cross, and it was written, `Jesus the Nazarene, the king of the Jews;'"}],[{"type":"prose","content":"this title, therefore, read many of the Jews, because the place was nigh to the city where Jesus was crucified, and it was having been written in Hebrew, in Greek, in Roman."}],[{"type":"prose","content":"The chief priests of the Jews said, therefore, to Pilate, `Write not -- The king of the Jews, but that one said, I am king of the Jews;'"}],[{"type":"prose","content":"Pilate answered, `What I have written, I have written.'"}],[{"type":"prose","content":"The soldiers, therefore, when they did crucify Jesus, took his garments, and made four parts, to each soldier a part, also the coat, and the coat was seamless, from the top woven throughout,"}],[{"type":"prose","content":"they said, therefore, to one another, `We may not rend it, but cast a lot for it, whose it shall be;' that the Writing might be fulfilled, that is saying, `They divided my garments to themselves, and upon my raiment they did cast a lot;' the soldiers, therefore, indeed, did these things."}],[{"type":"prose","content":"And there stood by the cross of Jesus his mother, and his mother's sister, Mary of Cleopas, and Mary the Magdalene;"}],[{"type":"prose","content":"Jesus, therefore, having seen [his] mother, and the disciple standing by, whom he was loving, he saith to his mother, `Woman, lo, thy son;'"}],[{"type":"prose","content":"afterward he saith to the disciple, `Lo, thy mother;' and from that hour the disciple took her to his own [home]."}],[{"type":"prose","content":"After this, Jesus knowing that all things now have been finished, that the Writing may be fulfilled, saith, `I thirst;'"}],[{"type":"prose","content":"a vessel, therefore, was placed full of vinegar, and they having filled a sponge with vinegar, and having put [it] around a hyssop stalk, did put [it] to his mouth;"}],[{"type":"prose","content":"when, therefore, Jesus received the vinegar, he said, `It hath been finished;' and having bowed the head, gave up the spirit."}],[{"type":"prose","content":"The Jews, therefore, that the bodies might not remain on the cross on the sabbath, since it was the preparation, (for that sabbath day was a great one,) asked of Pilate that their legs may be broken, and they taken away."}],[{"type":"prose","content":"The soldiers, therefore, came, and of the first indeed they did break the legs, and of the other who was crucified with him,"}],[{"type":"prose","content":"and having come to Jesus, when they saw him already having been dead, they did not break his legs;"}],[{"type":"prose","content":"but one of the soldiers with a spear did pierce his side, and immediately there came forth blood and water;"}],[{"type":"prose","content":"and he who hath seen hath testified, and his testimony is true, and that one hath known that true things he speaketh, that ye also may believe."}],[{"type":"prose","content":"For these things came to pass, that the Writing may be fulfilled, `A bone of him shall not be broken;'"}],[{"type":"prose","content":"and again another Writing saith, `They shall look to him whom they did pierce.'"}],[{"type":"prose","content":"And after these things did Joseph of Arimathea -- being a disciple of Jesus, but concealed, through the fear of the Jews -- ask of Pilate, that he may take away the body of Jesus, and Pilate gave leave; he came, therefore, and took away the body of Jesus,"}],[{"type":"prose","content":"and Nicodemus also came -- who came unto Jesus by night at the first -- bearing a mixture of myrrh and aloes, as it were, a hundred pounds."}],[{"type":"prose","content":"They took, therefore, the body of Jesus, and bound it with linen clothes with the spices, according as it was the custom of the Jews to prepare for burial;"}],[{"type":"prose","content":"and there was in the place where he was crucified a garden, and in the garden a new tomb, in which no one was yet laid;"}],[{"type":"prose","content":"there, therefore, because of the preparation of the Jews, because the tomb was nigh, they laid Jesus."}]]