[{"header":"A Large Crowd of Witnesses"},{"num":12,"verse":"Such a large crowd of witnesses is all around us! So we must get rid of everything that slows us down, especially the sin that just won’t let go. And we must be determined to run the race that is ahead of us. "},{"num":2,"verse":"We must keep our eyes on Jesus, who leads us and makes our faith complete. He endured the shame of being nailed to a cross, because he knew that later on he would be glad he did. Now he is seated at the right side of God’s throne! "},{"num":3,"verse":"So keep your mind on Jesus, who put up with many insults from sinners. Then you won’t get discouraged and give up."},{"num":4,"verse":"None of you have yet been hurt in your battle against sin. "},{"num":5,"verse":"But you have forgotten that the Scriptures say to God’s children,"},{"num":7,"verse":"Be patient when you are being corrected! This is how God treats his children. Don’t all parents correct their children? "},{"num":8,"verse":"God corrects all of his children, and if he doesn’t correct you, then you don’t really belong to him. "},{"num":9,"verse":"Our earthly fathers correct us, and we still respect them. Isn’t it even better to be given true life by letting our spiritual Father correct us?"},{"num":10,"verse":"Our human fathers correct us for a short time, and they do it as they think best. But God corrects us for our own good, because he wants us to be holy, as he is. "},{"num":11,"verse":"It is never fun to be corrected. In fact, at the time it is always painful. But if we learn to obey by being corrected, we will do right and live at peace."},{"num":12,"verse":"Now stand up straight! Stop your knees from shaking "},{"num":13,"verse":"and walk a straight path. Then lame people will be healed, instead of getting worse."},{"header":"Warning against Turning from God"},{"num":14,"verse":"Try to live at peace with everyone! Live a clean life. If you don’t, you will never see the Lord. "},{"num":15,"verse":"Make sure that no one misses out on God’s wonderful kindness. Don’t let anyone become bitter and cause trouble for the rest of you. "},{"num":16,"verse":"Watch out for immoral and ungodly people like Esau, who sold his future blessing for only one meal. "},{"num":17,"verse":"You know how he later wanted it back. But there was nothing he could do to change things, even though he begged his father and cried."},{"num":18,"verse":"You have not come to a place like Mount Sinai that can be seen and touched. There is no flaming fire or dark cloud or storm "},{"num":19,"verse":"or trumpet sound. The people of Israel heard a voice speak. But they begged it to stop, "},{"num":20,"verse":"because they could not obey its commands. They were even told to kill any animal that touched the mountain. "},{"num":21,"verse":"The sight was so frightening that Moses said he shook with fear."},{"num":22,"verse":"You have now come to Mount Zion and to the heavenly Jerusalem. This is the city of the living God, where thousands and thousands of angels have come to celebrate. "},{"num":23,"verse":"Here you will find all of God’s dearest children, whose names are written in heaven. And you will find God himself, who judges everyone. Here also are the spirits of those good people who have been made perfect. "},{"num":24,"verse":"And Jesus is here! He is the one who makes God’s new agreement with us, and his sprinkled blood says much better things than the blood of Abel."},{"num":25,"verse":"Make sure that you obey the one who speaks to you. The people did not escape, when they refused to obey the one who spoke to them at Mount Sinai. Do you think you can possibly escape, if you refuse to obey the one who speaks to you from heaven? "},{"num":26,"verse":"When God spoke the first time, his voice shook only the earth. This time he has promised to shake the earth once again, and heaven too."},{"num":27,"verse":"The words “once again” mean that these created things will someday be shaken and removed. Then what cannot be shaken will last. "},{"num":28,"verse":"We should be grateful that we were given a kingdom that cannot be shaken. And in this kingdom we please God by worshiping him and by showing him great honor and respect. "},{"num":29,"verse":"Our God is like a destructive fire!"}]