[{"header":"The Discipline of the Lord"},{"num":12,"verse":"Therefore, since we are encompassed with such a great cloud of witnesses, let us also lay aside every weight and the sin that so easily entangles us, and let us run with endurance the race that is set before us. "},{"num":2,"verse":"Let us look to Jesus, the author and finisher of our faith, who for the joy that was set before Him endured the cross, despising the shame, and is seated at the right hand of the throne of God. "},{"num":3,"verse":"For consider Him who endured such hostility from sinners against Himself, lest you become weary and your hearts give up."},{"num":4,"verse":"You have not yet resisted to bloodshed while striving against sin. "},{"num":5,"verse":"And you have forgotten the exhortation addressed to you as sons:"},{"num":7,"verse":"Endure discipline; God is dealing with you as with sons. For what son is there whom a father does not discipline? "},{"num":8,"verse":"If you are without discipline, of which everyone has partaken, then you are illegitimate children and not sons. "},{"num":9,"verse":"Furthermore, we have had human fathers, and they corrected us, and we gave them reverence. Shall we not much more be subject to the Father of spirits and live? "},{"num":10,"verse":"For they indeed disciplined us for a short time according to their own judgment, but He does so for our profit, that we may partake of His holiness. "},{"num":11,"verse":"Now no discipline seems to be joyful at the time, but grievous. Yet afterward it yields the peaceful fruit of righteousness in those who have been trained by it."},{"num":12,"verse":"Therefore lift up your tired hands, and strengthen your weak knees. "},{"num":13,"verse":"Make straight paths for your feet, lest that which is lame go out of joint, but rather be healed."},{"header":"Warning Against Rejecting God’s Grace"},{"num":14,"verse":"Pursue peace with all men, and the holiness without which no one will see the Lord, "},{"num":15,"verse":"watching diligently so that no one falls short of the grace of God, lest any root of bitterness spring up to cause trouble, and many become defiled by it, "},{"num":16,"verse":"lest there be any sexually immoral or profane person, as Esau, who for one morsel of food sold his birthright. "},{"num":17,"verse":"For you know that afterward, when he wanted to inherit the blessing, he was rejected. For he found no place for repentance, though he sought it diligently with tears."},{"num":18,"verse":"You have not come to a mountain that can be touched and that burned with fire, and to blackness and darkness and storm, "},{"num":19,"verse":"and to the sound of a trumpet and to a voice speaking words, such that those who heard them begged that the word not be spoken to them anymore. "},{"num":20,"verse":"For they could not endure that which was commanded: “If so much as a beast touches the mountain, it must be stoned or thrust through with a spear.” "},{"num":21,"verse":"So terrible was the sight that Moses said, “I am terrified and trembling.”"},{"num":22,"verse":"But you have come to Mount Zion and to the city of the living God, the heavenly Jerusalem, and to an innumerable company of angels; "},{"num":23,"verse":"to the general assembly and church of the firstborn, who are enrolled in heaven; to God, the Judge of all; and to the spirits of the righteous ones made perfect; "},{"num":24,"verse":"and to Jesus, the Mediator of a new covenant; and to the sprinkled blood that speaks better than that of Abel."},{"num":25,"verse":"See that you do not refuse Him who is speaking. For if they did not escape when they refused Him who spoke on earth, much less shall we escape if we turn away from Him who speaks from heaven. "},{"num":26,"verse":"At that time His voice shook the earth, but now He has given us a promise, saying, “Yet once more I will shake not only the earth but also heaven.” "},{"num":27,"verse":"And this statement, “Yet once more,” signifies the removal of those things that can be shaken, things that are created, so that only those things that cannot be shaken will remain."},{"num":28,"verse":"Therefore, since we are receiving a kingdom that cannot be moved, let us be gracious, by which we may serve God acceptably with reverence and godly fear. "},{"num":29,"verse":"For our God is a consuming fire."}]