[{"header":"Angel of Adonai in a Burning Bush"},{"num":3,"verse":"Now Moses was tending the flock of his father-in-law Jethro, the priest of Midian. So he led the flock to the farthest end of the wilderness, coming to the mountain of God, Horeb."},{"num":2,"verse":" Then the angel of Adonai appeared to him in a flame of fire from within a bush. So he looked and saw the bush burning with fire, yet it was not consumed. "},{"num":3,"verse":"Moses thought, “I will go now, and see this great sight. Why is the bush not burnt?”"},{"num":4,"verse":"When Adonai saw that he turned to look, He called to him out of the midst of the bush and said, “Moses, Moses!”"},{"num":5,"verse":"Then He said, “Come no closer. Take your sandals off your feet, for the place where you are standing is holy ground.” "},{"num":6,"verse":"Moreover He said, “I am the God of your father, the God of Abraham, Isaac and Jacob.” So Moses hid his face, because he was afraid to look at God."},{"num":7,"verse":"Then Adonai said, “I have surely seen the affliction of My people who are in Egypt, and have heard their cry because of their slave masters, for I know their pains. "},{"num":8,"verse":"So I have come down to deliver them out of the hand of the Egyptians, to bring them up out of that land into a good and large land, a land flowing with milk and honey, into the place of the Canaanites, Hittites, Amorites, Perizzites, Hivites and Jebusites."},{"num":9,"verse":" Now behold, the cry of Bnei-Yisrael has come to Me. Moreover I have seen the oppression that the Egyptians have inflicted on them. "},{"num":10,"verse":"Come now, I will send you to Pharaoh, so that you may bring My people Bnei-Yisrael out from Egypt.”"},{"num":11,"verse":"But Moses said to God, “Who am I, that I should go to Pharaoh, and bring Bnei-Yisrael out of Egypt?”"},{"num":12,"verse":"So He said, “I will surely be with you. So that will be the sign to you that it is I who have sent you. When you have brought the people out of Egypt: you will worship God on this mountain.”"},{"num":13,"verse":"But Moses said to God, “Suppose I go to Bnei-Yisrael and say to them, ‘The God of your fathers has sent me to you,’ and they ask me, ‘What is His Name?’ What should I say to them?”"},{"num":14,"verse":"God answered Moses, “I AM WHO I AM.” Then He said, “You are to say to Bnei-Yisrael, ‘I AM’ has sent me to you.” "},{"num":15,"verse":"God also said to Moses: “You are to say to Bnei-Yisrael, Adonai, the God of your fathers, the God of Abraham, Isaac and Jacob, has sent me to you. This is My Name forever, and the Name by which I should be remembered from generation to generation."},{"num":16,"verse":"“Go now, gather the elders of Israel together, and say to them: ‘Adonai, the God of your fathers—the God of Abraham, Isaac and Jacob—has appeared to me, saying, I have been paying close attention to you and have seen what is done to you in Egypt. "},{"num":17,"verse":"So I promise I will bring you up out of the affliction of Egypt, into the land of the Canaanites, Hittites, Amorites, Perizzites, Hivites and Jebusites, to a land flowing with milk and honey.’"},{"num":18,"verse":"“They will listen to your voice. So you will go, you along with the elders of Israel, to the king of Egypt, and say to him: ‘Adonai, the God of the Hebrews, has met with us. Now please let us take a three-day journey into the wilderness, so that we may sacrifice to Adonai our God.’ "},{"num":19,"verse":"Nevertheless, I know that the king of Egypt will not let you go, except by a mighty hand. "},{"num":20,"verse":"So I will stretch out My hand and strike Egypt with all My wonders that I will do in the midst of it. After that, he will let you go."},{"num":21,"verse":"“Then I shall grant these people favor in the eyes of the Egyptians. So it will happen that when you go, you will not leave empty-handed. "},{"num":22,"verse":"Every woman is to ask her neighbor and the woman who lives in her house for silver and gold jewelry and clothing. You will put them on your sons and your daughters. So you will plunder the Egyptians.”"}]