[{"header":"The Rewards of Wisdom"},{"num":2,"verse":"My child, learn what I teach you and never forget what I tell you to do. "},{"num":2,"verse":"Listen to what is wise and try to understand it. "},{"num":3,"verse":"Yes, beg for knowledge; plead for insight. "},{"num":4,"verse":"Look for it as hard as you would for silver or some hidden treasure. "},{"num":5,"verse":"If you do, you will know what it means to fear the Lord and you will succeed in learning about God. "},{"num":6,"verse":"It is the Lord who gives wisdom; from him come knowledge and understanding. "},{"num":7,"verse":"He provides help and protection for those who are righteous and honest. "},{"num":8,"verse":"He protects those who treat others fairly, and guards those who are devoted to him."},{"num":9,"verse":"If you listen to me, you will know what is right, just, and fair. You will know what you should do. "},{"num":10,"verse":"You will become wise, and your knowledge will give you pleasure. "},{"num":11,"verse":"Your insight and understanding will protect you "},{"num":12,"verse":"and prevent you from doing the wrong thing. They will keep you away from people who stir up trouble by what they say— "},{"num":13,"verse":"those who have abandoned a righteous life to live in the darkness of sin, "},{"num":14,"verse":"those who find pleasure in doing wrong and who enjoy senseless evil, "},{"num":15,"verse":"unreliable people who cannot be trusted."},{"num":16,"verse":"You will be able to resist any immoral woman who tries to seduce you with her smooth talk, "},{"num":17,"verse":"who is faithless to her own husband and forgets her sacred vows. "},{"num":18,"verse":"If you go to her house, you are traveling the road to death. To go there is to approach the world of the dead. "},{"num":19,"verse":"No one who visits her ever comes back. He never returns to the road to life. "},{"num":20,"verse":"So you must follow the example of good people and live a righteous life. "},{"num":21,"verse":"Righteous people—people of integrity—will live in this land of ours. "},{"num":22,"verse":"But God will snatch the wicked from the land and pull sinners out of it like plants from the ground."}]