[{"header":"Molten Calf and Smashing Tablets"},{"num":32,"verse":"Now when the people saw that Moses delayed coming down from the mountain, they gathered around Aaron and said to him, “Get up, make us gods who will go before us. As for this Moses, the man that brought us up out of the land of Egypt, we do not know what’s become of him!”"},{"num":2,"verse":"So Aaron said to them, “Break off the golden rings that are in the ears of your wives, your sons and your daughters, and bring them to me.” "},{"num":3,"verse":"So all the people broke off the golden rings that were in their ears and brought them to Aaron. "},{"num":4,"verse":"He received them from their hand, and made a molten calf, fashioned with a chiseling tool."},{"num":5,"verse":"When Aaron saw it, he built an altar before it. Then Aaron made a proclamation saying, “Tomorrow will be a feast to Adonai.” "},{"num":6,"verse":"They rose up early the next morning, sacrificed burnt offerings and brought fellowship offerings. The people sat down to eat and drink, and rose up to make merry."},{"num":7,"verse":"Then Adonai said to Moses, “Go down! For your people, whom you brought up out of the land of Egypt, have become debased. "},{"num":8,"verse":"They quickly turned aside from the path that I commanded for them. They have made a molten calf, worshipped it, and sacrificed to it, and said, ‘This is your god, O Israel, that brought you up out of the land of Egypt.’”"},{"num":9,"verse":"Adonai said to Moses, “I have seen this people, and behold, it is a stiff-necked people. "},{"num":10,"verse":"Now therefore, leave Me alone, so My wrath may burn hot against them, and so I may consume them—and make from you a great nation!”"},{"num":11,"verse":"Then Moses sought Adonai his God and said, “Adonai, why should Your wrath burn hot against Your people, whom You have brought forth out of the land of Egypt with great power and with a mighty hand? "},{"num":12,"verse":"Why should the Egyptians say, ‘He brought them out to do evil, to slay them in the mountains, and to annihilate them from the face of the earth?’ Turn from Your fierce wrath, and relent from this destruction against Your people. "},{"num":13,"verse":"Remember Abraham, Isaac and Israel, Your servants, to whom You swore by Your own self, and said to them, ‘I will multiply your seed as the stars of heaven, and all this land that I have spoken of I will give to your offspring, and they will inherit it forever.’”"},{"num":14,"verse":"So Adonai relented from the destruction that He said He would do to His people."},{"num":15,"verse":"Then Moses turned and went down from the mountain, with the two tablets of the Testimony in his hand, tablets that were written on both sides, on one and on the other. "},{"num":16,"verse":"The tablets were the work of God, and the writing was the writing of God, engraved on the tablets."},{"num":17,"verse":"When Joshua heard the noise of the people as they shouted, he said to Moses, “There is the sound of war within the camp.” "},{"num":18,"verse":"But Moses said:"},{"num":19,"verse":"Then it happened, as soon as Moses came near the camp, he saw the calf and the dancing, and his anger burned hot. So he threw the tablets out of his hands, and smashed them at the foot of the mountain. "},{"num":20,"verse":"Then he took the calf that they had made, burned it with fire, ground it to powder, scattered it on the surface of the water and made Bnei-Yisrael drink it."},{"num":21,"verse":"Then Moses said to Aaron, “What did this people do to you, to make you bring such a great sin upon them?”"},{"num":22,"verse":"Aaron said, “Don’t be angry, my lord! You know these people yourself, and how they are set on evil. "},{"num":23,"verse":"They said to me, ‘Make gods for us, to go before us! As for this Moses, the man that brought us up out of the land of Egypt, we don’t know what happened to him.’ "},{"num":24,"verse":"So I said to them, ‘Whoever has any gold, let them break it off.’ So they gave it to me and I threw it into the fire—and out came this calf!”"},{"num":25,"verse":"When Moses saw that the people were unrestrained, because Aaron had let them run wild, to become a joke among their enemies, "},{"num":26,"verse":"Moses stood at the gate of the camp and said, “Whoever is on Adonai’s side, let him come to me.” Then all the sons of Levi gathered themselves together to him."},{"num":27,"verse":"He said to them, “This is what Adonai, the God of Israel says, ‘Every man put on his sword, and go to and fro, from gate to gate throughout the camp, and slay his brother, his friend, and his neighbor.’” "},{"num":28,"verse":"So the sons of Levi did as Moses said, and that day from among the people there fell about 3,000 men."},{"num":29,"verse":"Then Moses said, “Consecrate your hands today to Adonai so that He may give you a blessing today, for every man has been against his son and his brother.”"},{"num":30,"verse":"So it happened the following day, Moses said to the people, “You have committed a horrendous sin. So now I will go up to Adonai—perhaps I can make atonement for your sin.”"},{"num":31,"verse":"Then Moses returned to Adonai and said, “Alas, these people have sinned greatly, and made gods of gold! "},{"num":32,"verse":"Yet now, please forgive their sin. But if not, please blot me out of Your book that You have written.”"},{"num":33,"verse":"Adonai said to Moses, “Whoever has sinned against Me, I will blot out of My book. "},{"num":34,"verse":"Now go, lead the people to the place that I told you about. My angel will go before you. Nevertheless, on the day when I take account, I will hold them accountable for their sin.”"},{"num":35,"verse":"So Adonai struck the people because of what they did with the calf that Aaron had made."}]