[{"header":"Jeremiah Is Set Free"},{"num":40,"verse":"I was led away in chains along with the people of Judah and Jerusalem who were being taken to Babylonia. Nebuzaradan was the officer in charge of the guard, and while we were stopped at Ramah, the Lord had him set me free. "},{"num":2,"verse":"Nebuzaradan said:"},{"num":6,"verse":"I decided to stay with the people of Judah, and I went to live near Gedaliah in Mizpah."},{"header":"The Harvest Is Brought In"},{"num":7,"verse":"Ishmael the son of Nethaniah, together with Johanan and Jonathan, the two sons of Kareah, had been officers in Judah’s army. And so had Seraiah the son of Tanhumeth, the sons of Ephai the Netophathite, and Jezaniah from Maacah. They and their troops had been stationed outside Jerusalem and had not been captured. They heard that Gedaliah had been chosen to rule Judah, and that the poorest men, women, and children had not been taken away to Babylonia. So they went to Mizpah and met with their new ruler."},{"num":9,"verse":"Gedaliah told them, “There’s no need to be afraid of the Babylonians. Everything will be fine, if we live peacefully and obey King Nebuchadnezzar."},{"num":10,"verse":"I will stay here at Mizpah and meet with the Babylonian officials on each of their visits. But you must go back to your towns and bring in the harvest, then store the wine, olive oil, and dried fruit.”"},{"num":11,"verse":"Earlier, when the Babylonians had invaded Judah, many of the Jews escaped to Moab, Ammon, Edom, and several other countries. But these Jews heard that the king of Babylonia had appointed Gedaliah as ruler of Judah, and that only a few people were left there. So the Jews in these other countries came back to Judah and helped with the grape and fruit harvest, which was especially large that year."},{"header":"Gedaliah Is Murdered"},{"num":13,"verse":"One day, Johanan got together with some of the other men who had been army officers, and they came to Mizpah and met with Gedaliah. "},{"num":14,"verse":"They said, “Gedaliah, we came to warn you that King Baalis of Ammon hired Ishmael to murder you!”"},{"num":15,"verse":"so Johanan went to Gedaliah privately and said, “Let me kill Ishmael. No one will find out who did it. There are only a few people left in Judah, but they are depending on you. And if you are murdered, they will be scattered or killed.”"},{"num":16,"verse":"Gedaliah answered, “Don’t kill Ishmael! What you’ve said about him can’t be true.”"}]