[{"header":"Judah and Tamar"},{"num":38,"verse":"At that time, Judah left his brothers. He went down to stay with a man named Hirah from the town of Adullam. "},{"num":2,"verse":"There Judah met the daughter of a man from Canaan. His name was Shua. Judah married her and slept with her. "},{"num":3,"verse":"She became pregnant and had a son. They named him Er. "},{"num":4,"verse":"She became pregnant again and had another son. She named him Onan. "},{"num":5,"verse":"She had still another son. She named him Shelah. He was born at Kezib."},{"num":6,"verse":"Judah got a wife for his oldest son Er. Her name was Tamar. "},{"num":7,"verse":"But Judah’s oldest son Er was evil in the Lord’s eyes. So the Lord put him to death."},{"num":8,"verse":"Then Judah said to Onan, “Sleep with your brother’s wife. After all, you are her brother-in-law. So carry out your duty to her. Provide children for your brother.” "},{"num":9,"verse":"But Onan knew that the children wouldn’t belong to him. So every time he slept with his brother’s wife, he spilled his semen on the ground. He did it so he wouldn’t provide children for his brother. "},{"num":10,"verse":"What he did was evil in the Lord’s eyes. So the Lord put him to death also."},{"num":11,"verse":"Then Judah spoke to his daughter-in-law Tamar. He said, “Live as a widow in your father’s home. Wait there until my son Shelah grows up.” Judah was thinking, “Shelah might die too, just like his brothers.” So Tamar went to live in her father’s home."},{"num":12,"verse":"After a long time Judah’s wife died. She was the daughter of Shua. When Judah got over his sadness, he went up to Timnah. His friend Hirah from Adullam went with him. Men were clipping the wool from Judah’s sheep at Timnah."},{"num":13,"verse":"Tamar was told, “Your father-in-law is on his way to Timnah to clip the wool from his sheep.” "},{"num":14,"verse":"So she took off her widow’s clothes. She covered her face with a veil so people wouldn’t know who she was. Then she sat down at the entrance to Enaim. Enaim is on the road to Timnah. Tamar knew that Shelah had grown up. But she hadn’t been given to him as his wife."},{"num":15,"verse":"Judah saw her. He thought she was a prostitute because she had covered her face with a veil. "},{"num":16,"verse":"He didn’t realize that she was his daughter-in-law. He went over to her by the side of the road. He said, “Come. Let me sleep with you.”"},{"num":17,"verse":"“I’ll send you a young goat from my flock,” he said."},{"num":18,"verse":"He said, “What should I give you?”"},{"num":19,"verse":"After she left, she took off her veil. She put on her widow’s clothes again."},{"num":20,"verse":"Judah sent his friend Hirah with the young goat he had promised. He wanted to get back what he had given to the woman. But his friend Hirah couldn’t find her. "},{"num":21,"verse":"He asked the men who lived at Enaim, “Where’s the temple prostitute? She used to sit beside the road here.”"},{"num":22,"verse":"So Hirah went back to Judah. He said, “I couldn’t find her. Besides, the men who lived there didn’t know anything about her. They said, ‘There hasn’t been any temple prostitute here.’ ”"},{"num":23,"verse":"Then Judah said, “Let her keep what she has. I don’t want people making fun of us. After all, I did send her this young goat. We can’t help it if you couldn’t find her.”"},{"num":24,"verse":"About three months later people brought word to Judah. They said, “Your daughter-in-law Tamar is guilty of being a prostitute. Now she’s pregnant.”"},{"num":25,"verse":"As Tamar was being brought out, she sent a message to her father-in-law. She said, “I am pregnant by the man who owns these.” She continued, “Do you recognize this seal and string and walking stick? Do you know who they belong to?”"},{"num":26,"verse":"Judah recognized them. He said, “She’s a better person than I am. I should have given her to my son Shelah, but I didn’t.” Judah never slept with Tamar again."},{"num":27,"verse":"The time came for Tamar to have her baby. There were twin boys inside her. "},{"num":28,"verse":"As the babies were being born, one of them stuck out his hand. So the woman helping Tamar took a bright red thread. The woman tied it on the baby’s wrist. She said, “This one came out first.” "},{"num":29,"verse":"But he pulled his hand back, and his brother came out first instead. She said, “Just look at how you have forced your way out!” So he was called Perez. "},{"num":30,"verse":"Then his brother, who had the red thread on his wrist, came out. So he was named Zerah."}]