[{"num":38,"verse":"It was about this time that Judah decided to leave home, so he parted company with his brothers and went to see Hirah, a fellow from Adullam. "},{"num":2,"verse":"When he was there, Judah laid eyes on the daughter of a Canaanite man named Shua. He married her and slept with her. "},{"num":3,"verse":"She conceived and gave birth to her first son. Judah named him Er. "},{"num":4,"verse":"She conceived again and gave birth to her second son, whom she named Onan. "},{"num":5,"verse":"She then gave birth to her third son, and she named him Shelah. (Judah was away in Chezib when she gave birth to him.)"},{"num":6,"verse":"Now Judah arranged for Er, his firstborn, to marry a woman named Tamar. "},{"num":7,"verse":"But Er, Judah’s firstborn, was a particularly wretched human being in the eyes of the Eternal One, and so the Eternal ended his life. Judah summoned his second son, Onan."},{"num":9,"verse":"Resentful that any child born in this kind of marriage would not be his, Onan would interrupt intercourse and spill his semen onto the ground whenever he slept with his brother’s wife. That way he would not father a child that would belong to his brother. "},{"num":10,"verse":"Onan’s selfish behavior was as wretched as his brother’s to the eyes of the Eternal One; so the Eternal ended Onan’s life like his brother. "},{"num":11,"verse":"Judah summoned his daughter-in-law Tamar."},{"num":12,"verse":"After a while, Judah’s wife (Shua’s daughter) also died. When Judah’s time of mourning was over, he and his friend Hirah the Adullamite went to Timnah to work with his sheepshearers and enjoy the festivities. "},{"num":13,"verse":"When Tamar learned that her father-in-law would be coming to Timnah to shear his sheep, "},{"num":14,"verse":"she took off her widow’s clothes, put on a veil to conceal her true identity, and sat down at the entrance to Enaim along the road to Timnah. You see, Tamar harbored deep resentment toward her father-in-law because she knew by this time that Shelah had grown up, but she had not been given to him in marriage as Judah had promised. "},{"num":15,"verse":"When Judah passed by and saw her, he thought she was a prostitute because she had her face covered. "},{"num":16,"verse":"He decided to proposition her, so he walked over to her by the roadside."},{"num":19,"verse":"Then she got up, took off the veil, and went back home, putting on her widow’s clothes once again."},{"num":20,"verse":"Judah kept his word and sent his friend Hirah the Adullamite with the young goat so he could retrieve his seal and walking stick from the woman. But Judah’s friend couldn’t find her anywhere."},{"num":22,"verse":"Bewildered, the Adullamite returned to Judah."},{"num":24,"verse":"Approximately three months later, someone told Judah, “Your daughter-in-law Tamar has been promiscuous. It’s obvious her business has even made her pregnant.”"},{"num":25,"verse":"As she was being brought out, she sent word to her father-in-law."},{"num":26,"verse":"When Judah saw them, he realized they were his."},{"num":27,"verse":"When the time came for her to deliver, she discovered she was carrying twins. "},{"num":28,"verse":"While she was in labor, one of them put out a hand; and the midwife tied a scarlet thread on it, so she would know which one came out first. "},{"num":29,"verse":"But just then he drew his hand back into the womb, and his brother came out first. The midwife had never seen anything quite like this."},{"num":30,"verse":"His brother followed, the one with the scarlet thread on his hand. He was named Zerah."}]