[{"header":"Birth and Rule of the Prince of Peace"},{"num":9,"verse":"But there will be no more heavy hearts for those who were suffering. In the past God allowed the lands of Zebulun and Naphtali to be put to shame. In the future He will honor Galilee where those who are not Jews live and where the road to the sea is. It is on the other side of the Jordan. "},{"num":2,"verse":"The people who walk in darkness will see a great light. The light will shine on those living in the land of dark shadows. "},{"num":3,"verse":"You will make the nation great. You will give them great joy. They will be glad before You, as with the joy of gathering time, and as men have joy when they divide the riches taken after a battle. "},{"num":4,"verse":"For You will break the heavy load from their neck and shoulders. You will break the power of those who made it hard for them, as at the battle of Midian. "},{"num":5,"verse":"For every shoe of the soldiers in the battle, and every coat rolled in blood, will be burned in the fire. "},{"num":6,"verse":"For to us a Child will be born. To us a Son will be given. And the rule of the nations will be on His shoulders. His name will be called Wonderful, Teacher, Powerful God, Father Who Lives Forever, Prince of Peace. "},{"num":7,"verse":"There will be no end to His rule and His peace, upon the throne of David and over his nation. He will build it to last and keep it strong with what is right and fair and good from that time and forever. The work of the Lord of All will do this."},{"header":"Punishment against Israel"},{"num":8,"verse":"The Lord sends word against Jacob, and it falls on Israel. "},{"num":9,"verse":"And all the people will know it, that is, Ephraim and the people of Samaria. They say with a proud spirit in their hearts, "},{"num":10,"verse":"“The clay blocks have fallen down, but we will build again with smooth stones. The sycamore trees have been cut down, but we will put cedar trees in their place.” "},{"num":11,"verse":"So the Lord brings men from Rezin to fight against them. He makes those who hate them move to action. "},{"num":12,"verse":"The Syrians on the east and the Philistines on the west swallow Israel with an open mouth. Even with this, the Lord’s anger does not turn away. His hand is still held out."},{"num":13,"verse":"Yet the people do not return to Him Who punished them. They do not look to the Lord of All. "},{"num":14,"verse":"So the Lord will cut off the head and tail from Israel, both palm branch and river-grass in one day. "},{"num":15,"verse":"The leaders and men of honor are the head, and the tail is the false preachers who teach lies. "},{"num":16,"verse":"For those who lead these people are leading them from the right way, and those who are led by them are going the wrong way. "},{"num":17,"verse":"So the Lord is not pleased with their young men. He does not have pity on their children who have no parents or on their women whose husbands have died. Every one of them is without God and does sinful things. Every mouth speaks foolish words. Even with all this, His anger does not turn away. His hand is still held out."},{"num":18,"verse":"For sin burns like a fire. It burns thistles and thorns. It sets the woods on fire, and they go up in smoke. "},{"num":19,"verse":"The land is burned up by the anger of the Lord, and the people are like wood for the fire. No man shows pity on his brother. "},{"num":20,"verse":"They take what is on the right hand but still are hungry. They eat what is in the left hand but are not filled. Each of them eats the flesh of his own children. "},{"num":21,"verse":"Manasseh goes against Ephraim, and Ephraim goes against Manasseh. And together they are against Judah. Even with all this, the Lord’s anger does not turn away. His hand is still held out."}]