[{"num":7,"verse":"When the Lord your God brings you into the land that you are entering to take as a possession, and when he clears away many nations before you (the Hittites, the Girgashites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites, seven nations more numerous and stronger than you), "},{"num":2,"verse":"and when the Lord your God has given them over to you and he has struck them down, you are to devote them to destruction. Do not make a treaty with them, and do not show mercy to them. "},{"num":3,"verse":"Do not form marriage alliances with them. Do not give your daughters to their sons, and do not take their daughters for your sons, "},{"num":4,"verse":"because they will turn your sons away from following me, and they will serve other gods. The anger of the Lord will burn against you, and then he will destroy you quickly. "},{"num":5,"verse":"Instead, this is the way you must deal with them: Break down their altars. Smash their sacred memorial stones. Cut down their Asherah poles. Burn their idols with fire."},{"num":6,"verse":"For you are a people that is holy to the Lord your God, because the Lord your God has chosen you to belong to him as a people that is his treasured possession, chosen from all the peoples that are on the face of the earth. "},{"num":7,"verse":"The Lord became attached to you by love and has chosen you, not because you were more numerous than all the peoples. Actually you were the fewest of all the peoples. "},{"num":8,"verse":"But because of the Lord’s love for you and because he was keeping the oath that he swore to your fathers, that is why the Lord brought you out by a strong hand and redeemed you from the house of slavery, from the hand of Pharaoh king of Egypt."},{"num":9,"verse":"He did this so that you would know that the Lord your God, yes, he is God, the faithful God who maintains both his covenant and his mercy for those who love him and keep his commandments, to a thousand generations. "},{"num":10,"verse":"But he also repays the ones who hate him to their face by destroying them. He will not delay repaying anyone who hates him. To his face he will fully repay him. "},{"num":11,"verse":"So you are to be careful to keep the set of commandments and the statutes and the ordinances that I am commanding you today."},{"num":12,"verse":"When you obey these ordinances and are careful to keep them, the Lord your God will keep for your benefit the covenant and the mercy that he promised to your fathers with an oath. "},{"num":13,"verse":"He will love you and bless you and multiply you. He will bless the fruit from your womb and the fruit from your soil, your grain and your new wine and your fresh olive oil, the offspring of your cattle and the young of your flock upon the land that he swore to your fathers that he would give you. "},{"num":14,"verse":"You will be blessed beyond all the peoples. There will not be an infertile male or infertile female among you or among your livestock. "},{"num":15,"verse":"The Lord will remove from you all sickness, and he will not place on you all of the diseases of Egypt, the calamities that you experienced. Instead he will put them on all those who hate you. "},{"num":16,"verse":"You will consume all the peoples that the Lord your God is giving to you. Your eye is not to look with compassion on them. You are not to serve their gods, because that would be a snare to you."},{"num":17,"verse":"If you say in your heart, “These nations are more numerous than we are. How are we able to take possession of their land?” "},{"num":18,"verse":"do not be afraid of them. Be sure to remember what the Lord your God did to Pharaoh and to all the Egyptians. "},{"num":19,"verse":"The great test which your eyes saw and the signs and the wonders and the strong hand and the outstretched arm by which the Lord your God brought you out—that is what the Lord your God will do to all the peoples that you fear."},{"num":20,"verse":"The Lord your God will also send the hornet against them until those who are left and are hiding from you have been destroyed. "},{"num":21,"verse":"Do not be overwhelmed before them, because the Lord your God is right among you, a great and awe-inspiring God."},{"num":22,"verse":"The Lord your God, the God before you, will clear away the nations little by little. You will not succeed in finishing them off too quickly, so that the wild animals do not become too numerous for you. "},{"num":23,"verse":"But the Lord your God will give them over to you, and he will throw these peoples into complete confusion until they are destroyed. "},{"num":24,"verse":"He will give their kings into your hands, and he will cause their names to die out under the heavens, because none of them will be able to hold their ground against you until you have destroyed them. "},{"num":25,"verse":"Burn the images of their gods with fire, and do not covet the silver and gold on them or take it for yourself, so that you are not snared by it, because it is an abomination to the Lord your God. "},{"num":26,"verse":"Do not bring a detestable thing to your house and in that way become devoted to destruction just like it. Detest it and regard it as an utterly disgusting thing, because it is devoted to destruction."}]