[{"header":"Israel Is Commanded to Destroy the Canaanites and Their Idols"},{"num":7,"verse":"The Lord your God will bring you to the land you’re about to enter and take possession of. He will force many nations out of your way: the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites—seven nations larger and more powerful than you. "},{"num":2,"verse":"When the Lord your God gives them to you and you defeat them, destroy every one of them because they have been claimed by the Lord. Don’t make any treaties with them or show them any mercy. "},{"num":3,"verse":"Never marry any of them. Never let your daughters marry their sons or your sons marry their daughters. "},{"num":4,"verse":"These people will turn your children away from me to worship other gods. Then the Lord will get very angry with you and will quickly destroy you."},{"num":5,"verse":"But this is what you must do to these people: Tear down their altars, smash their sacred stones, cut down their poles dedicated to the goddess Asherah, and burn their idols. "},{"num":6,"verse":"You are a holy people, who belong to the Lord your God. He chose you to be his own special possession out of all the nations on earth."},{"num":7,"verse":"The Lord set his heart on you and chose you, even though you didn’t outnumber all the other people. You were the smallest of all nations. "},{"num":8,"verse":"You were chosen because the Lord loved you and kept the oath he swore to your ancestors. So he used his mighty hand to bring you out. He freed you from slavery under Pharaoh (the king of Egypt). "},{"num":9,"verse":"Keep in mind that the Lord your God is ⌞the only⌟ God. He is a faithful God, who keeps his promise  and is merciful to thousands of generations of those who love him and obey his commands. "},{"num":10,"verse":"But he sends destruction to pay back everyone who hates him. He never takes long to pay back anyone who hates him."},{"num":11,"verse":"So obey the commands, laws, and rules I’m giving you today."},{"num":12,"verse":"If you listen to these rules and faithfully obey them, the Lord your God will keep his promise to you and be merciful to you, as he swore to your ancestors. "},{"num":13,"verse":"He will love you, bless you, and increase the number of your descendants. He will bless you with children. He will bless your land with produce: grain, new wine, and olive oil. He will bless your herds with calves, and your flocks with lambs and kids. This will all happen in the land the Lord will give you, as he swore to your ancestors. "},{"num":14,"verse":"You will be blessed more than any other people. Your men and women will be able to have children, and your animals will be able to have offspring. "},{"num":15,"verse":"The Lord will keep you from having any kind of illness. He will not strike you with any of the terrible diseases you experienced in Egypt. Instead, he will strike all those who hate you. "},{"num":16,"verse":"You must destroy all the people the Lord your God hands over to you. Have no pity on them, and never worship their gods, because they will be a trap for you."},{"num":17,"verse":"You may say to yourselves, “These nations outnumber us. How can we force them out?” "},{"num":18,"verse":"Don’t be afraid of them. Remember what the Lord your God did to Pharaoh and all of Egypt. "},{"num":19,"verse":"You saw with your own eyes the terrible plagues, the miraculous signs, and the amazing things the Lord did. He used his mighty hand and powerful arm to bring you out. He will do the same thing to all the people you’re afraid of. "},{"num":20,"verse":"The Lord your God will spread panic among them until they all die. There will be no one left—not even those who were hiding from you. "},{"num":21,"verse":"Don’t be afraid of them, because the Lord your God is with you. He is a great and awe-inspiring God. "},{"num":22,"verse":"Little by little he will force these nations out of your way. You won’t be able to wipe them out quickly. Otherwise, you would be overrun with wild animals. "},{"num":23,"verse":"The Lord your God will hand these people over to you and will throw them into a great panic until they’re destroyed. "},{"num":24,"verse":"He will hand their kings over to you, and no one on earth will even remember their names. No one will be able to stop you. You will destroy them all. "},{"num":25,"verse":"Burn their idols. Don’t ever long for the silver and gold on these idols or take any of it for yourselves. It might be a trap for you. Besides, these idols are disgusting to the Lord your God. "},{"num":26,"verse":"Never bring a disgusting idol into your house. If you do, you and the idol will be destroyed. Consider it detestable and disgusting. It must be destroyed.”"}]