[{"header":"Chapter 7"},{"num":1,"verse":"Destruction of the Nations in the Land. When the Lord, your God, brings you into the land which you are about to enter to possess, and removes many nations before you—the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites, seven nations more numerous and powerful than you— "},{"num":2,"verse":"and when the Lord, your God, gives them over to you and you defeat them, you shall put them under the ban. Make no covenant with them and do not be gracious to them. "},{"num":3,"verse":"You shall not intermarry with them, neither giving your daughters to their sons nor taking their daughters for your sons. "},{"num":4,"verse":"For they would turn your sons from following me to serving other gods, and then the anger of the Lord would flare up against you and he would quickly destroy you."},{"num":5,"verse":"But this is how you must deal with them: Tear down their altars, smash their sacred pillars, chop down their asherahs, and destroy their idols by fire. "},{"num":6,"verse":"For you are a people holy to the Lord, your God; the Lord, your God, has chosen you from all the peoples on the face of the earth to be a people specially his own. "},{"num":7,"verse":"It was not because you are more numerous than all the peoples that the Lord set his heart on you and chose you; for you are really the smallest of all peoples. "},{"num":8,"verse":"It was because the Lord loved you and because of his fidelity to the oath he had sworn to your ancestors, that the Lord brought you out with a strong hand and redeemed you from the house of slavery, from the hand of Pharaoh, king of Egypt. "},{"num":9,"verse":"Know, then, that the Lord, your God, is God: the faithful God who keeps covenant mercy to the thousandth generation toward those who love him and keep his commandments, "},{"num":10,"verse":"but who repays with destruction those who hate him; he does not delay with those who hate him, but makes them pay for it. "},{"num":11,"verse":"Therefore carefully observe the commandment, the statutes and the ordinances which I command you today."},{"num":12,"verse":"Blessings of Obedience. As your reward for heeding these ordinances and keeping them carefully, the Lord, your God, will keep with you the covenant mercy he promised on oath to your ancestors. "},{"num":13,"verse":"He will love and bless and multiply you; he will bless the fruit of your womb and the produce of your soil, your grain and wine and oil, the young of your herds and the offspring of your flocks, in the land which he swore to your ancestors he would give you. "},{"num":14,"verse":"You will be blessed above all peoples; no man or woman among you shall be childless nor shall your livestock be barren. "},{"num":15,"verse":"The Lord will remove all sickness from you; he will not afflict you with any of the malignant diseases that you know from Egypt, but will leave them with all those who hate you."},{"num":16,"verse":"You shall consume all the peoples which the Lord, your God, is giving over to you. You are not to look on them with pity, nor serve their gods, for that would be a snare to you. "},{"num":17,"verse":"If you say to yourselves, “These nations are more numerous than we. How can we dispossess them?” "},{"num":18,"verse":"do not be afraid of them. Rather, remember clearly what the Lord, your God, did to Pharaoh and to all Egypt: "},{"num":19,"verse":"the great testings which your own eyes have seen, the signs and wonders, the strong hand and outstretched arm with which the Lord, your God, brought you out. The same also will he do to all the peoples of whom you are now afraid. "},{"num":20,"verse":"Moreover, the Lord, your God, will send hornets among them, until those who are left and those who are hiding from you are destroyed. "},{"num":21,"verse":"Therefore, do not be terrified by them, for the Lord, your God, who is in your midst, is a great and awesome God. "},{"num":22,"verse":"He will remove these nations before you little by little. You cannot finish with them quickly, lest the wild beasts become too numerous for you. "},{"num":23,"verse":"The Lord, your God, will give them over to you and throw them into utter panic until they are destroyed. "},{"num":24,"verse":"He will deliver their kings into your power, that you may make their names perish from under the heavens. No one will be able to stand up against you, till you have destroyed them. "},{"num":25,"verse":"The images of their gods you shall destroy by fire. Do not covet the silver or gold on them, nor take it for yourselves, lest you be ensnared by it; for it is an abomination to the Lord, your God. "},{"num":26,"verse":"You shall not bring any abominable thing into your house, so as to be, like it, under the ban; loathe and abhor it utterly for it is under the ban."}]