[{"header":"The Lord Will Drive Out Many Nations"},{"num":7,"verse":"The Lord your God will bring you into the land. You are going to enter it and take it as your own. He’ll drive out many nations to make room for you. He’ll drive out the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites and Jebusites. Those seven nations are larger and stronger than you are. "},{"num":2,"verse":"The Lord your God will hand them over to you. You will win the battle over them. You must completely destroy them. Don’t make a peace treaty with them. Don’t show them any mercy. "},{"num":3,"verse":"Don’t marry any of their people. Don’t give your daughters to their sons. And don’t take their daughters for your sons. "},{"num":4,"verse":"If you do, those people will turn your children away from serving the Lord. Then your children will serve other gods. The Lord will be very angry with you. He will quickly destroy you. "},{"num":5,"verse":"So here is what you must do to those people. Break down their altars. Smash their sacred stones. Cut down the poles they use to worship the female god named Asherah. Burn the statues of their gods in the fire. "},{"num":6,"verse":"You are a holy nation. The Lord your God has set you apart for himself. He has chosen you to be his special treasure. He chose you out of all the nations on the face of the earth to be his people."},{"num":7,"verse":"The Lord chose you because he loved you very much. He didn’t choose you because you had more people than other nations. In fact, you had the smallest number of all. "},{"num":8,"verse":"The Lord chose you because he loved you. He wanted to keep the promise he had made to your people of long ago. That’s why he used his mighty hand to bring you out of Egypt. He bought you back from the land where you were slaves. He set you free from the power of Pharaoh, the king of Egypt. "},{"num":9,"verse":"So I want you to realize that the Lord your God is God. He is the faithful God. He keeps his covenant for all time to come. He keeps it with those who love him and obey his commandments. He shows them his love. "},{"num":10,"verse":"But he will pay back those who hate him. He’ll destroy them. He’ll quickly pay back those who hate him. "},{"num":11,"verse":"So be careful to obey the commands, rules and laws I’m giving you today."},{"num":12,"verse":"Pay attention to the laws of the Lord your God. Be careful to obey them. Then he will keep his covenant of love with you. That’s what he promised to your people of long ago. "},{"num":13,"verse":"The Lord will love you and bless you. He’ll cause there to be many of you. He’ll give you many children. He’ll bless the crops of your land. He’ll give you plenty of grain, olive oil and fresh wine. He’ll bless your herds with many calves. He’ll give your flocks many lambs. He’ll do all these things for you in the land of Canaan. It’s the land he promised your people of long ago that he would give you. "},{"num":14,"verse":"He will bless you more than any other nation. All your men and women will have children. All your livestock will have little ones. "},{"num":15,"verse":"The Lord will keep you from getting sick. He won’t send on you any of the horrible sicknesses you saw all around you in Egypt. But he’ll send them on everyone who hates you. "},{"num":16,"verse":"You must destroy all the nations the Lord your God hands over to you. Don’t feel sorry for them. Don’t serve their gods. If you do, they will be a trap for you."},{"num":17,"verse":"You might say to yourselves, “These nations are stronger than we are. How can we drive them out?” "},{"num":18,"verse":"But don’t be afraid of them. Be sure to remember what the Lord your God did to Pharaoh and all the Egyptians. "},{"num":19,"verse":"With your own eyes you saw what the Lord did to them. You saw the signs and amazing things he did. He reached out his mighty hand and powerful arm. The Lord your God used all those things to bring you out. You are now afraid of the nations that are in the land the Lord promised you. But the Lord your God will do to them the same things he did to Egypt. "},{"num":20,"verse":"The Lord your God will also send hornets among those nations. Some of the people left alive will hide from you. But even they will die. "},{"num":21,"verse":"So don’t be terrified by them. The Lord your God is with you. He is a great and wonderful God. "},{"num":22,"verse":"The Lord your God will drive out those nations to make room for you. But he will do it little by little. You won’t be allowed to get rid of them all at once. If you did, wild animals would multiply all around you. "},{"num":23,"verse":"But the Lord your God will hand those nations over to you. He will throw them into a panic until they are destroyed. "},{"num":24,"verse":"He will hand their kings over to you. You will wipe out their names from the earth. No one will be able to stand up against you. You will destroy them. "},{"num":25,"verse":"Burn the statues of their gods in the fire. Don’t wish for the silver and gold on those statues. Don’t take it for yourselves. If you do, it will be a trap for you. The Lord your God hates it. "},{"num":26,"verse":"Don’t bring anything he hates into your house. If you do, you will be completely destroyed along with it. So hate it with all your heart. It is set apart to be destroyed."}]