[{"header":"No Mixing With Idolaters"},{"num":7,"verse":"“When Adonai your God brings you into the land you are entering to possess and drives out many nations before you—the Hittite and the Girgashite and the Amorite, the Canaanite and the Perizzite, the Hivite and the Jebusite, seven nations more numerous and mightier than you—"},{"num":2,"verse":"and Adonai your God gives them over to you and you strike them down, then you are to utterly destroy them. You are to make no covenant with them and show no mercy to them. "},{"num":3,"verse":"You are not to intermarry with them—you are not to give your daughter to his son, or take his daughter for your son. "},{"num":4,"verse":"For he will turn your son away from following Me to serve other gods. Then the anger of Adonai will be kindled against you, and He will swiftly destroy you. "},{"num":5,"verse":"Instead, you are to deal with them like this: tear down their altars, smash their pillars, cut down their Asherah poles, and burn their carved images with fire. "},{"num":6,"verse":"For you are a holy people to Adonai your God—from all the peoples on the face of the earth, Adonai your God has chosen you to be His treasured people."},{"num":7,"verse":"“It is not because you are more numerous than all the peoples that Adonai set His love on you and chose you—for you are the least of all peoples. "},{"num":8,"verse":"Rather, because of His love for you and His keeping the oath He swore to your fathers, Adonai brought you out with a mighty hand and redeemed you from the house of slavery, from the hand of Pharaoh king of Egypt."},{"num":9,"verse":"“Know therefore that Adonai your God, He is God—the faithful God who keeps covenant kindness for a thousand generations with those who love Him and keep His mitzvot,"},{"num":10,"verse":" but repays those who hate Him to their face, to annihilate them. He will not hesitate with him who hates Him; He will repay him to his face. "},{"num":11,"verse":"Therefore you are to keep the commandment—both the statutes and the ordinances—that I am commanding you today, to do them."},{"header":"Adonai Desires to Bless"},{"num":12,"verse":"“Then it will happen, as a result of your listening to these ordinances, when you keep and do them, that Adonai your God will keep with you the covenant kindness that He swore to your fathers. "},{"num":13,"verse":"He will love you, bless you and multiply you. He will also bless the fruit of your womb and the produce of your soil, your grain and your new wine and your oil, the increase of your herds and the young of your flock, in the land that He swore to your fathers to give you. "},{"num":14,"verse":"From all peoples, you will be blessed—there will not be male or female barren among you or your livestock. "},{"num":15,"verse":"Adonai will remove all sickness from you, and He will not inflict on you any of the terrible diseases of Egypt that you knew, but will inflict them on all who hate you."},{"num":16,"verse":"“You will devour all the peoples Adonai your God gives over to you. Your eye is not to pity them. You are not to serve their gods, for that would be a snare to you. "},{"num":17,"verse":"Suppose you say in your heart, ‘These nations are more numerous than I—how can I drive them out?’ "},{"num":18,"verse":"You are not to be afraid of them. You are to be sure to remember what Adonai your God did to Pharaoh and to all Egypt: "},{"num":19,"verse":"the great trials that your eyes saw, the signs and wonders, and the mighty hand and outstretched arm by which Adonai your God brought you out. So will Adonai your God do to all the peoples you fear."},{"num":20,"verse":"“Moreover, Adonai your God will send the hornet against them, until the survivors and those in hiding perish before you. "},{"num":21,"verse":"You should not be terrified of them, since Adonai your God is in your midst—a great and awesome God. "},{"num":22,"verse":"Adonai your God will drive away those nations before you little by little—you will not be able to put an end to them all at once, or else the beasts of the field will multiply on you. "},{"num":23,"verse":"But Adonai your God will give them over to you, and He will throw them into great confusion until they are destroyed. "},{"num":24,"verse":"He will hand over their kings to you, and you will blot out their name from under the heavens. No man will stand up to you, until you have destroyed them all."},{"num":25,"verse":"“The carved images of their gods you are to burn with fire. You are not to covet the silver or gold on them or take it for yourself—or you could be snared by it, for it is an abomination to Adonai your God. "},{"num":26,"verse":"You are not to bring an abomination into your house—for you, like it, will be a banned thing. You must utterly detest and utterly abhor it, for it is set apart for destruction."}]