[{"num":23,"verse":"Woe to the shepherds, that scatter and draw the flock of my pasture, saith the Lord. (Woe to the shepherds of the people, who scatter and draw away the flock of my pasture, saith the Lord.)"},{"num":2,"verse":"Therefore the Lord God of Israel saith these things to the shepherds that feed my people, Ye have scattered my flock, and have cast them out, and have not visited them; lo! I shall visit on you the malice of your studies, saith the Lord. (And so the Lord God of Israel saith these things to the shepherds who feed my people, Ye have scattered my flock, and have cast them out, and have not cared for them/and have not watched over them; lo! I shall punish you for the malice of your deeds, saith the Lord.)"},{"num":3,"verse":"And I shall gather together the remnants of my flock from all lands, to which I shall cast them out thither; and I shall turn them (again) to their fields (and I shall return them to their fields), and they shall increase, and shall be multiplied."},{"num":4,"verse":"And I shall raise up shepherds on them, and they shall feed them; they shall no more dread, and shall not be afeared (and they shall no longer have fear, and shall not be afraid); and none shall be sought of the number (of them), saith the Lord."},{"num":5,"verse":"Lo! days come, saith the Lord, and I shall raise a just burgeoning, either seed, to David; and he shall reign a king, and he shall be wise, and he shall make doom and rightfulness in earth. (Lo! days come, saith the Lord, and I shall raise up a just Burgeoning, or a descendant, of David; and he shall reign a King, and he shall be wise, and he shall make judgement and righteousness in all the land/and he shall make Law and justice in all the land.)"},{"num":6,"verse":"In those days Judah shall be saved, and Israel shall dwell trustily; and this is the name which they shall call him, The Lord our rightful [Our rightwise Lord]."},{"num":7,"verse":"For this thing lo! days come, saith the Lord, and they shall no more say, The Lord liveth, that led the sons of Israel out of the land of Egypt; (For this thing lo! days shall come, saith the Lord, and they shall no more say, The Lord liveth, who led the Israelites out of the land of Egypt;)"},{"num":8,"verse":"but, The Lord liveth, that led out (who led out), and brought (back) the seed of the house of Israel from the land of the north, and from all lands to which I had cast them out thither; and they shall dwell in their [own] land."},{"num":9,"verse":"To the prophets; Mine heart is contrite, either all-broken for sorrow, in the midst of me, all my bones trembled together; I am made as a man drunken, and as a man wet of wine, of the face of the Lord, and of the face of the holy words of him (I am made like a drunken man, and like one who is wet with wine, because of the Lord, and because of his holy words);"},{"num":10,"verse":"for the land is filled with adulterers. For the earth mourned of the face of cursing; the fields of desert be made dry, the course of them is made evil, and their strength is unlike. (for the land is filled with adulterers. Because of cursing/Because of them, the earth mourned; the fields of the desert be made dry, their course is made evil, and their strength is not rightly used.)"},{"num":11,"verse":"For why the prophet and the priest be defouled; and in mine house, saith the Lord, I found the evil of them. (For the prophet and the priest be defiled; and I found them doing evil, even in my own House, saith the Lord.)"},{"num":12,"verse":"Therefore the way of them shall be as slidery thing(s) in darknesses, for they shall be hurtled, either shoved, and shall fall down therein; for I shall bring on them evils, the year of [the] visitation of them, saith the Lord. (And so their way shall be slippery in the darkness, for they shall be hurtled, or shall be shoved, and shall fall down there; for I shall bring in evil upon them, yea, the time of their punishment, saith the Lord.)"},{"num":13,"verse":"And in the prophets of Samaria I saw fondness, and they prophesied in Baal, and deceived my people Israel. (And I saw Samaria’s prophets to be foolish, for they prophesied in Baal’s name, and deceived my people Israel.)"},{"num":14,"verse":"And in the prophets of Jerusalem I saw, (in) likeness, adultery, and the way of leasing; and they comforted the hands of the worst men, that each man should not convert from his malice; all they be made as Sodom to me, and all the dwellers thereof be made as Gomorrah. (And in the lives of the prophets of Jerusalem, I saw adultery, and the way of lies; and they strengthened the hands of the worst people, so that no one would not turn away from their own malice; yea, they all be made like Sodom to me, and all its inhabitants be made like Gomorrah.)"},{"num":15,"verse":"Therefore the Lord of hosts saith these things to the prophets, Lo! I shall feed them with wormwood, and I shall give drink to them with gall; for why defouling is gone out of the prophets of Jerusalem on all the land. (And so the Lord of hosts saith these things to the prophets, Lo! I shall feed them with wormwood, and I shall give them gall to drink; for defiling hath gone out from the prophets of Jerusalem upon all the land.)"},{"num":16,"verse":"The Lord of hosts saith these things, Do not ye hear the words of [the] prophets, that prophesy to you, and deceive you; they speak the vision of their heart, not of the mouth of the Lord. (The Lord of hosts saith these things, Do not ye listen to the words of the prophets, who prophesy to you, and deceive you; they speak the vision of their own hearts, and not from the mouth of the Lord.)"},{"num":17,"verse":"They say to them that blaspheme me, The Lord spake, Peace shall be to you; and they said to each man that goeth in the shrewdness of his heart, Evil shall not come [up]on you. (They say to those who blaspheme me, The Lord spoke, Peace shall be to you; and they said to each person who goeth in the depravity of his own heart, Evil shall not come upon you.)"},{"num":18,"verse":"For why who is present in the counsel of the Lord (For who hath stood in the council of the Lord), and saw, and heard his word? who beheld, and heard the word of him?"},{"num":19,"verse":"Lo! the whirlwind of the Lord’s indignation shall go out, and tempest breaking [out] shall come on the head of wicked men."},{"num":20,"verse":"The strong vengeance of the Lord shall not turn again, till that he do, and till that he [ful]fill the thought of his heart. In the last days ye shall understand the counsel of him."},{"num":21,"verse":"I sent not the prophets, and they ran; I spake not to them, and they prophesied."},{"num":22,"verse":"If they had stood in my counsel, and had made known my words to my people, forsooth I had turned them away from their evil way, and from their worst thoughts. (But if they had stood in my council, and had told out my words to my people, then they would have turned them away from their evil ways, and from their worst thoughts.)"},{"num":23,"verse":"Guessest thou, whether I am God of nigh, saith the Lord, and not God afar? (Thinkest thou, that I am the God of near at hand, but not also the God of far away?)"},{"num":24,"verse":"A man shall not be privy in hid places, and I shall not see him, saith the Lord. Whether I fill not heaven and earth? saith the Lord. (Shall a man hide himself in a secret place, and shall I not see him? saith the Lord. Do I not fill heaven and the earth? saith the Lord.)"},{"num":25,"verse":"I heard what things the prophets said, prophesying leasing in my name (prophesying lies in my name), and saying, I dreamed dreams."},{"num":26,"verse":"How long is this thing in the heart of (the) prophets, prophesying leasing (prophesying lies), and prophesying the deceit of their (own) heart?"},{"num":27,"verse":"Which will make, that my people forget my name for the dreams of them, which each man telleth to his neighbour, as the fathers of them forgat my name for Baal. (Who desire to make my people forget my name by their dreams, which each person telleth to his neighbour, like their forefathers forgot my name for Baal.)"},{"num":28,"verse":"A prophet that hath a dream, tell a dream; and he that hath my word, speak verily my word (A prophet who hath a dream, tell a dream; and he who hath my word, truthfully speak my word). What is with [the] chaffs to the wheat? saith the Lord."},{"num":29,"verse":"Whether my words be not as fire burning, saith the Lord, and as an hammer all-breaking a stone? (Be not my words like a burning fire, saith the Lord, and like a hammer breaking a stone to pieces?)"},{"num":30,"verse":"Therefore lo! I am ready to the prophets, saith the Lord, that steal my words, each man from his neighbour. (And so lo! I am against the prophets, saith the Lord, who steal my words, each one from their neighbour, for their own use.)"},{"num":31,"verse":"Lo! I to the prophets, saith the Lord, that take their tongues, and say, The Lord saith. (Lo! I am against the prophets, saith the Lord, who use their tongues, and say, The Lord saith.)"},{"num":32,"verse":"Lo! I to the prophets, dreaming leasing, saith the Lord; which told them, and deceived my people in their leasing, and in their miracles, when I had not sent them, neither had commanded to them; which profited nothing to this people, saith the Lord. (Lo! I am against the prophets, who dreamed lies, saith the Lord; and then told them out, and deceived my people with their lies, and with their miracles, when I had not sent them, nor had commanded to them; yea, which profited nothing for this people, saith the Lord.)"},{"num":33,"verse":"Therefore if this people, either (a) prophet, either (a) priest, asketh thee, and saith, What is the burden of the Lord? thou shalt say to them, Ye be the burden, for I shall cast you away, saith the Lord;"},{"num":34,"verse":"and (as for) a prophet, and a priest, and the people, that saith, The burden of the Lord, I shall visit on that man, and on his house. (and as for a prophet, and a priest, and the people, who saith, The burden of the Lord, I shall punish that man, and his house.)"},{"num":35,"verse":"Ye shall say these things, each man to his neighbour, and to his brother, What answered the Lord? and, What spake the Lord?"},{"num":36,"verse":"For the burden of the Lord shall no more be remembered, and the word of each man shall be (the) burden to him; and ye have perverted the words of [the] living God, of the Lord of hosts, your God. (For the burden of the Lord shall no more be remembered, and the word of each person shall be his own burden; for ye have perverted the words of the living God, the words of the Lord of hosts, your God.)"},{"num":37,"verse":"Thou shalt say these things to the prophet, What answered the Lord to thee? and, What spake the Lord?"},{"num":38,"verse":"Forsooth if ye say, The burden of the Lord, for this thing the Lord saith these things, For ye said this word, The burden of the Lord, and I sent to you, and I said, Do not ye say, The burden of the Lord;"},{"num":39,"verse":"therefore lo! I shall take you away, and shall bear, and I shall forsake you, and the city which I gave to you, and to your fathers, from my face. (and so lo! I shall carry you out, and I shall leave you there, yea, I shall throw away from my sight both you, and the city which I gave to you, and your forefathers.)"},{"num":40,"verse":"And I shall give you into everlasting shame, and into everlasting scandal, that shall never be done away by forgetting."}]