[{"header":"Hezekiah Talks to Isaiah"},{"num":19,"verse":"When King Hezekiah heard about it, he tore his clothes and covered himself with cloth made from hair. Then he went into the house of the Lord. "},{"num":2,"verse":"He sent Eliakim who was the head of the house, Shebna the writer, and the head religious leaders, to the man of God Isaiah the son of Amoz. They were covered with cloth made from hair. "},{"num":3,"verse":"And they said to him, “Hezekiah says, ‘This day is a day of trouble, sharp words, and shame. For children have come to be born, but there is no strength to give birth to them. "},{"num":4,"verse":"It might be that the Lord your God will hear all the words of Rabshakeh, whom his ruler the king of Assyria has sent to make fun of the living God. And the Lord your God might speak sharp words against what He has heard. So pray for those who are left of the Lord’s people.’” "},{"num":5,"verse":"The servants of King Hezekiah came to Isaiah. "},{"num":6,"verse":"And Isaiah said to them, “Tell your ruler, ‘This is what the Lord says: “Do not be afraid because of the words you have heard spoken against Me by the servants of the king of Assyria. "},{"num":7,"verse":"See, I will put a spirit in him so that he will hear a made-up story and he will return to his own land. And I will have him killed by the sword in his own land.”’”"},{"header":"Assyrians Talk of Taking Jerusalem Again"},{"num":8,"verse":"Rabshakeh returned and found the king of Assyria fighting against Libnah. For he had heard that the king had left Lachish. "},{"num":9,"verse":"The king of Assyria was told, “See, King Tirhakah of Cush has come out to fight against you.” So he sent men again to Hezekiah, saying, "},{"num":10,"verse":"“Tell King Hezekiah of Judah, ‘Do not let your God in Whom you trust lie to you by saying that Jerusalem will not be given into the power of the king of Assyria. "},{"num":11,"verse":"You have heard how the kings of Assyria have destroyed all the lands. And will you be saved? "},{"num":12,"verse":"Did the gods of those nations which my fathers destroyed save them? Gozan, Haran, Rezeph, and the people of Eden who were in Telassar, were destroyed. "},{"num":13,"verse":"Where are the kings of Hamath, Arpad, the city of Sepharvaim, Hena and Ivvah?’”"},{"num":14,"verse":"Hezekiah took the letter from the hand of the men from Assyria, and read it. Then he went up to the house of the Lord, and spread the letter out before the Lord. "},{"num":15,"verse":"Hezekiah prayed to the Lord, saying, “O Lord the God of Israel, You sit on Your throne above the cherubim. You are the God, and You alone, of all the nations of the earth. You have made heaven and earth. "},{"num":16,"verse":"Turn Your ear, O Lord, and hear. Open Your eyes, O Lord, and see. Listen to the words Sennacherib has spoken against the living God. "},{"num":17,"verse":"O Lord, it is true that the kings of Assyria have destroyed the nations and their lands. "},{"num":18,"verse":"They have thrown their gods into the fire. For they were not gods, but the work of men’s hands, made from wood and stone. So they have destroyed them. "},{"num":19,"verse":"Now, O Lord our God, I beg You to save us from his power. Then all the nations of the earth may know that You alone are God, O Lord.”"},{"header":"Isaiah’s Word to the King"},{"num":20,"verse":"Isaiah the son of Amoz sent word to Hezekiah, saying, “The Lord, the God of Israel, says, ‘I have heard your prayer to Me about Sennacherib king of Assyria.’ "},{"num":21,"verse":"This is the Word that the Lord has spoken against him: ‘She has hated you and made fun of you, the young daughter of Zion! She has shaken her head behind you, the daughter of Jerusalem! "},{"num":22,"verse":"Whom have you spoken against? Against whom have you raised your voice, and lifted your eyes in pride? Against the Holy One of Israel! "},{"num":23,"verse":"You have spoken against the Lord through the men you have sent. You have said, “With my many war-wagons I have come up to the tops of the mountains, to the farthest parts of Lebanon. I cut down its tall cedar trees and its best cypress trees. I went to its highest place, where its trees are close together. "},{"num":24,"verse":"I dug wells and drank the water of other lands. I dried up all the rivers of Egypt with the bottom of my feet.”"},{"num":25,"verse":"’Have you not heard that I planned this long ago? From times long ago I planned it. Now I have made it happen, that you should destroy strong cities. "},{"num":26,"verse":"That is why those who lived there did not have much strength. They were troubled and put to shame. They were like the plants of the field and the green grass. They were like grass on the roofs, killed by the sun before it is grown. "},{"num":27,"verse":"But I know when you sit down, go out, and come in. And I know how you speak in anger against Me. "},{"num":28,"verse":"You have spoken against Me in your anger and pride, and I have heard it. So I will put My hook in your nose, and My bit in your mouth. And I will have you return by the way you came. "},{"num":29,"verse":"’This will be the special thing for you to see: This year you will eat what grows of itself. In the second year you will eat what grows of the same. Then in the third year, you will plant seeds and gather food. You will plant vines and eat their fruit. "},{"num":30,"verse":"And those who are left of the family of Judah will again take root and give fruit. "},{"num":31,"verse":"For those who are left will go out of Jerusalem. Those who are still alive will go out of Mount Zion. This will be done by the power of the Lord. "},{"num":32,"verse":"So this is what the Lord says about the king of Assyria: He will not come to this city or shoot an arrow there. He will not come to it with a battle-covering or build a wall around it. "},{"num":33,"verse":"He will return by the way he came. He will not come to this city, says the Lord. "},{"num":34,"verse":"For I will help this city and save it, because of My honor, and because of My servant David.’”"},{"header":"Sennacherib’s Death"},{"num":35,"verse":"That night the angel of the Lord went out and killed 185,000 men among the Assyrian tents. When those left alive got up early in the morning, they saw all the dead bodies. "},{"num":36,"verse":"Then King Sennacherib of Assyria left and returned home, and lived at Nineveh. "},{"num":37,"verse":"As he was worshiping in the house of his god Nisroch, Adrammelech and Sharezer killed him with the sword. Then they ran away to the land of Ararat. And his son Esarhaddon became king in his place."}]