[{"header":"Psalm 35"},{"num":1,"verse":"Contend, O Lord, with those who contend with me; fight against those who fight against me!"},{"num":2,"verse":"Take hold of shield and buckler, and stand up for my help!"},{"num":3,"verse":"Draw out also the spear and javelin and close up the way of those who pursue and persecute me. Say to me, I am your deliverance!"},{"num":4,"verse":"Let them be put to shame and dishonor who seek and require my life; let them be turned back and confounded who plan my hurt!"},{"num":5,"verse":"Let them be as chaff before the wind, with the Angel of the Lord driving them on!"},{"num":6,"verse":"Let their way be through dark and slippery places, with the Angel of the Lord pursuing and afflicting them."},{"num":7,"verse":"For without cause they hid for me their net; a pit of destruction without cause they dug for my life."},{"num":8,"verse":"Let destruction befall [my foe] unawares; let the net he hid for me catch him; let him fall into that very destruction."},{"num":9,"verse":"Then I shall be joyful in the Lord; I shall rejoice in His deliverance."},{"num":10,"verse":"All my bones shall say, Lord, who is like You, You Who deliver the poor and the afflicted from him who is too strong for him, yes, the poor and the needy from him who snatches away his goods?"},{"num":11,"verse":"Malicious and unrighteous witnesses rise up; they ask me of things that I know not."},{"num":12,"verse":"They reward me evil for good to my personal bereavement."},{"num":13,"verse":"But as for me, when they were sick, my clothing was sackcloth; I afflicted myself with fasting, and I prayed with head bowed on my breast."},{"num":14,"verse":"I behaved as if grieving for my friend or my brother; I bowed down in sorrow, as one who bewails his mother."},{"num":15,"verse":"But in my stumbling and limping they rejoiced and gathered together [against me]; the smiters (slanderers and revilers) gathered against me, and I knew them not; they ceased not to slander and revile me."},{"num":16,"verse":"Like profane mockers at feasts [making sport for the price of a cake] they gnashed at me with their teeth."},{"num":17,"verse":"Lord, how long will You look on [without action]? Rescue my life from their destructions, my dear and only life from the lions!"},{"num":18,"verse":"I will give You thanks in the great assembly; I will praise You among a mighty throng."},{"num":19,"verse":"Let not those who are wrongfully my foes rejoice over me; neither let them wink with the eye who hate me without cause."},{"num":20,"verse":"For they do not speak peace, but they devise deceitful matters against those who are quiet in the land."},{"num":21,"verse":"Yes, they open their mouths wide against me; they say, Aha! Aha! Our eyes have seen it!"},{"num":22,"verse":"You have seen this, O Lord; keep not silence! O Lord, be not far from me!"},{"num":23,"verse":"Arouse Yourself, awake to the justice due me, even to my cause, my God and my Lord!"},{"num":24,"verse":"Judge and vindicate me, O Lord my God, according to Your righteousness (Your rightness and justice); and let [my foes] not rejoice over me!"},{"num":25,"verse":"Let them not say in their hearts, Aha, that is what we wanted! Let them not say, We have swallowed him up and utterly destroyed him."},{"num":26,"verse":"Let them be put to shame and confusion together who rejoice at my calamity! Let them be clothed with shame and dishonor who magnify and exalt themselves over me!"},{"num":27,"verse":"Let those who favor my righteous cause and have pleasure in my uprightness shout for joy and be glad and say continually, Let the Lord be magnified, Who takes pleasure in the prosperity of His servant."},{"num":28,"verse":"And my tongue shall talk of Your righteousness, rightness, and justice, and of [my reasons for] Your praise all the day long."}]