[{"header":"Joseph and Potiphar’s Wife"},{"num":39,"verse":"Now Joseph was brought down to Egypt, and Potiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him from the Ishmaelites who had brought him down there."},{"num":2,"verse":"The Lord was with Joseph, so that he became a prosperous man. He was in the house of his master, the Egyptian. "},{"num":3,"verse":"His master saw that the Lord was with him and that the Lord made all that he did to prosper. "},{"num":4,"verse":"Joseph found favor in his sight and served him. So he made him overseer over his house, and all that he had he put under his charge. "},{"num":5,"verse":"From the time that he had made him overseer in his house and over all that he had, the Lord blessed the Egyptian’s house on account of Joseph. So the blessing of the Lord was on all that he had in the house and in the field. "},{"num":6,"verse":"So he left all that he had in Joseph’s charge, and he had no concerns regarding anything except the food he ate."},{"num":7,"verse":"After a time, his master’s wife took notice of Joseph and said, “Lie with me.”"},{"num":8,"verse":"But he refused and said to his master’s wife, “My master does not concern himself with anything concerning me in the house, and he has committed all that he has to my charge. "},{"num":9,"verse":"There is none greater in this house than I. He has kept nothing back from me but you, because you are his wife. How then can I do this great wickedness and sin against God?” "},{"num":10,"verse":"She spoke to Joseph every day, but he did not listen to her about lying with her or being with her."},{"num":11,"verse":"But it happened one day that Joseph went into the house to do his work, and none of the men of the house was there. "},{"num":12,"verse":"She caught him by his clothing, saying, “Lie with me.” But he left his clothing in her hand and fled and got outside."},{"num":13,"verse":"When she saw that he had left his clothing in her hand and had fled outside, "},{"num":14,"verse":"she called to the men of her house and spoke to them, saying, “See, he has brought in a Hebrew among us to humiliate us. He came in to me to lie with me, and I cried out with a loud voice. "},{"num":15,"verse":"When he heard that I lifted up my voice and cried out, he left his clothing with me, fled, and got outside.”"},{"num":16,"verse":"She laid up his clothing next to her until his master came home. "},{"num":17,"verse":"She spoke to him using these words, saying, “The Hebrew servant, whom you have brought to us, came in to me to mock me. "},{"num":18,"verse":"When I lifted up my voice and cried out, he left his clothing with me and fled outside.”"},{"num":19,"verse":"When his master heard the words of his wife, which she spoke to him, saying, “This is what your servant did to me,” he became enraged. "},{"num":20,"verse":"Joseph’s master took him and put him into the prison, a place where the king’s prisoners were confined."},{"num":21,"verse":"But the Lord was with Joseph and showed him mercy and gave him favor in the sight of the keeper of the prison. "},{"num":22,"verse":"The keeper of the prison committed all the prisoners that were in the prison to the charge of Joseph. So whatever they did there, he was the one responsible for it. "},{"num":23,"verse":"The keeper of the prison did not concern himself with anything that was under Joseph’s charge because the Lord was with him. And whatever he did, the Lord made it to prosper."}]