[{"header":"The Healing of a Man Born Blind"},{"num":9,"verse":"As Jesus passed by, He saw a man blind from birth. "},{"num":2,"verse":"His disciples asked Him, “Rabbi, who sinned, this man or his parents, that he was born blind?”"},{"num":3,"verse":"Jesus answered, “Neither this man nor his parents sinned. But it happened so that the works of God might be displayed in him. "},{"num":4,"verse":"I must do the works of Him who sent Me while it is day. Night is coming when no one can work. "},{"num":5,"verse":"While I am in the world, I am the light of the world.”"},{"num":6,"verse":"When He had said this, He spat on the ground and made clay with the saliva. He anointed the eyes of the blind man with the clay, "},{"num":7,"verse":"and said to him, “Go, wash in the pool of Siloam” (which means “Sent”). So he went away and washed, and returned seeing."},{"num":8,"verse":"The neighbors and those who had previously seen that he was blind said, “Is this not he who sat and begged?” "},{"num":9,"verse":"Some said, “This is he.”"},{"num":10,"verse":"So they said to him, “How were your eyes opened?”"},{"num":11,"verse":"He answered, “A Man called Jesus made clay, anointed my eyes, and said to me, ‘Go to the pool of Siloam and wash.’ So I went away and washed, and I received my sight.”"},{"num":12,"verse":"They said to him, “Where is He?”"},{"header":"The Pharisees Investigate the Healing"},{"num":13,"verse":"They brought the man who had been blind to the Pharisees. "},{"num":14,"verse":"Now it was a Sabbath day when Jesus made the clay and opened his eyes. "},{"num":15,"verse":"Therefore the Pharisees also asked him how he received his sight. He said to them, “He put clay on my eyes, and I washed, and I see.”"},{"num":16,"verse":"Some of the Pharisees said, “This Man is not from God, because He does not keep the Sabbath day.”"},{"num":17,"verse":"Then they said to the blind man again, “What do you say about Him, since He opened your eyes?”"},{"num":18,"verse":"But the Jews did not believe concerning him, that he had been blind and received his sight, until they called the parents of the one who had received his sight. "},{"num":19,"verse":"They asked them, “Is this your son, whom you say was born blind? How then does he now see?”"},{"num":20,"verse":"His parents answered them, “We know that this is our son and that he was born blind. "},{"num":21,"verse":"But how he now sees, we do not know, or who opened his eyes, we do not know. He is of age. Ask him. He will speak for himself.” "},{"num":22,"verse":"His parents said this, because they feared the Jews. For the Jews had already agreed that if anyone confessed that He was the Christ, he would be put out of the synagogue. "},{"num":23,"verse":"Therefore his parents said, “He is of age. Ask him.”"},{"num":24,"verse":"So again they called the man who was blind and said to him, “Give glory to God. We know that this Man is a sinner.”"},{"num":25,"verse":"He said, “I do not know if He is a sinner. I know one thing: I was blind, but now I see.”"},{"num":26,"verse":"Then they said to him again, “What did He do to you? How did He open your eyes?”"},{"num":27,"verse":"He answered them, “I told you already, and you did not listen. Why do you want to hear it again? Do you also want to become His disciples?”"},{"num":28,"verse":"Then they insulted him and said, “You are His disciple, but we are Moses’ disciples. "},{"num":29,"verse":"We know that God has spoken to Moses. As for this fellow, we do not know where He is from.”"},{"num":30,"verse":"The man answered, “Well, here is an amazing thing! You do not know where He is from, and yet He opened my eyes. "},{"num":31,"verse":"We know that God does not listen to sinners. But if anyone is a worshipper of God and does His will, He hears him. "},{"num":32,"verse":"Since the world began, it has never been heard that anyone opened the eyes of someone born blind. "},{"num":33,"verse":"If this Man were not from God, He could do nothing.”"},{"num":34,"verse":"They answered him, “You were completely born in sin. Are you teaching us?” And they threw him out."},{"header":"Spiritual Blindness"},{"num":35,"verse":"Jesus heard that they had thrown him out, and when He found him, He said, “Do you believe in the Son of God?”"},{"num":36,"verse":"He answered, “Who is He, Lord, that I may believe in Him?”"},{"num":37,"verse":"Jesus said to him, “You have seen Him, and it is He who speaks with you.”"},{"num":38,"verse":"Then he said, “Lord, I believe.” And he worshipped Him."},{"num":39,"verse":"Jesus said, “I came into this world for judgment, that those who do not see may see, and that those who see may become blind.”"},{"num":40,"verse":"Some Pharisees who were with Him heard these words, and said to Him, “Are we also blind?”"},{"num":41,"verse":"Jesus said, “If you were blind, you would have no sin. But now you say, ‘We see.’ Therefore your sin remains."}]