[[],[{"type":"header","content":"Solomon Will Build a Temple and Palace"},{"type":"prose","content":"Now Solomon decided to build a house (temple) for the Name of the LORD, and a royal palace for himself. "}],[{"type":"prose","content":"So Solomon assigned 70,000 men to carry loads, 80,000 men to quarry stone in the mountains, and 3,600 to supervise them."}],[{"type":"prose","content":"Then Solomon sent  to Hiram king of Tyre, saying, “As you dealt with my father David and sent him cedars to build himself a house in which to live, [please] do the same for me. "}],[{"type":"prose","content":"Observe, I am about to build a house for the Name of the LORD my God, dedicated to Him, to burn fragrant incense [of sweet spices] before Him, to set out the showbread continually, and to offer burnt offerings morning and evening, on Sabbaths, New Moons, and on the festivals of the LORD our God, as  forever in Israel. "}],[{"type":"prose","content":"The house I am going to build will be great, for our God is greater than all the gods. "}],[{"type":"prose","content":"But who is able to build a house for Him, since the heavens and [even] the highest heavens cannot contain Him? Who am I to build a house for Him, except [as a place] to burn  before Him? "}],[{"type":"prose","content":"Now send me a man who is skilled to work in gold, silver, bronze, and iron, and in purple, crimson, and blue , and who knows how to make engravings,  with the skilled men who are with me in Judah and Jerusalem, whom my father David provided. "}],[{"type":"prose","content":"Send me also cedar, cypress, and algum timber, for I know that your servants know how to cut timber in Lebanon. And indeed my servants  with your servants "}],[{"type":"prose","content":"to prepare for me an abundance of timber, because the house I am about to build will be great and wonderful. "}],[{"type":"prose","content":"And I will give to your servants who cut timber, 20,000 measures of crushed wheat and 20,000 measures of barley, and 20,000 baths of wine and 20,000 baths of [olive] oil.”"}],[{"type":"header","content":"Hiram to Assist"},{"type":"prose","content":"Then Hiram, king of Tyre replied in a letter sent to Solomon: “Because the LORD loves His people, He has made you king over them.” "}],[{"type":"prose","content":"Hiram said also, “Blessed be the LORD, the God of Israel, who made heaven and earth, who has given King David a wise son, endowed with discretion and understanding, who will build a house for the LORD and a royal palace for himself."}],[{"type":"prose","content":"“Now I am sending a skilled man, endowed with understanding, Huram-abi, "}],[{"type":"prose","content":"the son of a Danite woman and a Tyrian father. He is trained to work in gold, silver, bronze, iron, stone, and wood; in purple, blue, and crimson fabrics, and in fine linen. He is able to make any kind of engraving and to carry out any design given him.  with your skilled men and those of my lord, David your father. "}],[{"type":"prose","content":"Now then, let my lord send to his servants the wheat, the barley, the oil, and the wine of which he has spoken. "}],[{"type":"prose","content":"We will cut whatever timber you need from Lebanon and bring it to you on rafts by sea to Joppa, so that you may take it up to Jerusalem.”"}],[{"type":"prose","content":"Then Solomon took a count of all the aliens in the land of Israel, like the census that his father David had taken; and they were found to be 153,600. "}],[{"type":"prose","content":"He assigned 70,000 of them to carry loads and 80,000 to quarry stone in the mountain, and 3,600 as overseers to make the people work."}]]