[{"num":2,"verse":"¶ And Solomon determined to build a house for the name of the LORD and a house for his kingdom."},{"num":2,"verse":"And Solomon counted seventy thousand men to bear burdens and eighty thousand to hew in the mountain, and three thousand six hundred to oversee them."},{"num":3,"verse":"And Solomon sent to Hiram, the king of Tyre, saying, As thou didst deal with David, my father, sending him cedars to build himself a house to dwell in, even so deal with me."},{"num":4,"verse":"Behold, I must build a house unto the name of the LORD my God, to dedicate it to him and to burn aromatic incense before him and for the continual showbread and for the burnt offerings morning and evening on the sabbaths and on the new moons and on the solemn feasts of the LORD our God, which is to be perpetual in Israel."},{"num":5,"verse":"And the house which I must build is great, for great is our God above all gods."},{"num":6,"verse":"But who is so powerful as to build him a house, seeing the heavens and heavens of the heavens cannot contain him? Who am I then that I should build him a house, except to burn incense before him?"},{"num":7,"verse":"Send me now, therefore, a wise man who knows how to work in gold and in silver and in brass and in iron and in purple and crimson and blue and that knows how to engrave figures with the craftsmen that are with me in Judah and in Jerusalem, whom David, my father, provided."},{"num":8,"verse":"Send me also cedar trees, fir trees, and pine trees, out of Lebanon, for I know that thy slaves are skillful at cutting timber in Lebanon, and, behold, my slaves shall be with thy slaves"},{"num":9,"verse":"to prepare me timber in abundance, for the house which I am about to build shall be great and wonderful."},{"num":10,"verse":"And, behold, I will give to thy slaves, the hewers that cut timber, twenty thousand measures of beaten wheat and twenty thousand measures of barley and twenty thousand baths of wine and twenty thousand baths of oil."},{"num":11,"verse":"¶ Then Hiram, the king of Tyre, answered in writing, which he sent to Solomon, Because the LORD has loved his people, he has placed thee as king over them."},{"num":12,"verse":"Hiram said, moreover, Blessed be the LORD God of Israel, that made the heavens and the earth, who has given to King David a wise son with knowledge, good sense and understanding, that he might build a house for the LORD and a house for his kingdom."},{"num":13,"verse":"And now I have sent a wise man, with knowledge and understanding, of Hiram my father,"},{"num":14,"verse":"the son of a woman of the daughters of Dan, and his father was a man of Tyre, skillful to work in gold and in silver, in brass, in iron, in stone, and in timber, in purple, in blue, in fine linen, and in crimson; also to engrave any manner of figure and to invent any design which shall be put to him, with thy craftsmen and with the craftsmen of my lord David, thy father."},{"num":15,"verse":"Now, therefore, let my lord send unto his slaves the wheat and the barley, the oil and the wine, which he has spoken of;"},{"num":16,"verse":"and we will cut wood out of Lebanon, as much as thou shalt need, and we will bring it to thee in rafts by sea to Joppa, and thou shalt cause it to be carried up to Jerusalem."},{"num":17,"verse":"And Solomon numbered all the strangers that were in the land of Israel, after David, his father, had already numbered them; and one hundred and fifty-three thousand six hundred were found."},{"num":18,"verse":"And he set seventy thousand of them to be bearers of burdens and eighty thousand to be hewers in the mountain, and three thousand six hundred overseers to make the people work."}]