[{"header":"Chapter 2"},{"num":1,"verse":"Solomon conscripted seventy thousand men to carry stones and eighty thousand to cut the stones in the mountains, and over these he placed three thousand six hundred overseers. "},{"num":2,"verse":"Moreover, Solomon sent this message to Huram, king of Tyre: “As you dealt with David my father, and sent him cedars to build a house for his dwelling— "},{"num":3,"verse":"now I am going to build a house for the name of the Lord, my God, and to consecrate it to him, for the burning of fragrant incense in his presence, for the perpetual display of the showbread, for burnt offerings morning and evening, and for the sabbaths, new moons, and festivals of the Lord, our God: such is Israel’s perpetual obligation. "},{"num":4,"verse":"And the house I am going to build must be great, for our God is greater than all other gods. "},{"num":5,"verse":"Yet who is really able to build him a house, since the heavens and even the highest heavens cannot contain him? And who am I that I should build him a house, unless it be to offer incense in his presence? "},{"num":6,"verse":"Now, send me men skilled at work in gold, silver, bronze, and iron, in purple, crimson, and violet fabrics, and who know how to do engraved work, to join the skilled craftsmen who are with me in Judah and Jerusalem, whom David my father appointed. "},{"num":7,"verse":"Also send me boards of cedar, cypress and cabinet wood from Lebanon, for I realize that your servants know how to cut the wood of Lebanon. My servants will work with yours "},{"num":8,"verse":"in order to prepare for me a great quantity of wood, since the house I intend to build must be great and wonderful. "},{"num":9,"verse":"I will furnish as food for your servants, the woodcutters, twenty thousand kors of wheat, twenty thousand kors of barley, twenty thousand baths of wine, and twenty thousand baths of oil.”"},{"num":10,"verse":"Huram, king of Tyre, wrote an answer which he sent to Solomon: “Because the Lord loves his people, he has placed you over them as king.” "},{"num":11,"verse":"He added: “Blessed be the Lord, the God of Israel, who made heaven and earth, for having given King David a wise son of intelligence and understanding, who will build a house for the Lord and also his own royal house. "},{"num":12,"verse":"I am now sending you a craftsman of great skill, Huram-abi, "},{"num":13,"verse":"son of a Danite woman and of a father from Tyre; he knows how to work with gold, silver, bronze, and iron, with stone and wood, with purple, violet, fine linen, and crimson, and also how to do all kinds of engraved work and to devise every type of design that may be given him and your craftsmen and the craftsmen of my lord David your father. "},{"num":14,"verse":"And now, let my lord send to his servants the wheat, barley, oil, and wine which he has promised. "},{"num":15,"verse":"For our part, we will cut trees on Lebanon, as many as you need, and send them down to you in rafts to the port of Joppa, whence you may take them up to Jerusalem.”"},{"num":16,"verse":"Thereupon Solomon took a census of all the alien men resident in the land of Israel (following the census David his father had taken of them); they were found to number one hundred fifty-three thousand six hundred. "},{"num":17,"verse":"Of these he made seventy thousand carriers and eighty thousand cutters in the mountains, and three thousand six hundred overseers to keep the people working."}]