[{"header":"Samuel’s Farewell Address"},{"num":12,"verse":"Then Samuel said to all Israel: “I have listened to your voice in all that you said to me, and have made a king over you. "},{"num":2,"verse":"And now, see, the king walks before you, but I am old and gray-headed. As for my sons, they are with you. But I have walked before you from my childhood to this day. "},{"num":3,"verse":"Behold, here I am. Witness against me before the Lord and before His anointed. Whose ox have I taken? Or whose donkey have I taken? Or whom have I defrauded? Whom have I oppressed? Or from whose hand have I received any bribe to blind my eyes with? Indeed I will restore it you.”"},{"num":4,"verse":"They said, “You have not defrauded us, nor oppressed us. Neither have you taken anything from any man’s hand.”"},{"num":5,"verse":"He said to them, “The Lord is witness against you, and His anointed is witness this day, that you have not found anything in my hand.”"},{"num":6,"verse":"Samuel said to the people: “It is the Lord that prepared Moses and Aaron, and that brought your fathers up out of the land of Egypt. "},{"num":7,"verse":"Now therefore stand still that I may reason with you before the Lord, concerning all the righteous acts of the Lord, which He did for you and your fathers."},{"num":8,"verse":"“When Jacob went into Egypt and your fathers cried out to the Lord, the Lord sent Moses and Aaron who brought forth your fathers out of Egypt and made them dwell in this place."},{"num":9,"verse":"“When they forgot the Lord their God, He sold them into the hand of Sisera, captain of the host of Hazor, and into the hand of the Philistines, and into the hand of the king of Moab. And they fought against them. "},{"num":10,"verse":"They cried to the Lord, and said, ‘We have sinned, because we have forsaken the Lord and have served the Baals and the Ashtoreths. But now deliver us out of the hand of our enemies, and we will serve You.’ "},{"num":11,"verse":"The Lord sent Jerub-Baal, Bedan, Jephthah, and Samuel. And He delivered you out of the hand of your enemies on every side, and you dwelled in safety."},{"num":12,"verse":"“When you saw that Nahash, king of the Ammonites, came against you, you said to me, ‘No, but a king will reign over us,’ when the Lord your God was your king. "},{"num":13,"verse":"Now therefore, look at the king whom you have chosen and for whom you have asked! And see that the Lord has set a king over you. "},{"num":14,"verse":"If you will fear the Lord, and serve Him, and obey His voice, and not rebel against the commandment of the Lord, then both you and the king that reigns over you will continue following the Lord your God. "},{"num":15,"verse":"But if you will not obey the voice of the Lord, but rebel against the commandment of the Lord, then will the hand of the Lord be against you, as it was against your fathers."},{"num":16,"verse":"“Even now, take your stand and see this great thing which the Lord is doing before your eyes. "},{"num":17,"verse":"Is it not the wheat harvest today? I will call to the Lord. And He will send thunder and rain, that you may know and see that your wickedness is great, which you have done in the sight of the Lord, by asking for yourselves a king.”"},{"num":18,"verse":"So Samuel called to the Lord. And the Lord sent thunder and rain that day, and all the people greatly feared the Lord and Samuel."},{"num":19,"verse":"All the people said to Samuel, “Pray for your servants to the Lord your God, that we will not die, for we have added to all our sins this evil, to ask for ourselves a king.”"},{"num":20,"verse":"Samuel said to the people, “Do not fear. You have done all this wickedness, only do not turn aside from following the Lord, and serve the Lord with all your heart. "},{"num":21,"verse":"But do not turn aside, for then you would be going after empty things which cannot profit or deliver, for they are nothing. "},{"num":22,"verse":"As befits His great name, the Lord will not abandon His people. For it has pleased the Lord to make you His people. "},{"num":23,"verse":"Moreover as for me, God forbid that I should sin against the Lord in ceasing to pray for you. But I will teach you the good and the right way. "},{"num":24,"verse":"Fear the Lord; serve Him in truth with all your heart, and consider what great things He has done for you. "},{"num":25,"verse":"But if you still do wickedly, both you and your king will be swept away.”"}]