[{"header":"Samuel’s Final Speech to Israel"},{"num":12,"verse":"Samuel spoke to all the Israelites. He said, “I’ve done everything you asked me to do. I’ve placed a king over you. "},{"num":2,"verse":"Now you have a king as your leader. But I’m old. My hair is gray. My sons are here with you. I’ve been your leader from the time I was young until this day. "},{"num":3,"verse":"Here I stand. Bring charges against me if you can. The Lord is a witness. And so is his anointed king. Whose ox have I taken? Whose donkey have I taken? Have I cheated anyone? Have I treated anyone badly? Have I accepted money from anyone who wanted special favors? If I’ve done any of these things, I’ll make it right.”"},{"num":4,"verse":"“You haven’t cheated us,” they replied. “You haven’t treated us badly. You haven’t taken anything from anyone.”"},{"num":5,"verse":"Samuel said to them, “The Lord is a witness against you this day. And so is his anointed king. They are witnesses that I haven’t taken anything from any of you.”"},{"num":6,"verse":"Then Samuel said to the people, “The Lord appointed Moses and Aaron. He brought out of Egypt your people who lived long ago. "},{"num":7,"verse":"Now then, stand here. I’m going to remind you of all the good things the Lord has done for you and your people. He is a witness."},{"num":8,"verse":"“After Jacob’s family entered Egypt, they cried out to the Lord for help. The Lord sent Moses and Aaron. They brought your people out of Egypt. They had them make their homes in this land."},{"num":9,"verse":"“But the people forgot the Lord their God. So he put them under the control of Sisera. Sisera was the commander of the army of Hazor. The Lord also put the Israelites under the control of the Philistines and the king of Moab. All those nations fought against Israel. "},{"num":10,"verse":"So the people cried out to the Lord. They said, ‘We have sinned. We’ve deserted the Lord. We’ve served gods that are named Baal. We’ve served female gods that are named Ashtoreth. But save us now from the power of our enemies. Then we will serve you.’ "},{"num":11,"verse":"The Lord sent Gideon, Barak, Jephthah and me. He saved you from the power of your enemies who were all around you. So you lived in safety."},{"num":12,"verse":"“But then you saw that Nahash, the king of Ammon, was about to attack you. So you said to me, ‘No! We want a king to rule over us.’ You said it even though the Lord your God was your king. "},{"num":13,"verse":"Now here is the king you have chosen. He’s the one you asked for. The Lord has placed a king over you. "},{"num":14,"verse":"But you must have respect for the Lord. You must serve him and obey him. You must not say no to his commands. Both you and the king who rules over you must obey the Lord your God. If you do, that’s good. "},{"num":15,"verse":"But you must not disobey him. You must not say no to his commands. If you do, his power will be against you. That’s what happened to your people who lived before you."},{"num":16,"verse":"“So stand still. Watch the great thing the Lord is about to do right here in front of you! "},{"num":17,"verse":"It’s time to gather in the wheat, isn’t it? I’ll call out to the Lord to send thunder and rain. Then you will realize what an evil thing you did in the sight of the Lord. You shouldn’t have asked for a king.”"},{"num":18,"verse":"Samuel called out to the Lord. That same day the Lord sent thunder and rain. So all the people had great respect for the Lord and for Samuel."},{"num":19,"verse":"They said to Samuel, “Pray to the Lord your God for us. Pray that we won’t die because we asked for a king. That was an evil thing to do. We added it to all our other sins.”"},{"num":20,"verse":"“Don’t be afraid,” Samuel replied. “It’s true that you have done all these evil things. But don’t turn away from the Lord. Serve him with all your heart. "},{"num":21,"verse":"Don’t turn away and worship statues of gods. They are useless. They can’t do you any good. They can’t save you either. They are completely useless. "},{"num":22,"verse":"But the Lord will be true to his great name. He won’t turn his back on his people. That’s because he was pleased to make you his own people. "},{"num":23,"verse":"I would never sin against the Lord by failing to pray for you. I’ll teach you to live in a way that is good and right. "},{"num":24,"verse":"But be sure to have respect for the Lord. Serve him faithfully. Do it with all your heart. Think about the great things he has done for you. "},{"num":25,"verse":"But don’t be stubborn. Don’t continue to do what is evil. If you do, both you and your king will be destroyed.”"}]