[{"num":12,"verse":"Then Samuel addressed the people again:"},{"num":2,"verse":"I have selected him ahead of my own sons and now I stand here, an old, gray-haired man who has been in public service from the time he was a lad. "},{"num":3,"verse":"Now tell me as I stand before the Lord and before his anointed king—whose ox or donkey have I stolen? Have I ever defrauded you? Have I ever oppressed you? Have I ever taken a bribe? Tell me and I will make right whatever I have done wrong.”"},{"num":4,"verse":"“No,” they replied, “you have never defrauded or oppressed us in any way and you have never taken even one single bribe.”"},{"num":5,"verse":"“The Lord and his anointed king are my witnesses,” Samuel declared, “that you can never accuse me of robbing you.”"},{"num":6,"verse":"“It was the Lord who appointed Moses and Aaron,” Samuel continued. “He brought your ancestors out of the land of Egypt."},{"num":7,"verse":"“Now stand here quietly before the Lord as I remind you of all the good things he has done for you and for your ancestors:"},{"num":8,"verse":"“When the Israelites were in Egypt and cried out to the Lord, he sent Moses and Aaron to bring them into this land. "},{"num":9,"verse":"But they soon forgot about the Lord their God, so he let them be conquered by Sisera, the general of King Hazor’s army, and by the Philistines and the king of Moab."},{"num":10,"verse":"“Then they cried to the Lord again and confessed that they had sinned by turning away from him and worshiping the Baal and Ashtaroth idols. And they pleaded, ‘We will worship you and you alone if you will only rescue us from our enemies.’ "},{"num":11,"verse":"Then the Lord sent Gideon, Barak, Jephthah, and Samuel to save you, and you lived in safety."},{"num":12,"verse":"“But when you were afraid of Nahash, the king of Ammon, you came to me and said that you wanted a king to reign over you. But the Lord your God was already your King, for he has always been your King. "},{"num":13,"verse":"All right, here is the king you have chosen. Look him over. You have asked for him, and the Lord has answered your request."},{"num":14,"verse":"“Now if you will fear and worship the Lord, and listen to his commandments and not rebel against the Lord, and if both you and your king follow the Lord your God, then all will be well. "},{"num":15,"verse":"But if you rebel against the Lord’s commandments and refuse to listen to him, then his hand will be as heavy upon you as it was upon your ancestors."},{"num":16,"verse":"“Now watch as the Lord does great miracles. "},{"num":17,"verse":"You know that it does not rain at this time of the year, during the wheat harvest; I will pray for the Lord to send thunder and rain today, so that you will realize the extent of your wickedness in asking for a king!”"},{"num":18,"verse":"So Samuel called to the Lord, and the Lord sent thunder and rain; and all the people were very much afraid of the Lord and of Samuel."},{"num":19,"verse":"“Pray for us lest we die!” they cried out to Samuel. “For now we have added to all our other sins by asking for a king.”"},{"num":20,"verse":"“Don’t be frightened,” Samuel reassured them. “You have certainly done wrong, but make sure now that you worship the Lord with true enthusiasm, and that you don’t turn your back on him in any way. "},{"num":21,"verse":"Other gods can’t help you. "},{"num":22,"verse":"The Lord will not abandon his chosen people, for that would dishonor his great name. He made you a special nation for himself—just because he wanted to!"},{"num":23,"verse":"“As for me, I will certainly not sin against the Lord by ending my prayers for you; and I will continue to teach you those things which are good and right."},{"num":24,"verse":"“Trust the Lord and sincerely worship him; think of all the tremendous things he has done for you. "},{"num":25,"verse":"But if you continue to sin, you and your king will be destroyed.”"}]