[{"header":"Greetings"},{"num":1,"verse":"From: Paul, a servant of God, and also an apostle of Jesus the Messiah, to bring the faith to those chosen by God, along with full knowledge of the truth that leads to godliness, "},{"num":2,"verse":"which is based on the hope of eternal life that God, who cannot lie, promised before the world began. "},{"num":3,"verse":"At the right time he revealed his message through the proclamation that was entrusted to me by the command of God our Savior."},{"num":4,"verse":"To: Titus, a genuine child in the faith that we share."},{"header":"Qualifications for Leaders in the Church"},{"num":5,"verse":"The reason I left you in Crete was to complete what still needed to be done and to appoint elders in every city, as I myself commanded you. "},{"num":6,"verse":"An elder must be blameless. He must be the husband of one wife and have children who are believers and who are not accused of having wild lifestyles or of being rebellious. "},{"num":7,"verse":"Because an overseer is God’s servant manager, he must be blameless. He must not be arrogant or irritable. He must not drink too much, be a violent person, or make money in shameful ways. "},{"num":8,"verse":"Instead, he must be hospitable to strangers, must appreciate what is good, and be sensible, honest, moral, and self-controlled. "},{"num":9,"verse":"He must be devoted to the trustworthy message that agrees with what we teach, so that he may be able to encourage others with healthy doctrine and refute those who oppose it."},{"header":"Guard What is True"},{"num":10,"verse":"For there are many people who are rebellious, especially those who are converts from Judaism. They speak utter nonsense and deceive people. "},{"num":11,"verse":"They must be silenced, because they are the kind of people who ruin whole families by teaching what they should not teach in order to make money in a shameful way. "},{"num":12,"verse":"One of their very own prophets said,"},{"num":13,"verse":"That statement is true. For this reason, refute them sharply so that they may become healthy in the faith "},{"num":14,"verse":"and not pay attention to Jewish myths or commands given by people who reject the truth. "},{"num":15,"verse":"Everything is clean to those who are clean, but nothing is clean to those who are corrupt and unbelieving. Indeed, their very way of thinking and their consciences have been corrupted. "},{"num":16,"verse":"They claim to know God, but they deny him by their actions. They are detestable, disobedient, and disqualified to do anything good."}]