[{"header":"Chapter 1"},{"num":1,"verse":"Address. Paul, a servant of God and an apostle of Jesus Christ, to further the faith of those whom God has chosen and their knowledge of religious truth,"},{"num":2,"verse":"with its hope of eternal life that God, who does not lie, promised before the beginning of time,"},{"num":3,"verse":"and who now at his appointed time has revealed his word through the proclamation with which I was entrusted by the command of God our Savior,"},{"num":4,"verse":"to Titus, my loyal child in the faith we share: grace and peace from God the Father and Christ Jesus our Savior."},{"num":5,"verse":"A Bishop Must Be Blameless. The reason I left you behind in Crete was so that you could finish up the work that remained to be done and appoint presbyters in every town as I directed you."},{"num":6,"verse":"Each man must be blameless and the husband of only one wife, with children who are believers and free from any suspicion of licentious or rebellious behavior."},{"num":7,"verse":"For in his role as God’s steward a bishop must be blameless. He must not be arrogant or quick-tempered or prone to drunkenness or violent or avaricious."},{"num":8,"verse":"Rather, he must be hospitable, a lover of goodness, prudent, upright, devout, and self-controlled."},{"num":9,"verse":"In addition, he must hold firmly to the authentic message he has been taught, so that he may be able both to exhort with sound doctrine and to refute those who contradict it."},{"num":10,"verse":"For the Pure All Things Are Pure. For there are also many rebellious people, especially among the Jewish converts, who deceive others with their empty talk."},{"num":11,"verse":"It is essential to silence them, since they are ruining whole households by teaching for dishonest gain what it is not right to teach."},{"num":12,"verse":"It was one of their very own prophets, a man from Crete, who said,"},{"num":13,"verse":"This testimony is true. Therefore, rebuke them sharply so that they may be restored to a sound faith,"},{"num":14,"verse":"rather than paying attention to Jewish myths or to the commandments of those who turn away from the truth."},{"num":15,"verse":"To the pure all things are pure, but to those who are corrupt and without faith nothing is pure. Their very minds and their consciences have been corrupted."},{"num":16,"verse":"They profess to know God, but they deny him by their deeds. They are detestable and disobedient, totally unfit for any good work."}]