[{"header":"God’s Revealed Plan"},{"num":1,"verse":"From Paul, a slave of God and an apostle of Jesus the king, in accordance with the faith of God’s chosen people, and the knowledge of the truth that goes with godliness, "},{"num":2,"verse":"in the hope of the life of the coming age. God, who never lies, promised this before the ages began, "},{"num":3,"verse":"and has now, at the right time, unveiled his word through the proclamation entrusted to me, according to the command of our divine saviour."},{"num":4,"verse":"To Titus, my true child, according to the faith which we share."},{"header":"Appointing Elders"},{"num":5,"verse":"This is why I left you in Crete: you are to set straight all the remaining matters, and appoint elders for every town, as I charged you to do. "},{"num":6,"verse":"Elders must be blameless, the husband of only one wife. Their children must be believers, and must not be open to the accusation of loose living, or being rebellious. "},{"num":7,"verse":"This is because an overseer, as one of God’s household managers, must be blameless. He must not be stubborn, or hotheaded, or a heavy drinker, or a bully, or eager for shameful gain. "},{"num":8,"verse":"He must be hospitable, a lover of goodness, sensible, just, holy and self-controlled. "},{"num":9,"verse":"He must hold firmly to the reliable word which goes with the teaching, so that he may have the power both to exhort people with healthy instruction and to give a proper rebuttal to those who oppose it."},{"header":"The Problems in Crete"},{"num":10,"verse":"There are many, you see, who refuse to come into line – people who speak foolishness and deceive others. This is true in particular of the circumcision party. "},{"num":11,"verse":"It’s important that they should be silenced, because they are overturning whole households by teaching things that shouldn’t be taught – and trying to make a shameful living out of it! "},{"num":12,"verse":"One of their own, a native prophet, said, ‘Cretans are always liars, evil animals, idle guzzlers.’ "},{"num":13,"verse":"This testimony is true! That’s why you must rebuke them sternly, so that they may become healthy in the faith, "},{"num":14,"verse":"paying no attention to Jewish myths and the commandments of people who reject the truth. "},{"num":15,"verse":"Everything is pure to people who are pure. But if people are defiled or faithless, nothing is pure for them; even their mind and conscience are defiled. "},{"num":16,"verse":"They declare that they know God, but they deny him by what they do. They are detestable and disobedient, and useless for any good work."}]