[{"header":"Jacob Meets Esau"},{"num":33,"verse":"Jacob saw Esau coming with his four hundred men, so he divided the children among Leah, Rachel, and the two concubines. "},{"num":2,"verse":"He put the concubines and their children first, then Leah and her children, and finally Rachel and Joseph at the rear. "},{"num":3,"verse":"Jacob went ahead of them and bowed down to the ground seven times as he approached his brother. "},{"num":4,"verse":"But Esau ran to meet him, threw his arms around him, and kissed him. They were both crying. "},{"num":5,"verse":"When Esau looked around and saw the women and the children, he asked, “Who are these people with you?”"},{"num":6,"verse":"Then the concubines came up with their children and bowed down; "},{"num":7,"verse":"then Leah and her children came, and last of all Joseph and Rachel came and bowed down."},{"num":8,"verse":"Esau asked, “What about that other group I met? What did that mean?”"},{"num":9,"verse":"But Esau said, “I have enough, my brother; keep what you have.”"},{"num":10,"verse":"Jacob said, “No, please, if I have gained your favor, accept my gift. To see your face is for me like seeing the face of God, now that you have been so friendly to me. "},{"num":11,"verse":"Please accept this gift which I have brought for you; God has been kind to me and given me everything I need.” Jacob kept on urging him until he accepted."},{"num":12,"verse":"Esau said, “Let's get ready and leave. I will go ahead of you.”"},{"num":13,"verse":"Jacob answered, “You know that the children are weak, and I must think of the sheep and livestock with their young. If they are driven hard for even one day, the whole herd will die. "},{"num":14,"verse":"Please go on ahead of me, and I will follow slowly, going as fast as I can with the livestock and the children until I catch up with you in Edom.”"},{"num":15,"verse":"Esau said, “Then let me leave some of my men with you.”"},{"num":16,"verse":"So that day Esau started on his way back to Edom. "},{"num":17,"verse":"But Jacob went to Sukkoth, where he built a house for himself and shelters for his livestock. That is why the place was named Sukkoth."},{"num":18,"verse":"On his return from Mesopotamia Jacob arrived safely at the city of Shechem in the land of Canaan and set up his camp in a field near the city. "},{"num":19,"verse":"He bought that part of the field from the descendants of Hamor father of Shechem for a hundred pieces of silver. "},{"num":20,"verse":"He put up an altar there and named it for El, the God of Israel."}]