[{"header":"The King Honors Mordecai"},{"num":6,"verse":"During that night the king could not sleep. So he had the Book of the Chronicles brought to him, and they were read to the king. "},{"num":2,"verse":"And it was found written what Mordecai had told him about Bigthana and Teresh, two of the king’s servants who were door-keepers, who had planned to kill King Ahasuerus. "},{"num":3,"verse":"The king said, “What honor or reward has been given to Mordecai for this?” Then the king’s servants who served him said, “Nothing has been done for him.” "},{"num":4,"verse":"So the king said, “Who is outside?” Now Haman had just come into the garden outside the king’s special house. He wanted to speak to the king about hanging Mordecai on the tower he had made ready for him. "},{"num":5,"verse":"The king’s servants said to him, “See, Haman is standing in the garden.” And the king said, “Let him come in.” "},{"num":6,"verse":"So Haman came in and the king said to him, “What is to be done for the man whom the king wants to honor?” Haman thought to himself, “Whom would the king want to honor more than me?” "},{"num":7,"verse":"Then Haman said to the king, “For the man whom the king wants to honor, "},{"num":8,"verse":"let them bring clothing which the king wears, and the horse on which the king rides, and on whose head a crown has been placed. "},{"num":9,"verse":"Let the clothing and the horse be handed over to one of the king’s most honored princes. Let them dress the man whom the king wants to honor and lead him on the horse through the center of the city. Have them make it known before him, ‘This is being done to the man whom the king wants to honor.’”"},{"num":10,"verse":"Then the king said to Haman, “Be quick to take the clothing and the horse as you have said. Do this for Mordecai the Jew, who is sitting at the king’s gate. Do not do any less than all that you have said.” "},{"num":11,"verse":"So Haman took the clothing and the horse. He dressed Mordecai and led him on the horse through the center of the city. And he made known before him, “This is being done to the man whom the king wants to honor.” "},{"num":12,"verse":"Then Mordecai returned to the king’s gate. But Haman went home in a hurry with his head covered and very sad. "},{"num":13,"verse":"Haman told Zeresh his wife and all his friends everything that had happened to him. Then his wise men and Zeresh his wife said to him, “If Mordecai, before whom you have begun to fall, is of the Jewish people, you cannot stand against him. For sure you will fall before him.” "},{"num":14,"verse":"While they were still talking with him, the king’s servants came and brought Haman in a hurry to the special supper that Esther had made ready."}]