[{"num":50,"verse":"He prophesieth the destruction of Babylon, and the deliverance of Israel which was in captivity."},{"num":1,"verse":"The word that the Lord spake concerning Babel, and concerning the land of the Chaldeans by the ministry of Jeremiah the Prophet."},{"num":2,"verse":"Declare among the nations, and publish it, and set up a standard, proclaim it and conceal it not: say, Babel is taken, Bel is confounded, Merodach is broken down: her idols are confounded, and their images are burst in pieces."},{"num":3,"verse":"For out of the North there cometh up a nation against her, which shall make her land waste, and none shall dwell therein: they shall flee, and depart, both man and beast."},{"num":4,"verse":"In those days, and at that time, saith the Lord, the children of Israel shall come, they, and the children of Judah together, going, and weeping shall they go, and seek the Lord their God."},{"num":5,"verse":"They shall ask the way to Zion, with their faces thitherward, saying, Come, and let us cleave to the Lord in a perpetual covenant that shall not be forgotten."},{"num":6,"verse":"¶ My people hath been as lost sheep: their shepherds have caused them to go astray, and have turned them away to the mountains: they have gone from mountain to hill, and forgotten their resting place."},{"num":7,"verse":"All that found them have devoured them, and their enemies said, We offend not, because they have sinned against the Lord, the habitation of justice, even the Lord the hope of their fathers."},{"num":8,"verse":"Flee from the midst of Babel, and depart out of the land of the Chaldeans, and be ye as the he goats before the flock."},{"num":9,"verse":"For lo, I will raise and cause to come up against Babel a multitude of mighty nations from the North country, and they shall set themselves in array against her, whereby she shall be taken: their arrows shall be as of a strong man, which is expert, for none shall return in vain."},{"num":10,"verse":"And Chaldea shall be a spoil: all that spoil her, shall be satisfied, saith the Lord."},{"num":11,"verse":"Because you were glad and rejoiced in destroying mine heritage, and because ye are grown fat, as the calves in the grass, and neighed like strong horses,"},{"num":12,"verse":"Therefore your mother shall be sore confounded, and she that bare you shall be ashamed, behold, the uttermost of the nations shall be a desert, a dry land, and a wilderness."},{"num":13,"verse":"Because of the wrath of the Lord it shall not be inhabited, but shall be wholly desolate: everyone that goeth by Babel, shall be astonished, and hiss at all her plagues."},{"num":14,"verse":"Put yourselves in array against Babel round about: all ye that bend the bow, shoot at her, spare no arrows: for she hath sinned against the Lord."},{"num":15,"verse":"Cry against her round about: she hath given her hand: her foundations are fallen, and her walls are destroyed: for it is the vengeance of the Lord: take vengeance upon her: as she hath done, do unto her."},{"num":16,"verse":"Destroy the sower from Babel, and him that handleth the scythe in the time of harvest: because of the sword of the oppressor they shall turn everyone to his people, and they shall flee everyone to his own land."},{"num":17,"verse":"Israel is like scattered sheep: the lions have dispersed them: first the king of Assyria hath devoured him, and last this Nebuchadnezzar king of Babel hath broken his bones."},{"num":18,"verse":"Therefore thus saith the Lord of hosts the God of Israel, Behold, I will visit the king of Babel, and his land, as I have visited the King of Assyria."},{"num":19,"verse":"And I will bring Israel again to his habitation: he shall feed on Carmel and Bashan, and his soul shall be satisfied upon the mount Ephraim and Gilead."},{"num":20,"verse":"In those days, and at that time, saith the Lord, the iniquity of Israel shall be sought for, and there shall be none: and the sins of Judah, and they shall not be found: for I will be merciful unto them whom I reserve."},{"num":21,"verse":"Go up against the land of the rebels, even against it and against the inhabitants of Pekod: destroy, and lay it waste after them, saith the Lord, and do according to all that I have commanded thee."},{"num":22,"verse":"A cry of battle is in the land, and of great destruction."},{"num":23,"verse":"How is the hammer of the whole world destroyed, and broken! how is Babel become desolate among the nations!"},{"num":24,"verse":"I have snared thee, and thou art taken, O Babel, and thou wast not aware: thou art found, and also caught, because thou hast striven against the Lord."},{"num":25,"verse":"The Lord hath opened his treasure, and hath brought forth the weapons of his wrath: for this is the work of the Lord God of hosts in the land of the Chaldeans."},{"num":26,"verse":"Come against her from the utmost border: open her storehouses, tread on her as on sheaves, and destroy her utterly: let nothing of her be left."},{"num":27,"verse":"Destroy all her bullocks: let them go down to the slaughter. Woe unto them, for their day is come, and the time of their visitation."},{"num":28,"verse":"The voice of them that flee, and escape out of the land of Babel to declare in Zion, the vengeance of the Lord our God, and the vengeance of his Temple."},{"num":29,"verse":"Call up the archers against Babel: all ye that bend the bow, besiege it round about: let none thereof escape: recompense her according to her work, and according to all that she hath done, do unto her: for she hath been proud against the Lord, even against the holy One of Israel."},{"num":30,"verse":"Therefore shall her young men fall in the streets, and all her men of war shall be destroyed in that day, saith the Lord."},{"num":31,"verse":"Behold, I come unto thee, O proud man, saith the Lord God of hosts: for thy day is come, even the time that I will visit thee."},{"num":32,"verse":"And the proud shall stumble and fall, and none shall raise him up: and I will kindle a fire in his cities, and it shall devour all round about him."},{"num":33,"verse":"Thus saith the Lord of hosts, The children of Israel, and the children of Judah were oppressed together: and all that took them captives, held them, and would not let them go."},{"num":34,"verse":"But their strong redeemer, whose Name is the Lord of hosts, he shall maintain their cause, that he may give rest to the land, and disquiet the inhabitants of Babel."},{"num":35,"verse":"A sword is upon the Chaldeans, saith the Lord, and upon the inhabitants of Babel, and upon her princes, and upon her wise men."},{"num":36,"verse":"A sword is upon the soothsayers, and they shall dote: a sword is upon her strong men, and they shall be afraid."},{"num":37,"verse":"A sword is upon their horses, and upon their chariots, and upon all the multitude that are in the midst of her, and they shall be like women: a sword is upon her treasures, and they shall be spoiled."},{"num":38,"verse":"A drought is upon her waters, and they shall be dried up: for it is the land of graven images, and they dote upon their idols."},{"num":39,"verse":"Therefore the Ziims with the Iims shall dwell there, and the ostriches shall dwell therein: for it shall be no more inhabited, neither shall it be inhabited from generation unto generation."},{"num":40,"verse":"As God destroyed Sodom and Gomorrah with the places thereof near about, saith the Lord: so shall no man dwell there, neither shall the son of man remain therein."},{"num":41,"verse":"¶ Behold, a people shall come from the North, and a great nation, and many kings shall be raised up from the coasts of the earth."},{"num":42,"verse":"They shall hold the bow and the buckler: they are cruel and unmerciful: their voice shall roar like the sea, and they shall ride upon horses, and be put in array like men to the battle against thee, O daughter of Babel."},{"num":43,"verse":"The king of Babel hath heard the report of them, and his hands waxed feeble: sorrow came upon him, even sorrow as of a woman in travail."},{"num":44,"verse":"Behold, he shall come up like a lion from the swelling of Jordan unto the strong habitation: for I will make Israel to rest, and I will make them to haste away from her: and who is a chosen man that I may appoint against her? for who is like me, and who will appoint me the time? and who is the shepherd that will stand before me?"},{"num":45,"verse":"Therefore hear the counsel of the Lord, that he hath devised against Babel, and his purpose that he hath conceived against the land of the Chaldeans: surely the least of the flock shall draw them out: surely he shall make their habitation desolate with them."},{"num":46,"verse":"At the noise of the winning of Babel the earth is moved, and the cry is heard among the nations."}]