[{"header":"Prophecy against Babylon"},{"num":50,"verse":"The word which the Lord spoke concerning Babylon, the land of the Chaldeans, through Jeremiah the prophet:"},{"num":3,"verse":"For a nation has come up against her from the north; it will make her land an object of horror, and there will be no inhabitant in it. Whether people or animals, they have wandered off, they have gone!"},{"num":4,"verse":"“In those days and at that time,” declares the Lord, “the sons of Israel will come, they and the sons of Judah as well; they will go along weeping as they go, and it will be the Lord their God whom they will seek."},{"num":5,"verse":"They will ask for the way to Zion, turning their faces in its direction; they will come so that they may join themselves to the Lord in an everlasting covenant that will not be forgotten."},{"num":17,"verse":"“Israel is a scattered flock, the lions have driven them away. The first one who devoured him was the king of Assyria, and this last one who has gnawed his bones is Nebuchadnezzar king of Babylon."},{"num":18,"verse":"Therefore this is what the Lord of armies, the God of Israel says: ‘Behold, I am going to punish the king of Babylon and his land, just as I punished the king of Assyria."},{"num":19,"verse":"And I will bring Israel back to his pasture and he will graze on Carmel and Bashan, and his desire will be satisfied in the hill country of Ephraim and Gilead."},{"num":20,"verse":"In those days and at that time,’ declares the Lord, ‘search will be made for the wrongdoing of Israel, but there will be none; and for the sins of Judah, but they will not be found; for I will forgive those whom I leave as a remnant.’"},{"num":44,"verse":"“Behold, one will come up like a lion from the thicket of the Jordan to a perennially watered pasture; for in an instant I will chase them away from it, and I will appoint over it whoever is chosen. For who is like Me, and who will summon Me into court? And who then is the shepherd who can stand against Me?”"},{"num":45,"verse":"Therefore hear the plan of the Lord which He has planned against Babylon, and His purposes which He has in mind against the land of the Chaldeans: they will certainly drag them off, even the little ones of the flock; He will certainly make their pasture desolate because of them."},{"num":46,"verse":"At the shout, “Babylon has been conquered!” the earth quakes, and an outcry is heard among the nations."}]