[{"num":18,"verse":"¶ And David numbered the people that were with him, and set captains of thousands and captains of hundreds over them."},{"num":2,"verse":"And David sent forth a third part of the people under the hand of Joab and another third under the hand of Abishai, the son of Zeruiah, Joab’s brother, and the other third under the hand of Ittai, the Gittite. And the king said unto the people, I will surely go forth with you myself also."},{"num":3,"verse":"But the people answered, Thou shalt not go forth, for if we flee away, they will not care about us; nor if half of us die, will they care about us; but now thou art worth ten thousand of us. Therefore, now it is better that thou help us out of the city."},{"num":4,"verse":"Then the king said unto them, I will do what seems best unto you. And the king stood beside the gate, and all the people came out by hundreds and by thousands."},{"num":5,"verse":"And the king commanded Joab and Abishai and Ittai, saying, Deal gently for my sake with the young man, even with Absalom. And all the people heard when the king gave all the captains charge concerning Absalom."},{"num":6,"verse":"So the people went out into the field against Israel, and the battle was in the forest of Ephraim,"},{"num":7,"verse":"where the people of Israel were slain before the slaves of David, and there was there a great slaughter that day of twenty thousand men."},{"num":8,"verse":"For the battle was there scattered over the face of all the land, and the forest devoured more people that day than the sword devoured."},{"num":9,"verse":"¶ And Absalom met the slaves of David. And Absalom rode upon a mule, and the mule went under the thick boughs of a great oak, and his head caught hold of the oak, and he was taken up between the heaven and the earth; and the mule that was under him went away."},{"num":10,"verse":"And a certain man saw it and told Joab, saying, Behold, I saw Absalom hanged in an oak."},{"num":11,"verse":"And Joab replied unto the man that told him, Behold, when thou didst see him, why didst thou not smite him there to the ground? I would have given thee ten shekels of silver and a girdle."},{"num":12,"verse":"And the man said unto Joab, Though I should receive a thousand shekels of silver in my hand, yet I would not put forth my hand against the king’s son, for in our hearing the king charged thee and Abishai and Ittai, saying, Beware that no one touch the young man Absalom."},{"num":13,"verse":"Otherwise, I should have wrought falsehood against my own soul (for there is no matter hid from the king), and thou thyself would have set thyself against me."},{"num":14,"verse":"Then Joab answered, I may not tarry thus with thee. And taking three darts in his hand, he thrust them through the heart of Absalom while he was yet alive in the midst of the oak."},{"num":15,"verse":"And ten young men that bore Joab’s armour surrounded and smote Absalom and slew him."},{"num":16,"verse":"Then Joab blew the shofar, and the people returned from pursuing after Israel, for Joab held back the people."},{"num":17,"verse":"And they took Absalom and cast him into a great pit in the forest and laid a very great heap of stones upon him; and all Israel fled each one to his tent."},{"num":18,"verse":"Now Absalom, while he was alive, had taken and reared up for himself a pillar, which is in the king’s valley; for he said, I have no son to keep my name in remembrance. And he called the pillar after his own name, and it is called unto this day, Absalom’s place. {Heb. hand}"},{"num":19,"verse":"¶ Then Ahimaaz, the son of Zadok, said, Let me now run and bear the king tidings, how that the LORD has vindicated him of his enemies."},{"num":20,"verse":"And Joab said unto him, Thou shalt not bear tidings today, but thou shalt bear tidings another day; but this day thou shalt bear no tidings because the king’s son is dead."},{"num":21,"verse":"And Joab said to Cushi, Go tell the king what thou hast seen. And Cushi bowed himself unto Joab and ran."},{"num":22,"verse":"Then Ahimaaz, the son of Zadok, said yet again unto Joab, Be what may, let me, I pray thee, also run after Cushi. And Joab said, Why wilt thou run, my son, seeing that thou wilt receive no reward for the tidings?"},{"num":23,"verse":"But, said he, let me run, be what may. And he said unto him, Run. Then Ahimaaz ran by the way of the plain and overran Cushi."},{"num":24,"verse":"And David sat between the two gates, and the watchman went up to the roof over the gate unto the wall and lifted up his eyes and looked, and behold a man running alone."},{"num":25,"verse":"And the watchman cried and told the king. And the king said, If he is alone, he brings good news. And while he kept on drawing near,"},{"num":26,"verse":"the watchman saw another man running, and the watchman called unto the porter and said, Behold another man running alone. And the king said, He also bringeth tidings."},{"num":27,"verse":"And the watchman said, I think the running of the foremost is like the running of Ahimaaz, the son of Zadok. And the king said, He is a good man and comes with good tidings."},{"num":28,"verse":"And Ahimaaz called and said unto the king peace. And he fell down to the earth upon his face before the king, and said, Blessed be the LORD thy God, who has delivered up those men that lifted up their hand against my lord the king."},{"num":29,"verse":"And the king said, Is the young man Absalom at peace? And Ahimaaz answered, When Joab sent the king’s slave, and me thy slave, I saw a great tumult, but I did not know what it was."},{"num":30,"verse":"And the king said unto him, Turn aside and stand here. And he turned aside and stood still."},{"num":31,"verse":"And, behold, Cushi came; and Cushi said, Tidings, my lord the king, for the LORD has vindicated thee today of all those that rose up against thee."},{"num":32,"verse":"And the king said unto Cushi, Is the young man Absalom at peace? And Cushi answered, Let the enemies of my lord the king and all that rise against thee for evil, be as that young man."},{"num":33,"verse":"Then the king was much moved and went up to the chamber over the gate and wept; and as he went, he said this: O my son Absalom, my son, my son Absalom! I would rather have died instead of thee, O Absalom, my son, my son!"}]