[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thus saith the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This is one of those rather unfrequent prophecies found in Holy Scripture, which, not content to foreshadow the future in general outline, descend to striking particularity of detail. It has been indeed suggested that the words. “Josiah by name” are a marginal gloss which has crept into the text, or the insertion of the chronicler writing after the event, and not a part of the original prophetic utterance. The latter supposition is in itself not unlikely. But the mention of the name in prediction is exemplified in the well-known reference to Cyrus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and in this instance, as perhaps also in that, the name is significant (for Josiah means “one healed” or “helped by Jehovah”), and is not, therefore, a mere artificial detail. The particularity of prediction, which is on all hands recognised as exceptional, will be credible or incredible to us, according to the view which we take of the nature of prophetic prediction. If we resolve it into the intuitive sagacity of an inspired mind forecasting the future, because it sees more clearly than ordinary minds the germs of that future in the present, the particularity must seem incredible. If, on the other hand, we believe it to be the supernatural gift of a power to enter, in some measure, into “the mind of God,” in whose fore- knowledge all the future is already seen and ordained, then it will be to us simply unusual, but in no sense incredible, that from time to time foreknowledge of details, as well as generalities, should be granted. It is beyond controversy that the latter view is the one put forward in Holy Scripture, both in the Old Testament and in the New. Prophecy is, indeed, something higher and greater than supernatural prediction; but it claims to include such prediction, both as a test of mission from God, and as a necessary part of its revelation of the dispensations of God. On the fulfilment of this prediction, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 23:15-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 13:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 13:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He cried against the altar — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And consequently against all the worship performed at it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O altar, altar — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He directs his speech against the altar, because the following signs were to be wrought upon it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, a child shall be born, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This prophecy is the more wonderful, because it foretels of what family the child should spring, and what should be his name; and in the accomplishment of it we see the absolute certainty of God’s providence and foreknowledge, even in the most contingent things. For the particulars here mentioned, namely, the having a child, and the giving it this name, were in themselves things as uncertain, dependent on man’s will, and contingent as any events can be: and yet God exactly foretold them, and they came to pass accordingly. God therefore can foresee how the will of man, and of numbers of men, whose wills are dependant on each other, will be influenced in all possible circumstances, and that for ages to come; or, he can certainly and effectually, and yet without infringing or violating man’s liberty, overrule his will which way he pleaseth; otherwise it was possible this prediction might have been false, which it would be blasphemy to assert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Upon it shall he offer the priests — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The meaning is not that he should offer or burn the priests alive, but that he should slay the priests of the high places, and then burn their bones, as he did the bones of those that had been buried, and thereby should defile this altar. How bold was the man that durst thus attack the king in his pride, and interrupt the solemnity in which he gloried! Those who are sent on God’s errand, must not fear the faces of men. Although it was so many ages ere this prophecy was to be fulfilled, the time is spoken of as sure and nigh at hand. For a thousand years are with God as one day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-10 In threatening the altar, the prophet threatens the founder and worshippers. Idolatrous worship will not continue, but the word of the Lord will endure for ever. The prediction plainly declared that the family of David would continue, and support true religion, when the ten tribes would not be able to resist them. If God, in justice, harden the hearts of sinners, so that the hand they have stretched out in sin they cannot pull in again by repentance, that is a spiritual judgment, represented by this, and much more dreadful. Jeroboam looked for help, not from his calves, but from God only, from his power, and his favour. The time may come when those that hate the preaching, would be glad of the prayers of faithful ministers. Jeroboam does not desire the prophet to pray that his sin might be pardoned, and his heart changed, but only that his hand might be restored. He seemed affected for the present with both the judgment and the mercy, but the impression wore off. God forbade his messenger to eat or drink in Bethel, to show his detestation of their idolatry and apostacy from God, and to teach us not to have fellowship with the works of darkness. Those have not learned self-denial, who cannot forbear one forbidden meal.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A child shall be born ... Josiah by name - Divine predictions so seldom descend to such particularity as this, that doubts are entertained, even by orthodox theologians, with respect to the actual mention of Josiah's name by a prophet living in the time of Jeroboam. Only one other instance that can be considered parallel occurs in the whole of Scripture - the mention of Cyrus by Isaiah. Of course no one who believes in the divine foreknowledge can doubt that God could, if He chose, cause events to be foretold minutely by his prophets; but certainly the general law of his Providence is, that He does not do so. If this law is to be at any time broken through, it will not be capriciously. Here it certainly does not appear what great effect was to be produced by the mention of Josiah's name so long before his birth; and hence, a doubt arises whether we have in our present copies the true original text. The sense is complete without the words \"Josiah by name;\" and these words, if originally a marginal note, may easily have crept into the text by the mistake of a copyist. It is remarkable that, where this narrative is again referred to in Kings (marginal reference), there is no allusion to the fact that the man of God had prophesied of Josiah \"by name.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2-9. he cried against the altar—which is put for the whole system of worship organized in Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold, a child shall be born … Josiah by name—This is one of the most remarkable prophecies recorded in the Scriptures; and, in its clearness, circumstantial minuteness, and exact prediction of an event that took place three hundred sixty years later, it stands in striking contrast to the obscure and ambiguous oracles of the heathen. Being publicly uttered, it must have been well known to the people; and every Jew who lived at the accomplishment of the event must have been convinced of the truth of a religion connected with such a prophecy as this. A present sign was given of the remote event predicted, in a visible fissure being miraculously made on the altar. Incensed at the man's license of speech, Jeroboam stretched out his hand and ordered his attendants to seize the bold intruder. That moment the king's arm became stiff and motionless, and the altar split asunder, so that the fire and ashes fell on the floor. Overawed by the effects of his impiety, Jeroboam besought the prophet's prayer. His request was acceded to, and the hand was restored to its healthy state. Jeroboam was artful, and invited the prophet to the royal table, not to do him honor or show his gratitude for the restoration of his hand, but to win, by his courtesy and liberal hospitality, a person whom he could not crush by his power. But the prophet informed him of a divine injunction expressly prohibiting him from all social intercourse with any in the place, as well as from returning the same way. The prohibition not to eat or drink in Beth-el was because all the people had become apostates from the true religion, and the reason he was not allowed to return the same way was lest he should be recognized by any whom he had seen in going.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He cried against the altar; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and consequently, against all that worship, which is oft signified by the name of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 19:19 1 Corinthians 9:13 Hebrews 7:13 13:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 19:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O altar, altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he directs his speech to the altar, partly because the following signs were wrought upon it, and partly to signify that Jeroboam would no more regard his words than the altar did, and yet they should take effect. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A child shall be born unto the house of David, Josiah by name; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which being done above three hundred years after this prophecy, plainly shows the absolute certainty of God’s providence and foreknowledge, even in the most contingent things. For this was in itself uncertain, and wholly depended upon man’s will, both as to the having of a child, and as to the giving it this name. Therefore God can certainly and effectually overrule man’s will which way he pleaseth; or else it was possible that this prediction should have been false, which is blasphemous to imagine. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Upon thee shall he offer the priests; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " synecdoehically, the bones of the priests, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Kings 23:15,16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whereby the altar should be defiled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he cried against the altar in the word of the Lord,.... By his order and command: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, O altar, altar; addressing himself not to Jeroboam, but the altar, thereby reproving his stupidity, the altar being as ready to hear as he; and because that was what moved the indignation of the Lord; and the word is repeated, to show the vehemency of the prophet's spirit, and his zeal against it; though the Jews commonly say it respects both altars, that at Dan, as well as this at Bethel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thus saith the Lord, a child shall be born unto the house of David, Josiah by name; who was not born until three hundred years after this, according to the Jewish writers (a): but it is generally reckoned to be more, even three hundred and fifty or three hundred and sixty years; this is a clear proof of the prescience, predetermination, and providence of God with respect to future events, contingent ones, such as depend upon the will of men; for what more so than giving a name to a child? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon thee shall he offer the priests of the high places that burn incense upon thee, and men's bones shall be burnt upon thee; all which was fulfilled by Josiah, 2 Kings 23:15, it may be read, \"the bones of a man\", which the Jews understand of Jeroboam; but may only signify that, instead of the bones of beasts, which were burnt on it, the bones of men should be burnt, and even of the priests themselves; a glaring proof this of the truth of prophecy, and of divine revelation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "upon thee shall he offer the priests of the high places that burn incense upon thee, and men's bones shall be burnt upon thee; all which was fulfilled by Josiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it may be read, \"the bones of a man\", which the Jews understand of Jeroboam; but may only signify that, instead of the bones of beasts, which were burnt on it, the bones of men should be burnt, and even of the priests themselves; a glaring proof this of the truth of prophecy, and of divine revelation. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Pirke Eliezer, c. 17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Pirke Eliezer, c. 17. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he cried against the altar in the word of the LORD, and said, O altar, altar, thus saith the LORD; Behold, a child shall be born unto the house of David, Josiah by name; and upon thee shall he offer the priests of the high places that burn incense upon thee, and men's bones shall be burnt upon thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he cried against the altar in the word of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew is the same as in the preceding verse. Render therefore (with R.V.) ‘by the word.’ The meaning is that both the journey from Judah and the prophecy were in consequence of divine instruction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Josiah by name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The history of the fulfilment of this prophecy is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Between the accession of Jeroboam and the accession of Josiah was an interval of about 330 years. Hence as the name of the king who should execute the threatened vengeance is mentioned, this prophecy is remarkable among the predictions of the Old Testament. There is nothing with which it can be compared except the prophecy concerning Cyrus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", nor is it according to the manner of scriptural prophecies to be precise about details such as this. Hence some have thought that this verse and also other parts of the story of this chapter were brought into their present form at a later date than Jeroboam. The story of the appearance of the prophet and of his prediction were known from the first, but the details here given were inserted when the prediction was accomplished. There is certainly in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a notice of the ‘cities of Samaria’ which confirms this opinion. Jeroboam’s capital was Shechem, and Samaria was not built, nor any district so called, till the reign of Omri the father of Ahab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Again, it is unlike the rest of the narrative of the Books of Kings that no name should be given to either of the prophets who play such a part in the story. It seems therefore probable that the chapter is taken from some other source than that which supplied what has gone before and what follows it. If this be so, we need not be surprised at what was noticed on the previous verse, that Jeroboam’s action in approaching the altar seems noted as impious while Solomon’s sacrifices are accepted. The compiler of the Books of Kings gathered his material from various sources, and did his work after Josiah was dead. There is no difficulty in understanding how by that time the story as he has given it had been put on record, and as he wished to place Jeroboam’s sin in a strong light all through his history, the events here recorded were exceedingly appropriate for incorporation in his narrative.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon thee shall he offer the priests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The verb is that which is usually rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and it is better (with R.V.) so to translate it. Josephus states specifically ‘upon thee shall he sacrifice the false priests which shall be at that time’. Not only was the king to defile the altar by casting upon it the bones of the dead, but his righteous vengeance was to fall also upon the idolatrous priests then living, and they were to be slain by him before the altars at which they ministered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men’s bones shall be burnt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall they burn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is no gain apparent in departing from the literal rendering of the original.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he cried against the altar in the word of the Lord, and said, O altar, altar, thus saith the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [This apostrophe of the altar is very striking and significant. It is as if the prophet disdained to notice the royal but self-constituted priest; as if it were useless to appeal to him; as if his person was of little consequence compared with the religious system he was inaugurating, the system of which the altar was the centre and embodiment]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behold a child shall be born unto the house of David, Josiah by name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [This particular mention of the Reformer by name was formerly regarded, as by many it is still, as a remarkable instance of prophetic foresight. But the tendency of late, even amongst orthodox theologians, has been to doubt the authenticity of these two words, on the ground that it is unlike Scripture prophecy in general to descend to such details, which rather belong to soothsaying than prediction. Prophecy concerns itself not with names, times, and similar particulars, but with the \"progressive development of the kingdom of God in its general features\" (Keil). It is not for a moment denied that the prophet could just as easily, speaking \"in the word of the Lord,\" have mentioned the name of Josiah, as the circumstance that a son of the house of David would utterly destroy the worship of calves. But it is alleged that the latter prediction is quite in accordance with Scripture usage, and the former altogether contrarient thereto. The case of Cyrus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it is true, is an exception to the rule, unless ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כֹרֶשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which means ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the sun",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is, like Pharaoh and Hadad, a name of office, a title of the Persian kings. The instances of Isaac (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Solomon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 22:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are not parallels, as in both these cases the name was highly significant, and each was mentioned, not by way of prophecy, but as a direction to bestow that name on a child shortly about to be born. And it is certainly noticeable - though the argument ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "silentio is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " necessarily a precarious one - \"that where this narrative is again referred to (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:15-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") there is no allusion to the fact that the man of God had prophesied of Josiah ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "name\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Rawlinson). On the whole, therefore, it seems probable that the two words ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יֹאשׁיָּהוּ שְׁמו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were no part of the original prophecy, but a marginal note which in course of time found its way accidentally into the text. The idea of Keil, that \"Josiah\" is mentioned here not as a proper name, but as an appellation, \"he whom Jehovah sustains,\" is hardly worthy of serious consideration. It may be allowed, however, that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "meaning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the name affords some slender reason for its mention]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and upon thee shall he offer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [lit., ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the priests of the high places",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the priests of the high places",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " [see on 1 Kings 12:32] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "that burn incense upon thee, and men's bones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bones of man, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", human bones. Nothing could more completely foreshadow the future desecration of the altar. The presence in the congregation of a living man who had merely touched a dead body and had not been purified, defiled the tabernacle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), how much more the dead body itself, burnt on the very altar. The Samaritan who once strewed the temple with human ashes (Jos., Ant. 18:02.2) knew that he took the most effectual way to pollute it] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall be burnt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall they burn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "upon thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [For the fulfilment, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"At the ground of this judgment, as of the whole theocratic law, lies the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "jus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " talionis\" (Keil, 1846).] It is worthy of note how completely this brief protest proclaimed to Jeroboam the utter and shameful overthrow, both of his political and religious systems. A child of the rival house of David should stand where ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " then stood, his successors extinct or powerless to prevent him, and should cover this new cultus with disgrace and contempt. The man of God, he must have felt, has proclaimed in few words the fall of his dynasty, the triumph of his rival, and the failure of all his schemes. 1 Kings 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Prophecy against the idolatrous worship at Bethel. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Whilst Jeroboam was still occupied in sacrificing by the altar at Bethel, there came a prophet (אלהים אישׁ) out of Judah \"in the word of Jehovah\" to Bethel, and pronounced upon the altar its eventual destruction. יהוה בּדבר does not mean \"at the word of Jehovah\" here, as it frequently does, but \"in the word of Jehovah,\" as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more especially show; so that the word of Jehovah is regarded as a power which comes upon the prophet and drives him to utter the divine revelation which he has received. It is the same in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 20:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". להקטיר is to be taken as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - \"Behold a son will be born to the house of David, named Josiah; he will offer upon thee (O altar) the priests of the high places, who burn incense (i.e., kindle sacrifices) upon thee, and men's bones will they burn upon thee.\" According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:15-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", this prophecy was literally fulfilled. The older theologians found in this an evident proof of the divine inspiration of the prophets; modern theology, on the other hand, which denies the supernatural inspiration of prophecy in accordance with its rationalistic or naturalistic principles, supplies that this prophecy was not more precisely defined till after the event, and adduces in support of this the apparently just argument, that the prediction of particular historical events is without analogy, and generally that the introduction either of particular persons by name or of definite numbers is opposed to the very essence of prophecy, and turns prediction into soothsaying. The distinction between soothsaying and prediction, however, is not that the latter merely utters general ideas concerning the future, whilst the former announces special occurrences beforehand: but soothsaying is the foretelling of all kinds of accidental things; prophecy, on the contrary, the foretelling of the progressive development of the kingdom of God, not merely in general, but in its several details, according to the circumstances and necessities of each particular age, and that in such a manner that the several concrete details of the prophecy rest upon the general idea of the revelation of salvation, and are thereby entirely removed from the sphere of the accidental. It is true that perfectly concrete predictions of particular events, with the introduction of names and statement of times, are much more rare than the predictions of the progressive development of the kingdom of God according to its general features; but they are not altogether wanting, and we meet with them in every case where it was of importance to set before an ungodly generation in the most impressive manner the truth of the divine threatenings of promises. The allusion to Coresh in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is analogous to the announcement before us. But in both cases the names are closely connected with the destination of the persons in the prophecy, and are simply a concrete description of what God will accomplish through these men. Hence the name יאשׁיּהוּ occurs primarily according to its appellative meaning alone, viz., \"he whom Jehovah supports,\" from אשׁה, to support, and expresses this thought: there will be born a son to the house of David, whom Jehovah will support of establish, so that he shall execute judgment upon the priests of the high places at Bethel. This prophecy was then afterwards so fulfilled by the special arrangement of God, that the king who executed this judgment bore the name of Joshiyahu as his proper name. And so also כּורשׁ was originally an appellative in the sense of sun. The judgment which the prophet pronounced upon the altar was founded upon the jus talionis. On the very same altar on which the priests offer sacrifice to the עגלים shall they themselves be offered, and the altar shall be defiled for ever by the burning of men's bones upon it. אדם עצמות, \"men's bones,\" does not stand for \"their (the priests') bones,\" but is simply an epithet used to designate human corpses, which defile the place where they lie (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]