[{"header":"Judgment Against Jerusalem"},{"num":3,"verse":"Woe to the filthy, foul city, the city of oppressors. "},{"num":2,"verse":"She does not listen. She does not accept correction. She does not even trust the Lord or draw near to her God. "},{"num":3,"verse":"The officials within her are like roaring lions. Her judges are like hungry wolves in the evening that completely devour their prey by morning. "},{"num":4,"verse":"Her prophets are reckless, treacherous men. Her priests have profaned what is holy. They have committed violence against the law."},{"num":5,"verse":"The Lord in her midst is just. He does no wrong. Every morning he brings his justice to light. He does not fail. But those who are unjust are shameless."},{"header":"The Final Proclamation of the Lord"},{"num":6,"verse":"I have cut off nations. Their corner towers are in ruins. I have made their streets desolate, with no one passing by. Their cities are laid waste, with no one living there. "},{"num":7,"verse":"I said, “Certainly you will fear me. You will accept correction so that your dwelling place will not be destroyed by everything I have threatened.” But they eagerly sinned in everything they did. "},{"num":8,"verse":"So wait for me, declares the Lord, until the day that I rise up to plunder. For I am determined to gather the nations, to assemble the kingdoms, and to pour out my indignation upon them and all my furious anger. All the earth will be consumed with the fire of my zeal."},{"num":9,"verse":"I will purify the lips of the people so that they all call on the name of the Lord and serve him side by side. "},{"num":10,"verse":"From beyond the rivers of Cush, my worshippers, my scattered people, will bring offerings to me. "},{"num":11,"verse":"In that day you will no longer bear the shame of your rebellions against me. Then I will remove the proud boasters from among you, and you will never again be arrogant on my holy hill. "},{"num":12,"verse":"But I will leave among you the people who are humble and weak. They will seek refuge in the name of the Lord. "},{"num":13,"verse":"The Israelites who remain will no longer act unjustly. They will not lie, and a deceitful tongue will not be found in their mouth. Instead, they will graze peacefully like sheep and lie down. No one will terrify them."},{"num":14,"verse":"Sing out, daughter of Zion! Shout aloud, Israel! Be glad and rejoice with all your heart, you daughter of Jerusalem. "},{"num":15,"verse":"The Lord has removed the judgment against you. He has turned back your enemy. Israel’s king, the Lord, is in your midst! You no longer need to fear disaster. "},{"num":16,"verse":"In that day Jerusalem will be told, “Do not be afraid, O Zion. Do not give up. "},{"num":17,"verse":"The Lord your God is with you as a hero who will save you. He takes great delight in you. He will quiet you with his love. He will rejoice over you with singing.”"},{"num":18,"verse":"I will bring back those among you who grieve over the loss of the appointed feasts, those for whom the loss was a burden and a disgrace. "},{"num":19,"verse":"Look, at that time I will deal with those who mistreated you. I will rescue the lame and gather together the scattered. I will give them praise and honor in every land where they were put to shame. "},{"num":20,"verse":"At that time I will bring you in. At that time I will gather you. I will give you a name and praise among all the peoples of the earth when I restore your fortunes before your eyes, declares the Lord."}]