[{"num":11,"verse":"A certain man was sick, named Lazarus of Bethany, the town of Mary and her sister Martha. "},{"num":2,"verse":"It was that Mary who anointed Jesus with oyntment and wiped his feet with her hair whose brother Lazarus was sick. "},{"num":3,"verse":"And his sisters sent to him, saying, Lord, behold, he whom you love is sick."},{"num":4,"verse":"When Jesus heard that, he said, This infirmity is not unto death, but for the laud of God, so that the Son of God may be praised by reason of it."},{"num":5,"verse":"Jesus loved Martha and her sister and Lazarus. "},{"num":6,"verse":"Then, after he had heard that he was sick, he remained still two days in the same place where he was."},{"num":7,"verse":"Then after that he said to his disciples, Let us go into Judea again. "},{"num":8,"verse":"His disciples said to him, Master, lately the Jews tried to stone you, and will you go there again? "},{"num":9,"verse":"Jesus answered, Are there not twelve hours in the day? If a man walks in the day, he does not stumble, because he sees the light of this world. "},{"num":10,"verse":"But if a man walks in the night, he stumbles, because there is no light in him."},{"num":11,"verse":"This he said, and after that he said to them, Our friend Lazarus sleeps, but I go to wake him out of sleep. "},{"num":12,"verse":"Then his disciples said, Lord, if he sleeps, he will do well enough. "},{"num":13,"verse":"However, Jesus was speaking of his death. But they thought that he had spoken of the natural sleep. "},{"num":14,"verse":"Then Jesus said to them plainly, Lazarus is dead. "},{"num":15,"verse":"And I am glad for your sakes that I was not there, so that you may believe. But let us go to him."},{"num":16,"verse":"Then Thomas who is called Didymus said to the disciples, Let us also go, so that we may die with him."},{"num":17,"verse":"Then Jesus went, and found that Lazarus had lain in his grave four days already. "},{"num":18,"verse":"Bethany was near Jerusalem, about fifteen furlongs off, "},{"num":19,"verse":"and many of the Jews had come to Martha and Mary to comfort them over their brother. "},{"num":20,"verse":"Martha, as soon as she heard that Jesus was coming, went and met him, but Mary sat still in the house."},{"num":21,"verse":"Then Martha said to Jesus, Lord, if you had been here, my brother would not be dead. "},{"num":22,"verse":"But nevertheless, I know that whatever you ask of God, God will give you. "},{"num":23,"verse":"Jesus said to her, Your brother will rise again. "},{"num":24,"verse":"Martha said to him, I know that he will rise again in the resurrection at the last day."},{"num":25,"verse":"Jesus said to her, I am the resurrection and the life. He who believes on me, yea though he be dead, yet shall he live. "},{"num":26,"verse":"And whoever lives and believes on me, shall never die. Do you believe this?"},{"num":27,"verse":"She said to him, Yes, Lord. I believe that you are Christ, the Son of God who was to come into the world."},{"num":28,"verse":"And as soon as she had so said, she went her way and called Mary her sister quietly, saying, The Teacher has come and is calling for you. "},{"num":29,"verse":"And Mary, as soon as she heard that, arose quickly and went to him."},{"num":30,"verse":"Jesus had not yet come into the town, but was in the place where Martha met him. "},{"num":31,"verse":"Then the Jews that were with Mary in the house and comforting her, when they saw that she rose up hastily and went out, followed her, saying, She is going to the grave, to weep there."},{"num":32,"verse":"Then when Mary arrived where Jesus was and saw him, she fell down at his feet, saying to him, Lord, if you had been here, my brother would not be dead."},{"num":33,"verse":"When Jesus saw her weep, and the Jews who came with her also weep, he groaned in the spirit, and was troubled in himself, "},{"num":34,"verse":"and said, Where have you laid him? They said to him, Lord, come and see. "},{"num":35,"verse":"And Jesus wept. "},{"num":36,"verse":"Then the Jews said, See how he loved him! "},{"num":37,"verse":"And some of them said, Could not he who opened the eyes of the blind, have made also that this man should not have died? "},{"num":38,"verse":"Jesus again groaned in himself, and came to the grave. It was a cave, and a stone lay against it. "},{"num":39,"verse":"And Jesus said, Take away the stone."},{"num":40,"verse":"Jesus said to her, Did I not say to you that if you believed, you would see the glory of God?"},{"num":41,"verse":"Then they took away the stone from the place where the dead man was laid. And Jesus lifted up his eyes and said, Father, I thank you, because you have heard me. "},{"num":42,"verse":"I know that you hear me always. But because of the people that stand by, I said this – so that they may believe that you have sent me."},{"num":43,"verse":"And when he thus had spoken, he cried with a loud voice, Lazarus, come forth! "},{"num":44,"verse":"And he that was dead came forth wrapped hand and foot with grave bonds, and his face was bound about with a headcloth."},{"num":45,"verse":"Then many of the Jews who had come to Mary and seen the things that Jesus did, believed on him. "},{"num":46,"verse":"But some of them went their ways to the Pharisees and told them what Jesus had done."},{"num":47,"verse":"Then the high priests and the Pharisees gathered a council and said, What should we do? This man does many miracles. "},{"num":48,"verse":"If we let him go on this way, everyone will believe on him, and the Romans will come and take away our country and the people."},{"num":49,"verse":"And one of them named Caiaphas, who was the high priest that same year, said to them, You perceive nothing at all, "},{"num":50,"verse":"nor yet consider that it is better for us that one man die for the people, and not that all the people perish. "},{"num":51,"verse":"This he spoke not of himself, but, being high priest that same year, he prophesied that Jesus would die for the people – "},{"num":52,"verse":"and not for the people only, but that he would gather together in one the children of God that were scattered abroad."},{"num":53,"verse":"From that day forth they took counsel together about how to put him to death. "},{"num":54,"verse":"Jesus therefore no longer walked openly among the Jews, but went his way from there to a region near to a wilderness, into a village called Ephraim, and there continued with his disciples."},{"num":55,"verse":"And the Jews’ Passover was at hand, and many people went out of the country up to Jerusalem before the Passover, to purify themselves. "},{"num":56,"verse":"Then they sought for Jesus, and spoke between themselves as they stood in the temple: What do you think, seeing he is not coming to the feast? "},{"num":57,"verse":"The high priests and Pharisees had given a commandment that if anyone knew where he was, they should report it, so that they might seize him."}]