[{"header":"Jesus shows his power over death"},{"num":1,"verse":"Now there was a man by the name of Lazarus who became seriously ill. He lived in Bethany, the village where Mary and her sister Martha lived. (Lazarus was the brother of the Mary who poured perfume upon the Lord and wiped his feet with her hair.) So the sisters sent word to Jesus: “Lord, your friend is ill.”"},{"num":4,"verse":"When Jesus received the message, he said, “This illness is not meant to end in death; it is going to bring glory to God—for it will show the glory of the Son of God.”"},{"num":5,"verse":"Now Jesus loved Martha and her sister and Lazarus. So when he heard of Lazarus’ illness he stayed where he was two days longer. Only then did he say to the disciples, “Let us go back into Judea.”"},{"num":8,"verse":"“Master!” returned the disciples, “only a few days ago, the Jews were trying to stone you to death—are you going there again?”"},{"num":9,"verse":"“There are twelve hours of daylight every day, are there not?” replied Jesus. “If a man walks in the daytime, he does not stumble, for he has the daylight to see by. But if he walks at night he stumbles, because he cannot see where he is going.”"},{"num":11,"verse":"Jesus spoke these words; then after a pause he said to them, “Our friend Lazarus has fallen asleep, but I am going to wake him up.”"},{"num":12,"verse":"At this, his disciples said, “Lord, if he has fallen asleep, he will be all right.”"},{"num":13,"verse":"Actually Jesus had spoken about his death, but they thought that he was speaking about falling into natural sleep. This made Jesus tell them quite plainly, “Lazarus has died, and I am glad that I was not there—for your sakes, that you may learn to believe. And now, let us go to him.”"},{"num":16,"verse":"Thomas (known as the twin) then said to his fellow-disciples, “Come on, then, let us all go and die with him!”"},{"num":17,"verse":"When Jesus arrived, he found that Lazarus had already been in the grave four days. Now Bethany is quite near Jerusalem, rather less than two miles away, and a good many of the Jews had come out to see Martha and Mary to offer them sympathy over their brother’s death. When Martha heard that Jesus was on his way, she went out and met him, while Mary stayed in the house."},{"num":21,"verse":"“If only you had been here, Lord,” said Martha, “my brother would never have died. And I know that, even now, God will give you whatever you ask from him.”"},{"num":23,"verse":"“Your brother will rise again,” Jesus replied to her."},{"num":24,"verse":"“I know,” said Martha, “that he will rise again in the resurrection at the last day.”"},{"num":25,"verse":"“I myself am the resurrection and the life,” Jesus told her. “The man who believes in me will live even though he dies, and anyone who is alive and believes in me will never die at all. Can you believe that?”"},{"num":27,"verse":"“Yes, Lord,” replied Martha. “I do believe that you are Christ, the Son of God, the one who was to come into the world.” Saying this she went away and called Mary her sister, whispering, “The master’s here and is asking for you.” When Mary heard this she sprang to her feet and went to him. Now Jesus had not yet arrived at the village itself, but was still where Martha had met him. So when the Jews who had been condoling with Mary in the house saw her get up quickly and go out, they followed her, imagining that she was going to the grave to weep there."},{"num":32,"verse":"When Mary met Jesus, she looked at him, and then fell down at his feet. “If only you had been here, Lord,” she said, “my brother would never have died.”"},{"num":33,"verse":"When Jesus saw Mary weep and noticed the tears of the Jews who came with her, he was deeply moved and visibly distressed."},{"num":34,"verse":"“Where have you put him?” he asked."},{"num":35,"verse":"“Lord, come and see,” they replied, and at this Jesus himself wept."},{"num":36,"verse":"“Look how much he loved him!” remarked the Jews, though some of them asked, “Could he not have kept this man from dying if he could open that blind man’s eyes?”"},{"num":38,"verse":"Jesus was again deeply moved at these words, and went on to the grave. It was a cave, and a stone lay in front of it."},{"num":39,"verse":"“Take away the stone,” said Jesus. “But Lord,” said Martha, the dead man’s sister, “he has been dead four days. By this time he will be decaying ....”"},{"num":40,"verse":"“Did I not tell you,” replied Jesus, “that if you believed, you would see the wonder of what God can do?”"},{"num":41,"verse":"Then they took the stone away and Jesus raised his eyes and said, “Father, I thank you that you have heard me. I know that you always hear me, but I have said this for the sake of these people standing here so that they may believe that you have sent me.”"},{"num":43,"verse":"And when he had said this, he called out in a loud voice, “Lazarus, come out!”"},{"num":44,"verse":"And the dead man came out, his hands and feet bound with grave-clothes and his face muffled with a handkerchief. “Now unbind him,” Jesus told them, “and let him go home.”"},{"header":"Jesus’ miracle leads to deadly hostility"},{"num":45,"verse":"After this many of the Jews who had accompanied Mary and observed what Jesus did, believed in him. But some of them went off to the Pharisees and told them what Jesus had done. Consequently, the Pharisees and chief priests summoned the council and said, “What can we do? This man obviously shows many remarkable signs. If we let him go on doing this sort of thing we shall have everybody believing in him. Then we shall have the Romans coming and that will be the end of our holy place and our very existence as a nation.”"},{"num":49,"verse":"But one of them, Caiaphas, who was High Priest that year, addressed the meeting: “You plainly don’t understand what is involved here. You do not realise that it would be a good thing for us if one man should die for the sake of the people—instead of the whole nation being destroyed.” (He did not make this remark on his own initiative but, since he was High Priest that year, he was in fact inspired to say that Jesus was going to die for the nation’s sake—and in fact not for that nation only, but to bring together into one family all the children of God scattered throughout the world.) From that day then, they planned to kill him. As a consequence Jesus made no further public appearance among the Jews but went away to the countryside on the edge of the desert, and stayed with his disciples in a town called Ephraim. The Jewish Passover was approaching and many people went up from the country to Jerusalem before the actual Passover, to go through a ceremonial cleansing. They were looking for Jesus there and kept saying to one another as they stood in the Temple, “What do you think? Surely he won’t come to the festival?”"},{"num":57,"verse":"It should be understood that the chief priests and the Pharisees had issued an order that anyone who knew of Jesus’ whereabouts should tell them, so they could arrest him."}]