[{"header":"Lazarus Is Dead"},{"num":11,"verse":"Now a man named Lazarus was sick. He was from Bethany, the village of Miriam and her sister Martha. "},{"num":2,"verse":"This was the same Miriam who anointed the Master with perfume and wiped His feet with her hair. It was her brother Lazarus who was sick. "},{"num":3,"verse":"So the sisters sent a word to Yeshua, saying, “Master, the one you love is sick!”"},{"num":4,"verse":"When Yeshua heard this, He said, “This sickness will not end in death. It is for God’s glory, so that Ben-Elohim may be glorified through it.” "},{"num":5,"verse":"Now Yeshua loved Martha and her sister and Lazarus. "},{"num":6,"verse":"However, when He heard that Lazarus was sick, He stayed where He was for two more days."},{"num":7,"verse":"Then after this, He said to His disciples, “Let’s go up to Judea again.”"},{"num":8,"verse":"“Rabbi,” the disciples say to Him, “just now the Judean leaders were trying to stone You! And You’re going back there again?”"},{"num":9,"verse":"Yeshua answered, “Aren’t there twelve hours in the day? If a man walks in the day, he doesn’t stumble, because he sees the light of the world. "},{"num":10,"verse":"But if a man should walk around at night, he stumbles, because the light is not in him.”"},{"num":11,"verse":"After He said this, He tells them, “Our friend Lazarus has fallen asleep, but I’m going there to wake him up.”"},{"num":12,"verse":"So the disciples said to Him, “Master, if he has fallen asleep, he will get better.” "},{"num":13,"verse":"Now Yeshua had spoken about his death, but they thought He was talking about ordinary sleep."},{"num":14,"verse":"Then Yeshua told them clearly, “Lazarus is dead! "},{"num":15,"verse":"I’m glad for your sake I wasn’t there, so that you may believe. Anyway, let’s go to him!”"},{"num":16,"verse":"Then Thomas called the Twin said to the other disciples, “Let’s go too, so that we may die with Him!”"},{"header":"Comforting the Mourners"},{"num":17,"verse":"So when Yeshua arrived, He discovered that Lazarus had been in the tomb already for four days. "},{"num":18,"verse":"Bethany was less than two miles from Jerusalem, "},{"num":19,"verse":"and many of the Judeans had come to Martha and Miriam to console them about their brother."},{"num":20,"verse":"When Martha heard that Yeshua was coming, she went out to meet Him; but Miriam sat in the house. "},{"num":21,"verse":"Martha said to Yeshua, “Master, if You had been here, my brother wouldn’t have died! "},{"num":22,"verse":"But I know, even now, that whatever You may ask of God, He will give You.”"},{"num":23,"verse":"Yeshua said to her, “Your brother will rise again.”"},{"num":24,"verse":"Martha said to Him, “I know, he will rise again in the resurrection on the last day.”"},{"num":25,"verse":"Yeshua said to her, “I am the resurrection and the life! Whoever believes in Me, even if he dies, shall live. "},{"num":26,"verse":"And whoever lives and believes in Me shall never die. Do you believe this?”"},{"num":27,"verse":"She says to Him, “Yes, Lord, I believe that you are the Messiah, Ben-Elohim who has come into the world.” "},{"num":28,"verse":"After she said this, she left and secretly told her sister Miriam, “The Teacher is here, and He’s calling for you.” "},{"num":29,"verse":"As soon as Miriam heard, she quickly got up and was coming to Him. "},{"num":30,"verse":"Now Yeshua had not yet come into the village, but was still in the place where Martha had met Him. "},{"num":31,"verse":"The Judeans, who were with Miriam in the house and comforting her, seeing how quickly she got up and went out, followed her. They thought she was going to the tomb to weep there."},{"num":32,"verse":"So when Miriam came to where Yeshua was, she saw Him and fell at His feet, saying to Him, “Master, if You had been here, my brother would not have died!”"},{"num":33,"verse":"When Yeshua saw her weeping, and the Judeans who came with her weeping, He was deeply troubled in spirit and Himself agitated. "},{"num":34,"verse":"“Where have you laid him?” He asked."},{"num":35,"verse":"Yeshua wept. "},{"num":36,"verse":"So the Judeans said, “See how He loved him!”"},{"num":37,"verse":"But some of them said, “Couldn’t this One, who opened the eyes of the blind man, have also kept this man from dying?”"},{"header":"Yeshua’s Word Raises the Dead"},{"num":38,"verse":"So Yeshua, again deeply troubled within Himself, comes to the tomb. It was a cave, and a stone was lying against it. "},{"num":39,"verse":"Yeshua says, “Roll away the stone!”"},{"num":40,"verse":"Yeshua says to her, “Didn’t I tell you that if you believed, you would see the glory of God?”"},{"num":41,"verse":"So they rolled away the stone. Yeshua lifted up His eyes and said, “Father, I thank you that you have heard Me. "},{"num":42,"verse":"I knew that You always hear Me; but because of this crowd standing around I said it, so that they may believe that You sent Me.”"},{"num":43,"verse":"And when He had said this, He cried out with a loud voice, “Lazarus, come out!” "},{"num":44,"verse":"He who had been dead came out, wrapped in burial clothes binding his hands and feet, with a cloth over his face. And Yeshua tells them, “Cut him loose, and let him go!”"},{"header":"Better that One Man Die"},{"num":45,"verse":"Therefore many of the Judeans, who had come to Miriam and had seen what Yeshua had done, put their trust in Him. "},{"num":46,"verse":"But some of them went to the Pharisees and told them what Yeshua had done."},{"num":47,"verse":"So the ruling kohanim and Pharisees called a meeting of the Sanhedrin. “What are we doing?” they asked. “This Man is performing many signs! "},{"num":48,"verse":"If we let Him go on like this, everyone will believe in Him, and the Romans will come and take away both our holy place and our nation.”"},{"num":49,"verse":"But one of them, Caiaphas, who was kohen gadol that year, said to them, “You know nothing! "},{"num":50,"verse":"You don’t take into account that it is better for you that one man die for the people rather than for the whole nation to be destroyed.”"},{"num":51,"verse":"Now he did not say this by himself; but as the kohen gadol that year, he prophesied that Yeshua would die for the nation."},{"num":52,"verse":" And not for the nation only, but also so that He might gather together into one the scattered children of God."},{"num":53,"verse":"So from that day on, they plotted to kill Him. "},{"num":54,"verse":"Therefore Yeshua no longer walked openly among the Judeans, but went from there to the country near the wilderness, to a city called Ephraim. He stayed there with His disciples."},{"num":55,"verse":"Now the Jewish Passover was near; and many people went up out of the regions to Jerusalem before Passover, to purify themselves. "},{"num":56,"verse":"So they were searching for Yeshua, saying to one another as they stood in the Temple, “What do you think? Won’t He come to the feast at all?” "},{"num":57,"verse":"Now the ruling kohanim and Pharisees had given orders that if anyone knew where He was, he should report it so that they might arrest Him."}]