[{"num":11,"verse":"There was a certain man who was very ill. He was known as Lazarus from Bethany, which is the hometown of Mary and her sister Martha. "},{"num":2,"verse":"Mary did a beautiful thing for Jesus. She anointed the Lord with a pleasant-smelling oil and wiped His feet with her hair. Her brother Lazarus became deathly ill, "},{"num":3,"verse":"so the sisters immediately sent a message to Jesus which said, “Lord, the one You love is very ill.” "},{"num":4,"verse":"Jesus heard the message."},{"num":5,"verse":"Jesus dearly loved Mary, Martha, and Lazarus. "},{"num":6,"verse":"However, after receiving this news, He waited two more days where He was."},{"num":13,"verse":"Jesus used “sleep” as a metaphor for death, but the disciples took Him literally and did not understand. "},{"num":14,"verse":"Then Jesus spoke plainly."},{"num":17,"verse":"As Jesus was approaching Bethany (which is about two miles east of Jerusalem), He heard that Lazarus had been in the tomb four days. "},{"num":19,"verse":"Now many people had come to comfort Mary and Martha as they mourned the loss of their brother. "},{"num":20,"verse":"Martha went to meet Jesus when word arrived that He was approaching Bethany, but Mary stayed behind at the house."},{"num":28,"verse":"After this Martha ran home to Mary."},{"num":29,"verse":"Mary did not waste a minute. She got up and went "},{"num":30,"verse":"to the same spot where Martha had found Jesus outside the village. "},{"num":31,"verse":"The people gathered in her home offering support and comfort assumed she was going back to the tomb to cry and mourn, so they followed her. "},{"num":32,"verse":"Mary approached Jesus, saw Him, and fell at His feet."},{"num":33,"verse":"When Jesus saw Mary’s profound grief and the moaning and weeping of her companions, He was deeply moved by their pain in His spirit and was intensely troubled."},{"num":35,"verse":"As they walked, Jesus wept; "},{"num":36,"verse":"and everyone noticed how much Jesus must have loved Lazarus. "},{"num":37,"verse":"But others were skeptical."},{"num":38,"verse":"Then Jesus, who was intensely troubled by all of this, approached the tomb—a small cave covered by a massive stone."},{"num":41,"verse":"They removed the stone, and Jesus lifted His eyes toward heaven."},{"num":43,"verse":"After these words, He called out in a thunderous voice."},{"num":44,"verse":"Then, the man who was dead walked out of his tomb bound from head to toe in a burial shroud."},{"num":45,"verse":"As a result, many of the Jews who had come with Mary saw what happened and believed in Him. "},{"num":46,"verse":"But some went to the Pharisees to report what they witnessed Jesus doing. "},{"num":47,"verse":"As a result of these reports—and on short notice—the chief priests and Pharisees called a meeting of the high council."},{"num":51,"verse":"His speech was more than it seemed. As high priest that year, Caiaphas prophesied (without knowing it) that Jesus would die on behalf of the entire nation, "},{"num":52,"verse":"and not just for the children of Israel—He would die so all God’s children could be gathered from the four corners of the world into one people. "},{"num":53,"verse":"In that moment, they cemented their intentions to have Jesus executed."},{"num":54,"verse":"From that day forward, Jesus refrained from walking publicly among the people in Judea. He withdrew to a small town known as Ephraim, a rural area near the wilderness, where He set up camp with His disciples."},{"num":55,"verse":"The Passover was approaching, and Jews everywhere traveled to Jerusalem early so they could purify themselves and prepare for Passover. "},{"num":56,"verse":"People were looking for Jesus, hoping to catch a glimpse of Him in the city. All the while, some Jews were discussing Him in the temple."},{"num":57,"verse":"In the midst of this confusion, the Pharisees and the chief priests ordered that if anyone knew the whereabouts of Jesus of Nazareth, it must be reported immediately so they could arrest Him."}]