[{"num":11,"verse":"A man named Lazarus was sick. He lived at Bethany, the home of Mary and her sister Martha."},{"num":2,"verse":"Mary was the same woman that put oil on the Lord and wiped his feet with her hair. It was her brother Lazarus who was sick."},{"num":3,"verse":"So the sisters sent someone to tell Jesus. They said, `Lord, the one whom you love is sick.'"},{"num":4,"verse":"Jesus heard the message. He said, `The man is sick, but he will not die from it. But this will show people that God is great, and his Son also.'"},{"num":5,"verse":"Jesus loved Martha and her sister and Lazarus."},{"num":6,"verse":"When he heard that Lazarus was sick, he stayed where he was for two days more."},{"num":7,"verse":"After that, he said to his disciples, `Let us go back again to Judea.'"},{"num":8,"verse":"They said, `Master, it is not long since the Jews wanted to kill you with stones. Are you going back there again?'"},{"num":9,"verse":"Jesus answered them, `Are there not twelve hours in the day? If a person walks in the daylight, then he will not fall. He can see by the light that is in the world."},{"num":10,"verse":"But if a person walks at night, he will fall because there is no light for him to see.'"},{"num":11,"verse":"After he said this, he said also, `Our friend Lazarus is sleeping, but I am going to wake him up.'"},{"num":12,"verse":"His disciples said, `Lord, if he is sleeping then he will get well again.'"},{"num":13,"verse":"But Jesus meant that Lazarus had died. The disciples thought that Lazarus was sleeping to have a rest."},{"num":14,"verse":"Then Jesus told them plainly. He said, `Lazarus is dead."},{"num":15,"verse":"For your sake I am glad that I was not there. You will really believe in me. But come, let us go to him.'"},{"num":16,"verse":"Then Thomas, who was called the Twin, said to the other disciples, `Let us all go and die with Jesus.'"},{"num":17,"verse":"When Jesus came, he found that Lazarus had been buried four days."},{"num":18,"verse":"Bethany was only about two miles from Jerusalem."},{"num":19,"verse":"Many Jews had come out to see Martha and Mary. They came to comfort them because their brother had died."},{"num":20,"verse":"As soon as Martha heard that Jesus was coming, she went to meet him. But Mary just stayed in the house."},{"num":21,"verse":"Martha said to Jesus, `Lord, if you had been here, my brother would not have died."},{"num":22,"verse":"But even yet, I know that God will give you anything that you ask for.'"},{"num":23,"verse":"Jesus said, `Your brother will rise again.'"},{"num":24,"verse":"Martha said, `I know that he will rise when the dead people are raised up on the last day.'"},{"num":25,"verse":"Jesus said, `I am the one who will raise people up and give them life. The person who believes in me will live, even though he has died."},{"num":26,"verse":"Anyone who is living and who believes in me will never die. Do you believe this?'"},{"num":27,"verse":"She said, `Yes, Lord, I believe that you are the Christ. I believe that you are the Son of God who was to come into the world.'"},{"num":28,"verse":"When she had said this, she went back to call her sister. She said quietly, `Mary, the Master has come. He is calling you.'"},{"num":29,"verse":"When Mary heard that, she got up quickly and came to him."},{"num":30,"verse":"Jesus was not in the town yet. He was at the same place where Martha had met him."},{"num":31,"verse":"The Jews who were in the house to comfort Mary saw her get up quickly and go out. They went after her. They said, `She is going to the grave to cry.'"},{"num":32,"verse":"Mary reached the place where Jesus was. When she saw him, she kneeled down before him and said, `Lord, if you had been here, my brother would not have died.'"},{"num":33,"verse":"Jesus saw her crying. He saw the Jews who came with her crying also. Then his heart was troubled very much."},{"num":34,"verse":"`Where have you buried him?' he said. `Come, Lord, and see,' they said."},{"num":35,"verse":"Then Jesus cried."},{"num":36,"verse":"`Look,' the Jews said. `He truly loved him very much!'"},{"num":37,"verse":"Then some of them said, `This man made the blind see. Could he not have saved Lazarus from dying?'"},{"num":38,"verse":"Jesus' heart was troubled very much again. Then he came to the grave. It was a hole in the side of a large rock. A stone covered the hole."},{"num":39,"verse":"Jesus said, `Take the stone away.' Martha, the sister of the dead man, said, `Lord, he will smell bad by this time. He has been dead four days already.'"},{"num":40,"verse":"Jesus said to her, `Did I not tell you that if you believed God you would see that he is great?'"},{"num":41,"verse":"So they pushed the stone away from the grave. Jesus looked up and said, `Father, I thank you because you have heard me."},{"num":42,"verse":"I know that you always hear me. But I have said this so that the people who are standing here might believe that you have sent me.'"},{"num":43,"verse":"When he had said this, he shouted, `Lazarus, come out!'"},{"num":44,"verse":"Out came the dead man! The cloth that they had buried him in was tied around his hands and feet. Another small cloth was tied around his face. Jesus said to the people, `Take off the cloths and free him!'"},{"num":45,"verse":"When they saw the things Jesus did, many of the Jews who had come with Mary believed on Him."},{"num":46,"verse":"But some of them went to the Pharisees and told them what Jesus had done."},{"num":47,"verse":"So the chief priests and the Pharisees met together. They said, `What are we going to do? This man is doing many big works."},{"num":48,"verse":"If we do not stop him, everybody will believe on him. Then the Roman rulers will come and break down our holy town and our nation.'"},{"num":49,"verse":"One of them, Caiaphas, was high priest that year. He said to them, `You know nothing."},{"num":50,"verse":"You do not understand. It is better for us if one person dies for the people. Then the whole nation will not be broken down.'"},{"num":51,"verse":"He himself did not understand what he was saying. But he was the high priest that year. God spoke through him to say that Jesus should die for those people."},{"num":52,"verse":"Jesus would die, not only for those people, but he would gather together all of God's people who are out in different places."},{"num":53,"verse":"So from that day on they planned to kill Jesus."},{"num":54,"verse":"That is why Jesus did not go among the Jews in the open. But he went to another part of the country, to a town called Ephraim. He stayed there with his disciples."},{"num":55,"verse":"The time for the Passover Feast of the Jews was near. Many people from all around the country went to Jerusalem. They had to make themselves clean according to the law before the Passover Feast."},{"num":56,"verse":"They were looking around for Jesus. As they were standing in the temple they talked to one another. They said, `What do you think? Do you think that he will come to the feast?'"},{"num":57,"verse":"Both the chief priest and the Pharisees had told the people, `If any man knows where he is, tell us. We want to catch him.'"}]