[{"header":"The Vision of the Valley of Bones"},{"num":37,"verse":"The Lord laid his hand on me and brought me out by the Spirit of the Lord to the middle of a valley that was filled with bones. "},{"num":2,"verse":"He led me here and there throughout the valley, and I was amazed to see that the surface of the entire valley was covered with myriads of very dry bones! "},{"num":3,"verse":"The Lord asked me, “Son of Man, will these bones ever live?”"},{"num":4,"verse":"Then the Lord told me, “Prophesy to these bones. Tell them: ‘You dry bones, listen to the message from the Lord: “"},{"num":5,"verse":"This is what the Lord God says to you dry bones! ‘Pay attention! I’m bringing my Spirit into you right now, and you’re going to live! "},{"num":6,"verse":"I’m going to grow tendons on you, regenerate your flesh, cover you with skin, and make you breathe again so that you can come back to life and learn that I am the Lord.’”’”"},{"header":"The Bones are Raised to Life"},{"num":7,"verse":"So I prophesied, just as I had been ordered to do so. Immediately there was a noise and a rattling—and then all of a sudden the bones came together by themselves! Each bone came together, all of them attached together! "},{"num":8,"verse":"As I continued to watch, I saw tendons growing on the bones, and muscles growing and covering them, and then skin covered the flesh from above. But the bodies weren’t breathing. "},{"num":9,"verse":"Then he ordered me, “Prophesy to the Spirit, Son of Man. Tell the Spirit, ‘This is what the Lord God says: “Come from the four winds, you Spirit, and breathe into these people who have been killed, so they will live.”’” "},{"num":10,"verse":"So I prophesied as I had been ordered, breath entered them, and they began to live. They stood on their own feet as a vast, united army."},{"header":"The Vision is Interpreted for Ezekiel"},{"num":11,"verse":"“These bones represent the entire house of Israel,” the Lord explained to me. “Look how they keep saying, ‘Our bones are dried up, and our future is lost. We’ve been completely eliminated!’ "},{"num":12,"verse":"“Therefore prophesy to them, and tell them, ‘Watch me! I’m going to open your graves, lift you out of those graves, and bring my people back into the land of Israel. "},{"num":13,"verse":"Then you’ll learn that I am the Lord, when I’ve opened your graves and caused you to come up out of them, my people. "},{"num":14,"verse":"I’m going to place my Spirit in you all, and you will live. I’ll place you all into your land, and you’ll learn that I, the Lord, have been speaking and doing this,’ declares the Lord.’”"},{"header":"The Future Union of Israel and Judah"},{"num":15,"verse":"A message came to me from the Lord, and this is what it was: "},{"num":16,"verse":"“Now as for you, Son of Man, grab a stick of wood for yourself and write on it these words:"},{"num":17,"verse":"“Then join them together end-to-end so that they become a single baton in your hand. "},{"num":18,"verse":"When the descendants of your people ask you, ‘Would you please explain to us what you mean by this?’ "},{"num":19,"verse":"you are to tell them, ‘This is what the Lord says: “Watch me! I’m taking the baton that represents Joseph, which Ephraim is holding in his hand, along with his companions the tribes of Israel, and I’m going to join them with the baton that represents Judah. I’m making them a single baton, that is, a complete baton in my hand.”"},{"num":20,"verse":"“The batons on which you engrave your writing are to remain right in front of them in your hand. "},{"num":21,"verse":"Then tell them, ‘This is what the Lord God says: “Watch me take the Israelis out of the nations where they’ve gone and return them from every direction. I’m going to bring them back into their own land. "},{"num":22,"verse":"I’m going to make them a united people in the land, on the mountains of Israel, and I’ll set a single king to rule over them. They’ll never again be two separate people. They’ll never again be divided into two kingdoms. "},{"num":23,"verse":"They will never again defile themselves with their idols, with other loathsome things, or with any of their sins. Instead, I will deliver them from all of the places where they have sinned, and then I’ll cleanse them. They will be my people and I will be their God.”’”"},{"header":"David’s Rule as King"},{"num":24,"verse":"“‘“My servant King David will be there for them, and one shepherd will be appointed for them. They will live according to my decrees, keep my regulations, and practice them. "},{"num":25,"verse":"They will live in the land that I gave to my servant Jacob and on which your ancestors lived. They will live in that land, along with their children and grandchildren, forever. David my servant will be their everlasting leader. "},{"num":26,"verse":"I’ll make a secure covenant with them, one that will last forever. I will establish them, make them increase in population, and will place my sanctuary in their midst forever. "},{"num":27,"verse":"I will pitch my tent among them and will be their God. They will be my people, "},{"num":28,"verse":"and the nations will learn that I, the Lord, am the sanctifier of Israel when I place my sanctuary in their midst forever.”’”"}]