[{"header":"The Vision of Dry Bones"},{"num":37,"verse":"I felt the power of the Lord on me, and he brought me out by the Spirit of the Lord and put me down in the middle of a valley. It was full of bones. "},{"num":2,"verse":"He led me around among the bones, and I saw that there were many bones in the valley and that they were very dry. "},{"num":3,"verse":"Then he asked me, “Human, can these bones live?”"},{"num":4,"verse":"He said to me, “Prophesy to these bones and say to them, ‘Dry bones, hear the word of the Lord. "},{"num":5,"verse":"This is what the Lord God says to the bones: I will cause breath to enter you so you will come to life. "},{"num":6,"verse":"I will put muscles on you and flesh on you and cover you with skin. Then I will put breath in you so you will come to life. Then you will know that I am the Lord.’”"},{"num":7,"verse":"So I prophesied as I was commanded. While I prophesied, there was a noise and a rattling. The bones came together, bone to bone. "},{"num":8,"verse":"I looked and saw muscles come on the bones, and flesh grew, and skin covered the bones. But there was no breath in them."},{"num":9,"verse":"Then he said to me, “Prophesy to the wind. Prophesy, human, and say to the wind, ‘This is what the Lord God says: Wind, come from the four winds, and breathe on these people who were killed so they can come back to life.’” "},{"num":10,"verse":"So I prophesied as the Lord commanded me. And the breath came into them, and they came to life and stood on their feet, a very large army."},{"num":11,"verse":"Then he said to me, “Human, these bones are like all the people of Israel. They say, ‘Our bones are dried up, and our hope has gone. We are destroyed.’ "},{"num":12,"verse":"So, prophesy and say to them, ‘This is what the Lord God says: My people, I will open your graves and cause you to come up out of your graves. Then I will bring you into the land of Israel. "},{"num":13,"verse":"My people, you will know that I am the Lord when I open your graves and cause you to come up from them. "},{"num":14,"verse":"And I will put my Spirit inside you, and you will come to life. Then I will put you in your own land. And you will know that I, the Lord, have spoken and done it, says the Lord.’”"},{"header":"Judah and Israel Back Together"},{"num":15,"verse":"The Lord spoke his word to me, saying, "},{"num":16,"verse":"“Human, take a stick and write on it, ‘For Judah and all the Israelites with him.’ Then take another stick and write on it, ‘The stick of Ephraim, for Joseph and all the Israelites with him.’ "},{"num":17,"verse":"Then join them together into one stick so they will be one in your hand."},{"num":18,"verse":"“When your people say to you, ‘Explain to us what you mean by this,’ "},{"num":19,"verse":"say to them, ‘This is what the Lord God says: I will take the stick for Joseph and the tribes of Israel with him, which is in the hand of Ephraim, and I will put it with the stick of Judah. I will make them into one stick, and they will be one in my hand.’ "},{"num":20,"verse":"Hold the sticks on which you wrote these names in your hand so the people can see them. "},{"num":21,"verse":"Say to the people, ‘This is what the Lord God says: I am going to take the people of Israel from among the nations where they have gone. I will gather them from all around and bring them into their own land. "},{"num":22,"verse":"I will make them one nation in the land, on the mountains of Israel. One king will rule all of them. They will never again be two nations; they will not be divided into two kingdoms anymore. "},{"num":23,"verse":"They will not continue to make themselves unclean by their idols, their statues of gods which I hate, or by their sins. I will save them from all the ways they sin and turn against me, and I will make them clean. Then they will be my people, and I will be their God."},{"num":24,"verse":"“‘My servant David will be their king, and they will all have one shepherd. They will live by my rules and obey my laws. "},{"num":25,"verse":"They will live on the land I gave to my servant Jacob, the land in which your ancestors lived. They will all live on the land forever: they, their children, and their grandchildren. David my servant will be their king forever. "},{"num":26,"verse":"I will make an agreement of peace with them, an agreement that continues forever. I will put them in their land and make them grow in number. Then I will put my Temple among them forever. "},{"num":27,"verse":"The place where I live will be with them. I will be their God, and they will be my people. "},{"num":28,"verse":"When my Temple is among them forever, the nations will know that I, the Lord, make Israel holy.’”"}]