[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-11 No outward form or reformation can be acceptable to God, so long as any idol possesses the heart; yet how many prefer their own devices and their own righteousness, to the way of salvation! Men's corruptions are idols in their hearts, and are of their own setting up; God will let them take their course. Sin renders the sinner odious in the eyes of the pure and holy God; and in his own eyes also, whenever conscience is awakened. Let us seek to be cleansed from the guilt and pollution of sins, in that fountain which the Lord has opened.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I the Lord hare deceived that prophet - A deep truth lies beneath these words, namely, that evil as well as good is under God's direction. He turns it as He will, employing it to test the sincerity of men, and thus making it ultimately contribute to the purification of His people, to the confirmation of the righteous, to the increase of their glory and felicity. The case of the false prophets who deceived Ahab ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a striking representation of this principle. The Lord sends forth an evil spirit to persuade Ahab to his ruin. Toward the close of the kingdom of Judah false prophets were especially rife. The thoughts of men's hearts were revealed, the good separated from the bad, and the remnant of the people purged from the sins by which of late years the whole nation had been defiled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. As they dealt deceitfully with God by seeking answers of peace without repentance, so God would let them be dealt with deceitfully by the prophets whom they consulted. God would chastise their sin with a corresponding sin; as they rejected the safe directions of the true light, He would send the pernicious delusions of a false one; prophets would be given them who should re-echo the deceitfulness that already wrought in their own bosom, to their ruin [Fairbairn]. The people had themselves alone to blame, for they were long ago forewarned how to discern and to treat a false prophet (De 13:3); the very existence of such deceivers among them was a sign of God's judicial displeasure (compare in Saul's case, 1Sa 16:14; 28:6, 7). They and the prophet, being dupes of a common delusion, should be involved in a common ruin.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " There is so great parity in the folly and impiety of both seducing prophets and the seduced people, that it is hard to say whose sin is greatest. Their punishment shall be by the Lord made as like as they made their sin, and both shall be cut off and destroyed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall bear the punishment of their iniquity,.... Both the false prophet, and those that sought unto him, and were deceived by him; and which being laid according to the strictness of divine justice, is intolerable: sad is the case when a man is obliged to bear his own sins, and the punishment of them, and has no surety to undertake for him, and be a mediator between God and him, and make atonement for him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the punishment of the prophet shall be even as the punishment of him that seekest unto him; they being both alike culpable, each pursuing the desires of their own evil hearts; the one seeking for smooth things to be spoken to him; the other speaking them, in order to gratify him, and for the sake of gain; the one being a false prophet, and the other seeking to and inquiring of him, though he was such, slighting and rejecting the true prophets of the Lord; both being deceived, and both blind, and so should fall into the same ditch, being under the same judicial blindness and hardness of heart. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"according to the sin of him that comes to learn and learns not; according to the sin of the false prophet shall it be.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"according to the sin of him that comes to learn and learns not; according to the sin of the false prophet shall it be.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall bear the punishment of their iniquity: the punishment of the prophet shall be even as the punishment of him that seeketh unto him;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Both the people and prophet shall perish together; the punishment of the one shall be as that of the other. Already ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 14:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The passage rests on such general assumptions as these: 1. That the principles of the constitution of Israel are known, and the fundamental one is, thou shalt have no other gods before Me. Probably Ezekiel interpreted this first principle as Hosea did, including among “other gods” not only gods different from Jehovah, but images or representations of Jehovah himself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Men’s first duty was to be true to this principle; cf. the summary proceeding advocated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To those who sin against this fundamental article of religion all other religious offices and ordinances, so far from being beneficial, are made by God a means of destruction. The preaching of the true prophets only hardens (Isaiah 6); or prophecy may be turned into false prophecy. The man who wittingly commits sin had better keep clear of religious ordinances and performances. And the “prophet” (even the modern one) had better keep clear of wicked men, lest he should be used as the instrument of their punishment and perish with them. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "No prophet is to give any other answer. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But if a prophet allow himself to be persuaded, and give a word, I have persuaded this prophet, and will stretch out my hand against him, and cut him off out of my people Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They shall bear their guilt: as the guilt of the inquirer, so shall the guilt of the prophet be; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In order that the house of Israel may no more stray from me, and may no more defile itself with all its transgressions; but they may be my people, and I their God is the saying of the Lord Jehovah. - The prophet who allows himself to be persuaded is not a prophet מלּבּו (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but one who really thinks that he has a word of God. פּתּה, to persuade, to entice by friendly words (in a good sense, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but generally sensu malo, to lead astray, or seduce to that which is unallowable or evil. \"If he allow himself to be persuaded:\" not necessarily \"with the hope of payment from the hypocrites who consult him\" (Michaelis). This weakens the thought. It might sometimes be done from unselfish good-nature. And \"the word\" itself need not have been a divine oracle of his own invention, or a false prophecy. The allusion is simply to a word of a different character from that contained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:6-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which either demands repentance or denounces judgment upon the impenitent: every word, therefore, which could by any possibility confirm the sinner in his security. - By אני יהוה (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the apodosis is introduced in an emphatic manner, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but פּתּיתי cannot be taken in a future sense (\"I will persuade\"). It must be a perfect; since the persuading of the prophet would necessarily precede his allowing himself to be persuaded. The Fathers and earlier Lutheran theologians are wrong in their interpretation of פּתּיתי, which they understand in a permissive sense, meaning simply that God allowed it, and did not prevent their being seduced. Still more wrong are Storr and Schmieder, the former of whom regards it as simply declaratory, \"I will declare him to have gone astray from the worship of Jehovah;\" the latter, \"I will show him to be a fool, by punishing him for his disobedience.\" The words are rather to be understood in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., where the persuading (pittâh) is done by a lying spirit, which inspires the prophets of Ahab to predict success to the king, in order that he may fall. As Jehovah sent the spirit in that case, and put it into the mouth of the prophets, so is the persuasion in this instance also effected by God: not merely divine permission, but divine ordination and arrangement; though this does not destroy human freedom, but, like all \"persuading,\" presupposes the possibility of not allowing himself to be persuaded. See the discussion of this question in the commentary on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The remark of Calvin on the verse before us is correct: \"it teaches that neither impostures nor frauds take place apart from the will of God\" (nisi Deo volente). But this willing on the part of God, or the persuading of the prophets to the utterance of self-willed words, which have not been inspired by God, only takes place in persons who admit evil into themselves, and is designed to tempt them and lead them to decide whether they will endeavour to resist and conquer the sinful inclinations of their hearts, or will allow them to shape themselves into outward deeds, in which case they will become ripe for judgment. It is in this sense that God persuades such a prophet, in order that He may then cut him off out of His people. But this punishment will not fall upon the prophet only. It will reach the seeker or inquirer also, in order if possible to bring Israel back from its wandering astray, and make it into a people of God purified from sin (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was to this end that, in the last times of the kingdom of Judah, God allowed false prophecy to prevail so mightily, - namely, that it might accelerate the process of distinguishing between the righteous and the wicked; and then, by means of the judgment which destroyed the wicked, purify His nation and lead it on to the great end of its calling. ",
        "children": []
      }
    ]
  }
]