[{"num":53,"verse":"Who really believed what we heard? Who saw in it the Lord’s great power?"},{"num":2,"verse":"He was always close to the Lord. He grew up like a young plant, like a root growing in dry ground. There was nothing special or impressive about the way he looked, nothing we could see that would cause us to like him."},{"num":3,"verse":"People made fun of him, and even his friends left him. He was a man who suffered a lot of pain and sickness. We treated him like someone of no importance, like someone people will not even look at but turn away from in disgust."},{"num":4,"verse":"The fact is, it was our suffering he took on himself; he bore our pain. But we thought that God was punishing him, that God was beating him for something he did."},{"num":5,"verse":"But he was being punished for what we did. He was crushed because of our guilt. He took the punishment we deserved, and this brought us peace. We were healed because of his pain."},{"num":6,"verse":"We had all wandered away like sheep. We had gone our own way. And yet the Lord put all our guilt on him."},{"num":7,"verse":"He was treated badly, but he never protested. He said nothing, like a lamb being led away to be killed. He was like a sheep that makes no sound as its wool is being cut off. He never opened his mouth to defend himself."},{"num":8,"verse":"He was taken away by force and judged unfairly. The people of his time did not even notice that he was killed. But he was put to death for the sins of his people."},{"num":9,"verse":"He had done no wrong to anyone. He had never even told a lie. But he was buried among the wicked. His tomb was with the rich."},{"num":10,"verse":"But the Lord was pleased with this humble servant who suffered such pain. Even after giving himself as an offering for sin, he will see his descendants and enjoy a long life. He will succeed in doing what the Lord wanted."},{"num":11,"verse":"After his suffering he will see the light, and he will be satisfied with what he experienced."},{"num":12,"verse":"For this reason, I will treat him as one of my great people. I will give him the rewards of one who wins in battle, and he will share them with his powerful ones. I will do this because he gave his life for the people. He was considered a criminal, but the truth is, he carried away the sins of many. Now he will stand before me and speak for those who have sinned.”"}]