[{"header":"Sin Keeps One from God"},{"num":59,"verse":"See, the Lord’s hand is not so short that it cannot save, and His ear is not closed that it cannot hear. "},{"num":2,"verse":"But your wrong-doings have kept you away from your God. Your sins have hidden His face from you, so that He does not hear. "},{"num":3,"verse":"For your hands are sinful with blood, your fingers with wrong-doing, your lips have lied, and your tongue talks about sin. "},{"num":4,"verse":"No one wants what is right and fair in court. And no one argues his cause with the truth. They trust in what is false, and speak lies. They plan to make trouble and do what is sinful. "},{"num":5,"verse":"They bring young ones from the eggs of deadly snakes and make traps as a spider does. He who eats of their eggs dies, and a snake comes out of the egg that is crushed. "},{"num":6,"verse":"Clothing cannot be made from the work of the spider, so they cannot cover themselves with what they make. Their works are works of sin. They hurt others with their hands. "},{"num":7,"verse":"And they are quick to sin and to kill people who are not guilty. Their thoughts are thoughts of sin. Wherever they go, they destroy and cause suffering. "},{"num":8,"verse":"They know nothing about peace, and there is nothing fair in their paths. Their roads are not straight. Whoever walks on them does not know peace."},{"num":9,"verse":"So what is right and fair is far from us. What is right and good does not come to us. We hope for light, but see darkness. We hope for bright light, but we walk in the dark. "},{"num":10,"verse":"We feel for the wall like blind men. We feel our way like those who have no eyes. We trip at noon as in the night. Among those who are strong, we are like dead men. "},{"num":11,"verse":"All of us make noise like bears, and cry inside ourselves like doves. We hope for what is right and fair, but it is not there. We hope to be saved, but it is far from us. "},{"num":12,"verse":"For we have done much wrong before You, and our sins speak against us. Our wrong-doing is with us, and we know our sins. "},{"num":13,"verse":"We have gone against the Lord and have acted as if we do not know Him. We have turned away from our God. We have made it hard for others. We have thought and spoken lying words from the heart. "},{"num":14,"verse":"What is right and fair is turned back. What is right and good stands far away. Truth has fallen in the street, and what is right cannot come in. "},{"num":15,"verse":"Yes, truth is not there. And he who turns away from sin comes under the anger of sinners."},{"num":16,"verse":"He saw and wondered that there was no man to speak up for what is right. Then His own arm brought saving power, and what is right with Him gave Him strength. "},{"num":17,"verse":"Being right and good was His covering for His breast, saving power was His headcovering, clothing of anger was his covering, and His strong desires were like a coat. "},{"num":18,"verse":"He will pay them back for their works. He will send anger upon those who are against Him, and will punish those who hate Him. He will send punishment on the islands. "},{"num":19,"verse":"They will fear the name of the Lord from the west, and His shining-greatness from the rising of the sun. When the one who hates us comes in like a flood, the Spirit of the Lord will lift up a wall against him. "},{"num":20,"verse":"“The One Who saves from the punishment of sin will come to Zion, and He will come to those of Jacob who turn from their sinful ways,” says the Lord. "},{"num":21,"verse":"“And as for Me, this is My agreement with them,” says the Lord. “My Spirit which is upon you, and My Words which I have put in your mouth, will not leave your mouth, or the mouth of your children, or the mouth of your children’s children,” say the Lord, “from now and forever.”"}]