[{"num":12,"verse":"Forsooth Rehoboam came into Shechem; for all Israel was gathered thither to make him king."},{"num":2,"verse":"And soothly Jeroboam, the son of Nebat, when he was yet in Egypt, and fled from the face of king Solomon, turned again from Egypt, for the death of Solomon was heard; (And Jeroboam, the son of Nebat, when he was still in Egypt, where he had fled from King Solomon, heard of Solomon’s death, and returned from Egypt;)"},{"num":3,"verse":"and they sent, and called him. Therefore Jeroboam came, and all the multitude of Israel, and they spake to Rehoboam, and said,"},{"num":4,"verse":"Thy father putted the most hard yoke upon us, therefore abate thou a little now of the hardest commandment of thy father, and of the full grievous yoke that he hath put upon us, and we shall serve to thee. (Thy father put the hardest yoke upon us, but now, if thou abate a little thy father’s hardest commands, and the most grievous yoke that he hath put upon us, then we shall serve thee.)"},{"num":5,"verse":"And Rehoboam said to them, Go ye till to the third day, and turn ye again to me (Go ye away until the third day, and then return ye here). And when the people had gone,"},{"num":6,"verse":"king Rehoboam took counsel with the elder men, that stood before Solomon, his father, while he lived yet (while yet he lived); and Rehoboam said, What counsel give ye to me, that I answer to the people?"},{"num":7,"verse":"Which said to him, If thou obeyest today to this people, and servest this people, and givest stead to their asking, and speakest to them light, or easy, words, they shall be servants to thee in all days (they shall be thy servants forevermore)."},{"num":8,"verse":"And Rehoboam forsook the counsel of [the] eld men, which they gave to him, and took (counsel with the) young men, that were nourished with him, and stood nigh [to] him; (But Rehoboam forsook the elders’ counsel, which they gave him, and sought counsel with the young men, who grew up with him, and stood close to him;)"},{"num":9,"verse":"and he said to them, What counsel give ye to me, that I answer to this people, that said to me, Make thou easier the yoke that thy father hath put upon us?"},{"num":10,"verse":"And the young men, that were nourished with him (who grew up with him), said to him, Thus speak thou to this people, that spake to thee, and said, Thy father made grievous our yoke, relieve thou us; thus thou shalt speak to them, My least finger is greater than the back of my father;"},{"num":11,"verse":"and now (though) my father putted on you a grievous yoke, forsooth I shall add on(to) your yoke (but I shall add to your yoke); my father beat you with scourges, but I shall beat you with scorpions."},{"num":12,"verse":"Therefore Jeroboam, and all the people, came to Rehoboam, in the third day, as the king spake, saying, Turn ye again to me in the third day (Come ye back to me in three days)."},{"num":13,"verse":"And the king answered hard things to the people, while the counsel of [the] elder men was forsaken, that they had given to him;"},{"num":14,"verse":"and he spake to them by the counsel of [the] young men, and said, My father made grievous your yoke, forsooth I shall add to your yoke; my father beat you with scourges, but I shall beat you with scorpions."},{"num":15,"verse":"And the king assented not to the people, for the Lord had turned him away, that the Lord should raise up his word, that he had spoken in the hand of the prophet Ahijah of Shiloh to Jeroboam, the son of Nebat. (And the king assented not to the people, for the Lord had turned him away from them, so that the Lord could raise up his word, which he had spoken by the prophet Ahijah of Shiloh to Jeroboam, the son of Nebat.)"},{"num":16,"verse":"Then the people saw, that the king would not hear them, and the people answered to the king, and said, What part is to us in David, either what heritage in the son of Jesse? Israel, turn thou again into thy tabernacles; now, David, see thou (to) thine house. And Israel went into his tabernacles. (Then the people saw that the king would not listen to them, and the people answered to the king, and said, What part is for us with David, or what inheritance with the son of Jesse? Israel, return thou to thy homes; and David, see thou to thy own house. And the people of Israel went back to their homes.)"},{"num":17,"verse":"Forsooth Rehoboam reigned on the sons of Israel, which dwelled in the cities of Judah. (And so Rehoboam reigned only upon those Israelites, who lived in the cities of Judah.)"},{"num":18,"verse":"Therefore king Rehoboam sent Adoram, that was on the tributes; and all the people of Israel stoned him, and he was dead (And so King Rehoboam sent out Adoram, who was over the taxes, or the levies; and all the people of Israel stoned him, and he died). Forsooth king Rehoboam went up hastily upon his chariot, and fled into Jerusalem;"},{"num":19,"verse":"and Israel departed from the house of David, till into this present day. (and so Israel, that is, the Northern Kingdom, hast been in rebellion against the house of David, unto this present day.)"},{"num":20,"verse":"Forsooth it was done, when all Israel had heard that Jeroboam [was] turned again, they sent, and called him, when the company was gathered together, and they made him king upon all Israel; and no man followed the house of David, except the lineage alone of Judah. (And so it was done, when all Israel had heard that Jeroboam had returned, they sent for him, and when the people were gathered together, they made him king upon all Israel; and no man followed the house of David, except the tribe of Judah.)"},{"num":21,"verse":"And Rehoboam came to Jerusalem, and gathered together all the house of Judah, and the lineage of Benjamin, an hundred and fourscore thousand of chosen men and warriors, that they should fight against the house of Israel, and should bring again the realm to Rehoboam, the son of Solomon (to fight against the house of Israel, and bring back the kingdom to Rehoboam, the son of Solomon)."},{"num":22,"verse":"Forsooth the word of God was made to Shemaiah, the man of God, and said,"},{"num":23,"verse":"Speak thou to Rehoboam, the son of Solomon, king of Judah, and to all the house of Judah and of Benjamin, and to the residue of the people, and say thou,"},{"num":24,"verse":"The Lord saith these things, Ye shall not go up, neither ye shall fight against your brethren, the sons of Israel; turn each man again into his house, for this word is done of me (every man return to his house, for this word is from me). (And) They heard the word of the Lord, and they turned again from the journey, as the Lord commanded to them."},{"num":25,"verse":"And Jeroboam builded Shechem, in the hill of Ephraim, and dwelled there (Then Jeroboam built Shechem, in the hill country of Ephraim, and lived there); and he went out from thence, and builded Penuel."},{"num":26,"verse":"And Jeroboam said in his heart, Now the realm shall turn again to the house of David, (And Jeroboam said in his heart, Even now the kingdom shall return to the house of David,)"},{"num":27,"verse":"if this people ascendeth to Jerusalem, that it make sacrifice in the house of the Lord in Jerusalem; and then the heart of this people shall turn again to their lord, Rehoboam, king of Judah; and they shall slay me, and shall turn again to him. (if these people goeth up to Jerusalem, to make sacrifice in the House of the Lord in Jerusalem; for then the heart of these people shall return to their lord, Rehoboam, the king of Judah; and they shall kill me, and they shall return to him.)"},{"num":28,"verse":"And by counsel thought out, Jeroboam made twain golden calves, and he said to the people, Do not ye ascend more into Jerusalem; Israel, lo! thy gods, that led thee out of the land of Egypt. (And so, by counsel carefully thought out, Jeroboam made two gold calves, and he said to the people, Do not ye go up to Jerusalem any more; Israel, lo! thy gods, that led thee out of the land of Egypt.)"},{"num":29,"verse":"And he set one calf in Bethel, and the tother in Dan."},{"num":30,"verse":"And this word was made to Israel into sin; for the people went into Dan, to worship the calf. (And this thing became a sin in Israel; and some people went all the way up to Dan to worship the calf there.)"},{"num":31,"verse":"And Jeroboam made temples in high places (And Jeroboam made temples at the hill shrines), and he made priests (out) of the last men of the people, the which were not of the sons of Levi."},{"num":32,"verse":"And the king ordained a solemn day in the eighth month, in the fifteen day of the month, by [the] likeness of the solemnity that was hallowed in Judah. And the king went up, and made in like manner an altar in Bethel, that he should offer to the calves, which he had made; and he ordained in Bethel priests of the high places, which he had made. (And the king ordained a feast in the eighth month, on the fifteen day of the month, like the feast that was kept in Judah. And the king went up to Bethel, and offered on the altar that he had made to the calves, which he had made; and he ordered the priests of the hill shrines, to serve at the altar in Bethel, which he had made.)"},{"num":33,"verse":"And he went up upon the altar, which he had builded in Bethel, in the fifteenth day of the eighth month, which he had feigned of his heart; and he made a solemnity to the sons of Israel, and he went upon the altar, that he should burn incense. (And so he went up to the altar, which he had built in Bethel, on the fifteenth day of the eighth month, which month he had chosen out of his own heart; and he made a feast for the sons of Israel, and he went up to the altar, so that he could burn incense on it.)"}]