[{"header":"Paul Appeals to the Emperor"},{"num":25,"verse":"Three days after Festus arrived in the province, he went from Caesarea to Jerusalem, "},{"num":2,"verse":"where the chief priests and the Jewish leaders brought their charges against Paul. They begged Festus "},{"num":3,"verse":"to do them the favor of having Paul come to Jerusalem, for they had made a plot to kill him on the way. "},{"num":4,"verse":"Festus answered, “Paul is being kept a prisoner in Caesarea, and I myself will be going back there soon. "},{"num":5,"verse":"Let your leaders go to Caesarea with me and accuse the man if he has done anything wrong.”"},{"num":6,"verse":"Festus spent another eight or ten days with them and then went to Caesarea. On the next day he sat down in the judgment court and ordered Paul to be brought in. "},{"num":7,"verse":"When Paul arrived, the Jews who had come from Jerusalem stood around him and started making many serious charges against him, which they were not able to prove. "},{"num":8,"verse":"But Paul defended himself: “I have done nothing wrong against the Law of the Jews or against the Temple or against the Roman Emperor.”"},{"num":9,"verse":"But Festus wanted to gain favor with the Jews, so he asked Paul, “Would you be willing to go to Jerusalem and be tried on these charges before me there?”"},{"num":10,"verse":"Paul said, “I am standing before the Emperor's own judgment court, where I should be tried. I have done no wrong to the Jews, as you yourself well know. "},{"num":11,"verse":"If I have broken the law and done something for which I deserve the death penalty, I do not ask to escape it. But if there is no truth in the charges they bring against me, no one can hand me over to them. I appeal to the Emperor.”"},{"num":12,"verse":"Then Festus, after conferring with his advisers, answered, “You have appealed to the Emperor, so to the Emperor you will go.”"},{"header":"Paul before Agrippa and Bernice"},{"num":13,"verse":"Some time later King Agrippa and Bernice came to Caesarea to pay a visit of welcome to Festus. "},{"num":14,"verse":"After they had been there several days, Festus explained Paul's situation to the king: “There is a man here who was left a prisoner by Felix; "},{"num":15,"verse":"and when I went to Jerusalem, the Jewish chief priests and elders brought charges against him and asked me to condemn him. "},{"num":16,"verse":"But I told them that we Romans are not in the habit of handing over any who are accused of a crime before they have met their accusers face-to-face and have had the chance of defending themselves against the accusation. "},{"num":17,"verse":"When they came here, then, I lost no time, but on the very next day I sat in the judgment court and ordered the man to be brought in. "},{"num":18,"verse":"His opponents stood up, but they did not accuse him of any of the evil crimes that I thought they would. "},{"num":19,"verse":"All they had were some arguments with him about their own religion and about a man named Jesus, who has died; but Paul claims that he is alive. "},{"num":20,"verse":"I was undecided about how I could get information on these matters, so I asked Paul if he would be willing to go to Jerusalem and be tried there on these charges. "},{"num":21,"verse":"But Paul appealed; he asked to be kept under guard and to let the Emperor decide his case. So I gave orders for him to be kept under guard until I could send him to the Emperor.”"},{"num":22,"verse":"Agrippa said to Festus, “I would like to hear this man myself.”"},{"num":23,"verse":"The next day Agrippa and Bernice came with great pomp and ceremony and entered the audience hall with the military chiefs and the leading men of the city. Festus gave the order, and Paul was brought in. "},{"num":24,"verse":"Festus said, “King Agrippa and all who are here with us: You see this man against whom all the Jewish people, both here and in Jerusalem, have brought complaints to me. They scream that he should not live any longer. "},{"num":25,"verse":"But I could not find that he had done anything for which he deserved the death sentence. And since he himself made an appeal to the Emperor, I have decided to send him. "},{"num":26,"verse":"But I have nothing definite about him to write to the Emperor. So I have brought him here before you—and especially before you, King Agrippa!—so that, after investigating his case, I may have something to write. "},{"num":27,"verse":"For it seems unreasonable to me to send a prisoner without clearly indicating the charges against him.”"}]