[{"header":"An Appeal to Caesar"},{"num":1,"verse":"Three days after Festus arrived in Caesarea to take up his duties as governor, he went up to Jerusalem. The high priests and top leaders renewed their vendetta against Paul. They asked Festus if he wouldn’t please do them a favor by sending Paul to Jerusalem to respond to their charges. A lie, of course—they had revived their old plot to set an ambush and kill him along the way."},{"num":4,"verse":"Festus answered that Caesarea was the proper jurisdiction for Paul, and that he himself was going back there in a few days. “You’re perfectly welcome,” he said, “to go back with me then and accuse him of whatever you think he’s done wrong.”"},{"num":6,"verse":"About eight or ten days later, Festus returned to Caesarea. The next morning he took his place in the courtroom and had Paul brought in. The minute he walked in, the Jews who had come down from Jerusalem were all over him, hurling the most extreme accusations, none of which they could prove."},{"num":8,"verse":"Then Paul took the stand and said simply, “I’ve done nothing wrong against the Jewish religion, or the Temple, or Caesar. Period.”"},{"num":9,"verse":"Festus, though, wanted to get on the good side of the Jews and so said, “How would you like to go up to Jerusalem, and let me conduct your trial there?”"},{"num":10,"verse":"Paul answered, “I’m standing at this moment before Caesar’s bar of justice, where I have a perfect right to stand. And I’m going to keep standing here. I’ve done nothing wrong to the Jews, and you know it as well as I do. If I’ve committed a crime and deserve death, name the day. I can face it. But if there’s nothing to their accusations—and you know there isn’t—nobody can force me to go along with their nonsense. We’ve fooled around here long enough. I appeal to Caesar.”"},{"num":12,"verse":"Festus huddled with his advisors briefly and then gave his verdict: “You’ve appealed to Caesar; you’ll go to Caesar!”"},{"num":13,"verse":"A few days later King Agrippa and his wife, Bernice, visited Caesarea to welcome Festus to his new post. After several days, Festus brought up Paul’s case to the king. “I have a man on my hands here, a prisoner left by Felix. When I was in Jerusalem, the high priests and Jewish leaders brought a bunch of accusations against him and wanted me to sentence him to death. I told them that wasn’t the way we Romans did things. Just because a man is accused, we don’t throw him out to the dogs. We make sure the accused has a chance to face his accusers and defend himself of the charges. So when they came down here I got right on the case. I took my place in the courtroom and put the man on the stand."},{"num":18,"verse":"“The accusers came at him from all sides, but their accusations turned out to be nothing more than arguments about their religion and a dead man named Jesus, who the prisoner claimed was alive. Since I’m a newcomer here and don’t understand everything involved in cases like this, I asked if he’d be willing to go to Jerusalem and be tried there. Paul refused and demanded a hearing before His Majesty in our highest court. So I ordered him returned to custody until I could send him to Caesar in Rome.”"},{"num":22,"verse":"Agrippa said, “I’d like to see this man and hear his story.”"},{"num":23,"verse":"The next day everybody who was anybody in Caesarea found his way to the Great Hall, along with the top military brass. Agrippa and Bernice made a flourishing grand entrance and took their places. Festus then ordered Paul brought in."},{"num":24,"verse":"Festus said, “King Agrippa and distinguished guests, take a good look at this man. A bunch of Jews petitioned me first in Jerusalem, and later here, to do away with him. They have been most vehement in demanding his execution. I looked into it and decided that he had committed no crime. He requested a trial before Caesar and I agreed to send him to Rome. But what am I going to write to my master, Caesar? All the charges made by the Jews were fabrications, and I’ve uncovered nothing else."},{"num":26,"verse":"“That’s why I’ve brought him before this company, and especially you, King Agrippa: so we can come up with something in the nature of a charge that will hold water. For it seems to me silly to send a prisoner all that way for a trial and not be able to document what he did wrong.”"}]