[[],[{"type":"header","content":"Paul before Festus"},{"type":"prose","content":"Festus, then, after arriving in the province, went up to Jerusalem from Caesarea three days later."}],[{"type":"prose","content":"And the chief priests and the leading men of the Jews brought charges against Paul, and they were pleading with Festus,"}],[{"type":"prose","content":"requesting a concession against Paul, that he might have him brought to Jerusalem (, setting an ambush to kill him on the way)."}],[{"type":"prose","content":"Festus then answered that Paul was being kept in custody in Caesarea, and that he himself was about to leave shortly."}],[{"type":"prose","content":"“Therefore,” he *said, “have the influential men among you go there with me, and if there is anything wrong about the man, have them bring charges against him.”"}],[{"type":"prose","content":"After  had spent no more than eight or ten days among them, he went down to Caesarea, and on the next day he took his seat on the tribunal and ordered that Paul be brought."}],[{"type":"prose","content":"After Paul arrived, the Jews who had come down from Jerusalem stood around him, bringing many, and serious, charges against him which they could not prove,"}],[{"type":"prose","content":"while Paul said in his own defense, “I have not done anything wrong either against the Law of the Jews, or against the temple, or against Caesar.”"}],[{"type":"prose","content":"But Festus, wanting to do the Jews a favor, replied to Paul and said, “Are you willing to go up to Jerusalem and stand trial before me on these ?”"}],[{"type":"prose","content":"But Paul said, “I am standing before Caesar’s tribunal, where I ought to be tried. I have done nothing wrong to  Jews, as you also very well know."}],[{"type":"prose","content":"If, therefore, I am in the wrong and have committed something deserving death, I am not trying to avoid execution; but if there is nothing to the accusations which these men are bringing against me, no one can hand me over to them. I appeal to Caesar.”"}],[{"type":"prose","content":"Then when Festus had conferred with his council, he answered, “You have appealed to Caesar; to Caesar you shall go.”"}],[{"type":"prose","content":"Now when several days had passed, King Agrippa and Bernice arrived in Caesarea, paying their respects to Festus."}],[{"type":"prose","content":"And while they were spending many days there, Festus presented Paul’s case to the king, saying, “There is a man who was left as a prisoner by Felix;"}],[{"type":"prose","content":"and when I was in Jerusalem, the chief priests and the elders of the Jews brought charges against him, asking for a sentence of condemnation against him."}],[{"type":"prose","content":"I replied to them that it is not the custom of the Romans to hand over any person before the accused meets his accusers face to face, and has an opportunity to make his defense against the charges."}],[{"type":"prose","content":"So after they had assembled here, I did not delay, but on the next day took my seat on the tribunal and ordered that the man be brought."}],[{"type":"prose","content":"When the accusers stood up, they did not  bringing any charges against him of crimes that I suspected,"}],[{"type":"prose","content":"but they  had some points of disagreement with him about their own religion and about a dead man, Jesus, whom Paul asserted to be alive."}],[{"type":"prose","content":"And being at a loss how to investigate such matters, I asked whether he was willing to go to Jerusalem and stand trial there on these matters."}],[{"type":"prose","content":"But when Paul appealed to be held in custody for the Emperor’s decision, I ordered that he be kept in custody until I send him to Caesar.”"}],[{"type":"prose","content":"Then Agrippa  to Festus, “I also would like to hear the man myself.” “Tomorrow,” he *said, “you shall hear him.”"}],[{"type":"header","content":"Paul before Agrippa"},{"type":"prose","content":"So, on the next day when Agrippa and Bernice came amid great pomp and entered the auditorium, accompanied by the commanders and the prominent men of the city, at the command of Festus, Paul was brought ."}],[{"type":"prose","content":"And Festus *said, “King Agrippa, and all you gentlemen present with us, you see this man about whom all the people of the Jews appealed to me, both in Jerusalem and here, shouting that he ought not to live any longer."}],[{"type":"prose","content":"But I found that he had committed nothing deserving death; and since he himself appealed to the Emperor, I decided to send him."}],[{"type":"prose","content":"Yet, I have nothing definite about him to write to my lord. Therefore, I have brought him before you  and especially before you, King Agrippa, so that after the investigation has taken place, I may have something to write."}],[{"type":"prose","content":"For it seems absurd to me in sending a prisoner, not to indicate the charges against him as well.”"}]]