[{"header":"Felix’s successor begins his duties with vigour—"},{"num":1,"verse":"Three days after Festus had taken over his province he went up from Caesarea to Jerusalem. The chief priests and elders of the Jews informed him of the case against Paul and begged him as a special favour to have Paul sent to Jerusalem. They themselves had already made a plot to kill him on the way. But Festus replied that Paul was in custody in Caesarea, and that he himself was going there shortly."},{"num":5,"verse":"“What you must do,” he told them, “is to provide some competent men of your own to go down with me and if there is anything wrong with the man they can present their charges against him.”"},{"num":6,"verse":"Festus spent not more than eight or ten days among them at Jerusalem and then went down to Caesarea. On the day after his arrival he took his seat on the bench and ordered Paul to be brought in. As soon as he arrived the Jews from Jerusalem stood up on all sides of him, bringing forward many serious accusations which they were quite unable to substantiate. Paul, in his defence, maintained, “I have committed no offence in any way against the Jewish Law, or against the Temple or against Caesar.”"},{"header":"—but is afraid of antagonising the Jews"},{"num":9,"verse":"But Festus, wishing to gain the goodwill of the Jews, spoke direct to Paul, “Are you prepared to go up to Jerusalem and stand your trial over these matters in my presence there?”"},{"num":10,"verse":"But Paul replied, “I am standing in Caesar’s court and that is where I should be judged. I have done the Jews no harm, as you very well know. It comes to this: if I were a criminal and had committed some crime which deserved the death penalty, I should not try to evade sentence of death. But as in fact there is no truth in the accusations these men have made, I am not prepared to be used as a means of gaining their favour—I appeal to Caesar!”."},{"num":12,"verse":"Then Festus, after a conference with his advisers, replied to Paul, “You have appealed to Caesar—then to Caesar you shall go!”"},{"header":"Festus outlines Paul’s case to Agrippa"},{"num":13,"verse":"Some days later King Agrippa and Bernice arrived at Caesarea on a state visit to Festus. They prolonged their stay for some days and this gave Festus an opportunity of laying Paul’s case before the king."},{"num":15,"verse":"“I have a man,” he said, “who was left a prisoner by Felix. When I was in Jerusalem the chief priests and Jewish elders made allegations against him and demanded his conviction! I told them that the Romans were not in the habit of giving anybody up to please anyone, until the accused had had the chance of facing his accusers personally and been given the opportunity of defending himself on the charges made against him. Since these Jews came back here with me, I wasted no time but on the very next day I took my seat on the bench and ordered the man to be brought in. But when his accusers got up to speak they did not charge him with any such crimes as I had anticipated. Their differences with him were about their own religion and concerning a certain Jesus who had died, but whom Paul claimed to be still alive. I did not feel qualified to investigate such matters and so I asked the man if he were willing to go to Jerusalem and stand his trial over these matters there. But when he appealed to have his case reserved for the decision of the emperor himself, I ordered him to be kept in custody until such time as I could send him to Caesar.”"},{"num":22,"verse":"Then Agrippa said to Festus, “I have been wanting to hear this man myself” “Then you shall hear him tomorrow,” replied Festus."},{"header":"Festus formally explains Paul’s case to Agrippa"},{"num":23,"verse":"When the next day came, Agrippa and Bernice proceeded to the audience chamber with great pomp and ceremony, with an escort of military officers and prominent townsmen. Festus ordered Paul to be brought in and then he spoke: “King Agrippa and all who are present, you see here the man about whom the whole Jewish people both at Jerusalem and in this city have petitioned me. They din it into my ears that he ought not to live any longer, but I for my part discovered nothing that he has done which deserves the death penalty. And since he has appealed to Caesar, I have decided to send him to Rome. Frankly, I have nothing specific to write to the emperor about him, and I have therefore brought him forward before you all, and especially before you, King Agrippa, so that from your examination of him there may emerge some charge which I may put in writing. For it seems ridiculous to me to send a prisoner before the emperor without indicating the charges against him.”"}]