[{"num":25,"verse":"Three days after Festus had come into the province, he went up from Caesarea to Jerusalem."},{"num":2,"verse":"Then the High Priest and the chief of the Jews appeared before him against Paul. And they pleaded with him,"},{"num":3,"verse":"and asked (as a favor) if he would summon him to Jerusalem, so they could make an ambush and kill him along the way."},{"num":4,"verse":"But Festus answered that Paul should be kept at Caesarea. And that he himself would go there shortly."},{"num":5,"verse":"“Therefore, let those among you who are able come down,” he said, “And if there is any fault in the man, let them accuse him.\""},{"num":6,"verse":"Now, after he had stayed among them no more than ten days, he went down to Caesarea, and the next day sat in the judgment seat, and commanded Paul to be brought."},{"num":7,"verse":"And when he had come, the Jews who had come from Jerusalem, stood around him and laid many and grievous complaints against Paul (of which they could present no plain proof),"},{"num":8,"verse":"to which he answered that he had not offended in anything - either against the Law of the Jews, or against the Temple, or against Caesar."},{"num":9,"verse":"Yet Festus, wanting to curry favor with the Jews, answered Paul and said, “Will you go up to Jerusalem and be judged of these things before me there?”"},{"num":10,"verse":"Then Paul said, “I stand at Caesar’s judgment seat, where I ought to be judged. I have done no wrong to the Jews, as you very well know."},{"num":11,"verse":"“For if I have done wrong, or committed anything worthy of death, I do not refuse to die. But if there is nothing in these things of which they accuse me, no one can deliver me to them. I appeal to Caesar.”"},{"num":12,"verse":"Then, when Festus had spoken with the Council, he answered, “You have appealed to Caesar? To Caesar you shall go.”"},{"num":13,"verse":"And after some days, King Agrippa and Bernice came down to Caesarea to greet Festus."},{"num":14,"verse":"And when they had stayed there many days, Festus stated Paul’s cause to the king, saying, “There is a certain man left in prison by Felix."},{"num":15,"verse":"“When I was in Jerusalem, the chief priests and elders of the Jews informed me of him and asked for a judgment against him."},{"num":16,"verse":"“To whom I answered that it is not the custom of the Romans to deliver any man to the death before the accused has faced his accusers and has a place to defend himself concerning the crime."},{"num":17,"verse":"“Therefore, when they had come here, I sat on the judgment seat the following day (without delay) and commanded the man to be brought forth."},{"num":18,"verse":"“When the accusers stood up, they brought no accusation against him of such crimes as I suspected:"},{"num":19,"verse":"“But they had certain questions against him about their own religion, and about a certain Jesus (Who was dead, but Whom Paul affirmed to be alive)."},{"num":20,"verse":"“And because I was perplexed by such questions, I asked him if he was willing to go to Jerusalem and be judged there about these things."},{"num":21,"verse":"“But because Paul had appealed to be put under guard until the examination of Augustus, I commanded that he be jailed until I could send him to Caesar.”"},{"num":22,"verse":"Then Agrippa said to Festus, “I would also like to hear the man myself.” “Tomorrow,” he said, “you shall hear him.”"},{"num":23,"verse":"And the next day, when Agrippa and Bernice had come (with great pomp) and had entered into the Common Hall with the chief captains and chief men of the city, Paul was brought forth at Festus’ commandment."},{"num":24,"verse":"And Festus said, “King Agrippa, and all men who are present with us, you see this man about whom all the multitude of the Jews have petitioned me (both at Jerusalem and here) crying that he ought not to live any longer."},{"num":25,"verse":"“But, I have found nothing he has done to be worthy of death. And seeing that he has appealed to Augustus, I have decided to send him."},{"num":26,"verse":"“I have no certain thing to write to my lord concerning him. Therefore, I have brought him forth to you, and especially to you, King Agrippa, so that after examination, I might have something to write."},{"num":27,"verse":"“For it seems unreasonable to me to send a prisoner and not signify the charges against him.”"}]