[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But the nations that bring their neck under the yoke . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The advice thus given to the five nations that were seeking an alliance with Judah before the actual invasion, is specifically addressed to Judah in the next verse, and is repeated more fully after the population of Judæa had been carried into captivity, in Jeremiah 29. The first warning had been despised, and the exiles were then reaping the fruit of their self-will, but the principle that obedience was better than resistance remained the same.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1-11 Jeremiah is to prepare a sign that all the neighbouring countries would be made subject to the king of Babylon. God asserts his right to dispose of kingdoms as he pleases. Whatever any have of the good things of this world, it is what God sees fit to give; we should therefore be content. The things of this world are not the best things, for the Lord often gives the largest share to bad men. Dominion is not founded in grace. Those who will not serve the God who made them, shall justly be made to serve their enemies that seek to ruin them. Jeremiah urges them to prevent their destruction, by submission. A meek spirit, by quiet submission to the hardest turns of providence, makes the best of what is bad. Many persons may escape destroying providences, by submitting to humbling providences. It is better to take up a light cross in our way, than to pull a heavier on our own heads. The poor in spirit, the meek and humble, enjoy comfort, and avoid many miseries to which the high-spirited are exposed. It must, in all cases, be our interest to obey God's will.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nations ... - Rather, the nation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. serve … till it—The same Hebrew root expresses \"serve\" and \"till,\" or \"cultivate.\" Serve ye the king of Babylon, and the land will serve you [Calvin].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Those that upon the first summons, or without making any hostile opposition, shall yield themselves servants to the king of Babylon, they shall remain still, and be left in the land to till the ground, and shall dwell therein. It is the time when God is resolved to put an end to the kingdom of Judah for a time, and to the other nations mentioned for ever: there is therefore no resisting of God’s counsels; those that most quietly yield will be in the best condition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But the nations that bring their neck under the yoke of the king of Babylon, and serve him,.... That at once, and readily, submit unto him, and pay him tribute: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "those will I let remain still in their own land, saith the Lord; undisturbed by any other enemy; peaceably dwelling in their own habitations; following their occupations and business of life; and enjoying their substance and estates, only paying the tax imposed on them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall till it, and dwell therein; manure and cultivate it, and gather and eat the fruit of it, and continue to do so, they and their posterity after them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall till it, and dwell therein; manure and cultivate it, and gather and eat the fruit of it, and continue to do so, they and their posterity after them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But the nations that bring their neck under the yoke of the king of Babylon, and serve him, those will I let remain still in their own land, saith the LORD; and they shall till it, and dwell therein.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The nations that bring their neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The Hebrew has, \"The nation that shall bring its neck,\" etc. Jeremiah 27:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The people, on the other hand, that bends under the yoke of the king of Babylon shall remain in its own land. For the great Asiatic conquerors contented themselves, in the first place, with thoroughly subjecting the vanquished nations and imposing a tribute; only in the case of stubborn resistance or of insurrection on the part of the conquered did they proceed to destroy the kingdoms and deport their populations. This Zedekiah and the ambassadors that had come to him might have learnt from Nebuchadnezzar's course of action after the capture of Jerusalem under Jehoiachin, as compared with that in Jehoiakim's time, had they not been utterly infatuated by the lying spirit of the false prophets, whose prophecies accommodated themselves to the wishes of the natural heart. ",
        "children": []
      }
    ]
  }
]