[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:19-22 Jeremiah assures them that the brazen vessels should go after the golden ones. All shall be carried to Babylon. But he concludes with a gracious promise, that the time would come when they should be brought back. Though the return of the prosperity of the church does not come in our time, we must not despair, for it will come in God's time.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Zedekiah was restless under the Babylonian yoke, and the false prophets found only too ready a hearing from him. He is addressed in the plural because his feelings were fully shared by the mass of the officers of state and by the people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. (Jer 52:17, 20, 21).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The prophet enlargeth his prophetical threatening, and makes it extend to all other vessels of price, in the houses of the king, the nobles, or more wealthy citizens. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yea, thus saith the Lord of hosts, the God of Israel,  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "concerning the vessels that remain in the house of the Lord,.... Which are mentioned in Jeremiah 27:19; together with others: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "concerning the vessels that remain in the house of the Lord,.... Which are mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; together with others: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the house of the king of Judah, and of Jerusalem; see Jeremiah 27:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and in the house of the king of Judah, and of Jerusalem; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Yea, thus saith the LORD of hosts, the God of Israel, concerning the vessels that remain in the house of the LORD, and in the house of the king of Judah and of Jerusalem;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The priests and all the people are warned to give no belief to the false prophesyings of a speedy restoration of the vessels carried off to Babylon. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus hath Jahveh said: Hearken not to the sayings of your prophets that prophesy unto you: Behold, the vessels of Jahveh's house shall now shortly be brought again from Babylon; for they prophesy a lie unto you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hearken not unto them; serve the king of Babylon and live; wherefore should this city become a desert? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But if they be prophets, and if the word of Jahveh be with them, let them now make intercession to Jahveh of hosts, that the vessels which are left in the house of Jahveh, and in the king's house, and in Jerusalem, go not to Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For thus saith Jahveh of hosts concerning the pillars and the [brazen] sea and the frames, and concerning the other vessels that are left in this city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Which Nebuchadnezzar king of Babylon took not away when he carried away captive Jechoniah the son of Jehoiakim king of Judah from Jerusalem to Babylon, with all the nobles of Judah and Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For thus saith Jahveh of hosts, the God of Israel, concerning the vessels that are left in the house of Jahveh, and in the house of the king of Judah, and in Jerusalem: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To Babylon shall they be brought, and there shall they remain until the day that I visit them, saith Jahveh, and carry them up, and bring them back to this place.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Here Jeremiah gives King Zedekiah warning that the prophecies of a speedy end to Chaldean bondage are lies, and that confidence in such lies will hurry on the ruin of the state. He at the same time disabuses the priests of the hope raised by the false prophets, that the vessels of the temple and of the palace that had been carried off at the time Jechoniah was taken to Babylon will very soon be restored; and assures them that such statements can only procure the destruction of the city, since their tendency is to seduce king and people to rebellion, and rebellion against the king of Babylon means the destruction of Jerusalem - a prophecy that was but too soon fulfilled. The vessels of the temple, Jeremiah 27:16, are the golden vessels Solomon caused to be made (1 Kings 7:48.), which Nebuchadnezzar had carried to Babylon, 2 Kings 24:13. מבּבלה, from towards Babylon, i.e., from Babylon, whither they had been taken; cf. Ew. 216, b. \"Now shortly,\" lit., hastily or speedily, i.e., ere long, cf. Jeremiah 28:3, where the prophet Hananiah foretells the restoration of them within two years, in opposition to Jeremiah's affirmation that the exile will last seventy years.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here Jeremiah gives King Zedekiah warning that the prophecies of a speedy end to Chaldean bondage are lies, and that confidence in such lies will hurry on the ruin of the state. He at the same time disabuses the priests of the hope raised by the false prophets, that the vessels of the temple and of the palace that had been carried off at the time Jechoniah was taken to Babylon will very soon be restored; and assures them that such statements can only procure the destruction of the city, since their tendency is to seduce king and people to rebellion, and rebellion against the king of Babylon means the destruction of Jerusalem - a prophecy that was but too soon fulfilled. The vessels of the temple, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are the golden vessels Solomon caused to be made (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), which Nebuchadnezzar had carried to Babylon, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 24:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". מבּבלה, from towards Babylon, i.e., from Babylon, whither they had been taken; cf. Ew. 216, b. \"Now shortly,\" lit., hastily or speedily, i.e., ere long, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 28:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the prophet Hananiah foretells the restoration of them within two years, in opposition to Jeremiah's affirmation that the exile will last seventy years.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: These words are not given in lxx, and so Mov. and Hitz. pronounce them spurious. Haev., on the other hand, and with greater justice, says (Introd. ii. 2), that the lxx omitted the words, because, according to an Alexandrian legend, the temple furniture was really very soon restored, even in Zedekiah's time, cf. Baruch 1:8ff.; so that the false prophets were in the right. The passage cited from Baruch does not indeed give a very rigorous proof of this. It alleges that the silver vessels which Zedekiah had caused to be made after Jechoniah's exile had been brought back by Baruch. But considering the innumerable arbitrary interferences of the lxx with the text of Jeremiah, the omission of the words in question cannot justify the slightest critical suspicion of their genuineness.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To show more clearly the irreconcilableness of his own position with that of the false prophets, Jeremiah further tells what true prophets, who have the word of Jahveh, would do. They would betake themselves in intercession to the Lord, seeking to avert yet further calamity or punishment, as all the prophets sent by God, including Jeremiah himself, did, cf. Jeremiah 7:16. They should endeavour by intercession to prevent the vessels that are still left in Jerusalem from being taken away. The extraordinary expression לבלתּי באוּ has probably come from the omission of Jod from the verb, which should be read יבאוּ. As it stands, it can only be imperative, which is certainly not suitable. לבלתּי is usually construed with the infinitive, but occasionally also with the temp. fin.; with the imperf., which is what the sense here demands, in Exodus 20:20; with the perf., Jeremiah 23:14. - Of the temple furniture still remaining, he mentions in Jeremiah 27:19 as most valuable the two golden pillars, Jachin and Boaz, 1 Kings 7:15., the brazen sea, 1 Kings 7:23., and המּכונות, the artistic waggon frames for the basins in which to wash the sacrificial flesh, 1 Kings 7:27.; and he declares they too shall be carried to Babylon, as happened at the destruction of Jerusalem, 2 Kings 25:13. (בּגלותו for בּהגלותו.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To show more clearly the irreconcilableness of his own position with that of the false prophets, Jeremiah further tells what true prophets, who have the word of Jahveh, would do. They would betake themselves in intercession to the Lord, seeking to avert yet further calamity or punishment, as all the prophets sent by God, including Jeremiah himself, did, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They should endeavour by intercession to prevent the vessels that are still left in Jerusalem from being taken away. The extraordinary expression לבלתּי באוּ has probably come from the omission of Jod from the verb, which should be read יבאוּ. As it stands, it can only be imperative, which is certainly not suitable. לבלתּי is usually construed with the infinitive, but occasionally also with the temp. fin.; with the imperf., which is what the sense here demands, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; with the perf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - Of the temple furniture still remaining, he mentions in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as most valuable the two golden pillars, Jachin and Boaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., the brazen sea, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., and המּכונות, the artistic waggon frames for the basins in which to wash the sacrificial flesh, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; and he declares they too shall be carried to Babylon, as happened at the destruction of Jerusalem, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (בּגלותו for בּהגלותו.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The statement in Jeremiah 27:19-22 is wide and diffuse; it is therefore condensed in the lxx, but at the same time mutilated. From the fact Mov., with Hitz. agreeing thereto, concludes that the Hebr. text has been expanded by means of glosses. Graf has already shown in reply to this, that the hand of a later glossator interpolating materials from Jeremiah 52:17; 2 Kings 24:13 and 2 Kings 24:1 is not betrayed in the extended account of the furniture remaining, and of the occasion on which it was left behind. He goes on to show that it is rather the editorial hand of Baruch than the hand of the glossator that is to be presumed from the fact that, in consequence of the narrative part of Jeremiah 27:20, Jeremiah 27:19 is repeated in Jeremiah 27:21; and from the further fact that it is impossible here to discriminate the interpolated from the original matter. Graf has also so conclusively proved the worthlessness of the distinguishing marks of the glossator adduced by Mov. and Hitz., that we adopt in full his argument. Such marks are (we are told), (1) the scriptio plena of מכונות here, as contrasted with Jeremiah 52:17; 2 Kings 25:13; 2 Chronicles 4:14, and of יכוניה, as against 2 Chronicles 24:1; 2 Chronicles 28:4; 2 Chronicles 29:2; and yet the interpolations in Jeremiah 27:19 and Jeremiah 27:20 are said to have been taken directly from Jeremiah 52:17 and Jeremiah 24:1. (2) The expression חרים, which is alleged not to have come into use till the exile. But the fact of its standing here and in Jeremiah 39:6 is enough to show it to have been earlier in use; cf. also 1 Kings 21:8, 1 Kings 21:11; and since it is not used in Jeremiah 24:1 and Jeremiah 29:2, it is certain that it has not been got from there. (3) The \"slip-shod\" וירושׁלים, Jeremiah 27:21, for ובירושׁלים, Jeremiah 27:18, which is, however, occasioned simply by the preceding accusative of place, 'בית יהוה וגו (Jeremiah 27:18 also בּבית יהוה).) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is wide and diffuse; it is therefore condensed in the lxx, but at the same time mutilated. From the fact Mov., with Hitz. agreeing thereto, concludes that the Hebr. text has been expanded by means of glosses. Graf has already shown in reply to this, that the hand of a later glossator interpolating materials from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 24:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not betrayed in the extended account of the furniture remaining, and of the occasion on which it was left behind. He goes on to show that it is rather the editorial hand of Baruch than the hand of the glossator that is to be presumed from the fact that, in consequence of the narrative part of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is repeated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and from the further fact that it is impossible here to discriminate the interpolated from the original matter. Graf has also so conclusively proved the worthlessness of the distinguishing marks of the glossator adduced by Mov. and Hitz., that we adopt in full his argument. Such marks are (we are told), (1) the scriptio plena of מכונות here, as contrasted with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and of יכוניה, as against ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 29:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and yet the interpolations in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are said to have been taken directly from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (2) The expression חרים, which is alleged not to have come into use till the exile. But the fact of its standing here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is enough to show it to have been earlier in use; cf. also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 21:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and since it is not used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 29:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is certain that it has not been got from there. (3) The \"slip-shod\" וירושׁלים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for ובירושׁלים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is, however, occasioned simply by the preceding accusative of place, 'בית יהוה וגו (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " also בּבית יהוה).) ",
            "children": []
          }
        ]
      }
    ]
  }
]