[{"num":23,"verse":"And David is old, and satisfied with days, and causeth his son Solomon to reign over Israel,"},{"num":2,"verse":"and gathereth all the heads of Israel, and the priests, and the Levites;"},{"num":3,"verse":"and the Levites are numbered from a son of thirty years and upward, and their number, by their polls, is of mighty men thirty and eight thousand."},{"num":4,"verse":"Of these to preside over the work of the house of Jehovah [are] twenty and four thousand, and officers and judges six thousand,"},{"num":5,"verse":"and four thousand gatekeepers, and four thousand giving praise to Jehovah, `with instruments that I made for praising,' [saith David.]"},{"num":6,"verse":"And David distributeth them into courses: Of the sons of Levi: of Gershon, Kohath, and Merari."},{"num":7,"verse":"Of the Gershonite: Laadan and Shimei."},{"num":8,"verse":"Sons of Laadan: the head [is] Jehiel, and Zetham, and Joel, three."},{"num":9,"verse":"Sons of Shimei [are] Shelomith, and Haziel, and Haran, three; these [are] heads of the fathers of Laadan."},{"num":10,"verse":"And sons of Shimei [are] Jahath, Zina, and Jeush, and Beriah; these [are] sons of Shimei, four."},{"num":11,"verse":"And Jahath is the head, and Zizah the second, and Jeush and Beriah have not multiplied sons, and they become the house of a father by one numbering."},{"num":12,"verse":"Sons of Kohath [are] Amram, Izhar, Hebron, and Uzziel, four."},{"num":13,"verse":"Sons of Amram: Aaron and Moses; and Aaron is separated for his sanctifying the holy of holies, he and his sons -- unto the age, to make perfume before Jehovah, to serve Him, and to bless in His name -- unto the age."},{"num":14,"verse":"As to Moses, the man of God, his sons are called after the tribe of Levi."},{"num":15,"verse":"Sons of Moses: Gershom and Eliezer."},{"num":16,"verse":"Sons of Gershom: Shebuel the head."},{"num":17,"verse":"And sons of Eliezer are Rehabiah the head, and Eliezer had no other sons, and the sons of Rehabiah have multiplied exceedingly."},{"num":18,"verse":"Sons of Izhar: Shelomith the head."},{"num":19,"verse":"Sons of Hebron: Jeriah the head, Amariah the second, Jahaziel the third, and Jekameam the fourth."},{"num":20,"verse":"Sons of Uzziel: Micah the head, and Ishshiah, the second."},{"num":21,"verse":"Sons of Merari: Mahli and Mushi; sons of Mahli: Eleazar and Kish."},{"num":22,"verse":"And Eleazar dieth, and he had no sons, but daughters, and sons of Kish their brethren take them."},{"num":23,"verse":"Sons of Mushi: Mahli, and Eder, and Jerimoth, three."},{"num":24,"verse":"These [are] sons of Levi, by the house of their fathers, heads of the fathers, by their appointments, in the number of names, by their polls, doing the work for the service of the house of Jehovah, from a son of twenty years and upward,"},{"num":25,"verse":"for David said, `Jehovah, God of Israel, hath given rest to His people, and He doth tabernacle in Jerusalem unto the age;'"},{"num":26,"verse":"and also of the Levites, `None [are] to bear the tabernacle and all its vessels for its service;'"},{"num":27,"verse":"for by the last words of David they [took] the number of the sons of Levi from a son of twenty years and upward,"},{"num":28,"verse":"for their station [is] at the side of the sons of Aaron, for the service of the house of Jehovah, over the courts, and over the chambers, and over the cleansing of every holy thing, and the work of the service of the house of God,"},{"num":29,"verse":"and for the bread of the arrangement, and for fine flour for present, and for the thin unleavened cakes, and for [the work of] the pan, and for that which is fried, and for all [liquid] measure and [solid] measure;"},{"num":30,"verse":"and to stand, morning by morning, to give thanks, and to give praise to Jehovah, and so at evening;"},{"num":31,"verse":"and for all the burnt-offerings -- burnt-offerings to Jehovah for sabbaths, for new moons, and for appointed seasons, by number, according to the ordinance upon them continually, before Jehovah."},{"num":32,"verse":"And they have kept the charge of the tent of meeting, and the charge of the sanctuary, and the charge of the sons of Aaron, their brethren, for the service of the house of Jehovah."}]