[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For his bloody house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the blood-guilty house. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Saul’s family and descendants are regarded, according to the universal ideas of the times, as sharers in his guilt. The story of the Gibeonites and of Joshua’s league with them is told in Joshua 9, but Saul’s attempt to destroy them is mentioned only here. It is plain, from what is said of them in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that they had never become incorporated with the Israelites by circumcision, but remained a distinct people. Saul’s sin consisted in the violation of the solemn oath, in the Lord’s name, by which the nation of Israel was bound to the Gibeonites. “His zeal” in that case was of the same ungodly character with many other acts of his reign, in which pride, arrogance, and self-will were cloaked under a zeal for God’s honour and His people’s welfare.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Amorites.—More precisely, the Gibeonites were Hivites (Joshua 9:7); but they are called Amorites (=mountaineers) as a frequent general name for the old people of Palestine.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Amorites.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—More precisely, the Gibeonites were ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Hivites ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but they are called Amorites (=",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "mountaineers",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as a frequent general name for the old people of Palestine.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Two questions are often asked in connection with this narrative: (1) Why the punishment of Saul’s sin should have been so long delayed? and (2) why it should at last have fallen upon David and his people, who had no share in the commission of the sin? The answer to both questions is in the fact that Israel both sinned and was punished as a nation. Saul slew the Gibeonites, not simply as the son of Kish, but as the king of Israel, and therefore involved all Israel with him in the violation of the national oath; and hence, until the evil should be put away by the execution of the immediate offender or his representatives, all Israel must suffer. The lesson of the continuity of the nation’s life, and of its continued responsibility from age to age, was greatly enhanced by the delay. Besides this, there were so many other grievous sins for which Saul was to be punished, that it was hardly possible to bring out during his lifetime the special Divine displeasure at this one.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Two questions are often asked in connection with this narrative: (1) Why the punishment of Saul’s sin should have been so long delayed? and (2) why it should at last have fallen upon David and his people, who had no share in the commission of the sin? The answer to both questions is in the fact that Israel both sinned and was punished ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "as a nation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Saul slew the Gibeonites, not simply as the son of Kish, but as the king of Israel, and therefore involved all Israel with him in the violation of the national oath; and hence, until the evil should be put away by the execution of the immediate offender or his representatives, all Israel must suffer. The lesson of the continuity of the nation’s life, and of its continued responsibility from age to age, was greatly enhanced by the delay. Besides this, there were so many other grievous sins for which Saul was to be punished, that it was hardly possible to bring out during his lifetime the special Divine displeasure at this one.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 21:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 21:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In his zeal for the children of Israel and Judah — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When Joshua and the princes made a league with the Gibeonites, the people were greatly offended with them, as appears, Joshua chap. 9. Whatever the pretences of this resentment might be, the true reason seems sufficiently apparent; they were, by this league, deprived of the lands and spoils of the Gibeonites. Did these reasons cease in the days of Saul? Or rather, did they not still subsist, and with more force, in proportion as the people of Israel and their wants increased, in a narrow land? But however this may be, why did Saul slay them? The text plainly saith, that he did it in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "zeal for the children of Israel and Judah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But the question still returns: How could the destroying these poor people manifest his zeal for Israel and Judah? There is seemingly but one imaginable way how this could be done. The Gibeonites had one city in the tribe of Judah, and three in Benjamin; and when they were destroyed out of these cities, who could pretend any right to them but Israel (that is, Benjamin) and Judah? So that Saul destroyed the Gibeonites, as the most obliging thing he could do for his people. See Delaney.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:1-9 Every affliction arises from sin, and should lead us to repent and humble ourselves before God; but some troubles especially show that they are sent to bring sin to remembrance. God's judgments often look a great way back, which requires us to do so, when we are under his rebukes. It is not for us to object against the people's smarting for the sin of their king; perhaps they helped him. Nor against this generation suffering for the sin of the last. God often visits the sins of the fathers upon the children, and he gives no account of any matters. Time does not wear out the guilt of sin; nor can we build hopes of escape upon the delay of judgments. If we cannot understand all the reasons of Providence in this matter, still we have no right to demand that God should acquaint us with those reasons. It must be right, because it is the will of God, and in the end it will be proved to be so. Money is no satisfaction for blood. It should seem, Saul's posterity trod in his steps, for it is called a bloody house. It was the spirit of the family, therefore they are justly reckoned with for his sin, as well as for their own. The Gibeonites did not require this out of malice against Saul or his family. It was not to gratify any revenge, but for the public good. They were put to death at the beginning of harvest; they were thus sacrificed to turn away the wrath of Almighty God, who had withheld the harvest-mercies for some years past, and to obtain his favour in the present harvest. In vain do we expect mercy from God, unless we do justice upon our sins. Executions must not be thought cruel, which are for the public welfare.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The way in which the writer here refers to the history of the league with the Gibeonites ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows that the Book of Joshua was not a part of the same work as the Books of Samuel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of the Amorites - The Gibeonites were Hivites Joshua 9:7; Joshua 11:19; and in many enumerations of the Canaanite nations the Hivites are distinguished from the Amorites. But \"Amorite\" is often used in a more comprehensive sense, equivalent to \"Canaanite\" (as Genesis 15:16; Deuteronomy 1:27), and denoting especially that part of the Canaanite nation which dwelt in the hill country Numbers 13:29; Deuteronomy 1:7, Deuteronomy 1:20, Deuteronomy 1:24, and so includes the Hivites. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of the Amorites - The Gibeonites were Hivites ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in many enumerations of the Canaanite nations the Hivites are distinguished from the Amorites. But \"Amorite\" is often used in a more comprehensive sense, equivalent to \"Canaanite\" (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and denoting especially that part of the Canaanite nation which dwelt in the hill country ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 13:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and so includes the Hivites. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. in his zeal to the children of Israel and Judah—Under pretense of a rigorous and faithful execution of the divine law regarding the extermination of the Canaanites, he set himself to expel or destroy those whom Joshua had been deceived into sparing. His real object seems to have been, that the possessions of the Gibeonites, being forfeited to the crown, might be divided among his own people (compare 1Sa 22:7). At all events, his proceeding against this people was in violation of a solemn oath, and involving national guilt. The famine was, in the wise and just retribution of Providence, made a national punishment, since the Hebrews either assisted in the massacre, or did not interpose to prevent it; since they neither endeavored to repair the wrong, nor expressed any horror of it; and since a general protracted chastisement might have been indispensable to inspire a proper respect and protection to the Gibeonite remnant that survived.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saul sought to slay them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i. e. he sought occasions and pretences how he might cut them off with some colour of law or justice, diligently searching out and aggravating their faults, and punishing them worse than they deserved; oppressing them with excessive labours, and openly killing some of them, and intending by degrees to wear them out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In his zeal to the children of Israel and Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " conceiving, or rather pretending, that it was not for the honour, nor comfort, nor advantage of God’s people, to nourish any of that viperous broad in their bosoms; and that howsoever Joshua and the princes which then were, had by their fraud been drawn into an oath to preserve them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Joshua 9:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet in truth that oath was contrary to God’s command, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 23:32 Deu 7:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 7:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore (as he thought) not to be observed. This was his pretence. But how little zeal he had for God, or for the public good of his people, is evident by the whole course of his life; and therefore it is more than probable he had some particular motive or design in the case; either because some of them had highly provoked him, for whose sake he would be revenged of the whole race; or because, they being cut off, their estates might be forfeited to the crown; or for some other reason now unknown. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the king called the Gibeonites,.... Sent messengers unto them, and summoned them to come to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said unto them; what is expressed in 2 Samuel 21:3; for what follows is in a parenthesis: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and said unto them; what is expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 21:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for what follows is in a parenthesis: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(now the Gibeonites were not of the children of Israel; originally, though they were proselyted to the Jewish religion, and were employed in the menial services of the sanctuary: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but of the remnant of the Amorites; they were the remains of the old Canaanites, who sometimes in general were called Amorites, otherwise the Gibeonites were called Hivites; see Joshua 9:7, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but of the remnant of the Amorites; they were the remains of the old Canaanites, who sometimes in general were called Amorites, otherwise the Gibeonites were called Hivites; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the children of Israel had sworn unto them; by their princes, as Joshua; yet: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Saul, contrary to this oath, sought to slay them in his zeal to the children of Israel and Judah); pretending a great concern for them, for their honour and profit; that these men ought not to live in their cities, and take the bread out of their mouths, and be employed in the service of the sanctuary; but that they ought to be expelled, and even cut off, being the old inhabitants of the land, the Lord ordered to be destroyed; and that though the Israelites had given an oath to the contrary, they were drawn into it by guile and deceit, and therefore not binding upon them; hence he sought by all means to harass and oppress them, and slew many of them, and destroyed them out of their cities, that they might be possessed by Judah and Benjamin; see 2 Samuel 4:2, compared with Joshua 9:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Saul, contrary to this oath, sought to slay them in his zeal to the children of Israel and Judah); pretending a great concern for them, for their honour and profit; that these men ought not to live in their cities, and take the bread out of their mouths, and be employed in the service of the sanctuary; but that they ought to be expelled, and even cut off, being the old inhabitants of the land, the Lord ordered to be destroyed; and that though the Israelites had given an oath to the contrary, they were drawn into it by guile and deceit, and therefore not binding upon them; hence he sought by all means to harass and oppress them, and slew many of them, and destroyed them out of their cities, that they might be possessed by Judah and Benjamin; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the king called the Gibeonites, and said unto them; (now the Gibeonites were not of the children of Israel, but of the remnant of the Amorites; and the children of Israel had sworn unto them: and Saul sought to slay them in his zeal to the children of Israel and Judah.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Amorites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Amorites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= highlanders) is here and elsewhere used as a general designation for the ancient inhabitants of Palestine, particularly those who occupied the mountainous country. See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Gibeonites belonged to the tribe of the Hivites.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had sworn unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. The oath though obtained by fraud was acknowledged to be binding (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and its violation was a breach of the third commandment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in his zeal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Probably in a fit of zeal to carry out the Law by cleansing the land from the remnant of the heathen (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:11-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as he cleansed it from the soothsayers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is no allusion to the deed elsewhere.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wherewith shall I make the atonement",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The cognate substantive—also rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "satisfaction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ransom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—means literally ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a covering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “atonement” is a covering, which hides the offence from the eyes of the offended party, and withdraws the guilt from the gaze of an avenging God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Saul sought to slay them in his zeal.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We gather from various incidental circumstances that Saul, in some part of his reign, manifested great zeal in an attempt to carry out literally the enactments of the Levitical Law; but he seems to have done so with the same ferocity as that which he displayed in slaughtering the priests at Nob with their wives and children. Thus he had put to death wizards and all who dealt with familiar spirits (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the same way he seems to have tried to exterminate the aboriginal inhabitants of Palestine, in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and had especially massacred a large number of Gibeonites, in violation of the covenant made with them by Joshua and all Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:3, 15-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And as he would thus acquire \"fields and vineyards\" robbed from them to give to his captains, his conduct was probably popular, and the cause of a general system of wrong and oppression practised upon all the natives. It had thus become a national sin, and as such was punished by a national calamity. Amorites; that is highlanders, mountaineers. Strictly they were Hivites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). 2 Samuel 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In consequence of this answer from God, which merely indicated in a general manner the cause of the visitation that had come upon the land, David sent for the Gibeonites to ask them concerning the wrong that had been done them by Saul. But before the historian communicates their answer, he introduces an explanation respecting the Gibeonites, to the effect that they were not Israelites, but remnants of the Amorites, to whom Joshua had promised on oath that their lives should be preserved (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). They are called Hivites in the book of Joshua (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); whereas here they are designated Amorites, according to the more general name which is frequently used as comprehending all the tribes of Canaan (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). David said to the Gibeonites, \"What shall I do for you, and wherewith shall I expiate\" (sc., the wrong done you), \"that ye may bless the inheritance (i.e., the nation) of Jehovah?\" On the use of the imperative וּברכוּ to denote the certain consequences, see Ewald, 347.",
        "children": []
      }
    ]
  }
]