[{"header":"Chapter 16"},{"num":1,"verse":"Asa’s Infidelity. In the thirty-sixth year of Asa’s reign, Baasha, king of Israel, attacked Judah and fortified Ramah to block all movement for Asa, king of Judah. "},{"num":2,"verse":"Asa then brought out silver and gold from the treasuries of the house of the Lord and the house of the king and sent them to Ben-hadad, king of Aram, who ruled in Damascus. He said: "},{"num":3,"verse":"“There is a treaty between you and me, as there was between your father and my father. I am sending you silver and gold. Go, break your treaty with Baasha, king of Israel, that he may withdraw from me.” "},{"num":4,"verse":"Ben-hadad agreed with King Asa and sent the leaders of his troops against the cities of Israel. They attacked Ijon, Dan, Abel-maim, besides all the store cities of Naphtali. "},{"num":5,"verse":"When Baasha heard of it, he left off fortifying Ramah, putting an end to his work. "},{"num":6,"verse":"Then King Asa commandeered all Judah and they carried away the stones and beams with which Baasha was fortifying Ramah. With them he fortified Geba and Mizpah."},{"num":7,"verse":"At that time Hanani the seer came to Asa, king of Judah, and said to him: “Because you relied on the king of Aram and did not rely on the Lord, your God, the army of the king of Aram has escaped your power. "},{"num":8,"verse":"Were not the Ethiopians and Libyans a vast army, with great numbers of chariots and horses? And yet, because you relied on the Lord, he delivered them into your power. "},{"num":9,"verse":"The eyes of the Lord roam over the whole earth, to encourage those who are devoted to him wholeheartedly. You have acted foolishly in this matter, for from now on you will have wars.” "},{"num":10,"verse":"But Asa became angry with the seer and imprisoned him in the stocks, so greatly was he enraged at him over this. Asa also oppressed some of his people at this time."},{"num":11,"verse":"Now the acts of Asa, first and last, are recorded in the book of the kings of Judah and Israel. "},{"num":12,"verse":"In the thirty-ninth year of his reign, Asa contracted disease in his feet; it became worse, but even with this disease he did not seek the Lord, only physicians. "},{"num":13,"verse":"Asa rested with his ancestors; he died in the forty-first year of his reign. "},{"num":14,"verse":"They buried him in the tomb he had hewn for himself in the City of David, after laying him on a couch that was filled with spices and various kinds of aromatics compounded into an ointment; and they kindled a huge fire for him."}]