[{"num":13,"verse":"¶ And as he went out of the temple, one of his disciples said unto him, Master, see what manner of stones and what buildings are here!"},{"num":2,"verse":"And Jesus, answering, said unto him, Seest thou these great buildings? There shall not be left one stone upon another that shall not be thrown down."},{"num":3,"verse":"And as he sat upon the mount of Olives over against the temple, Peter and James and John and Andrew asked him privately,"},{"num":4,"verse":"Tell us, when shall these things be? and what shall be the sign when all things are to be finished?"},{"num":5,"verse":"¶ And Jesus, answering them, began to say, Take heed that no one deceive you,"},{"num":6,"verse":"for many shall come in my name, saying, I Am Christ, and shall deceive many."},{"num":7,"verse":"And when ye shall hear of wars and rumours of wars, be ye not troubled, for such things must needs be; but the end shall not be yet."},{"num":8,"verse":"For people shall rise against people and kingdom against kingdom, and there shall be earthquakes in each place, and there shall be famines and troubles: these shall be the beginnings of sorrows."},{"num":9,"verse":"But take heed to yourselves, for they shall deliver you up in the councils, and in the synagogues ye shall be beaten; and ye shall be called before rulers and kings for my sake for a testimony unto them."},{"num":10,"verse":"And the gospel needs to be preached unto all the Gentiles first."},{"num":11,"verse":"But when they shall bring you to deliver you up, do not premeditate beforehand what ye shall speak, neither think ye regarding it, but whatever shall be given you in that hour, that speak ye, for it is not ye that speak, but the Holy Spirit."},{"num":12,"verse":"Now the brother shall deliver the brother unto death, and the father the son; and children shall rise up against their parents and shall kill them."},{"num":13,"verse":"And ye shall be hated by everyone for my name, but he that shall persevere unto the end, the same shall be saved."},{"num":14,"verse":"¶ But when ye shall see the abomination of desolation (spoken of by Daniel the prophet) standing where it ought not, he that reads, let him understand, then let those that are in Judaea flee to the mountains;"},{"num":15,"verse":"and let him that is on the housetop not go down into the house, neither enter therein to take any thing out of his house;"},{"num":16,"verse":"and let him that is in the field not turn back again even to take up his garment."},{"num":17,"verse":"But woe to those that are with child and to those that give suck in those days!"},{"num":18,"verse":"Pray, therefore, that your flight not be in winter."},{"num":19,"verse":"For those days shall be of affliction such as never was from the beginning of the creation of the things which God created unto this time, neither shall be."},{"num":20,"verse":"And except that the Lord had shortened those days, no flesh should be saved, but for the elect’s sake, whom he has chosen, he has shortened those days."},{"num":21,"verse":"And then if anyone should say to you, Behold, here is the Christ, or, Behold, he is there, do not believe him;"},{"num":22,"verse":"for false Christs and false prophets shall rise and shall show signs and wonders to seduce, if possible, even the elect."},{"num":23,"verse":"But take ye heed; behold, I have told you everything beforehand."},{"num":24,"verse":"¶ But in those days after that affliction, the sun shall darken, and the moon shall not give her light,"},{"num":25,"verse":"and the stars shall fall from heaven, and the powers that are in the heavens shall be shaken."},{"num":26,"verse":"And then shall they see the Son of man coming in the clouds with great power and glory."},{"num":27,"verse":"And then shall he send his angels and shall gather together his elect from the four winds, from the uttermost part of the earth unto the uttermost part of the heaven."},{"num":28,"verse":"¶ Learn the similitude from the fig tree: When her branch is yet tender and puts forth leaves, ye know that summer is near;"},{"num":29,"verse":"so ye in like manner, when ye shall see these things come to pass, know that it is near, even at the doors."},{"num":30,"verse":"Verily I say unto you that this generation shall not pass until all these things are done."},{"num":31,"verse":"Heaven and earth shall pass away, but my words shall not pass away."},{"num":32,"verse":"But of that day and that hour no one knows, no, not even the angels who are in the heaven, neither the Son, but only the Father."},{"num":33,"verse":"Take ye heed, watch and pray; for ye know not when the time shall be."},{"num":34,"verse":"As the man who, taking a far journey, left his house and gave his estate to his slaves and to each one his responsibility and commanded the porter to watch."},{"num":35,"verse":"Watch ye therefore, for ye know not when the Lord of the house comes: at evening or at midnight or at the cockcrowing or in the morning,"},{"num":36,"verse":"lest coming suddenly he find you sleeping."},{"num":37,"verse":"And what I say unto you, I say unto all: Watch."}]