[{"header":"The Destruction of the Temple Predicted"},{"num":13,"verse":"And as he was going out of the temple courts, one of his disciples said to him, “Teacher, look! What great stones and what wonderful buildings!” "},{"num":2,"verse":"And Jesus said to him, “Do you see these great buildings? Not one stone will be left here on another stone that will not be thrown down!”"},{"header":"Signs of the End of the Age"},{"num":3,"verse":"And as he was sitting on the Mount of Olives opposite the temple, Peter and James and John and Andrew asked him privately, "},{"num":4,"verse":"“Tell us, when will these things happen, and what will be the sign when all these things are about to be accomplished?” "},{"num":5,"verse":"So Jesus began to say to them, “Watch out that no one deceives you! "},{"num":6,"verse":"Many will come in my name, saying, ‘I am he,’ and they will deceive many. "},{"num":7,"verse":"And when you hear about wars and rumors of wars, do not be alarmed. This must happen, but the end is not yet. "},{"num":8,"verse":"For nation will rise up against nation and kingdom against kingdom. There will be earthquakes in various places. There will be famines. These things are the beginning of birth pains."},{"header":"Persecution of Disciples Predicted"},{"num":9,"verse":"“But you, watch out for yourselves! They will hand you over to councils and you will be beaten in the synagogues and will have to stand before governors and kings because of me, for a witness to them. "},{"num":10,"verse":"And the gospel must first be proclaimed to all the nations. "},{"num":11,"verse":"And when they arrest you and hand you over, do not be anxious beforehand what you should say, but whatever is given to you at that hour, say this. For you are not the ones who are speaking, but the Holy Spirit. "},{"num":12,"verse":"And brother will hand over brother to death, and a father his child, and children will rise up against parents and have them put to death. "},{"num":13,"verse":"And you will be hated by all because of my name. But the one who endures to the end—this one will be saved."},{"header":"The Abomination of Desolation"},{"num":14,"verse":"“But when you see the abomination of desolation standing where it should not be” (let the one who reads understand), “then those in Judea must flee to the mountains! "},{"num":15,"verse":"The one who is on his housetop must not come down or go inside to take anything out of his house, "},{"num":16,"verse":"and the one who is in the field must not turn back to pick up his cloak. "},{"num":17,"verse":"And woe to those who are pregnant and to those who are nursing their babies in those days! "},{"num":18,"verse":"But pray that it will not happen in winter. "},{"num":19,"verse":"For in those days there will be tribulation of such a kind as has not happened from the beginning of the creation that God created until now, and never will happen. "},{"num":20,"verse":"And if the Lord had not shortened the days, no human being would be saved. But for the sake of the elect, whom he chose, he has shortened the days."},{"num":21,"verse":"“And at that time if anyone should say to you, “Behold, here is the Christ,’ ‘Behold, there he is,’ do not believe him! "},{"num":22,"verse":"For false messiahs and false prophets will appear, and will produce signs and wonders in order to mislead, if possible, the elect. "},{"num":23,"verse":"But you, watch out! I have told you everything ahead of time!"},{"header":"The Arrival of the Son of Man"},{"num":24,"verse":"“But in those days, after that tribulation,"},{"num":26,"verse":"And then they will see the Son of Man arriving in the clouds with great power and glory. "},{"num":27,"verse":"And then he will send out the angels, and will gather the elect together from the four winds, from the end of the earth to the end of heaven."},{"header":"The Parable of the Fig Tree"},{"num":28,"verse":"“Now learn the parable from the fig tree: Whenever its branch has already become tender and puts forth its leaves, you know that summer is near. "},{"num":29,"verse":"So also you, when you see these things happening, know that he is near, at the door. "},{"num":30,"verse":"Truly I say to you that this generation will never pass away until all these things take place! "},{"num":31,"verse":"Heaven and earth will pass away, but my words will never pass away."},{"header":"The Unknown Day and Hour"},{"num":32,"verse":"“But concerning that day or hour no one knows—not even the angels in heaven nor the Son—except the Father. "},{"num":33,"verse":"Watch out! Be alert, because you do not know when the time is! "},{"num":34,"verse":"It is like a man away on a journey, who left his house and gave his slaves authority—to each one his work—and to the doorkeeper he gave orders that he should be on the alert. "},{"num":35,"verse":"Therefore be on the alert, for you do not know when the master of the house is coming—whether in the evening, or at midnight, or when the rooster crows, or early in the morning—"},{"num":36,"verse":"lest he arrive suddenly and find you sleeping. "},{"num":37,"verse":"And what I say to you, I say to everyone: Be on the alert!”"}]