[{"header":"Chapter 13"},{"num":1,"verse":"The Destruction of the Temple Foretold. As he was making his way out of the temple area one of his disciples said to him, “Look, teacher, what stones and what buildings!” "},{"num":2,"verse":"Jesus said to him, “Do you see these great buildings? There will not be one stone left upon another that will not be thrown down.”"},{"num":3,"verse":"The Signs of the End. As he was sitting on the Mount of Olives opposite the temple area, Peter, James, John, and Andrew asked him privately, "},{"num":4,"verse":"“Tell us, when will this happen, and what sign will there be when all these things are about to come to an end?” "},{"num":5,"verse":"Jesus began to say to them, “See that no one deceives you. "},{"num":6,"verse":"Many will come in my name saying, ‘I am he,’ and they will deceive many. "},{"num":7,"verse":"When you hear of wars and reports of wars do not be alarmed; such things must happen, but it will not yet be the end. "},{"num":8,"verse":"Nation will rise against nation and kingdom against kingdom. There will be earthquakes from place to place and there will be famines. These are the beginnings of the labor pains."},{"num":9,"verse":"The Coming Persecution. “Watch out for yourselves. They will hand you over to the courts. You will be beaten in synagogues. You will be arraigned before governors and kings because of me, as a witness before them. "},{"num":10,"verse":"But the gospel must first be preached to all nations. "},{"num":11,"verse":"When they lead you away and hand you over, do not worry beforehand about what you are to say. But say whatever will be given to you at that hour. For it will not be you who are speaking but the holy Spirit. "},{"num":12,"verse":"Brother will hand over brother to death, and the father his child; children will rise up against parents and have them put to death. "},{"num":13,"verse":"You will be hated by all because of my name. But the one who perseveres to the end will be saved."},{"num":14,"verse":"The Great Tribulation. “When you see the desolating abomination standing where he should not (let the reader understand), then those in Judea must flee to the mountains, "},{"num":15,"verse":"[and] a person on a housetop must not go down or enter to get anything out of his house, "},{"num":16,"verse":"and a person in a field must not return to get his cloak. "},{"num":17,"verse":"Woe to pregnant women and nursing mothers in those days. "},{"num":18,"verse":"Pray that this does not happen in winter. "},{"num":19,"verse":"For those times will have tribulation such as has not been since the beginning of God’s creation until now, nor ever will be. "},{"num":20,"verse":"If the Lord had not shortened those days, no one would be saved; but for the sake of the elect whom he chose, he did shorten the days. "},{"num":21,"verse":"If anyone says to you then, ‘Look, here is the Messiah! Look, there he is!’ do not believe it. "},{"num":22,"verse":"False messiahs and false prophets will arise and will perform signs and wonders in order to mislead, if that were possible, the elect. "},{"num":23,"verse":"Be watchful! I have told it all to you beforehand."},{"num":24,"verse":"The Coming of the Son of Man. “But in those days after that tribulation"},{"num":26,"verse":"And then they will see ‘the Son of Man coming in the clouds’ with great power and glory, "},{"num":27,"verse":"and then he will send out the angels and gather [his] elect from the four winds, from the end of the earth to the end of the sky."},{"num":28,"verse":"The Lesson of the Fig Tree. “Learn a lesson from the fig tree. When its branch becomes tender and sprouts leaves, you know that summer is near. "},{"num":29,"verse":"In the same way, when you see these things happening, know that he is near, at the gates. "},{"num":30,"verse":"Amen, I say to you, this generation will not pass away until all these things have taken place. "},{"num":31,"verse":"Heaven and earth will pass away, but my words will not pass away."},{"num":32,"verse":"Need for Watchfulness. “But of that day or hour, no one knows, neither the angels in heaven, nor the Son, but only the Father. "},{"num":33,"verse":"Be watchful! Be alert! You do not know when the time will come. "},{"num":34,"verse":"It is like a man traveling abroad. He leaves home and places his servants in charge, each with his work, and orders the gatekeeper to be on the watch. "},{"num":35,"verse":"Watch, therefore; you do not know when the lord of the house is coming, whether in the evening, or at midnight, or at cockcrow, or in the morning. "},{"num":36,"verse":"May he not come suddenly and find you sleeping. "},{"num":37,"verse":"What I say to you, I say to all: ‘Watch!’”"}]