[{"num":13,"verse":"As he was leaving the Temple that day, one of his disciples said, “Teacher, what beautiful buildings these are! Look at the decorated stonework on the walls.”"},{"num":2,"verse":"Jesus replied, “Yes, look! For not one stone will be left upon another, except as ruins.”"},{"num":3,"verse":"And as he sat on the slopes of the Mount of Olives across the valley from Jerusalem, Peter, James, John, and Andrew got alone with him and asked him, “Just when is all this going to happen to the Temple? Will there be some warning ahead of time?”"},{"num":5,"verse":"So Jesus launched into an extended reply. “Don’t let anyone mislead you,” he said, "},{"num":6,"verse":"“for many will come declaring themselves to be your Messiah and will lead many astray. "},{"num":7,"verse":"And wars will break out near and far, but this is not the signal of the end-time."},{"num":8,"verse":"“For nations and kingdoms will proclaim war against each other, and there will be earthquakes in many lands, and famines. These herald only the early stages of the anguish ahead. "},{"num":9,"verse":"But when these things begin to happen, watch out! For you will be in great danger. You will be dragged before the courts, and beaten in the synagogues, and accused before governors and kings of being my followers. This is your opportunity to tell them the Good News. "},{"num":10,"verse":"And the Good News must first be made known in every nation before the end-time finally comes. "},{"num":11,"verse":"But when you are arrested and stand trial, don’t worry about what to say in your defense. Just say what God tells you to. Then you will not be speaking, but the Holy Spirit will."},{"num":12,"verse":"“Brothers will betray each other to death, fathers will betray their own children, and children will betray their parents to be killed. "},{"num":13,"verse":"And everyone will hate you because you are mine. But all who endure to the end without renouncing me shall be saved."},{"num":14,"verse":"“When you see the horrible thing standing in the Temple—reader, pay attention!—flee, if you can, to the Judean hills. "},{"num":15,"verse":"Hurry! If you are on your rooftop porch, don’t even go back into the house. If you are out in the fields, don’t even return for your money or clothes."},{"num":17,"verse":"“Woe to pregnant women in those days, and to mothers nursing their children. "},{"num":18,"verse":"And pray that your flight will not be in winter. "},{"num":19,"verse":"For those will be days of such horror as have never been since the beginning of God’s creation, nor will ever be again. "},{"num":20,"verse":"And unless the Lord shortens that time of calamity, not a soul in all the earth will survive. But for the sake of his chosen ones he will limit those days."},{"num":21,"verse":"“And then if anyone tells you, ‘This is the Messiah,’ or, ‘That one is,’ don’t pay any attention. "},{"num":22,"verse":"For there will be many false Messiahs and false prophets who will do wonderful miracles that would deceive, if possible, even God’s own children. "},{"num":23,"verse":"Take care! I have warned you!"},{"num":24,"verse":"“After the tribulation ends, then the sun will grow dim and the moon will not shine, "},{"num":25,"verse":"and the stars will fall—the heavens will convulse."},{"num":26,"verse":"“Then all mankind will see me, the Messiah, coming in the clouds with great power and glory. "},{"num":27,"verse":"And I will send out the angels to gather together my chosen ones from all over the world—from the farthest bounds of earth and heaven."},{"num":28,"verse":"“Now, here is a lesson from a fig tree. When its buds become tender and its leaves begin to sprout, you know that spring has come. "},{"num":29,"verse":"And when you see these things happening that I’ve described, you can be sure that my return is very near, that I am right at the door."},{"num":30,"verse":"“Yes, these are the events that will signal the end of the age. "},{"num":31,"verse":"Heaven and earth shall disappear, but my words stand sure forever."},{"num":32,"verse":"“However, no one, not even the angels in heaven, nor I myself, knows the day or hour when these things will happen; only the Father knows. "},{"num":33,"verse":"And since you don’t know when it will happen, stay alert. Be on the watch for my return."},{"num":34,"verse":"“My coming can be compared with that of a man who went on a trip to another country. He laid out his employees’ work for them to do while he was gone and told the gatekeeper to watch for his return."},{"num":35,"verse":"“Keep a sharp lookout! For you do not know when I will come, at evening, at midnight, early dawn or late daybreak. Don’t let me find you sleeping. Watch for my return! This is my message to you and to everyone else.”"}]