[{"num":1,"verse":"“Give me 12,000 men! I’ll leave tonight and pursue David,” Ahithophel advised Absalom. "},{"num":2,"verse":"“I’ll catch him while he is still tired and weak. I’ll frighten him so all his people with him desert him. But I’ll only kill the king. "},{"num":3,"verse":"Then I’ll bring everybody else back to you. When the man you’re looking for is dead, all the rest of the people will return quietly.”"},{"num":4,"verse":"Even though this plan seemed like a good idea to Absalom and to all of the elders of Israel, "},{"num":5,"verse":"Absalom replied, “Call in Hushai the Archite so I can hear what he has to say, too!” "},{"num":6,"verse":"When Hushai approached Absalom, Absalom asked him, “Here’s what Ahithophel had to advise. Should we do what he says? Or if not, say so!”"},{"header":"Hushai Counters Ahithophel’s Advice"},{"num":7,"verse":"“Ahithophel’s advice is not best at this time,” Hushai suggested to Absalom. "},{"num":8,"verse":"“You know how strong your father and his men are. They’re as mad as a bear robbed of her cubs! Furthermore, your father is a skilled warrior. He won’t stay with his army at night. "},{"num":9,"verse":"Look! He’s probably already hiding in a cave or someplace like that. If the first attack fails, people will hear about it and think, ‘Absalom’s army is losing!’ "},{"num":10,"verse":"Then even men who would otherwise be as brave as lions will be scared, because every Israeli knows your father is a mighty man, and they know his men are valiant! "},{"num":11,"verse":"So here’s my advice: Muster everybody from one end of the country to the other! You’ll have an army in number like the sand on the seashore! Then you’ll go into battle! "},{"num":12,"verse":"We’ll go find David wherever he’s hiding. We’ll fall on him like dew on the ground! We’ll kill him and all of his men, and we won’t leave even one man alive! "},{"num":13,"verse":"If he escapes into a city, we’ll bring ropes to that city and tear it down! We won’t leave a single stone left in the valley!”"},{"num":14,"verse":"Absalom and all of the Israelis replied, “The advice of Hushai the Archite is better than Ahithophel’s!”"},{"header":"Hushai Warns David"},{"num":15,"verse":"So Hushai told Zadok and Abiathar, the priests, what Ahithophel had suggested to Absalom and the elders of Israel. He also reported what he himself had proposed. Hushai said, "},{"num":16,"verse":"“Quick! Get word to David! Tell him not to spend the night at the crossings that lead to the desert. Instead, he must cross the Jordan River immediately. That way, if he crosses the river, the king and his entourage will survive.”"},{"num":17,"verse":"Meanwhile, since they could not risk being seen entering the city, Jonathan and Ahimaaz had been waiting at En-rogel, where a young servant woman was to go to inform them and they would then go brief King David. "},{"num":18,"verse":"But a young man observed Jonathan and Ahimaaz and informed Absalom, so they left in a hurry, arrived at the home of a man who lived at Bahurim, and hid inside a well that was in his courtyard. "},{"num":19,"verse":"The man’s wife grabbed a sheet, covered the mouth of the well with it, and spread some dried grain over it. As a result, nobody could tell it was a hiding place."},{"num":20,"verse":"When Absalom’s servants approached the woman of the house, they asked her, “Where are Ahimaaz and Jonathan?”"},{"num":21,"verse":"A little while later, the men crawled up out of the well and went off to talk to King David. They told David, “Get up! Cross the water quickly, because this is what Ahithophel advised about you…” "},{"num":22,"verse":"So David got up and all of his entourage crossed the Jordan River. Everyone had crossed the Jordan River by dawn’s first light."},{"header":"Ahithophel’s Suicide"},{"num":23,"verse":"Meanwhile, when Ahithophel observed that his counsel was not being acted upon, he saddled his donkey, got up, and left for his hometown. Leaving behind a set of orders for his household, he hanged himself. After his death he was buried in his father’s tomb."},{"header":"David Receives Supplies in the Wilderness"},{"num":24,"verse":"Later, David arrived at Mahanaim. Absalom and all of the Israelis who supported him crossed the Jordan River. "},{"num":25,"verse":"Absalom had installed Amasa in place of Joab over the army. (Amasa was the son of a man named Jether the Ishmaelite. His mother was Abigail, a daughter of Nahash and a sister of Zeruiah, Joab’s mother.) "},{"num":26,"verse":"Absalom and the Israelis with him camped in the territory of Gilead. "},{"num":27,"verse":"When David arrived at Mahanaim, Shobi (Nahash’s son from the Ammonite town of Rabbah), Makir (Ammiel’s son from Lo-debar), and Barzillai (from Rogelim in Gilead) were already there. "},{"num":28,"verse":"They brought along bedding, bowls, clay basins, wheat, barley, flour, roasted grains, beans, peas, "},{"num":29,"verse":"honey, cheeses, sheep, and cheese made from cow’s milk for David and his entourage because they had been reasoning, “The people are hungry, tired, and thirsty there in the wilderness.”"}]