[{"header":"Hushai’s Counsel"},{"num":17,"verse":"Furthermore, Ahithophel said to Absalom, “Please let me choose twelve thousand men and let me set out and pursue David tonight."},{"num":2,"verse":"And I will attack him while he is weary and exhausted and startle him, so that all the people who are with him will flee. Then I will strike and kill the king when he is alone,"},{"num":3,"verse":"and I will bring all the people back to you. The return of everyone depends on the man whom you are seeking; then all the people will be at peace.”"},{"num":4,"verse":"And the plan pleased Absalom and all the elders of Israel."},{"num":5,"verse":"Nevertheless, Absalom said, “Now call Hushai the Archite also, and let’s hear what he has to say.”"},{"num":6,"verse":"When Hushai had come to Absalom, Absalom said to him, “Ahithophel has proposed this plan. Should we carry out his plan? If not, say so yourself.”"},{"num":7,"verse":"So Hushai said to Absalom, “This time the advice that Ahithophel has given is not good.”"},{"num":8,"verse":"Then Hushai said, “You yourself know your father and his men, that they are warriors and they are fierce, like a bear deprived of her cubs in the field. And your father is an expert in warfare, and he will not spend the night with the people."},{"num":9,"verse":"Behold, he has now hidden himself in one of the ravines, or in another place; and it will be that when he falls on them at the first attack, whoever hears it will say, ‘There has been a slaughter among the people who follow Absalom!’"},{"num":10,"verse":"And even the one who is valiant, whose heart is like the heart of a lion, will completely despair; for all Israel knows that your father is a mighty man, and those who are with him are valiant men."},{"num":11,"verse":"But I advise that all Israel be fully gathered to you, from Dan even to Beersheba, like the sand that is by the sea in abundance; and that you personally go into battle."},{"num":12,"verse":"Then we will come to him in one of the places where he can be found, and we will fall on him just as the dew falls on the ground; and of him and of all the men who are with him, not even one will be left."},{"num":13,"verse":"And if he withdraws into a city, then all Israel shall bring ropes to that city, and we will drag it into the valley until not even a pebble is found there.”"},{"num":14,"verse":"Then Absalom and all the men of Israel said, “The advice of Hushai the Archite is better than the advice of Ahithophel.” For the Lord had ordained to foil the good advice of Ahithophel, in order for the Lord to bring disaster on Absalom."},{"header":"Hushai’s Warning Saves David"},{"num":15,"verse":"Then Hushai said to Zadok and to Abiathar the priests, “This is what Ahithophel advised Absalom and the elders of Israel to do, and this is what I have advised."},{"num":16,"verse":"Now then, send a messenger quickly and tell David, saying, ‘Do not spend the night at the river crossing places of the wilderness, but by all means cross over, or else the king and all the people who are with him will be destroyed.’”"},{"num":17,"verse":"Now Jonathan and Ahimaaz were staying at En-rogel, and a female servant would go and inform them, and they would go and inform King David, for they could not allow themselves to be seen entering the city."},{"num":18,"verse":"But a boy did see them, and he told Absalom; so the two of them left quickly and came to the house of a man in Bahurim, who had a well in his courtyard, and they went down into it."},{"num":19,"verse":"And the woman took a cover and spread it over the well’s mouth and scattered barley meal on it, so that nothing was known."},{"num":20,"verse":"Then Absalom’s servants came to the woman at the house and said, “Where are Ahimaaz and Jonathan?” And the woman said to them, “They have crossed the brook of water.” And when they searched and did not find them, they returned to Jerusalem."},{"num":21,"verse":"It came about after they had departed, that they came up out of the well and went and reported to King David; and they said to David, “Set out and cross over the water quickly, because this is what Ahithophel has advised against you.”"},{"num":22,"verse":"Then David and all the people who were with him set out and crossed the Jordan; by dawn not even one remained who had not crossed the Jordan."},{"num":23,"verse":"Now when Ahithophel saw that his advice had not been followed, he saddled his donkey and set out and went to his home, to his city, and set his house in order, and hanged himself; so he died and was buried in his father’s grave."},{"num":24,"verse":"Then David came to Mahanaim. And Absalom crossed the Jordan, he and all the men of Israel with him."},{"num":25,"verse":"Absalom put Amasa in command of the army in place of Joab. Now Amasa was the son of a man whose name was Ithra the Israelite, who had relations with Abigail the daughter of Nahash, sister of Zeruiah, Joab’s mother."},{"num":26,"verse":"And Israel and Absalom camped in the land of Gilead."},{"num":27,"verse":"Now when David had come to Mahanaim, Shobi the son of Nahash from Rabbah of the sons of Ammon, Machir the son of Ammiel from Lo-debar, and Barzillai the Gileadite from Rogelim,"},{"num":28,"verse":"brought beds, basins, pottery, wheat, barley, flour, roasted grain, beans, lentils, roasted seeds,"},{"num":29,"verse":"honey, curds, sheep, and cheese of the herd, for David and the people who were with him, to eat. For they said, “The people are hungry and exhausted and thirsty in the wilderness.”"}]