[{"num":9,"verse":"But Saul, still breathing out threatenings and slaughter against the disciples of the Lord, came to the high priest"},{"num":2,"verse":"and asked of him letters to Damascus, to the synagogues, so that if he found any who were of the way, both men and women, he might bring [them] bound to Jerusalem."},{"num":3,"verse":"But as he was journeying, it came to pass that he drew near to Damascus; and suddenly there shone round about him a light out of heaven,"},{"num":4,"verse":"and falling on the earth he heard a voice saying to him, Saul, Saul, why dost thou persecute me?"},{"num":5,"verse":"And he said, Who art thou, Lord? And he [said], *I* am Jesus, whom *thou* persecutest."},{"num":6,"verse":"But rise up and enter into the city, and it shall be told thee what thou must do."},{"num":7,"verse":"But the men who were travelling with him stood speechless, hearing the voice but beholding no one."},{"num":8,"verse":"And Saul rose up from the earth, and his eyes being opened he saw no one. But leading [him] by the hand they brought him into Damascus."},{"num":9,"verse":"And he was three days without seeing, and neither ate nor drank."},{"num":10,"verse":"And there was a certain disciple in Damascus by name Ananias. And the Lord said to him in a vision, Ananias. And he said, Behold, [here am] I, Lord."},{"num":11,"verse":"And the Lord [said] to him, Rise up and go into the street which is called Straight, and seek in the house of Judas one by name Saul, [he is] of Tarsus: for, behold, he is praying,"},{"num":12,"verse":"and has seen [in a vision] a man by name Ananias coming in and putting his hand on him, so that he should see."},{"num":13,"verse":"And Ananias answered, Lord, I have heard from many concerning this man how much evil he has done to thy saints at Jerusalem;"},{"num":14,"verse":"and here he has authority from the chief priests to bind all who call upon thy name."},{"num":15,"verse":"And the Lord said to him, Go, for this [man] is an elect vessel to me, to bear my name before both nations and kings and [the] sons of Israel:"},{"num":16,"verse":"for *I* will shew to him how much he must suffer for my name."},{"num":17,"verse":"And Ananias went and entered into the house; and laying his hands upon him he said, Saul, brother, the Lord has sent me, Jesus that appeared to thee in the way in which thou camest, that thou mightest see, and be filled with [the] Holy Spirit."},{"num":18,"verse":"And straightway there fell from his eyes as it were scales, and he saw, and rising up was baptised;"},{"num":19,"verse":"and, having received food, got strength. And he was with the disciples who [were] in Damascus certain days."},{"num":20,"verse":"And straightway in the synagogues he preached Jesus that *he* is the Son of God."},{"num":21,"verse":"And all who heard were astonished and said, Is not this *he* who destroyed in Jerusalem those who called on this name, and here was come for this purpose, that he might bring them bound to the chief priests?"},{"num":22,"verse":"But Saul increased the more in power, and confounded the Jews who dwelt in Damascus, proving that this is the Christ."},{"num":23,"verse":"Now when many days were fulfilled, the Jews consulted together to kill him."},{"num":24,"verse":"But their plot became known to Saul. And they watched also the gates both day and night, that they might kill him;"},{"num":25,"verse":"but the disciples took him by night and let him down through the wall, lowering him in a basket."},{"num":26,"verse":"And having arrived at Jerusalem he essayed to join himself to the disciples, and all were afraid of him, not believing that he was a disciple."},{"num":27,"verse":"But Barnabas took him and brought him to the apostles, and related to them how he had seen the Lord in the way, and that he had spoken to him, and how in Damascus he had spoken boldly in the name of Jesus."},{"num":28,"verse":"And he was with them coming in and going out at Jerusalem,"},{"num":29,"verse":"and speaking boldly in the name of the Lord. And he spoke and discussed with the Hellenists; but they sought to kill him."},{"num":30,"verse":"And the brethren knowing it, brought him down to Caesarea and sent him away to Tarsus."},{"num":31,"verse":"The assemblies then throughout the whole of Judaea and Galilee and Samaria had peace, being edified and walking in the fear of the Lord, and were increased through the comfort of the Holy Spirit."},{"num":32,"verse":"Now it came to pass that Peter, passing through all [quarters], descended also to the saints who inhabited Lydda."},{"num":33,"verse":"And he found there a certain man, Aeneas by name, who had been lying for eight years upon a couch, who was paralysed."},{"num":34,"verse":"And Peter said to him, Aeneas, Jesus, the Christ, heals thee: rise up, and make thy couch for thyself. And straightway he rose up."},{"num":35,"verse":"And all who inhabited Lydda and the Saron saw him, who turned to the Lord."},{"num":36,"verse":"And in Joppa there was a certain female disciple, by name Tabitha, which being interpreted means Dorcas. She was full of good works and alms-deeds which she did."},{"num":37,"verse":"And it came to pass in those days that she grew sick and died; and, having washed her, they put her in [the] upper room."},{"num":38,"verse":"But Lydda being near to Joppa, the disciples having heard that Peter was there, sent two men to him, beseeching him, Thou must not delay coming to us."},{"num":39,"verse":"And Peter rising up went with them, whom, when arrived, they brought up into the upper chamber; and all the widows stood by him weeping and shewing him the body-coats and garments which Dorcas had made while she was with them."},{"num":40,"verse":"But Peter, putting them all out, and kneeling down, prayed. And, turning to the body, he said, Tabitha, arise. And she opened her eyes, and, seeing Peter, sat up."},{"num":41,"verse":"And having given her [his] hand, he raised her up, and having called the saints and the widows, presented her living."},{"num":42,"verse":"And it became known throughout the whole of Joppa, and many believed on the Lord."},{"num":43,"verse":"And it came to pass that he remained many days in Joppa with a certain Simon, a tanner."}]