[{"header":"Chapter 9"},{"num":1,"verse":"Saul’s Conversion. Now Saul, still breathing murderous threats against the disciples of the Lord, went to the high priest "},{"num":2,"verse":"and asked him for letters to the synagogues in Damascus, that, if he should find any men or women who belonged to the Way, he might bring them back to Jerusalem in chains. "},{"num":3,"verse":"On his journey, as he was nearing Damascus, a light from the sky suddenly flashed around him. "},{"num":4,"verse":"He fell to the ground and heard a voice saying to him, “Saul, Saul, why are you persecuting me?” "},{"num":5,"verse":"He said, “Who are you, sir?” The reply came, “I am Jesus, whom you are persecuting. "},{"num":6,"verse":"Now get up and go into the city and you will be told what you must do.” "},{"num":7,"verse":"The men who were traveling with him stood speechless, for they heard the voice but could see no one. "},{"num":8,"verse":"Saul got up from the ground, but when he opened his eyes he could see nothing; so they led him by the hand and brought him to Damascus. "},{"num":9,"verse":"For three days he was unable to see, and he neither ate nor drank."},{"num":10,"verse":"Saul’s Baptism. There was a disciple in Damascus named Ananias, and the Lord said to him in a vision, “Ananias.” He answered, “Here I am, Lord.” "},{"num":11,"verse":"The Lord said to him, “Get up and go to the street called Straight and ask at the house of Judas for a man from Tarsus named Saul. He is there praying, "},{"num":12,"verse":"and [in a vision] he has seen a man named Ananias come in and lay [his] hands on him, that he may regain his sight.” "},{"num":13,"verse":"But Ananias replied, “Lord, I have heard from many sources about this man, what evil things he has done to your holy ones in Jerusalem. "},{"num":14,"verse":"And here he has authority from the chief priests to imprison all who call upon your name.” "},{"num":15,"verse":"But the Lord said to him, “Go, for this man is a chosen instrument of mine to carry my name before Gentiles, kings, and Israelites, "},{"num":16,"verse":"and I will show him what he will have to suffer for my name.” "},{"num":17,"verse":"So Ananias went and entered the house; laying his hands on him, he said, “Saul, my brother, the Lord has sent me, Jesus who appeared to you on the way by which you came, that you may regain your sight and be filled with the holy Spirit.” "},{"num":18,"verse":"Immediately things like scales fell from his eyes and he regained his sight. He got up and was baptized, "},{"num":19,"verse":"and when he had eaten, he recovered his strength."},{"num":20,"verse":"and he began at once to proclaim Jesus in the synagogues, that he is the Son of God. "},{"num":21,"verse":"All who heard him were astounded and said, “Is not this the man who in Jerusalem ravaged those who call upon this name, and came here expressly to take them back in chains to the chief priests?” "},{"num":22,"verse":"But Saul grew all the stronger and confounded [the] Jews who lived in Damascus, proving that this is the Messiah."},{"num":23,"verse":"Saul Visits Jerusalem. After a long time had passed, the Jews conspired to kill him, "},{"num":24,"verse":"but their plot became known to Saul. Now they were keeping watch on the gates day and night so as to kill him, "},{"num":25,"verse":"but his disciples took him one night and let him down through an opening in the wall, lowering him in a basket."},{"num":26,"verse":"When he arrived in Jerusalem he tried to join the disciples, but they were all afraid of him, not believing that he was a disciple. "},{"num":27,"verse":"Then Barnabas took charge of him and brought him to the apostles, and he reported to them how on the way he had seen the Lord and that he had spoken to him, and how in Damascus he had spoken out boldly in the name of Jesus. "},{"num":28,"verse":"He moved about freely with them in Jerusalem, and spoke out boldly in the name of the Lord. "},{"num":29,"verse":"He also spoke and debated with the Hellenists, but they tried to kill him. "},{"num":30,"verse":"And when the brothers learned of this, they took him down to Caesarea and sent him on his way to Tarsus."},{"num":31,"verse":"The Church at Peace. The church throughout all Judea, Galilee, and Samaria was at peace. It was being built up and walked in the fear of the Lord, and with the consolation of the holy Spirit it grew in numbers."},{"num":32,"verse":"Peter Heals Aeneas at Lydda. As Peter was passing through every region, he went down to the holy ones living in Lydda. "},{"num":33,"verse":"There he found a man named Aeneas, who had been confined to bed for eight years, for he was paralyzed. "},{"num":34,"verse":"Peter said to him, “Aeneas, Jesus Christ heals you. Get up and make your bed.” He got up at once. "},{"num":35,"verse":"And all the inhabitants of Lydda and Sharon saw him, and they turned to the Lord."},{"num":36,"verse":"Peter Restores Tabitha to Life. Now in Joppa there was a disciple named Tabitha (which translated means Dorcas). She was completely occupied with good deeds and almsgiving. "},{"num":37,"verse":"Now during those days she fell sick and died, so after washing her, they laid [her] out in a room upstairs. "},{"num":38,"verse":"Since Lydda was near Joppa, the disciples, hearing that Peter was there, sent two men to him with the request, “Please come to us without delay.” "},{"num":39,"verse":"So Peter got up and went with them. When he arrived, they took him to the room upstairs where all the widows came to him weeping and showing him the tunics and cloaks that Dorcas had made while she was with them. "},{"num":40,"verse":"Peter sent them all out and knelt down and prayed. Then he turned to her body and said, “Tabitha, rise up.” She opened her eyes, saw Peter, and sat up. "},{"num":41,"verse":"He gave her his hand and raised her up, and when he had called the holy ones and the widows, he presented her alive. "},{"num":42,"verse":"This became known all over Joppa, and many came to believe in the Lord. "},{"num":43,"verse":"And he stayed a long time in Joppa with Simon, a tanner."}]