[{"header":"Saul Is Converted"},{"num":9,"verse":"In Jerusalem Saul was still threatening the followers of the Lord by saying he would kill them. So he went to the high priest "},{"num":2,"verse":"and asked him to write letters to the synagogues in the city of Damascus. Then if Saul found any followers of Christ’s Way, men or women, he would arrest them and bring them back to Jerusalem."},{"num":3,"verse":"So Saul headed toward Damascus. As he came near the city, a bright light from heaven suddenly flashed around him. "},{"num":4,"verse":"Saul fell to the ground and heard a voice saying to him, “Saul, Saul! Why are you persecuting me?”"},{"num":5,"verse":"Saul said, “Who are you, Lord?”"},{"num":7,"verse":"The people traveling with Saul stood there but said nothing. They heard the voice, but they saw no one. "},{"num":8,"verse":"Saul got up from the ground and opened his eyes, but he could not see. So those with Saul took his hand and led him into Damascus. "},{"num":9,"verse":"For three days Saul could not see and did not eat or drink."},{"num":10,"verse":"There was a follower of Jesus in Damascus named Ananias. The Lord spoke to Ananias in a vision, “Ananias!”"},{"num":11,"verse":"The Lord said to him, “Get up and go to Straight Street. Find the house of Judas, and ask for a man named Saul from the city of Tarsus. He is there now, praying. "},{"num":13,"verse":"But Ananias answered, “Lord, many people have told me about this man and the terrible things he did to your holy people in Jerusalem. "},{"num":14,"verse":"Now he has come here to Damascus, and the leading priests have given him the power to arrest everyone who worships you.”"},{"num":15,"verse":"But the Lord said to Ananias, “Go! I have chosen Saul for an important work. He must tell about me to those who are not Jews, to kings, and to the people of Israel. "},{"num":17,"verse":"So Ananias went to the house of Judas. He laid his hands on Saul and said, “Brother Saul, the Lord Jesus sent me. He is the one you saw on the road on your way here. He sent me so that you can see again and be filled with the Holy Spirit.” "},{"num":18,"verse":"Immediately, something that looked like fish scales fell from Saul’s eyes, and he was able to see again! Then Saul got up and was baptized. "},{"num":19,"verse":"After he ate some food, his strength returned."},{"header":"Saul Preaches in Damascus"},{"num":20,"verse":"Soon he began to preach about Jesus in the synagogues, saying, “Jesus is the Son of God.”"},{"num":21,"verse":"All the people who heard him were amazed. They said, “This is the man who was in Jerusalem trying to destroy those who trust in this name! He came here to arrest the followers of Jesus and take them back to the leading priests.”"},{"num":22,"verse":"But Saul grew more powerful. His proofs that Jesus is the Christ were so strong that his own people in Damascus could not argue with him."},{"num":23,"verse":"After many days, they made plans to kill Saul. "},{"num":24,"verse":"They were watching the city gates day and night, but Saul learned about their plan. "},{"num":25,"verse":"One night some followers of Saul helped him leave the city by lowering him in a basket through an opening in the city wall."},{"header":"Saul Preaches in Jerusalem"},{"num":26,"verse":"When Saul went to Jerusalem, he tried to join the group of followers, but they were all afraid of him. They did not believe he was really a follower. "},{"num":27,"verse":"But Barnabas accepted Saul and took him to the apostles. Barnabas explained to them that Saul had seen the Lord on the road and the Lord had spoken to Saul. Then he told them how boldly Saul had preached in the name of Jesus in Damascus."},{"num":28,"verse":"And so Saul stayed with the followers, going everywhere in Jerusalem, preaching boldly in the name of the Lord. "},{"num":29,"verse":"He would often talk and argue with the Jewish people who spoke Greek, but they were trying to kill him. "},{"num":30,"verse":"When the followers learned about this, they took Saul to Caesarea and from there sent him to Tarsus."},{"num":31,"verse":"The church everywhere in Judea, Galilee, and Samaria had a time of peace and became stronger. Respecting the Lord by the way they lived, and being encouraged by the Holy Spirit, the group of believers continued to grow."},{"header":"Peter Heals Aeneas"},{"num":32,"verse":"As Peter was traveling through all the area, he visited God’s people who lived in Lydda. "},{"num":33,"verse":"There he met a man named Aeneas, who was paralyzed and had not been able to leave his bed for the past eight years. "},{"num":34,"verse":"Peter said to him, “Aeneas, Jesus Christ heals you. Stand up and make your bed.” Aeneas stood up immediately. "},{"num":35,"verse":"All the people living in Lydda and on the Plain of Sharon saw him and turned to the Lord."},{"header":"Peter Heals Tabitha"},{"num":36,"verse":"In the city of Joppa there was a follower named Tabitha (whose Greek name was Dorcas). She was always doing good deeds and kind acts. "},{"num":37,"verse":"While Peter was in Lydda, Tabitha became sick and died. Her body was washed and put in a room upstairs. "},{"num":38,"verse":"Since Lydda is near Joppa and the followers in Joppa heard that Peter was in Lydda, they sent two messengers to Peter. They begged him, “Hurry, please come to us!” "},{"num":39,"verse":"So Peter got ready and went with them. When he arrived, they took him to the upstairs room where all the widows stood around Peter, crying. They showed him the shirts and coats Tabitha had made when she was still alive. "},{"num":40,"verse":"Peter sent everyone out of the room and kneeled and prayed. Then he turned to the body and said, “Tabitha, stand up.” She opened her eyes, and when she saw Peter, she sat up. "},{"num":41,"verse":"He gave her his hand and helped her up. Then he called the saints and the widows into the room and showed them that Tabitha was alive. "},{"num":42,"verse":"People everywhere in Joppa learned about this, and many believed in the Lord. "},{"num":43,"verse":"Peter stayed in Joppa for many days with a man named Simon who was a tanner."}]