[{"header":"The crisis for Saul"},{"num":1,"verse":"But Saul, still breathing murderous threats against the disciples of the Lord, went to the High Priest and begged him for letters to the synagogues in Damascus, so that if he should find there any followers of the Way, whether men or women, he could bring them back to Jerusalem as prisoners."},{"num":3,"verse":"But on his journey, as he neared Damascus, a light from Heaven suddenly blazed around him, and he fell to the ground. Then he heard a voice speaking to him, “Saul, Saul, why are you persecuting me?”"},{"num":5,"verse":"“Who are you, Lord?” he asked."},{"num":6,"verse":"“I am Jesus whom you are persecuting,” was the reply. “But now stand up and go into the city and there you will be told what you must do.”"},{"num":7,"verse":"His companions on the journey stood there speechless, for they had heard the voice but could see no one. Saul got up from the ground, but when he opened his eyes he could see nothing. So they took him by the hand and led him into Damascus. There he remained sightless for three days, and during that time he had nothing either to eat or drink."},{"header":"God’s preparation for the converted Saul"},{"num":10,"verse":"Now in Damascus there was a disciple by the name of Ananias. The Lord spoke to this man in a dream. calling him by his name. “I am here, Lord,” he replied."},{"num":11,"verse":"Then the Lord said to him, “Get up and go down to the street called Straight, and enquire at the house of Judas for a man named Saul from Tarsus. At this moment he is praying and he sees in his mind’s eye a man by the name of Ananias coming into the house, and placing his hands upon him to restore his sight.”"},{"num":13,"verse":"But Ananias replied, “Lord, I have heard on all hands about this man and how much harm he has done to your holy people in Jerusalem! Why even now he holds powers from the chief priests to arrest all who call upon your name.”"},{"num":15,"verse":"But the Lord said to him, “Go on your way, for this man is my chosen instrument to bear my name before the Gentiles and their kings, as well as to the sons of Israel. Indeed, I myself will show him what he must suffer for the sake of my name.”"},{"num":17,"verse":"Then Ananias set out and went to the house, and there he laid his hands upon Saul, and said, “Saul, brother, the Lord has sent me—Jesus who appeared to you on your journey here—so that you may recover your sight and be filled with the Holy Spirit.”"},{"num":18,"verse":"Immediately something like scales fell from Saul’s eyes, and he could see again. He got to his feet and was baptised. Then he took some food and regained his strength."},{"header":"Saul’s conversion astounds the disciples"},{"num":19,"verse":"Saul stayed with the disciples in Damascus for some time. Without delay he proclaimed Jesus in the synagogues declaring that he is the Son of God. All his hearers were staggered and kept saying, “Isn’t this the man who so bitterly persecuted those who called on the name in Jerusalem, and came down here with the sole object of taking back all such people as prisoners before the chief priests?”"},{"num":22,"verse":"But Saul went on from strength to strength, reducing to confusion the Jews who lived at Damascus by proving beyond doubt that this man is Christ."},{"header":"The long revenge on the “renegade” begins"},{"num":23,"verse":"After some time the Jews made a plot to kill Saul, but news of this came to his ears. Although in their murderous scheme the Jews watched the gates day and night for him, Saul’s disciples took him one night and let him down through an opening in the wall by lowering him in a basket."},{"header":"At Jerusalem Saul is suspect: Barnabas conciliates"},{"num":26,"verse":"When Saul reached Jerusalem, he tried to join the disciples. But they were all afraid of him, finding it impossible to believe that he was a disciple. Barnabas, however, took him by the hand and introduced him to the apostles, and explained to them how he had seen the Lord on his journey, and how the Lord had spoken to him. He further explained how Saul had spoken in Damascus with the utmost boldness in the name of Jesus. After that Saul joined with them in all their activities in Jerusalem, preaching fearlessly in the name of the Lord. He used to talk and argue with the Greek-speaking Jews, but they made several attempts on his life. When the brothers realised this they took him down to Caesarea and sent him off to Tarsus."},{"header":"A time of peace"},{"num":31,"verse":"The whole Church throughout Judea, Galilee and Samaria now enjoyed a period of peace. It became established and as it went forward in reverence for the Lord and in the strengthening presence of the Holy spirit, continued to grow in numbers."},{"header":"Peter heals at Lydda"},{"num":32,"verse":"Now it happened that Peter, in the course of travelling about among them all, came to God’s people living at Lydda. There he found a man called Aeneas who had been bed-ridden for eight years through paralysis. Peter said to him “Aeneas, Jesus Christ heals you! Get up and make your bed.”"},{"num":35,"verse":"He got to his feet at once. And all those who lived in Lydda and Sharon saw him and turned to the Lord."},{"header":"And again at Joppa"},{"num":36,"verse":"Then there was a woman in Joppa, a disciple called Tabitha, whose name in Greek was Dorcas (meaning Gazelle). She was a woman whose whole life was full of good and kindly actions, but in those days she became seriously ill and died. So when they had washed her body they laid her in an upper room. Now Lydda is quite near Joppa, and when the disciples heard that Peter was in Lydda, they sent two men to him and begged him, “Please come to us without delay.”"},{"num":39,"verse":"Peter got up and went back with them, and when he arrived in Joppa they took him to the room upstairs. All the widows stood around him with tears in their eyes, holding out for him to see dresses and cloaks which Dorcas used to make for them while she was with them. But Peter put them all outside the room and knelt down and prayed. Then he turned to the body and said, “Tabitha, get up!”"},{"num":40,"verse":"She opened her eyes, and as soon as she saw Peter she sat up. He took her by the hand, helped her to her feet, and then called out to the believers and widows and presented her to them alive."},{"num":42,"verse":"This became known throughout the whole of Joppa and many believed in the Lord. Peter himself remained there for some time, staying with a tanner called Simon."}]