[{"num":95,"verse":"Come ye, make ye full out joy to the Lord; heartily sing we to God, our health. (Come ye, rejoice ye before the Lord; sing we heartily to God, our salvation/sing we heartily to God, our deliverer.)"},{"num":2,"verse":"Before-occupy we his face in acknowledging; and heartily sing we to him in psalms. (Let us come before him with thanksgiving; and sing we heartily to him with songs.)"},{"num":3,"verse":"For God is a great Lord, and a great King above all gods; for the Lord shall not put away his people."},{"num":4,"verse":"For all the ends of [the] earth be in his hand; and the highness, [(or) the heights,] of (the) hills be his."},{"num":5,"verse":"For the sea is his, and he made it; and his hands formed the dry land."},{"num":6,"verse":"Come ye, praise we, and fall we down before God; weep we before the Lord that made us; (Come ye, praise we, and fall we down before God; let us kneel before the Lord who made us;)"},{"num":7,"verse":"for he is our Lord God. And we be the people of his pasture; and the sheep of his hand. If ye have heard his voice today; (for he is the Lord our God. And we be the people of his pasture; and the sheep of his hand. If ye will but listen to his voice today;)"},{"num":8,"verse":"do not ye make hard your hearts. As in the stirring to wrath; by the day of temptation in desert. (yea, do not ye make your hearts stubborn; like they were at Meribah, and like that time at Massah, in the wilderness.)"},{"num":9,"verse":"Where your fathers tempted me; they proved and saw my works. (When your forefathers tempted me; they proved, or tested, me, and saw my works.)"},{"num":10,"verse":"Forty years I was offended to this generation; and I said, Ever[more] they err in heart. And these men knew not my ways; (For forty years I was offended by that generation; and I said, They err in their hearts forevermore. And these people do not know my ways;)"},{"num":11,"verse":"to whom I swore in mine ire, they shall not enter into my rest. (and so I swore to them in my anger, that they would not enter into my rest.)"}]