[{"header":"Paul’s Apostolic Ministry"},{"num":4,"verse":"Therefore, since we have this ministry, just as we received mercy [from God, granting us salvation, opportunities, and blessings], we do not get discouraged nor lose our motivation. "},{"num":2,"verse":"But we have renounced the disgraceful things hidden because of shame; not walking in trickery or adulterating the word of God, but by stating the truth [openly and plainly], we commend ourselves to everyone’s conscience in the sight of God. "},{"num":3,"verse":"But even if our gospel is [in some sense] hidden [behind a veil], it is hidden [only] to those who are perishing; "},{"num":4,"verse":"among them the god of this world [Satan] has blinded the minds of the unbelieving to prevent them from seeing the illuminating light of the gospel of the glory of Christ, who is the image of God. "},{"num":5,"verse":"For we do not preach ourselves, but Jesus Christ as Lord, and ourselves [merely] as your bond-servants for Jesus’ sake. "},{"num":6,"verse":"For God, who said, “Let light shine out of darkness,” is the One who has shone in our hearts to give us the Light of the knowledge of the glory and majesty of God [clearly revealed] in the face of Christ."},{"num":7,"verse":"But we have this precious treasure [the good news about salvation] in [unworthy] earthen vessels [of human frailty], so that the grandeur and surpassing greatness of the power will be [shown to be] from God [His sufficiency] and not from ourselves. "},{"num":8,"verse":"We are pressured in every way [hedged in], but not crushed; perplexed [unsure of finding a way out], but not driven to despair; "},{"num":9,"verse":"hunted down and persecuted, but not deserted [to stand alone]; struck down, but never destroyed; "},{"num":10,"verse":"always carrying around in the body the dying of Jesus, so that the [resurrection] life of Jesus also may be shown in our body. "},{"num":11,"verse":"For we who live are constantly [experiencing the threat of] being handed over to death for Jesus’ sake, so that the [resurrection] life of Jesus also may be evidenced in our mortal body [which is subject to death]. "},{"num":12,"verse":"So physical death is [actively] at work in us, but [spiritual] life [is actively at work] in you."},{"num":13,"verse":"Yet we have the same spirit of faith as he had, who wrote in Scripture, “I believed, therefore I spoke.” We also believe, therefore we also speak, "},{"num":14,"verse":"knowing that He who raised the Lord Jesus will also raise us with Jesus and will present us [along] with you in His presence. "},{"num":15,"verse":"For all [these] things are for your sake, so that as [God’s remarkable, undeserved] grace reaches to more and more people it may increase thanksgiving, to the glory of [our great] God."},{"num":16,"verse":"Therefore we do not become discouraged [spiritless, disappointed, or afraid]. Though our outer self is [progressively] wasting away, yet our inner self is being [progressively] renewed day by day. "},{"num":17,"verse":"For our momentary, light distress [this passing trouble] is producing for us an eternal weight of glory [a fullness] beyond all measure [surpassing all comparisons, a transcendent splendor and an endless blessedness]! "},{"num":18,"verse":"So we look not at the things which are seen, but at the things which are unseen; for the things which are visible are temporal [just brief and fleeting], but the things which are invisible are everlasting and imperishable."}]