[{"header":"Spiritual Treasure in Clay Pots"},{"num":4,"verse":"God in his mercy has given us this work to do, and so we do not become discouraged. "},{"num":2,"verse":"We put aside all secret and shameful deeds; we do not act with deceit, nor do we falsify the word of God. In the full light of truth we live in God's sight and try to commend ourselves to everyone's good conscience. "},{"num":3,"verse":"For if the gospel we preach is hidden, it is hidden only from those who are being lost. "},{"num":4,"verse":"They do not believe, because their minds have been kept in the dark by the evil god of this world. He keeps them from seeing the light shining on them, the light that comes from the Good News about the glory of Christ, who is the exact likeness of God. "},{"num":5,"verse":"For it is not ourselves that we preach; we preach Jesus Christ as Lord, and ourselves as your servants for Jesus' sake. "},{"num":6,"verse":"The God who said, “Out of darkness the light shall shine!” is the same God who made his light shine in our hearts, to bring us the knowledge of God's glory shining in the face of Christ."},{"num":7,"verse":"Yet we who have this spiritual treasure are like common clay pots, in order to show that the supreme power belongs to God, not to us. "},{"num":8,"verse":"We are often troubled, but not crushed; sometimes in doubt, but never in despair; "},{"num":9,"verse":"there are many enemies, but we are never without a friend; and though badly hurt at times, we are not destroyed. "},{"num":10,"verse":"At all times we carry in our mortal bodies the death of Jesus, so that his life also may be seen in our bodies. "},{"num":11,"verse":"Throughout our lives we are always in danger of death for Jesus' sake, in order that his life may be seen in this mortal body of ours. "},{"num":12,"verse":"This means that death is at work in us, but life is at work in you."},{"num":13,"verse":"The scripture says, “I spoke because I believed.” In the same spirit of faith we also speak because we believe. "},{"num":14,"verse":"We know that God, who raised the Lord Jesus to life, will also raise us up with Jesus and take us, together with you, into his presence. "},{"num":15,"verse":"All this is for your sake; and as God's grace reaches more and more people, they will offer to the glory of God more prayers of thanksgiving."},{"header":"Living by Faith"},{"num":16,"verse":"For this reason we never become discouraged. Even though our physical being is gradually decaying, yet our spiritual being is renewed day after day. "},{"num":17,"verse":"And this small and temporary trouble we suffer will bring us a tremendous and eternal glory, much greater than the trouble. "},{"num":18,"verse":"For we fix our attention, not on things that are seen, but on things that are unseen. What can be seen lasts only for a time, but what cannot be seen lasts forever."}]