[{"num":4,"verse":"¶ Therefore seeing we have this ministry, according to the mercy we have received, we fault not,"},{"num":2,"verse":"but remove from ourselves every hidden shameful thing, not walking in craftiness, nor adulterating the word of God, but in the manifestation of the truth, commending ourselves to every man’s conscience in the sight of God."},{"num":3,"verse":"But if our gospel is hid, it is hid to those that are lost,"},{"num":4,"verse":"In whom the god of this age has blinded the understanding of those who do not believe, that the light of the gospel of the glory of the Christ, who is the image of God, should not shine in them."},{"num":5,"verse":"For we preach not ourselves, but Christ Jesus the Lord, and ourselves your slaves for Jesus’ sake."},{"num":6,"verse":"For the God, who commanded the light to shine out of darkness, has shined in our hearts to bring forth the light of the knowledge of the clarity of God in the face of Jesus Christ."},{"num":7,"verse":"But we have this treasure in clay vessels that the excellency of the virtue may be of God, and not of us."},{"num":8,"verse":"¶ We are troubled on every side, yet not distressed; we are unsure of our lives, but not in despair;"},{"num":9,"verse":"persecuted, but not forsaken; cast down, but not destroyed;"},{"num":10,"verse":"always bearing about in the body the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body."},{"num":11,"verse":"For we who live are always delivered unto death for Jesus’ sake that the life also of Jesus might be made manifest in our mortal flesh."},{"num":12,"verse":"So then death works in us, but life in you."},{"num":13,"verse":"We having the same Spirit of faith, according as it is written, I believed and, therefore, I have spoken; we also believe and, therefore, speak;"},{"num":14,"verse":"knowing that he who raised up the Lord Jesus shall raise us up also by Jesus and shall present us with you."},{"num":15,"verse":"For we suffer all these things for your sakes that the grace abounding through many may in the thanksgiving redound to the glory of God."},{"num":16,"verse":"Therefore we fault not; but though our outward man is wearing out, yet the inward man is renewed day by day."},{"num":17,"verse":"For our tribulation, which is momentary and light, prepares an exceeding and eternal weight of glory unto us;"},{"num":18,"verse":"while we look not at the things which are seen, but at the things which are not seen, for the things which are seen are temporal, but the things which are not seen are eternal."}]