[{"header":"Paul Is Faithful in Preaching the Good News"},{"num":4,"verse":"Through God’s loving-kindness, He has given us this job to do. So we do not give up. "},{"num":2,"verse":"We have put away all things that are done in secret and in shame. We do not play with the Word of God or use it in a false way. Because we are telling the truth, we want men’s hearts to listen to us. God knows our desires. "},{"num":3,"verse":"If the Good News we preach is hidden, it is hidden to those who are lost in sin. "},{"num":4,"verse":"The eyes of those who do not believe are made blind by Satan who is the god of this world. He does not want the light of the Good News to shine in their hearts. This Good News shines as the shining-greatness of Christ. Christ is as God is. "},{"num":5,"verse":"We do not preach about ourselves. We preach Christ Jesus the Lord. We are your servants because of Jesus. "},{"num":6,"verse":"It was God Who said, “The light will shine in darkness.”  He is the One Who made His light shine in our hearts. This brings us the light of knowing God’s shining-greatness which is seen in Christ’s face."},{"num":7,"verse":"We have this light from God in our human bodies. This shows that the power is from God. It is not from ourselves. "},{"num":8,"verse":"We are pressed on every side, but we still have room to move. We are often in much trouble, but we never give up. "},{"num":9,"verse":"People make it hard for us, but we are not left alone. We are knocked down, but we are not destroyed. "},{"num":10,"verse":"We carry marks on our bodies that show the death of Jesus. This is how Jesus makes His life seen in our bodies. "},{"num":11,"verse":"Every day of our life we face death because of Jesus. In this way, His life is seen in our bodies. "},{"num":12,"verse":"Death is working in us because we work for the Lord, but His life is working in you."},{"num":13,"verse":"The Holy Writings say, “I believed, so I spoke.”  We have the same kind of faith as David had. We also believe, so we speak. "},{"num":14,"verse":"We know that God raised the Lord Jesus from the dead. He will raise us up also. God will take us to Himself and He will take you. "},{"num":15,"verse":"These things happened for your good. As more people receive God’s favor, they will give thanks for the shining-greatness of God."},{"header":"Life Now—Life in Heaven"},{"num":16,"verse":"This is the reason we do not give up. Our human body is wearing out. But our spirits are getting stronger every day. "},{"num":17,"verse":"The little troubles we suffer now for a short time are making us ready for the great things God is going to give us forever. "},{"num":18,"verse":"We do not look at the things that can be seen. We look at the things that cannot be seen. The things that can be seen will come to an end. But the things that cannot be seen will last forever."}]