[{"num":5,"verse":"“Anyone refusing to give testimony concerning what he knows about a crime is guilty."},{"num":2,"verse":"“Anyone touching anything ceremonially unclean—such as the dead body of an animal forbidden for food, wild or domesticated, or the dead body of some forbidden insect—is guilty, even though he wasn’t aware of touching it. "},{"num":3,"verse":"Or if he touches human discharge of any kind, he becomes guilty as soon as he realizes that he has touched it."},{"num":4,"verse":"“If anyone makes a rash vow, whether the vow is good or bad, when he realizes what a foolish vow he has taken, he is guilty."},{"num":5,"verse":"“In any of these cases, he shall confess his sin "},{"num":6,"verse":"and bring his guilt offering to the Lord, a female lamb or goat, and the priest shall make atonement for him, and he shall be freed from his sin, and need not fulfill the vow."},{"num":7,"verse":"“If he is too poor to bring a lamb to the Lord, then he shall bring two turtledoves or two young pigeons as his guilt offering; one of the birds shall be his sin offering and the other his burnt offering. "},{"num":8,"verse":"The priest shall offer as the sin sacrifice whichever bird is handed to him first, breaking its neck, but not severing its head from its body. "},{"num":9,"verse":"Then he shall sprinkle some of the blood at the side of the altar and the rest shall be drained out at the base of the altar; this is the sin offering. "},{"num":10,"verse":"He shall offer the second bird as a burnt offering, following the customary procedures that have been set forth; so the priest shall make atonement for him concerning his sin, and he shall be forgiven."},{"num":11,"verse":"“If he is too poor to bring turtledoves or young pigeons as his sin offering, then he shall bring a tenth of a bushel of fine flour. He must not mix it with olive oil or put any incense on it because it is a sin offering. "},{"num":12,"verse":"He shall bring it to the priest, and the priest shall take out a handful as a representative portion and burn it on the altar just as any other offering to Jehovah made by fire; this shall be his sin offering. "},{"num":13,"verse":"In this way the priest shall make atonement for him for any sin of this kind, and he shall be forgiven. The rest of the flour shall belong to the priest, just as was the case with the grain offering.”"},{"num":14,"verse":"And the Lord said to Moses, "},{"num":15,"verse":"“If anyone sins by unintentionally defiling what is holy, then he shall bring a ram without defect, worth whatever fine you charge against him, as his guilt offering to the Lord. "},{"num":16,"verse":"And he shall make restitution for the holy thing he has defiled, or the tithe omitted, by paying for the loss, plus a 20 percent penalty; he shall bring it to the priest, and the priest shall make atonement for him with the ram of the guilt offering, and he shall be forgiven."},{"num":17,"verse":"“Anyone who disobeys some law of God without realizing it is guilty anyway, and must bring his sacrifice of a value determined by Moses. This sacrifice shall be a ram without blemish taken to the priest as a guilt offering; with it the priest shall make atonement for him, so that he will be forgiven for whatever it is he has done without realizing it. "},{"num":19,"verse":"It must be offered as a guilt offering, for he is certainly guilty before the Lord.”"}]