[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Making him very glad.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The memory, or rather the thought of that day, the joy of father and another when their child was born (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 16:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was wanted, as in the irony of destiny, to add the keenest pang to the misery of the present. The “sorrow’s crown of sorrow” was found in remembering happier days. We note the same tenderness turned to bitterness as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The day of his birth was to him a day of darkness and not of light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 20:15-18. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 20:15-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cursed be the man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As in the forms of rejoicing upon a birth-day they blessed every person and thing concerned in the birth, and said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed be the womb that bare thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the like, and he that brought the joyful news was always rewarded, so in the forms of sorrow for the miserable they used quite the contrary expressions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let that man be as the cities, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Namely, Sodom and Gomorrah; let him be looked upon as a sad spectacle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let him hear the cry in the morning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — By these expressions he means the cries, shouts, and noises that enemies make when they break in upon a place in a hostile manner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because he slew me not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because I was not slain; from the womb. Wherefore came I forth to see ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, to experience; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "labour and sorrow? —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seeing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "being frequently put to express any sensation. As if the prophet had said, “I speak thus in the bitterness of my soul; when I consider how much better it would have been that I had never been born, or that I had given up the ghost immediately on my birth, than to lead a life of continual sorrow and misery.” These various expressions show us to what a height the tide of perturbation swelled at this time in this good man’s heart, and what need we have to pray to be delivered from the power of our own passions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:14-18 When grace has the victory, it is good to be ashamed of our folly, to admire the goodness of God, and be warned to guard our spirits another time. See how strong the temptation was, over which the prophet got the victory by Divine assistance! He is angry that his first breath was not his last. While we remember that these wishes are not recorded for us to utter the like, we may learn good lessons from them. See how much those who think they stand, ought to take heed lest they fall, and to pray daily, Lead us not into temptation. How frail, changeable, and sinful is man! How foolish and unnatural are the thoughts and wishes of our hearts, when we yield to discontent! Let us consider Him who endured the contradiction of sinners against himself, lest we should be at any time weary and faint in our minds under our lesser trials.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sense of this expression in Job is plain. He wished there never had been such a day, and then he would not have been born. It is impossible to vindicate these expressions in Job and Jeremiah, unless it be on the supposition that it is highly worked poetic language, caused by sorrow so acute that it could not be expressed in prose. We are to remember, however, if this seems to us inconsistent with the existence of true piety, that Job had far less light than we have; that he lived at an early period of the world, when the views of the divine government were obscure, and that he was not sustained by the hopes and promises which the Christian possesses now. What light he had was probably that of tradition, and of the result of careful observation on the course of events. His topics of consolation must have been comparatively few. He had few or no promises to sustain him. He had not had before him, as we have, the example of the patient Redeemer. His faith was not sustained by those strong assurances which we have of the perfect rectitude of the divine government. Before we blame him too severely, we must place ourselves in imagination in his circumstances, and ask what our piety would have done under the trials which afflicted \"him.\" Yet with all allowances, it is not possible to vindicate this language; and while we cannot but admire its force and sublimity, and its unequalled power and boldness in expressing strong passion, we at the same time feel that there was a lack of proper submission and patience. - It is the impassioned language of a man who felt that he could bear no more; and there can be no doubt that it gave to Satan the hope of his anticipated triumph.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the night in which it was said - Dr. Good renders this, \"And the night which shouted.\" Noyes, \"And the night which said.\" So Gesenius and Rosenmuller, \"Perish the night which said, a man child is conceived.\" The Vulgate renders it, \"The night in which it was said;\" the Septuagint, \"That night in which they said.\" The Chaldee paraphrases the verse, \"Perish the day in which I was born, and the angel who presided ever my conception.\" Scott, quoted by Good, translates it, \"The night which hailed the new-born man.\" The language throughout this imprecation is that in which the night is \"personified,\" and addressed as if it were made glad by the birth of a son. So Schultens says, \"Inducitur enim \"Nox illa quasi conscia mysterii, et exultans ob spem prolis virilis.\" Such personifications of day and night are common among the Arabs; see Schultens. It is a representation of day and night as \"sympathizing with the joys and sorrows of mankind, and is in the truest vein of Oriental poetry.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is a man child conceived - Hebrew גבר  geber - \"a man;\" compare John 16:21. The word \"conceived\" Dr. Good renders \"brought forth\" So Herder translates it. The Septuagint, Ἰδοὺ ἄρσεν  Idou arsen - \"lo, a male\" The common translation expresses the true sense of the original. The joy at the birth of a male in Oriental countries is much greater than that at the birth of a female. A remarkable instance of an imprecation on the day of one's birth is found in a Muslim book of modern times, in which the expressions are almost precisely the same as in Job. \"Malek er Nasser Daub, prince of some tribes in Palestine, from which however he had been driven, after many adverse fortunes, died in a village near Damascus in the year 1258. When the crusaders had desolated his country, he deplored its misfortunes and his own in a poem, from which Abulfeda (Annals, p. 560) has quoted the following passage: 'O that my mother had remained unmarried all the days of her life! That God had determined no lord or consort for her! O that when he had destined her to an excellent, mild, and wise prince, she had been one of those whom he had created barren; that she might never have known the happy intelligence that she had born a man or woman! Or that when she had carried me under her heart, I had lost my life at my birth; and if I had been born, and had seen the light, that, when the congratulating people hastened on their camels, I had been gathered to my fathers.'\" The Greeks and the Romans had their unlucky days (ἡμέραι ἀποφρύδες  hēmerai apofrudes \"dies infausti\"); that is, days which were unpropitious, or in which they expected no success in any enterprise or any enjoyment. Tacitus (Annals, xiv. 12) mentions that the Roman Senate, for the purpose of flattering Nero, decreed that the birthday of Agrippina should be regarded as an accursed day; ut dies natalis Agrippinae inter nefastos esset. See Rosenmuller, All. u. neue Morgenland, \"in loc\" Expressions also similar to those before us, occur in Ovid, particularly in the following passage, \"Epist. ad Ibin:\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There is a man child conceived - Hebrew גבר  geber - \"a man;\" compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 16:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word \"conceived\" Dr. Good renders \"brought forth\" So Herder translates it. The Septuagint, Ἰδοὺ ἄρσεν  Idou arsen - \"lo, a male\" The common translation expresses the true sense of the original. The joy at the birth of a male in Oriental countries is much greater than that at the birth of a female. A remarkable instance of an imprecation on the day of one's birth is found in a Muslim book of modern times, in which the expressions are almost precisely the same as in Job. \"Malek er Nasser Daub, prince of some tribes in Palestine, from which however he had been driven, after many adverse fortunes, died in a village near Damascus in the year 1258. When the crusaders had desolated his country, he deplored its misfortunes and his own in a poem, from which Abulfeda (Annals, p. 560) has quoted the following passage: 'O that my mother had remained unmarried all the days of her life! That God had determined no lord or consort for her! O that when he had destined her to an excellent, mild, and wise prince, she had been one of those whom he had created barren; that she might never have known the happy intelligence that she had born a man or woman! Or that when she had carried me under her heart, I had lost my life at my birth; and if I had been born, and had seen the light, that, when the congratulating people hastened on their camels, I had been gathered to my fathers.'\" The Greeks and the Romans had their unlucky days (ἡμέραι ἀποφρύδες  hēmerai apofrudes \"dies infausti\"); that is, days which were unpropitious, or in which they expected no success in any enterprise or any enjoyment. Tacitus (Annals, xiv. 12) mentions that the Roman Senate, for the purpose of flattering Nero, decreed that the birthday of Agrippina should be regarded as an accursed day; ut dies natalis Agrippinae inter nefastos esset. See Rosenmuller, All. u. neue Morgenland, \"in loc\" Expressions also similar to those before us, occur in Ovid, particularly in the following passage, \"Epist. ad Ibin:\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Natus es infelix (ita Dii voluere), nec ulla",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Commoda nascenti stella, levisve fuit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lux quoque natalis, ne quid nisi tristo videres,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Turpis, et inductis nubibus atra fuit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sedit in adverso nocturnas culmine bubo,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Funereoque graves edidit ore sonos.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have now similar days, which by common superstition are regarded as unlucky or inauspicious. The wish of Job seems to be, that the day of his birth might be regarded as one of those days. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We have now similar days, which by common superstition are regarded as unlucky or inauspicious. The wish of Job seems to be, that the day of his birth might be regarded as one of those days. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. A man child—The birth of a son is in the East a special subject of joy; whereas that of a daughter is often not so.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Parents are usually rejoiced when a son is born to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Cursed be the man who brought tidings to my father,.... The word signifies commonly good tidings, as the news of a child born, and especially a man child, is to its parent. The Septuagint use the same word the angel did, when he brought the tidings of the birth of Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was still more foolish and sinful, to curse the man that carried the tidings of his birth to his father; who did a right thing, and what was acceptable, and perhaps might be a good man. Kimchi observes, that there are some that say, it was known to Jeremiah that this man was Pashur, the son of Immer, and therefore he cursed him; but this is without any foundation; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, a man child is born unto thee, making him very glad; as the birth of a man child usually makes glad its parent, whether father or mother; see John 16:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying, a man child is born unto thee, making him very glad; as the birth of a man child usually makes glad its parent, whether father or mother; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 16:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Cursed be the man who brought tidings to my father, saying, A man child is born unto thee; making him very glad.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “No man of course can curse his father or his mother, so Jeremiah curses the messenger, who brought the joyful news from the women’s quarters.” Du.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jeremiah 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the curse on the man that brought the father the news of the birth, the stress lies on the clause, \"who made him very glad,\" which goes to strengthen בּשּׂר, εὐαγγελίζεσθαι, a clause which is subordinated to the principal clause without any grammatical connection (cf. Ew. 341, b). The joy that man gave the father by his news is become to the son a source of bitter grief.",
        "children": []
      }
    ]
  }
]