[[],[{"type":"header","content":"Descendants of Issachar"},{"type":"prose","content":"The sons of Issachar were: Tola, Puah, Jashub, and Shimron—four . "}],[{"type":"prose","content":"The sons of Tola: Uzzi, Rephaiah, Jeriel, Jahmai, Ibsam, and Samuel, heads of their fathers’ households.  of Tola were courageous men in their generations; their number in the days of David was 22,600. "}],[{"type":"prose","content":"The son of Uzzi: Izrahiah. The sons of Izrahiah: Michael, Obadiah, Joel, Isshiah; all five of them were chief men. "}],[{"type":"prose","content":"With them by their generations according to their fathers’ households were 36,000 troops of the army for war, for they had many wives and children. "}],[{"type":"prose","content":"Their relatives among all the families of Issachar, courageous men, registered by genealogies, were 87,000 in all."},{"type":"header","content":"Descendants of Benjamin"}],[{"type":"prose","content":" Benjamin were three: Bela, Becher, and Jediael. "}],[{"type":"prose","content":"The sons of Bela were five: Ezbon, Uzzi, Uzziel, Jerimoth, and Iri. They were heads of the households of their fathers, courageous men. By their genealogies they were 22,034. "}],[{"type":"prose","content":"The sons of Becher: Zemirah, Joash, Eliezer, Elioenai, Omri, Jeremoth, Abijah, Anathoth, and Alemeth, all these were sons of Becher. "}],[{"type":"prose","content":"They were registered by their genealogies according to their generations, as heads of their fathers’ households, courageous men, 20,200 . "}],[{"type":"prose","content":"The son of Jediael: Bilhan. The sons of Bilhan: Jeush, Benjamin, Ehud, Chenaanah, Zethan, Tarshish, and Ahishahar. "}],[{"type":"prose","content":"All these were the sons of Jediael, according to the heads of their fathers’ households, 17,200 courageous men of valor, fit for military service. "}],[{"type":"prose","content":"Shuppim and Huppim were the sons of Ir, and Hushim the son of Aher."},{"type":"header","content":"Sons of Naphtali"}],[{"type":"prose","content":"The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum, the sons of Bilhah."},{"type":"header","content":"Descendants of Manasseh"}],[{"type":"prose","content":"The sons of Manasseh: Asriel, whom his Aramean concubine bore; she gave birth to Machir the father of Gilead. "}],[{"type":"prose","content":"Machir took as a wife the sister of Huppim and Shuppim; her name was Maacah. The name of a second [descendant, the first being Gilead], was Zelophehad; and Zelophehad had [only] daughters. "}],[{"type":"prose","content":"Maacah the wife of Machir gave birth to a son; she named him Peresh. The name of his brother was Sheresh; his sons were Ulam and Rakem. "}],[{"type":"prose","content":"The son of Ulam: Bedan. These were the sons of Gilead the son of Machir, the son of Manasseh. "}],[{"type":"prose","content":"His sister Hammolecheth gave birth to Ishhod and Abiezer and Mahlah. "}],[{"type":"prose","content":"The sons of Shemida were: Ahian, Shechem, Likhi, and Aniam."},{"type":"header","content":"Descendants of Ephraim"}],[{"type":"prose","content":"The sons of Ephraim: Shuthelah and Bered his son, Tahath [I] his son, Eleadah his son, Tahath [II] his son, "}],[{"type":"prose","content":"Zabad his son, Shuthelah his son, and Ezer and Elead were killed by men who were natives of Gath, because they came down to take their livestock. "}],[{"type":"prose","content":"Their father Ephraim mourned for many days, and his relatives came to comfort him. "}],[{"type":"prose","content":"Then he went in to his wife, and she conceived and gave birth to a son, and he named him Beriah (on misfortune), because tragedy had come on his house. "}],[{"type":"prose","content":"Beriah’s daughter was Sheerah, who built both Lower and Upper Beth-horon, and also Uzzen-sheerah. "}],[{"type":"prose","content":"Rephah was his son  with Resheph; Resheph’s son was Telah, Tahan his son, "}],[{"type":"prose","content":"Ladan his son, Ammihud his son, Elishama his son, "}],[{"type":"prose","content":"Non (Nun) his son, and Joshua [Moses’ successor] his son."}],[{"type":"prose","content":"Their possessions and settlements were Bethel and its towns, and eastward Naaran, and westward Gezer, and Shechem, and as far as Ayyah with all their towns, "}],[{"type":"prose","content":"and along the borders of the sons of Manasseh, Beth-shean, Taanach, Megiddo, Dor, with all their towns. In these [places] lived the sons of Joseph the son of Israel (Jacob)."},{"type":"header","content":"Descendants of Asher"}],[{"type":"prose","content":"The sons of Asher: Imnah, Ishvah, Ishvi, and Beriah; and Serah their sister. "}],[{"type":"prose","content":"The sons of Beriah: Heber and Malchiel, who was the father of Birzaith. "}],[{"type":"prose","content":"Heber became the father of Japhlet, Shomer, Hotham, and Shua their sister. "}],[{"type":"prose","content":"The sons of Japhlet: Pasach, Bimhal, and Ashvath. These were the sons of Japhlet. "}],[{"type":"prose","content":"The sons of Shemer (Shomer) [his brother]: Ahi and Rohgah, Jehubbah, and Aram. "}],[{"type":"prose","content":"The sons of his brother Helem (Hotham): Zophah, Imna, Shelesh, and Amal. "}],[{"type":"prose","content":"The sons of Zophah: Suah, Harnepher, Shual, Beri, Imrah, "}],[{"type":"prose","content":"Bezer, Hod, Shamma, Shilshah, Ithran, and Beera. "}],[{"type":"prose","content":"The sons of Jether: Jephunneh, Pispa, and Ara. "}],[{"type":"prose","content":"The sons of Ulla: Arah, Hanniel, and Rizia. "}],[{"type":"prose","content":"All these were sons (descendants) of Asher, heads of their fathers’ houses, choice men, courageous men, chiefs of the leaders. Their number, enrolled by genealogies for service in war, was 26,000 men."}]]