[{"num":7,"verse":"¶ The sons of Issachar: Tola, Puah, Jashub, and Shimron, four."},{"num":2,"verse":"The sons of Tola: Uzzi, Rephaiah, Jeriel, Jahmai, Jibsam, and Shemuel, heads of the houses of their fathers. Those of Tola numbered by their families twenty-two thousand valiant men of might in the days of David."},{"num":3,"verse":"The son of Uzzi was Izrahiah; and the sons of Izrahiah: Michael, Obadiah, Joel, Ishiah, all of them, five princes."},{"num":4,"verse":"And with them, by their lineages, after the houses of their fathers, were bands of soldiers for war, thirty-six thousand men, for they had many wives and sons."},{"num":5,"verse":"And their brethren among all the families of Issachar were valiant men of might, reckoned in all by their genealogies eighty-seven thousand."},{"num":6,"verse":"The sons of Benjamin: Bela, Becher, and Jediael, three."},{"num":7,"verse":"The sons of Bela: Ezbon, Uzzi, Uzziel, Jerimoth, and Iri, five, heads of the houses of their fathers, mighty men of valour; and were reckoned by their genealogies twenty-two thousand and thirty-four."},{"num":8,"verse":"The sons of Becher: Zemira, Joash, Eliezer, Elioenai, Omri, Jerimoth, Abiah, Anathoth, and Alameth. All these are the sons of Becher."},{"num":9,"verse":"And the number of them, after their genealogy by their generations, heads of the houses of their fathers, mighty men of valour, was twenty thousand two hundred."},{"num":10,"verse":"The son of Jediael was Bilhan; and the sons of Bilhan: Jeush, Benjamin, Ehud, Chenaanah, Zethan, Tarshish, and Ahishahar."},{"num":11,"verse":"All these were sons of Jediael, by the heads of their fathers, mighty men of valour, seventeen thousand two hundred soldiers, fit to go out for war and battle."},{"num":12,"verse":"And Shuppim and Huppim were sons of Ir; and Hushim, the son of Aher."},{"num":13,"verse":"The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum, the sons of Bilhah."},{"num":14,"verse":"The sons of Manasseh: Ashriel, whom his concubine, the Aramitess, gave birth unto him; she also gave birth to Machir, the father of Gilead."},{"num":15,"verse":"And Machir took wives of Huppim and Shuppim, whose sister’s name was Maachah, and the name of the second was Zelophehad. And Zelophehad had daughters."},{"num":16,"verse":"And Maachah, the wife of Machir, gave birth to a son unto him, and she called his name Peresh, and the name of his brother was Sheresh, whose sons were Ulam and Rakem."},{"num":17,"verse":"The son of Ulam was Bedan. These were the sons of Gilead, the son of Machir, the son of Manasseh."},{"num":18,"verse":"And his sister Hammoleketh gave birth to Ishod, Abiezer, and Mahalah."},{"num":19,"verse":"And the sons of Shemida were, Ahian, Shechem, Likhi, and Aniam."},{"num":20,"verse":"¶ The sons of Ephraim: Shuthelah, Bered, his son, Tahath his son, Eladah, his son, Tahath, his son,"},{"num":21,"verse":"Zabad, his son, Shuthelah, his son, Ezer, and Elead, whom the men of Gath that were born in that land slew because they came down to take away their livestock."},{"num":22,"verse":"And Ephraim, their father, mourned many days, and his brethren came to comfort him."},{"num":23,"verse":"And when he went in to his wife, she conceived and gave birth to a son, and he called his name Beriah, because he had been in affliction in his house."},{"num":24,"verse":"(And his daughter was Sherah, who built Bethhoron, the lower and the upper, and Uzzensherah.)"},{"num":25,"verse":"And Rephah was his son, also Resheph, and Telah his son, and Tahan, his son,"},{"num":26,"verse":"Laadan, his son, Ammihud, his son, Elishama, his son,"},{"num":27,"verse":"Nun, his son, Joshua, his son."},{"num":28,"verse":"And their inheritance and habitation was Bethel with its towns, and eastward Naaran, and westward Gezer with its towns; likewise Shechem and its towns unto Gaza and its towns,"},{"num":29,"verse":"and by the side of the sons of Manasseh, Bethshean and her towns, Taanach and her towns, Megiddo and her towns, Dor and her towns. In these dwelt the sons of Joseph, the son of Israel."},{"num":30,"verse":"The sons of Asher: Imnah, Isuah, Ishuai, Beriah, and Serah, their sister."},{"num":31,"verse":"And the sons of Beriah: Heber and Malchiel, who was the father of Birzavith."},{"num":32,"verse":"And Heber begat Japhlet, Shomer, Hotham, and Shua their sister."},{"num":33,"verse":"The sons of Japhlet: Pasach, Bimhal, and Ashvath. These were the sons of Japhlet."},{"num":34,"verse":"And the sons of Shamer: Ahi, Rohgah, Jehubbah, and Aram."},{"num":35,"verse":"The sons of his brother Helem: Zophah, Imna, Shelesh, and Amal."},{"num":36,"verse":"The sons of Zophah: Suah, Harnepher, Shual, Beri, Imrah,"},{"num":37,"verse":"Bezer, Hod, Shamma, Shilshah, Ithran, and Beera."},{"num":38,"verse":"The sons of Jether: Jephunneh, Pispah, and Ara."},{"num":39,"verse":"And the sons of Ulla: Arah, Haniel, and Rezia."},{"num":40,"verse":"All these were sons of Asher, heads of their father’s houses, chosen, mighty men of valour, heads of princes. And the number throughout the genealogy of those that were apt for war and for battle was twenty-six thousand men."}]