[[],[{"type":"header","content":"Genealogy from Issachar"},{"type":"prose","content":"Now the sons of Issachar  four: Tola, Puah, Jashub, and Shimron."}],[{"type":"prose","content":"The sons of Tola  Uzzi, Rephaiah, Jeriel, Jahmai, Ibsam, and Samuel, heads of their fathers’ households.  of Tola  valiant warriors in their generations. Their number in the days of David was 22,600."}],[{"type":"prose","content":"The son of Uzzi  Izrahiah. And the sons of Izrahiah  Michael, Obadiah, Joel,  Isshiah; all five of them  chief men."}],[{"type":"prose","content":"And with them by their generations according to their fathers’ households were thirty-six thousand troops of the army for war; for they had many wives and sons."}],[{"type":"prose","content":"Their relatives among all the families of Issachar  valiant warriors, registered by genealogy, eighty-seven thousand in all."},{"type":"header","content":"Descendants of Benjamin"}],[{"type":"prose","content":"Benjamin  three : Bela, Becher, and Jediael."}],[{"type":"prose","content":"The sons of Bela were five: Ezbon, Uzzi, Uzziel, Jerimoth, and Iri. They  heads of fathers’ households, valiant warriors, 22,034 registered by genealogy."}],[{"type":"prose","content":"The sons of Becher  Zemirah, Joash, Eliezer, Elioenai, Omri, Jeremoth, Abijah, Anathoth, and Alemeth. All these  the sons of Becher."}],[{"type":"prose","content":"They were registered by genealogy according to their generations, heads of their fathers’ households, 20,200 valiant warriors."}],[{"type":"prose","content":"The son of Jediael  Bilhan. And the sons of Bilhan  Jeush, Benjamin, Ehud, Chenaanah, Zethan, Tarshish, and Ahishahar."}],[{"type":"prose","content":"All these  sons of Jediael, according to the heads of their fathers’ households, 17,200 valiant warriors who were ready to go out with the army to war."}],[{"type":"prose","content":"Shuppim and Huppim  the sons of Ir; Hushim  the son of Aher."},{"type":"header","content":"Sons of Naphtali"}],[{"type":"prose","content":"The sons of Naphtali  Jahziel, Guni, Jezer, and Shallum, the sons of Bilhah."},{"type":"header","content":"Descendants of Manasseh"}],[{"type":"prose","content":"The sons of Manasseh  Asriel, to whom his Aramean concubine gave birth; she  gave birth to Machir, the father of Gilead."}],[{"type":"prose","content":"Machir took a wife from Huppim and Shuppim, whose name was Maacah. And the name of the second was Zelophehad, and Zelophehad had daughters."}],[{"type":"prose","content":"Maacah the wife of Machir gave birth to a son, and she named him Peresh; the name of his brother  Sheresh, and his sons  Ulam and Rakem."}],[{"type":"prose","content":"The son of Ulam  Bedan. These  the sons of Gilead the son of Machir, the son of Manasseh."}],[{"type":"prose","content":"His sister Hammolecheth gave birth to Ishhod, Abiezer, and Mahlah."}],[{"type":"prose","content":"The sons of Shemida were Ahian, Shechem, Likhi, and Aniam."},{"type":"header","content":"Descendants of Ephraim"}],[{"type":"prose","content":"The sons of Ephraim  Shuthelah and Bered his son, Tahath his son, Eleadah his son, Tahath his son,"}],[{"type":"prose","content":"Zabad his son, Shuthelah his son, and Ezer and Elead, whom the men of Gath who were born in the land killed, because they came down to take their livestock."}],[{"type":"prose","content":"Their father Ephraim mourned for many days, and his relatives came to comfort him."}],[{"type":"prose","content":"Then he went in to his wife, and she conceived and gave birth to a son, and he named him Beriah, because misfortune had come upon his house."}],[{"type":"prose","content":"His daughter was Sheerah, who built lower and upper Beth-horon, as well as Uzzen-sheerah."}],[{"type":"prose","content":"Rephah was his son  with Resheph, Telah his son, Tahan his son,"}],[{"type":"prose","content":"Ladan his son, Ammihud his son, Elishama his son,"}],[{"type":"prose","content":"Non his son, and Joshua his son."}],[{"type":"prose","content":"Their possessions and dwelling places  Bethel with its towns, and to the east, Naaran, and to the west, Gezer with its towns, and Shechem with its towns, as far as Ayyah with its towns,"}],[{"type":"prose","content":"and along the borders of the sons of Manasseh, Beth-shean with its towns, Taanach with its towns, Megiddo with its towns,  Dor with its towns. In these  lived the sons of Joseph the son of Israel."},{"type":"header","content":"Descendants of Asher"}],[{"type":"prose","content":"The sons of Asher  Imnah, Ishvah, Ishvi, and Beriah, and Serah  their sister."}],[{"type":"prose","content":"The sons of Beriah  Heber and Malchiel, who was the father of Birzaith."}],[{"type":"prose","content":"Heber fathered Japhlet, Shomer, and Hotham, and their sister Shua."}],[{"type":"prose","content":"The sons of Japhlet  Pasach, Bimhal, and Ashvath. These were the sons of Japhlet."}],[{"type":"prose","content":"The sons of Shemer  Ahi and Rohgah,  Jehubbah and Aram."}],[{"type":"prose","content":"The sons of his brother Helem  Zophah, Imna, Shelesh, and Amal."}],[{"type":"prose","content":"The sons of Zophah  Suah, Harnepher, Shual, Beri, Imrah,"}],[{"type":"prose","content":"Bezer, Hod, Shamma, Shilshah, Ithran, and Beera."}],[{"type":"prose","content":"The sons of Jether  Jephunneh, Pispa, and Ara."}],[{"type":"prose","content":"The sons of Ulla  Arah, Hanniel, and Rizia."}],[{"type":"prose","content":"All these  the sons of Asher, heads of the fathers’ houses, choice, valiant mighty men,  heads of the leaders. And the number of them registered by genealogy for service in war was twenty-six thousand men."}]]