[{"header":"Plot to kill Jesus"},{"num":22,"verse":"The Festival of Unleavened Bread, which is called Passover, was approaching."},{"num":2,"verse":"The chief priests and the legal experts were looking for a way to kill Jesus, because they were afraid of the people."},{"num":3,"verse":"Then Satan entered Judas, called Iscariot, who was one of the Twelve."},{"num":4,"verse":"He went out and discussed with the chief priests and the officers of the temple guard how he could hand Jesus over to them."},{"num":5,"verse":"They were delighted and arranged payment for him."},{"num":6,"verse":"He agreed and began looking for an opportunity to hand Jesus over to them—a time when the crowds would be absent."},{"header":"Disciples prepare for the Passover"},{"num":7,"verse":"The Day of Unleavened Bread arrived, when the Passover had to be sacrificed."},{"num":8,"verse":"Jesus sent Peter and John with this task: “Go and prepare for us to eat the Passover meal.”"},{"num":9,"verse":"They said to him, “Where do you want us to prepare it?”"},{"num":10,"verse":"Jesus replied, “When you go into the city, a man carrying a water jar will meet you. Follow him to the house he enters."},{"num":11,"verse":"Say to the owner of the house, ‘The teacher says to you, “Where is the guestroom where I can eat the Passover meal with my disciples?” ’"},{"num":12,"verse":"He will show you a large upstairs room, already furnished. Make preparations there.”"},{"num":13,"verse":"They went and found everything just as he had told them, and they prepared the Passover meal."},{"header":"The Passover meal"},{"num":14,"verse":"When the time came, Jesus took his place at the table, and the apostles joined him."},{"num":15,"verse":"He said to them, “I have earnestly desired to eat this Passover with you before I suffer."},{"num":16,"verse":"I tell you, I won’t eat it until it is fulfilled in God’s kingdom.”"},{"num":17,"verse":"After taking a cup and giving thanks, he said, “Take this and share it among yourselves."},{"num":18,"verse":"I tell you that from now on I won’t drink from the fruit of the vine until God’s kingdom has come.”"},{"num":19,"verse":"After taking the bread and giving thanks, he broke it and gave it to them, saying, “This is my body, which is given for you. Do this in remembrance of me.”"},{"num":20,"verse":"In the same way, he took the cup after the meal and said, “This cup is the new covenant by my blood, which is poured out for you."},{"num":21,"verse":"“But look! My betrayer is with me; his hand is on this table."},{"num":22,"verse":"The Human One goes just as it has been determined. But how terrible it is for that person who betrays him.”"},{"num":23,"verse":"They began to argue among themselves about which of them it could possibly be who would do this."},{"header":"The disciples debate greatness"},{"num":24,"verse":"An argument broke out among the disciples over which one of them should be regarded as the greatest."},{"num":25,"verse":"But Jesus said to them, “The kings of the Gentiles rule over their subjects, and those in authority over them are called ‘friends of the people.’"},{"num":26,"verse":"But that’s not the way it will be with you. Instead, the greatest among you must become like a person of lower status and the leader like a servant."},{"num":27,"verse":"So which one is greater, the one who is seated at the table or the one who serves at the table? Isn’t it the one who is seated at the table? But I am among you as one who serves."},{"num":28,"verse":"“You are the ones who have continued with me in my trials."},{"num":29,"verse":"And I confer royal power on you just as my Father granted royal power to me."},{"num":30,"verse":"Thus you will eat and drink at my table in my kingdom, and you will sit on thrones overseeing the twelve tribes of Israel."},{"header":"Peter’s denial predicted"},{"num":31,"verse":"“Simon, Simon, look! Satan has asserted the right to sift you all like wheat."},{"num":32,"verse":"However, I have prayed for you that your faith won’t fail. When you have returned, strengthen your brothers and sisters.”"},{"num":33,"verse":"Peter responded, “Lord, I’m ready to go with you, both to prison and to death!”"},{"num":34,"verse":"Jesus replied, “I tell you, Peter, the rooster won’t crow today before you have denied three times that you know me.”"},{"header":"Call for preparedness"},{"num":35,"verse":"Jesus said to them, “When I sent you out without a wallet, bag, or sandals, you didn’t lack anything, did you?”"},{"num":36,"verse":"Then he said to them, “But now, whoever has a wallet must take it, and likewise a bag. And those who don’t own a sword must sell their clothes and buy one."},{"num":37,"verse":" I tell you that this scripture must be fulfilled in relation to me: And he was counted among criminals.Indeed, what’s written about me is nearing completion.”"},{"num":38,"verse":"They said to him, “Lord, look, here are two swords.”"},{"header":"Jesus in prayer"},{"num":39,"verse":"Jesus left and made his way to the Mount of Olives, as was his custom, and the disciples followed him."},{"num":40,"verse":"When he arrived, he said to them, “Pray that you won’t give in to temptation.”"},{"num":41,"verse":"He withdrew from them about a stone’s throw, knelt down, and prayed."},{"num":42,"verse":"He said, “Father, if it’s your will, take this cup of suffering away from me. However, not my will but your will must be done.”"},{"num":43,"verse":"Then a heavenly angel appeared to him and strengthened him."},{"num":44,"verse":"He was in anguish and prayed even more earnestly. His sweat became like drops of blood falling on the ground."},{"num":45,"verse":"When he got up from praying, he went to the disciples. He found them asleep, overcome by grief."},{"num":46,"verse":"He said to them, “Why are you sleeping? Get up and pray so that you won’t give in to temptation.”"},{"header":"Jesus’ arrest"},{"num":47,"verse":"While Jesus was still speaking, a crowd appeared, and the one called Judas, one of the Twelve, was leading them. He approached Jesus to kiss him."},{"num":48,"verse":"Jesus said to him, “Judas, would you betray the Human One with a kiss?”"},{"num":49,"verse":"When those around him recognized what was about to happen, they said, “Lord, should we fight with our swords?”"},{"num":50,"verse":"One of them struck the high priest’s servant, cutting off his right ear."},{"num":51,"verse":"Jesus responded, “Stop! No more of this!” He touched the slave’s ear and healed him."},{"num":52,"verse":"Then Jesus said to the chief priests, the officers of the temple guard, and the elders who had come to get him, “Have you come with swords and clubs to arrest me, as though I were a thief?"},{"num":53,"verse":"Day after day I was with you in the temple, but you didn’t arrest me. But this is your time, when darkness rules.”"},{"header":"Peter denies knowing Jesus"},{"num":54,"verse":"After they arrested Jesus, they led him away and brought him to the high priest’s house. Peter followed from a distance."},{"num":55,"verse":"When they lit a fire in the middle of the courtyard and sat down together, Peter sat among them."},{"num":56,"verse":"Then a servant woman saw him sitting in the firelight. She stared at him and said, “This man was with him too.”"},{"num":57,"verse":"But Peter denied it, saying, “Woman, I don’t know him!”"},{"num":58,"verse":"A little while later, someone else saw him and said, “You are one of them too.”"},{"num":59,"verse":"An hour or so later, someone else insisted, “This man must have been with him, because he is a Galilean too.”"},{"num":60,"verse":"Peter responded, “Man, I don’t know what you are talking about!” At that very moment, while he was still speaking, a rooster crowed."},{"num":61,"verse":"The Lord turned and looked straight at Peter, and Peter remembered the Lord’s words: “Before a rooster crows today, you will deny me three times.”"},{"num":62,"verse":"And Peter went out and cried uncontrollably."},{"header":"Jesus taunted"},{"num":63,"verse":"The men who were holding Jesus in custody taunted him while they beat him."},{"num":64,"verse":"They blindfolded him and asked him repeatedly, “Prophesy! Who hit you?”"},{"num":65,"verse":"Insulting him, they said many other horrible things against him."},{"header":"Jesus before the Jerusalem leadership"},{"num":66,"verse":"As morning came, the elders of the people, both chief priests and legal experts, came together, and Jesus was brought before their council."},{"num":67,"verse":"They said, “If you are the Christ, tell us!”"},{"num":68,"verse":"And if I ask you a question, you won’t answer."},{"num":69,"verse":"But from now on, the Human One will be seated on the right side of the power of God.”"},{"num":70,"verse":"They all said, “Are you God’s Son, then?”"},{"num":71,"verse":"Then they said, “Why do we need further testimony? We’ve heard it from his own lips.”"}]