[{"header":"The Priests Plot How To Kill Jesus"},{"num":22,"verse":"Now the Feast of Unleavened-Bread, the one being called Passover, was drawing-near. "},{"num":2,"verse":"And the chief priests and the scribes were seeking as to how they might kill Him, for they were fearing the people."},{"header":"Judas Betrays Jesus To The Priests"},{"num":3,"verse":"And Satan entered into Judas, the one being called “Iscariot”, being one of the number of the twelve. "},{"num":4,"verse":"And having gone, he talked-with the chief priests and [temple] captains as to how he might hand Him over to them. "},{"num":5,"verse":"And they rejoiced and agreed to give him money. "},{"num":6,"verse":"And he consented, and was seeking a favorable-opportunity that he might hand Him over without a crowd with them."},{"header":"Jesus Celebrates Passover With The Twelve"},{"num":7,"verse":"And the [first] day of the Feast of Unleavened-Bread came— on which it-was-necessary that the Passover [lamb] be sacrificed. "},{"num":8,"verse":"And He sent-forth Peter and John, having said, “Having gone, prepare the Passover [meal] for us in order that we may eat it ”. "},{"num":9,"verse":"And the ones said to Him, “Where do You want us to prepare it?” "},{"num":10,"verse":"And the One said to them, “Behold— you having entered into the city, a man will meet you carrying a jar of water. Follow him to the house into which he proceeds. "},{"num":11,"verse":"And you will say to the master of the house, ‘The Teacher says to you, “Where is the guest-room where I may eat the Passover [meal] with My disciples?”’ "},{"num":12,"verse":"And that one will show you a large upstairs-room having been spread [with furnishings]. Prepare it there”. "},{"num":13,"verse":"And having gone, they found it just as He had told them. And they prepared the Passover [meal]."},{"header":"The Bread And The Wine Are Given a New Meaning"},{"num":14,"verse":"And when the hour came, He fell back [to eat], and the apostles with Him. "},{"num":15,"verse":"And He said to them, “I greatly desired to eat this Passover [meal] with you before I suffer. "},{"num":16,"verse":"For I say to you that I will by no means eat it until it is fulfilled in the kingdom of God”. "},{"num":17,"verse":"And having taken a cup, having given-thanks, He said “Take this and distribute it to yourselves. "},{"num":18,"verse":"For I say to you that I will by no means drink from the fruit of the grapevine from now on until which time the kingdom of God comes”. "},{"num":19,"verse":"And having taken bread, having given-thanks, He broke it and gave it to them, saying “This is My body, the one being given for you. Be doing this for My remembrance”. "},{"num":20,"verse":"And similarly the cup after the dining, saying “This cup is the new covenant in My blood— the blood being poured-out for you. "},{"num":21,"verse":"Yet behold— the hand of the one handing Me over is with Mine on the table! "},{"num":22,"verse":"Because the Son of Man is proceeding according-to the thing having been determined— nevertheless, woe to that man by whom He is being handed-over!” "},{"num":23,"verse":"And they began to discuss with themselves as to which of them then the one going to do this thing might be."},{"header":"The Disciples Argue Over Who Is Greatest. The Greatest Is The Servant of All"},{"num":24,"verse":"And a contention also took place among them as to which of them seems to be greater. "},{"num":25,"verse":"And the One said to them, “The kings of the Gentiles are lording-over them. And the ones having-authority over them are calling-themselves ‘Benefactors’. "},{"num":26,"verse":"But you shall not be so. But let the greater one among you be like the younger one; and the one leading like the one serving. "},{"num":27,"verse":"For who is greater, the one reclining-back [to eat] or the one serving? Is it not the one reclining-back? But I am in your midst as the One serving! "},{"num":28,"verse":"But you are the ones having continued with Me in My trials. "},{"num":29,"verse":"And I am conferring you a kingdom, just as My Father conferred Me "},{"num":30,"verse":"so that you may eat and drink at My table in My kingdom. And you will sit on thrones judging the twelve tribes of Israel."},{"header":"Peter Will Deny Jesus"},{"num":31,"verse":"“Simon, Simon. Behold— Satan asked-for you all that he might sift you like wheat. "},{"num":32,"verse":"But I prayed for you, that your faith may not fail. And when you have turned-back, establish your brothers”. "},{"num":33,"verse":"But the one said to Him, “Lord, I am prepared to go with You even to prison and to death!” "},{"num":34,"verse":"And the One said, “I say to you, Peter, a rooster will not crow today until you deny three-times that you know Me”."},{"header":"Jesus Tells The Disciples To Prepare For a New Assignment"},{"num":35,"verse":"And He said to them, “When I sent you out without money-bag and [traveler’s] bag and sandals, you did not lack anything, did you?” And the ones said, “Nothing”. "},{"num":36,"verse":"And He said to them, “But now let the one having a money-bag take it. Likewise also a [traveler’s] bag. And let the one not having one sell his cloak and buy a sword. "},{"num":37,"verse":"For I say to you that this [saying] having been written [in Isa 53:12] must be fulfilled in Me: ‘And He was counted with lawless ones’. For indeed the thing concerning Me has a fulfillment”. "},{"num":38,"verse":"And the ones said, “Lord, behold— here are two swords”. And the One said to them, “It is enough”."},{"header":"Jesus Waits And Prays On The Mount of Olives"},{"num":39,"verse":"And having gone out, He went in accordance with His custom to the Mount of Olives. And the disciples also, they followed Him. "},{"num":40,"verse":"And having come-to-be at the place, He said to them, “Be praying that you may not enter into temptation”. "},{"num":41,"verse":"And He withdrew from them about a stone’s throw. And having put down His knees, He was praying, "},{"num":42,"verse":"saying “Father, if You are willing, remove this cup from Me. Yet let not My will, but Yours be done”. "},{"num":43,"verse":"And an angel from heaven appeared to Him, strengthening Him. "},{"num":44,"verse":"And having come-to-be in agony, He was praying more-fervently. And His sweat became like drops of blood going down upon the ground. "},{"num":45,"verse":"And having arisen from prayer, having come to the disciples, He found them being asleep because of grief. "},{"num":46,"verse":"And He said to them, “Why are you sleeping? Having stood-up, be praying that you may not enter into temptation”."},{"header":"Jesus Is Betrayed With a Kiss, And Arrested"},{"num":47,"verse":"While He was still speaking, behold— a crowd. And the one being called Judas, one of the twelve, was preceding them. And he drew-near to Jesus to kiss Him. "},{"num":48,"verse":"And Jesus said to him, “Judas, are you handing-over the Son of Man with a kiss?” "},{"num":49,"verse":"And the ones around Him, having seen the thing which will happen, said “Lord, shall we strike with a sword?” "},{"num":50,"verse":"And a certain one of them struck the slave of the high priest and took-off his right ear. "},{"num":51,"verse":"But having responded, Jesus said, “Allow up to this”. And having touched his ear, He healed him. "},{"num":52,"verse":"And Jesus said to the chief priests and captains of the temple and elders having come against Him, “Did you come out with swords and clubs as-if against a robber? "},{"num":53,"verse":"Daily while I was being with you in the temple, you did not stretch-out your hands against Me. But this is your hour, and the authority of darkness”."},{"header":"Jesus Is Led Into The House of The High Priest; Peter Denies Him Three Times"},{"num":54,"verse":"And having arrested Him, they led Him, and brought Him into the house of the high priest. And Peter was following at-a-distance. "},{"num":55,"verse":"And they having kindled a fire in the middle of the courtyard, and having sat-down-together, Peter was sitting amidst them. "},{"num":56,"verse":"And a certain servant-girl, having seen him sitting toward the light, and having looked-intently at him, said “This one also was with Him”. "},{"num":57,"verse":"But the one denied it, saying “I do not know Him, woman”. "},{"num":58,"verse":"And after a short time, another man having seen him said, “You also are one of them”. But Peter said, “Man, I am not!” "},{"num":59,"verse":"And about one hour having passed, a certain other man was insisting, saying “In accordance with truth, this one also was with Him, for he also is a Galilean”. "},{"num":60,"verse":"But Peter said, “Man, I do not know what you are saying”. And at-once, while he was still speaking, a rooster crowed. "},{"num":61,"verse":"And having turned, the Lord looked-at Peter. And Peter was reminded of the word of the Lord— how He said to him that “Before a rooster crows today, you will deny Me three-times”. "},{"num":62,"verse":"And having gone outside, he wept bitterly. "},{"num":63,"verse":"And the men holding Him were mocking Him while beating Him. "},{"num":64,"verse":"And having covered Him, they were asking Him, saying “Prophesy— who is the one having hit You?” "},{"num":65,"verse":"And blaspheming, they were saying many other things against Him."},{"header":"Jesus Is Led Before The Sanhedrin. He Tells Them He Is The Son of God"},{"num":66,"verse":"And when it became day, the Council-of-elders of the people was gathered together— both chief priests and scribes. And they led Him away to their council [chamber], "},{"num":67,"verse":"saying “If You are the Christ, tell us”. But He said to them, “If I tell you, you will by no means believe. "},{"num":68,"verse":"And if I question you, you will by no means answer. "},{"num":69,"verse":"But from now on, the Son of Man will be sitting on the right side of the power of God”. "},{"num":70,"verse":"And they all said, “Are You then the Son of God?” And the One said to them, “You are saying that I am”. "},{"num":71,"verse":"And the ones said, “What further need do we have of testimony? For we ourselves heard it from His mouth”."}]