[{"header":"The Plot to Kill Jesus"},{"num":22,"verse":"Now the Feast of Unleavened Bread drew near, which is called the Passover."},{"num":2,"verse":"And the chief priests and the scribes were seeking how to put him to death, for they feared the people."},{"header":"Judas to Betray Jesus"},{"num":3,"verse":"Then Satan entered into Judas called Iscariot, who was of the number of the twelve."},{"num":4,"verse":"He went away and conferred with the chief priests and officers how he might betray him to them."},{"num":5,"verse":"And they were glad, and agreed to give him money."},{"num":6,"verse":"So he consented and sought an opportunity to betray him to them in the absence of a crowd."},{"header":"The Passover with the Disciples"},{"num":7,"verse":"Then came the day of Unleavened Bread, on which the Passover lamb had to be sacrificed."},{"num":8,"verse":"So Jesus sent Peter and John, saying, “Go and prepare the Passover for us, that we may eat it.”"},{"num":9,"verse":"They said to him, “Where will you have us prepare it?”"},{"num":10,"verse":"He said to them, “Behold, when you have entered the city, a man carrying a jar of water will meet you. Follow him into the house that he enters"},{"num":13,"verse":"And they went and found it just as he had told them, and they prepared the Passover."},{"header":"Institution of the Lord's Supper"},{"num":14,"verse":"And when the hour came, he reclined at table, and the apostles with him."},{"num":15,"verse":"And he said to them, “I have earnestly desired to eat this Passover with you before I suffer."},{"num":17,"verse":"And he took a cup, and when he had given thanks he said, “Take this, and divide it among yourselves."},{"num":19,"verse":"And he took bread, and when he had given thanks, he broke it and gave it to them, saying, “This is my body, which is given for you. Do this in remembrance of me.”"},{"num":20,"verse":"And likewise the cup after they had eaten, saying, “This cup that is poured out for you is the new covenant in my blood."},{"num":23,"verse":"And they began to question one another, which of them it could be who was going to do this."},{"header":"Who Is the Greatest?"},{"num":24,"verse":"A dispute also arose among them, as to which of them was to be regarded as the greatest."},{"num":25,"verse":"And he said to them, “The kings of the Gentiles exercise lordship over them, and those in authority over them are called benefactors."},{"header":"Jesus Foretells Peter's Denial"},{"num":33,"verse":"Peter said to him, “Lord, I am ready to go with you both to prison and to death.”"},{"num":34,"verse":"Jesus said, “I tell you, Peter, the rooster will not crow this day, until you deny three times that you know me.”"},{"header":"Scripture Must Be Fulfilled in Jesus"},{"num":35,"verse":"And he said to them, “When I sent you out with no moneybag or knapsack or sandals, did you lack anything?” They said, “Nothing.”"},{"num":36,"verse":"He said to them, “But now let the one who has a moneybag take it, and likewise a knapsack. And let the one who has no sword sell his cloak and buy one."},{"num":38,"verse":"And they said, “Look, Lord, here are two swords.” And he said to them, “It is enough.”"},{"header":"Jesus Prays on the Mount of Olives"},{"num":39,"verse":"And he came out and went, as was his custom, to the Mount of Olives, and the disciples followed him."},{"num":40,"verse":"And when he came to the place, he said to them, “Pray that you may not enter into temptation.”"},{"num":41,"verse":"And he withdrew from them about a stone's throw, and knelt down and prayed,"},{"num":42,"verse":"saying, “Father, if you are willing, remove this cup from me. Nevertheless, not my will, but yours, be done.”"},{"num":43,"verse":"And there appeared to him an angel from heaven, strengthening him."},{"num":44,"verse":"And being in agony he prayed more earnestly; and his sweat became like great drops of blood falling down to the ground."},{"num":45,"verse":"And when he rose from prayer, he came to the disciples and found them sleeping for sorrow,"},{"num":46,"verse":"and he said to them, “Why are you sleeping? Rise and pray that you may not enter into temptation.”"},{"header":"Betrayal and Arrest of Jesus"},{"num":47,"verse":"While he was still speaking, there came a crowd, and the man called Judas, one of the twelve, was leading them. He drew near to Jesus to kiss him,"},{"num":48,"verse":"but Jesus said to him, “Judas, would you betray the Son of Man with a kiss?”"},{"num":49,"verse":"And when those who were around him saw what would follow, they said, “Lord, shall we strike with the sword?”"},{"num":50,"verse":"And one of them struck the servant of the high priest and cut off his right ear."},{"num":51,"verse":"But Jesus said, “No more of this!” And he touched his ear and healed him."},{"num":52,"verse":"Then Jesus said to the chief priests and officers of the temple and elders, who had come out against him, “Have you come out as against a robber, with swords and clubs?"},{"header":"Peter Denies Jesus"},{"num":54,"verse":"Then they seized him and led him away, bringing him into the high priest's house, and Peter was following at a distance."},{"num":55,"verse":"And when they had kindled a fire in the middle of the courtyard and sat down together, Peter sat down among them."},{"num":56,"verse":"Then a servant girl, seeing him as he sat in the light and looking closely at him, said, “This man also was with him.”"},{"num":57,"verse":"But he denied it, saying, “Woman, I do not know him.”"},{"num":58,"verse":"And a little later someone else saw him and said, “You also are one of them.” But Peter said, “Man, I am not.”"},{"num":59,"verse":"And after an interval of about an hour still another insisted, saying, “Certainly this man also was with him, for he too is a Galilean.”"},{"num":60,"verse":"But Peter said, “Man, I do not know what you are talking about.” And immediately, while he was still speaking, the rooster crowed."},{"num":61,"verse":"And the Lord turned and looked at Peter. And Peter remembered the saying of the Lord, how he had said to him, “Before the rooster crows today, you will deny me three times.”"},{"num":62,"verse":"And he went out and wept bitterly."},{"header":"Jesus Is Mocked"},{"num":63,"verse":"Now the men who were holding Jesus in custody were mocking him as they beat him."},{"num":64,"verse":"They also blindfolded him and kept asking him, “Prophesy! Who is it that struck you?”"},{"num":65,"verse":"And they said many other things against him, blaspheming him."},{"header":"Jesus Before the Council"},{"num":66,"verse":"When day came, the assembly of the elders of the people gathered together, both chief priests and scribes. And they led him away to their council, and they said,"},{"num":67,"verse":"“If you are the Christ, tell us.” But he said to them, “If I tell you, you will not believe,"},{"num":70,"verse":"So they all said, “Are you the Son of God, then?” And he said to them, “You say that I am.”"},{"num":71,"verse":"Then they said, “What further testimony do we need? We have heard it ourselves from his own lips.”"}]