[{"header":"They Look for a Way to Put Jesus to Death (A)"},{"num":22,"verse":"The time for the supper of bread without yeast was near. It was the special religious gathering to remember how the Jews left Egypt. "},{"num":2,"verse":"The religious leaders and the teachers of the Law looked for a way to kill Jesus. But they were afraid of the people."},{"num":3,"verse":"Then Satan came into the heart of Judas who was called Iscariot. He was one of the twelve followers. "},{"num":4,"verse":"Judas went away and talked with the religious leaders and the leaders of the people. He talked about how he might hand Jesus over to them. "},{"num":5,"verse":"They were glad and promised to pay him money. "},{"num":6,"verse":"Judas promised to do this and then looked for a way to hand Jesus over when there were no people around."},{"header":"Getting Ready for the Special Supper (B)"},{"num":7,"verse":"The day of bread without yeast came. It was the day when the lamb had to be killed and given on the altar in worship in the house of God. It was the special religious gathering to remember how the Jews left Egypt. "},{"num":8,"verse":"Jesus sent Peter and John and said, “Go and get this special supper ready for us that we may eat.” "},{"num":9,"verse":"They said to Him, “Where do You want us to get it ready?” "},{"num":10,"verse":"He answered, “See, when you go into the city, you will meet a man carrying a jar of water. Follow him into the house where he goes. "},{"num":13,"verse":"They went and found everything as Jesus had said. They got ready for the special supper."},{"header":"The First Lord’s Supper (C)"},{"num":14,"verse":"When the time came, Jesus sat down with the twelve followers. "},{"num":15,"verse":"He said to them, “I have wanted very much to eat this special supper with you to remember how the Jews left Egypt. I have wanted to eat this with you before I suffer. "},{"num":17,"verse":"Then Jesus took the cup and gave thanks. He said, “Take this and pass it to each one. "},{"num":19,"verse":"Then Jesus took bread and gave thanks and broke it in pieces. He gave it to them, saying, “This is My body which is given for you. Do this to remember Me.” "},{"num":20,"verse":"In the same way, after they had finished the bread, He took the cup. He said, “This cup is My blood of the New Way of Worship which is given for you."},{"header":"Jesus Tells of the One Who Will Hand Him Over"},{"num":23,"verse":"They began to ask each other which of them would do this."},{"header":"Arguing about Who Is the Greatest"},{"num":24,"verse":"They started to argue among themselves about who was thought to be the greatest. "},{"num":25,"verse":"Jesus said to them, “The kings of the nations show their power to the people. Those who have power over the people are given names of honor. "},{"header":"The Followers Will Be Honored"},{"header":"Jesus Tells How Peter Will Lie about Him (D)"},{"num":31,"verse":"The Lord said, “Simon, Simon, listen! Satan has wanted to have you. He will divide you as wheat is divided from that which is no good. "},{"num":33,"verse":"Peter said to Jesus, “Lord, I am ready to go to prison and to die with You!” "},{"num":34,"verse":"Jesus said, “I tell you, Peter, a rooster will not crow today before you will say three times that you do not know Me.”"},{"header":"The Followers Are Told of Trouble to Come"},{"num":35,"verse":"Jesus said to them, “I sent you without money or bag or shoes. Did you need anything?” They said, “Nothing.” "},{"num":36,"verse":"Then He said to them, “But now whoever has a money-bag and a bag for food should take it. Whoever does not have a sword should sell his coat and buy one. "},{"num":38,"verse":"They said, “Lord, look, we have two swords.” He answered, “That is enough.”"},{"header":"Jesus Prays in the Garden (F)"},{"num":39,"verse":"Jesus came out of the room. Then He went to the Mount of Olives as He had been doing. The followers went with Him. "},{"num":40,"verse":"When He got there, He said to them, “Pray that you will not be tempted.” "},{"num":41,"verse":"He walked away from them about as far as a stone can be thrown. There He got down with His face on the ground and prayed. "},{"num":42,"verse":"He said, “Father, if it can be done, take away what must happen to Me. Even so, not what I want, but what You want.” "},{"num":43,"verse":"An angel from heaven came and gave Him strength. "},{"num":44,"verse":"His heart was much troubled and He prayed all the more. Water ran from His face like blood and fell to the ground."},{"num":45,"verse":"When Jesus got up after praying, He went back to the followers. He found them sleeping because of so much sorrow. "},{"num":46,"verse":"He said to them, “Why are you sleeping? Get up and pray that you will not be tempted.”"},{"header":"Jesus Is Handed Over to Sinners (G)"},{"num":47,"verse":"While Jesus was speaking, Judas came walking ahead of many people. He was one of the twelve followers. He came near to Jesus to kiss Him. "},{"num":48,"verse":"But Jesus said to him, “Judas, are you handing over the Son of Man with a kiss?” "},{"num":49,"verse":"Those around Jesus saw what was going to happen and asked, “Lord, should we fight with our swords?” "},{"num":50,"verse":"One of them hit a servant who was owned by the head religious leader and cut off his right ear. "},{"num":51,"verse":"Jesus said, “Stop! This is enough.” And He put His hand on his ear and healed him."},{"header":"Jesus Stands in Front of the Religious Leaders (H)"},{"num":52,"verse":"Jesus said to the religious leaders and the leaders of the house of God and the other leaders who came to Him, “Have you come with swords and sticks to take Me, as if I were a robber? "},{"num":54,"verse":"Then they led Jesus away to the house of the head religious leader. Peter followed a long way behind Him."},{"header":"Peter Said He Did Not Know Jesus (I)"},{"num":55,"verse":"They built a fire in the yard and sat down. Peter sat down with them. "},{"num":56,"verse":"One of the servant-girls saw Peter as he sat by the fire and looked right at him. She said, “This man was with Jesus also.” "},{"num":57,"verse":"Peter lied and said, “Woman, I do not know Him.” "},{"num":58,"verse":"After awhile another person saw him and said, “You are one of them also.” Peter said, “No, sir, I am not.” "},{"num":59,"verse":"About an hour later another person said the same thing, “For sure, this man was with Jesus also because he is from Galilee.” "},{"num":60,"verse":"But Peter said, “Sir, I do not know what you are saying.” And at once, while he was talking, a rooster crowed. "},{"num":61,"verse":"The Lord turned and looked at Peter. He remembered the Lord had said, “Before a rooster crows, you will say three times that you do not know Me.” "},{"num":62,"verse":"Peter went outside and cried with a troubled heart."},{"num":63,"verse":"Those who watched Jesus so He could not get away made fun of Him and beat Him. "},{"num":64,"verse":"They covered His eyes with a cloth and asked Him, “Tell us who hit You!” "},{"num":65,"verse":"They said many other bad things against Jesus."},{"num":66,"verse":"When it was morning the leaders of the people and the religious leaders and the teachers of the Law got together. They took Jesus to the court of the religious leader. They said, "},{"num":67,"verse":"“Tell us if you are the Christ.” He said to them, “If I tell you, you will not believe Me. "},{"num":70,"verse":"They all said, “Then are You the Son of God?” He said, “You say that I am.” "},{"num":71,"verse":"Then they said, “What other word do we need against Him? We have heard Him say this with His own mouth.”"}]