[{"header":"A servant is healed"},{"num":7,"verse":"After Jesus finished presenting all his words among the people, he entered Capernaum."},{"num":2,"verse":"A centurion had a servant who was very important to him, but the servant was ill and about to die."},{"num":3,"verse":"When the centurion heard about Jesus, he sent some Jewish elders to Jesus to ask him to come and heal his servant."},{"num":4,"verse":"When they came to Jesus, they earnestly pleaded with Jesus. “He deserves to have you do this for him,” they said."},{"num":5,"verse":"“He loves our people and he built our synagogue for us.”"},{"num":6,"verse":"Jesus went with them. He had almost reached the house when the centurion sent friends to say to Jesus, “Lord, don’t be bothered. I don’t deserve to have you come under my roof."},{"num":7,"verse":"In fact, I didn’t even consider myself worthy to come to you. Just say the word and my servant will be healed."},{"num":8,"verse":"I’m also a man appointed under authority, with soldiers under me. I say to one, ‘Go,’ and he goes, and to another, ‘Come,’ and he comes. I say to my servant, ‘Do this,’ and the servant does it.”"},{"num":9,"verse":"When Jesus heard these words, he was impressed with the centurion. He turned to the crowd following him and said, “I tell you, even in Israel I haven’t found faith like this.”"},{"num":10,"verse":"When the centurion’s friends returned to his house, they found the servant restored to health."},{"header":"Jesus raises a widow’s son"},{"num":11,"verse":"A little later Jesus went to a city called Nain. His disciples and a great crowd traveled with him."},{"num":12,"verse":"As he approached the city gate, a dead man was being carried out. He was his mother’s only son, and she was a widow. A large crowd from the city was with her."},{"num":13,"verse":"When he saw her, the Lord had compassion for her and said, “Don’t cry.”"},{"num":14,"verse":"He stepped forward and touched the stretcher on which the dead man was being carried. Those carrying him stood still. Jesus said, “Young man, I say to you, get up.”"},{"num":15,"verse":"The dead man sat up and began to speak, and Jesus gave him to his mother."},{"num":16,"verse":"Awestruck, everyone praised God. “A great prophet has appeared among us,” they said. “God has come to help his people.”"},{"num":17,"verse":"This news about Jesus spread throughout Judea and the surrounding region."},{"header":"John the Baptist and Jesus"},{"num":18,"verse":"John’s disciples informed him about all these things. John called two of his disciples"},{"num":19,"verse":"and sent them to the Lord. They were to ask him, “Are you the one who is coming, or should we look for someone else?”"},{"num":20,"verse":"When they reached Jesus, they said, “John the Baptist sent us to you. He asks, ‘Are you the one who is coming, or should we look for someone else?’”"},{"num":21,"verse":"Right then, Jesus healed many of their diseases, illnesses, and evil spirits, and he gave sight to a number of blind people."},{"num":22,"verse":"Then he replied to John’s disciples, “Go, report to John what you have seen and heard. Those who were blind are able to see. Those who were crippled now walk. People with skin diseases are cleansed. Those who were deaf now hear. Those who were dead are raised up. And good news is preached to the poor."},{"num":23,"verse":"Happy is anyone who doesn’t stumble along the way because of me.”"},{"num":24,"verse":"After John’s messengers were gone, Jesus spoke to the crowds about John. “What did you go out into the wilderness to see? A stalk blowing in the wind?"},{"num":25,"verse":"What did you go out to see? A man dressed up in refined clothes? Look, those who dress in fashionable clothes and live in luxury are in royal palaces."},{"num":26,"verse":"What did you go out to see? A prophet? Yes, I tell you, and more than a prophet."},{"num":27,"verse":"He is the one of whom it’s written: Look, I’m sending my messenger before you, who will prepare your way before you."},{"num":28,"verse":"I tell you that no greater human being has ever been born than John. Yet whoever is least in God’s kingdom is greater than he.”"},{"num":29,"verse":"Everyone who heard this, including the tax collectors, acknowledged God’s justice because they had been baptized by John."},{"num":30,"verse":"But the Pharisees and legal experts rejected God’s will for themselves because they hadn’t been baptized by John."},{"num":31,"verse":"“To what will I compare the people of this generation?” Jesus asked. “What are they like?"},{"num":32,"verse":"They are like children sitting in the marketplace calling out to each other, ‘We played the flute for you and you didn’t dance. We sang a funeral song and you didn’t cry.’"},{"num":33,"verse":"John the Baptist came neither eating bread nor drinking wine, and you say, ‘He has a demon.’"},{"num":34,"verse":"Yet the Human One came eating and drinking, and you say, ‘Look, a glutton and a drunk, a friend of tax collectors and sinners.’"},{"num":35,"verse":"But wisdom is proved to be right by all her descendants.”"},{"header":"Forgiveness and gratitude"},{"num":36,"verse":"One of the Pharisees invited Jesus to eat with him. After he entered the Pharisee’s home, he took his place at the table."},{"num":37,"verse":"Meanwhile, a woman from the city, a sinner, discovered that Jesus was dining in the Pharisee’s house. She brought perfumed oil in a vase made of alabaster."},{"num":38,"verse":"Standing behind him at his feet and crying, she began to wet his feet with her tears. She wiped them with her hair, kissed them, and poured the oil on them."},{"num":39,"verse":"When the Pharisee who had invited Jesus saw what was happening, he said to himself, If this man were a prophet, he would know what kind of woman is touching him. He would know that she is a sinner."},{"num":40,"verse":"Jesus replied, “Simon, I have something to say to you.”"},{"num":41,"verse":"“A certain lender had two debtors. One owed enough money to pay five hundred people for a day’s work. The other owed enough money for fifty."},{"num":42,"verse":"When they couldn’t pay, the lender forgave the debts of them both. Which of them will love him more?”"},{"num":43,"verse":"Simon replied, “I suppose the one who had the largest debt canceled.”"},{"num":44,"verse":"Jesus turned to the woman and said to Simon, “Do you see this woman? When I entered your home, you didn’t give me water for my feet, but she wet my feet with tears and wiped them with her hair."},{"num":45,"verse":"You didn’t greet me with a kiss, but she hasn’t stopped kissing my feet since I came in."},{"num":46,"verse":"You didn’t anoint my head with oil, but she has poured perfumed oil on my feet."},{"num":47,"verse":"This is why I tell you that her many sins have been forgiven; so she has shown great love. The one who is forgiven little loves little.”"},{"num":48,"verse":"Then Jesus said to her, “Your sins are forgiven.”"},{"num":49,"verse":"The other table guests began to say among themselves, “Who is this person that even forgives sins?”"},{"num":50,"verse":"Jesus said to the woman, “Your faith has saved you. Go in peace.”"}]