[{"header":"Solomon Worships at Gibeon"},{"num":1,"verse":"Solomon the son of David established himself securely over his kingdom, and the Lord his God was with him and made him exceedingly great."},{"num":2,"verse":"Solomon spoke to all Israel, to the commanders of thousands and of hundreds and to the judges and to every leader in all Israel, the heads of the fathers’ (ancestors’) households. "},{"num":3,"verse":"Then Solomon and all the assembly went to the high place at Gibeon [to offer sacrifices, where the Canaanites had habitually worshiped], for God’s Tent of Meeting was there, which Moses the servant of the Lord had made in the wilderness. "},{"num":4,"verse":"But David had brought up the ark of God from Kiriath-jearim to the place he had prepared for it, because he had pitched a tent for it in Jerusalem. "},{"num":5,"verse":"Now the bronze altar, which Bezalel the son of Uri, the son of Hur, had made was there before the tabernacle of the Lord, and Solomon and the assembly sought it out. "},{"num":6,"verse":"And Solomon went up to the bronze altar before the Lord at the Tent of Meeting, and offered a thousand burnt offerings on it."},{"num":7,"verse":"That night God appeared to Solomon and said to him, “Ask what I shall give to you.”"},{"header":"Solomon’s Prayer for Wisdom"},{"num":8,"verse":"Then Solomon said to God, “You have shown great lovingkindness and mercy to my father David, and have made me king in his place. "},{"num":9,"verse":"Now, O Lord God, Your promise to my father David is fulfilled, for You have made me king over a people as numerous as the dust of the earth. "},{"num":10,"verse":"Give me wisdom and knowledge, so that I may go out and come in [performing my duties] before this people, for [otherwise] who can rule and administer justice to this great people of Yours?” "},{"num":11,"verse":"God replied to Solomon, “Because this was in your heart and you did not ask for riches, possessions or honor and personal glory, or the life of those who hate you, nor have you even asked for long life, but you have asked for wisdom and knowledge for yourself so that you may rule and administer justice to My people over whom I have made you king, "},{"num":12,"verse":"wisdom and knowledge have been granted you. I will also give you riches, possessions, and honor, such as none of the kings who were before you has possessed nor will those who will come after you.” "},{"num":13,"verse":"So Solomon went from the high place at Gibeon, from the Tent of Meeting, to Jerusalem. And he reigned over Israel."},{"header":"Solomon’s Wealth"},{"num":14,"verse":"Solomon acquired chariots and horsemen; he had 1,400 chariots and 12,000 horsemen, and he stationed them in the cities [suited for the use] of chariots and with the king at Jerusalem. "},{"num":15,"verse":"The king made silver and gold as plentiful and common in Jerusalem as stones, and he made cedar as plentiful as the sycamore-fig trees in the lowland. "},{"num":16,"verse":"Solomon’s horses were imported from Egypt and from Kue. The king’s merchants purchased them [in large numbers] from Kue at a price. "},{"num":17,"verse":"And they imported chariots from Egypt for 600 shekels of silver apiece, and horses for 150 apiece; and in the same way they exported horses to all the kings of the Hittites and the kings of the Arameans (Syrians)."}]