[{"header":"God Blesses Solomon With Wisdom and Possessions"},{"num":1,"verse":"Solomon, the son of David, firmly established his rule over his kingdom. The Lord his God was with him and made him very great. "},{"num":2,"verse":"Solomon spoke to all Israel, to the commanders of the units of a thousand and a hundred, to the judges, to all the leaders of all Israel, that is, to all the leading fathers."},{"num":3,"verse":"Solomon and the whole assembly with him went to the high place at Gibeon, because God’s Tent of Meeting, which Moses, the servant of the Lord, had made in the wilderness, was located there."},{"num":4,"verse":"(David had brought up the Ark of God from Kiriath Jearim to the place he had prepared for it, because he had pitched a tent for it in Jerusalem. "},{"num":5,"verse":"But the bronze altar, which Bezalel, the son of Uri, the son of Hur, had made, was set up in front of the Tent of the Lord, so that was where Solomon and the assembly sought God.)"},{"num":6,"verse":"Solomon went to the bronze altar there in the presence of the Lord at the Tent of Meeting, and he offered a thousand burnt offerings upon the altar."},{"num":7,"verse":"That night God appeared to Solomon and said to him, “Ask for whatever you want me to give to you.”"},{"num":8,"verse":"Solomon said to God, “You have shown great mercy and faithfulness to my father David, and you have made me king in his place. "},{"num":9,"verse":"Now, Lord God, let your commitment to David my father be fully realized, because you have made me king over a people as numerous as the dust of the earth. "},{"num":10,"verse":"Now give me wisdom and knowledge, so that I can come and go before this people, for who is up to the task of judging this great people of yours?”"},{"num":11,"verse":"God said to Solomon, “Because this was on your heart, and you did not ask for riches, possessions, and honor, or for the lives of those who hate you, or even for many days of life, and because you have asked for wisdom and knowledge for yourself so that you can judge my people, over whom I have made you king, "},{"num":12,"verse":"wisdom and knowledge will be given to you. I will also give you riches, possessions, and honor, the likes of which the kings before you never had, nor will those who come after you.”"},{"header":"Military and Economic Prosperity"},{"num":13,"verse":"After Solomon had gone up to the high place in Gibeon, he returned from the Tent of Meeting to Jerusalem, and he ruled as king over Israel."},{"num":14,"verse":"Solomon accumulated chariots and charioteers. He had fourteen hundred chariots and twelve thousand charioteers, and he stationed them in the chariot cities, as well as with the king in Jerusalem. "},{"num":15,"verse":"In Jerusalem the king made silver and gold as plentiful as ordinary stones. He made cedar as plentiful as sycamore fig trees in the Shephelah. "},{"num":16,"verse":"Solomon’s horses were imported from Egypt and Kue. The king’s dealers bought them from Kue for the market price. "},{"num":17,"verse":"They could import a chariot from Egypt for six hundred silver shekels and a horse for one hundred fifty. In the same way these dealers exported chariots to all the kings of the Hittites and Aram."}]