[{"num":1,"verse":"6 The offering of Solomon at Gibeon. 8 He prayeth unto God to give him wisdom: 11 Which he giveth him, and more. 14 The number of his chariots and horsemen, 15 and of his riches."},{"num":1,"verse":"Then Solomon the son of David was confirmed in his kingdom: and the Lord his God was with him, and magnified him highly."},{"num":2,"verse":"And Solomon spake unto all Israel, to the captains of thousands, and of hundreds, and to the judges, and to all the governors in all Israel, even the chief fathers."},{"num":3,"verse":"So Solomon and all the Congregation with him went to the high place that was at Gibeon: for there was the Tabernacle of the Congregation of God which Moses the servant of the Lord had made in the wilderness."},{"num":4,"verse":"But the Ark of God had David brought up from Kirjath Jearim, when David had made preparation for it: for he had pitched a tent for it in Jerusalem."},{"num":5,"verse":"Moreover, the brazen altar that Bezalel the son of Uri, the son of Hur had made, did he set before the Tabernacle of the Lord: and Solomon and the Congregation sought it."},{"num":6,"verse":"And Solomon offered there before the Lord upon the brazen altar that was in the Tabernacle of the Congregation: even a thousand burnt offerings offered he upon it."},{"num":7,"verse":"¶ The same night did God appear unto Solomon, and said unto him, Ask what I shall give thee."},{"num":8,"verse":"And Solomon said unto God, Thou hast showed great mercy unto David my father, and hast made me to reign in his stead."},{"num":9,"verse":"Now therefore, O Lord God, let thy promise unto David my father be true: for thou hast made me King over a great people, like to the dust of the earth."},{"num":10,"verse":"Give me now wisdom and knowledge, that I may go out and go in before this people: for who can judge this thy great people?"},{"num":11,"verse":"And God said to Solomon, Because this was in thine heart, and thou hast not asked riches, treasures nor honor, nor the lives of thine enemies, neither yet hast asked long life, but hast asked for thee wisdom and knowledge, that thou mightest judge my people, over whom I have made thee King,"},{"num":12,"verse":"Wisdom and knowledge is granted unto thee, and I will give thee riches and treasures and honor, so that there hath not been the like among the kings which were before thee, neither after thee shall there be the like."},{"num":13,"verse":"Then Solomon came from the high place that was at Gibeon, to Jerusalem from before the Tabernacle of the Congregation, and reigned over Israel."},{"num":14,"verse":"And Solomon gathered the chariots and horsemen: and he had a thousand and four hundred chariots, and twelve thousand horsemen, whom he placed in the chariot cities, and with the King at Jerusalem."},{"num":15,"verse":"And the king gave gold and silver at Jerusalem as stone, and gave cedar trees as the wild fig trees, that are abundantly in the plain."},{"num":16,"verse":"Also Solomon had horses brought out of Egypt, and fine linen: the King’s merchants received the fine linen for a price."},{"num":17,"verse":"They came up also and brought out of Egypt some chariot, worth six hundred shekels of silver, that is an horse for an hundred and fifty: and thus they brought horses to all the kings of the Hittites, and to the kings of Aram by their means."}]