[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "None of them can.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Brother is here used in the wide sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where rendered “the one”). The sense is the same whether we make it nominative or accusative. Death is the debt which all owe, and which each must pay for himself. No wealth can buy a man off. God, in whose hand are the issues of life and death, is not to be bribed; nor, as the next verse says, even if the arrangement were possible, would any wealth be sufficient.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:6-14 Here is a description of the spirit and way of worldly people. A man may have wealth, and may have his heart enlarged in love, thankfulness, and obedience, and may do good with it. Therefore it is not men's having riches that proves them to be worldly, but their setting their hearts upon them as the best things. Worldly men have only some floating thoughts of the things of God, while their fixed thoughts, their inward thoughts, are about the world; that lies nearest the heart. But with all their wealth they cannot save the life of the dearest friend they have. This looks further, to the eternal redemption to be wrought out by the Messiah. The redemption of the soul shall cost very dear; but, being once wrought, it shall never need to be repeated. And he, the Redeemer, shall rise again before he sees corruption, and then shall live for evermore, Re 1:18. This likewise shows the folly of worldly people, who sell their souls for that which will never buy them. With all their wealth they cannot secure themselves from the stroke of death. Yet one generation after another applaud their maxims; and the character of a fool, as drawn by heavenly Wisdom itself, Lu 12:16-21, continues to be followed even among professed Christians. Death will ask the proud sinner, Where is thy wealth, thy pomp? And in the morning of the resurrection, when all that sleep in the dust shall awake, the upright shall be advanced to the highest honour, when the wicked shall be filled with everlasting shame and contempt, Da 12:2. Let us now judge of things as they will appear in that day. The beauty of holiness is that alone which the grave cannot touch, or damage.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "None of them can bid any means redeem his brother - None of those who are rich. This verse might be literally rendered, \"a brother cannot by redeeming redeem; a man cannot give to God his own ransom.\" The passage, therefore, may mean either, as in our version, that no one, however rich, can redeem a brother - his own brother - by his wealth; or, that a brother - one who sustains the relation of a brother - cannot rescue another from death. On the word \"redeem,\" see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. It means here that he could not rescue him, or save him from the grave; he could not by his wealth preserve him in life. The whole expression is emphatic: \"redeeming he cannot redeem;\" that is - according to Hebrew usage - he cannot \"possibly\" do it; it \"cannot\" be done. There is here no particular reference to the \"means\" to be employed, but only an emphatic statement of the fact that \"it cannot by any possibility be done.\" The object is to show how powerless and valueless is wealth in regard to the things that most pertain to a man's welfare. It can do literally \"nothing\" in that which most deeply affects man, and in which he most needs help. There is no allusion here to the redemption of the soul, or to the great work of redemption, as that term is commonly understood; but it \"is\" true, in the highest sense, that if wealth cannot \"redeem\" life, or keep our best and nearest friend from the grave, much less can it avail in that which is so much more important, and so much more difficult, the redemption of the soul from eternal ruin. Here, also, as in the matter of saving from the grave, it is absolutely true that wealth can do \"nothing\" - literally, \"nothing\" - in saving the soul of its possessor, or in enabling its possessor to save his best friend. Nothing but the blood of the cross can avail then; and the wealth of the richest can do no more here than the poverty of the poorest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor give to God a ransom for him - This would be more literally rendered, \"a man cannot give to God his ransom;\" that is, he cannot, though in the possession of the most ample wealth, give to God that which would purchase his own release from the grave. On the word \"ransom,\" see as above, the notes at Isaiah 43:3. Compare Matthew 16:26. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nor give to God a ransom for him - This would be more literally rendered, \"a man cannot give to God his ransom;\" that is, he cannot, though in the possession of the most ample wealth, give to God that which would purchase his own release from the grave. On the word \"ransom,\" see as above, the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-9. yet unable to save themselves or others.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Redeem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, from death, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 49:9,10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.; neither from the first death, nor from the second, which he points at ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 49:14,19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His brother; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom he would do his utmost to preserve in life; and consequently not himself. But he seems to mention ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather than himself, because when his brother is sick, he being in health hath the full command and free use of all his wealth, and strength, and wit, and all other means of redeeming his brother; which he hath not, when he himself is dangerously or desperately sick. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Nor give to God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the only Lord of life. and the Judge who hath passed upon him the sentence of death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "None of them can by any means redeem his brother,.... That is, \"with their substance\", or \"riches\", as the Targum and Jarchi supply. Some, according to the order of the words in the original, render them, \"a brother redeeming cannot redeem a man\", or \"anyone\" (q): but, as Aben Ezra observes,  \"a brother\", is the effect, and  \"a man\", is the cause. The Targum is, \"his brother that is a captive, a man redeeming cannot redeem with his substance\"; or by any means redeem. Indeed a rich man may redeem his brother from debt, or from a prison, into which he is cast for it, by paying his debts for him; or from thraldom and bondage, being taken captive and becoming a prisoner of war, by giving a ransom for him. This he may do with respect to man; but, with respect to God, he cannot, with all his riches, pay the debts he owes to the law and justice of God; nor free him from his bondage to sin, Satan, and the law, by whom he is held a captive. The sense here is, that he cannot redeem him from death; he cannot, with all his money, secure him from dying; nor, when dead, bring him back from the grave; and much less deliver him from eternal death, or wrath to come; this only God can do, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nor give to God a ransom for him; a ransom to redeem from sin, and so from the curse of the law and eternal death, must be given to God, against whom sin is committed, the lawgiver that is able to save and destroy; whose law is transgressed by it, and must be fulfilled; and whose justice is affronted and injured, and must be satisfied; and who is the creditor to whom men are debtors, and therefore the payment must be made to him. Hence our Lord Jesus Christ, the Redeemer of his people, paid the ransom price to God, and offered himself a sacrifice to him; see Ephesians 5:2. But this ransom is not of man's giving, but of God's; it is of his finding out in his infinite wisdom: he set forth and sent forth Christ to be the ransom or \"propitiation\" (r), as the word here used signifies; and Christ came to give his life and himself a ransom for many, and is the propitiation for their sins: and this is a sufficient one, a plenteous redemption, and there needs no other, not is there any other; there were typical atonements under the law, but there is no real atonement, propitiation, or ransom, but by the precious blood of Christ; not by corruptible things, as silver and gold; with these a man cannot give to God a ransom for himself, or for his brother. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "nor give to God a ransom for him; a ransom to redeem from sin, and so from the curse of the law and eternal death, must be given to God, against whom sin is committed, the lawgiver that is able to save and destroy; whose law is transgressed by it, and must be fulfilled; and whose justice is affronted and injured, and must be satisfied; and who is the creditor to whom men are debtors, and therefore the payment must be made to him. Hence our Lord Jesus Christ, the Redeemer of his people, paid the ransom price to God, and offered himself a sacrifice to him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But this ransom is not of man's giving, but of God's; it is of his finding out in his infinite wisdom: he set forth and sent forth Christ to be the ransom or \"propitiation\" (r), as the word here used signifies; and Christ came to give his life and himself a ransom for many, and is the propitiation for their sins: and this is a sufficient one, a plenteous redemption, and there needs no other, not is there any other; there were typical atonements under the law, but there is no real atonement, propitiation, or ransom, but by the precious blood of Christ; not by corruptible things, as silver and gold; with these a man cannot give to God a ransom for himself, or for his brother. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) So Cocceius; and some in Michaelis. (r) \"propitiationem suam\", Pagninus, Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) So Cocceius; and some in Michaelis. (r) \"propitiationem suam\", Pagninus, Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "None of them can by any means redeem his brother, nor give to God a ransom for him:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The first answer to the question, ‘Wherefore should I fear’? These men make a god of their wealth. They trust in it and glory in it, as the godly man trusts in Jehovah and glories in Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But how powerless it is! It cannot deliver anyone from death. If the rich man’s friends have so little to hope, his victims have little to fear.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The language of this verse and the next is borrowed from the ancient law in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ransom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "redemption of life",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "soul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") occur together, the latter phrase being found nowhere else. If a man’s neglect to keep a dangerous ox under proper control had been the cause of another man’s death, his life was forfeit. But he might redeem his life by paying a ransom to the relatives of the deceased person. Probably he would always be allowed to do so, and the penalty of death would never be exacted. Another law prohibited the pardon of a murderer upon the mere payment of a fine (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), lest rich men should regard the taking of life as a matter of indifference. Thus the idea of the payment of money as the equivalent of a life was familiar. There were cases in which wealth could deliver from death, when man was dealing with man. But when God claims the life, riches are of no avail.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": his most intimate relative or friend. Possibly there may be an allusion to the use of the word in dirges. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the position of the word at the beginning of the sentence is peculiar, and an adversative particle seems to be needed. It has therefore been plausibly conjectured that we should read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ǎk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘surely’ or ‘but’ (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 49:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), in place of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "âch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘brother,’ and, with a slight alteration of the vowels, render thus:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But no one can by any means redeem himself,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nor give to God the ransom He requires.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The reading of the Massoretic Text however is attested by the LXX and other Ancient Versions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "None of them can by any means",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "redeem his brother.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The text is suspected. If we read ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אַך",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Ewald and Professor Cheyne, the right translation will be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nevertheless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "no man can by any means redeem himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " With all his boasting, the rich man cannot effect his own redemption; nor, however great his wealth, can he give to God a ransom for him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for himself. \"Brother\" is not used in the Psalms in the sense of \"fellow-man,\" but only in the literal sense of close blood, relation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 49:6-13) First division of the sermon. Those who have to endure suffering from rich sinners have no need to fear, for the might and splendour of their oppressors is hastening towards destruction. ימי רע are days in which one experiences evil, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 94:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The genitive r` is continued in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a clause that is subordinate to the בימי of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The poet calls his crafty and malicious foes עקבי. There is no necessity for reading עקבי as Bttcher does, since without doubt a participial noun עקב, supplantator, can be formed from עקב, supplantare; and although in its branchings out it coincides with עקב, planta, its meaning is made secure by the connection. To render the passage: \"when wickedness surrounds me about my heels,\" whether with or without changing עון into עון (Hupfeld, von Ortenberg), is proved on all sides to be inadmissible: it ought to have been עול instead of עון; but even then it would still be an awkward expression, \"to surround any one's heels,\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This might be avoided if it were possible for עון עקבי to mean \"the sin that follows my heels, that follows me at the heels;\" but apart from עון being unsuitable with this interpretation, an impossible meaning is thereby extorted from the genitive construction. This, however, is perhaps what is meant by the expression of the lxx, ἡ ἀνομία τῆς πτέρνης μου, so much spoken of in the Greek Church down to the present day.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the הבּטחים, which follows, would be unconnected with what precedes. This last word comes after עקבי, giving minuteness to the description, and is then continued quite regularly in Psalm 49:7 by the finite verb. Up to this point all is clear enough; but now the difficulties accumulate. One naturally expects the thought, that the rich man is not able to redeem himself from death. Instead of this it is said, that no man is able to redeem another from death. Ewald, Bttcher, and others, therefore, take אח, as in Ezekiel 18:10; Ezekiel 21:20 (vid., Hitzig), to be a careless form of writing for אך, and change יפדּה into the reflexive יפּדה; but the thought that is sought thus to be brought to is only then arrived at with great difficulty: the words ought to be אך אישׁ לא יפדּה נפשׁו. The words as they stand assert: a brother (אח, as a prominently placed object, with Rebia magnum,  equals  אהיו, cf. Ezekiel 5:10; Ezekiel 18:18; Micah 7:6; Malachi 1:6) can a man by no means redeem, i.e., men cannot redeem one another. Hengstenberg and Hitzig find the thought that is to be expected in Psalm 49:8: the rich ungodly man can with all his riches not even redeem another (אח), much less then can he redeem himself, offer a כּפר for himself. But if the poet meant to be so understood, he must have written ולא and כּפר נפשׁו. Psalm 49:8 and Psalm 49:8 bear no appearance of referring to different persons; the second clause is, on the contrary, the necessary supplement of the first: Among men certainly it is possible under some circumstances for one who is delivered over to death to be freed by money, but no כּפר ( equals  פּדיון נפשׁ, Exodus 21:30 and frequently) can be given to God (לאלהים).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the הבּטחים, which follows, would be unconnected with what precedes. This last word comes after עקבי, giving minuteness to the description, and is then continued quite regularly in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by the finite verb. Up to this point all is clear enough; but now the difficulties accumulate. One naturally expects the thought, that the rich man is not able to redeem himself from death. Instead of this it is said, that no man is able to redeem another from death. Ewald, Bttcher, and others, therefore, take אח, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (vid., Hitzig), to be a careless form of writing for אך, and change יפדּה into the reflexive יפּדה; but the thought that is sought thus to be brought to is only then arrived at with great difficulty: the words ought to be אך אישׁ לא יפדּה נפשׁו. The words as they stand assert: a brother (אח, as a prominently placed object, with Rebia magnum,  equals  אהיו, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") can a man by no means redeem, i.e., men cannot redeem one another. Hengstenberg and Hitzig find the thought that is to be expected in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": the rich ungodly man can with all his riches not even redeem another (אח), much less then can he redeem himself, offer a כּפר for himself. But if the poet meant to be so understood, he must have written ולא and כּפר נפשׁו. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " bear no appearance of referring to different persons; the second clause is, on the contrary, the necessary supplement of the first: Among men certainly it is possible under some circumstances for one who is delivered over to death to be freed by money, but no כּפר ( equals  פּדיון נפשׁ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 21:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and frequently) can be given to God (לאלהים).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "All idea of the thought one would most naturally look for must therefore be given up, so far as it can be made clear why the poet has given no direct expression to it. And this can be done. The thought of a man's redeeming himself is far from the poet's mind; and the contrast which he has before his mind is this: no man can redeem another, Elohim only can redeem man. That one of his fellow-men cannot redeem a man, is expressed as strongly as possible by the words לא־פדה יפדּה; the negative in other instances stands after the intensive infinitive, but here, as in Genesis 3:4; Amos 9:8; Isaiah 28:28, before it. By an easy flight of irony, Psalm 49:9 says that the lu'tron which is required to be paid for the souls of men is too precious, i.e., exorbitant, or such as cannot be found, and that he (whoever might wish to lay it down) lets it alone (is obliged to let it alone) for ever  Thus much is clear enough, so far as the language is concerned (וחדל according to the consec. temp.  equals  ויחדּל), and, although somewhat fully expressed, is perfectly in accordance with the connection. But how is Psalm 49:10 attached to what precedes? Hengstenberg renders it, \"he must for ever give it up, that he should live continually and not see the grave.\" But according to the syntax, ויהי cannot be attached to וחדל, but only to the futures in Psalm 49:8, ranking with which the voluntative ויחי, ut vivat (Ew. 347, a). Thus, therefore, nothing remains but to take Psalm 49:9 (which von Ortenberg expunges as a gloss upon Psalm 49:8) as a parenthesis; the principal clause affirms that no man can give to God a ransom that shall protect another against death, so that this other should still continue (עוד) to live, and that without end (לנצח), without seeing the grave, i.e., without being obliged to go down into the grave. The כּי in Psalm 49:11 is now confirmatory of what is denied by its opposite; it is, therefore, according to the sense, imo (cf. 1 Kings 21:15): ...that he may not see the grave - no indeed, without being able to interpose and alter it, he must see how all men, without distinction, succumb to death. Designedly the word used of the death of wise men is מוּת, and of the death of the fool and the stupid man, אבד. Kurtz renders: \"together with the fool and the slow of understanding;\"; but יחד as a proposition cannot be supported; moreover, ועזבוּ would then have \"the wise\" as its subject, which is surely not the intention of the poet. Everything without distinction, and in mingled confusion, falls a prey to death; the rich man must see it, and yet he is at the same time possessed by the foolish delusion that he, with his wealth, is immortal.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All idea of the thought one would most naturally look for must therefore be given up, so far as it can be made clear why the poet has given no direct expression to it. And this can be done. The thought of a man's redeeming himself is far from the poet's mind; and the contrast which he has before his mind is this: no man can redeem another, Elohim only can redeem man. That one of his fellow-men cannot redeem a man, is expressed as strongly as possible by the words לא־פדה יפדּה; the negative in other instances stands after the intensive infinitive, but here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", before it. By an easy flight of irony, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " says that the lu'tron which is required to be paid for the souls of men is too precious, i.e., exorbitant, or such as cannot be found, and that he (whoever might wish to lay it down) lets it alone (is obliged to let it alone) for ever  Thus much is clear enough, so far as the language is concerned (וחדל according to the consec. temp.  equals  ויחדּל), and, although somewhat fully expressed, is perfectly in accordance with the connection. But how is ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " attached to what precedes? Hengstenberg renders it, \"he must for ever give it up, that he should live continually and not see the grave.\" But according to the syntax, ויהי cannot be attached to וחדל, but only to the futures in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ranking with which the voluntative ויחי, ut vivat (Ew. 347, a). Thus, therefore, nothing remains but to take ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (which von Ortenberg expunges as a gloss upon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as a parenthesis; the principal clause affirms that no man can give to God a ransom that shall protect another against death, so that this other should still continue (עוד) to live, and that without end (לנצח), without seeing the grave, i.e., without being obliged to go down into the grave. The כּי in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is now confirmatory of what is denied by its opposite; it is, therefore, according to the sense, imo (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 21:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): ...that he may not see the grave - no indeed, without being able to interpose and alter it, he must see how all men, without distinction, succumb to death. Designedly the word used of the death of wise men is מוּת, and of the death of the fool and the stupid man, אבד. Kurtz renders: \"together with the fool and the slow of understanding;\"; but יחד as a proposition cannot be supported; moreover, ועזבוּ would then have \"the wise\" as its subject, which is surely not the intention of the poet. Everything without distinction, and in mingled confusion, falls a prey to death; the rich man must see it, and yet he is at the same time possessed by the foolish delusion that he, with his wealth, is immortal.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The reading קברם (lxx, Targ., Syr.), preferred by Ewald, and the conjecture קברם, adopted by Olshausen and Riehm, give a thought that is not altogether contrary to the connection, viz., the narrow grave is the eternal habitation of those who called broad lands their own; but this thought appears here, in view of Psalm 49:12, too early. קרב denotes the inward part, or that which is within, described according to that which encircles or contains it: that which is within them is, \"their houses (pronounce bāttēmo) are for ever\" (Hengstenberg, Hitzig); i.e., the contents of their inward part is the self-delusion that their houses are everlasting, and their habitations so durable that one generation after another will pass over them; cf. the similar style of expression in Psalm 10:4, Esther 5:7. Hitzig further renders: men celebrate their names in the lands; קרא בשׁם, to call with a name  equals  solemnly to proclaim it, to mention any one's name with honour (Isaiah 44:5). But it is unlikely that the subject of קראוּ should now again be any other than the rich men themselves; and עלי אדמות for בּכל־הארץ or בּארצות is contrary to the usage of the language. אדמה is the earth as tillage, אדמות (only in this passage) in this connection, fields, estates, lands; the proclaiming of names is, according to 2 Samuel 12:28; 1 Kings 8:43; Amos 9:12, equivalent to the calling of the lands or estates after their (the possessors') names (Bצttcher, Hupfeld, Kurtz). The idea of the rich is, their houses and dwelling-places (and they themselves who have grown up together with them) are of eternal duration; accordingly they solemnly give their own names to their lands, as being the names of immortals. But, adds the poet, man בּיקר, in the pomp of his riches and outward show, abideth not (non pernoctat  equals  non permanet). ביקר is the complement of the subject, although it logically (cf. Psalm 45:13) also belongs to בּל־ילין. Bttcher has shown the impropriety of reading בּל־יבין here according to Psalm 49:20. There are other instances also of refrains that are not exact repetitions; and this correction is moreover at once overthrown by the fact that בל will not suit יבין, it would stamp each man of rank, as such, as one deficient in intelligence. On the other hand, this emotional negative בל is admirably suitable to ילין: no indeed, he has no abiding. He is compared (נמשׁל like the New Testament ὡμοιώθη), of like kind and lot, to cattle (כּ as in Job 30:19). נדמוּ is an attributive clause to כּבּהמות: like heads of cattle which are cut off or destroyed. The verb is so chosen that it is appropriate at the same time to men who are likened to the beasts (Hosea 10:7, Hosea 10:15, Obadiah 1:5, Isaiah 6:5). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The reading קברם (lxx, Targ., Syr.), preferred by Ewald, and the conjecture קברם, adopted by Olshausen and Riehm, give a thought that is not altogether contrary to the connection, viz., the narrow grave is the eternal habitation of those who called broad lands their own; but this thought appears here, in view of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", too early. קרב denotes the inward part, or that which is within, described according to that which encircles or contains it: that which is within them is, \"their houses (pronounce bāttēmo) are for ever\" (Hengstenberg, Hitzig); i.e., the contents of their inward part is the self-delusion that their houses are everlasting, and their habitations so durable that one generation after another will pass over them; cf. the similar style of expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hitzig further renders: men celebrate their names in the lands; קרא בשׁם, to call with a name  equals  solemnly to proclaim it, to mention any one's name with honour (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But it is unlikely that the subject of קראוּ should now again be any other than the rich men themselves; and עלי אדמות for בּכל־הארץ or בּארצות is contrary to the usage of the language. אדמה is the earth as tillage, אדמות (only in this passage) in this connection, fields, estates, lands; the proclaiming of names is, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 12:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", equivalent to the calling of the lands or estates after their (the possessors') names (Bצttcher, Hupfeld, Kurtz). The idea of the rich is, their houses and dwelling-places (and they themselves who have grown up together with them) are of eternal duration; accordingly they solemnly give their own names to their lands, as being the names of immortals. But, adds the poet, man בּיקר, in the pomp of his riches and outward show, abideth not (non pernoctat  equals  non permanet). ביקר is the complement of the subject, although it logically (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") also belongs to בּל־ילין. Bttcher has shown the impropriety of reading בּל־יבין here according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There are other instances also of refrains that are not exact repetitions; and this correction is moreover at once overthrown by the fact that בל will not suit יבין, it would stamp each man of rank, as such, as one deficient in intelligence. On the other hand, this emotional negative בל is admirably suitable to ילין: no indeed, he has no abiding. He is compared (נמשׁל like the New Testament ὡμοιώθη), of like kind and lot, to cattle (כּ as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). נדמוּ is an attributive clause to כּבּהמות: like heads of cattle which are cut off or destroyed. The verb is so chosen that it is appropriate at the same time to men who are likened to the beasts (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]