[{"num":1,"verse":"In the month of Nisan, in the twentieth year of King Artaxerxes, the king was about to be served wine. I took the wine and gave it to the king. Since I had never seemed sad in his presence,"},{"num":2,"verse":"the king asked me, “Why do you seem sad? Since you aren’t sick, you must have a broken heart!”"},{"num":3,"verse":"and replied, “May the king live forever! Why shouldn’t I seem sad when the city, the place of my family’s graves, is in ruins and its gates destroyed by fire?”"},{"num":4,"verse":"The king asked, “What is it that you need?”"},{"num":5,"verse":"and replied, “If it pleases the king, and if your servant has found favor with you, please send me to Judah, to the city of my family’s graves so that I may rebuild it.”"},{"num":6,"verse":"With the queen sitting beside him, the king asked me, “How long will you be away and when will you return?” So it pleased the king to send me, and I told him how long I would be gone."},{"num":7,"verse":"I also said to him, “If it pleases the king, may letters be given me addressed to the governors of the province Beyond the River to allow me to travel to Judah."},{"num":8,"verse":"May the king also issue a letter to Asaph the keeper of the king’s forest, directing him to supply me with timber for the beams of the temple fortress gates, for the city wall, and for the house in which I will live.”"},{"header":"Inspecting Jerusalem"},{"num":9,"verse":"So I went to the governors of the province Beyond the River and gave them the king’s letters. The king had sent officers of the army and cavalry with me."},{"num":10,"verse":"When Sanballat the Horonite and Tobiah the Ammonite official heard this, they were very angry that someone had come to seek the welfare of the people of Israel."},{"num":11,"verse":"When I reached Jerusalem and had been there for three days,"},{"num":12,"verse":"I set out at night, taking only a few people with me. I didn’t tell anyone what my God was prompting me to do for Jerusalem, and the only animal I took was the one I rode."},{"num":13,"verse":"I went out by night through the Valley Gate past the Dragon’s Spring to the Dung Gate so that I could inspect the walls of Jerusalem that had been broken down, as well as its gates, which had been destroyed by fire."},{"num":14,"verse":"Then I went on to the Spring Gate and to the King’s Pool. Since there was no room for the animal on which I was riding to pass,"},{"num":15,"verse":"I went up by way of the valley by night and inspected the wall. Then I turned back and returned by entering through the Valley Gate."},{"header":"Let’s rebuild"},{"num":16,"verse":"The officials didn’t know where I had gone or what I was doing. I hadn’t yet told the Jews, the priests, the officials, the officers, or the rest who were to do the work."},{"num":17,"verse":"So I said to them, “You see the trouble that we’re in: Jerusalem is in ruins, and its gates are destroyed by fire! Come, let’s rebuild the wall of Jerusalem so that we won’t continue to be in disgrace.”"},{"num":18,"verse":"I told them that my God had taken care of me, and also told them what the king had said to me."},{"num":19,"verse":"But when Sanballat the Horonite, Tobiah the Ammonite official, and Geshem the Arab heard about it, they mocked and made fun of us. “What are you doing?” they asked. “Are you rebelling against the king?”"},{"num":20,"verse":"“The God of heaven will give us success!” I replied. “As God’s servants, we will start building. But you will have no share, right, or claim in Jerusalem.”"}]