[{"num":2,"verse":"1 After Nehemiah had obtained letters of Artaxerxes, 11 he came to Jerusalem, 17 and built the walls."},{"num":1,"verse":"Now in the month Nisan in the twentieth year of king Artaxerxes, the wine stood before him, and I took up the wine, and gave it unto the king. Now I was not before time sad in his presence."},{"num":2,"verse":"And the king said unto me, Why is thy countenance sad, seeing thou art not sick? this is nothing, but sorrow of heart. Then was I sore afraid,"},{"num":3,"verse":"And I said to the King, God save the king forever: why should not my countenance be sad, when the city and house of the sepulchers of my fathers lieth waste, and the gates thereof are devoured with fire?"},{"num":4,"verse":"And the king said unto me, For what thing doest thou require? Then I prayed to the God of heaven,"},{"num":5,"verse":"And said unto the king, If it please the king, and if thy servant have found favor in thy sight, I desire that thou wouldest send me to Judah unto the city of the sepulchers of my fathers, that I may build it."},{"num":6,"verse":"And the King said unto me, (the Queen also sitting by him:) How long shall thy journey be? and when wilt thou come again? So it pleased the king, and he sent me, and I set him a time."},{"num":7,"verse":"After I said unto the King, If it please the King, let them give me letters to the captains beyond the River, that they may convey me over, till I come into Judah,"},{"num":8,"verse":"And letters unto Asaph the keeper of the king’s park, that he may give me timber to build the gates of the palace (which appertained to the house) and for the walls of the city, and for the house that I shall enter into. And the king gave me according to the good hand of my God upon me."},{"num":9,"verse":"¶ Then came I to the captains beyond the River, and gave them the king’s letters. And the king had sent captains of the army and horsemen with me."},{"num":10,"verse":"But Sanballat the Horonite, and Tobiah a servant an Ammonite heard it, and it grieved them sore, that there was come a man which sought the wealth of the children of Israel."},{"num":11,"verse":"So I came to Jerusalem, and was there three days."},{"num":12,"verse":"And I rose in the night, I, and a few men with me: for I told no man, what God had put in mine heart to do at Jerusalem, and there was not a beast with me, save the beast whereon I rode."},{"num":13,"verse":"And I went out by night by the gate of the valley, and came before the dragon well, and to the dung port, and viewed the walls of Jerusalem, how they were broken down, and the ports thereof devoured with the fire."},{"num":14,"verse":"Then I went forth unto the gate of the fountain, and to the king’s fish pool, and there was no room for the beast that was under me to pass."},{"num":15,"verse":"Then went I up in the night by the brook, and viewed the wall, and turned back, and coming back, I entered by the gate of the valley, and returned."},{"num":16,"verse":"And the rulers knew not whither I was gone, nor what I did, neither did I as yet tell it unto the Jews, nor to the Priests, nor to the noble men, nor to the rulers, nor to the rest that labored in the work."},{"num":17,"verse":"Afterward I said unto them, Ye see the misery that we are in, how Jerusalem lieth waste, and the gates thereof are burnt with fire: come, and let us build the wall of Jerusalem, that we be no more a reproach."},{"num":18,"verse":"Then I told them of the hand of my God, (which was good over me) and also of the king’s words that he had spoken unto me. And they said, Let us rise, and build. So they strengthened their hand to good."},{"num":19,"verse":"But when Sanballat the Horonite, and Tobiah the servant an Ammonite, and Geshem the Arabian heard it, they mocked us, and despised us, and said, What a thing is this that ye do? Will ye rebel against the king?"},{"num":20,"verse":"Then answered I them, and said to them, The God of heaven, he will prosper us, and we his servants will rise up and build: but as for you, ye have no portion nor right, nor memorial in Jerusalem."}]