[{"header":"The King Sends Nehemiah to Jerusalem"},{"num":2,"verse":"In the month Nisan, in the twentieth year of King Artaxerxes, wine was in front of him. And I took up the wine and gave it to the king. Now I had not been sad in front of him before. "},{"num":2,"verse":"So the king said to me, “Why is your face so sad when you are not sick? It must be that you are sad in your heart.” Then I was very much afraid. "},{"num":3,"verse":"I said to the king, “Let the king live forever. Why should my face not be sad when the city, the place of my fathers’ graves, lies waste and its gates destroyed by fire?” "},{"num":4,"verse":"Then the king said to me, “What are you asking for?” So I prayed to the God of heaven. "},{"num":5,"verse":"And I said to the king, “If it pleases the king, and if your servant has found favor in your eyes, send me to Judah, to the city of my fathers’ graves. Let me build it again.” "},{"num":6,"verse":"The king said to me, with the queen sitting beside him, “How long will you be gone, and when will you return?” So it pleased the king to send me, and I set him a time. "},{"num":7,"verse":"And I said to the king, “If it please the king, let letters be given to me for the leaders of the lands on the other side of the River, that they may allow me to pass through until I come to Judah. "},{"num":8,"verse":"Send a letter with me for Asaph, the keeper of the king’s trees, that he may give me cut trees. These will be for making heavy wood pieces for the gates of the strong place by the house of God, and for the city wall, and for the house where I will stay.” And the king gave me what I asked for, because the good hand of my God was upon me."},{"num":9,"verse":"Then I came to the leaders of the lands on the other side of the River and gave them the letters. Now the king had sent army captains and horsemen with me. "},{"num":10,"verse":"When Sanballat the Horonite and Tobiah the Ammonite workman heard about it, they were not pleased that someone had come to make things go well for the sons of Israel."},{"num":11,"verse":"I came to Jerusalem and was there for three days. "},{"num":12,"verse":"Then I got up in the night, I and a few men with me. I did not tell anyone what my God was putting into my mind to do for Jerusalem. There was no animal with me except the one I was sitting on. "},{"num":13,"verse":"I went out at night by the Valley Gate to the Dragon’s Well and to the Waste Gate. I looked at the walls of Jerusalem which were broken down and its gates which were destroyed by fire. "},{"num":14,"verse":"Then I went on to the Well Gate and the King’s Pool, but there was no place for the animal I was on to pass. "},{"num":15,"verse":"So I went up in the night by the valley and looked at the wall. Then I went in through the Valley Gate again and returned. "},{"num":16,"verse":"The leaders did not know where I had gone or what I had done. And I had not yet told the Jews, the religious leaders, the rulers, the leaders, or the rest who did the work."},{"num":17,"verse":"Then I said to them, “You see the problem we have. Jerusalem lies waste and its gates are destroyed by fire. Come, let us build the wall of Jerusalem again, that we may no longer be put to shame.” "},{"num":18,"verse":"I told them how the hand of my God had brought good to me, and the words that the king had spoken to me. Then they said, “Let us get up and build.” So they put their hands to the good work. "},{"num":19,"verse":"But when Sanballat the Horonite, Tobiah the Ammonite servant, and Geshem the Arab heard about it, they made fun of us and hated us. They said, “What is this thing you are doing? Are you turning against the king?” "},{"num":20,"verse":"I answered them, “The God of heaven will make it go well for us. So we His servants will get up and build. But you have no share or right or anything to be remembered in Jerusalem.”"}]