[{"num":2,"verse":"And it was done in the month of Nisan, that is, April, in the twentieth year of Artaxerxes, the king, and wine was before him, and I took up the wine, and I gave it to the king, and I was as languishing before his face."},{"num":2,"verse":"And the king said to me, Why is thy cheer sorry, or heavy, since I see not thee sick? This is not without cause; but I know not what evil is in thine heart. And I dreaded full greatly; (And the king said to me, Why is thy face so sad? for I see that thou art not sick. This is not without a cause; but I do not know what the problem is in thy heart. And I greatly feared;)"},{"num":3,"verse":"and I said to the king, King, live thou (into) without end; why should not my cheer mourn? for the city of the house of the sepulchres of my father[s] is deserted, either forsaken, and the gates thereof be burnt with fire. (and I said to the king, O king, may thou live forevermore; but why should my face not look sad? for the city of the house of my forefathers’ graves, or tombs, is deserted, and its gates be burned down.)"},{"num":4,"verse":"And the king said to me, For what thing askest thou? And I prayed (to the) God of heaven,"},{"num":5,"verse":"and I said to the king, If it seemeth good to the king, and if it pleaseth thy servants which be before thy face, I beseech thee, that thou send me into Judah, to the city of the sepulchre(s) of my father(s), and I shall build it (again). (and I said to the king, If it seemeth good to the king, and if thy servant who is before thy face pleaseth thee, I beseech thee, that thou send me to Judah, to the city of my forefathers’ graves, and I shall rebuild it.)"},{"num":6,"verse":"And the king said to me, and the queen sat beside him, Unto what time shall thy way be, and when shalt thou turn again? And it pleased to the king, and he sent me forth, and I set to the king a time of coming again; (And the king said to me, as the queen sat beside him, How long shalt thy be away, and when shalt thou return? And so it pleased the king, and he sent me forth, and I set a time when I would return to the king;)"},{"num":7,"verse":"and I said to the king, If it seemeth good to the king, give he epistles, or letters, to me to the dukes of the country beyond the flood, that they lead me over, till I come into Judah; (and I said to the king, If it seemeth good to the king, let him give me letters to the governors of the province west of the Euphrates River, with orders to help me get to Judah;)"},{"num":8,"verse":"and a letter to Asaph, the keeper of the king’s forest, that he give trees to me, that I may cover (with it) the gates of the tower of the house, and of the wall of the city, and the house, into which I shall enter. And the king gave (the letters) to me, by the good hand of my God, (that was) with me. (and also a letter to Asaph, the keeper of the king’s forests, ordering him to give me wood, or timber, so that I can make beams for the gates of the stronghold, or the fortress, and for the city wall, and for the house in which I shall live. And the king gave me the letters, by the good hand of my God, who was with me.)"},{"num":9,"verse":"And I came to the dukes of the country beyond the flood, and I gave to them the letters of the king. Soothly the king had sent with me the princes of knights, and (some) horsemen. (And I came to the governors of the province west of the Euphrates River, and I gave them the king’s letters. And the king had sent with me the leaders of the horsemen, and some horsemen as well.)"},{"num":10,"verse":"And Sanballat (the) Horonite, and Tobiah, the servant, (the) Ammonite, heard, and they were sorrowful by great torment, that a man was come, that sought prosperity of the sons of Israel. (And Sanballat the Horonite, and Tobiah the Ammonite servant, heard of it, and they were greatly vexed that a man had come, who sought to do good for the Israelites.)"},{"num":11,"verse":"And I came into Jerusalem, and I was there three days."},{"num":12,"verse":"And I rose up by night, I and a few men with me, and I showed not to any man (and I told no one), what thing God had given in mine heart, that I would do in Jerusalem; and there was no work beast with me, but the beast that I sat on."},{"num":13,"verse":"And I went out by the gate of the valley by night, and before the well of the dragon, and to the gate of dung; and I beheld the wall of Jerusalem (that was) destroyed, and the gates thereof (that were) wasted by fire. (And I went out at night through the Valley Gate, toward the Dragon Well, and the Dung Gate; and I looked at the wall of Jerusalem, that was broken in many places, and at its gates, that had been destroyed by fire.)"},{"num":14,"verse":"And I passed forth to the gate of the well, and to the water conduit of the king, and there was no place for to pass, to the horse, that I sat upon; (And I passed on to the Fountain Gate, and to the King’s Pool, but there was no place for the horse that I sat on, to pass through;)"},{"num":15,"verse":"and in the night I went up by the strand, and I beheld the wall, and I turned again, and came to the gate of the valley, and I went again (to my lodging). (and then I went up that night by the valley, and I looked at the wall, and then I returned, and came back to the Valley Gate, and went home to my lodging.)"},{"num":16,"verse":"Forsooth the magistrates knew not, whither I had gone, either what I would do; but also I had not showed any thing to the Jews, and [the] priests, and to the best men, and [the] magistrates, and to [the] other men that made the work, till that time. (But the magistrates did not know where I had gone, or what I planned to do; and also I had not told anything to the Jews, or the priests, or the leaders, or the magistrates, or the other men who would do the work, up to that time.)"},{"num":17,"verse":"And I said to them, Ye know the torment, in which we Jews be, for Jerusalem is deserted, and the gates thereof be wasted with fire; come ye, build we [up] the walls of Jerusalem, and be we no more (a) shame/and be we no more in shame. (And so I said to them, Ye know the torment in which we Jews be, for Jerusalem is deserted, and its gates have been destroyed by fire; come ye, let us rebuild the wall of Jerusalem, and let us be in shame no more.)"},{"num":18,"verse":"And I showed to them the hand of my God, that it was good with me, and the words of the king, which he spake to me; and I said, Rise we up, and build we (it again); and the hands of them were strengthened in good. (And I told them how the good hand of my God was upon me, and the words of the king, which he had spoken to me; and they said, Rise we up, and let us rebuild it; and so they strengthened their hands to do this good work.)"},{"num":19,"verse":"And Sanballat (the) Horonite, and Tobiah, the servant, (the) Ammonite, and Geshem (of) Arabs, heard this, and they scorned us, and despised; and said, What is this thing, that ye do? whether ye rebel against the king? (And Sanballat the Horonite, and Tobiah the Ammonite servant, and Geshem the Arab heard of this, and they scorned us, and despised us; and they said, What is this, that ye do? do ye rebel against the king?)"},{"num":20,"verse":"And I answered to them a word, and I said to them, God himself of heaven helpeth us, and we be his servants; rise we up, and build; forsooth part, and rightwiseness, and mind, in Jerusalem, is not to you. (And I answered to them, and said, The God of heaven helpeth us, and we be his servants; we shall rise up, and rebuild it; but there is no part, or right, or precedent, for you in Jerusalem.)"}]