[{"num":5,"verse":"Let me [as God’s representative] sing of and for my greatly Beloved [God, the Son] a tender song of my Beloved concerning His vineyard [His chosen people]. My greatly Beloved had a vineyard on a very fruitful hill."},{"num":2,"verse":"And He dug and trenched the ground and gathered out the stones from it and planted it with the choicest vine and built a tower in the midst of it and hewed out a winepress in it. And He looked for it to bring forth grapes, and it brought forth wild grapes."},{"num":3,"verse":"And now, O inhabitants of Jerusalem and men of Judah, judge, I pray you, between Me and My vineyard [My people, says the Lord]."},{"num":4,"verse":"What more could have been done for My vineyard that I have not done in it? When I looked for it to bring forth grapes, why did it yield wild grapes?"},{"num":5,"verse":"And now I will tell you what I will do to My vineyard: I will take away its hedge, and it shall be eaten and burned up; and I will break down its wall, and it shall be trodden down [by enemies]."},{"num":6,"verse":"And I will lay it waste; it shall not be pruned or cultivated, but there shall come up briers and thorns. I will also command the clouds that they rain no rain upon it."},{"num":7,"verse":"For the vineyard of the Lord of hosts is the house of Israel, and the men of Judah His pleasant planting [the plant of His delight]. And He looked for justice, but behold, [He saw] oppression and bloodshed; [He looked] for righteousness (for uprightness and right standing with God), but behold, [He heard] a cry [of oppression and distress]!"},{"num":8,"verse":"Woe to those who join house to house [and by violently expelling the poorer occupants enclose large acreage] and join field to field until there is no place for others and you are made to dwell alone in the midst of the land!"},{"num":9,"verse":"In my [Isaiah’s] ears the Lord of hosts said, Of a truth many houses shall be desolate, even great and beautiful ones shall be without inhabitant."},{"num":10,"verse":"For ten acres of vineyard shall yield only about eight gallons, and ten bushels of seed will produce but one bushel."},{"num":11,"verse":"Woe unto those who rise early in the morning, that they may pursue strong drink, who tarry late into the night till wine inflames them!"},{"num":12,"verse":"They have lyre and harp, tambourine and flute and wine at their feasts, but they do not regard the deeds of the Lord, neither do they consider the operation of His hands [in mercy and in judgment]."},{"num":13,"verse":"Therefore My people go into captivity [to their enemies] without knowing it and because they have no knowledge [of God]. And their honorable men [their glory] are famished, and their common people are parched with thirst."},{"num":14,"verse":"Therefore Sheol (the unseen state, the realm of the dead) has enlarged its appetite and opened its mouth without measure; and [Jerusalem’s] nobility and her multitude and her pomp and tumult and [the drunken reveler] who exults in her descend into it."},{"num":15,"verse":"And the common man is bowed down, and the great man is brought low, and the eyes of the haughty are humbled."},{"num":16,"verse":"But the Lord of hosts is exalted in justice, and God, the Holy One, shows Himself holy in righteousness and through righteous judgments."},{"num":17,"verse":"Then shall the lambs feed [among the ruins] as in their own pasture, and [among] the desolate places of the [exiled] rich shall sojourners and aliens eat."},{"num":18,"verse":"Woe to those who draw [calamity] with cords of iniquity and falsehood, who bring punishment to themselves with a cart rope of wickedness,"},{"num":19,"verse":"Who say, Let [the Holy One] make haste and speed His [prophesied] vengeance, that we may see it; and let the purpose of the Holy One of Israel draw near and come, that we may know it!"},{"num":20,"verse":"Woe to those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter!"},{"num":21,"verse":"Woe to those who are wise in their own eyes and prudent and shrewd in their own sight!"},{"num":22,"verse":"Woe to those who are mighty heroes at drinking wine and men of strength in mixing alcoholic drinks!—"},{"num":23,"verse":"Who justify and acquit the guilty for a bribe, but take away the rights of the innocent and righteous from them!"},{"num":24,"verse":"Therefore, as the tongue of fire devours the stubble, and as the dry grass sinks down in the flame, so their root shall be like rottenness and their blossom shall go up like fine dust—because they have rejected and cast away the law and the teaching of the Lord of hosts and have not believed but have treated scornfully and have despised the word of the Holy One of Israel."},{"num":25,"verse":"Therefore is the anger of the Lord kindled against His people, and He has stretched forth His hand against them and has smitten them. And the mountains trembled, and their dead bodies were like dung and sweepings in the midst of the streets. For all this, His anger is not turned away, but His hand is still stretched out [in judgment]."},{"num":26,"verse":"And He will lift up a signal to call together a hostile people from afar [to execute His judgment on Judea], and will hiss for them from the end of the earth [as bees are hissed from their hives], and behold, they shall come with speed, swiftly!"},{"num":27,"verse":"None is weary or stumbles among them, none slumbers or sleeps; nor is the girdle of their loins loosed or the latchet (thong) of their shoes broken;"},{"num":28,"verse":"Their arrows are sharp, and all their bows bent; their horses’ hoofs seem like flint, and their wheels like a whirlwind."},{"num":29,"verse":"Their roaring is like that of a lioness, they roar like young lions; they growl and seize their prey and carry it safely away, and there is none to deliver it."},{"num":30,"verse":"And in that day they [the army from afar] shall roar against [the Jews] like the roaring of the sea. And if one looks to the land, behold, there is darkness and distress; and the light [itself] will be darkened by the clouds of it."}]