[{"num":5,"verse":"I shall sing for my darling the song of mine uncle’s son, of his vineyard. A vinery was made to my darling, in the horn, that is, in an high place and excellent, in the son of oil, that is, in a place full of olives, of whose fruit is wrung out oil. (I shall sing for my darling the song of my darling’s vineyard. A vineyard was made for my darling in the horn, that is, in a high and an excellent place, in the son of oil, that is, in a place full of olives, where oil is wrung out of the fruit.)"},{"num":2,"verse":"And he hedged it, and chose (the) stones thereof, and planted a chosen vinery; and he builded a tower in the midst thereof, and reared (up) a (wine)press therein; and he abode, that it should make grapes, and it made wild grapes (and he waited, for it to yield sweet new grapes, but only sour wild grapes grew there)."},{"num":3,"verse":"Now therefore, ye dwellers of Jerusalem, and ye men of Judah, deem between me and my vinery. (And so now, ye inhabitants of Jerusalem, and ye people of Judah, judge between me and my vineyard.)"},{"num":4,"verse":"What is it that I ought to do more to my vinery, and I did not to it? whether that I abode, that it should make grapes, and it made wild grapes? (What more could I have done for my vineyard, that I did not do for it? but why, when I waited for it to yield sweet grapes, did it instead bring forth only sour wild grapes?)"},{"num":5,"verse":"And now I shall show to you, what I shall do to my vinery. I shall take away the hedge thereof, and it shall be into ravishing (and it shall be eaten up); I shall cast down the wall thereof, and it shall be into defouling;"},{"num":6,"verse":"and I shall set it deserted, either forsaken. It shall not be cut, and it shall not be digged, and briars and thorns shall grow upon it; and I shall command to [the] clouds, that they rain not rain on it."},{"num":7,"verse":"Forsooth the vinery of the Lord of hosts is the house of Israel, and the men of Judah be the delightable burgeoning of him. I abode, that it shall make doom, and lo! wickedness; and that it should do rightfulness, and lo! cry. (And the vineyard of the Lord of hosts is the house of Israel, and the people of Judah be his delightful burgeoning. I waited for them to yield justice, but lo! wickedness; and that they should do righteousness, or do what is right, but lo! cries of distress/cries for justice.)"},{"num":8,"verse":"Woe to you that join house to house, and couple field to field, till to the end of (the) place. Whether ye alone shall dwell in the midst of the land? (Woe to you who join house to house, and couple field to field, until the end of the place. Shall ye live alone in the midst of the land, with no room for anyone else?)"},{"num":9,"verse":"These things be in the ears of me, (yea,) the Lord of hosts (hath said); If many houses be not forsaken, great and fair, without dweller (If many houses be not abandoned, yea, large and beautiful, but with no inhabitants), believe ye not to me."},{"num":10,"verse":"For why ten acres of vines shall make one pottle, and thirty bushels of seed shall make three bushels."},{"num":11,"verse":"Woe to you that rise altogether early to follow drunkenness, and to drink till to eventide, that ye burn with wine. (Woe to you who rise up early to follow drunkenness, and drink until the evening, so that ye burn with wine.)"},{"num":12,"verse":"Harp, and gittern, and tympan, and pipe, and wine be in your feasts; and ye behold not the work of the Lord, neither ye behold the works of his hands. (Harp, and lute, and drum, or tambourine, and pipe, and wine be at your feasts; but ye do not see the work of the Lord, nor do ye see the works of his hands.)"},{"num":13,"verse":"Therefore my people is led captive, either prisoner, for it had not knowing; and the noblemen thereof perished in hunger, and the multitude thereof was dry in thirst. (And so my people be led away as prisoners, for they had no knowledge, or no understanding; and their noble people perished from hunger, and their multitude were dry with thirst.)"},{"num":14,"verse":"Therefore hell hath alarged his soul, and opened his mouth without any end (And so hell hath enlarged itself, and opened its mouth wide); and the strong men thereof, and the people thereof, and the high men (thereof), and the glorious men thereof, shall go down (in)to it."},{"num":15,"verse":"And a man shall be bowed down, and a man of age shall be made low; and the eyes of high men shall be pressed down."},{"num":16,"verse":"And the Lord of hosts shall be enhanced in doom, and [the] holy God shall be hallowed in rightfulness. (And the Lord of hosts shall be exalted in judgement, and the Holy God shall be consecrated in righteousness.)"},{"num":17,"verse":"And lambs shall be fed by their order, and comelings shall eat (of the) desert places turned into plenty."},{"num":18,"verse":"Woe to you that draw wickedness in the cords of vanity, and draw sin as the bond of a wain; (Woe to you who draw along wickedness with the cords of emptiness and futility, and draw along sin as if it were the rope of a cart;)"},{"num":19,"verse":"and ye say, The work of him hasten, and come soon, that we see (it); and the counsel of the Holy (One) of Israel (draw) nigh, and come, and we shall know it."},{"num":20,"verse":"Woe to you that say evil good, and good evil; and put darknesses light, and light darknesses; and put bitter thing into sweet, and sweet thing into bitter. (Woe to you who say that evil is good, and that good is evil; and turn darkness into light, and light into darkness; and make a bitter thing sweet, and a sweet thing bitter.)"},{"num":21,"verse":"Woe to you that be wise men in your eyes, and be prudent before yourselves. (Woe to you who be wise in your own eyes, and think yourselves to be prudent.)"},{"num":22,"verse":"Woe to you that be mighty to drink wine, and be strong to meddle drunkenness; (Woe to you who be mighty to drink wine, and be strong to mix up drunkenness;)"},{"num":23,"verse":"and ye justify a wicked man for gifts, and ye take away the rightfulness of a just man from him. (and ye acquit the wicked for gifts, or for bribes, and ye deny justice for the righteous.)"},{"num":24,"verse":"For this thing, as the tongue of fire devoureth stubble, and the heat of flame burneth, so the root of them shall be as a dead spark, and the seed of them shall ascend as dust; for they casted away the law of the Lord of hosts, and blasphemed the speech of the Holy of Israel (for they threw away the Law of the Lord of hosts, and blasphemed the word of the Holy One of Israel)."},{"num":25,"verse":"Therefore the strong vengeance of the Lord was wroth against his people, and he stretched forth his hand on it, and smote it (and he stretched forth his hand against them, and struck them down); and (the) hills were troubled, and the dead bodies of them were made as a turd in the midst of streets. In all these things the strong vengeance of him was not turned away, but yet his hand was stretched forth."},{"num":26,"verse":"And he shall raise [up] a sign among nations afar, and he shall hiss to him from the ends of [the] earth; and lo! he shall hasten, and shall come swiftly. (And he shall raise up a sign among the nations far away, and he shall whistle for them to come from the ends of the earth; and lo! they shall make haste, and shall swiftly come.)"},{"num":27,"verse":"None is failing neither travailing in that host; he shall not nap, neither sleep, neither the girdle of his reins shall be undone, neither the lace of his shoe shall be broken. (No one is failing, or stumbling, in that army; no one is napping, or sleeping, nor is the girdle of his loins undone, nor is his shoe lace broken.)"},{"num":28,"verse":"His arrows be sharp, and all his bows be bent; the hoofs of his horses be as flint, and his wheels be as the fierceness of tempest. (Their arrows be sharp, and all their bows be bent; the hooves of their horses be like flint, and their wheels be like the fierceness of a tempest.)"},{"num":29,"verse":"His roaring shall be as of a lion; he shall roar as the whelps of lions; and he shall gnash, and shall hold prey, and shall embrace, and none shall be, that shall deliver. (Their roaring is like that of a lion; yea, they shall roar like the whelps of lions; and they shall gnash, and shall take hold of their prey, and shall not let it go, and there shall be no one who can rescue, or who can take, it from them.)"},{"num":30,"verse":"And he shall sound on it in that day, as doeth the sound of the sea; we shall behold into the earth, and lo! darknesses of tribulation, and light is made dark in the darkness thereof. (And they shall sound against it on that day, like the sound of the sea; and we shall behold the earth, and lo! the darkness of tribulation, yea, even the light is made dark in its darkness.)"}]