[[],[{"type":"header","content":"Discerning False Prophets"},{"type":"prose","content":"Dear friends, do not believe everyone who claims to speak by the Spirit. You must test them to see if the spirit they have comes from God. For there are many false prophets in the world."}],[{"type":"prose","content":"This is how we know if they have the Spirit of God: If a person claiming to be a prophet acknowledges that Jesus Christ came in a real body, that person has the Spirit of God."}],[{"type":"prose","content":"But if someone claims to be a prophet and does not acknowledge the truth about Jesus, that person is not from God. Such a person has the spirit of the Antichrist, which you heard is coming into the world and indeed is already here."}],[{"type":"prose","content":"But you belong to God, my dear children. You have already won a victory over those people, because the Spirit who lives in you is greater than the spirit who lives in the world."}],[{"type":"prose","content":"Those people belong to this world, so they speak from the world’s viewpoint, and the world listens to them."}],[{"type":"prose","content":"But we belong to God, and those who know God listen to us. If they do not belong to God, they do not listen to us. That is how we know if someone has the Spirit of truth or the spirit of deception."},{"type":"header","content":"Loving One Another"}],[{"type":"prose","content":"Dear friends, let us continue to love one another, for love comes from God. Anyone who loves is a child of God and knows God."}],[{"type":"prose","content":"But anyone who does not love does not know God, for God is love."}],[{"type":"prose","content":"God showed how much he loved us by sending his one and only Son into the world so that we might have eternal life through him."}],[{"type":"prose","content":"This is real love—not that we loved God, but that he loved us and sent his Son as a sacrifice to take away our sins."}],[{"type":"prose","content":"Dear friends, since God loved us that much, we surely ought to love each other."}],[{"type":"prose","content":"No one has ever seen God. But if we love each other, God lives in us, and his love is brought to full expression in us."}],[{"type":"prose","content":"And God has given us his Spirit as proof that we live in him and he in us."}],[{"type":"prose","content":"Furthermore, we have seen with our own eyes and now testify that the Father sent his Son to be the Savior of the world."}],[{"type":"prose","content":"All who declare that Jesus is the Son of God have God living in them, and they live in God."}],[{"type":"prose","content":"We know how much God loves us, and we have put our trust in his love.God is love, and all who live in love live in God, and God lives in them."}],[{"type":"prose","content":"And as we live in God, our love grows more perfect. So we will not be afraid on the day of judgment, but we can face him with confidence because we live like Jesus here in this world."}],[{"type":"prose","content":"Such love has no fear, because perfect love expels all fear. If we are afraid, it is for fear of punishment, and this shows that we have not fully experienced his perfect love."}],[{"type":"prose","content":"We love each other because he loved us first."}],[{"type":"prose","content":"If someone says, “I love God,” but hates a fellow believer, that person is a liar; for if we don’t love people we can see, how can we love God, whom we cannot see?"}],[{"type":"prose","content":"And he has given us this command: Those who love God must also love their fellow believers."}]]