[{"header":"I repeat my warning against false teaching"},{"num":1,"verse":"Don’t trust every spirit, dear friends of mine, but test them to discover whether they come from God or not. For the world is full of false prophets. You can test them in this simple way: every spirit that acknowledges the fact that Jesus Christ actually became man, comes from God, but the spirit which denies this fact does not come from God. The latter comes from the anti-christ, which you were warned would come and which is already in the world."},{"num":4,"verse":"You, my children, who belong to God have already defeated this spirit, because the one who lives in you is far stronger than the anti-Christ in the world. The agents of the anti-christ are children of the world, they speak the world’s language and the world, of course, pays attention to what they say. We are God’s children and only the man who knows God hears our message; what we say means nothing to the man who is not himself a child of God. This gives us a ready means of distinguishing the true from the false."},{"header":"Let us love: God has shown us love at its highest"},{"num":7,"verse":"To you whom I love I say, let us go on loving one another, for love comes from God. Every man who truly loves is God’s son and has some knowledge of him. But the man who does not love cannot know him at all, for God is love."},{"num":9,"verse":"To us, the greatest demonstration of God’s love for us has been his sending his only Son into the world to give us life through him. We see real love, not in that fact that we loved God, but that he loved us and sent his Son to make personal atonement for our sins."},{"num":11,"verse":"If God loved us as much as that, surely we, in our turn, should love each other!"},{"num":12,"verse":"It is true that no human being has ever had a direct vision of God. Yet if we love each other God does actually live within us, and his love grows in us towards perfection. And, as I wrote above, the guarantee of our living in him and his living in us is the share of his own Spirit which he gives us."},{"header":"Knowing Christ means more love and confidence, less and less fear"},{"num":14,"verse":"We ourselves are eye-witnesses able and willing to testify to the fact that the Father did send the Son to save the world. Everyone who acknowledges that Jesus is the Son of God lives in him, and he lives in God. So we have come to know and trust the love God has for us."},{"num":16,"verse":"God is love, and the man whose life is lived in love does, in fact, live in God, and God does, in fact, live in him. So our love for him grows more and more, filling us with complete confidence for the day when he shall judge all men—for we realise that our life in this world is actually his life lived in us. Love contains no fear—indeed fully-developed love expels every particle of fear, for fear always contains some of the torture of feeling guilty. This means that the man who lives in fear has not yet had his love perfected."},{"num":19,"verse":"Yes, we love him because he first loved us. If a man says, “I love God” and hates his brother, he is a liar. For if he does not love the brother before his eyes how can he love the one beyond his sight? And in any case it is his explicit command that the one who loves God must love his brother too."}]