[{"num":1,"verse":"The word of the Lord that came to Joel the son of Phatuel."},{"num":2,"verse":"Hear this, ye old men, and give ear, all ye inhabitants of the land: did this ever happen in your days, or in the days of your fathers?"},{"num":3,"verse":"Tell ye of this to your children, and let your children tell their children, and their children to another generation."},{"num":4,"verse":"That which the palmerworm hath left, the locust hath eaten: and that which the locust hath left, the bruchus hath eaten: and that which the bruchus hath left, the mildew hath destroyed."},{"num":5,"verse":"Awake, ye that are drunk, and weep, and mourn all ye that take delight in drinking sweet wine: for it is cut off from your mouth."},{"num":6,"verse":"For a nation is come up upon my land, strong and without number: his teeth are like the teeth of a lion: and his cheek teeth as of a lion's whelp."},{"num":7,"verse":"He hath laid my vineyard waste, and hath pilled off the bark of my fig tree: he hath stripped it bare, and cast it away; the branches thereof are made white."},{"num":8,"verse":"Lament like a virgin girded with sackcloth for the husband of her youth."},{"num":9,"verse":"Sacrifice and libation is cut off from the house of the Lord: the priests, the Lord's ministers, have mourned:"},{"num":10,"verse":"The country is destroyed, the ground hath mourned: for the corn is wasted, the wine is confounded, the oil hath languished."},{"num":11,"verse":"The husbandmen are ashamed, the vinedressers have howled for the wheat, and for the barley, because the harvest of the field is perished."},{"num":12,"verse":"The vineyard is confounded, and the fig tree hath languished: the pomegranate tree, and the palm tree, and the apple tree, and all the trees of the field are withered: because joy is withdrawn from the children of men."},{"num":13,"verse":"Gird yourselves, and lament, O ye priests, howl, ye ministers of the altars: go in, lie in sackcloth, ye ministers of my God: because sacrifice and libation is cut off from the house of your God."},{"num":14,"verse":"Sanctify ye a fast, call an assembly; gather together the ancients, all the inhabitants of the land into the house of your God: and cry ye to the Lord:"},{"num":15,"verse":"Ah, ah, ah, for the day: because the day of the Lord is at hand, and it shall come like destruction from the mighty."},{"num":16,"verse":"Is not your food cut off before your eyes, joy and gladness from the house of our God?"},{"num":17,"verse":"The beasts have rotted in their dung, the barns are destroyed, the storehouses are broken down: because the corn is confounded."},{"num":18,"verse":"Why did the beast groan, why did the herds of cattle low? because there is no pasture for them: yea, and the flocks of sheep are perished."},{"num":19,"verse":"To thee, O Lord, will I cry: because fire hath devoured the beautiful places of the wilderness, and the flame hath burnt all the trees of the country."},{"num":20,"verse":"Yea and the beasts of the field have looked up to thee, as a garden bed that thirsteth after rain, for the springs of waters are dried up, and fire hath devoured the beautiful places of the wilderness."}]