[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For he hath done excellent things.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Here, again, the Hebrew indicates an echo from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “He hath triumphed gloriously.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:10-16 When the gospel should be publicly preached, the Gentiles would seek Christ Jesus as their Lord and Saviour, and find rest of soul. When God's time is come for the deliverance of his people, mountains of opposition shall become plains before him. God can soon turn gloomy days into glorious ones. And while we expect the Lord to gather his ancient people, and bring them home to his church, also to bring in the fulness of the Gentiles, when all will be united in holy love, let us tread the highway of holiness he has made for his redeemed. Let us wait for the mercy of our Lord Jesus Christ unto eternal life, looking to him to prepare our way through death, that river which separates this world from the eternal world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sing unto the Lord - This is the same expression which occurs in the song of Moses ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Isaiah evidently had that in his eye.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hath done excellent things - Things that are exalted (גאות  gê'ûth); that are worthy to be celebrated, and had in remembrance; things that are majestic, grand, and wonderful.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is known in all the earth - Or, more properly, 'Let this be known in all the earth.' It is worthy of being celebrated everywhere. It should be sounded abroad through all lands. This expresses the sincere desire of all who are redeemed, and who are made sensible of the goodness and mercy of God the Saviour. The instinctive and the unceasing wish is, that the wonders of the plan of redeeming mercy should be everywhere known among the nations, and that all flesh should see the salvation of our God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This is known in all the earth - Or, more properly, 'Let this be known in all the earth.' It is worthy of being celebrated everywhere. It should be sounded abroad through all lands. This expresses the sincere desire of all who are redeemed, and who are made sensible of the goodness and mercy of God the Saviour. The instinctive and the unceasing wish is, that the wonders of the plan of redeeming mercy should be everywhere known among the nations, and that all flesh should see the salvation of our God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Sing, &c.—alluding to Ex 15:21.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The knowledge of this glorious work of our redemption by the Messiah shall no longer be confined to Israel’s land, as it hitherto hath been; but shall reach to all nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sing unto the Lord,.... Psalms, hymns, and spiritual songs, vocally and together, as Gospel churches, to the glory of God; or \"sing the Lord\" (u), let him be the subject matter of the song, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sing how great and good he is; sing what he is in himself, and what he is to others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he hath done excellent things; he hath wrought out an excellent salvation, which excels all others, being of a spiritual nature, complete and everlasting: it is emphatically a great one, in which God is glorified in all his perfections, and which issues in the eternal glory and happiness of his people. He has brought in an excellent righteousness, a righteousness that excels any righteousness of the creature, men or angels; it being the righteousness of God, a perfect, pure, and spotless one, which serves for many, even all his spiritual seed, and is everlasting: he has offered up an excellent sacrifice, a sacrifice that excels all that were offered up under the law; in the matter, which is himself; in the use and efficacy of it, to atone for sin, and take it away; in the continuance of that efficacy, and in its acceptableness unto God: and he has obtained an excellent victory over all his and his people's enemies, sin, Satan, the world, and death, and made them sharers in his conquests; reference seems to be had to Exodus 15:1, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for he hath done excellent things; he hath wrought out an excellent salvation, which excels all others, being of a spiritual nature, complete and everlasting: it is emphatically a great one, in which God is glorified in all his perfections, and which issues in the eternal glory and happiness of his people. He has brought in an excellent righteousness, a righteousness that excels any righteousness of the creature, men or angels; it being the righteousness of God, a perfect, pure, and spotless one, which serves for many, even all his spiritual seed, and is everlasting: he has offered up an excellent sacrifice, a sacrifice that excels all that were offered up under the law; in the matter, which is himself; in the use and efficacy of it, to atone for sin, and take it away; in the continuance of that efficacy, and in its acceptableness unto God: and he has obtained an excellent victory over all his and his people's enemies, sin, Satan, the world, and death, and made them sharers in his conquests; reference seems to be had to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "this is known in all the earth; that such a salvation is finished; such a righteousness is brought in; that peace, pardon, and atonement, are procured, and all enemies are conquered; for the Gospel publishing all this has been sent into all the world, and will be more fully preached throughout it in the latter day. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u)  \"canite Jehovam\", Cocceius;    Sept. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u)  \"canite Jehovam\", Cocceius;    Sept. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Sing unto the LORD; for he hath done excellent things: this is known in all the earth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "excellent things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “Excellence,” ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this is known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better as R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "let this be known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Sing unto the Lord; for he hath done excellent things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is another quotation, very slightly modified, from the song of Moses, in which these words were part of the refrain (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:1, 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This is known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "let this be known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " publish it - noise it abroad. Isaiah 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", again, contains a prophetic promise, which points back to the commencement of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"And with rapture ye will draw water out of the wells of salvation.\" Just as Israel was miraculously supplied with water in the desert, so will the God of salvation, who has become your salvation, open many and manifold sources of salvation for you (מעיני as it is pointed here, instead of מעיני,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The root is the same as, for example, in יעלתסּו (they rejoice) and יעלתסּו; here, however, it is more striking, because the singular is written מעין, and not מעין. At the same time, it is evident that the connecting sound ay was rather preferred than avoided, as Ewald maintains - as we may see, for example, from the repeated aychi in Psalm 103.))",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The root is the same as, for example, in יעלתסּו (they rejoice) and יעלתסּו; here, however, it is more striking, because the singular is written מעין, and not מעין. At the same time, it is evident that the connecting sound ay was rather preferred than avoided, as Ewald maintains - as we may see, for example, from the repeated aychi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".))",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "from which ye may draw with and according to your heart's delight. This water of salvation, then, forms both the material for, and instigation to, new songs of praise; and Isaiah 12:4-6 therefore continue in the strain of a psalm: \"And ye will say in that day, Praise Jehovah, proclaim His name, make known His doings among the nations, boast that His name is exalted. Harp to Jehovah; for He has displayed majesty: let this be known in all lands. Shout and be jubilant, O inhabitants of Zion: for great is the Holy One of Israel in the midst of thee.\" The first song of six lines is here followed by a second of seven lines: a prophetic word of promise, inserted between them, separates the one from the other. This second also commences with the well-known tones of a psalm (compare especially Psalm 105:1; 1 Chronicles 16:8). The phrase, \"Call upon the name of Jehovah,\" signifies, Make the name of Jehovah the medium of invocation (Ges. 138, Anm. 3*), i.e., invoke it, or, as here, call it out. Gē'ūth is high, towering dignity; here it is used of God, as in Isaiah 26:10, with ‛âsâh: to prove it practically, just as with lābēsh in Psalm 93:1, to show one's self openly therein. Instead of the Chethib meyudda‛ath in Isaiah 12:5, the keri substitutes the hophal form mūda‛ath, probably because meyuddâ‛, according to the standing usage of speech, denotes one well known, or intimate; the passive of the hophal is certainly the more suitable. According to the preceding appeals, the words are to be understood as expressing a desire, that the glorious self-attestation of the God of salvation might be brought to the consciousness of the whole of the inhabitants of the earth, i.e., of all mankind. When God redeems His people, He has the salvation of all the nations in view. It is the knowledge of the Holy One of Israel, made known through the word of proclamation, that brings salvation to them all. How well may the church on Zion rejoice, to have such a God dwelling in the midst of it! He is great as the giver or promises, and great in fulfilling them; great in grace, and great in judgment; great in all His saving acts which spread from Israel to all mankind. Thus does this second psalm of the redeemed nation close, and with it the book of Immanuel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from which ye may draw with and according to your heart's delight. This water of salvation, then, forms both the material for, and instigation to, new songs of praise; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " therefore continue in the strain of a psalm: \"And ye will say in that day, Praise Jehovah, proclaim His name, make known His doings among the nations, boast that His name is exalted. Harp to Jehovah; for He has displayed majesty: let this be known in all lands. Shout and be jubilant, O inhabitants of Zion: for great is the Holy One of Israel in the midst of thee.\" The first song of six lines is here followed by a second of seven lines: a prophetic word of promise, inserted between them, separates the one from the other. This second also commences with the well-known tones of a psalm (compare especially ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The phrase, \"Call upon the name of Jehovah,\" signifies, Make the name of Jehovah the medium of invocation (Ges. 138, Anm. 3*), i.e., invoke it, or, as here, call it out. Gē'ūth is high, towering dignity; here it is used of God, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with ‛âsâh: to prove it practically, just as with lābēsh in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 93:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to show one's self openly therein. Instead of the Chethib meyudda‛ath in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the keri substitutes the hophal form mūda‛ath, probably because meyuddâ‛, according to the standing usage of speech, denotes one well known, or intimate; the passive of the hophal is certainly the more suitable. According to the preceding appeals, the words are to be understood as expressing a desire, that the glorious self-attestation of the God of salvation might be brought to the consciousness of the whole of the inhabitants of the earth, i.e., of all mankind. When God redeems His people, He has the salvation of all the nations in view. It is the knowledge of the Holy One of Israel, made known through the word of proclamation, that brings salvation to them all. How well may the church on Zion rejoice, to have such a God dwelling in the midst of it! He is great as the giver or promises, and great in fulfilling them; great in grace, and great in judgment; great in all His saving acts which spread from Israel to all mankind. Thus does this second psalm of the redeemed nation close, and with it the book of Immanuel. ",
            "children": []
          }
        ]
      }
    ]
  }
]