[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 9:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 9:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That these days should be remembered and kept — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That the memorial of these great things, which God had done for his church, might never perish. For if God work wonders for a day, it is that they may be had in everlasting remembrance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Every family, every province, every city — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Accordingly, even the women and little children, nay, such as were base- born and servants, were bound to keep this feast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:20-32 The observance of the Jewish feasts, is a public declaration of the truth of the Old Testament Scriptures. And as the Old Testament Scriptures are true, the Messiah expected by the Jews is come long ago; and none but Jesus of Nazareth can be that Messiah. The festival was appointed by authority, yet under the direction of the Spirit of God. It was called the feast of Purim, from a Persian word, which signifies a lot. The name of this festival would remind them of the almighty power of the God of Israel, who served his own purposes by the superstitions of the heathen. In reviewing our mercies, we should advert to former fears and distresses. When our mercies are personal, we should not by forgetfulness lose the comfort of them, or withhold from the Lord the glory due to his name. May the Lord teach us to rejoice, with that holy joy which anticipates and prepares for the blessedness of heaven. Every instance of Divine goodness to ourselves, is a new obligation laid on us to do good, to those especially who most need our bounty. Above all, redemption by Christ binds us to be merciful, 2Co 8:9.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Jews of the villages ... - Rather, \"the Jews of the country districts, that dwelt in the country towns,\" as distinguished from those who dwelt in the metropolis. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26. they called these days Purim after the name of Pur—\"Pur,\" in the Persian language, signifies \"lot\"; and the feast of Purim, or lots, has a reference to the time having been pitched upon by Haman through the decision of the lot. In consequence of the signal national deliverance which divine providence gave them from the infamous machinations of Haman, Mordecai ordered the Jews to commemorate that event by an anniversary festival, which was to last for two days, in accordance with the two days' war of defense they had to maintain. There was a slight difference in the time of this festival; for the Jews in the provinces, having defended themselves against their enemies on the thirteenth, devoted the fourteenth to festivity; whereas their brethren in Shushan, having extended that work over two days, did not observe their thanksgiving feast till the fifteenth. But this was remedied by authority, which fixed the fourteenth and fifteenth of Adar. It became a season of sunny memories to the universal body of the Jews; and, by the letters of Mordecai, dispersed through all parts of the Persian empire, it was established as an annual feast, the celebration of which is kept up still. On both days of the feast, the modern Jews read over the Megillah or Book of Esther in their synagogues. The copy read must not be printed, but written on vellum in the form of a roll; and the names of the ten sons of Haman are written on it a peculiar manner, being ranged, they say, like so many bodies on a gibbet. The reader must pronounce all these names in one breath. Whenever Haman's name is pronounced, they make a terrible noise in the synagogue. Some drum with their feet on the floor, and the boys have mallets with which they knock and make a noise. They prepare themselves for their carnival by a previous fast, which should continue three days, in imitation of Esther's; but they have mostly reduced it to one day [Jennings, Jewish Antiquities].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And that these days should be remembered, and kept throughout every generation, every family, every province, and every city,.... And accordingly these days are commemorated by them now, and by all their families, and all in their families capable of it; and these words, \"every province\", and \"every city\", are used, as Aben Ezra observes, lest a man should think he was not bound to keep this feast where there were no Jews; for, let him be where he may, he is obliged to keep it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and that these days of Purim should not fail among the Jews; or the observance of them be neglected and cease: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nor the memorial of them perish from their seed; neither the memorial of them, nor of the reason of keeping them; wherefore on those days they read the whole book of Esther, fairly written on a roll of parchment, and are careful that none omit the reading of it; rather, they say (w), the reading and learning the law should be omitted, and all commands and service, than the reading this volume, that so all might be acquainted with this wonderful deliverance, and keep it in mind. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) Lebush & Schulchan, ib. (par. 1.) c. 687. sect. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) Lebush & Schulchan, ib. (par. 1.) c. 687. sect. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And that these days should be remembered and kept throughout every generation, every family, every province, and every city; and that these days of Purim should not fail from among the Jews, nor the memorial of them perish from their seed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That these days should be remembered and kept throughout every generation, every family",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The universal adoption of the Purina feast by the Jewish nation, originating as it did at Susa, among the Persian Jews, never a very important part of the nation, is a curious fact, and is certainly not satisfactorily accounted for by the beauty and popularity of the Book of Esther (Ewald), nor by the dignity and power of Mordecai. Mordecai had no ecclesiastical authority; and it might have been expected that the Jews of Jerusalem would have demurred to the imposition of a fresh religious obligation upon them by a Jew of the Dispersion, who was neither a prophet, nor a priest, nor even a Levite. The Jews of Jerusalem, in their strongly-situated city, which was wholly theirs, and with their temple-fortress complete (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), can scarcely have felt themselves in much danger from an attack which was to have begun and ended in a day. But Joiakim, the high priest of the time (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 12:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to whom, as we have seen ('Introduction,' § 3), the Book of Esther was attributed by some, must have given his approval to the feast from the first, and have adopted it into the ceremonial of the nation, or it would scarcely have become universal. Hooker ('Eccl. Pol.,' 5:71, § 6) rightly makes the establishment of the feast an argument in favour of the Church's power to prescribe festival days; and it must certainly have been by ecclesiastical, and not by civil, command that it became obligatory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That these days... should not fail,...  nor the memorial of them perish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As a commemoration of human, and not of Divine, appointment, the feast of Purim was liable to abrogation or discontinuance. The Jews of the time resolved that the observance should be perpetual; and in point of fact the feast has continued up to the present date, and is likely to continue, though they could not bind their successors. Esther 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And that these days should be remembered and kept throughout every generation, every family, every province, and every city; and these days of Purim are not to pass away among the Jews, nor their remembrance to cease among their seed. The participles ונעשׂים נזכּרים still depend on להיות, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not till the last clause does the construction change in להיות לא to the temp. finit. יעבור ולא is a periphrasis of the adverb: imperishably, inviolably. כּכתבם, secundum scriptum eorum, i.e., as Mordochai had written concerning them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). כּזמנּם, as he had appointed their time. מן סוּף, to come to an end from, i.e., to cease among their descendants. ",
        "children": []
      }
    ]
  }
]