[{"header":"Korah Works against Moses"},{"num":16,"verse":"Now Korah the son of Izhar, the son of Kohath, the son of Levi, with Dathan and Abiram, the sons of Eliab, and On the son of Peleth, sons of Reuben, caused trouble. "},{"num":2,"verse":"They came in front of Moses, together with some of the sons of Israel. They had chosen 250 leaders of the people of Israel, well-known men. "},{"num":3,"verse":"They all gathered together against Moses and Aaron, and said to them, “You have gone too far! For all the people are holy, every one of them, and the Lord is among them. So why do you honor yourselves more than the people of the Lord?”"},{"num":4,"verse":"When Moses heard this, he bowed to the ground. "},{"num":5,"verse":"He said to Korah and all who were with him, “Tomorrow morning the Lord will show who is His, and who is holy. He will have him come near to Him. He will bring near to Himself the one whom He will choose. "},{"num":6,"verse":"Do this, Korah and all who are with you. Take pots for burning special perfume. "},{"num":7,"verse":"Put fire in them, and put special perfume upon them before the Lord tomorrow. The man whom the Lord chooses will be the one who is holy. You have gone too far, you sons of Levi!”"},{"num":8,"verse":"Then Moses said to Korah, “Hear now, you sons of Levi. "},{"num":9,"verse":"Is it not enough for you that the God of Israel has set you apart from the rest of the people of Israel? He has brought you near to Himself. He has you do the work around the meeting tent of the Lord. And He has you stand in front of the people to care for them. "},{"num":10,"verse":"He has brought you near to Him, Korah, and all your brothers who are the sons of Levi, with you. Would you try to be the religious leaders also? "},{"num":11,"verse":"So you and all who are with you are gathered together against the Lord. But as for Aaron, who is he that you complain against him?”"},{"num":12,"verse":"Then Moses sent to call Dathan and Abiram, the sons of Eliab. But they said, “We will not come up. "},{"num":13,"verse":"Is it not enough that you have brought us up out of a land flowing with milk and honey to have us die in the desert? Must you make yourself a ruler over us also? "},{"num":14,"verse":"More than this, you have not brought us into a land flowing with milk and honey. You have not given us any land with fields and grape vines. Would you put out the eyes of these men? We will not come up!”"},{"num":15,"verse":"Moses became very angry. He said to the Lord, “Do not respect their gift! I have not taken one donkey from them. And I have not hurt one of them.” "},{"num":16,"verse":"Then Moses said to Korah, “You and all who are with you be before the Lord tomorrow, you and they, and Aaron. "},{"num":17,"verse":"Each of you take his fire pot and put special perfume on it. And each of you bring his fire pot before the Lord, 250 fire pots. Let both you and Aaron bring his fire pot also.” "},{"num":18,"verse":"So each man took his fire pot and put fire in it and put special perfume on it. And they stood at the door of the meeting tent with Moses and Aaron. "},{"num":19,"verse":"Korah gathered together all the people against them at the door of the meeting tent. And the shining-greatness of the Lord was seen by all the people."},{"num":20,"verse":"The Lord said to Moses and Aaron, "},{"num":21,"verse":"“Go away from these people, so I may destroy them at once.” "},{"num":22,"verse":"But they fell on their faces, and said, “O God, the God of the spirits of all flesh, when one man sins, will You be angry with all the people?” "},{"num":23,"verse":"Then the Lord said to Moses, "},{"num":24,"verse":"“Say to the people, ‘Get away from the tents of Korah, Dathan and Abiram.’”"},{"num":25,"verse":"Then Moses got up and went to Dathan and Abiram, with the leaders of Israel following him. "},{"num":26,"verse":"And he said to the people, “Go away now from the tents of these sinful men. Touch nothing that belongs to them, or you will be destroyed because of all their sin.” "},{"num":27,"verse":"So they went away from the tents of Korah, Dathan and Abiram. And Dathan and Abiram came out and stood at the door of their tents, with their wives, their sons, and their little ones. "},{"num":28,"verse":"Moses said, “By this you will know that the Lord has sent me to do all these works. For this is not my doing. "},{"num":29,"verse":"If these men die in the same way all men die, or if what happens to everyone happens to them, then the Lord has not sent me. "},{"num":30,"verse":"But the Lord will do something new. The ground will open its mouth and take them with all that belongs to them. And they will go down alive into the place of the dead. Then you will understand that these men have turned against the Lord.”"},{"num":31,"verse":"As soon as he stopped speaking, the ground under them opened up. "},{"num":32,"verse":"The earth opened its mouth and took them and all those of their house, and all Korah’s men and all that belonged to them. "},{"num":33,"verse":"They and all that belonged to them went down alive to the place of the dead, and the earth closed over them. They were destroyed from among the people. "},{"num":34,"verse":"And all Israel who were around them ran away at their cry. For they said, “The earth may take us too!” "},{"num":35,"verse":"Then fire came from the Lord and destroyed the 250 men who had brought the special perfume."},{"num":36,"verse":"The Lord said to Moses, "},{"num":37,"verse":"“Tell Eleazar the son of Aaron the religious leader to take the fire pots out of the fire. For they are holy. Then spread the burning pieces far apart. "},{"num":38,"verse":"Let the fire pots of these men who have sinned and lost their lives be made into beaten plates to cover the altar. For they did bring them to the Lord and they are holy. They will be something special for the people of Israel to see.” "},{"num":39,"verse":"So Eleazar the religious leader took the brass fire pots which the men who were burned had brought. And they beat them into plates to cover the altar. "},{"num":40,"verse":"They were to make the people of Israel remember that no man who is not a religious leader and a son of Aaron should come to burn special perfume before the Lord. Or he might become like Korah and those who were with him, as the Lord said to Eleazar through Moses."},{"header":"The People Complain"},{"num":41,"verse":"But on the next day all the people of Israel complained against Moses and Aaron, saying, “You are the ones who have caused the death of the Lord’s people.” "},{"num":42,"verse":"When the people had gathered against Moses and Aaron, they turned toward the meeting tent. There the cloud covered it and they saw the shining-greatness of the Lord. "},{"num":43,"verse":"Then Moses and Aaron came to the front of the meeting tent. "},{"num":44,"verse":"And the Lord said to Moses, "},{"num":45,"verse":"“Get away from these people, so I may destroy them at once.” Then they fell on their faces. "},{"num":46,"verse":"Moses said to Aaron, “Take your fire pot and put fire in it from the altar, and lay special perfume on it. Then be quick to bring it to the people and pay for their sin. For anger has gone out from the Lord. The disease has come!” "},{"num":47,"verse":"So Aaron took it as Moses said, and ran to the people. The disease had already come upon them. He put on the special perfume and paid for the sin of the people. "},{"num":48,"verse":"He stood between the dead and the living, and the disease was stopped. "},{"num":49,"verse":"But 14,700 people died by the disease, as well as those who died because of Korah. "},{"num":50,"verse":"Then Aaron returned to Moses at the door of the meeting tent, for the disease had been stopped."}]