[[],[{"type":"header","content":"Water from the Temple"},{"type":"prose","content":"Then he brought me back to the door of the house; and behold, water was flowing from under the threshold of the house toward the east, for the house faced east. And the water was flowing down from under, from the right side of the house, from south of the altar."}],[{"type":"prose","content":"And he brought me out by way of the north gate and led me around on the outside to the outer gate, by the way facing east. And behold, water was spurting out from the south side."}],[{"type":"prose","content":"When the man went out toward the east with a line in his hand, he measured a thousand cubits, and he led me through the water, water  the ankles."}],[{"type":"prose","content":"Again he measured a thousand and led me through the water, water  the knees. Again he measured a thousand and led me through , water  the hips."}],[{"type":"prose","content":"Again he measured a thousand;  a river that I could not wade across, because the water had risen,  water to swim in, a river that could not be crossed ."}],[{"type":"prose","content":"And he said to me, “Son of man, have you seen ?” Then he brought me back to the bank of the river."}],[{"type":"prose","content":"Now when I had returned, behold, on the bank of the river  very many trees on the one side and on the other."}],[{"type":"prose","content":"Then he said to me, “These waters go out toward the eastern region and go down into the Arabah; then they go toward the sea, being made to flow into the sea, and the waters  become fresh."}],[{"type":"prose","content":"And it will come about that every living creature which swarms in every place where the river goes, will live. And there will be very many fish, for these waters go there and  become fresh; so everything will live where the river goes."}],[{"type":"prose","content":"And it will come about that fishermen will stand beside it; from Engedi to Eneglaim there will be a place for the spreading of nets. Their fish will be according to their kinds, like the fish of the Great Sea, very many."}],[{"type":"prose","content":"But its swamps and marshes will not become fresh; they will be left for salt."}],[{"type":"prose","content":"And by the river on its bank, on one side and on the other, will grow all  trees for food. Their leaves will not wither and their fruit will not fail. They will bear fruit every month because their water flows from the sanctuary, and their fruit will be for food and their leaves for healing.”"},{"type":"header","content":"Boundaries and Division of the Land"}],[{"type":"prose","content":"This is what the Lord  says: “This  the boundary by which you shall divide the land for an inheritance among the twelve tribes of Israel; Joseph  two portions."}],[{"type":"prose","content":"And you shall divide it for an inheritance, each one equally with the other; for I swore to give it to your forefathers, and this land shall fall to you as an inheritance."}],[{"type":"prose","content":"“And this  the boundary of the land: on the north side, from the Great Sea  the way of Hethlon, to the entrance of Zedad;"}],[{"type":"prose","content":"Hamath, Berothah, Sibraim, which is between the border of Damascus and the border of Hamath; Hazer-hatticon, which is by the border of Hauran."}],[{"type":"prose","content":"The boundary shall extend from the sea  Hazar-enan  the border of Damascus, and on the north toward the north is the border of Hamath. This is the north side."}],[{"type":"prose","content":"“The east side, from between Hauran, Damascus, Gilead, and the land of Israel,  the Jordan; from the  border to the eastern sea you shall measure. This is the east side."}],[{"type":"prose","content":"“The south side toward the south  from Tamar as far as the waters of Meribath-kadesh, to the brook  to the Great Sea. This is the south side toward the south."}],[{"type":"prose","content":"“And the west side  the Great Sea, from the  border to a point opposite Lebo-hamath. This is the west side."}],[{"type":"prose","content":"“So you shall divide this land among yourselves according to the tribes of Israel."}],[{"type":"prose","content":"You shall divide it by lot for an inheritance among yourselves and among the strangers who stay in your midst, who bring forth sons in your midst. And they shall be to you as the native-born among the sons of Israel; they shall be allotted an inheritance with you among the tribes of Israel."}],[{"type":"prose","content":"And in the tribe with which the stranger resides, there you shall give  his inheritance,” declares the Lord ."}]]