[{"header":"The Blessing of Wisdom"},{"num":3,"verse":"My son, don’t forget my teaching. Remember what I tell you to do."},{"num":2,"verse":"What I teach will give you a good, long life, and all will go well for you."},{"num":3,"verse":"Don’t ever let love and loyalty leave you. Tie them around your neck, and write them on your heart."},{"num":4,"verse":"Then God will be pleased and think well of you and so will everyone else."},{"num":5,"verse":"Trust the Lord completely, and don’t depend on your own knowledge."},{"num":6,"verse":"With every step you take, think about what he wants, and he will help you go the right way."},{"num":7,"verse":"Don’t trust in your own wisdom, but fear and respect the Lord and stay away from evil."},{"num":8,"verse":"If you do this, it will be like a refreshing drink and medicine for your body."},{"num":9,"verse":"Honor the Lord with your wealth and the first part of your harvest."},{"num":10,"verse":"Then your barns will be full of grain, and your barrels will be overflowing with wine."},{"num":11,"verse":"My son, don’t reject the Lord’s discipline, and don’t be angry when he corrects you."},{"num":12,"verse":"The Lord corrects the one he loves, just as a father corrects a child he cares about."},{"num":13,"verse":"Those who find wisdom are fortunate; they will be blessed when they gain understanding."},{"num":14,"verse":"Profit that comes from wisdom is better than silver and even the finest gold."},{"num":15,"verse":"Wisdom is worth more than fine jewels. Nothing you desire has more value."},{"num":16,"verse":"With her right hand, Wisdom offers long life—with the other hand, riches and honor."},{"num":17,"verse":"Wisdom will lead you to a life of joy and peace."},{"num":18,"verse":"Wisdom is like a life-giving tree to those who hold on to her; she is a blessing to those who keep her close."},{"num":19,"verse":"With wisdom and understanding, the Lord created the earth and sky."},{"num":20,"verse":"With his knowledge, he made the oceans and the clouds that produce rain."},{"num":21,"verse":"My son, don’t ever let wisdom out of your sight. Hold on to wisdom and careful planning."},{"num":22,"verse":"They will bring you a long life filled with honor."},{"num":23,"verse":"As you go through life, you will always be safe and never fall."},{"num":24,"verse":"When you lie down, you will not be afraid. When you rest, your sleep will be peaceful."},{"num":25,"verse":"You have no reason to fear a sudden disaster or the destruction that comes to the wicked."},{"num":26,"verse":"You can trust the Lord to protect you. He will not let you fall into harm."},{"num":27,"verse":"Do everything you possibly can for those who need help."},{"num":28,"verse":"If your neighbor needs something you have, don’t say, “Come back tomorrow.” Give it to him immediately."},{"num":29,"verse":"Don’t make plans to harm your neighbor, who lives near you and trusts you."},{"num":30,"verse":"Don’t take people to court without good reason, especially when they have done nothing to harm you."},{"num":31,"verse":"Don’t envy those who are violent. Never choose to be like them."},{"num":32,"verse":"Such crooked people are disgusting to the Lord. But he is a friend to those who are good and honest."},{"num":33,"verse":"The Lord curses a wicked family, but he blesses the homes of those who live right."},{"num":34,"verse":"He will humiliate those who make fun of others, but he is kind to those who are humble."},{"num":35,"verse":"The way the wise live will bring them honor, but the way fools live will bring them shame."}]