[{"header":"The War With Ammon"},{"num":10,"verse":"After this, the king of the Ammonites died, and his son Hanun became king in his place."},{"num":2,"verse":"David said, “I will show kindness to Hanun son of Nahash, just as his father showed kindness to me.” So David sent his officials to express condolences to Hanun concerning his father. David’s officials arrived in the land of the Ammonites."},{"num":3,"verse":"But the officials of the Ammonites said to Hanun their master, “Do you really think David was honoring your father when he sent messengers to express his sympathy to you? No, David sent his officials to you in order to gather information about the city and to spy on it, in order to overthrow it.”"},{"num":4,"verse":"So Hanun seized the officials of David, shaved off half of each one’s beard, cut off their clothing up to their buttocks, and sent them away."},{"num":5,"verse":"David was told about this, and he sent messengers to meet them because the men were deeply humiliated. The king said, “Stay in Jericho until your beards have grown. Then return.”"},{"num":6,"verse":"The Ammonites saw that they had become a digusting stench to David, so they sent and hired twenty thousand foot soldiers from Aram Beth Rehob and Aram Zobah, one thousand men from the king of Ma’akah, and twelve thousand men from Tob."},{"num":7,"verse":"When David heard about it, he deployed Joab and the entire army, the strong warriors."},{"num":8,"verse":"The Ammonites went out and lined up in battle formation in front of the entrance to the city gate. Aram Zobah and Aram Rehob, as well as the men of Tob and Ma’akah, were lined up by themselves in the open country."},{"num":9,"verse":"Joab saw that the battle lines were drawn up against him both in front of him and behind him, so he chose some of the best troops of Israel and lined them up to confront the Arameans. "},{"num":10,"verse":"The rest of the men he placed under the command of his brother Abishai and lined them up to face the Ammonites. "},{"num":11,"verse":"He said, “If Aram is too strong for me, then you are to rescue me. If the Ammonites are too strong for you, I will come to rescue you. "},{"num":12,"verse":"Be strong. We must show ourselves to be strong for our people and for the cities of our God. The Lord will do what is good in his eyes.”"},{"num":13,"verse":"Joab and all the people with him advanced to join battle against the Arameans, and the Arameans fled from him. "},{"num":14,"verse":"When the Ammonites saw that Aram had fled, they also fled from Abishai and entered the city. Then Joab returned from fighting against the Ammonites and came back to Jerusalem."},{"num":15,"verse":"When the Arameans saw that they had been defeated by Israel, they regrouped. "},{"num":16,"verse":"Hadadezer sent for Arameans from beyond the Euphrates. They came to Helam with Shobak, who was the commander of the army of Hadadezer, at their head."},{"num":17,"verse":"When David was informed, he gathered all Israel, crossed the Jordan, and came to Helam. The Arameans lined up to confront David and fought against him. "},{"num":18,"verse":"The Arameans fled from Israel. David killed seven hundred Aramean charioteers and forty thousand foot soldiers. Shobak, the commander of their army, was wounded, and he died there. "},{"num":19,"verse":"All the kings who were the subjects of Hadadezer saw that they had been defeated by Israel, so they made peace with Israel and became subject to them. Then the Arameans were afraid to try to rescue the Ammonites anymore."}]