[{"header":"Hanun Shames David’s Men"},{"num":10,"verse":"Later King Nahash of the Ammonites died. His son Hanun became the new king after him."},{"num":2,"verse":"David said, “Nahash was kind to me, so I will be kind to his son Hanun.” So David sent his officers to comfort Hanun about his father’s death."},{"num":3,"verse":"But the Ammonite leaders said to Hanun, their lord, “Do you think that David is trying to honor your father by sending some men to comfort you? No, David sent these men to spy on your city. They plan to make war against you.”"},{"num":4,"verse":"So Hanun took David’s officers and shaved off one half of their beards. He cut off their clothes at the hips. Then he sent them away."},{"num":5,"verse":"When the people told David, he sent messengers to meet his officers. He did this because these men were very ashamed. King David said, “Wait at Jericho until your beards grow again. Then come back home.”"},{"header":"War Against the Ammonites"},{"num":6,"verse":"The Ammonites saw that they had become David’s enemies, so they hired Arameans from Beth Rehob and Zobah. There were 20,000 Aramean foot soldiers. The Ammonites also hired the king of Maacah with 1000 men and 12,000 men from Tob."},{"num":7,"verse":"David heard about this, so he sent Joab and the whole army of powerful men."},{"num":8,"verse":"The Ammonites came out and got ready for the battle. They stood at the city gate. The Arameans from Zobah and Rehob and the men from Tob and Maacah did not stand together with the Ammonites in the field."},{"num":9,"verse":"Joab saw that there were enemies in front of him and behind him. So he chose some of the best Israelite soldiers and lined them up for battle against the Arameans."},{"num":10,"verse":"Then Joab gave the other men to his brother Abishai to lead against the Ammonites."},{"num":11,"verse":"Joab said to Abishai, “If the Arameans are too strong for me, you will help me. If the Ammonites are too strong for you, I will come and help you."},{"num":12,"verse":"Be strong, and let us fight bravely for our people and for the cities of our God. The Lord will do what he decides is right.”"},{"num":13,"verse":"Then Joab and his men attacked the Arameans. The Arameans ran away from Joab and his men."},{"num":14,"verse":"The Ammonites saw that the Arameans were running away, so they ran away from Abishai and went back to their city."},{"header":"The Arameans Decide to Fight Again"},{"num":15,"verse":"When the Arameans saw that the Israelites had defeated them, they came together into one big army."},{"num":16,"verse":"Hadadezer sent messengers to bring the Arameans who lived on the other side of the Euphrates River. These Arameans came to Helam. Their leader was Shobach, the captain of Hadadezer’s army."},{"num":17,"verse":"When David heard about this, he gathered all the Israelites together. They crossed over the Jordan River and went to Helam."},{"num":18,"verse":"but David defeated them, and they ran from the Israelites. David killed 700 chariot drivers and 40,000 horse soldiers as well as Shobach, the captain of the Aramean army."},{"num":19,"verse":"The kings who served Hadadezer saw that the Israelites had defeated them, so they made peace with the Israelites and became their servants. The Arameans were afraid to help the Ammonites again."}]