[{"num":10,"verse":"4 The messengers of David are villainously entreated of the king of Ammon. 7 Joab is sent against the Ammonites."},{"num":1,"verse":"After this, the King of the children of Ammon died, and Hanun his son reigned in his stead."},{"num":2,"verse":"Then said David, I will show kindness unto Hanun the son of Nahash, as his father showed kindness unto me. And David sent his servants to comfort him for his father. So David’s servants came into the land of the children of Ammon."},{"num":3,"verse":"And the princes of the children of Ammon said unto Hanun their lord, Thinkest thou that David doth honor thy father, that he hath sent comforters to thee? hath not David rather sent his servants unto thee, to search the city, and to spy it out, and to overthrow it?"},{"num":4,"verse":"Wherefore Hanun took David’s servants, and shaved off the half of their beard, and cut off their garments in the middle, even to their buttocks, and sent them away."},{"num":5,"verse":"¶ When it was told unto David, he sent to meet them (for the men were exceedingly ashamed) and the king said, Tarry at Jericho, until your beards be grown, then return."},{"num":6,"verse":"¶ And when the children of Ammon saw that they stank in the sight of David, the children of Ammon sent and hired the Aramites of the house of Rehob, and the Aramites of Zoba, twenty thousand footmen, and of king Maacah a thousand men, and of Ish-Tob twelve thousand men."},{"num":7,"verse":"And when David heard of it, he sent Joab, and all the host of the strong men."},{"num":8,"verse":"And the children of Ammon came out and put their army in array at the entering in of the gate: and the Aramites of Zoba, and of Rehob, and of Ish-Tob, and of Maacah were by themselves in the field."},{"num":9,"verse":"When Joab saw that the front of the battle was against him before and behind, he chose of all the choice of Israel, and put them in array against the Aramites."},{"num":10,"verse":"And the rest of the people, he delivered into the hand of Abishai his brother, that he might put them in array against the children of Ammon."},{"num":11,"verse":"And he said, If the Aramites be stronger than I, thou shalt help me, and if the children of Ammon be too strong for thee, I will come and succor thee."},{"num":12,"verse":"Be strong and let us be valiant for our people, and for the cities of our God, and let the Lord do that which is good in his eyes."},{"num":13,"verse":"Then Joab, and the people that was with him, joined in battle with the Aramites, who fled before him."},{"num":14,"verse":"And when the children of Ammon saw that the Aramites fled, they fled also before Abishai, and entered into the city. So Joab returned from the children of Ammon, and came to Jerusalem."},{"num":15,"verse":"¶ And when the Aramites saw that they were smitten before Israel, they gathered them together."},{"num":16,"verse":"And Hadarezer sent, and brought out the Aramites that were beyond the River: and they came to Helam, and Shobach the captain of the host of Hadadezer went before them."},{"num":17,"verse":"When it was showed David, then he gathered all Israel together, and passed over Jordan, and came to Helam: and the Aramites set themselves in array against David, and fought with him:"},{"num":18,"verse":"And the Aramites fled before Israel: and David destroyed seven hundred chariots of the Aramites, and forty thousand horsemen, and smote Shobach the captain of his host, who died there."},{"num":19,"verse":"And when all the kings, that were servants to Hadadezer, saw that they fell before Israel, they made peace with Israel, and served them. and the Aramites feared to help the children of Ammon anymore."}]