[{"header":"Coming of the magi"},{"num":2,"verse":"After Jesus was born in Bethlehem in the territory of Judea during the rule of King Herod, magi came from the east to Jerusalem."},{"num":2,"verse":"They asked, “Where is the newborn king of the Jews? We’ve seen his star in the east, and we’ve come to honor him.”"},{"num":3,"verse":"When King Herod heard this, he was troubled, and everyone in Jerusalem was troubled with him."},{"num":4,"verse":"He gathered all the chief priests and the legal experts and asked them where the Christ was to be born."},{"num":5,"verse":"They said, “In Bethlehem of Judea, for this is what the prophet wrote:"},{"num":7,"verse":"Then Herod secretly called for the magi and found out from them the time when the star had first appeared."},{"num":8,"verse":"He sent them to Bethlehem, saying, “Go and search carefully for the child. When you’ve found him, report to me so that I too may go and honor him.”"},{"num":9,"verse":"When they heard the king, they went; and look, the star they had seen in the east went ahead of them until it stood over the place where the child was."},{"num":10,"verse":"When they saw the star, they were filled with joy."},{"num":11,"verse":"They entered the house and saw the child with Mary his mother. Falling to their knees, they honored him. Then they opened their treasure chests and presented him with gifts of gold, frankincense, and myrrh."},{"num":12,"verse":"Because they were warned in a dream not to return to Herod, they went back to their own country by another route."},{"header":"Escape to Egypt"},{"num":13,"verse":"When the magi had departed, an angel from the Lord appeared to Joseph in a dream and said, “Get up. Take the child and his mother and escape to Egypt. Stay there until I tell you, for Herod will soon search for the child in order to kill him.”"},{"num":14,"verse":"Joseph got up and, during the night, took the child and his mother to Egypt."},{"num":15,"verse":"He stayed there until Herod died. This fulfilled what the Lord had spoken through the prophet: I have called my son out of Egypt."},{"header":"Murder of the Bethlehem children"},{"num":16,"verse":"When Herod knew the magi had fooled him, he grew very angry. He sent soldiers to kill all the children in Bethlehem and in all the surrounding territory who were two years old and younger, according to the time that he had learned from the magi."},{"num":17,"verse":"This fulfilled the word spoken through Jeremiah the prophet:"},{"header":"Return from Egypt"},{"num":19,"verse":"After King Herod died, an angel from the Lord appeared in a dream to Joseph in Egypt."},{"num":20,"verse":"“Get up,” the angel said, “and take the child and his mother and go to the land of Israel. Those who were trying to kill the child are dead.”"},{"num":21,"verse":"Joseph got up, took the child and his mother, and went to the land of Israel."},{"num":22,"verse":"But when he heard that Archelaus ruled over Judea in place of his father Herod, Joseph was afraid to go there. Having been warned in a dream, he went to the area of Galilee."},{"num":23,"verse":"He settled in a city called Nazareth so that what was spoken through the prophets might be fulfilled: He will be called a Nazarene."}]