[{"header":"Herod, suspicious of the new-born king, takes vindictive precautions"},{"num":1,"verse":"Jesus was born in Bethlehem, in Judea, in the days when Herod was king of the province. Not long after his birth there arrived from the east a party of astrologers making for Jerusalem and enquiring as they went, “Where is the child born to be king of the Jews? For we saw his star in the east and we have come here to pay homage to him.”"},{"num":3,"verse":"When King Herod heard about this he was deeply perturbed, as indeed were all the other people living in Jerusalem. So he summoned all the Jewish scribes and chief priests together and asked where “Christ” should be born. Their reply was: “In Bethlehem, in Judea, for this is what the prophet (Micah) wrote about the matter—‘But you, Bethlehem, in the land of Judah, are not the least among the rulers of Judah; for out of you shall come a ruler who will shepherd my people Israel’.”"},{"num":7,"verse":"Then Herod invited the wise men to meet him privately and found out from them the exact time when the star appeared. Then he sent them off to Bethlehem saying, “When you get there, search for this little child with the utmost care. And when you have found him come back and tell me—so that I may go and worship him too.”"},{"num":9,"verse":"The wise men listened to the king and then went on their way to Bethlehem. And now the star, which they had seen in the east, went in front of them as they travelled until at last it shone immediately above the place where the little child lay. The sight of the star filled them with indescribable joy."},{"num":11,"verse":"So they went into the house and saw the little child with his mother Mary. And they fell on their knees and worshipped him. Then they opened their treasures and presented him with gifts—gold, incense and myrrh. Then, since they were warned in a dream not to return to Herod, they went back to their own country by a different route."},{"num":13,"verse":"But after they had gone, the angel of the Lord appeared to Joseph in a dream and said, “Get up now, take the little child and his mother and escape to Egypt. Stay there until I tell you. For Herod means to seek out the child and kill him.”"},{"num":14,"verse":"So Joseph got up, and taking the child and his mother with him in the middle of the night, set off for Egypt, where he remained until Herod’s death. This again is a fulfilment of the Lord’s word spoken through the prophet—‘Out of Egypt I called my son’."},{"num":16,"verse":"When Herod saw that he had been fooled by the wise men he was furiously angry. He issued orders, and killed all the male children of two years and under in Bethlehem and the surrounding district—basing his calculation on his careful questioning of the wise men."},{"num":17,"verse":"Then Jeremiah’s prophecy was fulfilled: ‘A voice was heard in Ramah, lamentation, weeping and great mourning, Rachel weeping for her children, refusing to be comforted, because they were no more’."},{"header":"Jesus is brought to Nazareth"},{"num":19,"verse":"But after Herod’s death an angel of the Lord again appeared to Joseph in a dream and said, “Now get up and take the infant and his mother with you and go into the land of Israel. For those who sought the child’s life are dead.”"},{"num":21,"verse":"So Joseph got up and took the little child and his mother with him and journeyed towards the land of Israel. But when he heard that Archelaus was now reigning as king of Judea in the place of his father Herod, he was afraid to enter the country. Then he received warning in a dream to turn aside into the district of Galilee and came to live in a small town called Nazareth—thus fulfilling the old prophecy, that he should be called a Nazarene."}]