[{"header":"The Wise Men Visit"},{"num":2,"verse":"Jesus was born in Bethlehem near Jerusalem during the reign of King Herod. After Jesus’ birth a group of spiritual priests from the East came to Jerusalem "},{"num":2,"verse":"and inquired of the people, “Where is the child who is born king of the Jewish people? We observed his star rising in the sky and we’ve come to bow before him in worship.”"},{"num":3,"verse":"King Herod was shaken to the core when he heard this, and not only he, but all of Jerusalem was disturbed when they heard this news. "},{"num":4,"verse":"So he called a meeting of the Jewish ruling priests and religious scholars, demanding that they tell him where the promised Messiah was prophesied to be born."},{"num":5,"verse":"“He will be born in Bethlehem, in the land of Judah,” they told him. “Because the prophecy states:"},{"num":7,"verse":"Then Herod secretly summoned the spiritual priests from the East to ascertain the exact time the star first appeared. "},{"num":8,"verse":"And he told them, “Now go to Bethlehem and carefully look there for the child, and when you’ve found him, report to me so that I can go and bow down and worship him too.”"},{"num":9,"verse":"And on their way to Bethlehem, the same star they had seen in the East suddenly reappeared! Amazed, they watched as it went ahead of them and stopped directly over the place where the child was. "},{"num":10,"verse":"And when they saw the star, they were so ecstatic that they shouted and celebrated with unrestrained joy. "},{"num":11,"verse":"When they came into the house and saw the young child with Mary, his mother, they fell to the ground at his feet and worshiped him. Then they opened their treasure chests full of gifts and presented him with gold, frankincense, and myrrh. "},{"num":12,"verse":"Afterward they returned to their own country by another route because God had warned them in a dream not to go back to Herod."},{"header":"They Escape to Egypt"},{"num":13,"verse":"After they had gone, Joseph had another dream. An angel of the Lord appeared to him and said, “Get up now and flee to Egypt. Take Mary and the little child and stay there until I tell you to leave, for Herod intends to search for the child to kill him.”"},{"num":14,"verse":"So that very night he got up and took Jesus and his mother and made their escape to Egypt "},{"num":15,"verse":"and remained there until Herod died. All of this fulfilled what the Lord had spoken through his prophet:"},{"num":16,"verse":"When Herod realized that he had been tricked by the wise men, he was infuriated. So he sent soldiers with orders to slaughter every baby boy two years old and younger in Bethlehem and throughout the surrounding countryside, based on the time frame he was given from interrogating the wise men. "},{"num":17,"verse":"This fulfilled the words of the prophet Jeremiah:"},{"header":"They Return to Nazareth"},{"num":19,"verse":"After Herod died, an angel of the Lord appeared again to Joseph in a dream while he was still in Egypt, "},{"num":20,"verse":"saying, “Go back to the land of Israel and take the child and his mother with you, for those who sought to kill the child are dead.”"},{"num":21,"verse":"So he awoke and took Jesus and Mary and returned to the land of Israel. "},{"num":22,"verse":"But when he heard that Archelaus, Herod’s son, had succeeded him as ruler over all of the territory of Judah, he was afraid to go back. Then he had another dream from God, warning him to avoid that region and instructing him instead to go to the province of Galilee. "},{"num":23,"verse":"So he settled his family in the village of Nazareth, fulfilling the prophecy that he would be known as the “Branch.”"}]