[{"num":13,"verse":"Just at that time there [arrived] some people who informed Jesus about the Galileans whose blood Pilate had mixed with their sacrifices."},{"num":2,"verse":"And He replied by saying to them, Do you think that these Galileans were greater sinners than all the other Galileans because they have suffered in this way?"},{"num":3,"verse":"I tell you, No; but unless you repent (change your mind for the better and heartily amend your ways, with abhorrence of your past sins), you will all likewise perish and be lost eternally."},{"num":4,"verse":"Or those eighteen on whom the tower in Siloam fell and killed them—do you think that they were more guilty offenders (debtors) than all the others who dwelt in Jerusalem?"},{"num":5,"verse":"I tell you, No; but unless you repent (change your mind for the better and heartily amend your ways, with abhorrence of your past sins), you will all likewise perish and be lost eternally."},{"num":6,"verse":"And He told them this parable: A certain man had a fig tree, planted in his vineyard, and he came looking for fruit on it, but did not find [any]."},{"num":7,"verse":"So he said to the vinedresser, See here! For these three years I have come looking for fruit on this fig tree and I find none. Cut it down! Why should it continue also to use up the ground [to deplete the soil, intercept the sun, and take up room]?"},{"num":8,"verse":"But he replied to him, Leave it alone, sir, [just] this one more year, till I dig around it and put manure [on the soil]."},{"num":9,"verse":"Then perhaps it will bear fruit after this; but if not, you can cut it down and out."},{"num":10,"verse":"Now Jesus was teaching in one of the synagogues on the Sabbath."},{"num":11,"verse":"And there was a woman there who for eighteen years had had an infirmity caused by a spirit (a demon of sickness). She was bent completely forward and utterly unable to straighten herself up or to look upward."},{"num":12,"verse":"And when Jesus saw her, He called [her to Him] and said to her, Woman, you are released from your infirmity!"},{"num":13,"verse":"Then He laid [His] hands on her, and instantly she was made straight, and she recognized and thanked and praised God."},{"num":14,"verse":"But the leader of the synagogue, indignant because Jesus had healed on the Sabbath, said to the crowd, There are six days on which work ought to be done; so come on those days and be cured, and not on the Sabbath day."},{"num":15,"verse":"But the Lord replied to him, saying, You playactors (hypocrites)! Does not each one of you on the Sabbath loose his ox or his donkey from the stall and lead it out to water it?"},{"num":16,"verse":"And ought not this woman, a daughter of Abraham, whom Satan has kept bound for eighteen years, be loosed from this bond on the Sabbath day?"},{"num":17,"verse":"Even as He said this, all His opponents were put to shame, and all the people were rejoicing over all the glorious things that were being done by Him."},{"num":18,"verse":"This led Him to say, What is the kingdom of God like? And to what shall I compare it?"},{"num":19,"verse":"It is like a grain of mustard seed, which a man took and planted in his own garden; and it grew and became a tree, and the wild birds found shelter and roosted and nested in its branches."},{"num":20,"verse":"And again He said, To what shall I liken the kingdom of God?"},{"num":21,"verse":"It is like leaven which a woman took and hid in three measures of wheat flour or meal until it was all leavened (fermented)."},{"num":22,"verse":"[Jesus] journeyed on through towns and villages, teaching, and making His way toward Jerusalem."},{"num":23,"verse":"And someone asked Him, Lord, will only a few be saved (rescued, delivered from the penalties of the last judgment, and made partakers of the salvation by Christ)? And He said to them,"},{"num":24,"verse":"Strive to enter by the narrow door [force yourselves through it], for many, I tell you, will try to enter and will not be able."},{"num":25,"verse":"When once the Master of the house gets up and closes the door, and you begin to stand outside and to knock at the door [again and again], saying, Lord, open to us! He will answer you, I do not know where [what household—certainly not Mine] you come from."},{"num":26,"verse":"Then you will begin to say, We ate and drank in Your presence, and You taught in our streets."},{"num":27,"verse":"But He will say, I tell you, I do not know where [what household—certainly not Mine] you come from; depart from Me, all you wrongdoers!"},{"num":28,"verse":"There will be weeping and grinding of teeth when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God, but you yourselves being cast forth (banished, driven away)."},{"num":29,"verse":"And [people] will come from east and west, and from north and south, and sit down (feast at table) in the kingdom of God."},{"num":30,"verse":"And behold, there are some [now] last who will be first [then], and there are some [now] first who will be last [then]."},{"num":31,"verse":"At that very hour some Pharisees came up and said to Him, Go away from here, for Herod is determined to kill You."},{"num":32,"verse":"And He said to them, Go and tell that fox [sly and crafty, skulking and cowardly], Behold, I drive out demons and perform healings today and tomorrow, and on the third day I finish (complete) My course."},{"num":33,"verse":"Nevertheless, I must continue on My way today and tomorrow and the day after that—for it will never do for a prophet to be destroyed away from Jerusalem!"},{"num":34,"verse":"O Jerusalem, Jerusalem, you who continue to kill the prophets and to stone those who are sent to you! How often I have desired and yearned to gather your children together [around Me], as a hen [gathers] her young under her wings, but you would not!"},{"num":35,"verse":"Behold, your house is forsaken (abandoned, left to you destitute of God’s help)! And I tell you, you will not see Me again until the time comes when you shall say, Blessed (to be celebrated with praises) is He Who comes in the name of the Lord!"}]