[{"header":"Change Your Hearts"},{"num":13,"verse":"At that time some people were there with Jesus. They told him about what had happened to some people from Galilee. Pilate killed those people while they were worshiping. He mixed their blood with the blood of the animals they were sacrificing to God. "},{"num":2,"verse":"Jesus answered, “Do you think this happened to them because they were more sinful than all others from Galilee? "},{"header":"The Useless Tree"},{"num":6,"verse":"Jesus told this story: “A man had a fig tree planted in his vineyard. He came looking for some fruit on the tree, but he found none. "},{"header":"Jesus Heals on the Sabbath"},{"num":10,"verse":"Jesus was teaching in one of the synagogues on the Sabbath day. "},{"num":11,"verse":"In the synagogue there was a woman who had an evil spirit in her. This spirit had made the woman a cripple for 18 years. Her back was always bent; she could not stand up straight. "},{"num":12,"verse":"When Jesus saw her, he called her over and said, “Woman, your sickness has left you!” "},{"num":13,"verse":"Jesus put his hands on her. Immediately she was able to stand up straight and began praising God."},{"num":14,"verse":"The synagogue leader was angry because Jesus healed on the Sabbath day. He said to the people, “There are six days for work. So come to be healed on one of those days. Don’t come for healing on the Sabbath day.”"},{"num":15,"verse":"The Lord answered, “You people are hypocrites! All of you untie your work animals and lead them to drink water every day—even on the Sabbath day! "},{"num":17,"verse":"When Jesus said this, all the men who were criticizing him were ashamed. And all the people were happy for the wonderful things Jesus was doing."},{"header":"Stories of Mustard Seed and Yeast"},{"num":18,"verse":"Then Jesus said, “What is God’s kingdom like? What can I compare it with? "},{"num":20,"verse":"Jesus said again, “What can I compare God’s kingdom with? "},{"header":"The Narrow Door"},{"num":22,"verse":"Jesus was teaching in every town and village. He continued to travel toward Jerusalem. "},{"num":23,"verse":"Someone said to Jesus, “Lord, how many people will be saved? Only a few?”"},{"header":"Jesus Will Die in Jerusalem"},{"num":31,"verse":"At that time some Pharisees came to Jesus and said, “Go away from here! Herod wants to kill you!”"},{"num":32,"verse":"Jesus said to them, “Go tell that fox Herod, ‘Today and tomorrow I am forcing demons out of people and finishing my work of healing. Then, on the third day, I will reach my goal.’ "}]