[{"header":"Everyone Should Be Sorry for Their Sins and Turn from Them"},{"num":13,"verse":"At this time some people came to Jesus. They told Him that Pilate had killed some people from the country of Galilee. It was while they were giving gifts of animals on the altar in worship to God. "},{"num":2,"verse":"Pilate put their blood together with the blood of the animals. Jesus said to them, “What about these people from Galilee? Were they worse sinners than all the other people from Galilee because they suffered these things? "},{"header":"The Picture-Story of the Fig Tree Which Had No Fruit"},{"num":6,"verse":"Then He told them this picture-story: “A man had a fig tree in his grape-field. He looked for fruit on it but found none. "},{"header":"Jesus Heals on the Day of Rest"},{"num":10,"verse":"Jesus was teaching in one of the Jewish places of worship on the Day of Rest. "},{"num":11,"verse":"A woman was there who had suffered for eighteen years because of a demon. She was not able to stand up straight. "},{"num":12,"verse":"Jesus saw her and said, “Woman, you are now free from your trouble!” "},{"num":13,"verse":"Then He put His hand on her. At once she stood up straight and gave thanks to God."},{"num":14,"verse":"The leader of the Jewish place of worship was angry because Jesus healed on the Day of Rest. The leader said to the people, “There are six days in which work should be done. Come on those days and get healed. Do not come to be healed on the Day of Rest.” "},{"num":15,"verse":"The Lord said to him, “You pretend to be someone you are not! Do not each of you let his cow or his donkey out and lead them to water on the Day of Rest? "},{"num":17,"verse":"When He said this, all those who were against Him were ashamed. All the many people were glad for the great things being done by Him."},{"header":"The Picture-Stories of the Mustard Seed and the Yeast (A)"},{"num":18,"verse":"Then Jesus asked, “What is the holy nation of God like? What can I use to show you? "},{"num":20,"verse":"Again Jesus said, “What can I use to show you what the holy nation of God is like? "},{"header":"Jesus Teaches on the Way to Jerusalem"},{"num":22,"verse":"Jesus taught the people as He went through the cities and towns on His way to Jerusalem. "},{"num":23,"verse":"Someone asked Jesus, “Lord, will only a few people be saved from the punishment of sin?” Jesus said to them, "},{"num":31,"verse":"That same day some of the proud religious law-keepers came to Jesus. They said, “Go away from here! Herod wants to kill You.” "},{"num":32,"verse":"Jesus said to them, “Go and tell that fox, ‘See. I put out demons and heal the sick. I will do these things today and tomorrow. And the third day My work will be finished.’ "},{"header":"Jesus Sorrows Over Jerusalem"}]