[{"header":"Wisdom—or the Way to Hell"},{"num":9,"verse":"Wisdom has built her house. She has made seven pillars to hold it up. "},{"num":2,"verse":"She has cooked her food, and has mixed her wine, and she has set her table. "},{"num":3,"verse":"She has sent out the young women who work for her. She calls from the highest places of the city, "},{"num":4,"verse":"“Whoever is easy to fool, let him turn in here!” She says to the one without understanding, "},{"num":5,"verse":"“Come and eat my food, and drink the wine I have mixed. "},{"num":6,"verse":"Turn from your foolish way, and live. Walk in the way of understanding.”"},{"num":7,"verse":"He who speaks strong words to the man who laughs at the truth brings shame upon himself. He who speaks strong words to a sinful man gets hurt. "},{"num":8,"verse":"Do not speak strong words to a man who laughs at the truth, or he will hate you. Speak strong words to a wise man, and he will love you. "},{"num":9,"verse":"Give teaching to a wise man and he will be even wiser. Teach a man who is right and good, and he will grow in learning. "},{"num":10,"verse":"The fear of the Lord is the beginning of wisdom. To learn about the Holy One is understanding. "},{"num":11,"verse":"For by me your days will grow in number, and years will be added to your life. "},{"num":12,"verse":"If you are wise, your wisdom is a help to you. If you laugh at the truth, you alone will suffer for it."},{"num":13,"verse":"A foolish woman makes much noise. She is open to sin, and knows nothing. "},{"num":14,"verse":"She sits at the door of her house or on a seat in the high places of the city. "},{"num":15,"verse":"She calls to those who pass by and are making their paths straight, "},{"num":16,"verse":"“Whoever is easy to fool, let him turn in here!” She says to the one without understanding, "},{"num":17,"verse":"“Stolen water is sweet. And bread eaten in secret is pleasing.” "},{"num":18,"verse":"But he does not know that the dead are there, and that the ones who visit her are in the bottom of hell."}]