[{"num":28,"verse":"¶ Woe to the crown of pride, to the drunkards of Ephraim and to the open flower of the beauty of their glory which is upon the head of the fertile valley of those that are overcome with wine!"},{"num":2,"verse":"Behold, the Lord has a mighty and strong one who as a tempest of hail and a destroying storm, as a flood of mighty waters overflowing shall cast down to the earth with the hand."},{"num":3,"verse":"The crown of pride, the drunkards of Ephraim, shall be trodden under feet:"},{"num":4,"verse":"And the fading flower of the beauty of their glory, which is upon the head of the fertile valley, shall be as the early fig, which comes first before the other fruits of the summer; which when he that looks upon it sees it; as soon as he has it in his hand, he eats it up."},{"num":5,"verse":"In that day the LORD of the hosts shall be for a crown of glory and for a diadem of beauty unto the residue of his people,"},{"num":6,"verse":"And for a spirit of judgment to him that sits upon the throne of judgment, and for strength to those that turn the battle to the gate."},{"num":7,"verse":"But they also have erred through wine, and through strong drink are out of the way; the priest and the prophet have erred through strong drink; they are swallowed up of wine, they are out of the way through strong drink; they err in vision, they stumble in judgment."},{"num":8,"verse":"For all tables are full of vomit and filthiness, so that there is no place clean."},{"num":9,"verse":"¶ Whom shall he teach knowledge? and whom shall he make to understand doctrine? Those that are weaned from the milk and drawn from the breasts."},{"num":10,"verse":"For precept must be upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little:"},{"num":11,"verse":"For with stammering lips and another tongue he will speak to this people."},{"num":12,"verse":"To whom he said, This is the rest with which ye may cause the weary to rest; and this is the refreshing: yet they would not hear."},{"num":13,"verse":"But the word of the LORD shall be unto them precept upon precept, precept upon precept; line upon line, line upon line; here a little, and there a little; that they might go and fall backward and be broken and snared and taken."},{"num":14,"verse":"¶ Therefore hear the word of the LORD, ye scornful men, that have taken rule over this people which is in Jerusalem."},{"num":15,"verse":"Because ye have said, We have made a covenant with death, and with Sheol we are at agreement; when the overflowing scourge shall pass through, it shall not come unto us: for we have made lies our refuge, and under falsehood we have hid ourselves:"},{"num":16,"verse":"Therefore thus saith the Lord GOD, Behold, I lay in Zion for a foundation a stone, a tried stone, a precious corner stone, a sure foundation: he that believes shall not make haste."},{"num":17,"verse":"Judgment also will I lay to the line and righteousness to the plummet: and the hail shall sweep away the refuge of lies, and the waters shall overflow the hiding place."},{"num":18,"verse":"And your covenant with death shall be disannulled, and your agreement with Sheol shall not stand; when the overflowing scourge shall pass through, then ye shall be trodden down by it."},{"num":19,"verse":"From the time that it goes forth, it shall take you: for it shall come suddenly, by day and by night: and it shall be that the terror only causes one to understand the report."},{"num":20,"verse":"For the bed is shorter than that a man can stretch himself on it: and the covering narrower than that he can wrap himself in it."},{"num":21,"verse":"For the LORD shall rise up as in Mount Perazim, he shall be wroth as in the valley of Gibeon, that he may do his work, his strange work; and bring to pass his act, his strange act."},{"num":22,"verse":"Now therefore do not be mockers lest your bands be made strong: for I have heard from the Lord GOD of the hosts that consumption and destruction are determined upon the whole earth."},{"num":23,"verse":"¶ Give ye ear and hear my voice; hearken and hear my speech."},{"num":24,"verse":"Does the plowman plow all day to sow? does he open and break the clods of his ground?"},{"num":25,"verse":"When he has levelled the face thereof, does he not cast abroad the fitches and scatter the cummin and cast in the principal wheat and the appointed barley and the rye in their place?"},{"num":26,"verse":"For his God teaches him to know how to judge and instructs him."},{"num":27,"verse":"For the fitches are not threshed with a threshing instrument, neither is a cart wheel turned about upon the cummin; but the fitches are beaten out with a staff and the cummin with a rod."},{"num":28,"verse":"Grain is thrashed to make bread; but he will not ever be threshing it, nor shall he grind it with the wheel of his cart, nor crush it with the teeth of his thrashing instrument."},{"num":29,"verse":"This also comes forth from the LORD of the hosts to make his counsel wonderful, and to increase wisdom."}]