[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:8-18 True devotion calms the spirit, quiets and softens it, but superstition and devotion to false gods inflame men's passions. The matter is put into a little compass, Turn, or burn. Proud men are still ready to say, as Nebuchadnezzar, Who is the Lord, that I should fear his power? Shadrach, Meshach, and Abednego did not hesitate whether they should comply or not. Life or death were not to be considered. Those that would avoid sin, must not parley with temptation when that to which we are allured or affrighted is manifestly evil. Stand not to pause about it, but say, as Christ did, Get thee behind me, Satan. They did not contrive an evasive answer, when a direct answer was expected. Those who make their duty their main care, need not be anxious or fearful concerning the event. The faithful servants of God find him able to control and overrule all the powers armed against them. Lord, if thou wilt, thou canst. If He be for us, we need not fear what man can do unto us. God will deliver us, either from death or in death. They must obey God rather than man; they must rather suffer than sin; and must not do evil that good may come. Therefore none of these things moved them. The saving them from sinful compliance, was as great a miracle in the kingdom of grace, as the saving them out of the fiery furnace was in the kingdom of nature. Fear of man and love of the world, especially want of faith, make men yield to temptation, while a firm persuasion of the truth will deliver them from denying Christ, or being ashamed of him. We are to be meek in our replies, but we must be decided that we will obey God rather than man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou, O king, hast made a decree ... - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the decree included \"every man\" who heard the sound of the music, it of course embraced the Jews, whatever religious scruples they might have. Whether their scruples, however, were known at the time is not certain; or whether they would have been regarded if known, is no more certain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. live for ever—A preface of flattery is closely akin to the cruelty that follows. So Ac 24:2, 3, &c., Tertullus in accusing Paul before Felix.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And whoso falleth not down and worshippeth,.... The image; the above is the decree, this that follows the sanction of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he should be cast into the midst of the burning fiery furnace; See Gill on Daniel 3:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that he should be cast into the midst of the burning fiery furnace; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And whoso falleth not down and worshippeth, that he should be cast into the midst of a burning fiery furnace.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Chaldeans immediately denounced Daniel's three friends as transgressors of the king's command. דּנה כּל־קבל, therefore, viz., because the friends of Daniel who were placed over the province of Babylon had not, by falling down before the golden image, done it homage. That they did not do so is not expressly said, but is expressed in what follows. כּשׂדּאין גּברין are not Chaldeans as astrologers of magi (כּשׂדּים), but members of the Chaldean nation, in contrast to יהוּדיא, the Jews. קרבוּ, they came near to the king. דּי קרצי אכל, literally, to eat the flesh of any one, is in Aramaic the common expression for to calumniate, to denounce. That which was odious in their report was, that they used this instance of disobedience to the king's command on the part of the Jewish officers as an occasion of removing them from their offices, - that their denunciation of them arose from their envying the Jews their position of influence, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (4)f. Therefore they give prominence to the fact that the king had raised these Jews to places of rule in the province of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With this form of address in Daniel 3:9, cf. Daniel 2:4. טעם שׂים signifies in Daniel 3:12 rationem reddere, to attend to, to have regard for. In Daniel 3:10, as frequently, the expression signifies, on the contrary, to give an opinion, a judgment, i.e., to publish a command. The Keth. לאלהיך (Daniel 3:12), for which the Keri prefers the sing. form לאלהך, in sound the same as the contracted plur., is to be maintained as correct; for the Keri here, as in Daniel 3:18, supporting itself on לאלהי, Daniel 3:14, rests on the idea that by the honouring of his god only the doing of homage to the image is meant, while the not doing homage to the image only gives proof of this, that they altogether refused to honour the gods of Nebuchadnezzar. This is placed in the foreground by the accusers, so as to arouse the indignation of the king. \"These Chaldeans,\" Hitz. remarks quite justly, \"knew the three Jews, who were so placed as to be well known, and at the same time envied, before this. They had long known that they did not worship idols; but on this occasion, when their religion made it necessary for the Jews to disobey the king's command, they make use of their knowledge.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With this form of address in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". טעם שׂים signifies in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rationem reddere, to attend to, to have regard for. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as frequently, the expression signifies, on the contrary, to give an opinion, a judgment, i.e., to publish a command. The Keth. לאלהיך (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for which the Keri prefers the sing. form לאלהך, in sound the same as the contracted plur., is to be maintained as correct; for the Keri here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", supporting itself on לאלהי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", rests on the idea that by the honouring of his god only the doing of homage to the image is meant, while the not doing homage to the image only gives proof of this, that they altogether refused to honour the gods of Nebuchadnezzar. This is placed in the foreground by the accusers, so as to arouse the indignation of the king. \"These Chaldeans,\" Hitz. remarks quite justly, \"knew the three Jews, who were so placed as to be well known, and at the same time envied, before this. They had long known that they did not worship idols; but on this occasion, when their religion made it necessary for the Jews to disobey the king's command, they make use of their knowledge.\"",
            "children": []
          }
        ]
      }
    ]
  }
]