[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:19-27 Let Nebuchadnezzar heat his furnace as hot as he can, a few minutes will finish the torment of those cast into it; but hell-fire tortures, and yet does not kill. Those who worshipped the beast and his image, have no rest, no pause, no moment free from pain, Re 14:10,11. Now was fulfilled in the letter that great promise, Isa 43:2, When thou walkest through the fire, thou shalt not be burned. Leaving it to that God who preserved them in the fire, to bring them out, they walked up and down in the midst, supported and encouraged by the presence of the Son of God. Those who suffer for Christ, have his presence in their sufferings, even in the fiery furnace, and in the valley of the shadow of death. Nebuchadnezzar owns them for servants of the most high God; a God able to deliver them out of his hand. It is our God only is the consuming fire, Heb 12:29. Could we but see into the eternal world, we should behold the persecuted believer safe from the malice of his foes, while they are exposed to the wrath of God, and tormented in unquenchable fires.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And these three men - fell down bound ... - That is, the flame did not loosen the cords by which they had been fastened. The fact that they were seen to fall into the furnace \"bound,\" made the miracle the more remarkable that they should be seen walking loose in the midst of the fire.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the Septuagint, Syriac, Arabic, and Latin Vulgate, there follow in this place sixty-eight verses, containing \"The Song of the Three Holy Children.\" This is not in the Chaldee, and its origin is unknown. It is with entire propriety placed in the Apocrypha, as being no part of the inspired canon. With some things that are improbable and absurd, the \"song\" contains many things that are beautiful, and that would be highly appropriate if a song had been uttered at all in the furnace. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the Septuagint, Syriac, Arabic, and Latin Vulgate, there follow in this place sixty-eight verses, containing \"The Song of the Three Holy Children.\" This is not in the Chaldee, and its origin is unknown. It is with entire propriety placed in the Apocrypha, as being no part of the inspired canon. With some things that are improbable and absurd, the \"song\" contains many things that are beautiful, and that would be highly appropriate if a song had been uttered at all in the furnace. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. fell down—not cast down; for those who brought the three youths to the furnace, perished by the flames themselves, and so could not cast them in. Here follows an addition in the Septuagint, Syrian, Arabic, and Vulgate versions. \"The Prayer of Azarias,\" and \"The Song of the Three Holy Children.\" It is not in the Chaldee. The hymn was sung throughout the whole Church in their liturgies, from the earliest times [Rufinus in Commentary on the Apostles Creed, and Athanasius]. The \"astonishment\" of Nebuchadnezzar in Da 3:24 is made an argument for its genuineness, as if it explained the cause of his astonishment, namely, \"they walked in the midst of the fire praising God, but the angel of the Lord came down into the oven\" (vs. 1 and vs. 27 of the Apocryphal addition). But Da 3:25 of English Version explains his astonishment, without need of any addition.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " All this is expressed with emphasis, to make the power of God more glorious in their preservation; for that flame that slew the executioners might much more easily have suffocated the three children before they fell down. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And these three men fell down bound into the midst of the burning fiery furnace. The fire not so much as destroying what they were bound with, and much less them; but being bound they fell, and there they lay for the present, unbound and alive; when those that cast them in were destroyed. In the Septuagint, Vulgate Latin, Syriac, and Arabic versions, follow sixty seven verses, containing the song of Azariah and his companions in the furnace, which are not in the Hebrew text. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And these three men, Shadrach, Meshach, and Abednego, fell down bound into the midst of the burning fiery furnace.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "דּי מן (because that), a further explanatory expression added to דּנה כּל־קבל (wholly for this cause): because the word of the king was sharp, and in consequence of it (ו), the furnace was heated beyond measure for that reason. The words אלּך גּבריּא (these mighty men) stand here in the status absol., and are again taken up in the pronoun המּון after the verb קטּל. If the three were brought up to the furnace, it must have had a mouth above, through which the victims could be cast into it. When heated to an ordinary degree, this could be done without danger to the men who performed this service; but in the present case the heat of the fire was so great, that the servants themselves perished by it. This circumstance also is mentioned to show the greatness of the miracle by which the three were preserved unhurt in the midst of the furnace. The same thing is intended by the repetition of the word מכפּתין, bound, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which, moreover, is purposely placed at the close of the passage to prepare for the contrast שׁרין, at liberty, free from the bonds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Between Daniel 3:23 and Daniel 3:24 the lxx have introduced the Prayer of Azariah and the Song of the three men in the fiery furnace; and these two hymns are connected together by a narrative which explains the death of the Chaldeans who threw the three into the furnace, and the miracle of the deliverance of Daniel's friends. Regarding the apocryphal origin of these additions, composed in the Greek language, which Luther in his translation has rightly placed in the Apocrypha, see my Lehr. der Einl. in d. A. Test. 251.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the lxx have introduced the Prayer of Azariah and the Song of the three men in the fiery furnace; and these two hymns are connected together by a narrative which explains the death of the Chaldeans who threw the three into the furnace, and the miracle of the deliverance of Daniel's friends. Regarding the apocryphal origin of these additions, composed in the Greek language, which Luther in his translation has rightly placed in the Apocrypha, see my Lehr. der Einl. in d. A. Test. 251.) ",
            "children": []
          }
        ]
      }
    ]
  }
]