[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherefore.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because certain Jews were noticed to be absent at the time. It is natural to suppose that the promotion of three men of Jewish extraction would have been viewed with the greatest jealousy by the Babylonian officers, who, no doubt, had been carefully watching their opportunity of revenge. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Chaldeans.—Not to be confused with the astrologers mentioned in Daniel 2:5, but Chaldean native subjects, contrasted with the Jewish colonists spoken of at the end of the verse.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Chaldeans.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Not to be confused with the astrologers mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but Chaldean native subjects, contrasted with the Jewish colonists spoken of at the end of the verse.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 3:8-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:8-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "At that time certain Chaldeans came near, and accused the Jews — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is not improbable that these Chaldeans were such as envied these friends of Daniel their preferments, having perhaps themselves expected the places to which they had been advanced. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They spake and said, O king, live for ever — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They approached the king with a great show of loyalty, and concern for his life, honour, and interest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou, O king, hast made a decree, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — They put him in mind of the law he had lately made, that all manner of persons, without exception, should fall down and worship his golden image: they put him in mind also of the penalty which was to be inflicted upon recusants. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There are certain Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — It is likely that Nebuchadnezzar had no particular design to insnare Shadrach and his companions in making this law; for then he would himself have had his eye upon them, and would not have needed this information; but their enemies, who sought an occasion against them, laid hold on this, and were forward to accuse them. To aggravate the matter, and incense the king more against them, they, 1st, Put him in mind of the dignity to which the criminals had been preferred; that though they were Jews, foreigners, captives, and men of a despised nation and religion, yet the king had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "set them over the affairs of the province of Babylon — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was, therefore, they suggested, very ungrateful, and an insufferable piece of insolence in them, to disobey the king’s command, who had shared so much of the king’s favour. And, besides, the high station they were in would give their refusal the greater influence, and render it of the worse consequence. 2d, They suggest, that it was done maliciously, contumaciously, and in contempt of him and his authority. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "These men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "say they, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have not regarded thee, they serve not thy gods, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Thus princes, who are wont to be incensed enough against innocent people, seldom want those about them who do all they can to excite them to greater wrath. If it be asked here, Where was Daniel on this occasion? It may be answered, He was probably absent, either because the king’s business called him elsewhere, or because he had leave of absence from the king; unless we suppose that he stood so high in the king’s favour that none durst complain of him for his non-compliance. But why did not his companions keep out of the way? Surely, because they would obey the king’s orders as far as they could conscientiously, and wished to be present to bear a public testimony against this gross idolatry. God also, no doubt, inclined them to attend, that they might glorify him by a noble confession, made in face of the most extreme danger; and that he might honour and reward them, by a most extraordinary and wonderful deliverance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:8-18 True devotion calms the spirit, quiets and softens it, but superstition and devotion to false gods inflame men's passions. The matter is put into a little compass, Turn, or burn. Proud men are still ready to say, as Nebuchadnezzar, Who is the Lord, that I should fear his power? Shadrach, Meshach, and Abednego did not hesitate whether they should comply or not. Life or death were not to be considered. Those that would avoid sin, must not parley with temptation when that to which we are allured or affrighted is manifestly evil. Stand not to pause about it, but say, as Christ did, Get thee behind me, Satan. They did not contrive an evasive answer, when a direct answer was expected. Those who make their duty their main care, need not be anxious or fearful concerning the event. The faithful servants of God find him able to control and overrule all the powers armed against them. Lord, if thou wilt, thou canst. If He be for us, we need not fear what man can do unto us. God will deliver us, either from death or in death. They must obey God rather than man; they must rather suffer than sin; and must not do evil that good may come. Therefore none of these things moved them. The saving them from sinful compliance, was as great a miracle in the kingdom of grace, as the saving them out of the fiery furnace was in the kingdom of nature. Fear of man and love of the world, especially want of faith, make men yield to temptation, while a firm persuasion of the truth will deliver them from denying Christ, or being ashamed of him. We are to be meek in our replies, but we must be decided that we will obey God rather than man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wherefore at that time certain Chaldeans came near, and accused the Jews - It does not appear that they accused the Jews in general, but particularly Shadrach, Meshach, and Abednego, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They were present on the occasion, being summoned with the other officers of the realm ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but they could not unite in the idolatrous worship. It has been frequently said that the whole thing was arranged, either by the king of his own accord, or by the instigation of their enemies, with a view to involve the Jews in difficulty, knowing that they could not conscientiously comply with the command to worship the image. But nothing of this kind appears in the narrative itself, It does not appear that the Jews were unpopular, or that there was any less disposition to show favor to them than to any other foreigners. They had been raised indeed to high offices, but there is no evidence that any office was conferred on them which it was not regarded as proper to confer on foreigners; nor is there any evidence that in the discharge of the duties of the office they had given occasion for a just accusation. The plain account is, that the king set up the image for other purposes, and with no malicious design toward them; that when summoned to be present with the other officers of the realm at the dedication of the image they obeyed the command; but that when the order was issued that they should render \"religious homage\" to the idol, every principle of their religion revolted at it, and they refused. For the probable reasons why Daniel was not included in the number, see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. accused the Jews—literally, \"ate the rent limbs,\" or flesh of the Jews (compare Job 31:31; Ps 14:4; 27:2; Jer 10:25). Not probably in general, but as Da 3:12 states, Shadrach, Meshach, and Abed-nego. Why Daniel was not summoned does not appear. Probably he was in some distant part of the empire on state business, and the general summons (Da 3:2) had not time to reach him before the dedication. Also, the Jews' enemies found it more politic to begin by attacking Shadrach, Meshach, and Abed-nego, who were nearer at hand, and had less influence, before they proceeded to attack Daniel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wherefore at that time certain Chaldeans came near,.... That is, to King Nebuchadnezzar, either in his palace at Babylon, or more likely in the plain of Dura: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and accused the Jews; particularly Shadrach, Meshach, and Abednego, as after mentioned, of not obeying the king's command, to worship the golden image: these Chaldeans at the time of adoration had their eyes upon the Jews, particularly those three men, to observe how they would behave; and as they stood up while the others fell down, they were easily observed; wherefore they immediately hasten to the king, to give this information against them; whose places of trust and honour they envied, and now hoped to be put into them in their place and if these were the Chaldeans, or some of them, whose lives these men had been the means of saving, as is probable, they acted a very ungrateful part. Should it be asked, how came these three men to be present? it may be answered, they came here in obedience to the king's orders, as his officers, who had summoned them to this place; which they judged their duty to do, though they determined not to worship his image, should he require it; or they came here on purpose to bear their testimony against such idolatry. No mention is made of Daniel; very probably he was not here; for what reasons cannot be said; however, no accusation is laid against him; perhaps he was too great to be meddled with, being high in the king's favour. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and accused the Jews; particularly Shadrach, Meshach, and Abednego, as after mentioned, of not obeying the king's command, to worship the golden image: these Chaldeans at the time of adoration had their eyes upon the Jews, particularly those three men, to observe how they would behave; and as they stood up while the others fell down, they were easily observed; wherefore they immediately hasten to the king, to give this information against them; whose places of trust and honour they envied, and now hoped to be put into them in their place and if these were the Chaldeans, or some of them, whose lives these men had been the means of saving, as is probable, they acted a very ungrateful part. Should it be asked, how came these three men to be present? it may be answered, they came here in obedience to the king's orders, as his officers, who had summoned them to this place; which they judged their duty to do, though they determined not to worship his image, should he require it; or they came here on purpose to bear their testimony against such idolatry. No mention is made of Daniel; very probably he was not here; for what reasons cannot be said; however, no accusation is laid against him; perhaps he was too great to be meddled with, being high in the king's favour. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Wherefore at that time certain Chaldeans came near, and accused the Jews.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "certain Chaldeans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] probably, though not here necessarily, the learned class among the Babylonians (as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.). See p. 12 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "accused",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The figure in the original is a peculiar one, lit. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ate the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "torn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pieces of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Jews.’ The expression has commonly in Aramaic the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "falsely accuse",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slander",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Targ., and in Syriac (e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαβάλλειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’âkhçl ḳarzâ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ διάβολος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the false accuser, or, ‘devil,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and regularly): here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is used at least in the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "accuse maliciously",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "8–18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The accusation brought against the three Jewish youths, and their answer to the king.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Wherefore at that time certain Chaldeans came near, and accused the Jews.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Septuagint is in this verse closer to the Massoretic than is Theodotion. The latter has nothing to represent the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כָלאּךקבֵל דְנָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kol-qobayl d'nah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the original, which appears in our versions as \"wherefore.\" The Septuagint renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κατέναντι τούτου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Peshitta also has omitted \"wherefore;\" in the next clause it is slavishly accurate, giving the peculiar turn of the phrase in the original, '",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "achalu qartzchun",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " devour pieces of them.\" It occurs in the Syriac of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it is in the Targum of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Vulgate presents no points worthy of notice. It is evident that \"Chaldean\" is here used in its ethnic sense of the nation, not in its professional sense as of the alleged class. We must remember that \"Chaldean\" is not equivalent to \"Babylonian.\" As we have seen, the Chaldeans were intruders in Babylon, and to them Nebuchadnezzar belonged. It was but natural that native-born Chaldeans, who reckoned ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "themselves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to be of the same kin as the king, objected to have their  rights postponed to a set of Jews. The fact that the three friends are not named, or in any way designated, but the whole Jewish race is referred to, shows that the purpose of these Chaldeans involved the whole Jewish people, and that they singled out Shadrach, Meshach, and Abednego simply as test cases. Their elevation to positions Of such trust might well have caused jealousy of them. Daniel 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Chaldeans immediately denounced Daniel's three friends as transgressors of the king's command. דּנה כּל־קבל, therefore, viz., because the friends of Daniel who were placed over the province of Babylon had not, by falling down before the golden image, done it homage. That they did not do so is not expressly said, but is expressed in what follows. כּשׂדּאין גּברין are not Chaldeans as astrologers of magi (כּשׂדּים), but members of the Chaldean nation, in contrast to יהוּדיא, the Jews. קרבוּ, they came near to the king. דּי קרצי אכל, literally, to eat the flesh of any one, is in Aramaic the common expression for to calumniate, to denounce. That which was odious in their report was, that they used this instance of disobedience to the king's command on the part of the Jewish officers as an occasion of removing them from their offices, - that their denunciation of them arose from their envying the Jews their position of influence, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (4)f. Therefore they give prominence to the fact that the king had raised these Jews to places of rule in the province of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With this form of address in Daniel 3:9, cf. Daniel 2:4. טעם שׂים signifies in Daniel 3:12 rationem reddere, to attend to, to have regard for. In Daniel 3:10, as frequently, the expression signifies, on the contrary, to give an opinion, a judgment, i.e., to publish a command. The Keth. לאלהיך (Daniel 3:12), for which the Keri prefers the sing. form לאלהך, in sound the same as the contracted plur., is to be maintained as correct; for the Keri here, as in Daniel 3:18, supporting itself on לאלהי, Daniel 3:14, rests on the idea that by the honouring of his god only the doing of homage to the image is meant, while the not doing homage to the image only gives proof of this, that they altogether refused to honour the gods of Nebuchadnezzar. This is placed in the foreground by the accusers, so as to arouse the indignation of the king. \"These Chaldeans,\" Hitz. remarks quite justly, \"knew the three Jews, who were so placed as to be well known, and at the same time envied, before this. They had long known that they did not worship idols; but on this occasion, when their religion made it necessary for the Jews to disobey the king's command, they make use of their knowledge.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With this form of address in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". טעם שׂים signifies in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rationem reddere, to attend to, to have regard for. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as frequently, the expression signifies, on the contrary, to give an opinion, a judgment, i.e., to publish a command. The Keth. לאלהיך (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for which the Keri prefers the sing. form לאלהך, in sound the same as the contracted plur., is to be maintained as correct; for the Keri here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", supporting itself on לאלהי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", rests on the idea that by the honouring of his god only the doing of homage to the image is meant, while the not doing homage to the image only gives proof of this, that they altogether refused to honour the gods of Nebuchadnezzar. This is placed in the foreground by the accusers, so as to arouse the indignation of the king. \"These Chaldeans,\" Hitz. remarks quite justly, \"knew the three Jews, who were so placed as to be well known, and at the same time envied, before this. They had long known that they did not worship idols; but on this occasion, when their religion made it necessary for the Jews to disobey the king's command, they make use of their knowledge.\"",
            "children": []
          }
        ]
      }
    ]
  }
]