[[],[{"type":"header","content":"Obadiah Meets Elijah"},{"type":"prose","content":"Now it happened after many days that the word of the Lord came to Elijah in the third year, saying, “Go, show yourself to Ahab, and I will send rain on the face of the earth.” "}],[{"type":"prose","content":"So Elijah went to show himself to Ahab. Now the famine was severe in Samaria. "}],[{"type":"prose","content":"Ahab called Obadiah who was the governor of his house. Now Obadiah feared the LORD greatly; "}],[{"type":"prose","content":"for when Jezebel destroyed the prophets of the LORD, Obadiah took a hundred prophets and hid them by fifties in a cave, and provided them with bread and water. "}],[{"type":"prose","content":"Then Ahab said to Obadiah, “Go into the land to all the sources of water and to all the streams; perhaps we may find grass and keep the horses and mules alive, and not have to kill some of the cattle.” "}],[{"type":"prose","content":"So they divided the land between them to survey it. Ahab went one way by himself and Obadiah went another way by himself."}],[{"type":"prose","content":"As Obadiah was on the way, behold, Elijah met him. He recognized him and fell face downward [out of respect] and said, “Is it you, my lord Elijah?” "}],[{"type":"prose","content":"He answered him, “It is I. Go tell your master, ‘Elijah is here.’” "}],[{"type":"prose","content":"But he said, “What sin have I committed, that you would hand over your servant to Ahab to put me to death? "}],[{"type":"prose","content":"As the LORD your God lives, there is no nation or kingdom where my master has not sent  to seek you; and when they said, ‘He is not here,’ Ahab made the kingdom or nation swear that they had not found you. "}],[{"type":"prose","content":"And now you are saying, ‘Go, tell your master, “Behold, Elijah [is here].”’ "}],[{"type":"prose","content":"And as soon as I leave you, the Spirit of the LORD will carry you to a place I do not know; so when I come to tell Ahab and he does not find you, he will kill me. Yet your servant has [reverently] feared the LORD from my youth. "}],[{"type":"prose","content":"Has it not been told to my lord [Elijah] what I did when Jezebel killed the prophets of the LORD, how I hid a hundred of the LORD’S prophets by fifties in a cave, and provided them with bread and water? "}],[{"type":"prose","content":"And now you are saying, ‘Go, tell your master, “Elijah is here”’; and he will kill me.” "}],[{"type":"prose","content":"Elijah said, “As the LORD of hosts (armies) lives, before whom I stand, I will certainly show myself to Ahab today.” "}],[{"type":"prose","content":"So Obadiah went to meet Ahab and told him; and Ahab went to meet Elijah."}],[{"type":"prose","content":"When Ahab saw Elijah, Ahab said to him, “Are you the one who is bringing disaster on Israel?” "}],[{"type":"prose","content":"Elijah said, “I have not brought disaster on Israel, but you and your father’s household , by abandoning (rejecting) the commandments of the LORD and by following the Baals. "}],[{"type":"prose","content":"Now then, send  and gather to me all Israel at Mount Carmel, together with the 450 prophets of Baal and the 400 prophets of [the goddess] Asherah, who eat at [Queen] Jezebel’s table.”"}],[{"type":"header","content":"God or Baal on Mount Carmel"},{"type":"prose","content":"So Ahab sent  to all the Israelites and assembled the [pagan] prophets together at Mount Carmel. "}],[{"type":"prose","content":"Elijah approached all the people and said, “How long will you hesitate between two opinions? If the LORD is God, follow Him; but if Baal, follow him.” But the people [of Israel] did not answer him [so much as] a word. "}],[{"type":"prose","content":"Then Elijah said to the people, “I alone remain a prophet of the LORD, while Baal’s prophets are 450 men. "}],[{"type":"prose","content":"Now let them give us two oxen, and let them choose one ox for themselves and cut it in pieces, and lay it on the wood, but put no fire . I will prepare the other ox and lay it on the wood, and I will not put a fire . "}],[{"type":"prose","content":"Then you call on the name of your god, and I will call on the name of the LORD; and the god who answers by fire, He is God.” And all the people answered, “It is well spoken.”"}],[{"type":"prose","content":"Elijah said to the prophets of Baal, “Choose one bull for yourselves and prepare it first, since there are many of you; and call on the name of your god, but put no fire .” "}],[{"type":"prose","content":"So they took the bull that was given to them and prepared it, and called on the name of Baal from morning until noon, saying, “O Baal, hear  answer us.” But there was no voice and no one answered. And they leaped about the altar which they had made. "}],[{"type":"prose","content":"At noon Elijah mocked them, saying, “Cry out with a loud voice, for he is a god; either he is occupied, or he is out [at the moment], or he is on a journey. Perhaps he is asleep and must be awakened!” "}],[{"type":"prose","content":"So they cried out with a loud voice [to get Baal’s attention] and cut themselves with swords and lances in accordance with their custom, until the blood flowed out on them. "}],[{"type":"prose","content":"As midday passed, they played the part of prophets  raved dramatically until the time for offering the  sacrifice; but there was no voice, no one answered, and no one paid attention."}],[{"type":"prose","content":"Then Elijah said to all the people, “Come near to me.” So all the people approached him. And he repaired  rebuilt the [old] altar of the LORD that had been torn down [by Jezebel]. "}],[{"type":"prose","content":"Then Elijah took twelve stones in accordance with the number of the tribes of the sons of Jacob, to whom the word of the LORD had come, saying, “Israel shall be your name.” "}],[{"type":"prose","content":"So with the stones Elijah built an altar in the name of the LORD. He made a trench around the altar large enough to hold two measures of seed. "}],[{"type":"prose","content":"Then he laid out the wood and cut the ox in pieces and laid it on the wood. "}],[{"type":"prose","content":"And he said, “Fill four pitchers with water and pour it on the burnt offering and the wood.” And he said, “Do it the second time.” And they did it the second time. And he said, “Do it the third time.” And they did it a third time. "}],[{"type":"prose","content":"The water flowed around the altar, and he also filled the trench with water."}],[{"type":"header","content":"Elijah’s Prayer"},{"type":"prose","content":"At the time of the offering of the  sacrifice, Elijah the prophet approached [the altar] and said, “O LORD, the God of Abraham, Isaac, and Israel (Jacob), let it be known today that You are God in Israel and that I am Your servant and that I have done all these things at Your word. "}],[{"type":"prose","content":"Answer me, O LORD, answer me, so that this people may know that You, O LORD, are God, and that You have turned their hearts back [to You].” "}],[{"type":"prose","content":"Then the fire of the LORD fell and consumed the burnt offering and the wood, and  the stones and the dust; it also licked up the water in the trench. "}],[{"type":"prose","content":"When all the people saw it, they fell face downward; and they said, “The LORD, He is God! The LORD, He is God!” "}],[{"type":"prose","content":"Then Elijah said to them, “Seize the prophets of Baal; do not let one of them escape.” They seized them; and Elijah brought them down to the brook Kishon, and [as God’s law required] killed them there."}],[{"type":"prose","content":"Now Elijah said to Ahab, “Go up, eat and drink, for there is the sound of the roar  of rain.” "}],[{"type":"prose","content":"So Ahab went up to eat and to drink. And Elijah went up to the top of Carmel; and he crouched down to the earth and put his face between his knees, "}],[{"type":"prose","content":"and he said to his servant, “Go up, look toward the sea.” So he went up and looked and said, “There is nothing.” Elijah said, “Go back” seven times. "}],[{"type":"prose","content":"And at the seventh  the servant said, “A cloud as small as a man’s hand is coming up from the sea.” And Elijah said, “Go up, say to Ahab, ‘Prepare  and go down, so that the rain shower does not stop you.’” "}],[{"type":"prose","content":"In a little while the sky grew dark with clouds and wind, and there were heavy showers. And Ahab mounted  rode [his chariot] and went [inland] to Jezreel. "}],[{"type":"prose","content":"Then the hand of the LORD came upon Elijah [giving him supernatural strength]. He girded up his loins and outran Ahab to the entrance of Jezreel [nearly twenty miles]."}]]