[{"num":1,"verse":"A long time passed. Then God’s word came to Elijah. The drought was now in its third year. The message: “Go and present yourself to Ahab; I’m about to make it rain on the country.” Elijah set out to present himself to Ahab. The drought in Samaria at the time was most severe."},{"num":3,"verse":"Ahab called for Obadiah, who was in charge of the palace. Obadiah feared God—he was very devout. Earlier, when Jezebel had tried to kill off all the prophets of God, Obadiah had hidden away a hundred of them in two caves, fifty in a cave, and then supplied them with food and water."},{"num":5,"verse":"Ahab ordered Obadiah, “Go through the country; locate every spring and every stream. Let’s see if we can find enough grass to keep our horses and mules from dying.” So they divided the country between them for the search—Ahab went one way, Obadiah the other."},{"num":7,"verse":"Obadiah went his way and suddenly there he was—Elijah! Obadiah fell on his knees, bowing in reverence, and exclaimed, “Is it really you—my master Elijah?”"},{"num":8,"verse":"“Yes,” said Elijah, “the real me. Now go and tell your boss, ‘I’ve seen Elijah.’”"},{"num":9,"verse":"Obadiah said, “But what have I done to deserve this? Ahab will kill me. As surely as your God lives, there isn’t a country or kingdom where my master hasn’t sent out search parties looking for you. And if they said, ‘We can’t find him; we’ve looked high and low,’ he would make that country or kingdom swear that you were not to be found. And now you’re telling me, ‘Go and tell your master Elijah’s found!’ The minute I leave you the Spirit of God will whisk you away to who knows where. Then when I report to Ahab, you’ll have disappeared and Ahab will kill me. And I’ve served God devoutly since I was a boy! Hasn’t anyone told you what I did when Jezebel was out to kill the prophets of God, how I risked my life by hiding a hundred of them, fifty to a cave, and made sure they got food and water? And now you’re telling me to draw attention to myself by announcing to my master, ‘Elijah’s been found.’ Why, he’ll kill me for sure.”"},{"num":15,"verse":"Elijah said, “As surely as God-of-the-Angel-Armies lives, and before whom I take my stand, I’ll meet with your master face-to-face this very day.”"},{"num":16,"verse":"So Obadiah went straight to Ahab and told him. And Ahab went out to meet Elijah."},{"num":17,"verse":"The moment Ahab saw Elijah he said, “So it’s you, old troublemaker!”"},{"num":20,"verse":"So Ahab summoned everyone in Israel, particularly the prophets, to Mount Carmel."},{"num":21,"verse":"Elijah challenged the people: “How long are you going to sit on the fence? If God is the real God, follow him; if it’s Baal, follow him. Make up your minds!”"},{"num":22,"verse":"Then Elijah said, “I’m the only prophet of God left in Israel; and there are 450 prophets of Baal. Let the Baal prophets bring up two oxen; let them pick one, butcher it, and lay it out on an altar on firewood—but don’t ignite it. I’ll take the other ox, cut it up, and lay it on the wood. But neither will I light the fire. Then you pray to your gods and I’ll pray to God. The god who answers with fire will prove to be, in fact, God.”"},{"num":25,"verse":"Elijah told the Baal prophets, “Choose your ox and prepare it. You go first, you’re the majority. Then pray to your god, but don’t light the fire.”"},{"num":26,"verse":"So they took the ox he had given them, prepared it for the altar, then prayed to Baal. They prayed all morning long, “O Baal, answer us!” But nothing happened—not so much as a whisper of breeze. Desperate, they jumped and stomped on the altar they had made."},{"num":27,"verse":"By noon, Elijah had started making fun of them, taunting, “Call a little louder—he is a god, after all. Maybe he’s off meditating somewhere or other, or maybe he’s gotten involved in a project, or maybe he’s on vacation. You don’t suppose he’s overslept, do you, and needs to be waked up?” They prayed louder and louder, cutting themselves with swords and knives—a ritual common to them—until they were covered with blood."},{"num":29,"verse":"This went on until well past noon. They used every religious trick and strategy they knew to make something happen on the altar, but nothing happened—not so much as a whisper, not a flicker of response."},{"num":30,"verse":"Then Elijah told the people, “Enough of that—it’s my turn. Gather around.” And they gathered. He then put the altar back together for by now it was in ruins. Elijah took twelve stones, one for each of the tribes of Jacob, the same Jacob to whom God had said, “From now on your name is Israel.” He built the stones into the altar in honor of God. Then Elijah dug a fairly wide trench around the altar. He laid firewood on the altar, cut up the ox, put it on the wood, and said, “Fill four buckets with water and drench both the ox and the firewood.” Then he said, “Do it again,” and they did it. Then he said, “Do it a third time,” and they did it a third time. The altar was drenched and the trench was filled with water."},{"num":36,"verse":"When it was time for the sacrifice to be offered, Elijah the prophet came up and prayed, “O God, God of Abraham, Isaac, and Israel, make it known right now that you are God in Israel, that I am your servant, and that I’m doing what I’m doing under your orders. Answer me, God; O answer me and reveal to this people that you are God, the true God, and that you are giving these people another chance at repentance.”"},{"num":38,"verse":"Immediately the fire of God fell and burned up the offering, the wood, the stones, the dirt, and even the water in the trench."},{"num":39,"verse":"All the people saw it happen and fell on their faces in awed worship, exclaiming, “God is the true God! God is the true God!”"},{"num":40,"verse":"Elijah told them, “Grab the Baal prophets! Don’t let one get away!”"},{"num":41,"verse":"Elijah said to Ahab, “Up on your feet! Eat and drink—celebrate! Rain is on the way; I hear it coming.”"},{"num":42,"verse":"Ahab did it: got up and ate and drank. Meanwhile, Elijah climbed to the top of Carmel, bowed deeply in prayer, his face between his knees. Then he said to his young servant, “On your feet now! Look toward the sea.”"},{"num":44,"verse":"And sure enough, the seventh time he said, “Oh yes, a cloud! But very small, no bigger than someone’s hand, rising out of the sea.”"},{"num":45,"verse":"Things happened fast. The sky grew black with wind-driven clouds, and then a huge cloudburst of rain, with Ahab hightailing it in his chariot for Jezreel. And God strengthened Elijah mightily. Pulling up his robe and tying it around his waist, Elijah ran in front of Ahab’s chariot until they reached Jezreel."}]