[[],[{"type":"header","content":"Obadiah Meets Elijah"},{"type":"prose","content":"Now it happened  many days that the word of the LORD came to Elijah in the third year, saying, “Go, present yourself to Ahab, and I will provide rain on the face of the earth.”"}],[{"type":"prose","content":"So Elijah went to present himself to Ahab. Now the famine  severe in Samaria."}],[{"type":"prose","content":"Ahab summoned Obadiah, who  in charge of the household. (Now Obadiah feared the LORD greatly;"}],[{"type":"prose","content":"for when Jezebel killed the prophets of the LORD, Obadiah took a hundred prophets and hid them by fifties in a cave, and provided them with bread and water.)"}],[{"type":"prose","content":"Then Ahab said to Obadiah, “Go through the land to all the springs of water and to all the river valleys; perhaps we will find grass and keep the horses and mules alive, and not  kill some of the cattle.”"}],[{"type":"prose","content":"So they divided the land between them to survey it; Ahab went one way by himself, and Obadiah went another way by himself."}],[{"type":"prose","content":"Now as Obadiah was on the way, behold, Elijah met him, and he recognized him and fell on his face and said, “Is it you, Elijah my master?”"}],[{"type":"prose","content":"And he said to him, “It is I. Go, say to your master, ‘Behold, Elijah .’”"}],[{"type":"prose","content":"But he said, “What sin have I committed, that you are handing your servant over to Ahab, to put me to death?"}],[{"type":"prose","content":"As  the LORD your God lives, there is no nation or kingdom to which my master has not sent  to search for you; and whenever they say, ‘He is not ,’ he makes the kingdom or nation swear that they could not find you."}],[{"type":"prose","content":"Yet now you are saying, ‘Go, say to your master, “Behold, Elijah !”’"}],[{"type":"prose","content":"And it will come about when I leave you that the Spirit of the LORD will carry you to where I do not know; so when I come and inform Ahab and he cannot find you, he will kill me, though , your servant, have feared the LORD from my youth."}],[{"type":"prose","content":"Has it not been reported to my master what I did when Jezebel killed the prophets of the LORD, that I hid a hundred prophets of the LORD by fifties in a cave, and provided them with bread and water?"}],[{"type":"prose","content":"Yet now you are saying, ‘Go, say to your master, “Behold, Elijah ”’; he will then kill me!”"}],[{"type":"prose","content":"Then Elijah said, “As  the LORD of armies lives, before whom I stand, I will certainly present myself to him today.”"}],[{"type":"prose","content":"So Obadiah went to meet Ahab and informed him; then Ahab went to meet Elijah."}],[{"type":"prose","content":"When Ahab saw Elijah, Ahab said to him, “Is this you, the cause of disaster to Israel?”"}],[{"type":"prose","content":"He said, “I have not brought disaster to Israel, but you and your father’s house , because you have abandoned the commandments of the LORD and you have followed the Baals."}],[{"type":"prose","content":"Now then, send  gather to me all Israel at Mount Carmel,  with 450 prophets of Baal and four hundred prophets of the Asherah, who eat at Jezebel’s table.”"}],[{"type":"header","content":"God or Baal on Mount Carmel"},{"type":"prose","content":"So Ahab sent  among all the sons of Israel and brought the prophets together at Mount Carmel."}],[{"type":"prose","content":"Then Elijah approached all the people and said, “How long are you going to struggle with the two choices? If the LORD is God, follow Him; but if Baal, follow him.” But the people did not answer him  a word."}],[{"type":"prose","content":"Then Elijah said to the people, “I alone am left as a prophet of the LORD, while Baal’s prophets are 450 men."}],[{"type":"prose","content":"Now have them give us two oxen; and have them choose the one ox for themselves and cut it up, and place it on the wood, but put no fire ; and I will prepare the other ox and lay it on the wood, and I will not put a fire ."}],[{"type":"prose","content":"Then you call on the name of your god, and I will call on the name of the LORD; and the God who answers by fire, He is God.” And all the people replied, “That is a good idea.”"}],[{"type":"prose","content":"So Elijah said to the prophets of Baal, “Choose the one ox for yourselves and prepare it first, since  many  you, and call on the name of your god, but put no fire .”"}],[{"type":"prose","content":"Then they took the ox which was given them and they prepared it, and they called on the name of Baal from morning until noon, saying, “O Baal, answer us!” But there was no voice and no one answered. And they limped about the altar which they had made."}],[{"type":"prose","content":"And at noon Elijah ridiculed them and said, “Call out with a loud voice, since he is a god; undoubtedly he is attending to business, or is on the way, or is on a journey. Perhaps he is asleep, and will awaken.”"}],[{"type":"prose","content":"So they cried out with a loud voice, and cut themselves according to their custom with swords and lances until blood gushed out on them."}],[{"type":"prose","content":"When midday was past, they raved until the time of the offering of the  sacrifice; but there was no voice, no one answered, and no one paid attention."}],[{"type":"prose","content":"Then Elijah said to all the people, “Come forward to me.” So all the people came forward to him. And he repaired the altar of the LORD which had been torn down."}],[{"type":"prose","content":"Then Elijah took twelve stones, corresponding to the number of the tribes of the sons of Jacob, to whom the word of the LORD had come, saying, “Israel shall be your name.”"}],[{"type":"prose","content":"And with the stones he built an altar in the name of the LORD; and he made a trench around the altar, large enough to hold two measures of seed."}],[{"type":"prose","content":"Then he laid out the wood, and he cut the ox in pieces and placed  on the wood."}],[{"type":"prose","content":"And he said, “Fill four large jars with water and pour  on the burnt offering and on the wood.” And he said, “Do it a second time,” so they did it a second time. Then he said, “Do it a third time,” so they did it a third time."}],[{"type":"prose","content":"The water flowed around the altar, and he also filled the trench with water."}],[{"type":"header","content":"Elijah’s Prayer"},{"type":"prose","content":"Then at the time of the offering of the  sacrifice, Elijah the prophet approached and said, “LORD, God of Abraham, Isaac, and Israel, today let it be known that You are God in Israel and that I am Your servant, and  I have done all these things at Your word."}],[{"type":"prose","content":"Answer me, LORD, answer me, so that this people may know that You, LORD, are God, and  You have turned their heart back.”"}],[{"type":"prose","content":"Then the fire of the LORD fell and consumed the burnt offering and the wood, and the stones and the dust; and it licked up the water that was in the trench."}],[{"type":"prose","content":"When all the people saw , they fell on their faces; and they said, “The LORD, He is God; the LORD, He is God!”"}],[{"type":"prose","content":"Then Elijah said to them, “Seize the prophets of Baal; do not let one of them escape.” So they seized them; and Elijah brought them down to the brook Kishon, and slaughtered them there."}],[{"type":"prose","content":"Now Elijah said to Ahab, “Go up, eat and drink; for there is the sound of the roar of a  shower.”"}],[{"type":"prose","content":"So Ahab went up to eat and drink. But Elijah went up to the top of Carmel; and he bent down to the earth and put his face between his knees."}],[{"type":"prose","content":"And he said to his servant, “Go up now, look toward the sea.” So he went up and looked, but he said, “There is nothing.” Yet  said, “Go back” seven times."}],[{"type":"prose","content":"And  the seventh , he said, “Behold, a cloud as small as a person’s hand is coming up from the sea.” And  said, “Go up, say to Ahab, ‘Harness  and go down, so that the  shower does not stop you.’”"}],[{"type":"prose","content":"Meanwhile the sky became dark with clouds and wind , and there was a heavy shower. And Ahab rode and went to Jezreel."}],[{"type":"prose","content":"Then the hand of the LORD was on Elijah, and he belted  around his waist and outran Ahab to Jezreel."}]]