[{"header":"Law of Cleansing a Leper"},{"num":14,"verse":"Then the Lord spoke to Moses, saying, "},{"num":2,"verse":"“This shall be the law of the leper on the day of his [ceremonial] cleansing. He shall be brought to the priest [at a meeting place outside the camp]; "},{"num":3,"verse":"the priest shall go out of the camp [to meet him]; and the priest shall examine him, and if the leper has been healed of the infection of leprosy, "},{"num":4,"verse":"then the priest shall give orders to take two live clean birds and cedar wood and scarlet string and hyssop for the one to be cleansed. "},{"num":5,"verse":"Next the priest shall order that one of the birds be killed [as a sacrifice] in an earthenware container over [fresh] running water. "},{"num":6,"verse":"As for the live bird, he shall take it together with the cedar wood and the scarlet string and the hyssop, and shall dip them and the live bird in the blood of the bird sacrificed over the running water. "},{"num":7,"verse":"He shall sprinkle [the blood] seven times on the one to be cleansed from the leprosy and shall pronounce him [ceremonially] clean. Then he shall let the live bird go free over the open field. "},{"num":8,"verse":"The one to be cleansed shall wash his clothes, shave off all his hair, and bathe in water; and he shall be clean. After that he may come into the camp, but he shall stay outside of his tent for seven days. "},{"num":9,"verse":"On the seventh day he shall shave off all his hair: he shall shave his head and his beard and his eyebrows, even all his hair [on his body]. Then he shall wash his clothes and bathe his body in water, and be clean."},{"num":10,"verse":"“Now on the eighth day he shall take two male lambs without blemish, and a yearling ewe lamb without blemish, and three-tenths of an ephah of fine flour mixed with [olive] oil as a grain offering, and one log (about a pint) of oil; "},{"num":11,"verse":"and the priest who cleanses him shall present the man to be cleansed and his offerings before the Lord at the doorway of the Tent of Meeting. "},{"num":12,"verse":"Then the priest shall take one of the male lambs and offer it as a guilt offering, with the log of oil, and present them as a wave offering before the Lord. "},{"num":13,"verse":"He shall kill the male lamb in the place where they kill the sin offering and the burnt offering, in the sacred place [the courtyard of the tabernacle]; for the guilt offering, like the sin offering, belongs to the priest; it is most holy. "},{"num":14,"verse":"The priest shall take some of the blood of the guilt offering and put it on the lobe of the right ear of the one to be cleansed, and on the thumb of his right hand, and on the big toe of his right foot. "},{"num":15,"verse":"The priest shall also take some of the log of oil, and pour it into the palm of his own left hand; "},{"num":16,"verse":"and the priest shall dip his right finger in the oil that is in his left palm, and with his finger sprinkle some of the oil seven times before the Lord. "},{"num":17,"verse":"Of the rest of the oil which is in his palm, the priest shall put some on the lobe of the right ear of the one to be cleansed, and on the thumb of his right hand, and on the big toe of his right foot, on top of the blood of the guilt offering. "},{"num":18,"verse":"The remaining oil that is in the priest’s palm shall be put on the head of the one to be cleansed. The priest shall make atonement for him before the Lord. "},{"num":19,"verse":"Next the priest shall offer the sin offering and make atonement for the one to be cleansed from his uncleanness, and afterward kill the burnt offering. "},{"num":20,"verse":"The priest shall offer the burnt offering and the grain offering on the altar; and the priest shall make atonement for him, and he shall be clean."},{"num":21,"verse":"“But if the cleansed leper is poor and his means are insufficient, then he is to take one lamb as a guilt offering to be waved to make atonement for him, and one tenth of an ephah of fine flour mixed with oil as a grain offering, and a log of oil, "},{"num":22,"verse":"and two turtledoves or two young pigeons, such as he can afford, one shall be a sin offering, the other a burnt offering. "},{"num":23,"verse":"He shall bring them on the eighth day for his [ceremonial] cleansing to the priest at the doorway of the Tent of Meeting, before the Lord. "},{"num":24,"verse":"The priest shall take the lamb of the guilt offering, and the log of oil, and shall present them as a wave offering before the Lord. "},{"num":25,"verse":"Next he shall kill the lamb of the guilt offering; and the priest is to take some of the blood of the guilt offering and put it on the lobe of the right ear of the one to be cleansed, and on the thumb of his right hand, and on the big toe of his right foot. "},{"num":26,"verse":"The priest shall pour some of the oil into his left palm, "},{"num":27,"verse":"and with his right finger the priest shall sprinkle some of the oil that is in his left palm seven times before the Lord. "},{"num":28,"verse":"The priest shall put some of the oil in his palm on the lobe of the right ear of the one to be cleansed, and on the thumb of his right hand, and on the big toe of his right foot, on the places where he has put the blood of the guilt offering. "},{"num":29,"verse":"The rest of the oil that is in the priest’s palm shall be put on the head of the one to be cleansed, to make atonement for him before the Lord. "},{"num":30,"verse":"Then he shall offer one of the turtledoves or young pigeons, which are within his means. "},{"num":31,"verse":"He shall offer what he can afford, one as a sin offering and the other as a burnt offering, together with the grain offering. The priest shall make atonement before the Lord on behalf of the one to be cleansed. "},{"num":32,"verse":"This is the law for the one in whom there is an infection of leprosy, whose means are limited for his [ceremonial] cleansing.”"},{"header":"Cleansing an Infected House"},{"num":33,"verse":"The Lord further spoke to Moses and Aaron, saying,"},{"num":34,"verse":"“When you come into the land of Canaan, which I am giving you as a possession, and I put a mark of leprosy on a house in your land, "},{"num":35,"verse":"then the one who owns the house shall come and tell the priest, ‘I have seen something that looks like a mark of leprosy in my house.’ "},{"num":36,"verse":"The priest shall order that they empty the house before he goes in to examine the mark, so that everything in the house will not have to be declared unclean; afterward he shall go in to see the house. "},{"num":37,"verse":"He shall examine the mark, and if the mark on the walls of the house has greenish or reddish depressions and appears deeper than the surface, "},{"num":38,"verse":"the priest shall go out of the house, to the doorway, and quarantine the house for seven days. "},{"num":39,"verse":"The priest shall return on the seventh day and look; and if the mark has spread on the walls of the house, "},{"num":40,"verse":"he shall order them to tear out the contaminated stones and throw them into an unclean place outside the city. "},{"num":41,"verse":"He shall have the entire inside area of the house scraped, and the plaster that is scraped off shall be dumped in an unclean place outside the city. "},{"num":42,"verse":"Then they shall take new stones and replace the [contaminated] stones, and he shall take plaster and replaster the house."},{"num":43,"verse":"“If, however, the mark breaks out again in the house after he has removed the stones and has scraped and replastered the house, "},{"num":44,"verse":"then the priest shall come and look again, and if the mark has spread in the house, it is a malignant leprosy in the house; it is [ceremonially] unclean. "},{"num":45,"verse":"He shall tear down the house—its stones and its timber and all the plaster of the house—and shall take everything outside the city to an unclean place. "},{"num":46,"verse":"Moreover, whoever goes into the house during the time that it is quarantined becomes unclean until evening. "},{"num":47,"verse":"And whoever lies down in the house [to rest] shall wash his clothes, and whoever eats in the house shall wash his clothes."},{"num":48,"verse":"“But if the priest comes in and inspects it and the mark has not spread in the house after the house has been replastered, he shall pronounce the house clean because the mark has not reappeared. "},{"num":49,"verse":"To cleanse the house then, he shall take two birds and cedar wood and scarlet string and hyssop; "},{"num":50,"verse":"and he shall kill one of the birds in an earthenware container over running water, "},{"num":51,"verse":"and he shall take the cedar wood and the hyssop and the scarlet string, and the living bird, and dip them in the blood of the slain bird as well as in the running water, and sprinkle the house seven times. "},{"num":52,"verse":"So he shall cleanse the house with the blood of the bird and with the running water, along with the live bird and the cedar wood and the hyssop and the scarlet string. "},{"num":53,"verse":"But he shall let the live bird go free outside the city into the open field. So he shall make atonement for the house, and it will be clean.”"},{"num":54,"verse":"This is the law for any mark of leprosy—even for a scale, "},{"num":55,"verse":"and for the leprous garment or house, "},{"num":56,"verse":"and for a swelling, and for a scab, and for a bright spot on the skin— "},{"num":57,"verse":"to teach when they are unclean and when they are clean. This is the law of leprosy [in regard to both persons and property]."}]