[{"num":14,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":2,"verse":"This shall be the law of the leper in the day of his cleansing: He shall be brought unto the priest."},{"num":3,"verse":"And the priest shall go forth out of the camp; and the priest shall look and seeing that the plague of leprosy is healed in the leper,"},{"num":4,"verse":"the priest shall command to take for the one that is to be purified two birds, alive and clean, and cedar wood and scarlet and hyssop;"},{"num":5,"verse":"and the priest shall command that one of the birds be killed in an earthen vessel upon living water;"},{"num":6,"verse":"then he shall take the living bird and the cedar wood, and the scarlet and the hyssop and shall dip them and the living bird in the blood of the bird that was killed over the living water;"},{"num":7,"verse":"and he shall sprinkle upon the one that is to be purified from the leprosy seven times and shall pronounce him clean and shall let the living bird loose into the open field."},{"num":8,"verse":"And he that is to be purified shall wash his clothes and shave off all his hair and wash himself with water, and he shall be clean; and after that he shall come into the camp and shall dwell outside of his tent seven days."},{"num":9,"verse":"But it shall be that on the seventh day he shall shave all his hair off his head and his beard and his eyebrows; finally he shall shave off all his hair, and he shall wash his clothes; also he shall wash his flesh in water, and he shall be clean."},{"num":10,"verse":"¶ And on the eighth day he shall take two he lambs without blemish and one ewe lamb of the first year without blemish and three tenth deals of fine flour for a present, mingled with oil, and one log of oil."},{"num":11,"verse":"And the priest that purifies him shall present the one that is to be made clean with those things, before the LORD at the door of the tabernacle of the testimony;"},{"num":12,"verse":"and the priest shall take one he lamb and offer him for expiation of the guilt, with the log of oil, and wave them for a waved offering before the LORD."},{"num":13,"verse":"And he shall slay the lamb in the place where they kill the sin and the burnt offering, in the place of the sanctuary, for that offered as sin is the priest’s, together with that offered as guilt; it is most holy."},{"num":14,"verse":"And the priest shall take some of the blood of the expiation for the guilt, and the priest shall put it upon the tip of the right ear of the one that is to be purified and upon the thumb of his right hand and upon the great toe of his right foot."},{"num":15,"verse":"Likewise the priest shall take some of the log of oil, and pour it into the palm of his own left hand;"},{"num":16,"verse":"and the priest shall dip his right finger in the oil that is in his left hand and shall sprinkle of the oil with his finger seven times before the LORD."},{"num":17,"verse":"And of that which is left of the oil that is in his hand shall the priest put upon the tip of the right ear of the one that is to be purified and upon the thumb of his right hand and upon the great toe of his right foot, upon the blood of the expiation for the guilt;"},{"num":18,"verse":"and that which is left of the oil that is in the priest’s hand, he shall pour upon the head of the one that is to be purified; and thus shall the priest reconcile him before the LORD."},{"num":19,"verse":"And the priest shall offer the sin and reconcile the one that is to be purified from his uncleanness; and afterward he shall kill the burnt offering."},{"num":20,"verse":"And the priest shall cause the burnt offering and the present to be lifted upon the altar, and thus shall the priest reconcile him, and he shall be clean."},{"num":21,"verse":"¶ But if he is poor, and cannot get so much; then he shall take one lamb for expiation of the guilt to be waved, to reconcile himself, and one tenth deal of fine flour mingled with oil for a present, and a log of oil;"},{"num":22,"verse":"and two turtledoves, or two young pigeons, such as he is able to get; and the one shall be as the sin, and the other as a burnt offering."},{"num":23,"verse":"And he shall bring these things on the eighth day of his purification unto the priest, unto the door of the tabernacle of the testimony, before the LORD."},{"num":24,"verse":"And the priest shall take the lamb of the expiation of the guilt, and the log of oil, and the priest shall wave them for a waved offering before the LORD;"},{"num":25,"verse":"then he shall kill the lamb of the expiation of the guilt, and the priest shall take some of the blood of the expiation of the guilt and put it upon the tip of the right ear of the one that is to be purified and upon the thumb of his right hand and upon the great toe of his right foot."},{"num":26,"verse":"And the priest shall pour of the oil into the palm of his own left hand,"},{"num":27,"verse":"and the priest shall sprinkle with his right finger some of the oil that is in his left hand seven times before the LORD."},{"num":28,"verse":"The priest shall also put of the oil that is in his hand upon the tip of the right ear of the one that is to be purified and upon the thumb of his right hand and upon the great toe of his right foot in the place of the blood of the expiation for the guilt."},{"num":29,"verse":"And what is left of the oil that is in the priest’s hand he shall put upon the head of the one that is to be purified, to reconcile him before the LORD."},{"num":30,"verse":"Likewise he shall offer one of the turtledoves or of the young pigeons, such as he can get,"},{"num":31,"verse":"one of such as he is able to get as sin, and the other for a burnt offering, with the present; and thus shall the priest reconcile the one that is to be purified before the LORD."},{"num":32,"verse":"This is the law of the one who has had the plague of leprosy, whose hand is not able to get that which is prescribed for his purification."},{"num":33,"verse":"¶ And the LORD spoke unto Moses and unto Aaron, saying,"},{"num":34,"verse":"When ye are entered into the land of Canaan, which I give to you in possession, and I put the plague of leprosy in a house of the land of your possession,"},{"num":35,"verse":"the one that owns the house shall come and tell the priest, saying, Something like unto a plague has appeared in my house."},{"num":36,"verse":"Then the priest shall command that they empty the house before the priest goes into it to see the plague so that all that is in the house is not contaminated; and afterward the priest shall go in to recognize the house."},{"num":37,"verse":"And he shall look on the plague, and if the plague is seen in the walls of the house with hollow streaks, greenish or reddish, which appear to be lower than the wall,"},{"num":38,"verse":"the priest shall go out of the house to the door of the house and shut up the house seven days."},{"num":39,"verse":"And the priest shall come again the seventh day and shall look; and if the plague has spread in the walls of the house,"},{"num":40,"verse":"then the priest shall command that they remove the stones in which the plague is, and they shall cast them outside the city into an unclean place;"},{"num":41,"verse":"And he shall cause the house to be scraped within round about, and they shall pour out the dust that they scrape off outside the city into an unclean place;"},{"num":42,"verse":"and they shall take other stones and put them in the place of the stones that were removed; and he shall take other mortar and shall plaster the house."},{"num":43,"verse":"And if the plague comes again and breaks out in the house after he has taken away the stones and after he has scraped the house and after it is plastered,"},{"num":44,"verse":"then the priest shall come in and look; and if the plague appears to have spread in the house, it is a fretting leprosy in the house; it is unclean."},{"num":45,"verse":"Then he shall break down the house, its stones, and its timbers, and all the mortar of the house; and he shall carry them forth out of the city into an unclean place."},{"num":46,"verse":"Moreover he that enters into the house all the while that it is shut up shall be unclean until the evening."},{"num":47,"verse":"And he that sleeps in the house shall wash his clothes, and he that eats in the house shall wash his clothes."},{"num":48,"verse":"But if the priest shall come in and look upon it, and see that the plague has not spread in the house after the house was plastered, then the priest shall pronounce the house clean because the plague is healed."},{"num":49,"verse":"Then to remove the sin from the house he shall take two birds and cedar wood and scarlet and hyssop,"},{"num":50,"verse":"and he shall kill the one of the birds in an earthen vessel over living water,"},{"num":51,"verse":"and he shall take the cedar wood and the hyssop and the scarlet and the living bird and dip them all in the blood of the slain bird and in the living water and sprinkle the house seven times."},{"num":52,"verse":"And he shall remove the sin from the house with the blood of the bird and with the living water and with the living bird and with the cedar wood and with the hyssop and with the scarlet."},{"num":53,"verse":"Then he shall let go the living bird out of the city into the open fields; and thus shall he reconcile the house, and it shall be clean."},{"num":54,"verse":"¶ This is the law for all manner of plague of leprosy and scall"},{"num":55,"verse":"and for the leprosy of a garment and of a house"},{"num":56,"verse":"and for a rising and for a scab and for a bright spot,"},{"num":57,"verse":"to teach when it is unclean and when it is clean: this is the law of leprosy."}]