[{"header":"Making People “Clean” From Skin Diseases"},{"num":14,"verse":"The Lord spoke to Moses. He told him to say to the people, "},{"num":2,"verse":"“Here are the rules for making anyone ‘clean’ who has had a skin disease. They apply when the person is brought to the priest. "},{"num":3,"verse":"The priest must go outside the camp. He must look the person over carefully. Suppose they have been healed of their skin disease. "},{"num":4,"verse":"Then the priest will order someone to bring him two live ‘clean’ birds. He will also order someone to bring him some cedar wood, bright red yarn and branches of a hyssop plant. All these things will be used to make the person ‘clean.’ "},{"num":5,"verse":"The priest will order someone to kill one of the birds. It must be killed over fresh water in a clay pot. "},{"num":6,"verse":"Then the priest must take the live bird. He must dip it into the blood of the bird killed over the fresh water. He must dip it into the blood together with the cedar wood, the bright red yarn and the hyssop plant. "},{"num":7,"verse":"The priest will sprinkle the blood on the person who had the skin disease. That will make them ‘clean.’ The priest must sprinkle them seven times. Then the priest must announce that they are ‘clean.’ After that, the priest must let the live bird go free in the open fields."},{"num":8,"verse":"“The person must also wash their clothes to be made ‘clean.’ They must shave off all their hair. They must take a bath. Then they will be ‘clean.’ After that, they may come into the camp. But they must stay outside their tent for seven days. "},{"num":9,"verse":"On the seventh day they must shave off all their hair. They must shave their head. They must shave off their beard. They must also shave off their eyebrows and the rest of their hair. They must wash their clothes. They must take a bath. Then they will be ‘clean.’"},{"num":10,"verse":"“On the eighth day they must bring two male lambs and one female lamb as an offering. The female must be a year old. The lambs must not have any flaws. They must also bring 11 pounds of the finest flour as a grain offering. They must mix it with olive oil. They must also bring 11 ounces of oil. "},{"num":11,"verse":"The priest who announces that the person is ‘clean’ must bring them and their offerings to me. He must do it at the entrance to the tent of meeting."},{"num":12,"verse":"“Then the priest must take one of the male lambs. He must offer it as a guilt offering. He must offer it along with 11 ounces of oil. He must lift all of it up and wave it in front of me as a wave offering. "},{"num":13,"verse":"He must kill the lamb in the holy area where sin offerings and burnt offerings are killed. The guilt offering belongs to the priest, just as the sin offering does. The guilt offering is very holy. "},{"num":14,"verse":"The priest must take some of the blood from the guilt offering and put it on the person’s right earlobe. He must put some on the thumb of their right hand. He must also put some on the big toe of their right foot. "},{"num":15,"verse":"Then the priest must take some of the oil and pour it into his own left hand. "},{"num":16,"verse":"He must dip his right forefinger into the oil in his hand. He must use his finger to sprinkle some of the oil in front of me seven times. "},{"num":17,"verse":"The priest must put some of the oil in his hand on the same places he put the blood of the guilt offering. He must put some on the person’s right earlobe. He must put some on the thumb of their right hand. He must put some on the big toe of their right foot. "},{"num":18,"verse":"He must put on their head the rest of the oil in his hand. It will pay for the person’s sin in my sight."},{"num":19,"verse":"“Then the priest must sacrifice the sin offering. It will pay for the person’s sin. They will be made ‘clean’ after being ‘unclean.’ After that, the priest will kill the burnt offering. "},{"num":20,"verse":"He will offer it on the altar. He will offer it together with the grain offering. It will pay for the person’s sin. Then they will be ‘clean.’"},{"num":21,"verse":"“But suppose they are poor. Suppose they can’t afford all these offerings. Then they must bring one male lamb as a guilt offering. It must be lifted up and waved in front of me to pay for their sin. They must also bring three and a half pounds of the finest flour along with the lamb. They must mix the flour with olive oil. It is a grain offering. They must offer it along with 11 ounces of oil. "},{"num":22,"verse":"They must also bring two doves or two young pigeons that they can afford. One is for a sin offering. The other is for a burnt offering."},{"num":23,"verse":"“On the eighth day they must bring them to the priest so they can be made ‘clean.’ They must bring them to the entrance to the tent of meeting. They must do it in my sight. "},{"num":24,"verse":"The priest must take the lamb for the guilt offering. He must take it together with the 11 ounces of oil. He must lift all of it up and wave it in front of me as a wave offering. "},{"num":25,"verse":"He must kill the lamb for the guilt offering. He must take some of its blood and put it on the person’s right earlobe. He must put some on the thumb of their right hand. He must also put some on the big toe of their right foot. "},{"num":26,"verse":"The priest must pour some of the oil into his own left hand. "},{"num":27,"verse":"He must dip his right forefinger into the oil in his hand. He must use his finger to sprinkle some of it seven times in front of me. "},{"num":28,"verse":"Here is what he must do with some of the oil in his hand. He must put it on the same places where he put the blood of the guilt offering. He must put some on the person’s right earlobe. He must put some on the thumb of their right hand. He must also put some on the big toe of their right foot. "},{"num":29,"verse":"He must put on their head the rest of the oil in his hand. It will pay for the person’s sin in my sight. "},{"num":30,"verse":"The priest will sacrifice the doves or the young pigeons that the person can afford. "},{"num":31,"verse":"One is for a sin offering. The other is for a burnt offering. The priest must offer them together with the grain offering. In that way he will pay for the person’s sin in my sight. He will do it to make them ‘clean.’ ”"},{"num":32,"verse":"These are the rules for anyone who has a skin disease. They are for people who can’t afford the regular offerings that are required to make them “clean.”"},{"header":"Making Things “Clean” From Mold"},{"num":33,"verse":"The Lord spoke to Moses and Aaron. He told them to say to the people, "},{"num":34,"verse":"“You will enter the land of Canaan. I am giving it to you as your own. When you enter it, suppose I put mold in one of your houses. And suppose the mold spreads. "},{"num":35,"verse":"Then the owner of that house must go and speak to the priest. He must say, ‘I’ve seen something that looks like mold in my house.’ "},{"num":36,"verse":"The priest must order everything to be taken out of the house. It must be done before he goes in to look carefully at the mold. If it is not done, the priest must announce that everything in the house is ‘unclean.’ After the house is empty the priest must go in and check it. "},{"num":37,"verse":"He must look carefully at the mold on the walls. Suppose it looks as if it has green or red dents in it. And suppose the dents look as if they are behind the surface of the wall. "},{"num":38,"verse":"Then the priest must go out the door. He must close the house up for seven days. "},{"num":39,"verse":"On the seventh day the priest will return to check the house. Suppose the mold on the walls has spread. "},{"num":40,"verse":"Then he must order someone to tear out the stones that have mold on them. He must have them thrown into an ‘unclean’ place outside the town. "},{"num":41,"verse":"He must have all the inside walls of the house scraped. Everything scraped off must be dumped into an ‘unclean’ place outside the town. "},{"num":42,"verse":"Then other stones must be put in the place of the stones that had mold on them. The inside walls of the house must be coated with new clay."},{"num":43,"verse":"“Suppose the stones have been torn out. The house has been scraped. And the walls have been coated with new clay. But the mold appears again. "},{"num":44,"verse":"Then the priest must go and look things over carefully. Suppose the mold has spread in the house. Then it is the kind of mold that destroys things. The house is not ‘clean.’ "},{"num":45,"verse":"It must be torn down. The stones, the wood and all the clay coating must be torn out. All of it must be taken out of the town to an ‘unclean’ place."},{"num":46,"verse":"“Suppose someone goes into the house while it is closed up. Then they will be ‘unclean’ until evening. "},{"num":47,"verse":"If they sleep or eat in the house, they must wash their clothes."},{"num":48,"verse":"“But suppose the priest comes to look things over carefully. And suppose the mold has not spread after the walls had been coated with new clay. Then he will announce that the house is ‘clean.’ The mold is gone. "},{"num":49,"verse":"To make the house pure, the priest must get two birds. He must also get some cedar wood, bright red yarn and branches of a hyssop plant. "},{"num":50,"verse":"He must kill one of the birds over fresh water in a clay pot. "},{"num":51,"verse":"Then he must take the cedar wood, the hyssop plant, the bright red yarn and the live bird. He must dip all of them into the blood of the dead bird. He must also dip them into the fresh water. He must sprinkle the house seven times. "},{"num":52,"verse":"The priest will use the blood and the water to make the house pure. He will use the live bird to make it pure. He will also use the cedar wood, the hyssop plant and the bright red yarn to make it pure. "},{"num":53,"verse":"Then he must let the live bird go free in the open fields outside the town. In that way he will make the house pure. It will be ‘clean.’ ”"},{"num":54,"verse":"These are the rules for skin diseases. They apply to sores. "},{"num":55,"verse":"They apply to mold in clothes or in houses. "},{"num":56,"verse":"They also apply to swellings, rashes or shiny red spots on the skin. "},{"num":57,"verse":"Use these rules to decide whether something is “clean” or not."}]