[{"header":"Ezra Journeys from Babylon to Jerusalem"},{"num":7,"verse":"Now after this, in the reign of Artaxerxes I [son of Ahasuerus (Xerxes)] king of Persia, Ezra the son (descendant) of Seraiah, the son of Azariah, the son of Hilkiah, "},{"num":2,"verse":"the son of Shallum, the son of Zadok, the son of Ahitub, "},{"num":3,"verse":"the son of Amariah, the son of Azariah, the son of Meraioth, "},{"num":4,"verse":"the son of Zerahiah, the son of Uzzi, the son of Bukki, "},{"num":5,"verse":"the son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron the chief priest— "},{"num":6,"verse":"this Ezra went up from Babylon. He was a scribe skilled in the Law (the five books) of Moses, which the Lord God of Israel had given; and the king granted him everything that he asked, for the hand of the Lord his God was on him. "},{"num":7,"verse":"Some of the sons of Israel, with some of the priests and Levites, the singers and gatekeepers, and the temple servants also went up [from Babylon] to Jerusalem in the seventh year of King Artaxerxes."},{"num":8,"verse":"Ezra came to Jerusalem in the fifth month of the seventh year of the king. "},{"num":9,"verse":"For on the first of the first month he started out from Babylon, and on the first of the fifth month he arrived in Jerusalem, because the good hand of his God was on him. "},{"num":10,"verse":"For Ezra had set his heart (resolved) to study and interpret the Law of the Lord, and to practice it and teach His statutes and ordinances in Israel."},{"header":"King’s Decree on Behalf of Ezra"},{"num":11,"verse":"Now this is a copy of the decree that King Artaxerxes gave to Ezra the priest, the scribe [who was] learned in the words of the commandments of the Lord and of His statutes to Israel: "},{"num":12,"verse":"“Artaxerxes, king of kings, to Ezra the priest, the scribe of the Law of the God of heaven, perfect peace (greetings). And now "},{"num":13,"verse":"I have issued a decree that all of the people of Israel and their priests and the Levites in my kingdom who are willing to go to Jerusalem, may go with you. "},{"num":14,"verse":"For you are sent by the king and his seven advisers to inquire about Judah and Jerusalem in accordance with the Law of your God, which is in your hand, "},{"num":15,"verse":"and to bring [with you] the silver and gold which the king and his advisers have freely offered to the God of Israel, whose dwelling is in Jerusalem, "},{"num":16,"verse":"and all the silver and gold which you find in the whole province of Babylon, along with the freewill offering of the people and of the priests for the house of their God in Jerusalem. "},{"num":17,"verse":"Therefore with this money, you shall diligently buy bulls, rams, and lambs, with their grain offerings and drink offerings, and offer them on the altar of the house of your God which is in Jerusalem. "},{"num":18,"verse":"And whatever seems good to you and to your brothers to do with the rest of the silver and the gold, you may do in accordance with the will of your God. "},{"num":19,"verse":"As for the utensils which are given to you for the service of the house of your God, deliver [those] in full before the God of Jerusalem. "},{"num":20,"verse":"The rest of the things required for the house of your God, which you may have occasion to provide, provide it from the royal treasury."},{"num":21,"verse":"“And I, Artaxerxes the king, issue a decree to all the treasurers in the provinces west of the [Euphrates] River, that whatever Ezra the priest, the scribe of the Law of the God of heaven, may require of you, it shall be done diligently and at once— "},{"num":22,"verse":"even up to 100 talents of silver, 100 kors (measures) of wheat, 100 baths of wine, 100 baths of [olive] oil, and salt as needed. "},{"num":23,"verse":"Whatever is commanded by the God of heaven, let it be done diligently and with enthusiasm for the house of the God of heaven, so that there will not be wrath against the kingdom of the king and his sons. "},{"num":24,"verse":"We also inform you that it is not authorized to impose tax, tribute, or toll on any of the priests, Levites, singers, doorkeepers, temple servants or other servants of this house of God."},{"num":25,"verse":"“You, Ezra, are to appoint magistrates and judges in accordance with the wisdom and instruction of your God which is in your hand, so that they may judge all the people who are in the province west of the [Euphrates] River; appoint those who know the laws of your God; and you may teach anyone who does not know them. "},{"num":26,"verse":"Whoever does not observe and practice the law of your God and the law of the king, let judgment be executed upon him strictly and promptly, whether it be for death or banishment or confiscation of property or imprisonment.”"},{"header":"The King’s Kindness"},{"num":27,"verse":"Blessed be the Lord, the God of our fathers [said Ezra], who put such a thing as this in the king’s heart, to adorn and glorify the house of the Lord in Jerusalem, "},{"num":28,"verse":"and has extended His mercy and lovingkindness to me before the king, his advisers, and all the king’s mighty officials. I was strengthened and encouraged, for the hand of the Lord my God was upon me, and I gathered together outstanding men of Israel to go up with me [to Jerusalem]."}]