[{"header":"Ezra Arrives in Jerusalem"},{"num":7,"verse":"Many years later, when Artaxerxes was emperor of Persia, there was a man named Ezra. He traced his ancestors back to Aaron, the High Priest, as follows: Ezra was the son of Seraiah, son of Azariah, son of Hilkiah, "},{"num":2,"verse":"son of Shallum, son of Zadok, son of Ahitub, "},{"num":3,"verse":"son of Amariah, son of Azariah, son of Meraioth, "},{"num":4,"verse":"son of Zerahiah, son of Uzzi, son of Bukki, "},{"num":5,"verse":"son of Abishua, son of Phinehas, son of Eleazar, son of Aaron."},{"num":6,"verse":"Ezra was a scholar with a thorough knowledge of the Law which the Lord, the God of Israel, had given to Moses. Because Ezra had the blessing of the Lord his God, the emperor gave him everything he asked for. In the seventh year of the reign of Artaxerxes, Ezra set out from Babylonia for Jerusalem with a group of Israelites which included priests, Levites, Temple musicians, Temple guards, and workers. "},{"num":8,"verse":"They left Babylonia on the first day of the first month, and with God's help they arrived in Jerusalem on the first day of the fifth month. "},{"num":10,"verse":"Ezra had devoted his life to studying the Law of the Lord, to practicing it, and to teaching all its laws and regulations to the people of Israel."},{"header":"The Document Which Emperor Artaxerxes Gave to Ezra"},{"num":11,"verse":"Emperor Artaxerxes gave the following document to Ezra, the priest and scholar, who had a thorough knowledge of the laws and commands which the Lord had given to Israel:"},{"header":"Ezra Praises God"},{"num":27,"verse":"Ezra said, “Praise the Lord, the God of our ancestors! He has made the emperor willing to honor in this way the Temple of the Lord in Jerusalem. "},{"num":28,"verse":"By God's grace I have won the favor of the emperor, of his counselors, and of all his powerful officials; the Lord my God has given me courage, and I have been able to persuade many of the heads of the clans of Israel to return with me.”"}]