[{"header":"The Arrival of Ezra"},{"num":7,"verse":"Now after these things, in the reign of Artaxerxes king of Persia, Ezra the son of Seraiah, the son of Azariah, the son of Hilkiah, "},{"num":2,"verse":"the son of Shallum, the son of Zadok, the son of Ahitub, "},{"num":3,"verse":"the son of Amariah, the son of Azariah, the son of Meraioth, "},{"num":4,"verse":"the son of Zerahiah, the son of Uzzi, the son of Bukki, "},{"num":5,"verse":"the son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron the high priest— "},{"num":6,"verse":"this Ezra went up from Babylon. He was a scribe skilled in the Law of Moses, given by the Lord God of Israel. Because the hand of the Lord his God was upon him, the king granted him all his requests. "},{"num":7,"verse":"Some of the children of Israel, along with some of the priests, and the Levites, the singers, the porters, and the temple servants, went up to Jerusalem in the seventh year of King Artaxerxes."},{"num":8,"verse":"Ezra arrived at Jerusalem in the fifth month, during the king’s seventh year. "},{"num":9,"verse":"From the first day of the first month when the journey from Babylon began, until the first day of the fifth month when he arrived at Jerusalem, the good hand of his God was upon him. "},{"num":10,"verse":"Because Ezra had prepared his heart to seek the Law of the Lord, he was doing so and teaching the statutes and judgments in Israel."},{"header":"The Letter of Artaxerxes to Ezra"},{"num":11,"verse":"Now this is the copy of the letter that King Artaxerxes gave to Ezra the priest, who was likewise the scribe, the one responsible for the words of the commandments of the Lord and His statutes to Israel:"},{"num":12,"verse":"“Artaxerxes, king of kings,"},{"num":13,"verse":"“I have issued a decree that all the people of Israel, and their priests, and the Levites in my realm, who are inclined to go up to Jerusalem, may go with you. "},{"num":14,"verse":"For you are sent by the king and his seven counselors to inquire concerning Judah and Jerusalem in accordance with the Law of your God which is in your hand, "},{"num":15,"verse":"and to carry the silver and gold, which the king and his counselors have freely offered to the God of Israel, whose habitation is in Jerusalem, "},{"num":16,"verse":"along with all the silver and gold that you can find in all the province of Babylon, plus the freewill offering of the people and priests, who are voluntarily giving for the house of their God in Jerusalem. "},{"num":17,"verse":"Diligently use this money to buy bulls, rams, lambs, with their grain offerings and their drink offerings, and offer them on the altar of the house of your God in Jerusalem."},{"num":18,"verse":"“Whatever seems good to you and your brothers to do with the rest of the silver and the gold, do that according to the will of your God. "},{"num":19,"verse":"The vessels also that are given to you for the service of the house of your God, deliver before the God of Jerusalem. "},{"num":20,"verse":"And whatever else is needed for the house of your God and is your responsibility to provide, use the king’s treasury to pay for it."},{"num":21,"verse":"“I, even I Artaxerxes the king, issue a decree to all the treasurers of the province Beyond the River, that whatever Ezra the priest, scribe of the law of the God of heaven, should request from you, you should do it with all diligence— "},{"num":22,"verse":"as much as a hundred talents of silver, a hundred measures of wheat, a hundred baths of wine, a hundred baths of oil, and salt (without prescribing how much). "},{"num":23,"verse":"Whatever is decreed by the God of heaven, let it be zealously done for the house of the God of heaven so as to avoid there being wrath against the realm of the king and his sons. "},{"num":24,"verse":"Also we are informing you that with regard to all the priests, Levites, singers, doorkeepers, temple servants, or other servants of this house of God, it is not permitted to impose toll, tribute, or custom on them."},{"num":25,"verse":"“You, Ezra, according to the wisdom of your God who empowers you, appoint magistrates and judges to judge all the people of the province Beyond the River, all those who know the laws of your God and those who do not, whom you must teach. "},{"num":26,"verse":"Whoever will not observe the law of your God or the law of the king, let judgment be executed speedily on him, whether that be death, banishment, confiscation of goods, or imprisonment.”"},{"num":27,"verse":"Blessed be the Lord God of our fathers, who has put such a thing as this in the king’s heart, to beautify the house of the Lord in Jerusalem, "},{"num":28,"verse":"and has extended mercy to me before the king, his counselors, and all the king’s mighty princes. Thus I had been strengthened, because the hand of the Lord my God was upon me. As a result, I gathered together some of the chief men of Israel to go up with me."}]