[{"header":"Ezra Returns From Babylon"},{"num":7,"verse":"Now after these things, during the reign of Artaxerxes king of Persia, Ezra son of Seraiah, son of Azariah, son of Hilkiah, "},{"num":2,"verse":"son of Shallum, son of Zadok, son of Ahitub, "},{"num":3,"verse":"son of Amariah, son of Azariah, son of Meraioth, "},{"num":4,"verse":"son of Zerahiah, son of Uzzi, son of Bukki, "},{"num":5,"verse":"son of Abishua, son of Phinehas, son of Eleazar, son of Aaron the kohen gadol—"},{"num":6,"verse":"this Ezra came up from Babylon. He was a scribe skilled in the Torah of Moses that Adonai the God of Israel had given. The king granted him everything he requested, because the hand of Adonai his God was upon him. "},{"num":7,"verse":"Some of Bnei-Yisrael and some of the kohanim, the Levites, the singers, the gatekeepers, and the sanctuary servants also came up to Jerusalem in the seventh year of King Artaxerxes."},{"num":8,"verse":"He arrived in Jerusalem in the fifth month of the seventh year of the king. "},{"num":9,"verse":"He began his aliyah from Babylon on the first day of the first month and entered Jerusalem on the first day of the fifth month, because the good hand of his God was upon him. "},{"num":10,"verse":"For Ezra had set his heart to seek the Torah of Adonai, to observe and to teach its statues and ordinances in Israel."},{"header":"King Artaxerxes’ Letter to Ezra"},{"num":11,"verse":"Now this is a copy of the letter that King Artaxerxes gave to Ezra the kohen, the scribe, a teacher of matters pertaining to the mitzvot of Adonai and His statutes over Israel:"},{"num":12,"verse":"“Artaxerxes, king of kings,"},{"num":13,"verse":"“I have now issued a decree that anyone in my kingdom from the people of Israel—even the kohanim and Levites—who wish to go up to Jerusalem with you may go. "},{"num":14,"verse":"For you are sent by the king and his seven counselors to inquire about Judah and Jerusalem with regard to the Law of your God, which is in your hand, "},{"num":15,"verse":"and to bring the silver and gold that the king and his counselors have freely given to the God of Israel, whose dwelling is in Jerusalem, "},{"num":16,"verse":"together with all the silver and gold that you find in the whole province of Babylon, as well as the freewill offerings of the people and the kohanim for the House of their God in Jerusalem. "},{"num":17,"verse":"Furthermore, with this silver you should be sure to buy bulls, rams and lambs, along with their grain offerings and their drink offerings and offer them on the altar of the House of your God in Jerusalem. "},{"num":18,"verse":"You may do whatever seems good to you and your brothers with the remaining silver and gold, according to the will of your God."},{"num":19,"verse":"“The vessels that are entrusted to you for the service of the House of your God, deliver before the God of Jerusalem. "},{"num":20,"verse":"The rest of the needs for the House of your God that you may have occasioned to supply, you may provide from the royal treasury."},{"num":21,"verse":"“I, King Artaxerxes, hereby issue a decree to all the treasurers of Trans-Euphrates to diligently provide all that Ezra the kohen, scribe of the Law of the God of heaven, may ask of you—"},{"num":22,"verse":"up to 100 talents of silver, 100 cors of wheat, 100 baths of wine, 100 baths of oil, and salt without limit. "},{"num":23,"verse":"Everything that the God of heaven has required, let it be done with diligence for the House of the God of heaven. For why should there be wrath against the realm of the king and his sons? "},{"num":24,"verse":"We also notify you that you have no authority to impose tribute, tax or duty on any of the kohanim, Levites, singers, gatekeepers, sanctuary servants, or attendants at this House of God."},{"num":25,"verse":"“Now you, Ezra, according to the wisdom of your God that is in your hand, appoint judges and magistrates who may administer justice to all the people in Trans-Euphrates—all who know the laws of your God. And you are to teach those who do not know them. "},{"num":26,"verse":"Let anyone who does not observe the Law of your God and the law of the king, be punished with due diligence, whether it is death or banishment, confiscation of goods or imprisonment.”"},{"num":27,"verse":"Blessed be Adonai, the God of our fathers, who has put it into the heart of the king to beautify the House of Adonai in Jerusalem in this way "},{"num":28,"verse":"and who has extended lovingkindness to me before the king and his counselors and all the king’s mighty princes. I gained strength, as the hand of Adonai my God was upon me, and I gathered leading men from Israel to go up with me."}]