[{"num":4,"verse":"For the rest, then, brethren, we beg you and exhort you in [the] Lord Jesus, even as ye have received from us how ye ought to walk and please God, even as ye also do walk, that ye would abound still more."},{"num":2,"verse":"For ye know what charges we gave you through the Lord Jesus."},{"num":3,"verse":"For this is [the] will of God, [even] your sanctification, that ye should abstain from fornication;"},{"num":4,"verse":"that each of you know how to possess his own vessel in sanctification and honour,"},{"num":5,"verse":"(not in passionate desire, even as the nations who know not God,)"},{"num":6,"verse":"not overstepping the rights of and wronging his brother in the matter, because the Lord [is] the avenger of all these things, even as we also told you before, and have fully testified."},{"num":7,"verse":"For God has not called us to uncleanness, but in sanctification."},{"num":8,"verse":"He therefore that [in this] disregards [his brother], disregards, not man, but God, who has given also his Holy Spirit to you."},{"num":9,"verse":"Now concerning brotherly love ye have no need that we should write to you, for ye yourselves are taught of God to love one another."},{"num":10,"verse":"For also ye do this towards all the brethren in the whole of Macedonia; but we exhort you, brethren, to abound still more,"},{"num":11,"verse":"and to seek earnestly to be quiet and mind your own affairs, and work with your [own] hands, even as we charged you,"},{"num":12,"verse":"that ye may walk reputably towards those without, and may have need of no one."},{"num":13,"verse":"But we do not wish you to be ignorant, brethren, concerning them that are fallen asleep, to the end that ye be not grieved even as also the rest who have no hope."},{"num":14,"verse":"For if we believe that Jesus has died and has risen again, so also God will bring with him those who have fallen asleep through Jesus."},{"num":15,"verse":"(For this we say to you in [the] word of [the] Lord, that *we*, the living, who remain to the coming of the Lord, are in no way to anticipate those who have fallen asleep;"},{"num":16,"verse":"for the Lord himself, with an assembling shout, with archangel's voice and with trump of God, shall descend from heaven; and the dead in Christ shall rise first;"},{"num":17,"verse":"then *we*, the living who remain, shall be caught up together with them in [the] clouds, to meet the Lord in [the] air; and thus we shall be always with [the] Lord."},{"num":18,"verse":"So encourage one another with these words.)"}]