[{"header":"Brothers, We Ask You To Abound Even More In Holiness, For This Is God’s Will"},{"num":4,"verse":"Finally then, brothers, we ask you, and exhort in the Lord Jesus that just as you received from us how you ought-to be walking and pleasing God (just as you also are walking), that you be abounding more. "},{"num":2,"verse":"For you know what commands we gave to you through the Lord Jesus. "},{"num":3,"verse":"For this is the will of God: your holiness— that you be abstaining from sexual-immorality; "},{"num":4,"verse":"that each of you know-how to acquire control of his own vessel in holiness and honor, "},{"num":5,"verse":"not in the passion of  desire as indeed the Gentiles not knowing God; "},{"num":6,"verse":"that no one overstep and exploit his brother in the matter. Because the Lord is the avenger concerning all these things, just as we also told you before and solemnly-warned. "},{"num":7,"verse":"For God did not call us for impurity, but in holiness. "},{"num":8,"verse":"So-therefore the one rejecting is not rejecting a human, but God, the One also giving His Holy Spirit to you."},{"header":"But You Know From God To Love One Another. We Exhort You To Abound Even More"},{"num":9,"verse":"But concerning brotherly-love, you have no need that anyone should be writing to you. For you yourselves are God-taught so-that you might be loving one another. "},{"num":10,"verse":"For indeed you are doing it toward all the brothers in all Macedonia. But we exhort you, brothers, to be abounding more, "},{"num":11,"verse":"and to be ambitious to be quiet, and to be doing your own things and working with your own hands just as we commanded you, "},{"num":12,"verse":"in order that you may walk properly toward the ones outside and may have need of nothing."},{"header":"Do Not Grieve Over The Dead In Christ. We Will Rise Together To Be With Him Forever"},{"num":13,"verse":"And we do not want you to be unaware, brothers, concerning the ones falling-asleep, in-order-that you may not grieve as indeed the others— the ones not having a hope. "},{"num":14,"verse":"For if we believe that Jesus died and rose-up, so also God will bring with Him the ones having fallen asleep through Jesus. "},{"num":15,"verse":"For we say this to you by the word of the Lord, that we— the ones living, the ones remaining until the coming of the Lord— will in-no-way precede the ones having fallen asleep. "},{"num":16,"verse":"Because the Lord Himself will descend from heaven with a shouted-command, with a voice of an archangel, and with a trumpet of God, and the dead in Christ will rise-up first. "},{"num":17,"verse":"Then we— the ones living, the ones remaining— will be snatched-up together with them in the clouds to meet the Lord in the air. And so we shall always be with the Lord. "},{"num":18,"verse":"So then, be encouraging one another with these words."}]