[{"header":"A Life That Pleases God"},{"num":4,"verse":"Brothers and sisters, now I have some other things to tell you. We taught you how to live in a way that will please God. And you are living that way. Now we ask and encourage you in the Lord Jesus to live that way more and more."},{"num":2,"verse":"You know all that we told you to do by the authority of the Lord Jesus."},{"num":3,"verse":"God wants you to be holy. He wants you to stay away from sexual sins."},{"num":4,"verse":"God wants each one of you to learn to control your own body. Use your body in a way that is holy and that gives honor to God."},{"num":5,"verse":"Don’t let your sexual desires control you like the people who don’t know God."},{"num":6,"verse":"Never wrong any of your fellow believers or cheat them in this way. The Lord will punish those who do that. We have already told you this and warned you about it."},{"num":7,"verse":"God chose us to be holy. He does not want us to live in sin."},{"num":8,"verse":"So anyone who refuses to obey this teaching is refusing to obey God, not us. And God is the one who gives you his Holy Spirit."},{"num":9,"verse":"We don’t need to write to you about having love for your brothers and sisters in Christ. God has already taught you to love each other."},{"num":10,"verse":"In fact, you love all the believers in Macedonia. We encourage you now, brothers and sisters, to show your love more and more."},{"num":11,"verse":"Do all you can to live a peaceful life. Mind your own business, and earn your own living, as we told you before."},{"num":12,"verse":"If you do these things, then those who are not believers will respect the way you live. And you will not have to depend on others for what you need."},{"header":"The Lord’s Coming"},{"num":13,"verse":"Brothers and sisters, we want you to know about those who have died. We don’t want you to be sad like other people—those who have no hope."},{"num":14,"verse":"We believe that Jesus died, but we also believe that he rose again. So we believe that God will raise to life through Jesus any who have died and bring them together with him when he comes."},{"num":15,"verse":"What we tell you now is the Lord’s own message. Those of us who are still living when the Lord comes again will join him, but not before those who have already died."},{"num":16,"verse":"The Lord himself will come down from heaven with a loud command, with the voice of the archangel, and with the trumpet call of God. And the people who have died and were in Christ will rise first."},{"num":17,"verse":"After that we who are still alive at that time will be gathered up with those who have died. We will be taken up in the clouds and meet the Lord in the air. And we will be with the Lord forever."},{"num":18,"verse":"So encourage each other with these words."}]