[{"header":"Opening the first six seals"},{"num":6,"verse":"Then I looked on as the Lamb opened one of the seven seals. I heard one of the four living creatures say in a voice like thunder, “Come!”"},{"num":2,"verse":"So I looked, and there was a white horse. Its rider held a bow and was given a crown. And he went forth from victory to victory."},{"num":3,"verse":"When the Lamb opened the second seal, I heard the second living creature say, “Come!”"},{"num":4,"verse":"Out came another horse, fiery red. Its rider was allowed to take peace from the earth so that people would kill each other. He was given a large sword."},{"num":5,"verse":"When he opened the third seal, I heard the third living creature say, “Come!” So I looked, and there was a black horse. Its rider held a balance for weighing in his hand."},{"num":6,"verse":"I heard what sounded like a voice from among the four living creatures. It said, “A quart of wheat for a denarion, and three quarts of barley for a denarion, but don’t damage the olive oil and the wine.”"},{"num":7,"verse":"When he opened the fourth seal, I heard the voice of the fourth living creature say, “Come!”"},{"num":8,"verse":"So I looked, and there was a pale green horse. Its rider’s name was Death, and the Grave was following right behind. They were given authority over a fourth of the earth, to kill by sword, famine, disease, and the wild animals of the earth."},{"num":9,"verse":"When he opened the fifth seal, I saw under the altar those who had been slaughtered on account of the word of God and the witness they had given."},{"num":10,"verse":"They cried out with a loud voice, “Holy and true Master, how long will you wait before you pass judgment? How long before you require justice for our blood, which was shed by those who live on earth?”"},{"num":11,"verse":"Each of them was given a white robe, and they were told to rest a little longer, until their fellow servants and brothers and sisters—who were about to be killed as they were—were finished."},{"num":12,"verse":"I looked on as he opened the sixth seal, and there was a great earthquake. The sun became black as funeral clothing, and the entire moon turned red as blood."},{"num":13,"verse":"The stars of the sky fell to the earth as a fig tree drops its fruit when shaken by a strong wind."},{"num":14,"verse":"The sky disappeared like a scroll being rolled up, and every mountain and island was moved from its place."},{"num":15,"verse":"Then the kings of the earth, the officials and the generals, the rich and the powerful, and everyone, slave and free, hid themselves in caves and in the rocks of the mountains."},{"num":16,"verse":"They called to the mountains and the rocks, “Fall on us and hide us from the face of the one seated on the throne and from the Lamb’s wrath!"},{"num":17,"verse":"The great day of their wrath has come, and who is able to stand?”"}]