[{"num":6,"verse":"1 The Lamb openeth the first seal of the book. 3 The second, 5 the third, 7 the fourth, 9 the fifth, 12 and the sixth, and then arise murders, famine, pestilence, outcries of Saints, earthquakes, and divers strange sights in heaven."},{"num":1,"verse":"After I beheld when the Lamb had opened one of the seals, and I heard one of the four beasts say, as it were the noise of thunder, Come and see."},{"num":2,"verse":"Therefore I beheld, and lo, there was a white horse, and he that sat on him, had a bow, and a crown was given unto him, and he went forth conquering that he might overcome."},{"num":3,"verse":"And when he had opened the second seal, I heard the second beast say, Come and see."},{"num":4,"verse":"And there went out another horse, that was red, and power was given to him that sat thereon to take peace from the earth, and that they should kill one another, and there was given unto him a great sword."},{"num":5,"verse":"And when he had opened the third seal, I heard the third beast say, Come and see. Then I beheld, and lo, a black horse, and he that sat on him, had balances in his hand."},{"num":6,"verse":"And I heard a voice in the midst of the four beasts say, A measure of wheat for a penny, and three measures of barley for a penny, and oil, and wine hurt thou not."},{"num":7,"verse":"And when he had opened the fourth seal, I heard the voice of the fourth beast say, Come and see."},{"num":8,"verse":"And I looked, and behold, a pale horse, and his name that sat on him was Death, and Hell followed after him, and power was given unto them over the fourth part of the earth, to kill with sword, and with hunger, and with death, and with beasts of the earth."},{"num":9,"verse":"And when he had opened the fifth seal, I saw under the altar the souls of them that were killed for the word of God, and for the testimony which they maintained."},{"num":10,"verse":"And they cried with a loud voice, saying, How long, Lord, which art holy and true! dost not thou judge and avenge our blood on them, that dwell on the earth?"},{"num":11,"verse":"And long white robes were given unto every one, and it was said unto them, that they should rest for a little season until their fellow servants, and their brethren that should be killed even as they were, were fulfilled."},{"num":12,"verse":"And I beheld when he had opened the sixth seal, and lo, there was a great earthquake, and the Sun was as black as sackcloth of hair, and the Moon was like blood."},{"num":13,"verse":"And the stars of heaven fell unto the earth, as a fig-tree casteth her green figs, when it is shaken of a mighty wind."},{"num":14,"verse":"And heaven departed away, as a scroll, when it is rolled, and every mountain and isle were moved out of their places."},{"num":15,"verse":"And the kings of the earth, and the great men, and the rich men, and the chief captains, and the mighty men, and every bondman, and every free man, hid themselves in dens, and among the rocks of the mountains,"},{"num":16,"verse":"And said to the mountains and rocks, Fall on us, and hide us from the presence of him that sitteth on the throne, and from the wrath of the Lamb."},{"num":17,"verse":"For the great day of his wrath is come, and who can stand?"}]