[{"header":"The First Seal on the Scroll"},{"num":6,"verse":"Then I saw the Lamb open one of the seven seals, and I heard one of the four living creatures say with a voice like thunder, “Come!” "},{"num":2,"verse":"I looked, and there was a white horse. The horseman on it had a bow; a crown was given to him, and he went out as a victor to conquer."},{"header":"The Second Seal"},{"num":3,"verse":"When He opened the second seal, I heard the second living creature say, “Come!” "},{"num":4,"verse":"Then another horse went out, a fiery red one, and its horseman was empowered to take peace from the earth, so that people would slaughter one another. And a large sword was given to him."},{"header":"The Third Seal"},{"num":5,"verse":"When He opened the third seal, I heard the third living creature say, “Come!” And I looked, and there was a black horse. The horseman on it had a set of scales in his hand. "},{"num":6,"verse":"Then I heard something like a voice among the four living creatures say, “A quart of wheat for a denarius, and three quarts of barley for a denarius—but do not harm the olive oil and the wine.”"},{"header":"The Fourth Seal"},{"num":7,"verse":"When He opened the fourth seal, I heard the voice of the fourth living creature say, “Come!” "},{"num":8,"verse":"And I looked, and there was a pale green horse. The horseman on it was named Death, and Hades was following after him. Authority was given to them over a fourth of the earth, to kill by the sword, by famine, by plague, and by the wild animals of the earth."},{"header":"The Fifth Seal"},{"num":9,"verse":"When He opened the fifth seal, I saw under the altar the people slaughtered because of God’s word and the testimony they had. "},{"num":10,"verse":"They cried out with a loud voice: “Lord, the One who is holy and true, how long until You judge and avenge our blood from those who live on the earth?” "},{"num":11,"verse":"So a white robe was given to each of them, and they were told to rest a little while longer until the number would be completed of their fellow slaves and their brothers, who were going to be killed just as they had been."},{"header":"The Sixth Seal"},{"num":12,"verse":"Then I saw Him open the sixth seal. A violent earthquake occurred; the sun turned black like sackcloth made of goat hair; the entire moon became like blood; "},{"num":13,"verse":"the stars of heaven fell to the earth as a fig tree drops its unripe figs when shaken by a high wind; "},{"num":14,"verse":"the sky separated like a scroll being rolled up; and every mountain and island was moved from its place."},{"num":15,"verse":"Then the kings of the earth, the nobles, the military commanders, the rich, the powerful, and every slave and free person hid in the caves and among the rocks of the mountains. "},{"num":16,"verse":"And they said to the mountains and to the rocks, “Fall on us and hide us from the face of the One seated on the throne and from the wrath of the Lamb, "},{"num":17,"verse":"because the great day of Their wrath has come! And who is able to stand?”"}]