[{"num":6,"verse":"Then I watched while the Lamb opened the first of the seven seals. I heard one of the four living creatures say with a voice like thunder, “Come!” "},{"num":2,"verse":"I looked, and there before me was a white horse. The rider on the horse held a bow, and he was given a crown, and he rode out, determined to win the victory."},{"num":3,"verse":"When the Lamb opened the second seal, I heard the second living creature say, “Come!” "},{"num":4,"verse":"Then another horse came out, a red one. Its rider was given power to take away peace from the earth and to make people kill each other, and he was given a big sword."},{"num":5,"verse":"When the Lamb opened the third seal, I heard the third living creature say, “Come!” I looked, and there before me was a black horse, and its rider held a pair of scales in his hand. "},{"num":6,"verse":"Then I heard something that sounded like a voice coming from the middle of the four living creatures. The voice said, “A quart of wheat for a day’s pay, and three quarts of barley for a day’s pay, and do not damage the olive oil and wine!”"},{"num":7,"verse":"When the Lamb opened the fourth seal, I heard the voice of the fourth living creature say, “Come!” "},{"num":8,"verse":"I looked, and there before me was a pale horse. Its rider was named death, and Hades was following close behind him. They were given power over a fourth of the earth to kill people by war, by starvation, by disease, and by the wild animals of the earth."},{"num":9,"verse":"When the Lamb opened the fifth seal, I saw under the altar the souls of those who had been killed because they were faithful to the word of God and to the message they had received. "},{"num":10,"verse":"These souls shouted in a loud voice, “Holy and true Lord, how long until you judge the people of the earth and punish them for killing us?” "},{"num":11,"verse":"Then each one of them was given a white robe and was told to wait a short time longer. There were still some of their fellow servants and brothers and sisters in the service of Christ who must be killed as they were. They had to wait until all of this was finished."},{"num":12,"verse":"Then I watched while the Lamb opened the sixth seal, and there was a great earthquake. The sun became black like rough black cloth, and the whole moon became red like blood. "},{"num":13,"verse":"And the stars in the sky fell to the earth like figs falling from a fig tree when the wind blows. "},{"num":14,"verse":"The sky disappeared as a scroll when it is rolled up, and every mountain and island was moved from its place."},{"num":15,"verse":"Then the kings of the earth, the rulers, the generals, the rich people, the powerful people, the slaves, and the free people hid themselves in caves and in the rocks on the mountains. "},{"num":16,"verse":"They called to the mountains and the rocks, “Fall on us. Hide us from the face of the One who sits on the throne and from the anger of the Lamb! "},{"num":17,"verse":"The great day for their anger has come, and who can stand against it?”"}]