[{"num":6,"verse":"And I saw when the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach) opened one of the sheva chotamot (seven seals). And I heard one of the Arbah Chayyot (four living beings) saying, as with a voice of thunder, \"Come and see!"},{"num":2,"verse":"And I saw, and, Hinei, a sus lavan (white horse), and the one sitting on it having a keshet;(bow, YECHEZKEL 39:3) and was given to him an atarah, (diadem) and he went forth conquering, intent on conquest."},{"num":3,"verse":"And when he opened the chotam hasheyni (second seal), I heard hasheniyah of HaChayyot (the second of the living beings) saying, \"Come and see!"},{"num":4,"verse":"And another sus (horse) went forth, a flame-red one, and to the one sitting on it was given him to take shalom from ha’aretz (the earth) with men slaughtering one another, and was given to him a cherev gedolah (great sword). [ZECHARYAH 1:8; 6:2]"},{"num":5,"verse":"And when he opened the chotam hashlishi (third seal), I heard hashlishit of HaChayyot (the third of the living beings), saying , \"Come and see!\" And I saw and hinei, a sus shakhor (black horse), and the one sitting on it having a pair of scales in his yad (hand). [ZECHARYAH 6:2]"},{"num":6,"verse":"And I heard, as it were, a kol (voice) in the midst of the Arbah Chayyot (four living beings), saying, \"A quart of wheat for a denarius and shloshah quarts of barley for a denarius, but the shemen (oil) and the yayin (wine) you may not harm.\" [Ezek 4:16]"},{"num":7,"verse":"And when he opened the chotam harevi’i (the fourth seal), I heard the kol (voice) of hareve’it (the fourth) of HaChayyot (the living beings) saying, \"Come and see!"},{"num":8,"verse":"And I saw, and, hinei, a sus yerakrak (a greenish pale horse), and the one sitting upon it, that rider’s name was Mavet, and She’ol was following with him. And there was given to them samchut (authority) over a quarter of ha’aretz (the earth), to kill with cherev (sword) and with ra’av (famine) and with mavet (death) and by the chayyot (beasts) of ha’aretz (the earth). [ZECHARYAH 6:3; HOSHEA 13:14; YIRMEYAH 15:2,3; 24:10; YECHEZKEL 5:12,17]"},{"num":9,"verse":"And when he opened the chotam hachamishi (fifth seal), I saw underneath the Mizbe’ach (altar) the nefashot (souls) of the ones having died al kiddush ha-Shem, having been slain as martyrs because of the dvar Hashem (word of G-d) and because of their solemn eidus (testimony) which they had given. [SHEMOT 29:12; VAYIKRA 4:7]"},{"num":10,"verse":"And they cried out, saying, Rabbono shel Olam, HaKadosh and HaNe’eman, ad mosai (how much longer) is it to be until you judge and avenge dahmeinu (our blood) on the inhabitants of ha’aretz (the earth)? [TEHILLIM 119:84; ZECHARYAH 1:12; DEVARIM 32:43; MELACHIM BAIS 9:7; TEHILLIM 79:10]"},{"num":11,"verse":"And they were each given a kittel (white robe) and it was told them that they will rest yet a little while, until the mispar (number) should be complete of their fellow avadim (servants) and their Achim b’Moshiach, the ones about to die al kiddush ha-Shem, being about to be killed as martyrs as they were."},{"num":12,"verse":"And I saw when he opened the chotam hashishi (sixth seal), a great earthquake occurred and the shemesh (sun) became shakhor (black) as sackcloth made of hair and the whole levanah (moon) became like dahm. [Ps 97:4; Isa 29:6; Ezek 38:19; Isa 50:3]"},{"num":13,"verse":"And the kokhavim (stars) of Shomayim fell to ha’aretz (the earth), as an etz te’enah (fig tree) casts off its unripe figs when being shaken by a great wind. [YESHAYAH 34:4]"},{"num":14,"verse":"And Shomayim split apart as a megillah scroll being rolled up; and every mountain and island were moved out of their places. [TEHILLIM 46:2; YESHAYAH 54:10; YIRMEYAH 4:24; YECHEZKEL 38:20; NACHUM 1:5]"},{"num":15,"verse":"And the melachim (kings) of ha’aretz (the earth) and the gedolim (great ones) and the military leaders and the oishirim (rich men) and the strong men and all avadim (slaves) and Bnei Chorin (freedmen) hid themselves in the caves and in the rocks of the mountains. [YESHAYAH 2:10,19,21]"},{"num":16,"verse":"And they say to the mountains and to the rocks, Fall on us and hide us from the face of the One sitting on the Kes (Throne) and from the za’am (wrath, anger, 16:1f) of the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach), [HOSHEA 10:8]"},{"num":17,"verse":"Because the Yom HaGadol, the Yom HaZa’am, the Great Day of Their Wrath has come, and who is able to stand? [Joel 1:15; 2:1,2,11,31; Zeph 1:14,15; Nah 1:6; Mal 3:2]"}]