[[],[{"type":"header","content":"The Family Tree of King Saul of Benjamin(A)"},{"type":"prose","content":"Now Benjamin begot Bela his firstborn, Ashbel the second, Aharah the third, "}],[{"type":"prose","content":"Nohah the fourth, and Rapha the fifth. "}],[{"type":"prose","content":"The sons of Bela  Addar, Gera, Abihud, "}],[{"type":"prose","content":"Abishua, Naaman, Ahoah, "}],[{"type":"prose","content":"Gera, Shephuphan, and Huram."}],[{"type":"prose","content":"These  the sons of Ehud, who were the heads of the fathers’  of the inhabitants of Geba, and who forced them to move to Manahath: "}],[{"type":"prose","content":"Naaman, Ahijah, and Gera who forced them to move. He begot Uzza and Ahihud."}],[{"type":"prose","content":"Also Shaharaim had children in the country of Moab, after he had sent away Hushim and Baara his wives. "}],[{"type":"prose","content":"By Hodesh his wife he begot Jobab, Zibia, Mesha, Malcam, "}],[{"type":"prose","content":"Jeuz, Sachiah, and Mirmah. These  his sons, heads of their fathers’ "}],[{"type":"prose","content":"And by Hushim he begot Abitub and Elpaal. "}],[{"type":"prose","content":"The sons of Elpaal  Eber, Misham, and Shemed, who built Ono and Lod with its towns; "}],[{"type":"prose","content":"and Beriah and Shema, who  heads of their fathers’  of the inhabitants of Aijalon, who drove out the inhabitants of Gath. "}],[{"type":"prose","content":"Ahio, Shashak, Jeremoth, "}],[{"type":"prose","content":"Zebadiah, Arad, Eder, "}],[{"type":"prose","content":"Michael, Ispah, and Joha  the sons of Beriah. "}],[{"type":"prose","content":"Zebadiah, Meshullam, Hizki, Heber, "}],[{"type":"prose","content":"Ishmerai, Jizliah, and Jobab  the sons of Elpaal. "}],[{"type":"prose","content":"Jakim, Zichri, Zabdi, "}],[{"type":"prose","content":"Elienai, Zillethai, Eliel, "}],[{"type":"prose","content":"Adaiah, Beraiah, and Shimrath  the sons of Shimei. "}],[{"type":"prose","content":"Ishpan, Eber, Eliel, "}],[{"type":"prose","content":"Abdon, Zichri, Hanan, "}],[{"type":"prose","content":"Hananiah, Elam, Antothijah, "}],[{"type":"prose","content":"Iphdeiah, and Penuel  the sons of Shashak. "}],[{"type":"prose","content":"Shamsherai, Shehariah, Athaliah, "}],[{"type":"prose","content":"Jaareshiah, Elijah, and Zichri  the sons of Jeroham."}],[{"type":"prose","content":"These  heads of the fathers’  by their generations, chief men. These dwelt in Jerusalem."}],[{"type":"prose","content":"Now the father of Gibeon, whose wife’s name  Maacah, dwelt at Gibeon. "}],[{"type":"prose","content":"And his firstborn son  Abdon, then Zur, Kish, Baal, Nadab, "}],[{"type":"prose","content":"Gedor, Ahio, Zecher, "}],[{"type":"prose","content":"and Mikloth,  begot Shimeah. They also dwelt alongside their relatives in Jerusalem, with their brethren. "}],[{"type":"prose","content":"Ner begot Kish, Kish begot Saul, and Saul begot Jonathan, Malchishua, Abinadab, and Esh-Baal. "}],[{"type":"prose","content":"The son of Jonathan  Merib-Baal, and Merib-Baal begot Micah. "}],[{"type":"prose","content":"The sons of Micah  Pithon, Melech, Tarea, and Ahaz. "}],[{"type":"prose","content":"And Ahaz begot Jehoaddah; Jehoaddah begot Alemeth, Azmaveth, and Zimri; and Zimri begot Moza. "}],[{"type":"prose","content":"Moza begot Binea, Raphah his son, Eleasah his son,  Azel his son."}],[{"type":"prose","content":"Azel had six sons whose names  these: Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, and Hanan. All these  the sons of Azel. "}],[{"type":"prose","content":"And the sons of Eshek his brother  Ulam his firstborn, Jeush the second, and Eliphelet the third."}],[{"type":"prose","content":"The sons of Ulam were mighty men of valor—archers.  had many sons and grandsons, one hundred and fifty  These  all sons of Benjamin."}]]