[{"header":"Descendants of Benjamin"},{"num":8,"verse":"Benjamin became the father of Bela his firstborn, Ashbel the second, Aharah the third, "},{"num":2,"verse":"Nohah the fourth, and Rapha the fifth. "},{"num":3,"verse":"And Bela had sons: Addar, Gera, Abihud, "},{"num":4,"verse":"Abishua, Naaman, Ahoah, "},{"num":5,"verse":"Gera, Shephuphan, and Huram. "},{"num":6,"verse":"These are the sons of Ehud (they were heads of ancestral houses of the inhabitants of Geba, and they were carried into exile to Manahath): "},{"num":7,"verse":"Naaman, Ahijah, and Gera, that is, Heglam, who became the father of Uzza and Ahihud. "},{"num":8,"verse":"And Shaharaim had sons in the country of Moab after he had sent away his wives Hushim and Baara. "},{"num":9,"verse":"He had sons by his wife Hodesh: Jobab, Zibia, Mesha, Malcam, "},{"num":10,"verse":"Jeuz, Sachia, and Mirmah. These were his sons, heads of ancestral houses. "},{"num":11,"verse":"He also had sons by Hushim: Abitub and Elpaal. "},{"num":12,"verse":"The sons of Elpaal: Eber, Misham, and Shemed, who built Ono and Lod with its towns, "},{"num":13,"verse":"and Beriah and Shema (they were heads of ancestral houses of the inhabitants of Aijalon, who put to flight the inhabitants of Gath); "},{"num":14,"verse":"and Ahio, Shashak, and Jeremoth. "},{"num":15,"verse":"Zebadiah, Arad, Eder, "},{"num":16,"verse":"Michael, Ishpah, and Joha were sons of Beriah. "},{"num":17,"verse":"Zebadiah, Meshullam, Hizki, Heber, "},{"num":18,"verse":"Ishmerai, Izliah, and Jobab were the sons of Elpaal. "},{"num":19,"verse":"Jakim, Zichri, Zabdi, "},{"num":20,"verse":"Elienai, Zillethai, Eliel, "},{"num":21,"verse":"Adaiah, Beraiah, and Shimrath were the sons of Shimei. "},{"num":22,"verse":"Ishpan, Eber, Eliel, "},{"num":23,"verse":"Abdon, Zichri, Hanan, "},{"num":24,"verse":"Hananiah, Elam, Anthothijah, "},{"num":25,"verse":"Iphdeiah, and Penuel were the sons of Shashak. "},{"num":26,"verse":"Shamsherai, Shehariah, Athaliah, "},{"num":27,"verse":"Jaareshiah, Elijah, and Zichri were the sons of Jeroham. "},{"num":28,"verse":"These were the heads of ancestral houses, according to their generations, chiefs. These lived in Jerusalem."},{"num":29,"verse":"Jeiel the father of Gibeon lived in Gibeon, and the name of his wife was Maacah. "},{"num":30,"verse":"His firstborn son: Abdon, then Zur, Kish, Baal, Nadab, "},{"num":31,"verse":"Gedor, Ahio, Zecher, "},{"num":32,"verse":"and Mikloth, who became the father of Shimeah. Now these also lived opposite their kindred in Jerusalem, with their kindred. "},{"num":33,"verse":"Ner became the father of Kish, Kish of Saul, Saul of Jonathan, Malchishua, Abinadab, and Esh-baal; "},{"num":34,"verse":"and the son of Jonathan was Merib-baal; and Merib-baal became the father of Micah. "},{"num":35,"verse":"The sons of Micah: Pithon, Melech, Tarea, and Ahaz. "},{"num":36,"verse":"Ahaz became the father of Jehoaddah; and Jehoaddah became the father of Alemeth, Azmaveth, and Zimri; Zimri became the father of Moza. "},{"num":37,"verse":"Moza became the father of Binea; Raphah was his son, Eleasah his son, Azel his son. "},{"num":38,"verse":"Azel had six sons, and these are their names: Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, and Hanan; all these were the sons of Azel. "},{"num":39,"verse":"The sons of his brother Eshek: Ulam his firstborn, Jeush the second, and Eliphelet the third. "},{"num":40,"verse":"The sons of Ulam were mighty warriors, archers, having many children and grandchildren, one hundred and fifty. All these were Benjaminites."}]