[{"num":21,"verse":"2 For whom the Priests may lament. 6 How pure the Priests ought to be, both in themselves, and in their family."},{"num":1,"verse":"And the Lord said unto Moses, Speak unto the Priests the sons of Aaron, and say unto them, Let none be defiled by the dead among his people,"},{"num":2,"verse":"But by his kinsman that is near unto him: to wit, by his mother, or by his father, or by his son, or by his daughter, or by his brother,"},{"num":3,"verse":"Or by his sister a maid, that is near unto him, which had not had an husband: for her he may lament."},{"num":4,"verse":"He shall not lament for the Prince among his people, to pollute himself."},{"num":5,"verse":"They shall not make bald parts upon their head, nor shave off the locks of their beard, nor make any cuttings in their flesh."},{"num":6,"verse":"They shall be holy unto their God, and not pollute the Name of their God: for the sacrifices of the Lord made by fire, and the bread of their God they do offer: therefore they shall be holy."},{"num":7,"verse":"They shall not take to wife an whore, or one polluted, neither shall they marry a woman divorced from her husband: for such one is holy unto his God."},{"num":8,"verse":"Thou shalt sanctify him therefore, for he offereth the bread of thy God: he shall be holy unto thee: for I the Lord which sanctify you, am holy."},{"num":9,"verse":"¶ If a Priest’s daughter fall to play the whore, she polluteth her father: therefore shall she be burnt with fire."},{"num":10,"verse":"¶ Also the high Priest among his brethren, (upon whose head the anointing oil was poured, and hath consecrated his hand to put on the garments) shall not uncover his head nor rent his clothes."},{"num":11,"verse":"Neither shall he go to any dead body, nor make himself unclean by his father or by his mother,"},{"num":12,"verse":"Neither shall he go out of the Sanctuary, nor pollute the holy place of his God: for the crown of the anointing oil of his God is upon him: I am the Lord."},{"num":13,"verse":"Also he shall take a maid unto his wife:"},{"num":14,"verse":"But a widow, or a divorced woman, or a polluted, or an harlot, these shall he not marry, but shall take a maid of his own people to wife:"},{"num":15,"verse":"Neither shall he defile his seed among his people: for I am the Lord which sanctify him."},{"num":16,"verse":"¶ And the Lord spake unto Moses, saying,"},{"num":17,"verse":"Speak unto Aaron, and say, Whosoever of thy seed in their generations hath any blemishes, shall not prease to offer the bread of his God:"},{"num":18,"verse":"For whosoever hath any blemish, shall not come near: as a man blind or lame, or that hath a flat nose, or that hath any misshapen member,"},{"num":19,"verse":"Or, a man that hath a broken foot, or a broken hand,"},{"num":20,"verse":"Or, is crookbacked, or bleary-eyed, or hath a blemish in his eye, or be scurvy, or scabbed, or hath his stones broken."},{"num":21,"verse":"None of the seed of Aaron the Priest that hath a blemish, shall come near to offer the sacrifices of the Lord made by fire, having a blemish: he shall not prease to offer the bread of his God."},{"num":22,"verse":"The bread of his God, even of the most holy, and of the holy shall he eat:"},{"num":23,"verse":"But he shall not go in unto the veil, nor come near the altar, because he hath a blemish, lest he pollute my Sanctuaries: for I am the Lord that sanctify them."},{"num":24,"verse":"Thus spake Moses unto Aaron, and to his sons, and to all the children of Israel."}]