[{"num":10,"verse":"Hear the word which the Lord speaks to you, O house of Israel."},{"num":2,"verse":"Thus says the Lord: Learn not the way of the [heathen] nations and be not dismayed at the signs of the heavens, though they are dismayed at them,"},{"num":3,"verse":"For the customs and ordinances of the peoples are false, empty, and futile; it is but a tree which one cuts out of the forest [to make for himself a god], the work of the hands of the craftsman with the ax or other tool."},{"num":4,"verse":"They deck [the idol] with silver and with gold; they fasten it with nails and with hammers so it will not fall apart or move around."},{"num":5,"verse":"[Their idols] are like pillars of turned work [as upright and stationary and immobile as a palm tree], like scarecrows in a cucumber field; they cannot speak; they have to be carried, for they cannot walk. Do not be afraid of them, for they cannot do evil, neither is it possible for them to do good [and it is not in them]."},{"num":6,"verse":"None at all is like You, O Lord; You are great, and Your name is great in might."},{"num":7,"verse":"Who would not fear You, O King of the nations? For it is fitting to You and Your due! For among all the wise [men or gods] of the nations and in all their kingdoms, there is none like You."},{"num":8,"verse":"But they are altogether irrational and stupid and foolish. Their instruction is given by idols who are but wood [it is a teaching of falsity, emptiness, futility]!"},{"num":9,"verse":"Silver beaten [into plates] is brought from Tarshish and gold from Uphaz, the work of the craftsman and of the hands of the goldsmith; the [idols’] clothing is violet and purple—they are all the work of skillful men."},{"num":10,"verse":"But the Lord is the true God and the God of truth (the God Who is Truth). He is the living God and the everlasting King. At His wrath the earth quakes, and the nations are not able to bear His indignation."},{"num":11,"verse":"Thus shall you say to them: The gods, who did not make the heavens and the earth, shall perish from the earth and from under the heavens."},{"num":12,"verse":"God made the earth by His power; He established the world by His wisdom and by His understanding and skill stretched out the heavens."},{"num":13,"verse":"When He utters His voice, there is a tumult of waters in the heavens, and He causes the vapors to ascend from the ends of the earth. He makes lightnings for the rain and brings forth the wind out from His treasuries and from His storehouses."},{"num":14,"verse":"Every man has become like a brute, irrational and stupid, without knowledge [of God]; every goldsmith is brought to shame by his graven idols; for his molten images are frauds and falsehood, and there is no breath in them."},{"num":15,"verse":"They are devoid of worth, usefulness, or truth, a work of delusion and mockery; in their time of trial and punishment they shall [helplessly] perish."},{"num":16,"verse":"The Portion of Jacob [the true God on Whom Israel has a claim] is not like these, for He is the Fashioner and Maker of all things, and Israel is the tribe of His inheritance—the Lord of hosts is His name."},{"num":17,"verse":"Gather up your bundle [of baggage] from the ground, O you who dwell under siege."},{"num":18,"verse":"For thus says the Lord: Behold, I will sling out the inhabitants of the land at this time and will bring distress on them, that they may feel it and find it [to be as I have said, and turn to Me]."},{"num":19,"verse":"Woe is me because of my hurt! [says Jeremiah, speaking for the nation.] My wound is grievous and incurable. But I said, Surely this sickness and suffering and grief are mine, and I must endure, tolerate, and bear them."},{"num":20,"verse":"My tent (home) is taken by force and plundered, and all my [tent] cords are broken. My children have gone forth [as captives] from me, and they are no more; there is no one to stretch forth my tent any more and to set up my [tent] curtains."},{"num":21,"verse":"For the shepherds [of the people] have become like brutes, irrational and stupid, and have not sought the Lord or inquired of Him or required Him [by necessity and by right of His word]. Therefore they have not dealt prudently and have not prospered, and all their flocks are scattered."},{"num":22,"verse":"Hark, the sound of a rumor! [The invading army] comes!—a great commotion out of the north country—to make the cities of Judah a desolation, a dwelling place of jackals."},{"num":23,"verse":"O Lord [pleads Jeremiah in the name of the people], I know that [the determination of] the way of a man is not in himself; it is not in man [even in a strong man or in a man at his best] to direct his [own] steps."},{"num":24,"verse":"O Lord, correct, instruct, and chastise me, but with judgment and in just measure—not in Your anger, lest You diminish me and bring me to nothing."},{"num":25,"verse":"Pour out Your wrath upon the nations that do not know or recognize You and upon the peoples that do not call upon Your name. For they have devoured Jacob, yes, devoured him and consumed him and made his habitation a desolate waste."}]