[{"num":10,"verse":"The constellations of the stars are not to be feared. 5 The weakness of idols. 6 Of the power of God. 21 Their Pastors are become brute beasts."},{"num":1,"verse":"Hear ye the word of the Lord that he speaketh unto you, O house of Israel."},{"num":2,"verse":"Thus saith the Lord, Learn not the way of the heathen, and be not afraid for the signs of heaven, though the heathen be afraid of such."},{"num":3,"verse":"For the customs of the people are vain: for one cutteth a tree out of the forest (which is the work of the hands of the carpenter) with the axe,"},{"num":4,"verse":"And another decketh it with silver, and with gold: they fasten it with nails and hammers that it fall not."},{"num":5,"verse":"The idols stand up as the palm tree, but speak not: they are borne because they cannot go: fear them not, for they cannot do evil, neither can they do good."},{"num":6,"verse":"There is none like unto thee, O Lord: thou art great, and thy Name is great in power."},{"num":7,"verse":"Who would not fear thee, O king of nations? for to thee appertaineth the dominion: for among all the wise men of the Gentiles, and in all their kingdoms there is none like thee."},{"num":8,"verse":"But altogether they dote, and are foolish: for the stock is a doctrine of vanity."},{"num":9,"verse":"Silver plates are brought from Tarshish, and gold from Uphaz, for the work of the workman, and the hands of the founder: the blue silk, and the purple is their clothing: all these things are made by cunning men."},{"num":10,"verse":"But the Lord is the God of truth: he is the living God, and an everlasting King: at his anger the earth shall tremble, and the nations cannot abide his wrath."},{"num":11,"verse":"(Thus shall you say unto them, The gods that have not made the heavens and the earth, shall perish from the earth, and from under these heavens.)"},{"num":12,"verse":"He hath made the earth by his power, and established the world by his wisdom, and hath stretched out the heaven by his discretion."},{"num":13,"verse":"He giveth by his voice the multitude of waters in the heaven, and he causeth the clouds to ascend from the ends of the earth: he turneth lightnings to rain, and bringeth forth the wind out of his treasures."},{"num":14,"verse":"Every man is a beast by his own knowledge: every founder is confounded by the graven image: for his melting is but falsehood, and there is no breath therein."},{"num":15,"verse":"They are vanity, and the work of errors: in the time of their visitation they shall perish."},{"num":16,"verse":"The portion of Jacob is not like them: for he is the maker of all things, and Israel is the rod of his inheritance: the Lord of hosts is his Name."},{"num":17,"verse":"¶ Gather up thy wares out of the land, O thou that dwellest in the strong place."},{"num":18,"verse":"For thus saith the Lord, Behold, at this time I will throw as with a sling the inhabitants of the land, and will trouble them, and they shall find it so."},{"num":19,"verse":"Woe is me for my destruction, and my grievous plague: but I thought, Yet it is my sorrow, and I will bear it."},{"num":20,"verse":"My Tabernacle is destroyed, and all my cords are broken: my children are gone from me, and are not: there is none to spread out my tent anymore, and to set up my curtains."},{"num":21,"verse":"For the Pastors are become beasts, and have not sought the Lord: therefore have they none understanding: and all the flocks of their pastures are scattered."},{"num":22,"verse":"Behold, the noise of the bruit is come, and a great commotion out of the North country, to make the cities of Judah desolate, and a den of dragons."},{"num":23,"verse":"O Lord, I know that the way of man is not in himself, neither is it in man to walk and to direct his steps."},{"num":24,"verse":"O Lord, correct me, but with judgment, not in thine anger, lest thou bring me to nothing."},{"num":25,"verse":"Pour out thy wrath upon the heathen that know thee not, and upon the families that call not on thy Name: for they have eaten up Jacob, and devoured him, and consumed him, and have made his habitation desolate."}]