[{"num":10,"verse":"Hear ye the word, O house of Israel, That Jehovah hath spoken for you."},{"num":2,"verse":"Thus said Jehovah: Unto the way of the nations accustom not yourselves, And by the signs of the heavens be not affrighted, For the nations are affrighted by them."},{"num":3,"verse":"For the statutes of the peoples are vanity, For a tree from a forest hath one cut, Work of the hands of an artificer, with an axe,"},{"num":4,"verse":"With silver and with gold they beautify it, With nails and with hammers they fix it, And it doth not stumble."},{"num":5,"verse":"As a palm they [are] stiff, and they speak not, They are surely borne, for they step not, Be not afraid of them, for they do no evil, Yea, also to do good is not in them."},{"num":6,"verse":"Because there is none like Thee, O Jehovah, Great [art] Thou, and great Thy name in might."},{"num":7,"verse":"Who doth not fear Thee, king of the nations? For to Thee it is becoming, For among all the wise of the nations, And in all their kingdom there is none like Thee."},{"num":8,"verse":"And in one they are brutish and foolish, An instruction of vanities [is] the tree itself."},{"num":9,"verse":"Spread-out silver from Tarshish is brought, And gold from Uphaz, Work of an artizan, and of the hands of a refiner, Blue and purple [is] their clothing, Work of the skilful -- all of them."},{"num":10,"verse":"And Jehovah [is] a God of truth, He [is] a living God, and a king age-during, From His wrath shake doth the earth, And nations endure not His indignation."},{"num":11,"verse":"Thus do ye say to them, The gods Who the heavens and earth have not made, They do perish from the earth, And from under these heavens."},{"num":12,"verse":"The maker of the earth by His power, The establisher of the world by His wisdom, Who, by His understanding, stretched forth the heavens,"},{"num":13,"verse":"At the voice He giveth forth, A multitude of waters [is] in the heavens, And He causeth vapours to come up from the end of the earth, Lightnings for rain He hath made, And bringeth out wind from His treasures."},{"num":14,"verse":"Brutish is every man by knowledge, Put to shame is every refiner by a graven image, For false [is] his molten image. And there is no breath in them."},{"num":15,"verse":"Vanity [are] they, work of erring ones, In the time of their inspection they perish."},{"num":16,"verse":"Not like these [is] the Portion of Jacob, For framer of all things [is] He, And Israel [is] the rod of His inheritance, Jehovah of Hosts [is] His name."},{"num":17,"verse":"Gather from the land thy merchandise, O dweller in the bulwark,"},{"num":18,"verse":"For thus said Jehovah: Lo, I am slinging out the inhabitants of the land at this time, And have been an adversary to them, So that they are found out."},{"num":19,"verse":"Wo to me for my breaking, Grievious hath been my smiting, And I said, Only, this [is] my sickness, and I bear it."},{"num":20,"verse":"My tent hath been spoiled, And all my cords have been broken, My sons have gone out from me, and they are not, There is none stretching out any more my tent, And raising up my curtains."},{"num":21,"verse":"For the shepherds have become brutish, And Jehovah they have not sought, Therefore they have not acted wisely, And all their flock is scattered."},{"num":22,"verse":"A voice of a report, lo, it hath come, Even a great shaking from the north country, To make the cities of Judah a desolation, A habitation of dragons."},{"num":23,"verse":"I have known, O Jehovah, that not of man [is] his way, Not of man the going and establishing of his step."},{"num":24,"verse":"Chastise me, O Jehovah, only in judgment, Not in Thine anger, lest Thou make me small."},{"num":25,"verse":"Pour out Thy fury on the nations that have not known Thee, And on the families that have not called in Thy name, For they have eaten up Jacob, Yea, they have eaten him up, yea, they consume him, And his habitation they have made desolate!"}]