[{"header":"Ananias and Sapphira"},{"num":5,"verse":"Now a man named Ananias, together with his wife Sapphira, sold a piece of property. "},{"num":2,"verse":"With his wife’s knowledge, he kept back part of the proceeds for himself. Then he brought a portion of it and laid it at the apostles’ feet."},{"num":3,"verse":"But Peter said, “Ananias, why has Satan filled your heart to lie to the Holy Spirit and to keep back part of the proceeds of the land? "},{"num":4,"verse":"Was it not yours before it was sold? And after it was sold, was not the money at your disposal? How could you plan such a thing in your heart? You have not lied to men but to God.”"},{"num":5,"verse":"When Ananias heard these words, he fell down and died. Great fear gripped everyone who heard about it. "},{"num":6,"verse":"The young men got up and wrapped up his body. Then they carried him out and buried him."},{"num":7,"verse":"About three hours later, his wife came in, not knowing what had happened. "},{"num":8,"verse":"Peter asked her, “Tell me, is this how much you got for the land?”"},{"num":9,"verse":"Then Peter said to her, “How could you two agree to test the Spirit of the Lord? Look! The feet of those who buried your husband are standing at the door, and they will carry you out too!”"},{"num":10,"verse":"Instantly she fell down at his feet and died. When the young men came in, they found her dead. Then they carried her outside and buried her beside her husband. "},{"num":11,"verse":"Great fear gripped the whole church and all who heard about these things."},{"header":"Many Miracles"},{"num":12,"verse":"Many signs and wonders were done among the people through the hands of the apostles. With one mind, they all continued meeting in Solomon’s Colonnade. "},{"num":13,"verse":"No one else dared to join them, but the people held them in high regard. "},{"num":14,"verse":"More and more believers in the Lord were added to their group, large numbers of both men and women. "},{"num":15,"verse":"As a result, people were even carrying the sick into the streets and laying them on cots and mats so that when Peter came by, at least his shadow might fall on some of them. "},{"num":16,"verse":"Crowds also gathered from the towns around Jerusalem, bringing the sick and those who were tormented by unclean spirits, and all of them were healed."},{"header":"On Trial Before the Sanhedrin"},{"num":17,"verse":"The high priest rose up, along with his associates (that is, the party of the Sadducees), because they were filled with envy. "},{"num":18,"verse":"They arrested the apostles and put them in the public prison. "},{"num":19,"verse":"But during the night an angel of the Lord opened the doors of the prison, brought them out, and said, "},{"num":20,"verse":"“Go, stand in the temple and keep on telling the people the whole message about this life.” "},{"num":21,"verse":"After they heard this, they entered the temple courts at daybreak and began to teach."},{"num":22,"verse":"But when the officers arrived, they did not find them in the prison. They returned and reported, "},{"num":23,"verse":"“We found the prison securely locked and the guards standing at the doors, but when we opened them, we found no one inside!” "},{"num":24,"verse":"When the captain of the temple guard and the chief priests heard these words, they were puzzled about them, wondering what could have happened."},{"num":25,"verse":"Then someone came and reported to them, “Look! The men you put in prison are standing in the temple courts and teaching the people.”"},{"num":26,"verse":"Then the captain went with the officers and brought the apostles in without force, because they were afraid that the people might stone them. "},{"num":27,"verse":"After they brought them in, they had them stand before the Sanhedrin. The high priest asked them, "},{"num":28,"verse":"“Did we not give you strict orders not to teach in this name? Look, you have filled Jerusalem with your teaching, and you are determined to bring this man’s blood down on us!”"},{"num":29,"verse":"But Peter and the apostles replied, “We must obey God rather than men. "},{"num":30,"verse":"The God of our fathers raised Jesus, whom you arrested and killed by hanging him on a cross. "},{"num":31,"verse":"God exalted him to his right hand as Prince and Savior, to give repentance to Israel and the forgiveness of sins. "},{"num":32,"verse":"We are witnesses of these things, and so is the Holy Spirit, whom God has given to those who obey him.”"},{"num":33,"verse":"When they heard this, they were furious and began making a plan to put them to death. "},{"num":34,"verse":"But a Pharisee named Gamaliel, a teacher of the law who was highly respected by all the people, stood up in the Sanhedrin and ordered that the men be put outside for a little while."},{"num":35,"verse":"Then he said to them, “Men of Israel, consider carefully what you are about to do with these men. "},{"num":36,"verse":"Some time ago Theudas rose up, claiming to be somebody, and a number of men, about four hundred, joined him. He was killed, all his followers were scattered, and it all came to nothing."},{"num":37,"verse":"“After him, Judas the Galilean rose up in the days of the census and led many people in a revolt. He also was killed, and all his followers were scattered."},{"num":38,"verse":"“So in the present case I tell you, keep away from these men and leave them alone! For if this plan or this undertaking is of human origin, it will fail. "},{"num":39,"verse":"But if it is from God, you will not be able to stop them. Perhaps you might even be found to be fighting against God!”"},{"num":40,"verse":"They were convinced by him. They summoned the apostles, beat them, ordered them not to speak in the name of Jesus, and let them go."},{"num":41,"verse":"The apostles left the Sanhedrin, rejoicing that they were considered worthy to suffer shame for the Name. "},{"num":42,"verse":"Every day, in the temple courts and from house to house, they never stopped teaching and proclaiming the good news that Jesus is the Christ."}]