[{"header":"Ananias and Sapphira"},{"num":5,"verse":"Now a man named Ananias, with his wife Sapphira, sold a piece of property. "},{"num":2,"verse":"He kept back part of the proceeds with his wife’s knowledge, and brought a part of it and placed it at the apostles’ feet."},{"num":3,"verse":"Then Peter said, “Ananias, why has Satan filled your heart to deceive the Holy Spirit and keep back part of the proceeds of the land? "},{"num":4,"verse":"While it remained unsold, was it not your own? And when it was sold, was it not under your authority? Why have you conceived this deed in your heart? You did not lie to men, but to God.”"},{"num":5,"verse":"On hearing these words, Ananias fell down and died. And great fear came on all those who heard these things. "},{"num":6,"verse":"The young men rose and wrapped him up and carried him out and buried him."},{"num":7,"verse":"About three hours later his wife came in, not knowing what had happened. "},{"num":8,"verse":"Peter said to her, “Tell me whether you sold the land for this amount?”"},{"num":9,"verse":"Peter said to her, “How is it that you have agreed together to test the Spirit of the Lord? Look! The feet of those who have buried your husband are at the door, and they will carry you out.”"},{"num":10,"verse":"At once she fell down at his feet and died. Upon entering, the young men found her dead and carried her out and buried her beside her husband. "},{"num":11,"verse":"Great fear came on the entire church and on all those who heard these things."},{"header":"Signs and Wonders"},{"num":12,"verse":"Many signs and wonders were performed among the people by the hands of the apostles. And they were all together in Solomon’s Porch. "},{"num":13,"verse":"No one else dared join them, but the people respected them. "},{"num":14,"verse":"Believers were increasingly added to the Lord, crowds of both men and women, "},{"num":15,"verse":"so that they even brought the sick out into the streets and placed them on beds and mats, that at least the shadow of Peter passing by might touch some of them. "},{"num":16,"verse":"Crowds also came out of the cities surrounding Jerusalem, bringing the sick and those who were afflicted by evil spirits, and they were all healed."},{"header":"Persecution of the Apostles"},{"num":17,"verse":"Then the high priest and all those who were with him (that is, the sect of the Sadducees) rose up and were filled with jealousy. "},{"num":18,"verse":"They seized the apostles and put them in the common prison. "},{"num":19,"verse":"But during the night an angel of the Lord opened the prison doors and led them out, and said, "},{"num":20,"verse":"“Go, stand and speak in the temple to the people all the words of this life.”"},{"num":21,"verse":"Having heard this, they entered the temple at dawn and taught."},{"num":22,"verse":"But when the officers came and did not find them in the prison, they returned and reported, "},{"num":23,"verse":"“We found the prison securely shut and the guards standing outside before the doors. But when we opened it, we found no one inside.” "},{"num":24,"verse":"Now when the high priest, the captain of the temple, and the chief priests heard these things, they were in doubt of what might become of this."},{"num":25,"verse":"Then one came and told them, “Look, the men whom you put in prison are standing in the temple and teaching the people.” "},{"num":26,"verse":"Then the captain with his escorts went and brought them, without force lest they should be stoned, for they feared the people."},{"num":27,"verse":"When they had brought them, they stood them before the Sanhedrin. And the high priest questioned them, "},{"num":28,"verse":"saying, “Did we not strictly command you not to teach in this name? Yet now you have filled Jerusalem with your teaching, and you intend to bring on us this Man’s blood.”"},{"num":29,"verse":"Peter and the other apostles answered, “We must obey God rather than men. "},{"num":30,"verse":"The God of our fathers raised Jesus, whom you killed by hanging on a tree. "},{"num":31,"verse":"God exalted this Man to His right hand to be a Ruler and a Savior, to give repentance to Israel and forgiveness of sins. "},{"num":32,"verse":"We are His witnesses to these words, as is the Holy Spirit whom God has given to those who obey Him.”"},{"num":33,"verse":"When they heard this, they were cut to the heart and took counsel to kill them. "},{"num":34,"verse":"But a Pharisee in the Sanhedrin named Gamaliel, a teacher of the law honored by all the people, stood and ordered the apostles to be put outside for a little while. "},{"num":35,"verse":"Then he said to them, “Men of Israel, take heed to yourselves what you intend to do concerning these men. "},{"num":36,"verse":"For in previous days Theudas rose up, boasting to be somebody, to whom a number of about four hundred men joined themselves. He was killed, and all who obeyed him were dispersed and came to nothing. "},{"num":37,"verse":"After Theudas, Judas the Galilean rose up in the days of the census and drew away many people after him. This man also perished, and all who obeyed him were scattered. "},{"num":38,"verse":"Now I tell you, keep away from these men and leave them alone, because if this intention or this activity is of men, it will come to nothing. "},{"num":39,"verse":"But if it is of God, you will not be able to overthrow them, lest perhaps you be found even fighting against God.”"},{"num":40,"verse":"They agreed with him. When they had called in the apostles, they beat them, and commanded them not to speak in the name of Jesus, and released them."},{"num":41,"verse":"Then they departed from the presence of the Sanhedrin, rejoicing that they were counted worthy to suffer shame for His name. "},{"num":42,"verse":"Daily, in the temple and from house to house, they did not cease to teach and preach Jesus Christ."}]