[{"num":5,"verse":"But a certain man named Ananias, with his wife Sapphira, sold a possession,"},{"num":2,"verse":"and embezzled part of the price (his wife also being aware of it) and brought a certain part and laid it down at the Apostles’ feet."},{"num":3,"verse":"Then Peter said, “Ananias, why has Satan filled your heart, that you should lie to the Holy Ghost, and embezzle part of the price of this possession?"},{"num":4,"verse":"“While it remained, was it not yours? And after it was sold, was it not under your authority? How is it that you have conceived this thing in your heart? You have not lied to man, but to God.”"},{"num":5,"verse":"Now when Ananias heard these words, he fell down, and gave up the ghost. Then great fear came on all those who heard these things."},{"num":6,"verse":"And the young men rose up, and picked him up, and carried him out and buried him."},{"num":7,"verse":"And it happened that about the space of three hours after, that his wife came in, ignorant of that which was done."},{"num":8,"verse":"And Peter said to her, “Tell me, did you sell the land for this much?” And she said, “Yes, for that much.”"},{"num":9,"verse":"Then Peter said to her, “Why have you agreed together to tempt the Spirit of the Lord? Behold, the feet of those who have buried your husband are at the door and shall carry you out.”"},{"num":10,"verse":"Then she immediately fell down at his feet and breathed her last. And the young men came in and found her dead, and carried her out, and buried her by her husband."},{"num":11,"verse":"And great fear came over all the church, and on all who heard these things."},{"num":12,"verse":"Thus, many signs and wonders were shown among the people by the hands of the Apostles. And they were all of one mind in Solomon’s porch."},{"num":13,"verse":"And of the rest, no one dared join them. Nevertheless, the people extolled them."},{"num":14,"verse":"Also, the number of those who believed in the Lord, both of men and women, grew more and more;"},{"num":15,"verse":"insomuch that they brought the sick into the streets, and laid them on beds and couches, so that at least the shadow of Peter might envelop some of them when he came by."},{"num":16,"verse":"Also, a multitude came into Jerusalem out of the surrounding cities (bringing sick folks and those who were possessed with unclean spirits) who were all healed."},{"num":17,"verse":"Then the High Priest, and all who were with him (which was the sect of the Sadducees), rose up and were full of indignation;"},{"num":18,"verse":"and laid hands on the Apostles and put them in the common prison."},{"num":19,"verse":"But the Angel of the Lord opened the prison doors by night, and brought them forth, and said,"},{"num":20,"verse":"“Go your way and stand in the Temple. And speak all the words of this life to the people.”"},{"num":21,"verse":"So when they heard it, they entered into the Temple early in the morning, and taught. And the High Priest came (and those who were with him), and called the Council together, and all the elders of the children of Israel, and sent word to the prison to have them brought."},{"num":22,"verse":"But when the officers came, and did not find them in the prison, they returned and told it,"},{"num":23,"verse":"saying, “Indeed we found the prison locked as securely as was possible, and the guards standing outside, in front of the doors. But when we had opened it, we found no one inside.”"},{"num":24,"verse":"Then, when the High Priest and the Captain of the Temple and the chief priests heard these things, they were in doubt of what would become of this."},{"num":25,"verse":"Then one came and reported to them, saying, “Behold, the men whom you put in prison are standing in the Temple, and teach the people.”"},{"num":26,"verse":"Then the captain went, with the officers, and brought them, without violence (for they feared that the people might stone them)."},{"num":27,"verse":"And when they had brought them, they set them before the Council, and the High Priest asked them,"},{"num":28,"verse":"saying, “Did we not directly command you not to teach in this Name? And behold, you have filled Jerusalem with your doctrine! And you intend to bring this Man’s blood upon us!”"},{"num":29,"verse":"Then Peter and the Apostles answered, and said, “We need to obey God rather than man."},{"num":30,"verse":"“The God of our fathers has raised up Jesus, Whom you killed, and hanged on a tree."},{"num":31,"verse":"“God has exalted Him, with His right hand, to be a Prince and a Savior; to give repentance to Israel, and forgiveness of sins."},{"num":32,"verse":"“And we are his witnesses concerning these things which we say; and the Holy Ghost, Whom God has given to those who obey Him.”"},{"num":33,"verse":"Now when they heard it, they were cut to the quick, and planned to kill them."},{"num":34,"verse":"Then a certain Pharisee named Gamaliel (a doctor of the Law, honored by all the people) stood up in the Council, and commanded to put the Apostles outside for a little while."},{"num":35,"verse":"And he said to them, “Men of Israel! Be careful what you intend to do regarding these men."},{"num":36,"verse":"For before these times, Theudas rose up, boasting himself to be somebody. Who was followed by a number of men (about four hundred) and who was killed. And all who obeyed him were scattered and came to nothing."},{"num":37,"verse":"“After this man, Judas of Galilee rose up, in the days of the census, and drew away many people after him. He also perished and all who obeyed him were scattered."},{"num":38,"verse":"“And now I say to you keep away from these men and let them alone. For if this counsel (or this work) is of man, it will come to nothing."},{"num":39,"verse":"“But if it be of God, you cannot destroy it. For you would be found fighting against God as well.”"},{"num":40,"verse":"And they agreed with him and called the Apostles. And after they had beaten them, they commanded that they should not speak in the Name of Jesus. And they let them go."},{"num":41,"verse":"So they departed from the Council, rejoicing that they were counted worthy to suffer rebuke for His Name."},{"num":42,"verse":"And they did not cease to teach and preach Jesus Christ daily in the Temple, and from house to house."}]