[{"num":3,"verse":"In en · de · ho those ekeinos days hēmera John Iōannēs the ho Baptist baptistēs began paraginomai his mission  in en the ho wilderness erēmos of ho Judea Ioudaia,  proclaiming kēryssō, "},{"num":2,"verse":"· kai “ Repent metanoeō,  for gar the ho kingdom basileia of ho heaven ouranos is  at  hand engizō. "},{"num":3,"verse":"For gar this houtos is eimi he ho who  was  spoken legō of  by dia Isaiah ēsaias the ho prophet prophētēs when  he  said legō, ‘The  voice phōnē of  one  crying boaō out  in en the ho wilderness erēmos:  Prepare hetoimazō the ho way hodos of  the  Lord kyrios;  make poieō his autos paths tribos straight.’”  · ho"},{"num":4,"verse":"Now de · ho John Iōannēs wore echō · ho clothing endyma made  of apo camel’ s kamēlos hair thrix,  with kai a  leather dermatinos belt zōnē about peri · ho his autos waist osphys;  · ho and de his autos food trophē was eimi locusts akris and kai wild agrios honey meli. "},{"num":5,"verse":"At  that  time tote people  were  going ekporeuomai out  to pros him autos from  Jerusalem Hierosolyma and kai all pas · ho Judea Ioudaia and kai all pas the ho region perichōros along  the ho Jordan Iordanēs, "},{"num":6,"verse":"and kai they  were  being  baptized baptizō by hypo him autos in en the ho Jordan Iordanēs River potamos,  confessing exomologeomai · ho their autos sins hamartia. "},{"num":7,"verse":"But de when he saw  many polys of  the ho Pharisees Pharisaios and kai Sadducees Saddoukaios coming erchomai for epi · ho baptism baptisma,  he  said legō to  them autos, “ You  brood gennēma of  vipers echidna!  Who tis warned hypodeiknymi you hymeis to  flee pheugō from apo the ho coming mellō wrath orgē? "},{"num":8,"verse":"Therefore oun bear poieō fruit karpos worthy axios of ho repentance metanoia, "},{"num":9,"verse":"and kai do  not mē presume dokeō you  can  say legō to en yourselves heautou, ‘ We  have echō · ho Abraham Abraam as our  father patēr’;  for gar I  say legō to  you hymeis that hoti God theos is  able dynamai · ho from ek · ho these houtos stones lithos to  raise egeirō up  children teknon to ho Abraham Abraam. "},{"num":10,"verse":"Even de now ēdē the ho axe axinē is  lying keimai at pros the ho root rhiza of  the ho trees dendron;  so oun any pas tree dendron that  does  not mē bear poieō good kalos fruit karpos will  be  cut ekkoptō down  and kai thrown ballō into eis the  fire pyr. "},{"num":11,"verse":"“ I egō baptize baptizō you hymeis with en water hydōr for eis repentance metanoia,  but de the ho one  who  comes erchomai after opisō me egō is eimi greater ischuros than  I egō— I  am eimi not ou worthy hikanos even  to  remove bastazō his hos · ho sandals hypodēma.  He autos will  baptize baptizō you hymeis with en the  Holy hagios Spirit pneuma and kai with  fire pyr. "},{"num":12,"verse":"His hos · ho winnowing  fork ptyon is  in en · ho his autos hand cheir,  and kai he  will  clean diakatharizō out  · ho his autos threshing halōn floor  and kai gather synagō · ho his autos wheat sitos into eis the ho barn apothēkē;  but de the ho chaff achuron he  will  burn katakaiō up  with  unquenchable asbestos fire pyr.” "},{"num":13,"verse":"Then tote Jesus Iēsous came paraginomai · ho from apo · ho Galilee Galilaia to pros John Iōannēs at epi the ho Jordan Iordanēs river  · ho · ho to  be  baptized baptizō by hypo him autos. "},{"num":14,"verse":"· ho But de John Iōannēs tried diakōlyō to  prevent  him autos,  saying legō, “ I egō need chreia echō to  be  baptized baptizō by hypo you sy,  and kai yet  do  you sy come erchomai to pros me egō?” "},{"num":15,"verse":"But de Jesus Iēsous answered apokrinomai · ho him autos, “ Let aphiēmi it  be  so  now arti;  for gar in  this  way houtōs it  is eimi fitting prepō for  us hēmeis to  fulfill plēroō all pas righteousness dikaiosynē.”  Then tote he  allowed aphiēmi him autos. "},{"num":16,"verse":"And de when  Jesus Iēsous was  baptized baptizō,  · ho just as  he  was  coming anabainō up  from apo the ho water hydōr,  · kai the ho heavens ouranos were  opened anoigō,  and kai he saw  the ho Spirit pneuma of ho God theos descending katabainō like hōsei a  dove peristera and kai lighting erchomai on epi him autos. "},{"num":17,"verse":"And kai a  voice phōnē from ek · ho heaven ouranos said legō, “ This houtos is eimi · ho my egō Son hyios,  the ho Beloved agapētos,  in en whom hos I  delight eudokeō.” "}]