[{"header":"Pray for Us"},{"num":3,"verse":"Finally, brothers, pray for us so that the word of the Lord may spread quickly and be glorified just as it was among you. "},{"num":2,"verse":"Pray also that we may be rescued from evil and wicked people. For not everyone has faith. "},{"num":3,"verse":"Still, the Lord is faithful. He will establish you and protect you from the Evil One. "},{"num":4,"verse":"We also have confidence in the Lord concerning you, that you are doing and will continue to do what we are telling you. "},{"num":5,"verse":"May the Lord continue to direct your hearts to God’s love and Christ’s patient endurance."},{"header":"Warnings Against Idleness"},{"num":6,"verse":"We instruct you, brothers, in the name of our Lord Jesus Christ, to avoid every brother who is walking idly and not in accordance with the teaching that you received from us. "},{"num":7,"verse":"In fact, you yourselves know how necessary it is for you to imitate us, because we were not idle among you. "},{"num":8,"verse":"We never ate anyone’s bread without paying for it. Instead, with labor and hardship we worked night and day, so that we would not be a burden to any of you. "},{"num":9,"verse":"This was not because we lacked authority, but to provide an example for you to imitate. "},{"num":10,"verse":"In fact, when we were with you, this was our command to you: If anyone does not want to work, he should not eat. "},{"num":11,"verse":"Indeed, we hear that some among you are idle, not busy working, but being busybodies. "},{"num":12,"verse":"In the Lord Jesus Christ, we command and urge these people to work quietly and eat their own bread."},{"num":13,"verse":"But you, brothers, do not grow weary of doing good. "},{"num":14,"verse":"And if anyone does not obey our word in this letter, take note of him so that you do not associate with him, in order that he may be put to shame. "},{"num":15,"verse":"Yet do not consider him an enemy, but admonish him as a brother."},{"header":"Benediction"},{"num":16,"verse":"May the Lord of peace himself give you peace at all times and in every way. The Lord be with you all."},{"num":17,"verse":"This greeting is written by me, Paul, with my own hand. This is a distinguishing sign of how I write in every letter."},{"num":18,"verse":"The grace of our Lord Jesus Christ be with you all."}]