[{"num":3,"verse":"My brothers, please talk to God about us. Ask God that the Lord's message may reach many people quickly and that they may receive it gladly as you did."},{"num":2,"verse":"Ask God that we may be saved from bad people who do wrong things. Not everyone believes in Christ."},{"num":3,"verse":"But the Lord can be trusted. He will make you strong. He will keep you safe from all that is wrong."},{"num":4,"verse":"The Lord makes us feel sure about you. We are sure that you are doing, and will do, what we tell you to do."},{"num":5,"verse":"May the Lord lead you to love God and be patient like Christ."},{"num":6,"verse":"Now, my brothers, we tell you to do this in the name of the Lord Jesus Christ. Have nothing to do with any lazy brother who is not living the way we taught you."},{"num":7,"verse":"You yourselves know how you should be like us. We were not lazy when we were with you."},{"num":8,"verse":"We did not eat anyone's food without paying for it. But we worked very hard day and night because we did not want to trouble any one of you."},{"num":9,"verse":"We have the right to be helped. But we wanted to show you what you should do in this matter."},{"num":10,"verse":"Even when we were with you, we told you this, `If any man will not work, do not let him eat.'"},{"num":11,"verse":"We hear that some of you are lazy. You do not work, but you trouble other people."},{"num":12,"verse":"We say to such lazy people, in the name of the Lord Jesus Christ, `Do your work quietly. Earn your own food.'"},{"num":13,"verse":"My brothers, do not get tired of doing what is good."},{"num":14,"verse":"If any one will not obey what we say in this letter, look at that man and remember him. Have nothing to do with him, so that he will be ashamed."},{"num":15,"verse":"Do not treat him like an enemy. Tell him, as you would tell a brother, what he should do."},{"num":16,"verse":"The Lord gives peace. May he give his peace to you at all times in every way. May the Lord be with you all."},{"num":17,"verse":"I, Paul, write these words of greeting with my own hand. This is the sign in all my letters that I wrote them."},{"num":18,"verse":"The loving kindness of our Lord Jesus Christ be with you all."}]