[{"header":"Unity with Christ"},{"num":4,"verse":"As a prisoner of the Lord, I beg you to live in a way that is worthy of the people God has chosen to be his own. "},{"num":2,"verse":"Always be humble and gentle. Patiently put up with each other and love each other. "},{"num":3,"verse":"Try your best to let God’s Spirit keep your hearts united. Do this by living at peace. "},{"num":4,"verse":"All of you are part of the same body. There is only one Spirit of God, just as you were given one hope when you were chosen to be God’s people. "},{"num":5,"verse":"We have only one Lord, one faith, and one baptism. "},{"num":6,"verse":"There is one God who is the Father of all people. Not only is God above all others, but he works by using all of us, and he lives in all of us."},{"num":7,"verse":"Christ has generously divided out his gifts to us. "},{"num":8,"verse":"As the Scriptures say,"},{"num":9,"verse":"When it says, “he went up,” it means that Christ had been deep in the earth. "},{"num":10,"verse":"This also means that the one who went deep into the earth is the same one who went into the highest heaven, so that he would fill the whole universe."},{"num":11,"verse":"Christ chose some of us to be apostles, prophets, missionaries, pastors, and teachers, "},{"num":12,"verse":"so that his people would learn to serve and his body would grow strong. "},{"num":13,"verse":"This will continue until we are united by our faith and by our understanding of the Son of God. Then we will be mature, just as Christ is, and we will be completely like him."},{"num":14,"verse":"We must stop acting like children. We must not let deceitful people trick us by their false teachings, which are like winds that toss us around from place to place. "},{"num":15,"verse":"Love should always make us tell the truth. Then we will grow in every way and be more like Christ, the head "},{"num":16,"verse":"of the body. Christ holds it together and makes all of its parts work perfectly, as it grows and becomes strong because of love."},{"header":"The Old Life and the New Life"},{"num":17,"verse":"As a follower of the Lord, I order you to stop living like stupid, godless people. "},{"num":18,"verse":"Their minds are in the dark, and they are stubborn and ignorant and have missed out on the life that comes from God. They no longer have any feelings about what is right, "},{"num":19,"verse":"and they are so greedy that they do all kinds of indecent things."},{"num":20,"verse":"But that isn’t what you were taught about Jesus Christ. He is the truth, and you heard about him and learned about him. "},{"num":22,"verse":"You were told that your foolish desires will destroy you and that you must give up your old way of life with all its bad habits. "},{"num":23,"verse":"Let the Spirit change your way of thinking "},{"num":24,"verse":"and make you into a new person. You were created to be like God, and so you must please him and be truly holy."},{"header":"Rules for the New Life"},{"num":25,"verse":"We are part of the same body. Stop lying and start telling each other the truth. "},{"num":26,"verse":"Don’t get so angry that you sin. Don’t go to bed angry "},{"num":27,"verse":"and don’t give the devil a chance."},{"num":28,"verse":"If you are a thief, quit stealing. Be honest and work hard, so you will have something to give to people in need."},{"num":29,"verse":"Stop all your dirty talk. Say the right thing at the right time and help others by what you say."},{"num":30,"verse":"Don’t make God’s Spirit sad. The Spirit makes you sure that someday you will be free from your sins."},{"num":31,"verse":"Stop being bitter and angry and mad at others. Don’t yell at one another or curse each other or ever be rude. "},{"num":32,"verse":"Instead, be kind and merciful, and forgive others, just as God forgave you because of Christ."}]