[{"num":4,"verse":"These three last Chapters contain precepts of manners. 1 He exhorteth them to mutual love. 7 Sundry gifts are therefore bestowed of God, 16 that the Church may be built up. 18 He calleth them from the vanity of infidels, 25 from lying, 29 and from filthy talk."},{"num":1,"verse":"I therefore, being prisoner in the Lord, pray you that ye walk worthy of the vocation whereunto ye are called,"},{"num":2,"verse":"With all humbleness of mind, and meekness, with long suffering, supporting one another through love,"},{"num":3,"verse":"Endeavoring to keep the unity of the Spirit in the bond of peace."},{"num":4,"verse":"There is one body, and one Spirit, even as ye are called in one hope of your vocation."},{"num":5,"verse":"There is one Lord, one Faith, one Baptism."},{"num":6,"verse":"One God and Father of all, which is above all, and through all, and in you all."},{"num":7,"verse":"But unto every one of us is given grace according to the measure of the gift of Christ."},{"num":8,"verse":"Wherefore he saith, When he ascended upon high, he led captivity captive, and gave gifts unto men."},{"num":9,"verse":"(Now, in that he ascended, what is it but that he had also descended first into the lowest parts of the earth?"},{"num":10,"verse":"He that descended, is even the same that ascended, far above all heavens, that he might fill all things.)"},{"num":11,"verse":"He therefore gave some to be Apostles, and some Prophets, and some Evangelists, and some Pastors, and Teachers,"},{"num":12,"verse":"For the repairing of the Saints, for the work of the ministry, and for the edification of the body of Christ,"},{"num":13,"verse":"Till we all meet together (in the unity of faith and that acknowledging of the Son of God) unto a perfect man, and unto the measure of the age the fullness of Christ,"},{"num":14,"verse":"That we henceforth be no more children, wavering and carried about with every wind of doctrine, by the deceit of men, and with craftiness, whereby they lay in wait to deceive."},{"num":15,"verse":"But let us follow the truth in love, and in all things, grow up into him, which is the head, that is, Christ."},{"num":16,"verse":"By whom all the body being coupled and knit together by every joint, for the furniture thereof (according to the effectual power, which is in the measure of every part) receiveth increase of the body, unto the edifying of itself in love."},{"num":17,"verse":"This I say therefore and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in vanity of their mind."},{"num":18,"verse":"Having their understanding darkened, and being strangers from the life of God through the ignorance that is in them, because of the hardness of their heart:"},{"num":19,"verse":"Which being past feeling, have given themselves unto wantonness, to work all uncleanness, even with greediness."},{"num":20,"verse":"But ye have not so learned Christ,"},{"num":21,"verse":"If so be ye have heard him, and have been taught by him, as the truth is in Jesus,"},{"num":22,"verse":"That is, that ye cast off, concerning the conversation in time past, that old man, which is corrupt through the deceivable lusts,"},{"num":23,"verse":"And be renewed in the spirit of your mind,"},{"num":24,"verse":"And put on the new man, which after God is created unto righteousness, and true holiness."},{"num":25,"verse":"Wherefore cast off lying, and speak every man truth unto his neighbor: for we are members one of another."},{"num":26,"verse":"Be angry, but sin not: let not the sun go down upon your wrath,"},{"num":27,"verse":"Neither give place to the devil."},{"num":28,"verse":"Let him that stole, steal no more: but let him rather labor, and work with his hands the thing which is good, that he may have to give unto him that needeth."},{"num":29,"verse":"Let no corrupt communication proceed out of your mouths: but that which is good to the use of edifying, that it may minister grace unto the hearers."},{"num":30,"verse":"And grieve not the holy Spirit of God, by whom ye are sealed unto the day of redemption."},{"num":31,"verse":"Let all bitterness, and anger, and wrath, crying, and evil speaking be put away from you, with all maliciousness."},{"num":32,"verse":"Be ye courteous one to another, and tender hearted, freely forgiving one another, even as God for Christ’s sake, freely forgave you."}]