[{"num":4,"verse":"Therefore I impart chizzuk (strengthening) to you, I, the prisoner of Rebbe, Melech HaMoshiach Adoneinu, and I admonish you to walk and fier zich (comport oneself) in your derech in a manner worthy of the kri’ah by which you were called,"},{"num":2,"verse":"With all anavah (humility) of mind and meekness, with savlanut (longsuffering), showing forbearance to one another in ahavah,"},{"num":3,"verse":"Being eager to keep the achdus (unity) of the Ruach Hakodesh in the uniting bond of shalom;"},{"num":4,"verse":"As there is one guf (body) [Gn 47:18; Ps 16:9-10; Job 19:25-27; Isa 53:11] and one Ruach Hakodesh, as also you were called in one tikvah (hope) of your kri’ah:"},{"num":5,"verse":"Adon echad, emunah achat, tevilah achat,"},{"num":6,"verse":"One G-d and Avi khol (Father of all), who is over all and through all and in all. [DEVARIM 6:4; ZECHARYAH 14:9]"},{"num":7,"verse":"But to each of us was given the Chen v’Chesed Hashem according to the measure of the Matnat HaMoshiach."},{"num":8,"verse":"Therefore it says, ALITA LAMMAROM SHAVITA SHEVI LAKACHTA MATANOT (\"You ascended to the height, you led captive, you received gifts\" TEHILLIM 68:19 [18]), He has led captive a host of captives, He had brought matanot (gifts) to Bnei Adam."},{"num":9,"verse":"Now if He \"ASCENDED\" what can it mean except that also He descended into the lower parts of ha’aretz?"},{"num":10,"verse":"The one who descended is Himself also the one having ascended far above all the Shomayim, that He might fill all things. [MISHLE 30:1-4]"},{"num":11,"verse":"And He gave some to be shlichim, and some nevi’im, and some gifted to be used in Kiruv efforts for Rebbe, Melech HaMoshiach, and some supervising mashgichim ruchaniyim (spiritual overseers) who are ro’im and morim in the Kehillah,"},{"num":12,"verse":"For the equipping of the Kadoshim for the work of avodas kodesh ministry, to the building up of HaGuf HaMoshiach"},{"num":13,"verse":"Until we all attain to the achdus (unity) of the emunah and to the da’as (knowledge) of the Ben HaElohim, to the Bnei Chayil maturity, to the measure of the stature of the melo (plentitude) of Moshiach."},{"num":14,"verse":"In this way, we are no longer olalim (infants) tossed by waves and carried around by every wind of limmud (instruction), by the cunning of Bnei Adam, with craftiness leading to the scheming of remiyah (deceit) and madduchei shav (delusion); [YESHAYAH 57:20]"},{"num":15,"verse":"But telling HaEmes in ahavah, let us grow up in every respect unto Him who is the Rosh, Moshiach,"},{"num":16,"verse":"From whom all HaGuf HaMoshiach being fitly joined together and being united in an agudah binding by that which every joint contributes according as each part’s proper working process promotes the growth of HaGuf HaMoshiach in building itself up in ahavah."},{"num":17,"verse":"This therefore I say and give solemn edut in Rebbe, Melech HaMoshiach Adoneinu: no longer are you to fier zich (comport oneself) in your derech as also the Goyim walk, in the futility of their machshavot (thoughts),"},{"num":18,"verse":"Their binah (understanding) being in choshech, having been alienated from the life of Hashem because of the ignorance existing in them, because of the KESHI (stubbornness, hardness DEVARIM 9:27) of their levavot, [DEVARIM 29:4]"},{"num":19,"verse":"Who, having put away remorse, gave themselves over to zimah (lewdness) for the practice of every kind of tumah (uncleanness) with chamdanut (covetousness)."},{"num":20,"verse":"But you did not so have lernen of Rebbe, Melech HaMoshiach,"},{"num":21,"verse":"If indeed you heard about Him and took shiurim in Him, as HaEmes is in Yehoshua."},{"num":22,"verse":"For the torah you received was that you must disrobe from your former derech of your old self, the one being corrupted according to the ta’avot of AKOV [deceitful, YIRMEYAH 17:9] remiyah (guile)"},{"num":23,"verse":"And to be renewed by the Ruach Hakodesh controlling your machshavot (thoughts)"},{"num":24,"verse":"And to enrobe yourself in the Adam HeChadash (the new Man, humanity) having been created according to the demut Hashem in tzidkat Eloheinu and in the kedushah of HaEmes."},{"num":25,"verse":"Therefore, disrobed from Sheker (Falsehood, Lying], let us speak HaEmes [ZECHARYAH 8:16], each one with his re’a (neighbor), because we are evarim (members) one of another. [Ps 15:2; Lev 19:11]"},{"num":26,"verse":"Have ka’as and do not sin; do not let the shemesh go down on your anger. [TEHILLIM 4:4]"},{"num":27,"verse":"Do not give opportunity to Hasatan."},{"num":28,"verse":"Let the one stealing no longer be a ganav, but rather let the ganav get a parnasah (livelihood) and toil with his own hands at something beneficial, that he may have something to share with the one who is nitzrach (needy)."},{"num":29,"verse":"Let no lashon hora proceed out of your peh, but only a dvar that is tov, for edification in accordance with the need, that it may mediate Chen v’Chesed Hashem to the ones hearing."},{"num":30,"verse":"And do not grieve the Ruach Hakodesh of Hashem, by whom you were sealed for the Yom HaGeulah. [YESHAYAH 63:10]"},{"num":31,"verse":"Let all merirut lev (bitterness) and ka’as and wrath and clamor and lashon hora be removed from you, with all resha."},{"num":32,"verse":"And have Chen v’Chesed graciousness with one another. Be kind, tenderhearted, forgiving each other, as also Hashem in Rebbe, Melech HaMoshiach forgave you."}]