[{"num":3,"verse":"1 He rebuketh them, for suffering themselves to be drawn from the grace of free justification in Christ, most lively set out unto them. 6 He bringeth in Abraham’s example, 10 declaring the effects, 21 and causes of the giving of the Law."},{"num":1,"verse":"O foolish Galatians, who hath bewitched you, that ye should not obey the truth, to whom Jesus Christ before was described in your sight, and among you crucified?"},{"num":2,"verse":"This only would I learn of you, Received ye the Spirit by the works of the Law, or by the hearing of faith preached?"},{"num":3,"verse":"Are ye so foolish, that after ye have begun in the Spirit, ye would now be made perfect by the flesh?"},{"num":4,"verse":"Have ye suffered so many things in vain? if so be it be even in vain."},{"num":5,"verse":"He therefore that ministereth to you the Spirit, and worketh miracles among you, doeth he it through the works of the Law, or by the hearing of faith preached?"},{"num":6,"verse":"Yea rather as Abraham believed God, and it was imputed to him for righteousness."},{"num":7,"verse":"Know ye therefore, that they which are of faith, the same are the children of Abraham."},{"num":8,"verse":"For the Scripture foreseeing, that God would justify the Gentiles through faith, preached before the Gospel unto Abraham, saying, In thee shall all the Gentiles be blessed."},{"num":9,"verse":"So then they which be of faith, are blessed with faithful Abraham."},{"num":10,"verse":"For as many as are of the works of the Law, are under the curse: For it is written, Cursed is every man that continueth not in all things, which are written in the book of the Law, to do them."},{"num":11,"verse":"And that no man is justified by the Law in the sight of God, it is evident: for the just shall live by faith."},{"num":12,"verse":"And the Law is not of faith: but the man that shall do those things, shall live in them."},{"num":13,"verse":"Christ hath redeemed us from the curse of the Law, made a curse for us, (for it is written, Cursed is everyone that hangeth on tree.)"},{"num":14,"verse":"That the blessing of Abraham might come on the Gentiles through Christ Jesus, that we might receive the promise of the Spirit through faith."},{"num":15,"verse":"Brethren, I speak as men do: though it be but a man’s covenant, when it is confirmed, yet no man doth abrogate it, or addeth anything thereto,"},{"num":16,"verse":"Now to Abraham and his seed were the promises made. He saith not, and to the seeds, as speaking of many: but, And to thy seed, as of one, which is Christ."},{"num":17,"verse":"And this I say, that the covenant that was confirmed afore of God in respect of Christ, the Law which was four hundred and thirty years after, cannot disannul, that it should make the promise of none effect."},{"num":18,"verse":"For if the inheritance be of the Law, it is no more by the promise, but God gave it freely unto Abraham by promise."},{"num":19,"verse":"Wherefore then serveth the Law? It was added because of the transgressions, till the seed came, unto the which the promise was made: and it was ordained by Angels in the hand of a Mediator."},{"num":20,"verse":"Now a Mediator is not a Mediator of one: but God is one."},{"num":21,"verse":"Is the Law then against the promises of God? God forbid: For if there had been a Law given which could have given life, surely righteousness should have been by the Law."},{"num":22,"verse":"But the Scripture hath concluded all under sin, that the promise by the faith of Jesus Christ should be given to them that believe."},{"num":23,"verse":"But before faith came, we were kept under the Law, as under a garrison, and shut up unto that faith, which should afterward be revealed."},{"num":24,"verse":"Wherefore the Law was our schoolmaster to bring us to Christ, that we might be made righteous by faith."},{"num":25,"verse":"But after that faith is come, we are no longer under a schoolmaster."},{"num":26,"verse":"For ye are all the sons of God by faith, in Christ Jesus."},{"num":27,"verse":"For all ye that are baptized into Christ, have put on Christ."},{"num":28,"verse":"There is neither Jew nor Grecian: there is neither bond nor free: there is neither male nor female: for ye are all one in Christ Jesus."},{"num":29,"verse":"And if ye be Christ’s, then are ye Abraham’s seed, and heirs by promise."}]