[{"num":3,"verse":"You foolish Galatians! What strange powers are trying to lead you from the way of faith in Christ? We made it plain for you to see that Jesus Christ was put on a cross to die. "},{"num":2,"verse":"There is one thing I want to know. Did you receive the Holy Spirit by keeping the Law? Or did you receive Him by hearing about Christ? "},{"num":3,"verse":"How foolish can you be? You started the Christian life by the Holy Spirit. Do you think you are going to become better Christians by your old way of worship? "},{"num":4,"verse":"You suffered so much because of the Good News you received. Was this all of no use? "},{"num":5,"verse":"He gave you the Holy Spirit and did powerful works among you. Does He do it because you do what the Law says or because you hear and believe the truth?"},{"num":6,"verse":"It was the same with Abraham. He put his trust in God. This made Abraham right with God. "},{"num":7,"verse":"Be sure to remember that all men who put their trust in God are the sons of Abraham. "},{"num":8,"verse":"The Holy Writings said long ago that God would save the people who are not Jews from the punishment of sin also. Before this time the Holy Writings gave the Good News to Abraham in these words, “All nations will be happy because of you.”  "},{"num":9,"verse":"So then, all those who have faith will be happy, along with Abraham who had faith."},{"num":10,"verse":"All those who expect the Law to save them from the punishment of sin will be punished. Because it is written, “Everyone who does not keep on doing all the things written in the Book of the Law will be punished.”  "},{"num":11,"verse":"No one is made right with God by doing what the Law says. For, “The man right with God will live by faith.”  "},{"num":12,"verse":"The Law does not use faith. It says, “You must obey all the Law or you will die.”  "},{"num":13,"verse":"Christ bought us with His blood and made us free from the Law. In that way, the Law could not punish us. Christ did this by carrying the load and by being punished instead of us. It is written, “Anyone who hangs on a cross is hated and punished.”  "},{"num":14,"verse":"Because of the price Christ Jesus paid, the good things that came to Abraham might come to the people who are not Jews. And by putting our trust in Christ, we receive the Holy Spirit He has promised."},{"num":15,"verse":"Christian brothers, let me show you what this means. If two men agree to something and sign their names on a paper promising to stay true to what they agree, it cannot be changed. "},{"num":16,"verse":"Now the promise was made to Abraham and to his son. He does not say, “And to sons,” speaking of many. But instead, “And to your Son,” which means Christ. "},{"num":17,"verse":"This is what I am saying: The Law which came 430 years later could not change the promise. The promise had already been made by God. The Law could not put that promise aside. "},{"num":18,"verse":"If it had been possible to be saved from the punishment of sin by obeying the Law, the promise God gave Abraham would be worth nothing. But since it is not possible to be saved by obeying the Law, the promise God gave Abraham is worth everything."},{"num":19,"verse":"Then why do we have the Law? It was given because of sin. It was to be used until Christ came. The promise had been made looking toward Christ. The Law was given by angels through Moses who stood between God and man. "},{"num":20,"verse":"But when the promise was given to Abraham, God gave it without anyone standing between them. "},{"num":21,"verse":"Is the Law against the promise of God? No! Never! If it had been possible to be saved from the punishment of sin by obeying the Law, then being right with God would have come by obeying the Law. "},{"num":22,"verse":"But the Holy Writings say that all men are guilty of sin. Then that which was promised might be given to those who put their trust in Christ. It will be because their faith is in Him."},{"num":23,"verse":"Before it was possible to be saved from the punishment of sin by putting our trust in Christ, we were held under the Law. It was as if we were being kept in prison. We were kept this way until Christ came. "},{"num":24,"verse":"The Law was used to lead us to Christ. It was our teacher, and so we were made right with God by putting our trust in Christ. "},{"num":25,"verse":"Now that our faith is in Christ, we do not need the Law to lead us. "},{"num":26,"verse":"You are now children of God because you have put your trust in Christ Jesus. "},{"num":27,"verse":"All of you who have been baptized to show you belong to Christ have become like Christ. "},{"num":28,"verse":"God does not see you as a Jew or as a Greek. He does not see you as a servant or as a person free to work. He does not see you as a man or as a woman. You are all one in Christ. "},{"num":29,"verse":"If you belong to Christ, then you have become the true children of Abraham. What God promised to him is now yours."}]