[{"num":18,"verse":"Some time afterwards, David attacked the P’lishtim and subdued them; David took Gat and its villages out of the hands of the P’lishtim. "},{"num":2,"verse":"He also defeated Mo’av, so that the people of Mo’av became subjects of David and paid tribute."},{"num":3,"verse":"David, on his way to establish his dominion as far as the Euphrates River, also defeated Hadar‘ezer king of Tzovah near Hamat. "},{"num":4,"verse":"David captured 1,000 chariots, 7,000 horsemen and 20,000 foot soldiers. He reserved enough horses for 100 chariots and disabled the rest. "},{"num":5,"verse":"When the people of Aram from Dammesek came to the aid of Hadar‘ezer king of Tzovah, David killed 22,000 men of Aram. "},{"num":6,"verse":"Then David put [garrisons] among the people of Aram in Dammesek; Aram became subject to David and paid tribute. Adonai gave victory to David wherever he went."},{"num":7,"verse":"David took the gold shields which Hadar‘ezer’s servants were wearing and brought them to Yerushalayim. "},{"num":8,"verse":"From Tivchat and Kun, cities of Hadar‘ezer, King David took a great quantity of bronze, which Shlomo used to make the bronze “Sea,” the columns and various bronze articles."},{"num":9,"verse":"When To‘u king of Hamat heard that David had defeated the entire army of Hadar‘ezer king of Tzovah, "},{"num":10,"verse":"he sent Hadoram his son to King David to greet and congratulate him on fighting and defeating Hadar‘ezer — for Hadar‘ezer had been at war with To‘u — and [he sent] all kinds of articles made of silver, gold and bronze, "},{"num":11,"verse":"which King David dedicated to Adonai, along with the silver and gold that he had carried off from all the nations — from Edom, Mo’av, the people of ‘Amon, the P’lishtim and ‘Amalek. "},{"num":12,"verse":"Moreover, Avishai the son of Tz’ruyah killed 18,000 men from Edom in the Salt Valley. "},{"num":13,"verse":"David stationed garrisons in Edom, and all the people of Edom became subject to him. Adonai gave victory to David wherever he went."},{"num":14,"verse":"David ruled over all Isra’el; he administered law and justice for all his people. "},{"num":15,"verse":"Yo’av the son of Tz’ruyah was commander of the army, Y’hoshafat the son of Achilud was chief adviser, "},{"num":16,"verse":"Tzadok the son of Achituv and Avimelekh the son of Evyatar were cohanim, Shavsha was secretary, "},{"num":17,"verse":"B’nayahu the son of Y’hoyada was in charge of the K’reti and P’leti [serving as the king’s bodyguards], and David’s sons were the king’s chief personal advisers."}]