[[],[{"type":"header","content":"David Fights"},{"type":"prose","content":"In the days that followed, David struck hard at the Philistines, bringing them to their knees, captured Gath, and took control of the surrounding countryside."}],[{"type":"prose","content":"He also fought and defeated Moab. The Moabites came under David’s rule and paid regular tribute."}],[{"type":"prose","content":"On his way to restore his sovereignty at the Euphrates River, David defeated Hadadezer king of Zobah (over toward Hamath). David captured a thousand chariots, seven thousand cavalry, and twenty thousand infantry from him. He hamstrung all the chariot horses, but saved back a hundred."}],[{"type":"prose","content":"When the Arameans from Damascus came to the aid of Hadadezer king of Zobah, David killed twenty-two thousand of them. David set up a puppet government in Aram-Damascus. The Arameans became subjects of David and were forced to bring tribute.  gave victory to David wherever he marched."}],[{"type":"prose","content":"David plundered the gold shields that belonged to the servants of Hadadezer and brought them to Jerusalem. He also looted Tebah and Cun, cities of Hadadezer, of a huge quantity of bronze that Solomon later used to make the Great Bronze Sea, the Pillars, and bronze equipment in The Temple."}],[{"type":"prose","content":"Tou king of Hamath heard that David had struck down the entire army of Hadadezer king of Zobah. He sent his son Hadoram to King David to greet and congratulate him for fighting and defeating Hadadezer. Tou and Hadadezer were old enemies. Hadoram brought David various things made of silver, gold, and bronze. King David consecrated these things along with the silver and gold that he had plundered from other nations: Edom, Moab, the Ammonites, the Philistines, and Amalek."}],[{"type":"prose","content":"Abishai son of Zeruiah fought and defeated the Edomites in the Valley of Salt—eighteen thousand of them. He set up a puppet government in Edom and the Edomites became subjects under David. gave David victory wherever he marched.* * *"}],[{"type":"prose","content":"Thus David ruled over all of Israel. He ruled well, fair and evenhanded in all his duties and relationships.Joab son of Zeruiah was head of the army;Jehoshaphat son of Ahilud was in charge of public records;Zadok son of Ahitub and Abimelech son of Abiathar were priests;Shavsha was secretary;Benaiah son of Jehoiada was over the special forces, the Kerethites and Pelethites;And David’s sons held high positions, close to the king.* * *"}]]