[[],[{"type":"header","content":"David’s Kingdom Strengthened"},{"type":"prose","content":"Now after this it came about that David defeated the Philistines and subdued them and took Gath and its towns from the hand of the Philistines."}],[{"type":"prose","content":"And he defeated Moab, and the Moabites became servants to David, bringing tribute."}],[{"type":"prose","content":"David also defeated Hadadezer king of Zobah  Hamath, as he went to establish his rule to the river Euphrates."}],[{"type":"prose","content":"David took from him a thousand chariots and seven thousand horsemen and twenty thousand foot soldiers, and David hamstrung  all the chariot horses, but left  of them for a hundred chariots."}],[{"type":"prose","content":"When the Arameans of Damascus came to help Hadadezer king of Zobah, David killed twenty-two thousand men of the Arameans."}],[{"type":"prose","content":"Then David put  among the Arameans of Damascus; and the Arameans became servants to David, bringing tribute. And the  helped David wherever he went."}],[{"type":"prose","content":"And David took the shields of gold which were carried by the servants of Hadadezer, and brought them to Jerusalem."}],[{"type":"prose","content":"Also from Tibhath and Cun, cities of Hadadezer, David took a very large amount of bronze, with which Solomon made the bronze Sea and the pillars and the bronze utensils."}],[{"type":"prose","content":"Now when Tou king of Hamath heard that David had defeated all the army of Hadadezer king of Zobah,"}],[{"type":"prose","content":"he sent Hadoram his son to King David to greet him and to bless him, because he had fought against Hadadezer and had defeated him; for Hadadezer had been at war with Tou. And  all kinds of articles of gold and silver and bronze."}],[{"type":"prose","content":"King David also dedicated these to the , with the silver and the gold which he had carried away from all the nations: from Edom, Moab, the sons of Ammon, the Philistines, and from Amalek."}],[{"type":"prose","content":"Moreover, Abishai the son of Zeruiah defeated eighteen thousand Edomites in the Valley of Salt."}],[{"type":"prose","content":"Then he put garrisons in Edom, and all the Edomites became servants to David. And the  helped David wherever he went."}],[{"type":"prose","content":"So David reigned over all Israel; and he administered justice and righteousness for all his people."}],[{"type":"prose","content":"Joab the son of Zeruiah  over the army, and Jehoshaphat the son of Ahilud  secretary;"}],[{"type":"prose","content":"and Zadok the son of Ahitub and Abimelech the son of Abiathar  priests, and Shavsha  secretary;"}],[{"type":"prose","content":"and Benaiah the son of Jehoiada  over the Cherethites and the Pelethites, and the sons of David  chiefs at the king’s side."}]]