[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And comforted her.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were comforting her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were engaged in the prescribed ceremonial of those who were called comforters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Saying, She goeth unto the grave to weep there.—The better reading is, thinking, She goeth . . . The practice was and is common among the Orientals, as well as among other nations.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Saying, She goeth unto the grave to weep there.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The better reading is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "thinking, She goeth .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " . . The practice was and is common among the Orientals, as well as among other nations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Their following her, defeats the object Martha had in view in calling her secretly. We may say, also, that it defeated our Lord’s object in remaining outside the village; but this is not inconsistent with His knowing that it would be so.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:17-32 Here was a house where the fear of God was, and on which his blessing rested; yet it was made a house of mourning. Grace will keep sorrow from the heart, but not from the house. When God, by his grace and providence, is coming towards us in ways of mercy and comfort, we should, like Martha, go forth by faith, hope, and prayer, to meet him. When Martha went to meet Jesus, Mary sat still in the house; this temper formerly had been an advantage to her, when it put her at Christ's feet to hear his word; but in the day of affliction, the same temper disposed her to melancholy. It is our wisdom to watch against the temptations, and to make use of the advantages of our natural tempers. When we know not what in particular to ask or expect, let us refer ourselves to God; let him do as seemeth him good. To enlarge Martha's expectations, our Lord declared himself to be the Resurrection and the Life. In every sense he is the Resurrection; the source, the substance, the first-fruits, the cause of it. The redeemed soul lives after death in happiness; and after the resurrection, both body and soul are kept from all evil for ever. When we have read or heard the word of Christ, about the great things of the other world, we should put it to ourselves, Do we believe this truth? The crosses and comforts of this present time would not make such a deep impression upon us as they do, if we believed the things of eternity as we ought. When Christ our Master comes, he calls for us. He comes in his word and ordinances, and calls us to them, calls us by them, calls us to himself. Those who, in a day of peace, set themselves at Christ's feet to be taught by him, may with comfort, in a day of trouble, cast themselves at his feet, to find favour with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Saying, She goeth unto the grave - Syriac, \"They thought that she went to weep.\" They had not heard Martha call her. The first days of mourning among the Jews were observed with great solemnity and many ceremonies of grief. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. The Jews … followed her … to the grave—Thus casually were provided witnesses of the glorious miracle that followed, not prejudiced, certainly, in favor of Him who wrought it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to weep there—according to Jewish practice, for some days after burial.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fell at his feet—more impassioned than her sister, though her words were fewer. (See on [1834]Joh 11:21).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"John 11:30\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Jews then which were with her in the house,.... Who came from Jerusalem to visit this afflicted family, and continued in the house with them ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and comforted her; which was the end of their coming, John 11:19. This they endeavoured to do, though they did not succeed: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and comforted her; which was the end of their coming, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This they endeavoured to do, though they did not succeed: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "when they saw Mary, that she rose up hastily, and went out, followed her; they did not know what Martha whispered to her, but observed that she rose off her seat in great haste, and went out of the house at once; and therefore they went after to see where she went, and to persuade her to return; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, within themselves; \"thinking\", as all the Oriental versions seem to read, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she goeth unto the grave to weep there: the Jews were wont to go to the graves on different accounts; one was to see whether the persons were dead or not: for so it is said (p), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they go to the graves and visit until three days.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It happened that they visited one, and he lived five and twenty years, and after that died: and another was on a religious account; such went to the graves of the prophets, wise men, and righteous, and prostrated themselves upon them, to pray with weeping and supplication, and seek mercy for themselves, and for their brethren, expressing their faith in the resurrection (q). Dr. Pocock (r) has given a large form of prayer used by them at such times, from Solomon bar Nathan; and is as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"let it be the will of the Lord our God, our Creator, our Holy One, the Holy One of Jacob, who hath created all the children of his covenant in judgment, and causes them to die in judgment, and will raise them again to the life of the world to come, who knows the number of them all; that he would hasten to awake our master and doctor, (such an one,) that holy, (or that righteous, or that wise doctor,) whose body dwells in this sepulchre, whose bones rest in the midst of these stones; and that he would quicken him with that eternal life which no death follows; with that life which swallows up all death, and which wipes away all tears, and takes away all reproach; together with all those who are written unto life in Jerusalem; with the seven shepherds, and eight principal men, who are spoken of in Micah 5:5, and give him a part with them that understand, and with them that justify many, who will be like the stars for ever and ever; and the whole residue of the people of the Lord, the house of Israel, who keep the covenant of our God, and do his pleasure, may the Lord our God shake all these out of their dust, and let their lot, and our lot, be in life, in everlasting life, that in it he may establish all, both great and small, according to what is written, Psalm 72:16, \"there shall be an handful of corn\", &c. and confirm the assurance he gave by Isaiah the prophet, the son of Amos, Isaiah 26:19, \"thy dead men shall live\", &c. and as he promised to Daniel, a man of desires,  Daniel 12:13, \"but go thou thy way till the end be\", &c. and as he promised to all the congregations of Israel, by his servant Ezekiel, the son of Buzi the priest, Ezekiel 37:12, \"therefore prophesy and say to them\", &c. that the saints may rejoice with glory, and sing upon their beds, and that the righteous may rejoice, and exult before God, and be glad in his salvation, and say in that day, \"behold this is our God, we have waited for him\", &c. Isaiah 25:9; and we will bless the Lord from this time forth, and for ever, Hallelujah.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"let it be the will of the Lord our God, our Creator, our Holy One, the Holy One of Jacob, who hath created all the children of his covenant in judgment, and causes them to die in judgment, and will raise them again to the life of the world to come, who knows the number of them all; that he would hasten to awake our master and doctor, (such an one,) that holy, (or that righteous, or that wise doctor,) whose body dwells in this sepulchre, whose bones rest in the midst of these stones; and that he would quicken him with that eternal life which no death follows; with that life which swallows up all death, and which wipes away all tears, and takes away all reproach; together with all those who are written unto life in Jerusalem; with the seven shepherds, and eight principal men, who are spoken of in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and give him a part with them that understand, and with them that justify many, who will be like the stars for ever and ever; and the whole residue of the people of the Lord, the house of Israel, who keep the covenant of our God, and do his pleasure, may the Lord our God shake all these out of their dust, and let their lot, and our lot, be in life, in everlasting life, that in it he may establish all, both great and small, according to what is written, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"there shall be an handful of corn\", &c. and confirm the assurance he gave by Isaiah the prophet, the son of Amos, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"thy dead men shall live\", &c. and as he promised to Daniel, a man of desires,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"but go thou thy way till the end be\", &c. and as he promised to all the congregations of Israel, by his servant Ezekiel, the son of Buzi the priest, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 37:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"therefore prophesy and say to them\", &c. that the saints may rejoice with glory, and sing upon their beds, and that the righteous may rejoice, and exult before God, and be glad in his salvation, and say in that day, \"behold this is our God, we have waited for him\", &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and we will bless the Lord from this time forth, and for ever, Hallelujah.'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A shorter one, which is in their liturgies, and is used as they pass by the sepulchres of the Israelites, is this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"blessed art thou, O Lord our God, who has formed you in judgment, and has quickened you in judgment, and has fed you in judgment, and knows the number of all of you, and he will quicken you, and restore you; blessed art thou, O Lord, that quickens the dead.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But sometimes they went only to vent their grief, and lament the loss of their deceased friends, which the Jews imagined was the case of Mary. And such a custom as this is used by the Turks, whose women on Friday, which is their day of worship, go before sun rising to the graves of the deceased, which are without the city, where they mourn over the death of their friends, and sprinkle their monuments with water and flowers; and even such as are not at the funeral or interment of the dead, after some days, will go to the graves, and make their lamentations there, and inquire of the dead the reason of their departure, and, as it were, expostulate with them, and to their lamentations add oblations of loaves, cheeses, eggs, and flesh (s). The Persians also visit the sepulchres of their principal \"Imams\", or prelates (t); and the Jews were wont to visit the graves of their great men, in honour to them; yea, the disciples of the wise men used to meet there to study the law, thereby showing respect, and doing honour to the deceased. It is said of Hezekiah,  2 Chronicles 32:33, \"that all Judah, and the inhabitants of Jerusalem, did him honour at his death\"; from whence say the Talmudists (u) we learn, that they fixed a sitting or a school at his grave; the gloss is, a session (or school) of the wise men to study in the law there. So says Maimonides (w), when a king dies they make a sitting at his grave seven days, as it is said, 2 Chronicles 32:33, \"they did him honour at his death\"; that is, they made a sitting at his grave. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But sometimes they went only to vent their grief, and lament the loss of their deceased friends, which the Jews imagined was the case of Mary. And such a custom as this is used by the Turks, whose women on Friday, which is their day of worship, go before sun rising to the graves of the deceased, which are without the city, where they mourn over the death of their friends, and sprinkle their monuments with water and flowers; and even such as are not at the funeral or interment of the dead, after some days, will go to the graves, and make their lamentations there, and inquire of the dead the reason of their departure, and, as it were, expostulate with them, and to their lamentations add oblations of loaves, cheeses, eggs, and flesh (s). The Persians also visit the sepulchres of their principal \"Imams\", or prelates (t); and the Jews were wont to visit the graves of their great men, in honour to them; yea, the disciples of the wise men used to meet there to study the law, thereby showing respect, and doing honour to the deceased. It is said of Hezekiah,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"that all Judah, and the inhabitants of Jerusalem, did him honour at his death\"; from whence say the Talmudists (u) we learn, that they fixed a sitting or a school at his grave; the gloss is, a session (or school) of the wise men to study in the law there. So says Maimonides (w), when a king dies they make a sitting at his grave seven days, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"they did him honour at his death\"; that is, they made a sitting at his grave. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Massech. Semachot, c. 8. fol. 15. 1.((q) Cippi Heb. p. 3, 4. (r) Misc. not. in port. Maimon. p. 224. (s) Gejer de Ebraeor. Luctu, c. 6. sect. 26. (t) Reland de Relig. Mohammed. l. 1. p. 72. (u) T. Bab. Bava Kama, fol. 16. 2.((w) Hilchot Ebel. c. 14. sect. 25. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Massech. Semachot, c. 8. fol. 15. 1.((q) Cippi Heb. p. 3, 4. (r) Misc. not. in port. Maimon. p. 224. (s) Gejer de Ebraeor. Luctu, c. 6. sect. 26. (t) Reland de Relig. Mohammed. l. 1. p. 72. (u) T. Bab. Bava Kama, fol. 16. 2.((w) Hilchot Ebel. c. 14. sect. 25. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The Jews then which were with her in the house, and comforted her, when they saw Mary, that she rose up hastily and went out, followed her, saying, She goeth unto the grave to weep there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But she was not allowed to go alone: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ οὖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Jews who were with her in the house comforting her interpreted her sudden movement as one of those urgent demands of grief which already, no doubt, they had seen her yield to, and in sincere sympathy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") followed her.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "followed her, saying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For ‘saying’ read with the best authorities, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thinking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their following interferes with the privacy at which Martha had aimed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to weep there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word rendered ‘weep’ here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 11:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as distinct from the one used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 11:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", indicates a loud expression of grief; wailing and crying, not merely shedding of tears.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἵνα κλαύσῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that she may weep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It was a well-known custom, that the friends of the dead should give themselves up to mourning during the time that intervened whilst the funeral preparations were being made, and indulge in paying the pious [affectionate] tribute of their tears.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 31.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Jews therefore who were with her in the house, and were comforting her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If the \"Jews\" (see note, ver. 19) were comforting Mary, and (ver. 37) recognized his love in its Divine depths, and if (see ver. 45) (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πολλοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") \"many believed on him,\" and only (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τινές",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") some of them (ver. 46) made the stupendous miracle a new occasion for expressing their inveterate malignity, there is no reason to import the element of hostility into the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἰδόντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When they observed Mary, that she suddenly rose and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (silently) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "went out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of the house), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "followed her, supposing that she goeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "to the grave to wail there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This custom was followed widely in the East, and is still observed in Roman Catholic communities. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κλαίω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be carefully distinguished from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δακρύω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of ver. 35; it denotes the loud expressive wailing and manifestation of grief of which so many instances occur (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 5:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 8:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), while the latter word means the shedding of tears. \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Wailing\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is often the regulated expression of professional grief; \"weeping\" the irresistible burst of personal sorrow. The first may be violent and obtrusive, the other silent and pathetic. John 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Saying (λέγοντες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The best texts read δόξαντες, supposing. So Rev.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She goeth (ὑπάγει)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Withdraweth from our company. See on John 6:21; see on John 8:21.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Withdraweth from our company. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To weep (ἵνα κλαύσῃ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rev., in margin, wail. The word means loud weeping. See Matthew 2:18; Mark 5:38; and on Luke 6:21; Luke 7:32. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Rev., in margin, wail. The word means loud weeping. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 5:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]