[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(46) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But some of them went their ways to the Pharisees",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " necessarily, some of those who had been with Mary, and had seen the things which Jesus did, and had believed. But why did they then go and tell the Pharisees? It is contrary to their position as believers to think that they did this as informers against Jesus. What they have seen has carried conviction to their own minds, and they report it to the Pharisees, either as a proof that He really was the Messiah, or in any case to demand from them a judgment on the facts which they report.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:33-46 Christ's tender sympathy with these afflicted friends, appeared by the troubles of his spirit. In all the afflictions of believers he is afflicted. His concern for them was shown by his kind inquiry after the remains of his deceased friend. Being found in fashion as a man, he acts in the way and manner of the sons of men. It was shown by his tears. He was a man of sorrows, and acquainted with grief. Tears of compassion resemble those of Christ. But Christ never approved that sensibility of which many are proud, while they weep at mere tales of distress, but are hardened to real woe. He sets us an example to withdraw from scenes of giddy mirth, that we may comfort the afflicted. And we have not a High Priest who cannot be touched with a feeling of our infirmities. It is a good step toward raising a soul to spiritual life, when the stone is taken away, when prejudices are removed, and got over, and way is made for the word to enter the heart. If we take Christ's word, and rely on his power and faithfulness, we shall see the glory of God, and be happy in the sight. Our Lord Jesus has taught us, by his own example, to call God Father, in prayer, and to draw nigh to him as children to a father, with humble reverence, yet with holy boldness. He openly made this address to God, with uplifted eyes and loud voice, that they might be convinced the Father had sent him as his beloved Son into the world. He could have raised Lazarus by the silent exertion of his power and will, and the unseen working of the Spirit of life; but he did it by a loud call. This was a figure of the gospel call, by which dead souls are brought out of the grave of sin: and of the sound of the archangel's trumpet at the last day, with which all that sleep in the dust shall be awakened, and summoned before the great tribunal. The grave of sin and this world, is no place for those whom Christ has quickened; they must come forth. Lazarus was thoroughly revived, and returned not only to life, but to health. The sinner cannot quicken his own soul, but he is to use the means of grace; the believer cannot sanctify himself, but he is to lay aside every weight and hinderance. We cannot convert our relatives and friends, but we should instruct, warn, and invite them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Some of them ... - We see here the different effect which the word and works of God will have on different individuals. Some are converted and others are hardened; yet the evidence of this miracle was as clear to the one as the other. But they would not be convinced. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45, 46. many … which … had seen … believed … But some … went … to the Pharisees and told them what Jesus had done—the two classes which continually reappear in the Gospel history; nor is there ever any great work of God which does not produce both. \"It is remarkable that on each of the three occasions on which our Lord raised the dead, a large number of persons was assembled. In two instances, the resurrection of the widow's son and of Lazarus, these were all witnesses of the miracle; in the third (of Jairus' daughter) they were necessarily cognizant of it. Yet this important circumstance is in each case only incidentally noticed by the historians, not put forward or appealed to as a proof of their veracity. In regard to this miracle, we observe a greater degree of preparation, both in the provident arrangement of events, and in our Lord's actions and words than in any other. The preceding miracle (cure of the man born blind) is distinguished from all others by the open and formal investigation of its facts. And both these miracles, the most public and best attested of all, are related by John, who wrote long after the other Evangelists\" [Webster and Wilkinson].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " These Jews had the same means for believing the others had; they had heard the same words from Christ, they had seen the same miracle wrought by Christ. Whence is it that any of the other Jews believed? These, instead of believing, run to the Pharisees to accuse him. Can any account be given of this, unless from the freedom of Divine grace, showing mercy where God will show mercy? Though possibly the former wickedness, of these Jews was the cause of God’s not giving that grace to them which he gave to others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But some of them went their way to the Pharisees,.... At Jerusalem, who were members of the sanhedrim; so far were some of them from receiving any advantage by this miracle, that they were the more hardened, and filled with malice and envy to Christ, and made the best of their way to acquaint his most inveterate enemies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and told them what things Jesus had done; at Bethany; not to soften their minds, and bring them to entertain a good opinion of him, but to irritate them, and put them upon schemes to destroy him; thus even miracles, as well as the doctrines of the Gospel, are to some the savour of death unto death, whilst to others the savour of life unto life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and told them what things Jesus had done; at Bethany; not to soften their minds, and bring them to entertain a good opinion of him, but to irritate them, and put them upon schemes to destroy him; thus even miracles, as well as the doctrines of the Gospel, are to some the savour of death unto death, whilst to others the savour of life unto life. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{6} But some of them went their ways to the Pharisees, and told them what things Jesus had done.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{6}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But some of them went their ways to the Pharisees, and told them what things Jesus had done.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) The last aspect of hard and ironlike stubbornness is to proclaim open war against God, and yet it does not cease to make a pretence both of godliness and of the profit of the nation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But of this number [it may be “of the Jews” generally, and not of those who had been at Bethany] some went away to the Pharisees and told them, His recognised enemies, what He had done. Whether they did this in good faith or not does not appear.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀπῆλθον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "departed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [went their ways]) as aliens to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "John 11:46",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Some of them",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Not of the Jews who had come to Mary, but some of the Jews, some perhaps who had joined the crowd from curiosity. ",
        "children": []
      }
    ]
  }
]