[{"num":3,"verse":"Understand what I am telling you: The Lord God All-Powerful will take away everything Judah and Jerusalem depend on. He will take away all the food and water."},{"num":2,"verse":"He will take away all the heroes and soldiers. He will take away all the judges, the prophets, the fortunetellers, and the elders."},{"num":3,"verse":"He will take away the army officers and important officials. He will take away the skilled counselors, the magicians, and those who try to tell the future."},{"num":4,"verse":"He says, “I will put young boys in charge of you. They will be your leaders."},{"num":5,"verse":"The people will turn against each other. Young people will not respect those who are older. The common people will not respect important leaders.”"},{"num":6,"verse":"At that time a man will grab one of his brothers from his own family and tell him, “You have a coat, so you will be our leader. You will be the leader over all these ruins.”"},{"num":7,"verse":"But the brother will refuse and say, “I cannot help you. I don’t have enough food or clothes for my own family. You will not make me your leader.”"},{"num":8,"verse":"This will happen because Jerusalem has stumbled, and Judah has fallen. They turned against the Lord. They said and did things against him, right in front of his glorious eyes."},{"num":9,"verse":"The look on their faces shows that they are guilty. They are like the people of Sodom; they don’t care who sees their sin. But it will be very bad for them. They will get what they deserve."},{"num":10,"verse":"Tell the good people who do what is right that good things will happen to them. They will receive a reward for what they do."},{"num":11,"verse":"But it will be very bad for wicked people, because they, too, will get what they deserve. They will get what they did to others."},{"num":12,"verse":"Even children will defeat my people, and women will rule over them."},{"header":"God’s Decision About His People"},{"num":13,"verse":"Look, the Lord is standing to judge his people."},{"num":14,"verse":"The Lord is ready to present his case against the elders and leaders of his people."},{"num":15,"verse":"What gives you the right to hurt my people? What gives you the right to push the faces of the poor into the dirt?” The Lord God All-Powerful said this."},{"num":16,"verse":"The Lord says, “The women in Zion have become very proud. They walk around with their heads in the air, acting like they are better than other people. They flirt with their eyes and make tinkling sounds with their ankle bracelets as they take their quick little steps.”"},{"num":17,"verse":"The Lord will put sores on the heads of those women in Zion. The Lord will make their heads bald."},{"num":18,"verse":"Then the Lord will take away everything they are proud of: the beautiful ankle bracelets, the necklaces that look like the sun and the moon,"},{"num":19,"verse":"the earrings, bracelets, and veils,"},{"num":20,"verse":"the scarves, the ankle chains, the cloth belts worn around their waists, the bottles of perfume, the charms,"},{"num":21,"verse":"the signet rings, and the nose rings,"},{"num":22,"verse":"the fine dresses, robes, veils, and purses,"},{"num":23,"verse":"the mirrors, linen dresses, turbans, and long shawls."},{"num":24,"verse":"Those women now have sweet-smelling perfume, but it will get moldy and stink. Now they wear belts, but then they will have only ropes to wear. Now they have their hair fixed in fancy ways, but then their heads will be shaved—they will have no hair. Now they have party dresses, but then they will have only mourning clothes. They have beauty marks on their faces now, but then they will have another mark. It will be a mark burned into their skin to show that they are slaves."},{"num":25,"verse":"Your men will be killed with swords. Your heroes will die in war."},{"num":26,"verse":"There will be crying and sadness in the meeting places by the city gates. Jerusalem will sit there empty, like a woman who has lost everything to thieves and robbers and now just sits on the ground and cries."}]