[{"header":"God Will Remove the Leaders of Judah"},{"num":3,"verse":"See, the Lord, the Lord God of All, is going to take away from Jerusalem and Judah all they have to keep themselves alive and safe, all the bread and all the water. "},{"num":2,"verse":"He will take away the strong man, the man of war, the man who judges, the man who tells what will happen in the future, the man who uses secret ways, and the leader. "},{"num":3,"verse":"He will take away the captain of fifty, the man of honor, the wise man, the able workman, and the one who uses secret powers. "},{"num":4,"verse":"I will make boys their rulers. Foolish children will rule over them. "},{"num":5,"verse":"The people will make it hard for each other. Each one will hurt the other, and each one will be hurt by his neighbor. The younger will show anger toward the older. And the man who is not respected will show anger toward the man of honor."},{"num":6,"verse":"A man will take hold of his brother in his father’s house, saying, “You have a coat. You will be our ruler. This destroyed city will be under your rule.” "},{"num":7,"verse":"In that day he will call out, “I can not be of help to you. For in my house there is no bread or coat. You should not choose me to be ruler of the people.” "},{"num":8,"verse":"For Jerusalem has no strength, and Judah has fallen, because their speaking and their actions are against the Lord. They have turned against His shining-greatness. "},{"num":9,"verse":"The look on their faces speaks against them. They show their sin like Sodom. They do not even hide it. It is bad for them! For they have brought trouble upon themselves. "},{"num":10,"verse":"Tell those who are right and good that it will go well for them. For they will enjoy the fruit of what they do. "},{"num":11,"verse":"It will be bad for the sinful man! It will not go well for him, for what he has done will be done to him. "},{"num":12,"verse":"O My people! Children make it hard for them. And women rule over them. O My people! Your leaders lead you in the wrong way. You do not know which path to take."},{"header":"The Lord Will Judge His People"},{"num":13,"verse":"The Lord is ready to say what He thinks and stands to judge the people. "},{"num":14,"verse":"The Lord judges the leaders and rulers of His people: “It is you who have destroyed the grape-field. What had belonged to the poor is in your houses. "},{"num":15,"verse":"What do you mean by crushing My people, and grinding the faces of the poor?” says the Lord God of All."},{"header":"Women of Jerusalem Will Suffer"},{"num":16,"verse":"The Lord said, “The daughters of Zion are proud. They walk with heads held high and a wrong desire in their eyes. They walk with short steps, making noise with the chains on their ankles. "},{"num":17,"verse":"So the Lord will make sores come upon the heads of the daughters of Zion, and take the hair from their head. "},{"num":18,"verse":"In that day the Lord will take away the beauty of their ankle chains, headbands, moon-like objects, "},{"num":19,"verse":"rings worn on their ears and arms, face-coverings, "},{"num":20,"verse":"head-dresses, leg-chains, wide belts, perfume boxes, objects with secret powers, "},{"num":21,"verse":"finger rings, nose rings, "},{"num":22,"verse":"bright clothing, coats, money-bags, "},{"num":23,"verse":"hand mirrors, underclothes, head-coverings, and face-coverings."},{"num":24,"verse":"Instead of sweet perfume there will be a bad smell. Instead of a belt there will be a rope. Instead of well set hair there will be no hair. Instead of fine clothes they will wear cloth made from hair. And there will be burnt marks instead of beauty. "},{"num":25,"verse":"Your men will fall by the sword. Your strong ones will fall in battle. "},{"num":26,"verse":"Jerusalem’s gates will be filled with sorrow. She will sit on the ground, laid waste and empty."}]