[[],[{"type":"header","content":"Death for Egypt’s Firstborn"},{"type":"prose","content":"Then the  said to Moses, “I will strike Pharaoh and the land of Egypt with one more blow. After that, Pharaoh will let you leave this country. In fact, he will be so eager to get rid of you that he will force you all to leave."}],[{"type":"prose","content":"Tell all the Israelite men and women to ask their Egyptian neighbors for articles of silver and gold.”"}],[{"type":"prose","content":"(Now the  had caused the Egyptians to look favorably on the people of Israel. And Moses was considered a very great man in the land of Egypt, respected by Pharaoh’s officials and the Egyptian people alike.)"}],[{"type":"prose","content":"Moses had announced to Pharaoh, “This is what the  says: At midnight tonight I will pass through the heart of Egypt."}],[{"type":"prose","content":"All the firstborn sons will die in every family in Egypt, from the oldest son of Pharaoh, who sits on his throne, to the oldest son of his lowliest servant girl who grinds the flour. Even the firstborn of all the livestock will die."}],[{"type":"prose","content":"Then a loud wail will rise throughout the land of Egypt, a wail like no one has heard before or will ever hear again."}],[{"type":"prose","content":"But among the Israelites it will be so peaceful that not even a dog will bark. Then you will know that the  makes a distinction between the Egyptians and the Israelites."}],[{"type":"prose","content":"All the officials of Egypt will run to me and fall to the ground before me. ‘Please leave!’ they will beg. ‘Hurry! And take all your followers with you.’ Only then will I go!” Then, burning with anger, Moses left Pharaoh."}],[{"type":"prose","content":"Now the  had told Moses earlier, “Pharaoh will not listen to you, but then I will do even more mighty miracles in the land of Egypt.”"}],[{"type":"prose","content":"Moses and Aaron performed these miracles in Pharaoh’s presence, but the  hardened Pharaoh’s heart, and he wouldn’t let the Israelites leave the country."}]]