[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:9-32 God's time for the enlargement of his people is the fittest time. If the chief butler had got Joseph to be released from prison, it is probable he would have gone back to the land of the Hebrews. Then he had neither been so blessed himself, nor such a blessing to his family, as afterwards he proved. Joseph, when introduced to Pharaoh, gives honour to God. Pharaoh had dreamed that he stood upon the bank of the river Nile, and saw the kine, both the fat ones, and the lean ones, come out of the river. Egypt has no rain, but the plenty of the year depends upon the overflowing of the river Nile. See how many ways Providence has of dispensing its gifts; yet our dependence is still the same upon the First Cause, who makes every creature what it is to us, be it rain or river. See to what changes the comforts of this life are subject. We cannot be sure that to-morrow shall be as this day, or next year as this. We must learn how to want, as well as how to abound. Mark the goodness of God in sending the seven years of plenty before those of famine, that provision might be made. The produce of the earth is sometimes more, and sometimes less; yet, take one with another, he that gathers much, has nothing over; and he that gathers little, has no lack, Ex 16:18. And see the perishing nature of our worldly enjoyments. The great harvests of the years of plenty were quite lost, and swallowed up in the years of famine; and that which seemed very much, yet did but just serve to keep the people alive. There is bread which lasts to eternal life, which it is worth while to labour for. They that make the things of this world their good things, will find little pleasure in remembering that they have received them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph now proceeds to interpret the dream, and offer counsel suitable to the emergency. \"What the God is about to do.\" The God, the one true, living, eternal God, in opposition to all false gods. \"And because the dream was repeated.\" This is explained to denote the certainty and immediateness of the event. The beautiful elucidation of the dream needs no comment. Joseph now naturally passes from the interpreter to the adviser. He is all himself on this critical occasion. His presence of mind never forsakes him. The openness of heart and readiness of speech, for which he was early distinguished, now stand him in good stead. His thorough self-command arises from spontaneously throwing himself, with all his heart, into the great national emergency which is before his mind. And his native simplicity of heart, practical good sense, anti force of character break forth into unasked, but not unaccepted counsel. \"A man discreet\" - intelligent, capable of understanding the occasion; wise, prudent, capable of acting accordingly. \"Let Pharaoh proceed\" - take the following steps: \"Take the fifth\" of the produce of the land. \"Under the hand of Pharaoh.\" Under his supreme control.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The measures here suggested to Pharaoh were, we must suppose in conformity with the civil institutions of the country. Thee exaction of a fifth, or two tithes, during the period of plenty, may have been an extraordinary measure, which the absolute power of the monarch enabled him to enforce for the public safety. The sovereign was probably dependent for his revenues on the produce of the crown lands, certain taxes on exports or imports, and occasional gifts or forced contributions from his subjects. This extraordinary fifth was, probably, of the last description, and was fully warranted by the coming emergency. The \"gathering up of all the food\" may imply that, in addition to the fifth, large purchases of corn were made by the government out of the surplus produce of the country.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The measures here suggested to Pharaoh were, we must suppose in conformity with the civil institutions of the country. Thee exaction of a fifth, or two tithes, during the period of plenty, may have been an extraordinary measure, which the absolute power of the monarch enabled him to enforce for the public safety. The sovereign was probably dependent for his revenues on the produce of the crown lands, certain taxes on exports or imports, and occasional gifts or forced contributions from his subjects. This extraordinary fifth was, probably, of the last description, and was fully warranted by the coming emergency. The \"gathering up of all the food\" may imply that, in addition to the fifth, large purchases of corn were made by the government out of the surplus produce of the country.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 41:25-36. Joseph Interprets Pharaoh's Dreams.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25. Joseph said, … The dream … is one—They both pointed to the same event—a remarkable dispensation of seven years of unexampled abundance, to be followed by a similar period of unparalleled dearth. The repetition of the dream in two different forms was designed to show the absolute certainty and speedy arrival of this public crisis; the interpretation was accompanied by several suggestions of practical wisdom for meeting so great an emergency as was impending.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the plenty shall not be known in the land, by reason of that famine following,.... That is, before it would be over; otherwise the former plenty was in some measure known by the stores of provisions laid up in the seven years of it, and which were brought forth when the famine became very pressing; but by that time, and before the seven years of it were ended, there were no traces of the foregoing plenty to be observed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for it shall be very grievous; as it was both in Egypt and in all the countries round about. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for it shall be very grievous; as it was both in Egypt and in all the countries round about. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the plenty shall not be known in the land by reason of that famine following; for it shall be very grievous.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Pharaoh immediately sent for Joseph. As quickly as possible he was fetched from the prison; and after shaving the hair of his head and beard, and changing his clothes, as the customs of Egypt required (see Hengst. Egypt and the Books of Moses, p. 30), he went in to the king. On the king's saying to him, \"I have heard of thee (עליך de te), thou hearest a dream to interpret it,\" - i.e., thou only needest to hear a dream, and thou canst at once interpret it - Joseph replied, \"Not I((בּלעדי, lit., \"not so far as me,\" this is not in my power, vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), God will answer Pharaoh's good,\" i.e., what shall profit Pharaoh; just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he had pointed the two prisoners away from himself to God. Pharaoh then related his double dream (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:17-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Joseph gave the interpretation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:25-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"The dream of Pharaoh is one (i.e., the two dreams have the same meaning); God hath showed Pharaoh what He is about to do.\" The seven cows and seven ears of corn were seven years, the fat ones very fertile years of superabundance, the lean ones very barren years of famine; the latter would follow the former over the whole land of Egypt, so that the years of famine would leave no trace of the seven fruitful years; and, \"for that the dream was doubled unto Pharaoh twice\" (i.e., so far as this fact is concerned, it signifies) \"that the thing is firmly resolved by God, and God will quickly carry it out.\" In the confidence of this interpretation which looked forward over fourteen years, the divinely enlightened seer's glance was clearly manifested, and could not fail to make an impression upon the king, when contrasted with the perplexity of the Egyptian augurs and wise men. Joseph followed up his interpretation by the advice (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:33-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that Pharaoh should \"look out (ירא) a man discreet and wise, and set him over the land of Egypt;\" and cause יעשׂה) that in the seven years of superabundance he should raise fifths (חמּשׁ), i.e., the fifth part of the harvest, through overseers, and have the corn, or the stores of food (אכל), laid up in the cities \"under the hand of the king,\" i.e., by royal authority and direction, as food for the land for the seven years of famine, that it might not perish through famine. ",
        "children": []
      }
    ]
  }
]