[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:33-45 Joseph gave good advice to Pharaoh. Fair warning should always be followed by good counsel. God has in his word told us of a day of trial before us, when we shall need all the grace we can have. Now, therefore, provide accordingly. Pharaoh gave Joseph an honourable testimony. He is a man in whom the spirit of God is; and such men ought to be valued. Pharaoh puts upon Joseph marks of honour. He gave him such a name as spoke the value he had for him, Zaphnath-paaneah, a revealer of secrets. This preferment of Joseph encourages all to trust in God. Some translate Joseph's new name, the saviour of the world. The brightest glories, even of the upper world, are put upon Christ, the highest trust lodged in his hand, and all power given him, both in heaven and earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Pharaoh approves of his counsel, and selects him as \"the discreet and wise man\" for carrying it into effect. \"In whom is the Spirit of God.\" He acknowledges the gift that is in Joseph to be from God. \"All my people behave\" - dispose or order their conduct, a special meaning of this word, which usually signifies to kiss. \"His ring.\" His signet-ring gave Joseph the delegated power of the sovereign, and constituted him his prime minister or grand vizier. \"Vestures of fine linen.\" Egypt was celebrated for its flax, and for the fineness of its textures. The priests were arrayed in official robes of linen, and no man was allowed to enter a temple in a woolen garment (Herodotus ii. 37, 81). \"A gold chain about his neck.\" This was a badge of office worn in Egypt by the judge and the prime minister. It had a similar use in Persia and Babylonia ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The second chariot.\" Egypt was noted for chariots, both for peaceful and for warlike purposes (Herodotus ii. 108). The second in the public procession was assigned to Joseph. \"Bow the knee.\" The various explications of this proclamation agree in denoting a form of obeisance, with which Joseph was to be honored. I am Pharaoh, the king ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Without thee shall no man lift up his hand or foot.\" Thou art next to me, and without thee no man shall act or move. \"Zaphenath-paneah.\" Pharaoh designates him the preserver of life, as the interpreter of the dream and the proposer of the plan by which the country was saved from famine. He thus naturalizes him so far as to render his civil status compatible with his official rank. \"Asenath.\" The priests were the highest and most privileged class in Egypt. Intermarriage with this caste at once determined the social position of the wonderous foreigner. His father-in-law was priest of On, a city dedicated to the worship of the sun.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh Genesis 12:17. Abimelek acknowledges the God of Abraham and Isaac Genesis 20:3-7; Genesis 21:22-23; Genesis 26:28-29. And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Abimelek acknowledges the God of Abraham and Isaac ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:3-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:22-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:28-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service Numbers 4:3. He immediately enters upon his office.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He immediately enters upon his office.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41. Pharaoh said, … See, I have set thee over all the land—These words were preliminary to investiture with the insignia of office, which were these: the signet-ring, used for signing public documents, and its impression was more valid than the sign-manual of the king; the khelaat or dress of honor, a coat of finely wrought linen, or rather cotton, worn only by the highest personages; the gold necklace, a badge of rank, the plain or ornamental form of it indicating the degree of rank and dignity; the privilege of riding in a state carriage, the second chariot; and lastly—",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Pharaoh said unto Joseph,.... He continued speaking to him for the greater confirmation of what he had said, and for further explanation of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "see, I have set thee over all the land of Egypt; not merely as the corn master general, to take care of a provision of corn in time of plenty, against a time of scarcity, but as a viceroy or deputy governor over the whole land, as appears by the ensigns of honour and dignity bestowed on him; of which in the following verses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "see, I have set thee over all the land of Egypt; not merely as the corn master general, to take care of a provision of corn in time of plenty, against a time of scarcity, but as a viceroy or deputy governor over the whole land, as appears by the ensigns of honour and dignity bestowed on him; of which in the following verses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Pharaoh said unto Joseph, See, I have set thee over all the land of Egypt.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 41-43.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Pharaoh said unto Joseph. See, I have set thee over all the land of Egypt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was the royal edict constituting Joseph grand vizier or prime minister of the empire: the formal installation in office followed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Pharaoh took off his ring from his hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - the use of a signet-ring by the monarch, which Bohlen admits to be in accordance with the accounts of classic authors ('Introd.,' p. 60), has recently received a remarkable illustration by the discovery at Koujunjik, the site of the ancient Nineveh, of a seal impressed from the bezel of a metallic finger-ring, two inches long by one wide, and bearing the image, name, and titles of the Egyptian king Sabaco (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide Layard, 'Nineveh and Babylon,' p. 156) - and put it upon Joseph's hand (thus investing him with regal authority), and arrayed him in vestures of fine linen, - שֵׁשׁ, βυσσίνη (LXX), byssus, so called from its whiteness (probably a Hebrew imitation of an Egyptian word), was the fine linen of Egypt, the material of which the peculiar dress of the priestly caste was constructed: \"vestes ex gossypio sacerdotibus AEgypti gratissimae\" (Pliny, 'Nat. Hist.,' 19:1). Herodotus (2:81) agrees with Pliny in affirming the priestly costume to have been of linen, and not of wool - and put a - literally, the, the article showing that it was so done in accordance with a common custom (Hengstenberg, 'Egypt and the Books of Moses,' p. 30) - gold chain about his neck (cf. Daniel 5:7, 29). This was usually worn by persons of distinction, and appears in the monuments as a royal ornament; in the Benihassan sepulchral representations, a slave being exhibited as bearing one of them, with the inscription written over it, \"Necklace of Gold\" (vide Wilkinson, 'Ancient Egyptians,' 2:343, ed. 1878; Hengstenberg, 'Egypt,' p. 30). And he made him to ride in the second chariot which he had; - \"which is another genuine Egyptian custom, for on the monuments the king constantly appears in his war-chariot\" (Havernick); - and they cried before him, Bow the knee: - אַבְרֵך, regarded by most ancient translators as a Hebrew word, an inf. abs. hiph. from בָּרַך, meaning bow the knee (Vulgate, Aquila, Origen, Kimchi), is most probably an Egyptian word either altered by the writer (Gesenius) or pointed by the Masorites (Keil) to resemble Hebrew, and signifying \"bow the head ' (Gesenius), \"bend the knee\" (Furst), \"Governor or Viceroy\" (Kalisch), \"rejoice thou\" (Canon Cook in 'Speaker's Commentary'), \"Pure Prince\" (Osburn), \"Robed by the king\" (Forster) - and he made him ruler - literally, and he set Aim (by the foregoing acts) - over all the land of Egypt. Genesis 41:41Keil and Delitzsch Biblical Commentary on the Old TestamentJoseph's Promotion. - This counsel pleased Pharaoh and all his servants, so that he said to them, \"Shall we find a man like this one, in whom the Spirit of God is?\" \"The Spirit of Elohim,\" i.e., the spirit of supernatural insight and wisdom. He then placed Joseph over his house, and over all Egypt; in other words, he chose him as hid grand vizier, saying to him, \"After God hath showed thee all this, there is none discreet and wise as thou.\" ישּׁק על־פּיך, \"according to thy mouth (i.e., command, Genesis 45:21) shall my whole people arrange itself.\" נשׁק does not mean to kiss (Rabb., Ges., etc.), for על נשׁק is not Hebrew, and kissing the mouth was not customary as an act of homage, but \"to dispose, arrange one's self\" (ordine disposuit). \"Only in the throne will I be greater than thou.\" LinksGenesis 41:41 InterlinearGenesis 41:41 Parallel TextsGenesis 41:41 NIVGenesis 41:41 NLTGenesis 41:41 ESVGenesis 41:41 NASBGenesis 41:41 KJVGenesis 41:41 Bible AppsGenesis 41:41 ParallelGenesis 41:41 Biblia ParalelaGenesis 41:41 Chinese BibleGenesis 41:41 French BibleGenesis 41:41 German BibleBible Hub",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "vide Layard, 'Nineveh and Babylon,' p. 156) - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "and put it upon Joseph's hand",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (thus investing him with regal authority), ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "and arrayed him in vestures of fine linen",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", - ",
            "children": []
          },
          {
            "element": "span",
            "class": "hebrew",
            "text": "שֵׁשׁ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "greek",
            "text": "βυσσίνη",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (LXX), byssus, so called from its whiteness (probably a Hebrew imitation of an Egyptian word), was the fine linen of Egypt, the material of which the peculiar dress of the priestly caste was constructed: \"",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "vestes ex gossypio sacerdotibus AEgypti gratissimae\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Pliny, 'Nat. Hist.,' 19:1). Herodotus (2:81) agrees with Pliny in affirming the priestly costume to have been of linen, and not of wool - and put a - literally, the, the article showing that it was so done in accordance with a common custom (Hengstenberg, 'Egypt and the Books of Moses,' p. 30) - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "gold chain about his neck",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:7, 29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This was usually worn by persons of distinction, and appears in the monuments as a royal ornament; in the Benihassan sepulchral representations, a slave being exhibited as bearing one of them, with the inscription written over it, \"Necklace of Gold\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "vide",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Wilkinson, 'Ancient Egyptians,' 2:343, ed. 1878; Hengstenberg, 'Egypt,' p. 30). ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "And he made him to ride in the second chariot which he had",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; - \"which is another genuine Egyptian custom, for on the monuments the king constantly appears in his war-chariot\" (Havernick); - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "and they cried before him, Bow the knee",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": - ",
            "children": []
          },
          {
            "element": "span",
            "class": "hebrew",
            "text": "אַבְרֵך",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", regarded by most ancient translators as a Hebrew word, an inf. abs. hiph. from ",
            "children": []
          },
          {
            "element": "span",
            "class": "hebrew",
            "text": "בָּרַך",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", meaning bow the knee (Vulgate, Aquila, Origen, Kimchi), is most probably an Egyptian word either altered by the writer (Gesenius) or pointed by the Masorites (Keil) to resemble Hebrew, and signifying \"bow the head ' (Gesenius), \"bend the knee\" (Furst), \"Governor or Viceroy\" (Kalisch), \"rejoice thou\" (Canon Cook in 'Speaker's Commentary'), \"",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "Pure",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Prince\" (Osburn), \"Robed by the king\" (Forster) - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "and he made him ruler",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "and he set Aim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (by the foregoing acts) - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "over all the land of Egypt.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Genesis 41:41",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Keil and Delitzsch Biblical Commentary on the Old Testament",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Joseph's Promotion. - This counsel pleased Pharaoh and all his servants, so that he said to them, \"Shall we find a man like this one, in whom the Spirit of God is?\" \"The Spirit of Elohim,\" i.e., the spirit of supernatural insight and wisdom. He then placed Joseph over his house, and over all Egypt; in other words, he chose him as hid grand vizier, saying to him, \"After God hath showed thee all this, there is none discreet and wise as thou.\" ישּׁק על־פּיך, \"according to thy mouth (i.e., command, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") shall my whole people arrange itself.\" נשׁק does not mean to kiss (Rabb., Ges., etc.), for על נשׁק is not Hebrew, and kissing the mouth was not customary as an act of homage, but \"to dispose, arrange one's self\" (ordine disposuit). \"Only in the throne will I be greater than thou.\" ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Links",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Interlinear",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Parallel Texts",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 NIV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 NLT",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 ESV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 NASB",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 KJV",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Bible Apps",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Parallel",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Biblia Paralela",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 Chinese Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 French Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:41 German Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Bible Hub",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  }
]