[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(42) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His ring.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his signet ring. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As decrees became law when stamped with the royal signet, it was naturally the symbol of authority; and so with us, at the formation of a ministry the great seal is formally delivered into the hands of the highest legal personage in the realm, who is thus invested with power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Vestures of fine linen.—The word used here is Egyptian, shesh, and signifies a kind of flax from which linen of great fineness and whiteness was made. Much of the dress of the Levitical priests was to be made of this flax, called in Hebrew byssus (Exodus 39:28, &c.), In the East it is usual on all occasions of showing the royal favour, to give changes of raiment: but there is here the further signification, that as this fine white linen was the special dress of the king and the priests, the bestowal of it indicated Joseph’s admission into the ruling classes of Egypt. Probably, as he married a priest’s daughter, he was himself also previously enrolled among the ranks of the priesthood.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Vestures of fine linen.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The word used here is Egyptian, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shesh, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and signifies a kind of flax from which linen of great fineness and whiteness was made. Much of the dress of the Levitical priests was to be made of this flax, called in Hebrew byssus (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 39:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c.), In the East it is usual on all occasions of showing the royal favour, to give changes of raiment: but there is here the further signification, that as this fine white linen was the special dress of the king and the priests, the bestowal of it indicated Joseph’s admission into the ruling classes of Egypt. Probably, as he married a priest’s daughter, he was himself also previously enrolled among the ranks of the priesthood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A gold chain.—This also appears upon the monuments as one of the royal insignia. Ancient necklaces of such exquisite workmanship have been discovered in Egypt, that patterns copied from them are common now at the chief jewellers.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A gold chain.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This also appears upon the monuments as one of the royal insignia. Ancient necklaces of such exquisite workmanship have been discovered in Egypt, that patterns copied from them are common now at the chief jewellers.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 41:42-43. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:42-43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pharaoh took off his ring ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which was both a token of the highest dignity, and an instrument of the greatest power; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and put it on Joseph’s hand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thereby giving him authority to make and sign what decrees he thought fit in the king’s name. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He made him ride in the second chariot — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That he might be known to be next to the king in dignity and power.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:33-45 Joseph gave good advice to Pharaoh. Fair warning should always be followed by good counsel. God has in his word told us of a day of trial before us, when we shall need all the grace we can have. Now, therefore, provide accordingly. Pharaoh gave Joseph an honourable testimony. He is a man in whom the spirit of God is; and such men ought to be valued. Pharaoh puts upon Joseph marks of honour. He gave him such a name as spoke the value he had for him, Zaphnath-paaneah, a revealer of secrets. This preferment of Joseph encourages all to trust in God. Some translate Joseph's new name, the saviour of the world. The brightest glories, even of the upper world, are put upon Christ, the highest trust lodged in his hand, and all power given him, both in heaven and earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Pharaoh approves of his counsel, and selects him as \"the discreet and wise man\" for carrying it into effect. \"In whom is the Spirit of God.\" He acknowledges the gift that is in Joseph to be from God. \"All my people behave\" - dispose or order their conduct, a special meaning of this word, which usually signifies to kiss. \"His ring.\" His signet-ring gave Joseph the delegated power of the sovereign, and constituted him his prime minister or grand vizier. \"Vestures of fine linen.\" Egypt was celebrated for its flax, and for the fineness of its textures. The priests were arrayed in official robes of linen, and no man was allowed to enter a temple in a woolen garment (Herodotus ii. 37, 81). \"A gold chain about his neck.\" This was a badge of office worn in Egypt by the judge and the prime minister. It had a similar use in Persia and Babylonia ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The second chariot.\" Egypt was noted for chariots, both for peaceful and for warlike purposes (Herodotus ii. 108). The second in the public procession was assigned to Joseph. \"Bow the knee.\" The various explications of this proclamation agree in denoting a form of obeisance, with which Joseph was to be honored. I am Pharaoh, the king ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Without thee shall no man lift up his hand or foot.\" Thou art next to me, and without thee no man shall act or move. \"Zaphenath-paneah.\" Pharaoh designates him the preserver of life, as the interpreter of the dream and the proposer of the plan by which the country was saved from famine. He thus naturalizes him so far as to render his civil status compatible with his official rank. \"Asenath.\" The priests were the highest and most privileged class in Egypt. Intermarriage with this caste at once determined the social position of the wonderous foreigner. His father-in-law was priest of On, a city dedicated to the worship of the sun.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh Genesis 12:17. Abimelek acknowledges the God of Abraham and Isaac Genesis 20:3-7; Genesis 21:22-23; Genesis 26:28-29. And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Abimelek acknowledges the God of Abraham and Isaac ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:3-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:22-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:28-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service Numbers 4:3. He immediately enters upon his office.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He immediately enters upon his office.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41. Pharaoh said, … See, I have set thee over all the land—These words were preliminary to investiture with the insignia of office, which were these: the signet-ring, used for signing public documents, and its impression was more valid than the sign-manual of the king; the khelaat or dress of honor, a coat of finely wrought linen, or rather cotton, worn only by the highest personages; the gold necklace, a badge of rank, the plain or ornamental form of it indicating the degree of rank and dignity; the privilege of riding in a state carriage, the second chariot; and lastly—",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His ring",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was both a token of highest dignity, and an instrument of greatest power, by which he had authority to make and sign what decrees he thought fit in the king’s name. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Esther 3:10 8:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 8:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". With ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "fine linen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the greatest potentates were arrayed. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Proverbs 31:22,24 Eze 16:10 Luke 16:19 Revelation 19:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 31:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",24 Eze 16:10 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 19:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A gold chain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was another badge of great honour. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Proverbs 1:9 Ezekiel 16:11 Daniel 5:7,16,29",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",16,29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Pharaoh took off his ring from his hand, and put it upon Joseph's hand,.... Which, as it was expressive of the interest he had in his royal favour, so was a token of that high office and great dignity to which he was promoted: thus among the Romans, in later times, when anyone was put into the equestrian order, a ring was given to him (w); for originally none but knights were allowed to wear rings; and it was sometimes used to design a successor in the kingdom, as, when Alexander was dying, he took his ring from off his finger, and gave it to Perdicca (x), which was understood, though he did not express it, that he should be his successor, in the Apocrypha:\"14 Then called he for Philip, one of his friends, who he made ruler over all his realm, 15 And gave him the crown, and his robe, and his signet, to the end he should bring up his son Antiochus, and nourish him up for the kingdom.'' (1 Maccabees 6)Now, though Pharaoh did not by this intend to point out Joseph for his successor in the kingdom, yet he gave him his ring as a mark of honour, and as being in place next unto his viceroy or deputy: and besides, as it is observed by many, this might be his signet, or the ring which had his seal upon it, by which he sealed patents and public deeds, and which he gave to Joseph to make use of in his name; though Schmidt doubts whether this was such a ring, since kings and princes have been used to have larger for such purposes, than what are wore on the finger: by this it appears, that Pliny (y) was mistaken that there were no rings in and before the time of Troy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and arrayed him in vestures of fine linen; of which there was the best sort in Egypt, and which great personages used to wear: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put a gold chain about his neck; another badge of honour and dignity, see Daniel 5:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and put a gold chain about his neck; another badge of honour and dignity, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) Plin. Nat. Hist. l. 33. c. 1.((x) Diodor. Sic. Bibliothec. l. 18. p. 587. Justin. e. Trogo, l. 12. c. 15. (y) Nat. Hist. l. 33. c. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) Plin. Nat. Hist. l. 33. c. 1.((x) Diodor. Sic. Bibliothec. l. 18. p. 587. Justin. e. Trogo, l. 12. c. 15. (y) Nat. Hist. l. 33. c. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Pharaoh took off his ring from his hand, and put it upon Joseph's hand, and arrayed him in vestures of fine linen, and put a gold chain about his neck;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "signet ring",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. the official ring with which state documents would be sealed. The king thus symbolically transferred to Joseph absolute authority. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Ma 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “gave him his diadem and his robe and his signet ring.” See also the use of the king’s ring in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fine linen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Possibly, as R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cotton",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shêsh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has been identified with the Egyptian ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "schenti",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", meaning something woven. LXX and Lat. render it by an adjective meaning “made of byssus,” i.e. fine flax. This was probably the material worn by the royal and state officials. Possibly it was the same material as that in which the Egyptian mummies were wound.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a gold chain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Presumably Pharaoh invested Joseph with his own golden necklace, a sign of honour which the narrative delights to record.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The position to which Joseph is elevated is that of “Grand Vizier” or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "T’ate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as he was called in the Egyptian dialect.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 41:42",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As an installation in this post of honour, the king handed him his signet-ring, the seal which the grand vizier or prime minister wore, to give authority to the royal edicts (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), clothed him in a byssus dress (שׁשׁ, fine muslin or white cotton fabric),",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: See my Bibl. Antiquities, 17, 5. The reference, no doubt, is to the ἐσθῆτα λινέην, worn by the Egyptian priests, which was not made of linen, but of the frutex quem aliqui gossipion vocant, plures xylon et ideo LINA inde facta xylina. Nec ulla sunt eis candore mollitiave praeferenda. - Vestes inde sacerdotibus Aegypti gratissimae. Plin. h.n. xix. 1.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put upon his neck the golden chain, which was usually worn in Egypt as a mark of distinction, as the Egyptian monuments show (Hgst. pp. 30, 31). ",
        "children": []
      }
    ]
  }
]