[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 41:44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Without thee shall no man lift up his hand or foot — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A hyperbolical phrase, signifying that all the affairs of the kingdom should pass through his hands. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Only in the throne will I be greater than thou — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is probable there were those about court that opposed Joseph’s preferment, which occasioned Pharaoh so oft to repeat the grant, and with that solemn sanction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am Pharaoh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hence, besides the honours just mentioned, he also gave him a new name, and such a name as spoke the value he had for him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zaphnath-paaneah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "revealer of secrets; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and he married him honourably to a priest’s, or rather, as the word also signifies, a prince’s daughter. Thus where God had been liberal in giving wisdom and other merits, Pharaoh was not sparing in conferring honours. Now this preferment of Joseph was, 1st, an abundant recompense for his innocent and patient suffering, a lasting instance of the equity and goodness of Providence, and an encouragement to all to trust in a good God; 2d, it was typical of the exaltation of Christ, with great revealer of secrets, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) or, as some translate Joseph’s new name, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saviour of the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The brightest glories of the upper world are upon him, the highest trusts lodged in his hand, and all power given him both in heaven and earth. He is gatherer, keeper, and disposer of all the stores of divine grace, and chief ruler of the kingdom of God among men. The work of ministers is to cry before him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bow the knee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "kiss the Son.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:33-45 Joseph gave good advice to Pharaoh. Fair warning should always be followed by good counsel. God has in his word told us of a day of trial before us, when we shall need all the grace we can have. Now, therefore, provide accordingly. Pharaoh gave Joseph an honourable testimony. He is a man in whom the spirit of God is; and such men ought to be valued. Pharaoh puts upon Joseph marks of honour. He gave him such a name as spoke the value he had for him, Zaphnath-paaneah, a revealer of secrets. This preferment of Joseph encourages all to trust in God. Some translate Joseph's new name, the saviour of the world. The brightest glories, even of the upper world, are put upon Christ, the highest trust lodged in his hand, and all power given him, both in heaven and earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Pharaoh approves of his counsel, and selects him as \"the discreet and wise man\" for carrying it into effect. \"In whom is the Spirit of God.\" He acknowledges the gift that is in Joseph to be from God. \"All my people behave\" - dispose or order their conduct, a special meaning of this word, which usually signifies to kiss. \"His ring.\" His signet-ring gave Joseph the delegated power of the sovereign, and constituted him his prime minister or grand vizier. \"Vestures of fine linen.\" Egypt was celebrated for its flax, and for the fineness of its textures. The priests were arrayed in official robes of linen, and no man was allowed to enter a temple in a woolen garment (Herodotus ii. 37, 81). \"A gold chain about his neck.\" This was a badge of office worn in Egypt by the judge and the prime minister. It had a similar use in Persia and Babylonia ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The second chariot.\" Egypt was noted for chariots, both for peaceful and for warlike purposes (Herodotus ii. 108). The second in the public procession was assigned to Joseph. \"Bow the knee.\" The various explications of this proclamation agree in denoting a form of obeisance, with which Joseph was to be honored. I am Pharaoh, the king ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Without thee shall no man lift up his hand or foot.\" Thou art next to me, and without thee no man shall act or move. \"Zaphenath-paneah.\" Pharaoh designates him the preserver of life, as the interpreter of the dream and the proposer of the plan by which the country was saved from famine. He thus naturalizes him so far as to render his civil status compatible with his official rank. \"Asenath.\" The priests were the highest and most privileged class in Egypt. Intermarriage with this caste at once determined the social position of the wonderous foreigner. His father-in-law was priest of On, a city dedicated to the worship of the sun.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh Genesis 12:17. Abimelek acknowledges the God of Abraham and Isaac Genesis 20:3-7; Genesis 21:22-23; Genesis 26:28-29. And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With our Western and modern habit we may at the first glance be surprised to find a stranger of a despised race suddenly elevated to the second place in the kingdom. But in ancient and Eastern governments, which were of a despotic character, such changes, depending on the will of the sovereign, were by no means unusual. Secondly, the conviction that \"the Spirit of God was in\" the mysterious stranger, was sufficient to overbear all opposing feelings or customs. And, lastly, it was assumed and acted on, as a self-evident fact, that the illustrious stranger could have no possible objection to be incorporated into the most ancient of nations, and allied with its noblest families. We may imagine that Joseph would find an insuperable difficulty in becoming a citizen of Egypt or a son-in-law of the priest of the sun. But we should not forget that the world was yet too young to have arrived at the rigid and sharplydefined systems of polytheism or allotheism to which we are accustomed. Some gray streaks of a pure monotheism, of the knowledge of the one true God, still gleamed across the sky of human memory. Some faint traces of one common brotherhood among mankind still lingered in the recollections of the past. The Pharaoh of Abraham's day feels the power of him whose name is Yahweh ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Abimelek acknowledges the God of Abraham and Isaac ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:3-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:22-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:28-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And while Joseph is frank and faithful in acknowledging the true God before the king of Egypt, Pharaoh himself is not slow to recognize the man in whom the Spirit of God is. Having experienced the omniscience and omnipotence of Joseph's God, he was prepared, no doubt, not only himself to offer him such adoration as he was accustomed to pay to his national gods, but also to allow Joseph full liberty to worship the God of his fathers, and to bring up his family in that faith.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service Numbers 4:3. He immediately enters upon his office.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Joseph was now in his thirtieth year, and had consequently been thirteen years in Egypt, most part of which interval he had probably spent in prison. This was the age for manly service ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He immediately enters upon his office.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44. These ceremonies of investiture were closed in usual form by the king in council solemnly ratifying the appointment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am Pharaoh, and without thee, &c.—a proverbial mode of expression for great power.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am Pharaoh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. I only am the king, I reserve to myself the sovereign power over thee, and over all. As the name of Caesar among the Romans was commonly used for the emperor, so the name of Pharaoh for the king. Or thus, I have the supreme power, and therefore as I have authority to give thee the following power, so I will make it good to thee, and oblige all my people to observe and obey thee. No man shall do any thing in the public affairs of the kingdom concerning matters of war or peace without thy commission or licence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Pharaoh said unto Joseph, I am Pharaoh,.... Or I am king, which the word Pharaoh signifies, as Josephus (z) says; and that this is not a proper name, but a title of office, seems plain from these words; and the sense either is, that though Pharaoh had raised Joseph to such high honour and dignity, yet he alone was king: or this he said to show his power and authority to do what he had done, and would stand by him, and support him in his office and grandeur: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and without thee shall not a man lift up his hand or foot in all the land of Egypt; which is to be taken not in a strict literal sense, but proverbially, signifying, that nothing should be done in the nation of any moment or importance, relating to political affairs, but what was by his order and authority; the hands and feet being the principal instruments of action. The Targum of Jonathan is,\"without thy word (or order) a man shall not lift up his hand to gird on armour, or his foot to mount a horse;''signifying thereby, that all things relating to war and peace should be altogether under his direction. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Antiqu. l. 8. c. 6. sect. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Antiqu. l. 8. c. 6. sect. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Pharaoh said unto Joseph, I am Pharaoh, and without thee shall no man lift up his hand or foot in all the land of Egypt.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 44.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Pharaoh-said unto Joseph, I am Pharaoh, and without thee shall no man lift up his hand or foot in all the land of Egypt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Joseph's authority was to be absolute and universal. Genesis 41:44",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"I am Pharaoh,\" he said to him, \"and without thee shall no man lift his hand or foot in all the land of Egypt;\" i.e., I am the actual king, and thou, the next to me, shalt rule over all my people. ",
        "children": []
      }
    ]
  }
]