[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 41:50",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:50",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Two sons — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the names he gave them, he owned the divine providence giving this happy turn to his affairs. He was made to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forget his misery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but could he be so unnatural as to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forget all his father’s house? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And he was made ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fruitful in the land of his affliction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It had been the land of his affliction, and, in some sense, it was still so, for his distance from his father was still his affliction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fruitfulness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Manasseh, forgetfulness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:46-57 In the names of his two sons, Manasseh and Ephraim, Joseph owned the Divine providence. 1. He was made to forget his misery. 2. He was made fruitful in the land of his affliction. The seven plenteous years came, and were ended. We ought to look forward to the end of the days, both of our prosperity and of our opportunity. We must not be secure in prosperity, nor slothful in making good use of opportunity. Years of plenty will end; what thy hand finds to do, do it; and gather in gathering time. The dearth came, and the famine was not only in Egypt, but in other lands. Joseph was diligent in laying up, while the plenty lasted. He was prudent and careful in giving out, when the famine came. Joseph was engaged in useful and important labours. Yet it was in the midst of this his activity that his father Jacob said, Joseph is not! What a large portion of our troubles would be done away if we knew the whole truth! Let these events lead us to Jesus. There is a famine of the bread of life throughout the whole earth. Go to Jesus, and what he bids you, do. Attend to His voice, apply to him; he will open his treasures, and satisfy with goodness the hungry soul of every age and nation, without money and without price. But those who slight this provision must starve, and his enemies will be destroyed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Two sons were born to Joseph during the seven years of plenty. \"Menasseh.\" God made him forget his toil and his father's house. Neither absolutely. He remembered his toils in the very utterance of this sentence. And he tenderly and intensely remembered his father's house. But he is grateful to God, who builds him a home, with all its soothing joys, even in the land of his exile. His heart again responds to long untasted joys. \"Fruitful in the land of my affliction.\" It is still, we perceive, the land of his affliction. But why does no message go from Joseph to his mourning father? For many reasons. First, he does not know the state of things at home. Secondly, he may not wish to open up the dark and bloody treachery of his brothers to his aged parent. But, thirdly, he bears in mind those early dreams of his childhood. All his subsequent experience has confirmed him in the belief that they will one day be fulfilled. But that fulfillment implies the submission not only of his brothers, but of his father. This is too delicate a matter for him to interfere in. He will leave it entirely to the all-wise providence of his God to bring about that strange issue. Joseph, therefore, is true to his life-long character. He leaves all in the hand of God, and awaits in anxious, but silent hope, the days when he will see his father and his brethren.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "50-52. unto Joseph were born two sons—These domestic events, which increased his temporal happiness, develop the piety of his character in the names conferred upon his children.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And unto Joseph were born two sons,.... The word for \"born\" is singular; hence Ben Melech conjectures that they were twins: and this was ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "before the years of famine came; or \"the year of famine\" (q); the first year: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which Asenath, the daughter of Potipherah priest of On, bare unto him; which is observed, to show that he had them by his lawful wife; whom the Targum of Jonathan wrongly again makes the daughter of Dinah, and her father prince of Tanis, the same with Zoan; whereas this was \"On\" or \"Heliopolis\", a very different place; so Artapanus says (r), that Joseph married the daughter of the priest of Heliopolis, by whom he had children; and another Heathen writer (s) mentions their names, Ephraim and Manesseh. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q)  \"annus famis\", Tigurine version, Pagninus, Montanus, Drusius; \"annus (primus) famis\", Schmidt. (r) Apud Euseb. Praepar. Evangel. l. 9. c. 23. p. 429. (s) Polyhistor. apud ib. p. 424. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q)  \"annus famis\", Tigurine version, Pagninus, Montanus, Drusius; \"annus (primus) famis\", Schmidt. (r) Apud Euseb. Praepar. Evangel. l. 9. c. 23. p. 429. (s) Polyhistor. apud ib. p. 424. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And unto Joseph were born two sons before the years of famine came, which Asenath the daughter of Potipherah priest of On bare unto him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 50, 51.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And unto Joseph wore born two sons before the years of famine came,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "before the coming of the gears of famine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ", which Asenath the daughter of Poti-pherah priest of On bare unto him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "which Asenath the daughter of Poti-pherah priest of On bare unto him.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Joseph called, the name of the firstborn Manasseh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (\"Forgetting,\" from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nashah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to forget): ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Elohim; Joseph not at the moment thinking of his son's birth in its relations to the theocratic kingdom, but simply in its connection with the overruling providence of God which had been so signally illustrated in his elevation, from a position of obscurity in Canaan to such conspicuous honor in the land of the Pharaohs), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "said he, hath made me forget all my toil, and all my father's house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not absolutely (Calvin, who censures Joseph on this account, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vix tamen in totem potest excusari oblivio paternae domus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ", as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " events subsequently proved, but relatively, the pressure of his former affliction being relieved by his present happiness, and the loss of his father's house in some degree compensated by the building of a house for himself. Genesis 41:50",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "During the fruitful years two sons were born to Joseph. The first-born he named Manasseh, i.e., causing to forget; \"for, he said, God hath made me forget all my toil and all my father's house (נשּׁני, an Aram. Piel form, for נשּׁני, on account of the resemblance in sound to מנשּׁה).\" Haec pia est, ac sancta gratiarum actio, quod Deus oblivisci eum fecit pristinas omnes areumnas: sed nullus honor tanti esse debuit, ut desiderium et memoriam paternae domus ex animo deponeret (Calvin). But the true answer to that question, whether it was a Christian boast for him to make, that he had forgotten father and mother, is given by Luther: \"I see that God would take away the reliance which I placed upon my father; for God is a jealous God, and will not suffer the heart to have any other foundation to rely upon, but Him alone.\" This also meets the objection raised by Theodoret, why Joseph did not inform his father of his life and promotion, but allowed so may years to pass away, until he was led to do so at last in consequence of the arrival of his brothers. The reason of this forgetfulness and silence can only be found in the fact, that through the wondrous alteration in his condition he had been led to see, that he was brought to Egypt according to the counsel of God, and was redeemed by God from slavery and prison, and had been exalted by Him to be lord over Egypt; so that, knowing he was in the hand of God, the firmness of his faith led him to renounce all wilful interference with the purposes of God, which pointed to a still broader and more glorious goal (Baumgarten, Delitzsch). ",
        "children": []
      }
    ]
  }
]