[{"header":"Chapter 11"},{"num":1,"verse":"Northern Confederacy. When Jabin, king of Hazor, learned of this, he sent a message to Jobab, king of Madon, to the king of Shimron, to the king of Achshaph, "},{"num":2,"verse":"and to the northern kings in the mountain regions and in the Arabah near Chinneroth, in the Shephelah, and in Naphath-dor to the west. "},{"num":3,"verse":"These were Canaanites to the east and west, Amorites, Hittites, Perizzites, and Jebusites in the mountain regions, and Hivites at the foot of Hermon in the land of Mizpah. "},{"num":4,"verse":"They came out with all their troops, an army numerous as the sands on the seashore, and with a multitude of horses and chariots. "},{"num":5,"verse":"All these kings made a pact and together they marched to the waters of Merom, where they encamped to fight against Israel."},{"num":6,"verse":"The Lord said to Joshua, “Do not fear them, for by this time tomorrow I will present them slain to Israel. You must hamstring their horses and burn their chariots.” "},{"num":7,"verse":"Joshua with his whole army came upon them suddenly at the waters of Merom and fell upon them. "},{"num":8,"verse":"The Lord delivered them into the power of the Israelites, who defeated them and pursued them to Greater Sidon, to Misrephoth-maim, and eastward to the valley of Mizpeh. They struck them all down, leaving no survivors. "},{"num":9,"verse":"Joshua did to them as the Lord had commanded: he hamstrung their horses and burned their chariots."},{"num":10,"verse":"Conquest of Northern Canaan. At that time Joshua, turning back, captured Hazor and struck down its king with the sword; for Hazor formerly was the chief of all those kingdoms. "},{"num":11,"verse":"He also struck down with the sword every person there, carrying out the ban, till none was left alive. Hazor itself he burned. "},{"num":12,"verse":"All the cities of those kings, and the kings themselves, Joshua captured and put to the sword, carrying out the ban on them, as Moses, the servant of the Lord, had commanded. "},{"num":13,"verse":"However, Israel did not destroy by fire any of the cities built on their mounds, except Hazor, which Joshua burned. "},{"num":14,"verse":"All the spoil and livestock of these cities the Israelites took as plunder; but the people they put to the sword, until they had destroyed the last of them, leaving none alive. "},{"num":15,"verse":"As the Lord had commanded his servant Moses, so Moses commanded Joshua, and Joshua acted accordingly. He left nothing undone that the Lord had commanded Moses should be done."},{"num":16,"verse":"Survey of the Conquest. So Joshua took all this land: the mountain regions, the entire Negeb, all the land of Goshen, the Shephelah, the Arabah, as well as the mountain regions and Shephelah of Israel, "},{"num":17,"verse":"from Mount Halak that rises toward Seir as far as Baal-gad in the Lebanon valley at the foot of Mount Hermon. All their kings he captured and put to death. "},{"num":18,"verse":"Joshua waged war against all these kings for a long time. "},{"num":19,"verse":"With the exception of the Hivites who lived in Gibeon, no city made peace with the Israelites; all were taken in battle. "},{"num":20,"verse":"For it was the Lord’s doing to make their hearts obstinate to meet Israel in battle, that they might be put under the ban without mercy, and be destroyed as the Lord had commanded Moses."},{"num":21,"verse":"At that time Joshua penetrated the mountain regions and exterminated the Anakim in Hebron, Debir, Anab, the entire mountain region of Judah, and the entire mountain region of Israel. Joshua put them and their cities under the ban, "},{"num":22,"verse":"so that no Anakim were left in the land of the Israelites. However, some survived in Gaza, in Gath, and in Ashdod. "},{"num":23,"verse":"Thus Joshua took the whole land, just as the Lord had said to Moses. Joshua gave it to Israel as their heritage, apportioning it among the tribes. And the land had rest from war."}]