[{"header":"Chapter 11"},{"num":1,"verse":"Conquest of the North. When Jabin, the king of Hazor, heard about this, he sent to Jobab, the king of Madon, to the king of Shimron, to the king of Achshaph,"},{"num":2,"verse":"to the kings from the north who lived in the mountains, in the Arabah south of Chinneroth, in the western slopes, and in the highlands in Naphath-dor in the west,"},{"num":3,"verse":"to the Canaanites who lived in the east and the west, to the Amorites, the Hittites, the Perizzites, the Jebusites who lived in the mountains, and to the Hivites who lived below Hermon in the land of Mizpah."},{"num":4,"verse":"They went out along with all of their armies. There were as many of them as there is sand on the shore of the sea, along with a very large number of horses and chariots."},{"num":5,"verse":"When all of these kings gathered together, they went and camped around the waters of Merom to do battle with Israel."},{"num":6,"verse":"The Lord said to Joshua, “Do not be afraid of them, for tomorrow, around this time, I will deliver all of them up to be slain by Israel. You are to hamstring their horses and burn their chariots.”"},{"num":7,"verse":"Joshua and the whole army with him surprised them at the waters of Merom and attacked them."},{"num":8,"verse":"The Lord delivered them into the hands of the Israelites who defeated them and pursued them to Greater Sidon, to Misrephoth-maim and to the valley of Mizpah in the east. They continued to slay them until there were no survivors."},{"num":9,"verse":"Joshua did as the Lord had directed: the horses were hamstrung and the chariots were burned."},{"num":10,"verse":"Joshua then turned back to Hazor and he captured it, putting its king to the sword. (Hazor had been at the head of all of those kingdoms.)"},{"num":11,"verse":"They also put everyone in it to the sword. They totally destroyed it, not leaving any survivors, and they burned Hazor to the ground."},{"num":12,"verse":"Joshua captured all of these cities and their kings and he put them to the sword. He totally destroyed them, as the Lord had commanded Moses, his servant."},{"num":13,"verse":"But as for the cities built upon mounds, Israel did not burn any of them except for Hazor which Joshua burned."},{"num":14,"verse":"The Israelites carried off the cattle and the spoils from these cities for themselves, but they put every person to the sword, totally destroying them and not leaving any survivors."},{"num":15,"verse":"Whatever the Lord had commanded Moses is what Moses commanded Joshua, and Joshua did these things. He left nothing undone from everything that the Lord had commanded Moses."},{"num":16,"verse":"Joshua’s Conquests as Ordered by Moses. Joshua conquered the entire land: the hill country, the Negeb, the whole of Goshen, the western slopes, the Arabah, and the mountains of Israel with their foothills,"},{"num":17,"verse":"from Mount Halak and the uplands toward Seir, up to Baal-gad in the Valley of Lebanon beneath Mount Hermon. He captured all of their kings and he struck them down, putting them to death."},{"num":18,"verse":"Joshua waged war upon all of these kings for a long time."},{"num":19,"verse":"The Israelites conquered them all in battle. They did not make a covenant of peace with any city except with the Hivites who lived in Gibeon."},{"num":20,"verse":"It was the Lord himself who had hardened their hearts so that they fought against Israel and thus he might totally wipe them out, exterminating them without mercy, as the Lord had commanded Moses to do."},{"num":21,"verse":"It was at that time that Joshua went and crushed the Anakim from the mountain country, from Hebron, from Debir, from Anab, from all of the hill country of Judah, and from all of the hill country of Israel. Joshua totally wiped them out along with their cities."},{"num":22,"verse":"No Anakim were left in the land of the Israelites. The only ones who survived lived in Gaza, Gath, and Ashdod."},{"num":23,"verse":"So Joshua conquered the entire land just as the Lord had directed Moses to do. Joshua gave it to Israel following their tribal divisions, and there was a respite from fighting in the land."}]