[{"header":"The Lord Will Bless You if You Obey"},{"num":1,"verse":"Today I am giving you the laws and teachings of the Lord your God. Always obey them, and the Lord will make Israel the most famous and important nation on earth, and he will bless you in many ways."},{"num":3,"verse":"The Lord will make your businesses and your farms successful."},{"num":4,"verse":"You will have many children. You will harvest large crops, and your herds of cattle and flocks of sheep and goats will produce many young."},{"num":5,"verse":"You will have plenty of bread to eat."},{"num":6,"verse":"The Lord will make you successful in your daily work."},{"num":7,"verse":"The Lord will help you defeat your enemies and make them scatter in all directions."},{"num":8,"verse":"The Lord your God is giving you the land, and he will make sure you are successful in everything you do. Your harvests will be so large that your storehouses will be full."},{"num":9,"verse":"If you follow and obey the Lord, he will make you his own special people, just as he promised. "},{"num":10,"verse":"Then everyone on earth will know that you belong to the Lord, and they will be afraid of you."},{"num":11,"verse":"The Lord will give you a lot of children and make sure that your animals give birth to many young. The Lord promised your ancestors that this land would be yours, and he will make it produce large crops for you."},{"num":12,"verse":"The Lord will open the storehouses of the skies where he keeps the rain, and he will send rain on your land at just the right times. He will make you successful in everything you do. You will have plenty of money to lend to other nations, but you won’t need to borrow any yourself."},{"num":13,"verse":"Obey the laws and teachings that I’m giving you today, and the Lord your God will make Israel a leader among the nations, and not a follower. Israel will be wealthy and powerful, not poor and weak. "},{"num":14,"verse":"But you must not reject any of his laws and teachings or worship other gods."},{"header":"The Lord Will Put Curses on You if You Disobey"},{"num":15,"verse":"Israel, today I am giving you the laws and teachings of the Lord your God. And if you don’t obey them all, he will put many curses on you."},{"num":16,"verse":"Your businesses and farms will fail."},{"num":17,"verse":"You won’t have enough bread  to eat."},{"num":18,"verse":"You’ll have only a few children, your crops will be small, and your herds of cattle and flocks of sheep and goats won’t produce many young."},{"num":19,"verse":"The Lord will make you fail in everything you do."},{"num":20,"verse":"No matter what you try to accomplish, the Lord will confuse you, and you will feel his anger. You won’t last long, and you may even meet with disaster, all because you rejected the Lord."},{"num":21,"verse":"The Lord will send terrible diseases to attack you, and you will never be well again. You will suffer with burning fever and swelling and pain until you die somewhere in the land that you captured."},{"num":24,"verse":"He will send dust and sandstorms instead of rain, and you will be wiped out."},{"num":25,"verse":"The Lord will let you be defeated by your enemies, and you will scatter in all directions. You will be a horrible sight for the other nations to see, "},{"num":26,"verse":"and no one will disturb the birds and wild animals while they eat your dead bodies."},{"num":27,"verse":"The Lord will make you suffer with diseases that will cause oozing sores or crusty itchy patches on your skin or boils like the ones that are common in Egypt. And there will be no cure for you! "},{"num":28,"verse":"You will become insane and go blind. The Lord will make you so confused, "},{"num":29,"verse":"that even in bright sunshine you will have to feel your way around like a blind person, who cannot tell day from night. For the rest of your life, people will beat and rob you, and no one will be able to stop them."},{"num":30,"verse":"A man will be engaged to a woman, but before they can get married, she will be raped by enemy soldiers. Some of you will build houses, but never get to live in them. If you plant a vineyard, you won’t be around long enough to enjoy the first harvest. "},{"num":31,"verse":"Your cattle will be killed while you watch, but you won’t get to eat any of the meat. Your donkeys and sheep will be stolen from you, and no one will be around to force your enemies to give them back. "},{"num":32,"verse":"Your sons and daughters will be dragged off to a foreign country, while you stand there helpless. And even if you watch for them until you go blind, you will never see them again."},{"num":33,"verse":"You will work hard on your farms, but everything you harvest will be eaten by foreigners, who will mistreat you and abuse you for the rest of your life."},{"num":34,"verse":"What you see will be so horrible that you will go insane, "},{"num":35,"verse":"and the Lord will punish you from head to toe with boils that never heal."},{"num":36,"verse":"The Lord will let you and your king be taken captive to a country that you and your ancestors have never even heard of, and there you will have to worship idols made of wood and stone. "},{"num":37,"verse":"People of nearby countries will shudder when they see your terrible troubles, but they will still make fun of you."},{"num":38,"verse":"You will plant a lot of seed, but gather a small harvest, because locusts will eat your crops. "},{"num":39,"verse":"You will plant vineyards and work hard at taking care of them, but you won’t gather any grapes, much less get any wine, and the vines themselves will be eaten by worms. "},{"num":40,"verse":"Even if your olive trees grow everywhere in your country, the olives will fall off before they are ready, and there won’t be enough olive oil for combing your hair."},{"num":41,"verse":"Even your infant sons and daughters will be taken as prisoners of war."},{"num":42,"verse":"Locusts will eat your crops and strip your trees of leaves and fruit."},{"num":43,"verse":"Foreigners in your towns will become wealthy and powerful, while you become poor and powerless. "},{"num":44,"verse":"You will be so short of money that you will have to borrow from those foreigners. They will be the leaders in the community, and you will be the followers."},{"header":"More Curses for Disobedience"},{"num":45,"verse":"Israel, if you don’t obey the laws and teachings that the Lord your God is giving you, he will send these curses to chase, attack, and destroy you. "},{"num":46,"verse":"Then everyone will look at you and your descendants and realize that the Lord has placed you under a curse."},{"num":47,"verse":"If the Lord makes you wealthy, but you don’t joyfully worship and honor him, "},{"num":48,"verse":"he will send enemies to attack you and make you their slaves. Then you will live in poverty with nothing to eat, drink, or wear, and your owners will work you to death."},{"num":49,"verse":"Foreigners who speak a strange language will be sent to attack you without warning, just like an eagle swooping down. "},{"num":50,"verse":"They won’t show any mercy, and they will have no respect for old people or pity for children. "},{"num":51,"verse":"They will take your cattle, sheep, goats, grain, wine, and olive oil, then leave you to starve."},{"num":52,"verse":"All over the land that the Lord your God gave you, the enemy army will surround your towns. You may feel safe inside your town walls, but the enemy will tear them down, "},{"num":53,"verse":"while you wait in horror. Finally, you will get so hungry that you will eat the sons and daughters that the Lord gave you. "},{"num":54,"verse":"Because of hunger, a man who had been gentle and kind will eat his own children and refuse to share the meal with his brother or wife or with his other children. "},{"num":56,"verse":"A woman may have grown up in such luxury that she never had to put a foot on the ground. But times will be so bad that she will secretly eat both her newborn baby and the afterbirth, without sharing any with her husband or her other children."},{"header":"Disobedience Brings Destruction"},{"num":58,"verse":"You must obey everything in The Book of God’s Law. Because if you don’t respect the Lord, "},{"num":59,"verse":"he will punish you and your descendants with incurable diseases, "},{"num":60,"verse":"like those you were so afraid of in Egypt. "},{"num":61,"verse":"Remember! If the Lord decides to destroy your nation, he can use any disease or disaster, not just the ones written in The Book of God’s Law."},{"num":62,"verse":"There are as many of you now as the stars in the sky, but if you disobey the Lord your God, only a few of you will be left. "},{"num":63,"verse":"The Lord is happy to make you successful and to help your nation grow while you conquer the land. But if you disobey him, he will be just as happy to pull you up by your roots."},{"num":64,"verse":"Those of you that survive will be scattered to every nation on earth, and you will have to worship stone and wood idols that never helped you or your ancestors. "},{"num":65,"verse":"You will be restless—always longing for home, but never able to return. "},{"num":66,"verse":"You will live in constant fear of death. "},{"num":67,"verse":"Each morning you will wake up to such terrible sights that you will say, “I wish it were night!” But at night you will be terrified and say, “I wish it were day!”"},{"num":68,"verse":"I told you never to go back to Egypt. But now the Lord himself will load you on ships and send you back. Then you will even try to sell yourselves as slaves, but no one will be interested."}]