[{"num":28,"verse":"“If you listen closely to what Adonai your God says, observing and obeying all his mitzvot which I am giving you today, Adonai your God will raise you high above all the nations on earth; "},{"num":2,"verse":"and all the following blessings will be yours in abundance — if you will do what Adonai your God says:"},{"num":3,"verse":"“A blessing on you in the city, and a blessing on you in the countryside."},{"num":4,"verse":"“A blessing on the fruit of your body, the fruit of your land and the fruit of your livestock — the young of your cattle and flocks."},{"num":5,"verse":"“A blessing on your grain-basket and kneading-bowl."},{"num":6,"verse":"“A blessing on you when you go out, and a blessing on you when you come in."},{"num":7,"verse":"(vi) “Adonai will cause your enemies attacking you to be defeated before you; they will advance on you one way and flee before you seven ways."},{"num":8,"verse":"“Adonai will order a blessing to be with you in your barns and in everything you undertake; he will bless you in the land Adonai your God is giving you."},{"num":9,"verse":"“Adonai will establish you as a people separated out for himself, as he has sworn to you — if you will observe the mitzvot of Adonai your God and follow his ways. "},{"num":10,"verse":"Then all the peoples on earth will see that Adonai’s name, his presence, is with you; so that they will be afraid of you."},{"num":11,"verse":"“Adonai will give you great abundance of good things — of the fruit of your body, the fruit of your livestock and the fruit of your land in the land Adonai swore to your ancestors to give you. "},{"num":12,"verse":"Adonai will open for you his good treasure, the sky, to give your land its rain at the right seasons and to bless everything you undertake. You will lend to many nations and not borrow; "},{"num":13,"verse":"Adonai will make you the head and not the tail; and you will be only above, never below — if you will listen to, observe and obey the mitzvot of Adonai your God "},{"num":14,"verse":"and not turn away from any of the words I am ordering you today, neither to the right nor to the left, to follow after other gods and serve them."},{"num":15,"verse":"“But if you refuse to pay attention to what Adonai your God says, and do not observe and obey all his mitzvot and regulations which I am giving you today, then all the following curses will be yours in abundance:"},{"num":16,"verse":"“A curse on you in the city, and a curse on you in the countryside."},{"num":17,"verse":"“A curse on your grain-basket and kneading-bowl."},{"num":18,"verse":"“A curse on the fruit of your body, the fruit of your land and the young of your cattle and flocks."},{"num":19,"verse":"“A curse on you when you come in, and a curse on you when you go out."},{"num":20,"verse":"“Adonai will send on you curses, disasters and frustration in everything you set out to do, until you are destroyed and quickly perish, because of your evil actions in abandoning me."},{"num":21,"verse":"“Adonai will bring on you a plague that will stay with you until he has exterminated you from the land you are entering in order to take possession of it. "},{"num":22,"verse":"Adonai will strike you down with wasting diseases, fever, inflammation, fiery heat, drought, blasting winds and mildew; and they will pursue you until you perish."},{"num":23,"verse":"“The sky over your head will be brass and the earth under you iron. "},{"num":24,"verse":"Adonai will turn the rain your land needs into powder and dust that will fall on you from the sky until you are destroyed."},{"num":25,"verse":"“Adonai your God will cause you to be defeated before your enemies; you will advance on them one way and flee before them seven. You will become an object of horror to every kingdom on earth. "},{"num":26,"verse":"Your carcasses will become food for all the birds in the air and the wild animals, and there will be no one to scare them away."},{"num":27,"verse":"Adonai will strike you down with the boils that broke out on the Egyptians, tumors, skin lesions and itching, all incurable. "},{"num":28,"verse":"Adonai will strike you with insanity, blindness and utter confusion. "},{"num":29,"verse":"You will grope about at noon like a blind person groping in the dark, unable to find your way."},{"num":30,"verse":"You will get engaged to a woman, but another man will marry her. You will build a house but not live in it. You will plant a vineyard but not use its fruit. "},{"num":31,"verse":"Your ox will be slaughtered before your eyes, but you won’t eat any of its meat. Your donkey will be taken away from you by force as you watch, and you won’t get it back. Your sheep will be given to your enemies, and there will be no one to help you. "},{"num":32,"verse":"Your sons and daughters will be handed over to another people; you will watch for them longingly all day but not see them; and there will be nothing you can do about it. "},{"num":33,"verse":"A nation unknown to you will eat the fruit of your land and labor. Yes, you will be continually oppressed and crushed, "},{"num":34,"verse":"till you go crazy from what your eyes have to see. "},{"num":35,"verse":"Adonai will strike you down in the knees and legs with painful and incurable boils; they will spread from the sole of your foot to the crown of your head. "},{"num":36,"verse":"Adonai will bring you and your king whom you have put over yourselves to a nation you have not known, neither you nor your ancestors; and there you will serve other gods made of wood and stone. "},{"num":37,"verse":"You will be so devastated as to become a proverb and a laughingstock among all the peoples to which Adonai will drive you."},{"num":38,"verse":"“You will carry much seed out to the field but gather little in, because locusts will devour it. "},{"num":39,"verse":"You will plant vineyards and dress them but neither drink the wine nor gather the grapes, because worms will eat them. "},{"num":40,"verse":"You will have olive trees throughout your territory but not anoint yourself with the oil, because your olives will fall off unripe. "},{"num":41,"verse":"You will father sons and daughters, but they won’t belong to you, because they will go into captivity. "},{"num":42,"verse":"The bugs will inherit all your trees and the produce of your land."},{"num":43,"verse":"“The foreigner living with you will rise higher and higher while you sink lower and lower. "},{"num":44,"verse":"He will lend to you, but you will not lend to him; he will be the head and you the tail."},{"num":45,"verse":"“All these curses will come on you, pursuing you and overtaking you until you are destroyed, because you didn’t pay attention to what Adonai your God said, observing his mitzvot and regulations that he gave you. "},{"num":46,"verse":"These curses will be on you and your descendants as a sign and a wonder forever. "},{"num":47,"verse":"Because you didn’t serve Adonai your God with joy and gladness in your heart when you had such an abundance of everything; "},{"num":48,"verse":"Adonai will send your enemy against you; and you will serve him when you are hungry, thirsty, poorly clothed and lacking everything; he will put a yoke of iron on your neck until he destroys you. "},{"num":49,"verse":"Yes, Adonai will bring against you a nation from far away that will swoop down on you from the end of the earth like a vulture, a nation whose language you don’t understand, "},{"num":50,"verse":"a nation grim in appearance, whose people neither respect the old nor pity the young. "},{"num":51,"verse":"They will devour the offspring of your livestock and the produce of your soil, until you have been destroyed. They will leave you without grain, wine, olive oil, or your young cattle and sheep — until they have caused you to perish. "},{"num":52,"verse":"They will besiege all your towns until your high, fortified walls, in which you trusted, collapse everywhere in your land, which Adonai your God gave you. "},{"num":53,"verse":"Then, because of the severity of the siege and distress that your enemies are inflicting on you, you will eat the offspring of your own body, the flesh of your own sons and daughters, whom Adonai your God has given you. "},{"num":54,"verse":"Even the most gentle and sensitive man among you will be without pity for his brother, his beloved wife or his surviving children, "},{"num":55,"verse":"to the degree that he will refuse to share with any of them the flesh of his children whom he is eating; because if he did, he would have nothing left for himself — in the severity of the siege and distress your enemies are inflicting on you in all your towns. "},{"num":56,"verse":"The most delicate and sensitive woman among you, so sensitive and delicate that she wouldn’t think of touching the sole of her foot to the ground, will so begrudge her own beloved husband, son and daughter "},{"num":57,"verse":"that she will secretly eat the afterbirth that comes out of her and even her own children as she bears them — so desperately hungry will she be in the severity of the siege and distress your enemies are inflicting on you in your towns."},{"num":58,"verse":"“If you will not observe and obey all the words of this Torah that are written in this book, so that you will fear this glorious and awesome name, Adonai your God; "},{"num":59,"verse":"then Adonai will strike down you and your descendants with extraordinary plagues and severe sicknesses that go on and on. "},{"num":60,"verse":"He will bring back upon you all the diseases the Egyptians had, which you were in dread of; and they will cling to you. "},{"num":61,"verse":"Not only that, but Adonai will bring upon you all the sicknesses and plagues that are not written in this book of the Torah — until you are destroyed. "},{"num":62,"verse":"You will be left few in number, whereas you were once as numerous as the stars in the sky — because you did not pay attention to the voice of Adonai your God."},{"num":63,"verse":"“Thus it will come about that just as once Adonai took joy in seeking to do you good and increase your numbers, so now Adonai will take joy in causing you to perish and be destroyed, and you will be plucked off the land you are entering in order to take possession of it. "},{"num":64,"verse":"Adonai will scatter you among all peoples from one end of the earth to the other, and there you will serve other gods, made of wood and stone, which neither you nor your ancestors have known. "},{"num":65,"verse":"Among these nations you will not find repose, and there will be no rest for the sole of your foot; rather Adonai will give you there anguish of heart, dimness of eyes and apathy of spirit. "},{"num":66,"verse":"Your life will hang in doubt before you; you will be afraid night and day and have no assurance that you will stay alive. "},{"num":67,"verse":"In the morning you will say, ‘Oh, how I wish it were evening!’ and in the evening you will say, ‘Oh, how I wish it were morning!’ — because of the fear overwhelming your heart and the sights your eyes will see. "},{"num":68,"verse":"Finally, Adonai will bring you back in ships to Egypt, the place of which I said to you, ‘You will never ever see it again’; and there you will try to sell yourselves as slaves to your enemies, but no one will buy you.”"},{"num":29,"verse":"These are the words of the covenant which Adonai ordered Moshe to make with the people of Isra’el in the land of Mo’av, in addition to the covenant which he made with them in Horev."}]