[{"header":"Blessings for Obeying"},{"num":28,"verse":"You must completely ·obey [listen to the voice of] the Lord your God, and you must carefully follow all his commands I am ·giving [commanding] you today. Then the Lord your God will ·make you greater [set you higher] than any other nation on earth. "},{"num":2,"verse":"·Obey [Listen to the voice of] the Lord your God so that all these blessings will come and ·stay with [overtake] you:"},{"num":3,"verse":"You will be blessed in the city and blessed in the ·country [field]."},{"num":4,"verse":"·Your children [The fruit of your womb] will be blessed, as well as ·your crops [the fruit of your land]; your ·herds [the fruit of your livestock] will be blessed with calves and your flocks with lambs."},{"num":5,"verse":"Your basket and your ·kitchen [kneading bowl] will be blessed."},{"num":6,"verse":"You will be blessed when you come in and when you go out."},{"num":7,"verse":"The Lord will help you defeat the enemies that ·come [rise against you] to fight you. They will attack you from one direction, but they will run from you in seven directions [as at Jericho; Josh. 6–7]."},{"num":8,"verse":"The Lord your God will bless you with full barns, and he will bless ·everything you do [all your undertakings; all that is sent out from your hand]. He will bless the land he is giving you."},{"num":9,"verse":"The Lord will make you his holy people, as he ·promised [swore; Ex. 19:6]. But you must obey his commands and ·do what he wants you to do [you must walk on his way/path]. "},{"num":10,"verse":"Then everyone on earth will see that you are ·the Lord’s people [called by the name of the Lord], and they will be afraid of you. "},{"num":11,"verse":"The Lord will make you rich: ·You will have many children, your animals will have many young, and your land will give good crops […in the fruit of your womb, in the fruit of your livestock, and in the fruit of your land]. It is the land that the Lord ·promised [swore to] your ·ancestors [fathers] he would give to you [Gen. 12:1–3]."},{"num":12,"verse":"The Lord will open up his heavenly storehouse so that the skies send rain on your land at the right time, and he will bless everything you do. You will lend to other nations, but you will not need to borrow from them. "},{"num":13,"verse":"The Lord will make you like the head and not like the tail; you will be on top and not on bottom. But you must obey the commands of the Lord your God that I am ·giving [commanding] you today, being careful to keep them. "},{"num":14,"verse":"Do not ·disobey [turn aside to the right or to the left from] anything I command you today. Do exactly as I command, and do not follow other gods or serve them."},{"header":"Curses for Disobeying"},{"num":15,"verse":"But if you do not ·obey [listen to the voice of] the Lord your God and carefully follow all his commands and ·laws [statutes; ordinances; requirements] I am ·giving [commanding] you today, all these curses will come upon you and ·stay [overtake you]:"},{"num":16,"verse":"You will be cursed in the city and cursed in the ·country [field]."},{"num":17,"verse":"Your basket and your ·kitchen [kneading bowl] will be cursed."},{"num":18,"verse":"·Your children [The fruit of your womb] will be cursed, as well as ·your crops [the fruit of your land]; the calves of your herds and the lambs of your flocks will be cursed."},{"num":19,"verse":"You will be cursed when you go in and when you go out."},{"num":20,"verse":"The Lord will send you curses, confusion, and punishment in ·everything you do [all your undertakings; all that is sent out from your hand]. You will be destroyed and suddenly ruined because you did wrong when you ·left [abandoned; forsook] him. "},{"num":21,"verse":"The Lord will ·give [make cling to] you ·terrible diseases [plagues] and destroy you from the land you are going to ·take [possess]. "},{"num":22,"verse":"The Lord will ·punish [strike] you with disease, fever, swelling, heat, lack of rain, plant diseases, and mildew until you ·die [perish]. "},{"num":23,"verse":"The ·sky [heavens] above will be like bronze [giving no rain], and the ground below will be like iron [1 Kin. 17:1]. "},{"num":24,"verse":"The Lord will turn the rain into dust and sand, which will fall from the ·skies [heavens] until you are destroyed."},{"num":25,"verse":"The Lord will help your enemies defeat you [as at Ai; Josh. 8]. You will attack them from one direction, but you will run from them in seven directions. And you will become a thing of horror among all the kingdoms on earth. "},{"num":26,"verse":"Your dead bodies will be food for all the birds of the ·sky [heavens] and wild animals, and there will be no one to scare them away. "},{"num":27,"verse":"The Lord will ·punish [strike] you with boils like those the Egyptians had. You will have ·bad growths [tumors; ulcers], sores, and itches that can’t be ·cured [healed]. "},{"num":28,"verse":"The Lord will ·give you [strike you with] madness, blindness, and a confused mind. "},{"num":29,"verse":"You will have to feel around ·in the daylight [at noon] like a blind person in darkness. You will ·fail in everything you do [not succeed in your way]. People will ·hurt [oppress] you and steal from you every day, and no one will ·save [help] you."},{"num":30,"verse":"You will be engaged to a woman, but another man will ·force her to have sexual relations with him [have her]. You will build a house, but you will not live in it. You will plant a vineyard, but you will not ·get its grapes [enjoy it]. "},{"num":31,"verse":"Your ox will be ·killed [slaughtered; butchered] before your eyes, but you will not eat any of it. Your donkey will be ·taken away [stolen] from you, and it will not be brought back. Your sheep will be given to your enemies, and no one will ·save [help] you. "},{"num":32,"verse":"Your sons and daughters will be given to another nation, and you will grow tired looking for them every day, but there will be nothing you can do. "},{"num":33,"verse":"People you don’t know will eat the ·crops [fruit of] your land and hard work have produced. You will be ·mistreated [oppressed] and ·abused [ill-treated] all your life. "},{"num":34,"verse":"The things ·you [your eyes] see will ·cause you to go mad [drive you crazy]. "},{"num":35,"verse":"The Lord will ·give you [strike you with] ·sore [horrible] boils on your knees and legs that cannot be cured, and they will go from the soles of your feet to the tops of your heads."},{"num":36,"verse":"The Lord will send you and the king whom you set over yourselves away to a nation neither you nor your ·ancestors [fathers] know, where you will serve other gods made of wood and stone. "},{"num":37,"verse":"You will become a ·hated thing [object of horror] to the nations where the Lord sends you; ·they will laugh at you and make fun of you [a proverb and a byword]."},{"num":38,"verse":"You will ·plant much seed in [carry out much seed to] your field, but your harvest will be small, because locusts will ·eat the crop [consume it]. "},{"num":39,"verse":"You will plant vineyards and work hard in them, but you will not ·pick the grapes [harvest] or drink the wine, because the worms will eat them. "},{"num":40,"verse":"You will have olive trees in all your land, but you will not ·get any [anoint yourself with] olive oil, because the olives will drop off the trees. "},{"num":41,"verse":"You will ·have [bear] sons and daughters, but you will not be able to keep them, because they will be taken captive. "},{"num":42,"verse":"·Locusts [or Crickets] will ·destroy [take possession of] all your trees and crops."},{"num":43,"verse":"The ·foreigners [resident aliens] who live among you will ·get stronger and stronger [go higher and higher], and you will ·get weaker and weaker [go lower and lower]. "},{"num":44,"verse":"·Foreigners [They] will lend money to you, but you will not be able to lend to them. They will be like the head, and you will be like the tail."},{"num":45,"verse":"All these curses will come upon you. They will ·chase [pursue] you and ·catch [overtake] you and destroy you, because you did not ·obey [listen to the voice of] the Lord your God and keep the commands and ·laws [statutes; ordinances; requirements] he ·gave [commanded] you. "},{"num":46,"verse":"The curses will be signs and ·miracles [wonders] to you and your ·descendants [seed] forever. "},{"num":47,"verse":"You had plenty of everything, but you did not serve the Lord your God with joy and a ·pure [or glad] heart, "},{"num":48,"verse":"so you will serve the enemies the Lord sends against you. You will be hungry, thirsty, naked, and poor, and the Lord will put a ·load on you [yoke of bronze on your neck] until he has destroyed you [Jer. 28:14]."},{"header":"The Curse of an Enemy Nation"},{"num":49,"verse":"The Lord will bring a nation against you from far away, from the end of the world, and it will swoop down like an eagle. You won’t ·understand their language [hear its tongue; Jer. 5:15–17], "},{"num":50,"verse":"and they will ·look mean [be stern-faced]. They will not ·respect [show favoritism to] old people or ·feel sorry for [favor; have compassion for] the young. "},{"num":51,"verse":"They will eat the ·calves from your herds and the harvest of your field [fruit of your livestock and the fruit of your land], and you will be destroyed. They will not leave you any grain, new wine or oil, or any calves from your herds or lambs from your flocks. You will ·be ruined [perish]. "},{"num":52,"verse":"That nation will ·surround and attack [besiege] all your ·cities [gates]. You trust in your high, ·strong [fortified] walls, but they will fall down. That nation will ·surround [besiege] all your ·cities [gates] everywhere in the land the Lord your God is giving you."},{"num":53,"verse":"·Your enemy will surround you. Those people will make you starve so that [In the dire position that the siege of your enemies places you] you will eat ·your own babies [the fruit of your womb], the ·bodies [flesh] of the sons and daughters the Lord your God gave you. "},{"num":54,"verse":"Even the most gentle and kind man among you will ·become cruel [look threateningly] to his brother, his wife ·whom he loves [of his lap], and his children who ·are still alive [remain]. "},{"num":55,"verse":"He will not even give them any of the flesh of his children he is eating, because it will be all he has left. ·Your enemy will surround you and make you starve [In the dire position that the siege of your enemies places you] in all your ·cities [gates]. "},{"num":56,"verse":"The most gentle and kind woman among you, so gentle and kind she would hardly even walk on the ground, will ·be cruel [look threateningly] to her husband ·whom she loves [of her lap] and to her son and daughter. "},{"num":57,"verse":"She will give birth to a baby, but she will plan to eat the baby and ·what comes after the birth itself [the afterbirth; that which comes out between her feet]. She will eat them secretly ·while the enemy surrounds the city. Those people will make you starve in all your cities […in the dire position that the siege of your enemies places you; Lam. 2:20]."},{"num":58,"verse":"Be careful to obey everything in these ·teachings [laws; instructions] that are written in this ·book [scroll]. You must respect the glorious and ·wonderful [awesome] name of the Lord your God, "},{"num":59,"verse":"or the Lord will give terrible diseases to you and your ·descendants [seed]. You will have long and serious diseases, and long and miserable sicknesses. "},{"num":60,"verse":"He will ·give [bring back to] you all the diseases of Egypt that you dread, and the diseases will ·stay with [cling to] you. "},{"num":61,"verse":"The Lord will also give you every disease and sickness not written in this ·Book [Scroll] of the ·Teachings [Law; Instruction], until you are destroyed. "},{"num":62,"verse":"You people may have outnumbered the stars [Gen. 15:5; 22:17; 26:4; Ex. 32:13], but only a few of you will be left, because you did not ·obey [listen to the voice of] the Lord your God. "},{"num":63,"verse":"Just as the Lord was once ·happy [pleased; delighted] with you and gave you ·good things [prosperity] and made you grow in number, so then the Lord will be ·happy [pleased; delighted] to ruin and destroy you, and you will be removed from the land you are entering to take as your ·own [possession]."},{"num":64,"verse":"Then the Lord will scatter you among the nations—from one end of the earth to the other [Jer. 9:16; 18:17; Ezek. 12:15]. There you will serve other gods of wood and stone, gods that neither you nor your ·ancestors [fathers] have known. "},{"num":65,"verse":"You will have no rest among those nations and no place that is yours. The Lord will make your ·mind [or heart] ·worried [tremble], your ·sight weak [eyes fail], and your soul ·sad [languish; depressed]. "},{"num":66,"verse":"You will live ·with danger [in suspense] and be afraid night and day. You will not be sure that you will live. "},{"num":67,"verse":"In the morning you will say, “·I wish [O that] it were evening,” and in the evening you will say, “·I wish [O that] it were morning.” ·Terror [Dread] will be in your heart, and the things you have seen will scare you. "},{"num":68,"verse":"The Lord will send you back to Egypt in ships, even though ·I, Moses, [I; possibly a reference to God] said you would never go back to Egypt. And there you will try to sell yourselves as slaves to your enemies, but no one will buy you."}]