[{"header":"Chapter 28"},{"num":1,"verse":"Blessings for Those Who Obey. If you heed the voice of the Lord, your God, and you carefully observe all of the commandments that I have given you today, then the Lord, your God, will lift you up above all the other nations upon the earth."},{"num":2,"verse":"All of these blessings shall come upon you and accompany you if you obey the voice of the Lord, your God."},{"num":3,"verse":"You shall be blessed in the city, and you shall be blessed in the countryside."},{"num":4,"verse":"Your offspring shall be blessed, along with your crops, and the young of your livestock, the calves of your herds, and the lambs of your flocks."},{"num":5,"verse":"Your basket and your kneading trough shall be blessed."},{"num":6,"verse":"You shall be blessed when you enter and when you leave."},{"num":7,"verse":"The Lord will grant that the enemies who rise up against you will be defeated by you. They shall come at you from one direction, but they shall flee away from you in seven different directions."},{"num":8,"verse":"The Lord will send a blessing upon your barns and everything that you undertake. The Lord, your God, will bless you in the land that he has given you."},{"num":9,"verse":"The Lord will establish you as his own holy people, as he solemnly promised you, if you observe the commandments of the Lord, your God, and walk in his ways."},{"num":10,"verse":"Then all of the people upon the earth shall see that you are called by the name of the Lord, and they shall fear you."},{"num":11,"verse":"The Lord will grant you great prosperity, including your offspring, the young of your livestock, and the crops that come from the ground, in the land that the Lord promised your ancestors to give to you."},{"num":12,"verse":"The Lord will open up the storehouse of his bounty in the heavens for you, giving rain to the land in its proper season and blessing all of your undertakings. You shall lend to many nations, but you shall borrow from none."},{"num":13,"verse":"The Lord will make you the head, not the tail, on top and not on the bottom, if you heed the commandments of the Lord, your God, that I give you today and you observe them."},{"num":14,"verse":"Do not turn aside from any of the things that I command you today, neither to the right nor to the left, seeking after other gods to serve them."},{"num":15,"verse":"Curses on Those Who Disobey. If you do not obey the voice of the Lord, your God, carefully observing all his commandments and statutes that I give you today, then all these curses shall come upon you and overwhelm you."},{"num":16,"verse":"You shall be cursed in the city and you shall be cursed in the countryside."},{"num":17,"verse":"Your basket and your kneading trough shall be cursed."},{"num":18,"verse":"Your offspring shall be cursed, along with your crops, the calves of your herds, and the lambs of your flocks."},{"num":19,"verse":"You shall be cursed when you enter and when you leave."},{"num":20,"verse":"The Lord will send curses, confusion, and vexation upon you in all of your undertakings until you are destroyed and come to sudden ruin on account of the wickedness of what you have done by forsaking me."},{"num":21,"verse":"Illness and Deprivation. The Lord will cover you with diseases until you are wiped out from the land to which you are going to possess."},{"num":22,"verse":"The Lord will strike you with consumption, with fever, with inflammations, with scorching heat, with drought, with blight, and mildew. These will plague you until you perish."},{"num":23,"verse":"The heavens over your head shall be like bronze, while the ground under you shall be like iron."},{"num":24,"verse":"The Lord will turn the rains into dust and powder. It shall pour down upon you from the heavens until you cease to exist."},{"num":25,"verse":"The Lord will cause you to be defeated by your enemies. You shall go out toward them in one direction, but you shall flee away in seven different directions. You shall be considered to be a thing of horror to all of the nations upon the earth."},{"num":26,"verse":"Your bodies shall be food for the birds of the air and the beasts of the fields, and there shall be no one to frighten them away."},{"num":27,"verse":"The Lord will strike you with the boils of Egypt, and tumors, scab and itching sores, from which you cannot be healed."},{"num":28,"verse":"The Lord will strike you with mental illness, blindness, and dementia."},{"num":29,"verse":"At noon you shall grope around like a blind man in the darkness. Nothing you do shall prosper, and you shall be beset by robbers all the time, and there shall be no one to rescue you."},{"num":30,"verse":"The woman to whom you are betrothed shall be seized by another man who shall ravish her. You shall not be able to live in the house that you have built, and you shall not taste the fruit of the vineyard you have planted."},{"num":31,"verse":"Your ox shall be slaughtered before your eyes, but you shall not get to eat any of it. Your donkey shall be stolen away from you and not returned. Your sheep shall be given over to your enemies, and there shall be no one to rescue you."},{"num":32,"verse":"Your sons and your daughters shall be given to another people, and you shall wear out your eyes looking for them all day long, powerless to lift a finger on their behalf."},{"num":33,"verse":"A people whom you do not know shall devour all of the produce of the land and of your work. You shall know nothing but crushing oppression all of your days."},{"num":34,"verse":"What your eyes behold shall drive you insane."},{"num":35,"verse":"The Lord will strike you with painful boils that cannot be healed on your knees and your legs, spreading from the soles of your feet to the top of your head."},{"num":36,"verse":"A Place of Exile. The Lord will bring you and the king you have placed over yourselves to a nation unknown to you or your fathers. There you shall serve other gods, gods made from wood and stone."},{"num":37,"verse":"You shall become an object of horror and a byword among all the nations to which the Lord will bring you."},{"num":38,"verse":"Fruitless Labor. You shall sow much seed in your fields, but you shall harvest little, for the locusts shall devour it."},{"num":39,"verse":"You shall plant and care for vineyards, but you shall not drink its wine or gather its grapes, for the worms will eat it."},{"num":40,"verse":"You shall have olive trees throughout your land, but you shall not have olive oil, for the olives will drop off."},{"num":41,"verse":"You shall have sons and daughters, but you shall not enjoy them, for they shall go off into captivity."},{"num":42,"verse":"Locusts shall consume your trees and the produce of your land."},{"num":43,"verse":"The foreigner who is living with you shall rise higher and higher, but you shall sink lower and lower."},{"num":44,"verse":"He shall lend to you, but you shall not lend to him. He shall be the head, and you shall be the tail."},{"num":45,"verse":"All of these curses shall come upon you. They shall pursue and overtake you until you have been destroyed, for you did not obey the voice of the Lord, your God, and observe the commandments and statutes that he gave you."},{"num":46,"verse":"This shall be a sign and a wonder to you and your descendants forever,"},{"num":47,"verse":"for you shall not have served the Lord, your God, joyfully and gladly in a time of prosperity."},{"num":48,"verse":"Therefore, you shall serve the enemies that the Lord sends against you in hunger and thirst, in nakedness and dire poverty. He will place an iron yoke upon your neck until he has destroyed you."},{"num":49,"verse":"Invasion and Destruction. The Lord will bring a nation against you from far away, from the ends of the earth. A nation whose language you do not understand shall swoop down like an eagle,"},{"num":50,"verse":"a fierce nation without respect for the old or pity for the young."},{"num":51,"verse":"They shall devour the young of your cattle and the produce of your land until you have been destroyed. They will leave you no grain, wine, oil, or calves in your herds, or lambs in your flocks, until you have been annihilated."},{"num":52,"verse":"They shall lay siege to all of your towns until all of the high fortified walls in which you place your trust have fallen down. He will besiege you in your towns all throughout your land, all throughout your land that the Lord, your God, has given you."},{"num":53,"verse":"Because of the hunger and the suffering that your enemies bring upon you during the siege, you shall eat your own children, your sons and your daughters, whom the Lord, your God, has given you."},{"num":54,"verse":"Even the most gentle and most sensitive among you shall treat his brother or the wife whom he loves or his surviving children poorly."},{"num":55,"verse":"He shall not give any of them the flesh of the children that he is eating. He shall have nothing left because of the siege and the suffering the enemy has inflicted upon you in all of your cities."},{"num":56,"verse":"The most gentle and sensitive woman among you, so gentle and sensitive that she would not step upon the ground with the soles of her feet, shall be hostile to the husband whom she loves and her own son and daughter."},{"num":57,"verse":"She shall eat the afterbirth from her womb and the children she bears secretly because of hunger during the siege and the distress that your enemy shall inflict upon you in your cities."},{"num":58,"verse":"Plagues. If you do not carefully observe the words of the law that are written in this book, and do not revere this glorious and awesome name, the Lord, your God,"},{"num":59,"verse":"then the Lord will send these fearful plagues upon you and your descendants, harsh and prolonged disasters, wretched and lingering illnesses."},{"num":60,"verse":"He will bring upon you all the illness that Egypt dreaded, and they will persist among you."},{"num":61,"verse":"The Lord will also bring upon you every type of illness and disaster that is not recorded in this book until you shall have been annihilated."},{"num":62,"verse":"You who were once as numerous as the stars in the heavens shall only be left with a few survivors, because you did not obey the voice of the Lord, your God."},{"num":63,"verse":"Punishment and Exile. Just as it pleased the Lord to make you prosper and to multiply your numbers, so it will please him to ruin and destroy you. You shall be uprooted from the land that you are entering to possess."},{"num":64,"verse":"The Lord will scatter you among every people, from one end of the earth to the other. There you shall worship other gods whom neither you nor your fathers knew, gods made of wood and stone."},{"num":65,"verse":"Among these nations you shall find no rest, no repose for the soles of your feet. There the Lord will give you an anxious heart, weary eyes, and a spirit of despair."},{"num":66,"verse":"You shall live with constant doubt, filled with dread day and night, never sure of your life."},{"num":67,"verse":"In the morning you shall say, “I wish it were evening.” In the evening you shall say, “I wish it were morning.” This will be because of the terrors in your heart and dread at what your eyes will have seen."},{"num":68,"verse":"The Lord will send you back to Egypt on ships, making a journey that I said you would never make again. You shall offer yourselves for sale there to your enemies as male and female slaves, but no one shall buy you."},{"num":69,"verse":"These are the terms of the covenant that the Lord commanded Moses to make with the Israelites in the land of Moab, in addition to the covenant he made with them at Horeb."}]