[{"num":28,"verse":"“If you fully obey all of these commandments of the Lord your God, the laws I am declaring to you today, God will transform you into the greatest nation in the world. "},{"num":2,"verse":"These are the blessings that will come upon you:"},{"num":7,"verse":"“The Lord will defeat your enemies before you; they will march out together against you but scatter before you in seven directions! "},{"num":8,"verse":"The Lord will bless you with good crops and healthy cattle, and prosper everything you do when you arrive in the land the Lord your God is giving you. "},{"num":9,"verse":"He will change you into a holy people dedicated to himself; this he has promised to do if you will only obey him and walk in his ways. "},{"num":10,"verse":"All the nations in the world shall see that you belong to the Lord, and they will stand in awe."},{"num":11,"verse":"“The Lord will give you an abundance of good things in the land, just as he promised: many children, many cattle, and abundant crops. "},{"num":12,"verse":"He will open to you his wonderful treasury of rain in the heavens, to give you fine crops every season. He will bless everything you do; and you shall lend to many nations, but shall not borrow from them. "},{"num":13,"verse":"If you will only listen and obey the commandments of the Lord your God that I am giving you today, he will make you the head and not the tail, and you shall always have the upper hand. "},{"num":14,"verse":"But each of these blessings depends on your not turning aside in any way from the laws I have given you; and you must never worship other gods."},{"num":15,"verse":"“If you won’t listen to the Lord your God and won’t obey these laws I am giving you today, then all of these curses shall come upon you:"},{"num":20,"verse":"“For the Lord himself will send his personal curse upon you. You will be confused and a failure in everything you do, until at last you are destroyed because of the sin of forsaking him. "},{"num":21,"verse":"He will send disease among you until you are destroyed from the face of the land you are about to enter and possess. "},{"num":22,"verse":"He will send tuberculosis, fever, infections, plague, and war. He will blight your crops, covering them with mildew. All these devastations shall pursue you until you perish."},{"num":23,"verse":"“The heavens above you will be as unyielding as bronze, and the earth beneath will be as iron. "},{"num":24,"verse":"The land will become as dry as dust for lack of rain, and dust storms shall destroy you."},{"num":25,"verse":"“The Lord will cause you to be defeated by your enemies. You will march out to battle gloriously, but flee before your enemies in utter confusion; and you will be tossed to and fro among all the nations of the earth. "},{"num":26,"verse":"Your dead bodies will be food to the birds and wild animals, and no one will be there to chase them away."},{"num":27,"verse":"“He will send upon you Egyptian boils, tumors, scurvy, and itch, for none of which will there be a remedy. "},{"num":28,"verse":"He will send madness, blindness, fear, and panic upon you. "},{"num":29,"verse":"You shall grope in the bright sunlight just as the blind man gropes in darkness. You shall not prosper in anything you do; you will be oppressed and robbed continually, and nothing will save you."},{"num":30,"verse":"“Someone else will marry your fiancée; someone else will live in the house you build; someone else will eat the fruit of the vineyard you plant. "},{"num":31,"verse":"Your oxen shall be butchered before your eyes, but you won’t get a single bite of the meat. Your donkeys will be driven away as you watch and will never return to you again. Your sheep will be given to your enemies. And there will be no one to protect you. "},{"num":32,"verse":"You will watch as your sons and daughters are taken away as slaves. Your heart will break with longing for them, but you will not be able to help them. "},{"num":33,"verse":"A foreign nation you have not even heard of will eat the crops you will have worked so hard to grow. You will always be oppressed and crushed. "},{"num":34,"verse":"You will go mad because of all the tragedy you see around you. "},{"num":35,"verse":"The Lord will cover you with boils from head to foot."},{"num":36,"verse":"“He will exile you and the king you will choose to a nation to which neither you nor your ancestors gave a second thought; and while in exile you shall worship gods of wood and stone! "},{"num":37,"verse":"You will become an object of horror, a proverb and a byword among all the nations, for the Lord will thrust you away."},{"num":38,"verse":"“You will sow much but reap little, for the locusts will eat your crops. "},{"num":39,"verse":"You will plant vineyards and care for them, but you won’t eat the grapes or drink the wine, for worms will destroy the vines. "},{"num":40,"verse":"Olive trees will be growing everywhere, but there won’t be enough olive oil to anoint yourselves! For the trees will drop their fruit before it is matured. "},{"num":41,"verse":"Your sons and daughters will be snatched away from you as slaves. "},{"num":42,"verse":"The locusts shall destroy your trees and vines. "},{"num":43,"verse":"Foreigners living among you shall become richer and richer while you become poorer and poorer. "},{"num":44,"verse":"They shall lend to you, not you to them! They shall be the head and you shall be the tail!"},{"num":45,"verse":"“All these curses shall pursue and overtake you until you are destroyed—all because you refuse to listen to the Lord your God. "},{"num":46,"verse":"These horrors shall befall you and your descendants as a warning: "},{"num":47,"verse":"You will become slaves to your enemies because of your failure to praise God for all that he has given you. The Lord will send your enemies against you, and you will be hungry, thirsty, naked, and in want of everything. A yoke of iron shall be placed around your neck until you are destroyed!"},{"num":49,"verse":"“The Lord will bring a distant nation against you, swooping down upon you like an eagle; a nation whose language you don’t understand—"},{"num":50,"verse":"a nation of fierce and angry men who will have no mercy upon young or old. "},{"num":51,"verse":"They will eat you out of house and home until your cattle and crops are gone. Your grain, new wine, olive oil, calves, and lambs will all disappear. "},{"num":52,"verse":"That nation will lay siege to your cities and knock down your highest walls—the walls you will trust to protect you. "},{"num":53,"verse":"You will even eat the flesh of your own sons and daughters in the terrible days of siege that lie ahead. "},{"num":54,"verse":"The most tenderhearted man among you will be utterly callous toward his own brother and his beloved wife and his children who are still alive. "},{"num":55,"verse":"He will refuse to give them a share of the flesh he is devouring—the flesh of his own children—because he is starving in the midst of the siege of your cities. "},{"num":56,"verse":"The most tender and delicate woman among you—the one who would not so much as touch her feet to the ground—will refuse to share with her beloved husband, son, and daughter. She will hide from them the afterbirth and the new baby she has borne, so that she herself can eat them: so terrible will be the hunger during the siege and the awful distress caused by your enemies at your gates."},{"num":58,"verse":"“If you refuse to obey all the laws written in this book, thus refusing reverence to the glorious and fearful name of Jehovah your God, then Jehovah will send perpetual plagues upon you and upon your children. "},{"num":60,"verse":"He will bring upon you all the diseases of Egypt that you feared so much, and they shall plague the land. "},{"num":61,"verse":"And that is not all! The Lord will bring upon you every sickness and plague there is, even those not mentioned in this book, until you are destroyed. "},{"num":62,"verse":"There will be few of you left, though before you were as numerous as stars. All this if you do not listen to the Lord your God."},{"num":63,"verse":"“Just as the Lord has rejoiced over you and has done such wonderful things for you and has multiplied you, so the Lord at that time will rejoice in destroying you; and you shall disappear from the land. "},{"num":64,"verse":"For the Lord will scatter you among all the nations from one end of the earth to the other. There you will worship heathen gods that neither you nor your ancestors have known, gods made of wood and stone! "},{"num":65,"verse":"There among those nations you shall find no rest, but the Lord will give you trembling hearts, darkness, and bodies wasted from sorrow and fear. "},{"num":66,"verse":"Your lives will hang in doubt. You will live night and day in fear, and will have no reason to believe that you will see the morning light. "},{"num":67,"verse":"In the morning you will say, ‘Oh, that night were here!’ And in the evening you will say, ‘Oh, that morning were here!’ You will say this because of the awesome horrors surrounding you. "},{"num":68,"verse":"Then the Lord will send you back to Egypt in ships, a journey I promised you would never need to make again; and there you will offer to sell yourselves to your enemies as slaves—but no one will even want to buy you.”"}]