[{"num":28,"verse":"Forsooth if thou hearest the voice of thy Lord God, that thou do and keep all his commandments, which I command to thee today, thy Lord God shall make thee higher than all folks that live in earth. (But if thou hearest the voice of the Lord thy God, and do and obey all of his commandments, which I command to thee today, the Lord thy God shall raise thee up higher, that is, shall grant thee more favour, than all the other nations who live on the earth.)"},{"num":2,"verse":"And all these blessings shall come [up]on thee, and shall take thee; if nevertheless thou hearest his behests. (And all these blessings shall come to thee, and shall overtake thee, if thou but obeyest his commands.)"},{"num":3,"verse":"Thou shalt be blessed in [the] city, and blessed in the field;"},{"num":4,"verse":"blessed shall be the fruit of thy womb, and the fruit of thy land, and the fruit of thy beasts, the flocks of thy great beasts, and the folds of thy sheep (yea, the herds of thy great beasts, and the flocks of thy sheep);"},{"num":5,"verse":"blessed shall be thy barns, and blessed shall be thy remnants, (or that which thou hast stored up);"},{"num":6,"verse":"thou shalt be blessed entering in, and going out."},{"num":7,"verse":"The Lord shall give thine enemies to fall in thy sight, that shall rise against thee; by one way they shall come against thee, and by seven ways they shall flee from thy face. (The Lord shall make thy enemies, who shall rise up against thee, to fall down before thee; they shall come out against thee by one way, but they shall flee from thee by seven ways.)"},{"num":8,"verse":"The Lord shall send out blessing(s) upon thy cellars, and upon all the works of thine hands; and he shall bless thee in the land which thou hast taken (and he shall bless thee in the land which he is giving thee)."},{"num":9,"verse":"The Lord shall raise thee to himself into an holy people, as he swore to thee, if thou keepest the behests of thy Lord God, and goest in his ways. (The Lord shall raise thee up into a holy people to himself, as he swore to thee, if thou but obeyest the commandments of the Lord thy God, and goest in his ways.)"},{"num":10,"verse":"And all the peoples of other lands shall see, that the name of the Lord is inwardly called upon thee, and they shall dread thee. (And all the peoples of other lands, shall see that thou art called by the name of the Lord, and they shall fear thee.)"},{"num":11,"verse":"The Lord shall make thee to be plenteous in all goods (The Lord shall make thee to be plenteous in all good things), (yea,) in the fruit of thy womb, and in the fruit of thy beasts, (and) in the fruit of thy land, which the Lord swore to thy fathers, that he would give to thee."},{"num":12,"verse":"The Lord shall open his best treasure, heaven, that he give rain to thy land in his time; and he shall bless all the works of thine hands; and thou shalt lend to many folks, and of no man thou shalt take borrowing. (The Lord shall open his treasure house, the heavens, and give rain to thy land at the proper time; and he shall bless all the works of thy hands; and thou shalt lend to many nations, but thou shalt not borrow from anyone.)"},{"num":13,"verse":"The Lord God shall set thee into the head, and not into the tail, and ever[more] thou shalt be above, and not beneath (The Lord God shall make thee the head, and not the tail, and thou shalt always be above, and never beneath); if nevertheless thou hearest the commandments of thy Lord God, which I command to thee today, and keepest, and doest them,"},{"num":14,"verse":"and bowest not away from them, neither to the right side, neither to the left side, neither followest alien gods (nor followest foreign, or other, gods), nor worshippest them."},{"num":15,"verse":"That if thou wilt not hear the voice of thy Lord God, that thou keep and do all his behests, and ceremonies, which I command to thee today, all these cursings shall come upon thee, and shall take thee. (But if thou wilt not listen to the voice of the Lord thy God, and obey all his commandments, and statutes, which I command to thee today, all these curses shall come to thee, and shall overtake thee.)"},{"num":16,"verse":"Thou shalt be cursed in (the) city, and cursed in (the) field."},{"num":17,"verse":"Cursed shall be thy barn, and cursed shall be thy remnants, (or that which thou hast stored up)."},{"num":18,"verse":"Cursed shall be the fruit of thy womb, and the fruit of thy land, the droves of thine oxen (the herds of thy oxen), and the flocks of thy sheep."},{"num":19,"verse":"Thou shalt be cursed going in, and cursed going out."},{"num":20,"verse":"The Lord shall send upon thee hunger, and thirst, and blaming, into all the works which thou shalt do, till he all-break thee, and lose thee swiftly, for thy full wicked findings, in which thou hast forsaken me. (The Lord shall send hunger, and thirst, and rebuke upon thee, in all the things which thou shalt do, until he hath all-broken thee, and swiftly destroyed thee, for thy full wicked doings in which thou hast forsaken me.)"},{"num":21,"verse":"The Lord shall join pestilence to thee, till he waste thee from (off) the land, to which thou shalt enter to wield."},{"num":22,"verse":"The Lord shall smite thee with neediness, with fever, and cold, with burning, and heat, with corrupt air, and mildew, either rust; and he shall pursue thee till thou perish."},{"num":23,"verse":"Heaven, that is above thee, be it brazen; and the earth, that thou treadest on, be it iron. (The heavens, that be above thee, shall become as hard as brass; and the earth, which thou treadest upon, shall become as hard as iron.)"},{"num":24,"verse":"The Lord give dust for rain to thy land, and ash come down from heaven upon thee, till thou be all-broken. (The Lord shall give dust to thy land instead of rain, and ashes shall come down upon thee from the sky, until thou be all-broken.)"},{"num":25,"verse":"The Lord give thee (to) falling before thine enemies; by one way go thou [out] against them, and by seven ways flee thou from them, and be thou scattered by all the realms of [the] earth; (The Lord shall cause thee to fall before thy enemies; thou shalt go out against them by one way, but thou shalt flee from them by seven ways, and thou shalt be scattered into all the kingdoms of the earth;)"},{"num":26,"verse":"and thy dead body be it into meat to all birds of heaven, and to beasts of the earth, and none be that may drive them away. (and thy dead bodies shall be food for all the birds of the air, and all the beasts of the earth, and there shall be no one who can drive them away.)"},{"num":27,"verse":"The Lord smite thee with the botch of Egypt, and the Lord smite the part of (the) body whereby ordures, or turds, be voided out; also the Lord smite thee with scab, and itching, so that thou mayest not be cured. (The Lord shall strike thee with the boils of Egypt, and he shall strike the part of the body where the ordures, or the turds, be voided out; and he shall also strike thee with scabs, and itching, from which thou can never be cured.)"},{"num":28,"verse":"The Lord smite thee with madness, and blindness, and wildness of thought; (The Lord shall strike thee with madness, and blindness, and wildness of thought;)"},{"num":29,"verse":"and grope thou in midday, as a blind man is wont to grope in darknesses; and (ad)dress he not thy ways; in all time suffer thou false challenge, and be thou oppressed by violence, neither have thou any that shall deliver thee. (and thou shalt grope in midday, like a blind man is wont to grope in the darkness; and the Lord shall not direct thy ways; at all times, or continuously, thou shalt be violently attacked and robbed, but thou shalt have no one to save thee.)"},{"num":30,"verse":"Take thou a wife, and another man sleep with her; build thou an house, and dwell thou not therein; plant thou a vinery, and gather thou not grapes thereof. (Thou shalt take a wife, but another man shall sleep with her; thou shalt build a house, but thou shalt not live in it; and thou shalt plant a vineyard, but thou shalt not gather its grapes.)"},{"num":31,"verse":"Thine ox be offered before thee, and eat thou not thereof; thine ass be ravished in thy sight, and be it not yielded again to thee; thy sheep be given to thine enemies, and none be that help thee to recover them. (Thy ox shall be slaughtered before thee, but thou shalt not eat any of it; thy donkey shall be stolen from thee, and it shall not be given back to thee; thy sheep shall be given over to thy enemies, and no one shall help thee to recover them.)"},{"num":32,"verse":"Thy sons and thy daughters be given to another people, while thine eyes see, and fail at the sight of them all day; and no strength be in thine hand (to help them). (Thy sons and thy daughters shall be given to another people, while thou seest it, and then thine eyes shall fail for not being able to see thy children all day long; and there shall be no strength in thy hands to help them.)"},{"num":33,"verse":"A people whom thou knowest not, eat (up) the fruits of thy land, and all thy travails; and ever[more] be thou suffering false challenges, and be thou oppressed in all days, or all time, (A people, whom thou knowest not, shall eat up the fruits of thy land, and thou shalt suffer false challenges forevermore, and thou shalt be oppressed for all time,)"},{"num":34,"verse":"and be thou wondering at the fearfulness of those things which thine eyes shall see. (and thou shalt wonder at the fearfulness of those things which thine eyes shall see.)"},{"num":35,"verse":"The Lord smite thee with the worst botch in the knees, and in the hinder parts of the leg; and thou may not be healed from the sole of thy foot till to thy top/unto the noll. (The Lord shall strike thee with the worst boils on your knees, and on the back part of your legs; and thou shalt never be able to be healed, from the sole of thy feet unto the top of thy head.)"},{"num":36,"verse":"And the Lord shall lead thee, and thy king, whom thou shalt ordain on thee, into a folk which thou knowest not, thou, and thy fathers; and thou shalt serve there to alien gods, to tree, and to stone. (And the Lord shall bring thee, and thy king, whom thou shalt ordain over thee, to a nation whom thou knowest not, neither thou, nor thy fathers; and thou shalt serve foreign, or other, gods there, yea, gods made out of wood and stone.)"},{"num":37,"verse":"And thou shalt be lost, or forgotten, into a proverb, and into a fable, to all peoples, to whom the Lord shall bring thee in. (And thou shalt become a proverb, and a fable, to all the people into whom the Lord shall bring thee.)"},{"num":38,"verse":"Thou shalt cast much seed into the earth, and thou shalt gather again little; for locusts shall devour all things."},{"num":39,"verse":"Thou shalt plant, and dig a vinery, and thou shalt not drink the wine of it, neither thou shalt gather thereof anything; for it shall be wasted with worms. (Thou shalt plant a vineyard, and dig it, but thou shalt not drink the wine of it, nor shalt thou gather anything from it; for it shall be wasted by worms.)"},{"num":40,"verse":"Thou shalt have olive trees in all thy coasts, and thou shalt not be anointed with (the) oil of them; for they shall fall down, and perish. (Thou shalt have olive trees in all thy land, but thou shalt not be anointed with their oil; for they shall all fall down, and perish.)"},{"num":41,"verse":"Thou shalt beget sons and daughters, and thou shalt not use them (but thou shalt not have them near); for they shall be led into captivity."},{"num":42,"verse":"Rust, or mildew, shall waste all thy trees and the fruits of thy land."},{"num":43,"verse":"A comeling, that dwelleth with thee in the land, shall go up upon thee, and he shall be the higher; forsooth thou shalt go down, and shalt be the lower. (A newcomer, who shall live with thee in the land, shall go up over thee, and he shall be higher; but thou shalt go down, and shalt be lower.)"},{"num":44,"verse":"He shall lend to thee, and thou shalt not lend to him; he shall be into the head, and thou shalt be into the tail. (He shall lend to thee, but thou shalt not lend to him; he shall be the head, and thou shalt be the tail.)"},{"num":45,"verse":"And all these cursings shall come upon thee, and shall pursue thee, and take thee, till thou perish; for thou heardest not the voice of thy Lord God, neither keptest his commandments and ceremonies, which he commanded to thee. (And all these curses shall come upon thee, and they shall pursue thee, and shall overtake thee, until thou die; for thou heardest not the voice of the Lord thy God, nor obeyed his commandments and statutes, which he commanded to thee.)"},{"num":46,"verse":"And signs, and great wonders shall be in thee, and in thy seed, till into without end; (And these signs, and great wonders, shall be upon thee, and upon thy descendants, forevermore;)"},{"num":47,"verse":"for thou servedest not thy Lord God in joy and gladness of heart, for the abundance of all things that God sent thee. (for thou servedest not the Lord thy God with joy and gladness in your heart, for the abundance of all the good things that God hath sent thee.)"},{"num":48,"verse":"Thou shalt serve thine enemy, whom God shall send to thee, in hunger, and thirst, and in nakedness, and in poverty of all things; and he shall put an iron yoke on thy noll, till he all-break thee. (And so thou shalt serve thy enemy, whom God shall send against thee, in hunger, and thirst, and nakedness, and in the poverty of all things; and he shall put an iron yoke upon thy neck, until he all-break thee.)"},{"num":49,"verse":"The Lord shall bring on thee a folk from far place, and from the last ends of [the] earth, into the likeness of an eagle flying with rush, of which folk thou mayest not understand their language; (The Lord shall bring against thee a nation from a far place, and from the last ends of the earth, like an eagle flying swiftly to its prey, of which nation thou shalt not understand their language;)"},{"num":50,"verse":"a folk most greedy asker this shall be (they shall be a nation, or a people, of fierce countenance), that shall not give reverence to an eld man, neither have mercy upon a little child."},{"num":51,"verse":"And it shall devour the fruit of thy beasts, and the fruits of thy land, till thou perishest, and this folk shall not leave to thee wheat, wine, and oil, nor droves of oxen, and flocks of sheep, till he lose thee, (And they shall devour the fruit of thy beasts, and the fruit of thy land, until thou diest, and this nation shall not leave thee any corn, or wine, or oil, or herds of oxen, or flocks of sheep, until they have completely destroyed thee,)"},{"num":52,"verse":"and all-break [thee] in all thy cities (and have all-broken thee in all thy cities), and till thy firm and high walls be destroyed, in which thou haddest trust in all thy land. Thou shalt be besieged within thy gates in all thy land, which thy Lord God shall give to thee."},{"num":53,"verse":"And thou shalt eat the fruit of thy womb, and the flesh of thy sons, and of thy daughters, which thy Lord God shall give to thee, in the anguish, and in the destroying, by which thine enemies shall oppress thee. (And thou shalt eat the fruit of thy womb, yea, the flesh of thy sons, and of thy daughters, whom the Lord thy God hath given thee, amidst the anguish and the destruction with which thy enemies shall oppress thee.)"},{"num":54,"verse":"A man delicate of life, and full lecherous, shall have envy greatly to his brother, and to his wife that lieth in his bosom, (and also toward the remnant of his children, that he hath left,) (A delicate and tender man among you, shall be stingy toward his brother, and toward his wife who lieth in his bosom, and even toward the remnant of his children, who be left,)"},{"num":55,"verse":"lest he give to them of the flesh of his sons which he shall eat; for he hath none other thing in [the] besieging, and (the) poverty, by which thine enemies shall waste thee within all thy gates. (lest he give them any of the flesh of his other children which he shall eat; for he hath nothing left amidst the anguish and the destruction, with which thy enemies shall oppress thee within all thy gates.)"},{"num":56,"verse":"A tender woman and delicate, that might not go upon the earth, neither set a step of [the] foot, for her most softness and tenderness, shall have envy to her husband that lieth in her bosom, on the flesh of her son, and daughter, (A delicate and tender woman, who, because of her great softness and tenderness, need not walk, nor even put a step of her foot upon the ground, shall be stingy toward her husband who lieth in her bosom, and toward her son and her daughter,)"},{"num":57,"verse":"and on the filth of [the] skins, wherein the child is wrapped in the mother’s womb, that go out of the midst of her hip bones, or loins, and on [the] free children that be born in the same hour. They shall eat those children privily, for the scarcity of all things in besieging and destroying, by which thine enemy shall oppress thee within thy gates. (and she shall keep for herself all the filthy skins, in which the child is wrapped in its mother’s womb, that goeth out of the midst of her hip bones, and the children who be born at that same hour. And she shall secretly eat those skins, and those children, for the scarcity of all things amidst the anguish and the destruction, with which thy enemies shall oppress thee within thy gates.)"},{"num":58,"verse":"No but thou shalt keep and do all the words of this law, that be written in this volume, either book, and shalt dread his glorious name and fearful, that is, thy Lord God, (No, unless thou obey and do all the words of this law, that be written in this book, and fear his glorious and fearful name, that is, The Lord Thy God,)"},{"num":59,"verse":"the Lord shall increase thy wounds, or torments, and the wounds of thy seed; great wounds and continual, sicknesses worst and everlasting. (the Lord shall send more and more plagues upon thee, and upon thy descendants; yea, great and continual plagues, and the worst and everlasting sicknesses.)"},{"num":60,"verse":"And he shall turn into thee all the torments of Egypt, which thou dreadedest, and those shall cleave to thee. (And he shall bring in upon thee all the diseases of Egypt, which thou hast feared, and they shall cleave to thee.)"},{"num":61,"verse":"Furthermore the Lord shall bring upon thee also all the sorrows and wounds, that be not written in the book of this law, till he all-break thee. (And furthermore, the Lord shall bring in upon thee all the other sicknesses and plagues, that be not written down in this Book of the Law, until he hath all-broken thee.)"},{"num":62,"verse":"And ye shall dwell few in number, that were before as the stars of heaven for multitude, for thou heardest not the voice of thy Lord God. (And ye shall be few in number, who before were like the stars in the heavens in multitude, for thou did not obey the Lord thy God.)"},{"num":63,"verse":"And as the Lord was glad before upon you, and did well to you, and multiplied you; so he shall be glad to lose you, and to destroy you, that ye be taken away from the land, to which thou shalt enter to wield. (And so before, the Lord was glad about you, and did good to you, and multiplied you; but now, he shall be glad to utterly destroy you, and ye shall be taken away from the land, which thou shalt enter to take.)"},{"num":64,"verse":"The Lord shall scatter thee into all peoples, from [the] highness of the earth unto the coasts thereof; and thou shalt serve there to alien gods, which thou knowest not, and thy fathers knew not, to trees and stones. (The Lord shall scatter thee among all the peoples, from the heights of the earth unto the coasts of the sea; and there thou shalt serve other gods, which thou knowest not, and thy fathers knew not, yea, gods made out of wood and stone.)"},{"num":65,"verse":"Also thou shalt not (have) rest in those folks, neither rest shall be (given) to the step of thy foot. For the Lord shall give to thee there a fearful heart, and eyes failing, and a soul wasted with privy sorrow. (And thou shalt not have rest among these nations, nor shall thy footsteps have rest. For the Lord shall give thee there a fearful heart, and failing eyes, and a soul wasted with secret sorrows.)"},{"num":66,"verse":"And thy life shall be as hanging before thee; thou shalt dread night and day, and thou shalt not trust to thy life. (And thy life shall be seen as hanging in doubt before thee; thou shalt have fear day and night, and thou shalt have no security, or assurance, in all thy life.)"},{"num":67,"verse":"In the morrowtide thou shalt say, Who shall give the eventide to me? and in the eventide thou shalt say, Who shall give the morrowtide to me? for the dread of thine heart, by which thou shalt be made afeared, and for those things which thou shalt see with thine eyes."},{"num":68,"verse":"The Lord shall lead thee again by ships into Egypt, by the way of which he said to thee, Thou shouldest no more see it. There thou shalt be sold to thine enemies, into menservants and womenservants; and none shall be that shall deliver thee. (And the Lord shall bring thee back to Egypt by ships, by the very way of which I had said to thee, Thou shalt not go that way again. And there thou shalt try to sell thyselves to thy enemies, as slaves and slave-girls; but no one will want to buy thee.)"}]