[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Watch for the morning.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 123:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for another figure of the same earnest upward gaze. In the “watcher for the dawn” there may be an allusion to the Levite-sentinel whose duty it was to signal the first ray of dawn, and the moment for commencing the sacred rites of the Temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 134:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the figure if general, as marking the impatience of a deeply agitated soul—a sufferer waiting for relief, a contrite sinner for forgiveness—is as striking as graceful. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:67",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 130:6. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 130:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My soul waiteth for the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This verse in the original is remarkably concise, forcible, and elegant. It is literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My soul for the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(namely, waiteth,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "more than watchers for the morning, than watchers for the morning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The psalmist is thought to intend those that kept the night-watches in the city, or the priests or Levites who watched in the temple; who, being wearied with hard service and want of rest, earnestly desired and eagerly expected the break of day, that they might be discharged from duty. Or, as Dr. Hammond and some others interpret the words, he means those priests, or their officers, “who were peculiarly appointed from a tower to expect the first appearance of the break of day.” The repetitions in this and the preceding verse beautifully and forcibly express that ardent desire with which true penitents expect and long for the salvation of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "130:5-8 It is for the Lord that my soul waits, for the gifts of his grace, and the working of his power. We must hope for that only which he has promised in his word. Like those who wish to see the dawn, being very desirous that light would come long before day; but still more earnestly does a good man long for the tokens of God's favour, and the visits of his grace. Let all that devote themselves to the Lord, cheerfully stay themselves on him. This redemption is redemption from all sin. Jesus Christ saves his people from their sins, both from the condemning and from the commanding power of sin. It is plenteous redemption; there is an all-sufficient fulness in the Redeemer, enough for all, enough for each; therefore enough for me, says the believer. Redemption from sin includes redemption from all other evils, therefore it is a plenteous redemption, through the atoning blood of Jesus, who shall redeem his people from all their sins. All that wait on God for mercy and grace, are sure to have peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My soul waiteth for the Lord more than they that watch for the morning - More intently; more anxiously. The Septuagint and Latin Vulgate render this, \"My soul hopeth in the Lord from the morning watch until night.\" The idea is that of watchers - night guards - who look anxiously for the break of day that they may be relieved. It is not that of persons who simply look for the return of day, but of those who are on guard - or it may be who watch beside the sick or the dying - and who look out on the east to mark the first indications of returning light. To them the night seems long; they are weary, and want repose; all around is cheerless, gloomy, and still; and they long for the first signs that light will again visit the world. Thus in affliction - the long, dark, dreary, gloomy night of sorrow - the sufferer looks for the first indication, the first faint ray of comfort to the soul. Thus under deep conviction for sin, and deep apprehension of the wrath of God - that night, dark, dreary, gloomy, often long - the soul looks for some ray of comfort, some intimation that God will be merciful, and will speak peace and pardon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I say, more than they that watch for the morning - Margin, which watch unto the morning. The translation in the text best expresses the sense. There is something exceedingly beautiful and touching in this language of repetition, though it is much enfeebled by the words which our translators have inserted, \"I say, more than.\" The Hebrew is, \"more than they that watch for the morning - watch for the morning,\" as if the mind dwelt upon the words as better expressing its own anxious state than any other words could do. Everyone who has been afflicted will feel the force of this; every one who has been under conviction of sin, and who has felt himself in danger of suffering the wrath of God, will remember how anxiously he longed for mercy, for light, for peace, for some indication, even the most faint, like the first ray which breaks in the east, that his soul would find mercy and peace. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I say, more than they that watch for the morning - Margin, which watch unto the morning. The translation in the text best expresses the sense. There is something exceedingly beautiful and touching in this language of repetition, though it is much enfeebled by the words which our translators have inserted, \"I say, more than.\" The Hebrew is, \"more than they that watch for the morning - watch for the morning,\" as if the mind dwelt upon the words as better expressing its own anxious state than any other words could do. Everyone who has been afflicted will feel the force of this; every one who has been under conviction of sin, and who has felt himself in danger of suffering the wrath of God, will remember how anxiously he longed for mercy, for light, for peace, for some indication, even the most faint, like the first ray which breaks in the east, that his soul would find mercy and peace. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. wait for the Lord—in expectation (Ps 27:14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "watch for, &c.—in earnestness and anxiety.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whether soldiers that keep the night watches in an army or city, or the priests or Levites who did so in the temple; who being wearied with hard service and want of convenient rest, diligently look for and fervently desire the morning, when they may be discharged. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 119:148",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:148",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My soul waiteth for the Lord,.... This is repeated for the confirmation of it, and to show the vehement and constant disposition of his mind towards the Lord; as well as for the sake of what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "more than they that watch for the morning: I say, more than they that watch for the morning; or, \"more than the morning watchers, that watch for or until the morning\" (h); than watchmen of cities, or the keepers of the wails, as Aben Ezra; those who are upon the last morning watch, and are looking out for the morning light; that they may go off from duty, and lie down and sleep: or than those that sit up with sick persons; who, being solitary and melancholy, as well as want sleep, long for the morning, that they may have some refreshment: or rather than the priests and Levites that watched in the temple, that waited for the morning, that they might be relieved by others; or else than those of that function, who were very diligent to observe the break of day, that they might enter upon their morning sacrifices; of which are many instances in the Misnah (i). So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"more than they that observe the morning watches, which they observe to offer up the morning sacrifice:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Kimchi's paraphrase is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"who rise in the morning watches to pray.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The coming of Christ is said to be as the morning; and the light of God's countenance is comparable to the morning light; the discoveries of pardoning grace are through the bright shining of the sun of righteousness, and is the healing that is in his wings; and salvation and deliverance from any distress Is light that breaks forth as the morning: all and each of these are more desirable, and more to be waited for, than the natural light of the morning; see 2 Samuel 23:4, Hosea 6:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The coming of Christ is said to be as the morning; and the light of God's countenance is comparable to the morning light; the discoveries of pardoning grace are through the bright shining of the sun of righteousness, and is the healing that is in his wings; and salvation and deliverance from any distress Is light that breaks forth as the morning: all and each of these are more desirable, and more to be waited for, than the natural light of the morning; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) So Junius & Tremellius, Musculus, Cocceius. (i) See Misn. Yoma, c. 3. s. 1. & Tamid, c. 3. s. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) So Junius & Tremellius, Musculus, Cocceius. (i) See Misn. Yoma, c. 3. s. 1. & Tamid, c. 3. s. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "My soul waiteth for the Lord more than they that watch for the morning: I say, more than they that watch for the morning.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". My soul (looketh) for the Lord,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "More than watchmen (look) for the morning,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(Yea, more than) watchmen for the morning (R.V.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "More anxiously than the watchman longs for the dawn which is to release him from his duty does the devout Israelite long for the end of the night of trouble and the dawn of a happier day. The repetition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "watchmen for the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gives a touch of pathetic earnestness. Most commentators suppose that military sentinels are meant by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "watchmen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the Targum renders, “My soul waits for Jehovah, more than the keepers of the morning-watch which they keep in order to offer the morning sacrifice,” understanding the allusion to be to the custom that one of the Levites who kept the night watch in the Temple was appointed to watch for the moment of the dawn, at which the daily sacrifice was to be offered. This explanation adds point to the comparison, for the Levites were watching with eager expectation for a dawn which would bring not merely release from toil but positive blessing, in the renewed assurance of God’s covenant mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The P.B.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the morning watch, I say, before the morning watch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is derived from Münster’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ante custodes matutinos, ante custodes, inquam, matutinos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Coverdale’s original rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "frô the one morn-ynge to the other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was taken from the Zürich Version, “von einer morgenwacht zur anderen.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My soul waiteth for the Lord more than they that watch for the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": I say, more than they that ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "watch for the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; i.e. more eagerly, more anxiously, than even the night watchman, tired with his long vigil. Again the repetition adds force. Psalm 130:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore the sinner need not, therefore too the poet will not, despair. He hopes in Jahve (acc. obj. as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), his soul hopes; hoping in and waiting upon God is the mood of his inmost and of his whole being. He waits upon God's word, the word of His salvation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:81",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which, if it penetrates into the soul and cleaves there, calms all unrest, and by the appropriated consolation of forgiveness transforms and enlightens for it everything in it and outside of it. His soul is לאדני, i.e., stedfastly and continually directed towards Him; as Chr. A. Crusius when on his death-bed, with hands and eyes uplifted to heaven, joyfully exclaimed: \"My soul is full of the mercy of Jesus Christ. My whole soul is towards God.\" The meaning of לאדני becomes at once clear in itself from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 143:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and is defined moreover, without supplying שׁמרת (Hitzig), according to the following לבּקר. Towards the Lord he is expectantly turned, like those who in the night-time wait for the morning. The repetition of the expression \"those who watch for the morning\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") gives the impression of protracted, painful waiting. The wrath, in the sphere of which the poet now finds himself, is a nightly darkness, out of which he wishes to be removed into the sunny realm of love (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); not he alone, however, but at the same time all Israel, whose need is the same, and for whom therefore believing waiting is likewise the way to salvation. With Jahve, and with Him exclusively, with Him, however, also in all its fulness, is החסד (contrary to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without any pausal change in accordance with the varying of the segolates), the mercy, which removes the guilt of sin and its consequences, and puts freedom, peace, and joy into the heart. And plenteous (הרבּה, an adverbial infin. absol., used here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as an adjective) is with Him redemption; i.e., He possesses in the richest measure the willingness, the power, and the wisdom, which are needed to procure redemption, which rises up as a wall of partition (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") between destruction and those imperilled. To Him, therefore, must the individual, if he will obtain mercy, to Him must His people, look up hopingly; and this hope directed to Him shall not be put to shame: He, in the fulness of the might of His free grace (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), will redeem Israel from all its iniquities, by forgiving them and removing their unhappy inward and outward consequences. With this promise (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the poet comforts himself. He means complete and final redemption, above all, in the genuinely New Testament manner, spiritual redemption. ",
        "children": []
      }
    ]
  }
]