[{"num":3,"verse":"A faithful word [I shall say]. If any man desireth a bishopric [If any man desire a bishopric], he desireth a good work. "},{"num":2,"verse":"Therefore it behooveth a bishop to be without reproof [Therefore it behooveth a bishop to be irreprehensible, or without reproof], the husband of one wife, sober, prudent, chaste, virtuous, holding hospitality, a teacher; "},{"num":3,"verse":"not given much to wine, not a smiter, but temperate, not full of chiding, not covetous, [not given much to wine, not smiter, but temperate, or patient, not litigious, or full of strife, or chiding, not covetous,] "},{"num":4,"verse":"well-ruling his house, and have sons subject with all chastity [having sons subject with all chastity];"},{"num":5,"verse":"for if any man know not how to govern his house, how shall he have diligence of the church of God [how shall he have diligence, or keeping, of the church of God]? "},{"num":6,"verse":"not new converted to the faith, lest he be borne up into pride, and fall into [the] doom of the devil. "},{"num":7,"verse":"For it behooveth him to have also good witnessing of them that be withoutforth, that he fall not into reproof, and into the snare of the devil. "},{"num":8,"verse":"Also it behooveth deacons to be chaste, not double-tongued, not given much to wine [not given to much wine], not following foul winning; "},{"num":9,"verse":"that have the mystery of faith in clean conscience. [having the mystery of faith in clean conscience.] "},{"num":10,"verse":"But be they proved first, and minister they so, having no crime. [And forsooth be they proved first, that they minister so, having no crime, or great sin.] "},{"num":11,"verse":"Also it behooveth women to be chaste, not backbiting, sober, faithful in all things. "},{"num":12,"verse":"Deacons be [they] husbands of one wife; which govern well their sons and their houses. "},{"num":13,"verse":"For they that [shall] minister well, shall get a good degree to themselves, and much trust in the faith, that is in Christ Jesus. "},{"num":14,"verse":"Son Timothy, I write to thee these things, hoping that I shall come soon to thee [hoping me to come soon to thee]; "},{"num":15,"verse":"but if I tarry, that thou knowest, how it behooveth thee to live in the house of God, that is the church of living God, a pillar and firmness of truth. "},{"num":16,"verse":"And openly it is a great sacrament of piety, that thing that was showed in flesh, it is justified in Spirit [And openly it is a great sacrament of piety, that that is showed in flesh, is justified in Spirit], it appeared to angels, it is preached to heathen men, it is believed in the world, it is taken up into glory."}]