[{"header":"Jesus Washes the Disciples’ Feet"},{"num":13,"verse":"Before the Passover festival, Yeshua knew that the time had come for him to leave this world and go back to the Father. Yeshua loved his own who were in the world, and he loved them to the end."},{"num":2,"verse":"While supper was taking place, the devil had already put the idea of betraying Yeshua into the mind of Judas, son of Simon Iscariot."},{"num":3,"verse":"The Father had put everything in Yeshua’s control. Yeshua knew that. He also knew that he had come from God and was going back to God. "},{"num":4,"verse":"So he got up from the table, removed his outer clothes, took a towel, and tied it around his waist. "},{"num":5,"verse":"Then he poured water into a basin and began to wash the disciples’ feet and dry them with the towel that he had tied around his waist."},{"num":6,"verse":"When Yeshua came to Simon Peter, Peter asked him, “Lord, are you going to wash my feet?”"},{"num":7,"verse":"Yeshua answered Peter, “You don’t know now what I’m doing. You will understand later.”"},{"num":8,"verse":"Peter told Yeshua, “You will never wash my feet.”"},{"num":9,"verse":"Simon Peter said to Yeshua, “Lord, don’t wash only my feet. Wash my hands and my head too!”"},{"num":10,"verse":"Yeshua told Peter, “People who have washed are completely clean. They need to have only their feet washed. All of you, except for one, are clean.” "},{"num":11,"verse":"(Yeshua knew who was going to betray him. That’s why he said, “All of you, except for one, are clean.”)"},{"num":12,"verse":"After Yeshua had washed their feet and put on his outer clothes, he took his place at the table again. Then he asked his disciples, “Do you understand what I’ve done for you? "},{"num":13,"verse":"You call me teacher and Lord, and you’re right because that’s what I am. "},{"num":14,"verse":"So if I, your Lord and teacher, have washed your feet, you must wash each other’s feet. "},{"num":15,"verse":"I’ve given you an example that you should follow. "},{"num":16,"verse":"I can guarantee this truth: Slaves are not superior to their owners, and messengers are not superior to the people who send them. "},{"num":17,"verse":"If you understand all of this, you are blessed whenever you follow my example."},{"num":18,"verse":"“I’m not talking about all of you. I know the people I’ve chosen to be apostles. However, I’ve made my choice so that Scripture will come true. It says, ‘The one who eats my bread has turned against me.’ "},{"num":19,"verse":"I’m telling you now before it happens. Then, when it happens, you will believe that I am the one."},{"num":20,"verse":"“I can guarantee this truth: Whoever accepts me accepts the one who sent me.”"},{"header":"Jesus Knows Who Will Betray Him(A)"},{"num":21,"verse":"After saying this, Yeshua was deeply troubled. He declared, “I can guarantee this truth: One of you is going to betray me!”"},{"num":22,"verse":"The disciples began looking at each other and wondering which one of them Yeshua meant."},{"num":23,"verse":"One disciple, the one whom Yeshua loved, was near him at the table. "},{"num":24,"verse":"Simon Peter motioned to that disciple and said, “Ask Yeshua whom he’s talking about!”"},{"num":25,"verse":"Leaning close to Yeshua, that disciple asked, “Lord, who is it?”"},{"num":26,"verse":"Yeshua answered, “He’s the one to whom I will give this piece of bread after I’ve dipped it in the sauce.” So Yeshua dipped the bread and gave it to Judas, son of Simon Iscariot."},{"num":27,"verse":"Then, after Judas took the piece of bread, Satan entered him. So Yeshua told him, “Hurry! Do what you have to do.” "},{"num":28,"verse":"No one at the table knew why Yeshua said this to him. "},{"num":29,"verse":"Judas had the moneybag. So some thought that Yeshua was telling him to buy what they needed for the festival or to give something to the poor."},{"num":30,"verse":"Judas took the piece of bread and immediately went outside. It was night."},{"num":31,"verse":"When Judas was gone, Yeshua said, “The Son of Man is now glorified, and because of him God is glorified. "},{"num":32,"verse":"If God is glorified because of the Son of Man, God will glorify the Son of Man because of himself, and he will glorify the Son of Man at once.”"},{"header":"Jesus Predicts Peter’s Denial(B)"},{"num":33,"verse":"Yeshua said, “Dear children, I will still be with you for a little while. I’m telling you what I told the Jews. You will look for me, but you can’t go where I’m going."},{"num":34,"verse":"“I’m giving you a new commandment: Love each other in the same way that I have loved you. "},{"num":35,"verse":"Everyone will know that you are my disciples because of your love for each other.”"},{"num":36,"verse":"Simon Peter asked him, “Lord, where are you going?”"},{"num":37,"verse":"Peter said to Yeshua, “Lord, why can’t I follow you now? I’ll give my life for you.”"},{"num":38,"verse":"Yeshua replied, “Will you give your life for me? I can guarantee this truth: No rooster will crow until you say three times that you don’t know me."}]