[{"header":"Jesus Washes Feet"},{"num":13,"verse":"Jesus knew that the night before Passover would be his last night on earth before leaving this world to return to the Father’s side. All throughout his time with his disciples, Jesus had demonstrated a deep and tender love for them. And now he longed to show them the full measure of his love. "},{"num":2,"verse":"Before their evening meal had begun, the accuser had already deeply embedded betrayal into the heart of Judas Iscariot, the son of Simon."},{"num":3,"verse":"Now Jesus was fully aware that the Father had placed all things under his control, for he had come from God and was about to go back to be with him. "},{"num":4,"verse":"So he got up from the meal and took off his outer robe, and took a towel and wrapped it around his waist. "},{"num":5,"verse":"Then he poured water into a basin and began to wash the disciples’ dirty feet and dry them with his towel."},{"num":6,"verse":"But when Jesus got to Simon Peter, he objected and said, “I can’t let you wash my dirty feet—you’re my Lord!”"},{"num":7,"verse":"Jesus replied, “You don’t understand yet the meaning of what I’m doing, but soon it will be clear to you.”"},{"num":8,"verse":"Peter looked at Jesus and said, “You’ll never wash my dirty feet—never!”"},{"num":9,"verse":"So Peter said, “Lord, in that case, don’t just wash my feet, wash my hands and my head too!”"},{"num":10,"verse":"Jesus said to him, “You are already clean. You’ve been washed completely and you just need your feet to be cleansed—but that can’t be said of all of you.” For Jesus knew which one was about to betray him, "},{"num":11,"verse":"and that’s why he told them that not all of them were clean."},{"num":12,"verse":"After washing their feet, he put his robe on and returned to his place at the table. “Do you understand what I just did?” Jesus said. "},{"num":13,"verse":"“You’ve called me your teacher and lord, and you’re right, for that’s who I am. "},{"num":14,"verse":"So if I’m your teacher and lord and have just washed your dirty feet, then you should follow the example that I’ve set for you and wash one another’s dirty feet. Now do for each other what I have just done for you. "},{"num":16,"verse":"I speak to you timeless truth: a servant is not superior to his master, and an apostle is never greater than the one who sent him. "},{"num":17,"verse":"So now put into practice what I have done for you, and you will experience a life of happiness enriched with untold blessings!”"},{"header":"Jesus Predicts His Betrayal"},{"num":18,"verse":"“I don’t refer to all of you when I tell you these things, for I know the ones I’ve chosen—to fulfill the Scripture that says, ‘The one who shared supper with me treacherously betrays me.’ "},{"num":19,"verse":"I am telling you this now, before it happens, so that when the prophecy comes to pass you will be convinced that I AM. "},{"num":20,"verse":"“Listen to this timeless truth: whoever receives the messenger I send receives me, and the one who receives me receives the Father who sent me.”"},{"num":21,"verse":"Then Jesus was moved deeply in his spirit. Looking at his disciples, he announced, “I tell you the truth—one of you is about to betray me.”"},{"num":22,"verse":"Eyeing each other, his disciples puzzled over which one of them could do such a thing. "},{"num":23,"verse":"The disciple that Jesus dearly loved was at the right of him at the table and was leaning his head on Jesus. "},{"num":24,"verse":"Peter gestured to this disciple to ask Jesus who it was he was referring to. "},{"num":25,"verse":"Then the dearly loved disciple leaned into Jesus’ chest and whispered, “Master, who is it?”"},{"num":26,"verse":"“The one I give this piece of bread to after I’ve dipped it in the bowl,” Jesus replied. Then he dipped the piece of bread into the bowl and handed it to Judas Iscariot, the son of Simon. "},{"num":27,"verse":"And when Judas ate the piece of bread, Satan entered him. Then Jesus looked at Judas and said, “What you are planning to do, go do it now.” "},{"num":28,"verse":"None of those around the table realized what was happening. "},{"num":29,"verse":"Some thought that Judas, their trusted treasurer, was being told to go buy what was needed for the Passover celebration, or perhaps to go give something to the poor. "},{"num":30,"verse":"So Judas left quickly and went out into the dark night to betray Jesus."},{"header":"Jesus Predicts Peter’s Denial"},{"num":31,"verse":"After Judas left the room, Jesus said, “The time has come for the glory of God to surround the Son of Man, and God will be greatly glorified through what happens to me. "},{"num":32,"verse":"And very soon God will unveil the glory of the Son of Man."},{"num":33,"verse":"“My dear friends, I only have a brief time left to be with you. And then you will search and long for me. But I tell you what I told the Jewish leaders: you’ll not be able to come where I am."},{"num":34,"verse":"“So I give you now a new commandment: Love each other just as much as I have loved you. "},{"num":35,"verse":"For when you demonstrate the same love I have for you by loving one another, everyone will know that you’re my true followers.”"},{"num":36,"verse":"Peter interjected, “But, Master, where are you going?”"},{"num":37,"verse":"Peter said, “What do you mean I’m not able to follow you now? I would sacrifice my life to die for you!”"},{"num":38,"verse":"Jesus answered, “Would you really lay down your life for me, Peter? Here’s the absolute truth: Before the rooster crows in the morning, you will say three times that you don’t even know me!”"}]