[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then they reviled him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Greek word occurs only here in the Gospels. The other passages where it occurs in the New Testament are ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 23:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Peter 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It expresses the passionate outburst of their anger, which was excited by his question, and finds vent in heaping reproaches upon him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou art his disciple.—They cast his own reproach back upon himself, but in stronger words than he had used they mark out the distinction between Jesus and themselves. Thou art that Man’s disciple.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Thou art his disciple.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—They cast his own reproach back upon himself, but in stronger words than he had used they mark out the distinction between Jesus and themselves. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Thou art that Man’s disciple.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But we are Moses’ disciples.—The emphasis of the words is important. We, as opposed to thou; Moses, as opposed to that Man’s.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "But we are Moses’ disciples.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The emphasis of the words is important. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "We,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as opposed to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "thou; Moses,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as opposed to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "that Man’s.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:24-34 As Christ's mercies are most valued by those who have felt the want of them, that have been blind, and now see; so the most powerful and lasting affections to Christ, arise from actual knowledge of him. In the work of grace in the soul, though we cannot tell when, and how, and by what steps the blessed change was wrought, yet we may take the comfort, if we can say, through grace, Whereas I was blind, now I see. I did live a worldly, sensual life, but, thanks be to God, it is now otherwise with me, Eph 5:8. The unbelief of those who enjoy the means of knowledge and conviction, is indeed marvellous. All who have felt the power and grace of the Lord Jesus, wonder at the wilfulness of others who reject him. He argues strongly against them, not only that Jesus was not a sinner, but that he was of God. We may each of us know by this, whether we are of God or not. What do we? What do we for God? What do we for our souls? What do we more than others?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou art his disciple - This they cast at him as a reproach. His defense of Jesus they regarded as proof that he was his follower, and this they now attempted to show was inconsistent with being a friend of Moses and his law. Moses had given the law respecting the Sabbath; Jesus had healed a man contrary, in their view, to the law of Moses. They therefore held Jesus to be a violater and contemner of the law of Moses, and of course that his followers were also.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We are Moses' disciples - We acknowledge the authority of the law of Moses, which they alleged Jesus has broken by healing on that day. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We are Moses' disciples - We acknowledge the authority of the law of Moses, which they alleged Jesus has broken by healing on that day. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. I have told you already … will ye also be his disciples?—In a vein of keen irony he treats their questions as those of anxious inquirers, almost ready for discipleship! Stung by this, they retort upon him as the disciple (and here they plainly were not wrong); for themselves, they fall back upon Moses; about him there could be no doubt; but who knew about this upstart?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " If this were all their reviling, for them to tell this poor man that he was Christ’s disciple, it was a very tolerable imputation, and what the blind man had reason to glory in: their guilt in reviling is to be judged not so much from what they spake, for there was nothing of greater honour, as from what heart and spirit they spake it. A ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "disciple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifies, one that followeth another, and learns of him. To be a disciple of Christ indeed, was the greatest thing that any could glory in; yet the imputation of it to this blind man is here called a reviling: whence we may observe, that the guilt of reviling is to be judged not so much from the words which a man speaketh, as from the frame of his spirit, and design of that in the speaking of them. If a man speaketh that of another which is good and true, yet if he doth it out of a design to expose him, to do him mischief, and make him odious unto others, God doth account this reviling, because it proceedeth from the hatred of our brother in our heart, and a design to do him harm. Again, though indeed it was no reproach to be called Christ’s disciple, yet they affixed this term upon this poor man out of a design to reproach him, and to expose him to the hatred of others. We are in the government of our tongues not only obliged to take heed what we say, but with what heart, and out of what design we speak it. A malicious design turns terms of the greatest honour into terms of reviling. Besides, they here oppose Christ and Moses: whereas, Moses was but the type, Christ the antitype; Moses prophesied of Christ, Christ was that Prophet which God had promised to raise up like unto him; Moses but the school master, who led them unto Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then they reviled him,.... Called him an impertinent, saucy, impudent fellow, for talking in this pert manner to them, the great sanhedrim of the nation; or, as the Vulgate Latin version reads, they cursed him; they thundered out their anathemas against him, and pronounced him an execrable and an accursed fellow: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, thou art his disciple; for they looked upon it a reproach and scandal to be called a disciple of Jesus of Nazareth; though there is nothing more honourable than to be a follower of him the Lamb whithersoever he goes: wherefore these Jews threw off what they thought a term of reproach from themselves to the blind man; and perhaps they might say this to ensnare him, hoping that he would own himself to be a disciple of Jesus, and profess him to be the Christ, that they might, according to their own act, excommunicate him. The Vulgate Latin, Persic, and Ethiopic versions read, \"be thou his disciple\"; if thou wilt, we despise the character; far be it from us that we should be followers of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but we are Moses's disciples. Thus they preferred Moses to Christ, and chose to be the disciples of Moses the servant, rather than of Christ the Son; though indeed they were not the genuine disciples of Moses; for if they had, they would have been the disciples of Christ, and believers in him, since Moses wrote and testified of him: they might indeed be so far the disciples of Moses, or of his law, since they sought for righteousness and justification by obedience to his law. This was a phrase in use among the Jews: so the Targumist (i) on Numbers 3:2 says, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but we are Moses's disciples. Thus they preferred Moses to Christ, and chose to be the disciples of Moses the servant, rather than of Christ the Son; though indeed they were not the genuine disciples of Moses; for if they had, they would have been the disciples of Christ, and believers in him, since Moses wrote and testified of him: they might indeed be so far the disciples of Moses, or of his law, since they sought for righteousness and justification by obedience to his law. This was a phrase in use among the Jews: so the Targumist (i) on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " says, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"these are the names of they sons of Aaron the priests, , \"the disciples of Moses\", the master of the Israelites;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "particularly the Pharisees, as here, claimed this title to themselves: for it is said (k), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"all the seven days (before the day of atonement) they delivered to him (the high priest) two of the disciples of the wise men, to instruct him in the service (of that day), who were,  , \"of the disciples of Moses\", in opposition to the Sadducees:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from whence it appears, that these disciples of Moses were of the sect of the Pharisees, who assumed this character as peculiar to themselves; sometimes they call themselves the disciples of Abraham, though the description they give of such, by no means belongs to them; See Gill on John 8:39. They say (l), ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from whence it appears, that these disciples of Moses were of the sect of the Pharisees, who assumed this character as peculiar to themselves; sometimes they call themselves the disciples of Abraham, though the description they give of such, by no means belongs to them; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They say (l), ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"whoever has three things in him, is  , \"of the disciples of Abraham\" our father, and who has three other things is of the disciples of Balaam the wicked: he that has a good eye, (beneficence, or temperance, or contentment,) a lowly spirit, and an humble soul, he is of \"the disciples of Abraham\" our father; but he that has evil eye, and a proud spirit, and a large soul (lustful or covetous), is of the disciples of Balaam.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This last character best agrees with those very persons, who would be thought to be the disciples of Abraham and of Moses. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Jonathan ben Uzziel in ib. (k) T. Bab. Yoma, fol. 4. 1.((l) Pirke Abot, c. 5. sect. 19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Jonathan ben Uzziel in ib. (k) T. Bab. Yoma, fol. 4. 1.((l) Pirke Abot, c. 5. sect. 19. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{6} Then they reviled him, and said, Thou art his disciple; but we are Moses' disciples.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{6}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Then they reviled him, and said, Thou art his disciple; but we are Moses' disciples.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) Eventually, proud wickedness must necessarily break forth, which lies vainly hidden under a zeal of godliness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλοιδόρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] as preliminary to the following words. Passionate outburst in an unrighteous cause.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σὺ εἶ μαθʼ ἐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] They had been unable to get out of him any declaration ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesus, and regarded his behaviour, therefore, as a taking part with Christ. Bengel aptly remarks on ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκείνου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “Hoc vocabulo ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "removent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesum a sese.” Comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] once again with proud emphasis.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Μωϋσῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] has the emphasis in opposition to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which thus receives ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the more contemptuous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a meaning (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and often).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πόθεν ἐστιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". by whom he is sent. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It serves its purpose of exasperating them and bringing them to the direct expression of their feelings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλοιδόρησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐστίν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “They reviled him.” On ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκείνου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Bengel has: “Hoc vocabulo ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "removent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesum a sese”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then they reviled him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Omit ‘then.’ The word for ‘revile’ occurs nowhere else in the Gospels. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Argument fails, so they resort to abuse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou art his disciple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou art",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that man’s",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "disciple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They use a pronoun which expresses that they have nothing to do with Him. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The pronouns are emphatic in both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 9:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 9:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 9:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 9:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " : ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " art His disciple; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are Moses’ disciples. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " know that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hath spoken to Moses; but as for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fellow, &c.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλοιδόρησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they reviled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They thought that they were loading him with dishonour, whomsoever they called by the term, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a disciple of Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκέινου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of that man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") By the use of this expression they put Jesus away to a distance from them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They reviled him, and said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou art the disciple of that Man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐκείνου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - between whom and us there is an impassable chasm. Here is one of the strongest indications of the irreversible breach between the Jews and Jesus - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "but we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", instead of being his disciples, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "are disciples of Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This speech shows that, whatever the blind man meant to convey by the reproachful entreaty of ver. 27, the Jews took it as proof of his virtual confession of discipleship to Jesus, and this they assumed was tantamount to breaking with Moses. They assume that their traditionary interpretation of the Mastic Law has all the authority of the great Lawgiver himself. John 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Reviled (ἐλοιδόρησαν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The verb means to reproach or scold in a loud and abusive manner. Calvin, on 1 Corinthians 4:12, \"being reviled we bless,\" remarks: \"Λοιδορία is a harsher railing, which not only rebukes a man, but also sharply bites him, and stamps him with open contumely. Hence λοιδορεῖν is to wound a man as with an accursed sting.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The verb means to reproach or scold in a loud and abusive manner. Calvin, on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"being reviled we bless,\" remarks: \"Λοιδορία is a harsher railing, which not only rebukes a man, but also sharply bites him, and stamps him with open contumely. Hence λοιδορεῖν is to wound a man as with an accursed sting.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "His disciple (μαθητὴς ἐκείνου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Literally, that man's disciple. The pronoun has a contemptuous force which is not given by his. ",
        "children": []
      }
    ]
  }
]