[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(39) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In their heat I will make their feasts . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words are stern and bitter in their irony. When the revellers are hot with wine and lust (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:4-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Jehovah would call them to a banquet of another kind. The wine cup which He would give them would be that of His wrath (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and their drunken joy should end in an eternal sleep. So Herodotus (i. 191) narrates that when Cyrus took the city by his stratagem the inhabitants were keeping a feast with their wonted revelry and license. (Compare Xenoph. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cyropœd. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vii. 23.)",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew Henry's Concise Commentary51:1-58 The particulars of this prophecy are dispersed and interwoven, and the same things left and returned to again. Babylon is abundant in treasures, yet neither her waters nor her wealth shall secure her. Destruction comes when they did not think of it. Wherever we are, in the greatest depths, at the greatest distances, we are to remember the Lord our God; and in the times of the greatest fears and hopes, it is most needful to remember the Lord. The feeling excited by Babylon's fall is the same with the New Testament Babylon, Re 18:9,19. The ruin of all who support idolatry, infidelity, and superstition, is needful for the revival of true godliness; and the threatening prophecies of Scripture yield comfort in this view. The great seat of antichristian tyranny, idolatry, and superstition, the persecutor of true Christians, is as certainly doomed to destruction as ancient Babylon. Then will vast multitudes mourn for sin, and seek the Lord. Then will the lost sheep of the house of Israel be brought back to the fold of the good Shepherd, and stray no more. And the exact fulfilment of these ancient prophecies encourages us to faith in all the promises and prophecies of the sacred Scriptures.Barnes' Notes on the BibleIn their heat ... - While, like so many young lions, they are in the full glow of excitement over their prey, God prepares for them a drinking-bout to end in the sleep of death. Compare Daniel 5:1. Jamieson-Fausset-Brown Bible Commentary39. In their heat I will make their feasts—In the midst of their being heated with wine, I will give them \"their\" potions,—a very different cup to drink, but one which is their due, the wine cup of My stupefying wrath (Jer 25:15; 49:12; Isa 51:17; La 4:21).rejoice, and sleep … perpetual, &c.—that they may exult, and in the midst of their jubilant exultation sleep the sleep of death (Jer 51:57; Isa 21:4, 5).Matthew Poole's Commentary When they shall grow hot with wine, I will put, or give, or make them a feast of another nature. Interpreters judge that the prophet referreth to the feast made by Belshazzar, Daniel 5:1, to a thousand of his lords,  when he and his wives and concubines drank wine in the vessels belonging to the temple, during which feast the city was taken. So they were made drunk with the wine cup of God’s fury, because the Lord had designed them to utter ruin and destruction, that as men filled with wine are merry, and shout, and then fall asleep; so the Chaldeans being drunk with the wine of the Lord’s wrath, while they were merry with their cups of wine, might fall into such a sleep as they should never awake out of. Gill's Exposition of the Entire BibleIn their heat I will make their feasts,.... I will order it that their feasts shall be id the time of heat, that so they may be made drunk; so Jarchi: or when they are hot with feasting, I will disturb their feast by a handwriting on the wall; so Kimchi; see Daniel 5:1; to which he directs: or when they are inflamed with wine, I will put something into their banquets, into their cups; I will mingle their potions with the wine of my wrath; and, while they are feasting, ruin shall come upon them; and so it was, according to Herodotus and Xenophon, that the city of Babylon was taken, while the inhabitants were feasting; and this account agrees with Daniel 5:1. This text is quoted in the Talmud (c), where the gloss on it says, \"this is said concerning Belshazzar and his company, when they returned from a battle with Darius and Cyrus, who besieged Babylon, and Belshazzar overcame that day; and they were weary and hot, and sat down to drink, and were drunken, and on that day he was slain;'' and the Targum is, \"I will bring tribulation upon them:'' and I will make them drunken, that they may rejoice; in a riotous and revelling way; or that they may be mad and tremble, as R. Jonah, from the use of the word (d) in the Arabic language, interprets it; so drunken men are oftentimes like mad men, deprived of their senses, and their limbs tremble through the strength of liquor; and here it signifies, that the Chaldeans should be so intoxicated with the cup of divine wrath and vengeance, that they should be at their wits' end; in the utmost horror and trembling; not able to stand, or defend themselves; and so the Targum, \"they shall be like drunken men, that they may not be strong;'' but as weak as they: and sleep a perpetual sleep, and not wake, saith the Lord; not only fall asleep as drunken men do, and awake again; but sleep, and never awake more; or die, and not live again, until the resurrection morn; no doubt many of the Chaldeans, being in a literal sense drunk and asleep when the city was taken, were slain in their sleep, and never waked again. The Targum is, \"and die the second death, and not live in the world to come;'' see Revelation 21:8. (c) T. Bab. Megilia, fol. 15. 2.((d) \"furor ac repentina mors\", Camus apud Golium, col. 1634. \"tremor, timor mortis aegroto contingens\", Giggeius apud Castel. col. 2772. So R. Sol. Urbiu. Ohel Moed, fol. 32. 1. interprets the words of trembling. Geneva Study BibleIn their {x} heat I will make their feasts, and I will make them drunk, that they may rejoice, and sleep a perpetual sleep, and not wake, saith the LORD.(x) When they are inflamed with surfeiting and drinking, I will feast with them, alluding to Belshazzar's banquet, Da 5:2.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "51:1-58 The particulars of this prophecy are dispersed and interwoven, and the same things left and returned to again. Babylon is abundant in treasures, yet neither her waters nor her wealth shall secure her. Destruction comes when they did not think of it. Wherever we are, in the greatest depths, at the greatest distances, we are to remember the Lord our God; and in the times of the greatest fears and hopes, it is most needful to remember the Lord. The feeling excited by Babylon's fall is the same with the New Testament Babylon, Re 18:9,19. The ruin of all who support idolatry, infidelity, and superstition, is needful for the revival of true godliness; and the threatening prophecies of Scripture yield comfort in this view. The great seat of antichristian tyranny, idolatry, and superstition, the persecutor of true Christians, is as certainly doomed to destruction as ancient Babylon. Then will vast multitudes mourn for sin, and seek the Lord. Then will the lost sheep of the house of Israel be brought back to the fold of the good Shepherd, and stray no more. And the exact fulfilment of these ancient prophecies encourages us to faith in all the promises and prophecies of the sacred Scriptures.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In their heat ... - While, like so many young lions, they are in the full glow of excitement over their prey, God prepares for them a drinking-bout to end in the sleep of death. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "39. In their heat I will make their feasts—In the midst of their being heated with wine, I will give them \"their\" potions,—a very different cup to drink, but one which is their due, the wine cup of My stupefying wrath (Jer 25:15; 49:12; Isa 51:17; La 4:21).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "rejoice, and sleep … perpetual, &c.—that they may exult, and in the midst of their jubilant exultation sleep the sleep of death (Jer 51:57; Isa 21:4, 5).",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " When they shall grow hot with wine, I will put, or give, or make them a feast of another nature. Interpreters judge that the prophet referreth to the feast made by Belshazzar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Daniel 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "to a thousand of his lords, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " when he and his wives and concubines drank wine in the vessels belonging to the temple, during which feast the city was taken. So they were made drunk with the wine cup of God’s fury, because the Lord had designed them to utter ruin and destruction, that as men filled with wine are merry, and shout, and then fall asleep; so the Chaldeans being drunk with the wine of the Lord’s wrath, while they were merry with their cups of wine, might fall into such a sleep as they should never awake out of. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In their heat I will make their feasts,.... I will order it that their feasts shall be id the time of heat, that so they may be made drunk; so Jarchi: or when they are hot with feasting, I will disturb their feast by a handwriting on the wall; so Kimchi; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to which he directs: or when they are inflamed with wine, I will put something into their banquets, into their cups; I will mingle their potions with the wine of my wrath; and, while they are feasting, ruin shall come upon them; and so it was, according to Herodotus and Xenophon, that the city of Babylon was taken, while the inhabitants were feasting; and this account agrees with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This text is quoted in the Talmud (c), where the gloss on it says, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"this is said concerning Belshazzar and his company, when they returned from a battle with Darius and Cyrus, who besieged Babylon, and Belshazzar overcame that day; and they were weary and hot, and sat down to drink, and were drunken, and on that day he was slain;'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and the Targum is, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"I will bring tribulation upon them:'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and I will make them drunken, that they may rejoice; in a riotous and revelling way; or that they may be mad and tremble, as R. Jonah, from the use of the word (d) in the Arabic language, interprets it; so drunken men are oftentimes like mad men, deprived of their senses, and their limbs tremble through the strength of liquor; and here it signifies, that the Chaldeans should be so intoxicated with the cup of divine wrath and vengeance, that they should be at their wits' end; in the utmost horror and trembling; not able to stand, or defend themselves; and so the Targum, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"they shall be like drunken men, that they may not be strong;'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "but as weak as they: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and sleep a perpetual sleep, and not wake, saith the Lord; not only fall asleep as drunken men do, and awake again; but sleep, and never awake more; or die, and not live again, until the resurrection morn; no doubt many of the Chaldeans, being in a literal sense drunk and asleep when the city was taken, were slain in their sleep, and never waked again. The Targum is, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"and die the second death, and not live in the world to come;'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "see Revelation 21:8. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(c) T. Bab. Megilia, fol. 15. 2.((d) \"furor ac repentina mors\", Camus apud Golium, col. 1634. \"tremor, timor mortis aegroto contingens\", Giggeius apud Castel. col. 2772. So R. Sol. Urbiu. Ohel Moed, fol. 32. 1. interprets the words of trembling. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "In their {x} heat I will make their feasts, and I will make them drunk, that they may rejoice, and sleep a perpetual sleep, and not wake, saith the LORD.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(x) When they are inflamed with surfeiting and drinking, I will feast with them, alluding to Belshazzar's banquet, Da 5:2.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". While they are exulting over the spoil which they have won from the conquered nations I will prepare a feast for them, inducing a sleep that shall be endless.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When they are heated",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] referring either to the glow of passionate indulgence, or to murderous ferocity. But Gi. would read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I am hot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (with anger).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may rejoice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The LXX, reading apparently one consonant differently from MT., render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may be stupefied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jeremiah 51:39",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The inhabitants of Babylon fall; the city perishes with its idols, to the joy of the whole world. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Together they roar like young lions, they growl like the whelps of lionesses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When they are heated, I will prepare their banquets, and will make them drunk, that they may exult and sleep an eternal sleep, and not awake, saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I will bring them down like lambs to be slaughtered, like rams with he-goats. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". How is Sheshach taken, and the praise of the whole earth seized! How Babylon is become an astonishment among the nations! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sea has gone up over Babylon: she is covered with the multitude of its waves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Her cities have become a desolation, a land of drought, and a steppe, a land wherein no man dwells, and through which no son of man passes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I will punish Bel in Babylon, and will bring out of his mouth what he has swallowed, and no longer shall nations go in streams to him: the wall of Babylon also shall fall. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Go ye out from the midst of her, my people! and save ye each one his life from the burning of the wrath of Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And lest your heart be weak, and ye be afraid because of the report which is heard in the land, and there comes the [ equals  this] report in the [ equals  this] year, and afterwards in the [ equals  that] year the [ equals  that] report, and violence, in the land, ruler against ruler. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore, behold, days are coming when I will punish the graven images of Babylon; and her whole land shall dry up,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Rather, \"shall be ashamed;\" see note at foot of p. 311. - Tr.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all her slain ones shall fall in her midst. Jeremiah 51:48. And heaven and earth, and all that is in them, shall sing for joy over Babylon: for the destroyers shall come to her from the north, saith Jahveh. Jeremiah 51:49. As Babylon sought that slain ones of Israel should fall, so there fall, in behalf of Babylon, slain ones of the whole earth.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and all her slain ones shall fall in her midst. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And heaven and earth, and all that is in them, shall sing for joy over Babylon: for the destroyers shall come to her from the north, saith Jahveh. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As Babylon sought that slain ones of Israel should fall, so there fall, in behalf of Babylon, slain ones of the whole earth.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This avenging judgment shall come on the inhabitants of Babylon in the midst of their revelry. Jeremiah 51:38. They roar and growl like young lions over their prey; cf. Jeremiah 2:15; Amos 3:4. When, in their revelries, they will be heated over their prey, the Lord will prepare for them a banquet by which they shall become intoxicated, so that they sink down, exulting (i.e., staggering while they shout), into an eternal sleep of death. חמּם, \"their heat,\" or heating, is the glow felt in gluttony and revelry, cf. Hosea 7:4., not specially the result or effect of a drinking-bout; and the idea is not that, when they become heated through a banquet, then the Lord will prepare another one for them, but merely this, that in the midst of their revelry the Lord will prepare for them the meal they deserve, viz., give them the cup of wrath to drink, so that they may fall down intoxicated into eternal sleep, from which they no more awake. These words are certainly not a special prediction of the fact mentioned by Herodotus (i. 191) and Xenophon (Cyrop. vii. 23), that Cyrus took Babylon while the Babylonians were celebrating a feast and holding a banquet; they are merely a figurative dress given to the thought that the inhabitants of Babylon will be surprised by the judgment of death in the midst of their riotous enjoyment of the riches and treasure taken as spoil from the nations. In that fact, however, this utterance has received a fulfilment which manifestly confirms the infallibility of the word of God. In Jeremiah 51:40, what has been said is confirmed by another figure; cf. Jeremiah 48:5 and Jeremiah 50:27. Lambs, rams, goats, are emblems of all the classes of the people of Israel; cf. Isaiah 34:6; Ezekiel 39:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This avenging judgment shall come on the inhabitants of Babylon in the midst of their revelry. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They roar and growl like young lions over their prey; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". When, in their revelries, they will be heated over their prey, the Lord will prepare for them a banquet by which they shall become intoxicated, so that they sink down, exulting (i.e., staggering while they shout), into an eternal sleep of death. חמּם, \"their heat,\" or heating, is the glow felt in gluttony and revelry, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., not specially the result or effect of a drinking-bout; and the idea is not that, when they become heated through a banquet, then the Lord will prepare another one for them, but merely this, that in the midst of their revelry the Lord will prepare for them the meal they deserve, viz., give them the cup of wrath to drink, so that they may fall down intoxicated into eternal sleep, from which they no more awake. These words are certainly not a special prediction of the fact mentioned by Herodotus (i. 191) and Xenophon (Cyrop. vii. 23), that Cyrus took Babylon while the Babylonians were celebrating a feast and holding a banquet; they are merely a figurative dress given to the thought that the inhabitants of Babylon will be surprised by the judgment of death in the midst of their riotous enjoyment of the riches and treasure taken as spoil from the nations. In that fact, however, this utterance has received a fulfilment which manifestly confirms the infallibility of the word of God. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", what has been said is confirmed by another figure; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Lambs, rams, goats, are emblems of all the classes of the people of Israel; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 34:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]