[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(46) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And lest your heart faint . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let not your heart faint; fear ye not . . .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the rumour that shall be heard in the land.—It lies in the nature of the case that the final catastrophe of the city would be preceded by a period of uncertainty and suspense. Men would hear of the union of the Medes and Persians under Cyrus, of the murder of Evil-Merodach by Neriglissar, of the death of Neriglissar in fighting against the enemy (B.C. 555). The child-king, whom Berosus calls Laborosoarchod, was dethroned by his nobles after a few months, and was succeeded by the father of the Belshazzar of Daniel 5:1, the Labynetus of Herodotus, whose true name was Nabo-nahid. The whole empire was in the throes of dissolution. The words present a singular parallel to those which speak of “wars and rumours of wars” in Matthew 24:6-7; Luke 21:9.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "For the rumour that shall be heard in the land.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It lies in the nature of the case that the final catastrophe of the city would be preceded by a period of uncertainty and suspense. Men would hear of the union of the Medes and Persians under Cyrus, of the murder of Evil-Merodach by Neriglissar, of the death of Neriglissar in fighting against the enemy (B.C. 555). The child-king, whom Berosus calls Laborosoarchod, was dethroned by his nobles after a few months, and was succeeded by the father of the Belshazzar of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Labynetus of Herodotus, whose true name was Nabo-nahid. The whole empire was in the throes of dissolution. The words present a singular parallel to those which speak of “wars and rumours of wars” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 21:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "51:1-58 The particulars of this prophecy are dispersed and interwoven, and the same things left and returned to again. Babylon is abundant in treasures, yet neither her waters nor her wealth shall secure her. Destruction comes when they did not think of it. Wherever we are, in the greatest depths, at the greatest distances, we are to remember the Lord our God; and in the times of the greatest fears and hopes, it is most needful to remember the Lord. The feeling excited by Babylon's fall is the same with the New Testament Babylon, Re 18:9,19. The ruin of all who support idolatry, infidelity, and superstition, is needful for the revival of true godliness; and the threatening prophecies of Scripture yield comfort in this view. The great seat of antichristian tyranny, idolatry, and superstition, the persecutor of true Christians, is as certainly doomed to destruction as ancient Babylon. Then will vast multitudes mourn for sin, and seek the Lord. Then will the lost sheep of the house of Israel be brought back to the fold of the good Shepherd, and stray no more. And the exact fulfilment of these ancient prophecies encourages us to faith in all the promises and prophecies of the sacred Scriptures.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Literally, \"And beware lest your heart faint, and ye be afraid because of the rumour that is heard in the land: for in one year shall one rumour come, and afterward in another year another rumour; and violence shall be in the land etc.\" The fall of Babylon was to be preceded by a state of unquiet, men's minds being unsettled partly by rumors of the warlike preparations of the Medes, and of actual invasions: partly by intestine feuds. So before the conquest of Jerusalem by the Romans the Church had similar warnings ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46. And lest—Compare, for the same ellipsis, Ge 3:22; Ex 13:17; De 8:12. \"And in order that your heart may not faint at the (first) rumor\" (of war), I will give you some intimation of the time. In the first \"year\" there shall \"come a rumor\" that Cyrus is preparing for war against Babylon. \"After that, in another year, shall come a rumor,\" namely, that Cyrus is approaching, and has already entered Assyria. Then is your time to \"go out\" (Jer 51:45). Babylon was taken the following or third year of Belshazzar's reign [Grotius].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "violence in the land—of Babylon (Ps 7:16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ruler against ruler—or, \"ruler upon ruler,\" a continual change of rulers in a short space. Belshazzar and Nabonidus, supplanted by Darius or Cyaxares, who is succeeded by Cyrus.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And lest your heart faint; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and lest they should be affrighted by the succession of evils year after year that should come on Babylon. Some think it were better translated, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And let not your heart faint",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though you should hear of Cyrus’s coming year after year, yet faint not; (for they say Cyrus was one year preparing, and that he spent the second year in passing through Assyria, so as he came not at Babylon till the third year;) no, not though you should see or hear of successive troubles, and a great deal of violence in the land by the opposition of great princes one to another, for none of them shall do you any harm; but this doth not so well suit to the former verse, where they are bidden to make haste out and to save their own lives. I do therefore prefer the sense of our interpreters, and their translation of it, as making another argument to persuade them to make haste out, because they would by reason of the successive evils year after year coming upon the Babylonians live there very troublesome and uneasy lives. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And lest your heart faint, and ye fear for the rumour that shall be heard in the land,.... The rumour of war in the land of Chaldea; the report of the Medes and Persians preparing to invade it, and besiege Babylon, in the peace of which city the Jews had peace; and therefore might fear they should suffer in the calamities of it; but, lest they should, they are ordered to go cut of it, and accept the liberty that should be granted by the conqueror, who would do them no hurt, but good; and had therefore nothing to fear from him; and, as a token, assuring them of this, the following things are declared; which, when they should observe, they need not be troubled, being forewarned; yea, might take encouragement from it, and believe that their redemption drew nigh: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a rumour shall both come one year and after that in another year shall come a rumour; in one year there was a rumour of the great preparation Cyrus was making to invade Chaldea, and besiege Babylon; in another year, that is, the following, as the Targum rightly renders it, there was a second rumour of his coming; and who actually did come into Assyria, but was stopped at the river Gyndes, not being able to pass it for want of boats; and, being enraged at the loss of a favourite horse in it, resolved upon the draining it; which he accomplished, by cutting many sluices and rivulets; in doing which he spent the whole summer; and the spring following came to Babylon, as Herodotus (l) relates; when what is after predicted followed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and violence in the land, ruler against ruler; the king of Babylon came out with his forces to meet Cyrus, as the same historian says; when a battle ensue, in which the former was beat, and obliged to retire into the city, which then Cyrus besieged; and thus violence and devastations were made in the land by the army of the Medes and Persians; and ruler was against ruler; Cyrus against Belshazzar, and Belshazzar against him. Some read it, \"ruler upon ruler\" (m); that is, one after another, in a very short time; so Jarchi, Kimchi, and Abarbinel; thus two before Belshazzar, then Darius, and, after Darius, Cyrus. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) L. 1. sive Clio, c. 189, 190. (m)   \"dominator super dominatorem\", Pagninus, Montanus, Calvin, Junius & Tremellius, Piscator, Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) L. 1. sive Clio, c. 189, 190. (m)   \"dominator super dominatorem\", Pagninus, Montanus, Calvin, Junius & Tremellius, Piscator, Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And lest your heart should faint, and ye should fear for the rumour that shall be heard in the land; a rumour shall both come one {b} year, and after that in another year shall come a rumour, and violence in the land, ruler against ruler.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And lest your heart should faint, and ye should fear for the rumour that shall be heard in the land; a rumour shall both come ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "one",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " year, and after that in ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "another",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " year ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "shall come",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a rumour, and violence in the land, ruler against ruler.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Meaning that Babylon would not be destroyed all at once but little by little would be brought to nothing for the first year came the tidings, the next year the siege and in the third year it was taken: yet this is not that horrible destruction which the prophets threatened in many places: for that was after this when they rebelled and Darius over came them by the policy of Zopyrus, and hanged three thousand gentlemen beside the common people.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a rumour … a rumour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rumour shall succeed rumour, as the years go on, and disquieting revolts shall foreshadow the final break-up of the Babylonian empire.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 46.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And lest your heart faint,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "beware",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "lest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A rumour shall both come;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for a rumour shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " come. The war, then, will last some time, and all kinds of rumours will be in the air. Keil compares ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jeremiah 51:46",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet they are not to despair when the catastrophe draws near, and all kinds of rumours of war and oppression are abroad. The repetition of השּׁמוּעה expresses the correlative relation, - this and that report; cf. Ewald, 360, c. The suffix in אחריו has a neuter sense; the word means \"afterwards\" ( equals  אחרי זאת, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). וחמס בּארץ is also to be taken as dependent, grammatically, on וּבא: \"and when a deed of violence is committed in the land, one ruler (rises up) against the other.\" These words presuppose not merely a pretty long duration of the war, but also rebellion and revolution, through which Babylon is to go to ruin. In this sense they are employed by Christ for describing the wars and risings that are to precede His advent; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]