[{"header":"Joseph interprets Pharaoh’s dreams"},{"num":41,"verse":"Two years later, Pharaoh dreamed that he was standing near the Nile."},{"num":2,"verse":"In front of him, seven healthy-looking, fattened cows climbed up out of the Nile and grazed on the reeds."},{"num":3,"verse":"Just then, seven other cows, terrible-looking and scrawny, climbed up out of the Nile after them and stood beside them on the bank of the Nile."},{"num":4,"verse":"The terrible-looking, scrawny cows devoured the seven healthy-looking, fattened cows. Then Pharaoh woke up."},{"num":5,"verse":"He went back to sleep and had a second dream, in which seven ears of grain, full and healthy, grew on a single stalk."},{"num":6,"verse":"Just then, seven ears of grain, scrawny and scorched by the east wind, sprouted after them,"},{"num":7,"verse":"and the scrawny ears swallowed up the full and well-formed ears. Then Pharaoh woke up and realized it was a dream."},{"num":8,"verse":"In the morning, he was disturbed and summoned all of Egypt’s religious experts and all of its advisors. Pharaoh described his dreams to them, but they couldn’t interpret them for Pharaoh."},{"num":9,"verse":"Then the chief wine steward spoke to Pharaoh: “Today I’ve just remembered my mistake."},{"num":10,"verse":"Pharaoh was angry with his servants and put me and the chief baker under arrest with the commander of the royal guard."},{"num":11,"verse":"We both dreamed one night, he and I, and each of our dreams had its own interpretation."},{"num":12,"verse":"A young Hebrew man, a servant of the commander of the royal guard, was with us. We described our dreams to him, and he interpreted our dreams for us, giving us an interpretation for each dream."},{"num":13,"verse":"His interpretations came true exactly: Pharaoh restored me to my position but hanged him.”"},{"num":14,"verse":"So Pharaoh summoned Joseph, and they quickly brought him from the dungeon. He shaved, changed clothes, and appeared before Pharaoh."},{"num":15,"verse":"Pharaoh said to Joseph, “I had a dream, but no one could interpret it. Then I heard that when you hear a dream, you can interpret it.”"},{"num":16,"verse":"Joseph answered Pharaoh, “It’s not me. God will give Pharaoh a favorable response.”"},{"num":17,"verse":"So Pharaoh said to Joseph, “In my dream I was standing on the bank of the Nile."},{"num":18,"verse":"In front of me, seven fattened, stout cows climbed up out of the Nile and grazed on the reeds."},{"num":19,"verse":"Just then, seven other cows, weak and frail and thin, climbed up after them. I’ve never seen such awful cows in all the land of Egypt."},{"num":20,"verse":"Then the thin, frail cows devoured the first seven, fattened cows."},{"num":21,"verse":"But after they swallowed them whole, no one would have known it. They looked just as bad as they had before. Then I woke up."},{"num":22,"verse":"I went to sleep again and saw in my dream seven full and healthy ears of grain growing on one stalk."},{"num":23,"verse":"Just then, seven hard and thin ears of grain, scorched by the east wind, sprouted after them,"},{"num":24,"verse":"and the thin ears swallowed up the healthy ears. I told the religious experts, but they couldn’t explain it to me.”"},{"num":25,"verse":"Joseph said to Pharaoh, “Pharaoh has actually had one dream. God has announced to Pharaoh what he is about to do."},{"num":26,"verse":"The seven healthy cows are seven years, and the seven healthy ears of grain are seven years. It’s actually one dream."},{"num":27,"verse":"The seven thin and frail cows, climbing up after them, are seven years. The seven thin ears of grain, scorched by the east wind, are seven years of famine."},{"num":28,"verse":"It’s just as I told Pharaoh: God has shown Pharaoh what he is about to do."},{"num":29,"verse":"Seven years of great abundance are now coming throughout the entire land of Egypt."},{"num":30,"verse":"After them, seven years of famine will appear, and all of the abundance in the land of Egypt will be forgotten. The famine will devastate the land."},{"num":31,"verse":"No one will remember the abundance in the land because the famine that follows will be so very severe."},{"num":32,"verse":"The dream occurred to Pharaoh twice because God has determined to do it, and God will make it happen soon."},{"header":"Joseph’s rise to power"},{"num":33,"verse":"“Now Pharaoh should find an intelligent, wise man and give him authority over the land of Egypt."},{"num":34,"verse":"Then Pharaoh should appoint administrators over the land and take one-fifth of all the produce of the land of Egypt during the seven years of abundance."},{"num":35,"verse":"During the good years that are coming, they should collect all such food and store the grain under Pharaoh’s control, protecting the food in the cities."},{"num":36,"verse":"This food will be reserved for the seven years of famine to follow in the land of Egypt so that the land won’t be ravaged by the famine.”"},{"num":37,"verse":"This advice seemed wise to Pharaoh and all his servants,"},{"num":38,"verse":"and Pharaoh said to his servants, “Can we find a man with more God-given gifts than this one?”"},{"num":39,"verse":"Then Pharaoh said to Joseph, “Since God has made all this known to you, no one is as intelligent and wise as you are."},{"num":40,"verse":"You will be in charge of my kingdom, and all my people will obey your command. Only as the enthroned king will I be greater than you.”"},{"num":41,"verse":"Pharaoh said to Joseph, “Know this: I’ve given you authority over the entire land of Egypt.”"},{"num":42,"verse":"Pharaoh took his signet ring from his hand and put it on Joseph’s hand, he dressed him in linen clothes, and he put a gold necklace around his neck."},{"num":43,"verse":"He put Joseph on the chariot of his second-in-command, and everyone in front of him cried out, “Attention!” So Pharaoh installed him over the entire land of Egypt."},{"num":44,"verse":"Pharaoh said to Joseph, “I am Pharaoh; no one will do anything or go anywhere in all the land of Egypt without your permission.”"},{"num":45,"verse":"Pharaoh renamed Joseph, Zaphenath-paneah, and married him to Asenath, the daughter of Potiphera the priest of Heliopolis."},{"num":46,"verse":"Joseph was 30 years old when he began to serve Pharaoh, Egypt’s king, when he left Pharaoh’s court and traveled through the entire land of Egypt."},{"num":47,"verse":"During the seven years of abundance, the land produced plentifully."},{"num":48,"verse":"He collected all of the food during the seven years of abundance in the land of Egypt, and stored the food in cities. In each city, he stored the food from the fields surrounding it."},{"num":49,"verse":"Joseph amassed grain like the sand of the sea. There was so much that he stopped trying to measure it because it was beyond measuring."},{"num":50,"verse":"Before the years of famine arrived, Asenath the daughter of Potiphera, priest of Heliopolis, gave birth to two sons for Joseph."},{"num":51,"verse":"Joseph named the oldest son Manasseh, “because,” he said, “God has helped me forget all of my troubles and everyone in my father’s household.”"},{"num":52,"verse":"He named the second Ephraim, “because,” he said, “God has given me children in the land where I’ve been treated harshly.”"},{"num":53,"verse":"The seven years of abundance in the land of Egypt came to an end,"},{"num":54,"verse":"and the seven years of famine began, just as Joseph had said. The famine struck every country, but the entire land of Egypt had bread."},{"num":55,"verse":"When the famine ravaged the entire land of Egypt and the people pleaded to Pharaoh for bread, Pharaoh said to all of the Egyptians, “Go to Joseph. Do whatever he tells you.”"},{"num":56,"verse":"The famine covered every part of the land, and Joseph opened all of the granaries and sold grain to the Egyptians. In the land of Egypt, the famine became more and more severe."},{"num":57,"verse":"Every country came to Egypt to buy grain from Joseph, because in every country the famine had also become more severe."}]