[{"num":41,"verse":"After two years Pharaoh saw a dream; he guessed that he stood on a river, (Two years later, Pharaoh had a dream; he saw that he stood by a river,)"},{"num":2,"verse":"from which seven fair kine and full fat went up (from which seven cows, sleek and very fat, came out), and [they] were fed in the places of (the) marshes;"},{"num":3,"verse":"and (an)other seven, foul and lean, came out of the river, and were fed in that brink of the water, in green places; (and then seven others, foul and lean, came out of the river, and were fed on the bank of the river, in the green places;)"},{"num":4,"verse":"and those (foul and lean) kine devoured those kine of which the fairness and comeliness of (their) bodies were wonderful. (And) Pharaoh waked,"},{"num":5,"verse":"and slept again, and he saw another dream; seven ears of corn, full and fair, came forth in one stalk, (and then he slept again, and he had another dream; seven ears of corn, full and ripe, came forth on one stalk,)"},{"num":6,"verse":"and (then) others, as many ears of corn, (but) thin and smitten with (the) corruption of (the) burning wind, came forth,"},{"num":7,"verse":"devouring all the fairness of the first. (And) Pharaoh waked after this rest,"},{"num":8,"verse":"and when the morrowtide was made, he was afeared by inward dread, and he sent to all the expounders of Egypt, and to all the wise men; and when they were called, he told the dream, and none was that expounded it. (and when the morning came, he was greatly afraid, and he sent for all the dream readers of Egypt, and for all the wise men; and when they came to him, he told his dreams to them, but no one could interpret them.)"},{"num":9,"verse":"Then at the last, the master butler bethought (to) him(self), and said (to Pharaoh), I acknowledge my sin (at last);"},{"num":10,"verse":"the king was wroth to his servants, and commanded me and the master baker to be cast down into the prison of the prince of knights, (for the king was angry with his servants, and commanded me and the master baker to be throw into the prison of the captain of the guard,)"},{"num":11,"verse":"where we both saw a dream in one night, before-showing of things to come. (and one night we both had a dream, a fore-telling of things to come.)"},{"num":12,"verse":"An Hebrew child, servant of the same duke of knights, was there, to whom we told the dreams, and heard whatever thing the befalling of [the] thing proved afterward(s); (And a young Hebrew man, a slave of the same captain of the guard, was there, to whom we told our dreams, and then we heard from him what the befalling of the dreams later proved to be;)"},{"num":13,"verse":"for I am restored to mine office, and he was hanged in a cross. (for I was restored to my office, and he was hanged on a tree.)"},{"num":14,"verse":"Anon at the behest of the king, they polled Joseph (At once at the king’s command, they shaved Joseph), (and) led (him) out of the prison, and when his clothing was changed, they brought him to the king."},{"num":15,"verse":"To whom the king said, I saw dreams, and none [there] is that expoundeth those things that I saw; I have heard that thou expoundest such things most prudently. (To whom the king said, I had two dreams, and there is no one who can interpret what I saw; but I have heard that thou interpretest such things most prudently.)"},{"num":16,"verse":"Joseph answered, Without me, God shall answer prosperities to Pharaoh. (And Joseph answered, Not I, but God himself shall answer good things to Pharaoh.)"},{"num":17,"verse":"Therefore Pharaoh told that that he saw; I guessed that I stood on the brink of the flood, (And so Pharaoh told him what he had dreamed, saying, I stood on the bank of the river,)"},{"num":18,"verse":"and seven kine, full fair, with flesh able to eating, went up from the water, which kine gathered green sedges in the pasture of the marshes; (and seven cows, sleek and with flesh good for eating, came out of the water, and they gathered green sedges in the pasture of the marshes;)"},{"num":19,"verse":"and lo! seven other kine, so foul and lean, followed these, that I saw never such in the land of Egypt; (and lo! seven other cows followed them, so foul and lean, that I never before had seen such as these in all the land of Egypt;)"},{"num":20,"verse":"and when the former kine were devoured and wasted of the lean kine, (and when the first cows, the fat ones, were devoured and destroyed by the lean cows,)"},{"num":21,"verse":"the lean kine gave no step, or token, of fullness, but were slow, or feeble, by like leanness and paleness. I waked, (the lean cows gave no sign of fullness, but were as feeble, and with the same leanness and paleness, as before. I awakened,)"},{"num":22,"verse":"and again I was oppressed by sleep, and I saw a dream (and then again I was oppressed by sleep, and again I dreamed); seven ears of corn, full and most fair, came forth on one stalk,"},{"num":23,"verse":"and other seven (and seven others), thin and smitten with [a] burning wind, came forth (out) of the stubble,"},{"num":24,"verse":"which devoured the fairness of the former; I told this dream to [the] expounders, and no man there is that expoundeth it (I told these dreams to the interpreters, but there was no one who could interpret them for me)."},{"num":25,"verse":"Joseph answered, The dream of the king is one (The dreams of the king be one dream); God hath showed to Pharaoh what things he shall do."},{"num":26,"verse":"Seven fair kine, and seven full ears of corn, be seven years of plenty, and the same things comprehend the strength of the dream; (The seven fat and sleek cows, and the seven full ears of corn, be seven years of plenty, and they tell the same thing, and so the dreams be one dream;)"},{"num":27,"verse":"and [the] seven kine, thin and lean, that went up after the fair kine, and the seven thin ears of corn, and smitten with [a] burning wind, be seven years of hunger to coming, (and the seven foul and lean cows, that came out after the good cows, and the seven thin ears of corn, that be struck by a burning wind, be seven years of famine to come,)"},{"num":28,"verse":"which shall be fulfilled by this order. (which shall be fulfilled in this order.)"},{"num":29,"verse":"Lo! seven years of great plenty in all the land of Egypt shall come, (Lo! seven years of great plenty shall come in all the land of Egypt,)"},{"num":30,"verse":"and seven other years of so great barrenness shall follow those, that all the abundance before shall be given to forgetting; for hunger shall waste all the land, (and then seven more years of such great famine shall follow them, that all the abundance of before shall be forgotten; for the famine shall destroy all the land,)"},{"num":31,"verse":"and the greatness of neediness shall waste the greatness of plenty."},{"num":32,"verse":"Forsooth this that thou sawest the second time (in) a dream pertaining to the same thing (For what thou sawest in a second dream pertaining to the same thing), is (a) showing of firmness, that is, (a) confirming of the first, for the word of God shall be done, and it shall be [ful]filled full swiftly."},{"num":33,"verse":"Now therefore purvey the king a wise man and a ready (one), and make the king him sovereign to the land of Egypt, (And so now, let the king find a wise and able man, and make him the ruler over all the land of Egypt,)"},{"num":34,"verse":"which man ordain governors by all countries, and gather he into barns the fifth part of fruits by [the] seven years of plenty, that shall come now; (and that man ordain governors over all the countryside, and gather he into the barns the fifth part of the harvest of the land during the seven years of plenty that shall now come;)"},{"num":35,"verse":"and all the wheat be kept under the power of Pharaoh (and let all the corn, or the grain, be kept under Pharaoh’s power), and be it kept in [the] cities,"},{"num":36,"verse":"and be it made ready to the hunger to coming of the seven years that shall oppress Egypt, and the land be not wasted by poverty. (and have it made ready for the seven years of famine to come that shall oppress Egypt, and so the land shall not be destroyed by neediness.)"},{"num":37,"verse":"The counsel of Joseph pleased Pharaoh, and all his servants,"},{"num":38,"verse":"and he spake to them, Whether we be able to find such a man which is full of God’s spirit? (and Pharaoh said to them, Could we find any other man who is so full of God’s spirit as this man is?)"},{"num":39,"verse":"Therefore Pharaoh said to Joseph, For God hath showed to thee all things which thou hast spoken, whether I may find a wiser man than thou, and like to thee? (And so Pharaoh said to Joseph, For God hath shown to thee all the things which thou hast spoken, I know that I cannot find a wiser man than thou, or anyone even like thee!)"},{"num":40,"verse":"Therefore thou shalt be over mine house(hold), and all the people shall obey to the behest of thy mouth; I shall pass thee only by one throne of the realm (only by my throne of the kingdom shall I be greater than thee)."},{"num":41,"verse":"And again Pharaoh said to Joseph, Lo! I have ordained thee on all the land of Egypt. (And so Pharaoh said to Joseph, Lo! I ordain thee on all the land of Egypt.)"},{"num":42,"verse":"And Pharaoh took (off) the ring from his hand, and gave it in the hand of Joseph (and put it on Joseph’s finger), and he clothed Joseph with a stole of bis, or of white silk, and he put a golden wreath about his neck;"},{"num":43,"verse":"and Pharaoh made Joseph to go upon his second chariot (and Pharaoh had Joseph ride upon his second chariot), while a beadle cried, that all men should kneel before him, and should know that he was (the) sovereign of all the land of Egypt."},{"num":44,"verse":"And the king said to Joseph, I am Pharaoh, (and) without thy behest no man shall stir hand either foot in all the land of Egypt."},{"num":45,"verse":"And Pharaoh turned the name of Joseph, and called him by the Egyptian language, The Saviour of the World (And Pharaoh changed Joseph’s name, and called him in the Egyptian language, Zaphnathpaaneah); and he gave to Joseph a wife, Asenath, the daughter of Potipherah, a priest of Heliopolis, that is, The City of the Sun. And so Joseph went out (in)to the land of Egypt."},{"num":46,"verse":"Forsooth Joseph was of thirty years, when he stood in the sight of king Pharaoh, and compassed all the countries of Egypt. (And Joseph was thirty years old, when he stood before Pharaoh, the king of Egypt, and then went forth through all the countryside.)"},{"num":47,"verse":"And the plenty of [the] seven years came, and [the] ripe corns were bound into handfuls/into sheaves (and the harvest came forth in abundance),"},{"num":48,"verse":"and (they) were gathered into the barns of Egypt, also all the abundance of ripe corns was kept in all cities (and all the abundance of the harvest was kept in all the cities),"},{"num":49,"verse":"and so great abundance was of wheat (and there was such a great abundance of corn, or of grain), that it was made even to the gravel, (or the sand,) of the sea, and the plenty passed (any) measure."},{"num":50,"verse":"Soothly two sons were born to Joseph before that the hunger came, which Asenath, the daughter of Potipherah, a priest of Heliopolis, childed to him (bare for him)."},{"num":51,"verse":"And Joseph called the name of the first begotten son, Manasseh, and said, God hath made me to forget all my travails, and the house of my father; (And Joseph named his first-born son Manasseh, and said, For God hath made me forget all my travails, or all my troubles, and my father’s household, or my family;)"},{"num":52,"verse":"and he called the name of the second son Ephraim, and said, God hath made me to increase in the land of my poverty. (and he named his second son Ephraim, and said, For God hath made me to be fruitful in the land of my tribulation.)"},{"num":53,"verse":"Therefore when (the) seven years of plenty that were (to come) in Egypt were passed,"},{"num":54,"verse":"[the] seven years of poverty began to come, which Joseph before-said, and hunger had the mastery in all the world; also hunger was in all the land of Egypt; (the seven years of famine began, which Joseph had forecast, and the famine had the mastery in all the rest of the world; but there was still bread in all the land of Egypt;)"},{"num":55,"verse":"and (finally) when that land hungered, the people cried to Pharaoh, and asked (for) meats (but when the famine finally reached Egypt, the people cried to Pharaoh, and asked for food); to whom he answered, Go ye to Joseph, and do ye whatever thing he saith to you."},{"num":56,"verse":"Forsooth hunger increased each day in all the land, and Joseph opened all the barns, and sold corn to the Egyptians, for also hunger oppressed them; (And the famine increased each day in all the land, and Joseph opened all the barns, and sold corn, or grain, to the Egyptians, for now the famine oppressed them too;)"},{"num":57,"verse":"and all [the] provinces came into Egypt to buy corns, and to abate the evil of neediness. (and so the whole world came to Egypt to buy corn, or grain, for the famine was so severe.)"}]