[{"num":1,"verse":"The word of Jehovah that came unto Zephaniah the son of Cushi, the son of Gedaliah, the son of Amariah, the son of Hezekiah, in the days of Josiah the son of Amon, king of Judah."},{"num":2,"verse":"I will utterly take away everything from off the face of the ground, saith Jehovah:"},{"num":3,"verse":"I will take away man and beast; I will take away the fowl of the heavens and the fishes of the sea, and the stumbling-blocks with the wicked, and I will cut off mankind from off the face of the ground, saith Jehovah."},{"num":4,"verse":"And I will stretch forth my hand upon Judah, and upon all the inhabitants of Jerusalem; and I will cut off the remnant of Baal from this place, the name of the Chemarim with the priests;"},{"num":5,"verse":"and them that bow down to the host of the heavens upon the housetops; and them that bow down to Jehovah, that swear by [him], and swear by Malcham;"},{"num":6,"verse":"and them that turn back from after Jehovah, and that do not seek Jehovah, nor inquire for him."},{"num":7,"verse":"Be silent at the presence of the Lord Jehovah; for the day of Jehovah is at hand; for Jehovah hath prepared a sacrifice, he hath hallowed his guests."},{"num":8,"verse":"And it shall come to pass in the day of Jehovah's sacrifice, that I will punish the princes, and the king's sons, and all such as are clothed with foreign apparel."},{"num":9,"verse":"And in that day will I punish all those that leap over the threshold, who fill their master's house with violence and deceit."},{"num":10,"verse":"And in that day, saith Jehovah, there shall be the noise of a cry from the fish-gate, and a howling from the second [quarter], and a great crashing from the hills."},{"num":11,"verse":"Howl, ye inhabitants of Maktesh; for all the people of Canaan are cut down, all they that are laden with silver are cut off."},{"num":12,"verse":"And it shall come to pass at that time, [that] I will search Jerusalem with lamps, and punish the men that are settled on their lees, that say in their heart, Jehovah will not do good, neither will he do evil."},{"num":13,"verse":"And their wealth shall become a booty, and their houses a desolation; and they shall build houses, and not inhabit them; and they shall plant vineyards, and not drink the wine thereof."},{"num":14,"verse":"The great day of Jehovah is near, it is near, and hasteth greatly. The voice of the day of Jehovah: the mighty man shall cry there bitterly."},{"num":15,"verse":"That day is a day of wrath, a day of trouble and distress, a day of ruin and desolation, a day of darkness and gloom, a day of clouds and gross darkness,"},{"num":16,"verse":"a day of the trumpet and alarm, against the fenced cities and against the high battlements."},{"num":17,"verse":"And I will bring distress upon men, and they shall walk like blind men; for they have sinned against Jehovah; and their blood shall be poured out as dust, and their flesh as dung:"},{"num":18,"verse":"their silver and their gold shall not be able to deliver them, in the day of Jehovah's wrath; but the whole land shall be devoured by the fire of his jealousy: for a full end, yea, a sudden [end], shall he make of all them that dwell in the land."}]