[{"num":1,"verse":"¶ The word of the LORD which went unto Zephaniah the son of Cushi, the son of Gedaliah, the son of Amariah, the son of Hizkiah, in the days of Josiah the son of Amon, king of Judah."},{"num":2,"verse":"I will utterly destroy all things from off the face of the earth, saith the LORD."},{"num":3,"verse":"I will destroy the men and the beasts; I will destroy the fowls of the heaven and the fishes of the sea, and the wicked shall stumble; and I will cut off men from upon the face of the earth, saith the LORD."},{"num":4,"verse":"And I will extend my hand over Judah and over all the inhabitants of Jerusalem, and I will cut off the remnant of Baal from this place and the name of their religious persons with their priests"},{"num":5,"verse":"and those that worship the host of heaven upon the housetops and those that worship swearing by the LORD and by their king"},{"num":6,"verse":"and those that have turned back from following the LORD and those that did not seek the LORD, nor enquired about him."},{"num":7,"verse":"¶ Be silent before the presence of the Lord GOD: for the day of the LORD is at hand: for the LORD has prepared a sacrifice, he has bid his guests."},{"num":8,"verse":"And it shall come to pass in the day of the LORD’s sacrifice that I will make a visitation upon the princes and upon the king’s sons and upon all such as are clothed with strange apparel."},{"num":9,"verse":"In the same day I will also make a visitation upon all those that leap over the door, who fill their masters’ houses with robbery and deceit."},{"num":10,"verse":"And it shall come to pass in that day, saith the LORD that there shall be the noise of a cry from the fish gate and a howling from the school and a great destruction from the hills."},{"num":11,"verse":"Howl, ye inhabitants of Maktesh, for all the merchant people are cut down; all those that brought ye silver are cut off."},{"num":12,"verse":"And it shall come to pass at that time, that I will search Jerusalem with lamps and make a visitation upon the men that are settled on their lees, that say in their heart, The LORD will not do good, neither will he do evil."},{"num":13,"verse":"Therefore their goods shall become a spoil, and their houses a desolation: they shall build houses, but not inhabit them; and they shall plant vineyards, but not drink the wine thereof."},{"num":14,"verse":"¶ The great day of the LORD is near, it is near, and hastens greatly, the bitter voice of the day of the LORD; the mighty man shall cry there."},{"num":15,"verse":"That day is a day of wrath, a day of trouble and distress, a day of wasteness and desolation, a day of darkness and gloominess, a day of clouds and thick darkness,"},{"num":16,"verse":"A day of the shofar and alarm upon the strong cities, and upon the high towers."},{"num":17,"verse":"And I will bring distress upon men that they shall walk like blind men because they have sinned against the LORD, and their blood shall be poured out as dust and their flesh as the dung."},{"num":18,"verse":"Neither their silver nor their gold shall be able to deliver them in the day of the LORD’s wrath, but the whole earth shall be devoured by the fire of his jealousy; for he shall make even a speedy riddance of all those that dwell in the earth."}]