[{"num":2,"verse":"“Say to your brothers, ‘My people,’ and to your sisters, ‘My loved one.’"},{"header":"God’s People Who Are Not Faithful"},{"num":2,"verse":"“Speak with strong words to your mother. Speak with strong words, for she is not My wife and I am not her husband. Tell her to stop selling the use of her body and giving herself to other men. "},{"num":3,"verse":"If she does not, I will put her to shame by taking off her clothes and show her as when she was born. I will make her like a desert, like a hot and dry land, and will kill her with thirst. "},{"num":4,"verse":"I will have no loving-pity on her children, for they are children of her sinful ways. "},{"num":5,"verse":"Their mother has not been faithful. She who gave birth to them has acted in shame. For she said, ‘I will go after my lovers. They give me my bread and water, my wool and linen, my oil and my drink.’ "},{"num":6,"verse":"So I will put thorn bushes in her way. I will build a wall so that she cannot find her way. "},{"num":7,"verse":"She will go after her lovers but will not catch up with them. She will look for them but will not find them. Then she will say, ‘I will return to my first husband. For it was better for me then than now.’"},{"num":8,"verse":"“She does not know that it was I Who gave her the grain, the new wine, the oil, and all the silver and gold, which they used for the false god Baal. "},{"num":9,"verse":"So I will take back My grain during the gathering time, and My new wine during its time. And I will take away My wool and My linen, which were given to cover her. "},{"num":10,"verse":"So I will take away the covering of her shame in the eyes of her lovers. And no one will take her out of My hand. "},{"num":11,"verse":"I will put an end to all her fun, her special suppers, her new moons, her Days of Rest, and all her special times for gathering together. "},{"num":12,"verse":"I will destroy her vines and fig trees, which she said were her pay from her lovers. I will make many trees grow wild among them, and the animals of the field will eat them. "},{"num":13,"verse":"I will punish her for the days she gave gifts in worship to the false gods of Baal. I will punish her for the times she forgot Me, and put on rings and other beautiful objects and went after her lovers” says the Lord."},{"header":"God’s Loving-Kindness for His People"},{"num":14,"verse":"“So I will lead her into the desert and speak words of comfort to her. "},{"num":15,"verse":"I will give her grape-fields there, and make the Valley of Achor a door of hope. And she will sing there as she did when she was young, as in the day she came out of the land of Egypt. "},{"num":16,"verse":"In that day” says the Lord, “you will call Me, ‘My Husband.’ And you will no longer call Me, ‘My Baal.’ "},{"num":17,"verse":"For I will take the names of the Baals from her mouth. The names of these false gods will never be spoken again. "},{"num":18,"verse":"In that day I will make an agreement for them with the wild animals of the field, the birds of the sky, and the things which move upon the ground. I will put an end to the bow, the sword, and war in all the land. And I will let My people lie down in peace and be safe. "},{"num":19,"verse":"I will promise to make you Mine forever. Yes, I will take you as My bride in what is right and good and fair, and in loving-kindness and in loving-pity. "},{"num":20,"verse":"I will keep My promise and make you Mine. Then you will know the Lord."},{"num":21,"verse":"“In that day” says the Lord, “I will give an answer to the heavens, and they will give an answer to the earth. "},{"num":22,"verse":"The earth will give an answer to the grain, the new wine, and the oil. And they will give an answer to Jezreel. "},{"num":23,"verse":"I will plant her for Myself in the land. Those who were not loved, I will call, ‘My loved ones.’ Those who were not My people, I will call, ‘My people.’ And they will say, ‘You are my God!’”"}]