[{"num":10,"verse":"1 He proveth that the sacrifices of the Law were imperfect, 2 because they were yearly renewed. 5 But that the sacrifice of Christ is one, and perpetual, 6 he proveth by David’s testimony: 19 Then he addeth an exhortation, 29 and severely threateneth them that reject the grace of Christ. 36 In the end he praiseth patience, 38 that cometh of faith."},{"num":1,"verse":"For the law having the shadow of good things to come, and not the very image of the things, can never with those sacrifices, which they offer year by year continually, sanctify the comers thereunto."},{"num":2,"verse":"For would they not then have ceased to have been offered, because that the offerers once purged, should have had no more conscience of sins?"},{"num":3,"verse":"But in those sacrifices there is a remembrance again of sins every year."},{"num":4,"verse":"For it is impossible that the blood of bulls and goats should take away sins."},{"num":5,"verse":"Wherefore when he cometh into the world, he saith, Sacrifice and offering thou wouldest not: but a body hast thou ordained me."},{"num":6,"verse":"In burnt offerings, and sin offerings thou hast had no pleasure."},{"num":7,"verse":"Then I said, Lo, I come (in the beginning of the book it is written of me) that I should do thy will, O God."},{"num":8,"verse":"Above, when he said, Sacrifice and offering, and burnt offerings, and sin offerings, thou wouldest not have, neither hadst pleasure therein (which are offered by the Law.)"},{"num":9,"verse":"Then said he, Lo, I come to do thy will, O God, he taketh away the first, that he may stablish the second."},{"num":10,"verse":"By the which will we are sanctified, even by the offering of the body of Jesus Christ once made."},{"num":11,"verse":"And every Priest standeth daily ministering, and ofttimes offereth one manner of offering, which can never take away sins:"},{"num":12,"verse":"But this man after he had offered one sacrifice for sins, sitteth forever at the right hand of God,"},{"num":13,"verse":"And from henceforth tarrieth, till his enemies be made his footstool."},{"num":14,"verse":"For with one offering hath he consecrated forever them that are sanctified."},{"num":15,"verse":"For the holy Ghost also beareth us record: for after that he had said before,"},{"num":16,"verse":"This is the Testament that I will make unto them after those days, saith the Lord, I will put my Laws in their heart, and in their minds I will write them."},{"num":17,"verse":"And their sins and iniquities will I remember no more."},{"num":18,"verse":"Now where remission of these things is, there is no more offering for sin."},{"num":19,"verse":"Seeing therefore, brethren, that by the blood of Jesus we may be bold to enter into the Holy place,"},{"num":20,"verse":"By the new and living way, which he hath prepared for us, through the veil, that is, his flesh:"},{"num":21,"verse":"And seeing we have an high Priest, which is over the house of God,"},{"num":22,"verse":"Let us draw near with a true heart in assurance of faith, our hearts being pure from an evil conscience,"},{"num":23,"verse":"And washed in our bodies with pure water, let us keep the profession of our hope, without wavering, (for he is faithful that promised.)"},{"num":24,"verse":"And let us consider one another, to provoke unto love, and to good works,"},{"num":25,"verse":"Not forsaking the fellowship that we have among ourselves, as the manner of some is: but let us exhort one another, and that so much the more, because ye see that the day draweth near."},{"num":26,"verse":"For if we sin willingly after that we have received and acknowledged that truth, there remaineth no more sacrifice for sins,"},{"num":27,"verse":"But a fearful looking for of judgment, and violent fire, which shall devour the adversaries."},{"num":28,"verse":"He that despiseth Moses’ Law, dieth without mercy under two, or three witnesses:"},{"num":29,"verse":"Of how much sorer punishment suppose ye shall he be worthy, which treadeth under foot the Son of God, and counteth the blood of the Testament as an unholy thing, wherewith he was sanctified, and doeth despite the Spirit of grace?"},{"num":30,"verse":"For we know him that hath said, Vengeance belongeth unto me: I will recompense, saith the Lord. And again, The Lord shall judge his people."},{"num":31,"verse":"It is a fearful thing to fall into the hands of the living God."},{"num":32,"verse":"Now call to remembrance the days that are passed, in the which, after ye had received light ye endured a great fight in afflictions,"},{"num":33,"verse":"Partly while ye were made a gazing stock both by reproaches and afflictions, and partly while ye became companions of them which were so tossed to and fro."},{"num":34,"verse":"For both ye sorrowed with me for my bonds, and suffered with joy the spoiling of your goods, knowing in yourselves how that ye have in heaven a better, and an enduring substance."},{"num":35,"verse":"Cast not away therefore your confidence which hath great recompense of reward."},{"num":36,"verse":"For ye have need of patience, that after ye have done the will of God, ye might receive the promise."},{"num":37,"verse":"For yet a very little while, and he that shall come, will come, and will not tarry."},{"num":38,"verse":"Now the just shall live by faith: but if any withdraw himself, my soul shall have no pleasure in him."},{"num":39,"verse":"But we are not they which withdraw ourselves unto perdition, but follow faith unto the conservation of the soul."}]