[{"num":44,"verse":"And now, Jacob, my servant, hear thou, and Israel, whom I chose. (And now, my servant Jacob, listen thou, yea, Israel, whom I chose.)"},{"num":2,"verse":"The Lord making and forgiving thee, thine helper from the womb, saith these things, My servant, Jacob, do not thou dread, and thou most rightful, whom I chose. (The Lord who made thee and formed thee, thy helper from the womb, saith these things, My servant Jacob, do not thou fear, and thou Jeshurun, whom I chose.)"},{"num":3,"verse":"For I shall shed out waters on the thirsty, and floods on the dry land; I shall shed out my spirit on thy seed, and my blessing on thy generation. (For I shall pour out water upon the thirsty land, and floods upon the dry ground; I shall pour out my Spirit upon thy children, and my blessing upon thy descendants.)"},{"num":4,"verse":"And they shall burgeon among herbs, as sallows beside running waters. (And they shall flourish among the herbs, like the willows beside the running water.)"},{"num":5,"verse":"This man shall say, I am of the Lord, and he shall call in the name of Jacob; and this man shall write with his hand to the Lord, and shall be likened in the name of Israel. (This person shall say, I am of the Lord, and he shall call himself by Jacob’s name; and another person shall write the Lord’s name on his hand, and shall add the name of Israel to his own.)"},{"num":6,"verse":"The Lord, King of Israel, and again-buyer thereof, the Lord of hosts saith these things, I am the first, and I am the last, and without me is no God. (The Lord, the King of Israel, and its Redeemer, the Lord of hosts saith these things, I am the first, and I am the last, and there is no God besides me.)"},{"num":7,"verse":"Who is like me? call he, and tell, and declare (the) order (of things) to me, since I made [the] eld people (since I made the people of old, or long ago); tell he (out) to them (the) things to coming, and that (that) shall be."},{"num":8,"verse":"Do not ye dread, neither be ye troubled; from that time I made thee for to hear (it), and I told (thee); ye be my witnesses. Whether a God is without me, and a former, whom I knew not? (Do not ye fear, nor be ye troubled; from that time I have made thee to hear it, and I have told thee; ye be my witnesses. Is there any God besides me, or any Creator, or any Maker, whom I knew not?)"},{"num":9,"verse":"All the formers of an idol be nothing, and the most loved things of them shall not profit (anything); they be witnesses of them, that they see not, neither understand, that they be shamed (and so let them be ashamed)."},{"num":10,"verse":"Who formed a god, and melted out an image, not profitable to anything? (Who formed a god, and melted out an idol, not profitable for anything?)"},{"num":11,"verse":"Lo! all the partners thereof shall be shamed; for the smiths be of men (for these smiths be but men). When (they) all shall come, they shall stand, and shall dread, and shall be shamed together."},{"num":12,"verse":"A smith wrought with a file; he formed it in coals, and in hammers (and with hammers), and he wrought with the arm of his strength. He shall be hungry, and he shall fail; he shall not drink water, and he shall be faint."},{"num":13,"verse":"A carpenter stretched forth a rule, he formed it with an adze/with an awl, either a joiner’s hook; he made it in the corner places, and he turned it in compass (he made the corners, and he turned it all around); and he made the image of a man, as a fair man, dwelling in the house."},{"num":14,"verse":"He cutted down cedars, he took an hawthorn, and an oak, that stood among the trees of the forest; he planted a pineapple tree [he planted the pine tree], which he nourished with rain,"},{"num":15,"verse":"and it was made into fire to men. He took of those, and was warmed, and he burnt (it), and baked loaves; but of the residue he wrought a god, and worshipped it, and he made a graven image, and he was bowed before that. (and it was made into fire for people. He took some of it, and was warmed, and he burned it, and baked loaves; but with the rest of it he made a god, and then worshipped it, and he made a carved idol, and then he was bowed down before that.)"},{"num":16,"verse":"He burnt the half thereof with fire, and of the half thereof he seethed fleshes, and ate; he seethed pottage, and was (ful)filled (He burned half of it in the fire, and so with half of it he boiled meat, and ate; yea, he boiled up some stew, and was fulfilled); and he was warmed, and he said, Well! I am warmed; I saw [the] fire."},{"num":17,"verse":"Forsooth the residue thereof he made a god, and a graven image to himself; he is bowed before that, and worshippeth that, and beseecheth, and saith, Deliver thou me, for thou art my god. (But with the rest of it he made a god, yea, a carved idol for himself; and he is bowed down before that, and worshippeth that, and beseecheth, and saith, Save thou me, for thou art my god.)"},{"num":18,"verse":"They knew not, neither understood, for they have forgotten, that their eyes see not, and that they understand not with their heart."},{"num":19,"verse":"They bethink not in their soul, neither they know, neither they feel, that they say, I burnt the half thereof in fire, and I baked loaves on the coals thereof, and I seethed fleshes, and ate; and of the residue thereof shall I make an idol? shall I fall down before the stock of a tree? (They do not think in their soul, nor do they know, nor do they feel, so that they might say, I burned half of it in the fire, and then I baked some loaves on the coals there, and I boiled some meat, and ate; and with the rest of it shall I make an idol? and then shall I fall down before a piece of a tree?/before a piece of wood?)"},{"num":20,"verse":"A part thereof is ashes; an unwise heart shall worship it, and he shall not deliver his soul, neither he shall say, A strong leasing is in my right hand. (A part of it is ashes; and an unwise heart shall worship it, but it shall not save his soul, nor shall he say, Only a big lie, or a great falsehood, is in my right hand.)"},{"num":21,"verse":"Thou, Jacob, and Israel, have mind of these things (Thou, Jacob, O Israel, remember these things), for thou art my servant; I formed thee, Israel, thou art my servant; thou shalt not forget me."},{"num":22,"verse":"I did away thy wickednesses as a cloud, and thy sins as a mist; turn thou again to me, for I again-bought thee. (I did away thy wickednesses like a cloud, and thy sins like a mist; return thou to me, for I have bought thee back, that is, I have ransomed, or I have redeemed, thee.)"},{"num":23,"verse":"Ye heavens, praise, for the Lord hath done mercy; the last parts of [the] earth, sing ye heartily song (the ends of the earth, heartily sing ye songs); hills, sound ye praising; the forest, and each tree thereof, praise God; for the Lord again-bought Jacob, and Israel shall have glory."},{"num":24,"verse":"The Lord, thine again-buyer, and thy former from the womb (and thy Maker from the womb), saith these things, I am the Lord, making all things, and I alone stretch forth (the) heavens, and stablish the earth, and none is with me;"},{"num":25,"verse":"and I make void the signs of false diviners, and I turn into madness diviners that divine by sacrifices offered to fiends; and I turn wise men backward, and I make their science fond."},{"num":26,"verse":"And the Lord raiseth the word of his servant, and [ful]filleth the counsel of his messengers; and I say to Jerusalem, Thou shalt be inhabited; and to the cities of Judah, Ye shall be builded (again), and I shall raise (up) the deserts thereof;"},{"num":27,"verse":"and I say to the depth, Be thou desolate, and I shall make dry thy floods; (and I say to the ocean depth, Be thou made dry, and I shall make thy rivers run dry/and I shall also dry up thy rivers;)"},{"num":28,"verse":"and I say to Cyrus, Thou art my shepherd, and thou shalt fill all my will; and I say to Jerusalem, Thou shalt be builded (again); and to the temple, Thou shalt be founded. (and I say to Cyrus, Thou art my shepherd, and thou shalt fulfill, or thou shalt do, all my will; and I say to Jerusalem, Thou shalt be rebuilt; and to the Temple, Thy foundations shall be laid again.)"}]