[{"header":"Psalm 106"},{"num":1,"verse":"Praise the Lord! (Hallelujah!) O give thanks to the Lord, for He is good; for His mercy and loving-kindness endure forever!"},{"num":2,"verse":"Who can put into words and tell the mighty deeds of the Lord? Or who can show forth all the praise [that is due Him]?"},{"num":3,"verse":"Blessed (happy, fortunate, to be envied) are those who observe justice [treating others fairly] and who do right and are in right standing with God at all times."},{"num":4,"verse":"[Earnestly] remember me, O Lord, when You favor Your people! O visit me also when You deliver them, and grant me Your salvation!—"},{"num":5,"verse":"That I may see and share the welfare of Your chosen ones, that I may rejoice in the gladness of Your nation, that I may glory with Your heritage."},{"num":6,"verse":"We have sinned, as did also our fathers; we have committed iniquity, we have done wickedly."},{"num":7,"verse":"Our fathers in Egypt understood not nor appreciated Your miracles; they did not [earnestly] remember the multitude of Your mercies nor imprint Your loving-kindness [on their hearts], but they were rebellious and provoked the Lord at the sea, even at the Red Sea."},{"num":8,"verse":"Nevertheless He saved them for His name’s sake [to prove the righteousness of the divine character], that He might make His mighty power known."},{"num":9,"verse":"He rebuked the Red Sea also, and it dried up; so He led them through the depths as through a pastureland."},{"num":10,"verse":"And He saved them from the hand of him that hated them, and redeemed them from the hand of the [Egyptian] enemy."},{"num":11,"verse":"And the waters covered their adversaries; not one of them was left."},{"num":12,"verse":"Then [Israel] believed His words [trusting in, relying on them]; they sang His praise."},{"num":13,"verse":"But they hastily forgot His works; they did not [earnestly] wait for His plans [to develop] regarding them,"},{"num":14,"verse":"But lusted exceedingly in the wilderness and tempted and tried to restrain God [with their insistent desires] in the desert."},{"num":15,"verse":"And He gave them their request, but sent leanness into their souls and [thinned their numbers by] disease and death."},{"num":16,"verse":"They envied Moses also in the camp, and Aaron [the high priest], the holy one of the Lord."},{"num":17,"verse":"Therefore the earth opened and swallowed up Dathan and closed over the company of Abiram."},{"num":18,"verse":"And a fire broke out in their company; the flame burned up the wicked."},{"num":19,"verse":"They made a calf in Horeb and worshiped a molten image."},{"num":20,"verse":"Thus they exchanged Him Who was their Glory for the image of an ox that eats grass [they traded their Honor for the image of a calf]!"},{"num":21,"verse":"They forgot God their Savior, Who had done such great things in Egypt,"},{"num":22,"verse":"Wonders and miracles in the land of Ham, dreadful and awesome things at the Red Sea."},{"num":23,"verse":"Therefore He said He would destroy them. [And He would have done so] had not Moses, His chosen one, stepped into the breach before Him to turn away His threatening wrath."},{"num":24,"verse":"Then they spurned and despised the pleasant and desirable land [Canaan]; they believed not His word [neither trusting in, relying on, nor holding to it];"},{"num":25,"verse":"But they murmured in their tents and hearkened not to the voice of the Lord."},{"num":26,"verse":"Therefore He lifted up His hand [as if taking an oath] against them, that He would cause them to fall in the wilderness,"},{"num":27,"verse":"Cast out their descendants among the nations, and scatter them in the lands [of the earth]."},{"num":28,"verse":"They joined themselves also to the [idol] Baal of Peor and ate sacrifices [offered] to the lifeless [gods]."},{"num":29,"verse":"Thus they provoked the Lord to anger with their practices, and a plague broke out among them."},{"num":30,"verse":"Then stood up Phinehas [the priest] and executed judgment, and so the plague was stayed."},{"num":31,"verse":"And that was credited to him for righteousness (right doing and right standing with God) to all generations forever."},{"num":32,"verse":"They angered the Lord also at the waters of Meribah, so that it went ill with Moses for their sakes;"},{"num":33,"verse":"For they provoked [Moses’] spirit, so that he spoke unadvisedly with his lips."},{"num":34,"verse":"They did not destroy the [heathen] nations as the Lord commanded them,"},{"num":35,"verse":"But mingled themselves with the [idolatrous] nations and learned their ways and works"},{"num":36,"verse":"And served their idols, which were a snare to them."},{"num":37,"verse":"Yes, they sacrificed their sons and their daughters to demons"},{"num":38,"verse":"And shed innocent blood, even the blood of their sons and of their daughters, whom they sacrificed to the idols of Canaan; and the land was polluted with their blood."},{"num":39,"verse":"Thus were they defiled by their own works, and they played the harlot and practiced idolatry with their own deeds [of idolatrous rites]."},{"num":40,"verse":"Therefore was the wrath of the Lord kindled against His people, insomuch that He abhorred and rejected His own heritage."},{"num":41,"verse":"And He gave them into the hands of the [heathen] nations, and they that hated them ruled over them."},{"num":42,"verse":"Their enemies also oppressed them, and they were brought into subjection under the hand of their foes."},{"num":43,"verse":"Many times did [God] deliver them, but they were rebellious in their counsel and sank low through their iniquity."},{"num":44,"verse":"Nevertheless He regarded their distress when He heard their cry;"},{"num":45,"verse":"And He [earnestly] remembered for their sake His covenant and relented their sentence of evil [comforting and easing Himself] according to the abundance of His mercy and loving-kindness [when they cried out to Him]."},{"num":46,"verse":"He also caused [Israel] to find sympathy among those who had carried them away captive."},{"num":47,"verse":"Deliver us, O Lord our God, and gather us from among the nations, that we may give thanks to Your holy name and glory in praising You."},{"num":48,"verse":"Blessed (affectionately and gratefully praised) be the Lord, the God of Israel, from everlasting to everlasting! And let all the people say, Amen! Praise the Lord! (Hallelujah!)"}]