[{"header":"The Lord Is Good to His People"},{"num":106,"verse":"Praise the Lord! O give thanks to the Lord for He is good. His loving-kindness lasts forever. "},{"num":2,"verse":"Who can put into words the great works of the Lord? Who can make known all His praise? "},{"num":3,"verse":"Happy are those who are faithful in being fair and who always do what is right and good!"},{"num":4,"verse":"O Lord, remember me when You show favor to Your people. Visit me also when You save them. "},{"num":5,"verse":"So I may share in the well-being of Your chosen ones. So I may share in the joy of Your nation, and be proud of Your people."},{"num":6,"verse":"We have sinned like our fathers. We have done wrong. We have been sinful in our actions. "},{"num":7,"verse":"Our fathers in Egypt did not understand Your powerful works. They did not remember how many times You showed Your loving-kindness. But they turned against You by the sea, the Red Sea. "},{"num":8,"verse":"Yet He saved them because of the honor of His name, and to make His great power known. "},{"num":9,"verse":"So He spoke sharp words to the Red Sea and it dried up. And He led them through the sea as through a desert. "},{"num":10,"verse":"He saved them from the hand of those who hated them. He set them free from the hand of those who went against them. "},{"num":11,"verse":"And the waters covered those who hated them. Not one of them was left. "},{"num":12,"verse":"Then they believed His promises. They sang His praise."},{"num":13,"verse":"But they soon forgot His works. They did not wait to hear what He wanted them to do. "},{"num":14,"verse":"They wanted many things in the desert, and they tempted God there. "},{"num":15,"verse":"So He gave them what they wanted, but He allowed their souls to become weak because of it."},{"num":16,"verse":"They were jealous of Moses in the place where they set up their tents. And they were jealous of Aaron, the holy one of the Lord. "},{"num":17,"verse":"So the earth opened up and swallowed Dathan. It closed over the group of Abiram. "},{"num":18,"verse":"And a fire came among their followers. It burned up the sinful people."},{"num":19,"verse":"They made a calf at Horeb and worshiped a god of gold. "},{"num":20,"verse":"They traded their shining-greatness for something that looked like a bull that eats grass. "},{"num":21,"verse":"They forgot the God Who saved them, Who had done great things in Egypt, "},{"num":22,"verse":"powerful works in the land of Ham, and works that brought fear by the Red Sea. "},{"num":23,"verse":"So He said that He would destroy them. But Moses, His chosen one, stood in the way to keep His anger from destroying them. "},{"num":24,"verse":"Then they hated the good land. They did not believe in His Word. "},{"num":25,"verse":"But they complained in their tents. They did not listen to the voice of the Lord. "},{"num":26,"verse":"So He swore to them that He would let them die in the desert. "},{"num":27,"verse":"And He would spread out their children among the nations and divide them over all the earth."},{"num":28,"verse":"They joined themselves to Baal of Peor and ate gifts given to the dead. "},{"num":29,"verse":"They made the Lord angry by their actions and a sickness broke out among them. "},{"num":30,"verse":"Then Phinehas stood up and came between them, and the sickness was stopped. "},{"num":31,"verse":"And this made him right with God to all people forever."},{"num":32,"verse":"They also made the Lord angry at the waters of Meribah. And trouble came to Moses because of them. "},{"num":33,"verse":"He spoke from his lips without thinking because they went against the Spirit of God."},{"num":34,"verse":"They did not destroy the people as the Lord told them to do. "},{"num":35,"verse":"But they mixed with the nations and learned their ways. "},{"num":36,"verse":"They served their gods, which became a trap to them. "},{"num":37,"verse":"They even gave their sons and daughters as gifts on an altar to the demons. "},{"num":38,"verse":"They poured out the blood of those who were not guilty, the blood of their sons and daughters, whom they gave on an altar to the gods of Canaan. And the land was poisoned with blood. "},{"num":39,"verse":"They made themselves unclean by what they did. They were not true to God in what they did."},{"num":40,"verse":"So the Lord was angry with His people. He hated His people. "},{"num":41,"verse":"So He handed them over to the nations. And those who hated them ruled over them. "},{"num":42,"verse":"Those who hated them held a strong power over them. And they were made to obey them. "},{"num":43,"verse":"God set them free many times. But they always turned against Him and went deeper into sin."},{"num":44,"verse":"But He looked upon their trouble when He heard their cry. "},{"num":45,"verse":"He remembered His agreement because of them, and took pity on them by the greatness of His loving-kindness. "},{"num":46,"verse":"Those who held them also saw how God took pity on them."},{"num":47,"verse":"O Lord our God, save us! Gather us from among the nations. And we will give thanks to Your holy name and find honor in Your praise. "},{"num":48,"verse":"Honor and thanks be to the Lord, the God of Israel, forever and ever. Let all the people say, “Let it be so!” Praise the Lord!"}]