[{"num":106,"verse":"Praise Hashem! O give thanks unto Hashem; for He is tov; for His chesed endureth l’olam."},{"num":2,"verse":"Who can speak of the gevurot (mighty acts) of Hashem? Who can show forth all His tehillah (praise)?"},{"num":3,"verse":"Ashrei (happy, blessed) are they who are shomrei mishpat, and he that doeth tzedakah at all times."},{"num":4,"verse":"Remember me, Hashem, with the favor that Thou bearest unto Thy people; O visit me with Thy Yeshuah (salvation);"},{"num":5,"verse":"That I may see the good of Bechireicha (Thy chosen ones), that I may rejoice in the simchah of Thy nation, that I may glory with Thine nachalah (the people of Thy inheritance)."},{"num":6,"verse":"We have sinned with Avoteinu, we have committed iniquity, we have done wickedly."},{"num":7,"verse":"Avoteinu had no seichal concerning Thy nifla’ot (wonders) in Mitzrayim; they remembered not the multitude of Thy mercies but provoked Him at the yam, even at the Yam Suf."},{"num":8,"verse":"Nevertheless He saved them for the sake of Shmo, that He might make His gevu’rot (mighty power) to be known."},{"num":9,"verse":"He rebuked the Yam Suf also, and it dried up; so He led them through the tehomot, as through the midbar."},{"num":10,"verse":"And He saved them from the yad of him that hated them, and He acted to make the go’el redemption from the yad of the oyev (enemy)."},{"num":11,"verse":"And the mayim covered their enemies; there was not echad (one) of them left surviving."},{"num":12,"verse":"Then believed they in His Devarim; they sang His tehillah."},{"num":13,"verse":"Then they hurried, they forgot His ma’asim; they waited not for His etzah (counsel, advice, wisdom);"},{"num":14,"verse":"But lusted exceedingly in the midbar, and tempted G-d in the desert."},{"num":15,"verse":"And He gave them their she’elah (request); but sent leanness into their nefesh."},{"num":16,"verse":"They envied Moshe also in the machaneh, and Aharon the kadosh Hashem (Aaron the holy one of Hashem)."},{"num":17,"verse":"Eretz opened and swallowed up Datan and covered over the Adat Aviram (the company of Aviram)."},{"num":18,"verse":"And an eish was kindled in their edah (assembly); the flame burned up the resha’im."},{"num":19,"verse":"They made an egel (a calf) in Chorev, and worshiped a massekhah (molden image)."},{"num":20,"verse":"Thus they exchanged their kavod for a tavnit shor (likeness of an ox) that eateth esev (grass)."},{"num":21,"verse":"They forgot G-d their Moshi’a, Who had done gedolot in Mitzrayim;"},{"num":22,"verse":"Nifla’ot (wondrous works) in Eretz Cham, and nora’ot (awesome things) by the Yam Suf."},{"num":23,"verse":"Therefore He said that He would destroy them, had not Moshe His bechir (chosen one) stood before Him in the peretz (breach), to turn away His wrath, lest He should destroy them."},{"num":24,"verse":"Then they despised the eretz chemdah (desirable land); they believed not His Devar;"},{"num":25,"verse":"But murmured in their ohalim, and paid heed not unto the kol (voice) of Hashem."},{"num":26,"verse":"Therefore [in oath] He lifted up His yad against them, that He would overthrow them in the midbar;"},{"num":27,"verse":"To make their zera fall also among the Goyim, and to scatter them among the aratzot (lands)."},{"num":28,"verse":"They joined themselves also unto Ba’al-Pe’or, and ate the zivkhei mesim (sacrifices offered to the dead)."},{"num":29,"verse":"Thus they provoked Him to anger with their inventions; and the magefah (plague) broke out among them."},{"num":30,"verse":"Then stood up Pinchas, and interposed; and so the magefah (plague) was halted."},{"num":31,"verse":"And that was counted unto him for tzedakah l’dor vador ad olam."},{"num":32,"verse":"They angered Him also at the waters of Merivah, so that it went ill with Moshe on their account;"},{"num":33,"verse":"Because they provoked His Ruach [Hakodesh] and he [Moshe] spoke unadvisedly with his sfatayim (lips)."},{"num":34,"verse":"They did not destroy the amim (peoples), as Hashem commanded them;"},{"num":35,"verse":"But they mingled with the Goyim, and learned their ma’asim (works, customs)."},{"num":36,"verse":"And they served their atzabim (idols); which were a mokesh (snare) unto them."},{"num":37,"verse":"And, they sacrificed their banim and their banot unto shedim (demons),"},{"num":38,"verse":"And they shed dahm naki (innocent blood), even the dahm of their banim and of their banot, whom they sacrificed unto the atzabei Kena’an (idols of Canaan); and HaAretz was polluted with blood-guilt."},{"num":39,"verse":"Thus they made themselves tameh with their own ma’asim, and went awhoring with their own inventions."},{"num":40,"verse":"Therefore was the wrath of Hashem kindled against His people, insomuch that He abhorred His own nachalah."},{"num":41,"verse":"And He gave them into the yad Goyim; and they that hated them ruled over them."},{"num":42,"verse":"Their oyevim also oppressed them, and they were brought into subjection under their yad."},{"num":43,"verse":"Many times did He deliver them; but they provoked Him with their etzah (counsel), and so perished in their avon (iniquity)."},{"num":44,"verse":"Nevertheless He regarded their affliction, when He heard their rinnah (cry of grief);"},{"num":45,"verse":"And He remembered for their sake His Brit, and relented according to the multitude of His chasadim (lovingkindnesses)."},{"num":46,"verse":"He made them also to be pitied with rachamim by all those that carried them away as captives."},{"num":47,"verse":"Hoshieini (save us), Hashem Eloheinu, and gather us from among the Goyim, to give thanks unto Thy Shem Kadosh, and to glory in Thy tehillah (praise)."},{"num":48,"verse":"Baruch Hashem Elohei Yisroel min haOlam v’ad haOlam; and let kol HaAm say, Omein. Praise Hashem!"}]