[{"num":106,"verse":"Alleluia. Acknowledge ye to the Lord, for he is good; for his mercy is [into] without end. (Alleluia. Give ye thanks to the Lord, for he is good; for his love is forever.)"},{"num":2,"verse":"Who shall speak (of) the powers of the Lord; shall make known all his praisings? (Who shall speak of the Lord’s powers? who shall make known all his praises?/who shall make known all the praises that he is due?)"},{"num":3,"verse":"Blessed be they that keep doom; and do rightfulness in all time. (Happy be they who obey his commands, or his judgements; and who always do what is right.)"},{"num":4,"verse":"Lord, have thou mind on us, in the good pleasance of thy people; visit thou us in thine health. (Lord, remember me when thou helpest thy people; include me in their salvation, or in their deliverance.)"},{"num":5,"verse":"To see in the goodness of thy chosen men, to be glad in the gladness of thy folk; that thou be praised with thine heritage. (So that I may see the goodness of thy chosen people, and that I be glad, or rejoice, in the gladness of thy nation; and so that I may have glory with thy inheritance.)"},{"num":6,"verse":"We have sinned with our fathers; we have done unjustly, we have done wickedness. (We have all sinned like our forefathers; we have all done unjustly, we have all done wickedness.)"},{"num":7,"verse":"Our fathers in Egypt understood not thy marvels; they were not mindful of the multitude of thy mercy. And they going into the sea, into the Red Sea, stirred (him) to wrath; (Our forefathers in Egypt did not understand thy marvellous deeds; they did not remember thy many loving deeds. And they stirred thee to anger at the sea, yea, at the Red Sea/And they rebelled against thee at the sea, yea, at the Sea of Reeds;)"},{"num":8,"verse":"and he saved them for his name, that he should make known his power. (but still he saved them for the sake of his name, so that he could make known his power.)"},{"num":9,"verse":"And he parted the Red Sea, and it was dried; and he led forth them in the depths of waters, as in desert. (And he parted the Red Sea, or the Sea of Reeds, and it dried up; and he led them forth through the depths of the waters, as though through the wilderness.)"},{"num":10,"verse":"And he saved them from the hand of haters; and he again-bought them from the hand of the enemy (and he redeemed them from the power of the enemy)."},{"num":11,"verse":"And the waters covered men troubling them; one of them abode not. (And then the waters covered the men who troubled them; yea, not one of them was left alive.)"},{"num":12,"verse":"And they believed to his words; and they praised the praising of him. (And they believed in his promises; and they sang his praises.)"},{"num":13,"verse":"They had soon done, (that) they forgat his works; and they abided not his counsel. (But soon they had forgotten all his works; and they did not wait for his counsel.)"},{"num":14,"verse":"And they coveted covetousness in desert (And they were utterly insatiable in the wilderness); and tempted God in a place without water."},{"num":15,"verse":"And he gave to them the asking of them; and he sent fullness into the souls of them. (And so he gave them what they asked for; but he also sent leanness, that is, sickness, into their bodies.)"},{"num":16,"verse":"And they wrathed (against) Moses in the castles; (and against) Aaron, the holy (man) of the Lord. (And they envied Moses in their tents; and also Aaron, the holy man of the Lord.)"},{"num":17,"verse":"The earth was opened, and swallowed [down] Dathan; and covered on the congregation of Abiram. (And the earth opened up, and swallowed Dathan; and it covered up the company, or the family, of Abiram.)"},{"num":18,"verse":"And fire burnt on high in the synagogue of them; flame burnt [the] sinners. (And fire burned on high throughout their company, or their congregation; yea, the flame burned up the sinners.)"},{"num":19,"verse":"And they made a calf in Horeb; and worshipped a molten image. (And then they made a golden calf at Sinai; and so they worshipped a cast image.)"},{"num":20,"verse":"And they changed their glory; into the likeness of a calf eating hay. (And they exchanged the glory of God; for the metal likeness of a calf that eateth grass.)"},{"num":21,"verse":"They forgat God, that saved them, that did great works in Egypt, (They forgot their God, who saved them, and who did great works in Egypt,)"},{"num":22,"verse":"marvels in the land of Ham; fearedful things in the Red Sea. (yea, marvellous deeds in the land of Ham; and fearful things in the Red Sea/in the Sea of Reeds.)"},{"num":23,"verse":"And God said, that he would lose them; (and he would have,) if Moses, his chosen man, had not stood in the breaking of his sight. That he should turn away his ire; lest he lost them. (And God said, that he would destroy them; and he would have, if Moses, his chosen man, had not stood in the gap, or the breach, before him; so that he would turn away his anger, lest it destroy the people.)"},{"num":24,"verse":"And they had the desirable land for nought, (for) they believed not to his word, (And they considered the desirable land as worth nothing, for they did not believe his promise,)"},{"num":25,"verse":"and they grutched in their tabernacles (and they grumbled in their tents); (and) they heard not the voice of the Lord."},{"num":26,"verse":"And he raised his hand on them; to cast down them in desert. (And he raised up his hand against them; to throw them down in the wilderness.)"},{"num":27,"verse":"And to cast away their seed in nations; and to lose them in countries. (And to scatter their descendants among the nations; and so to let them die in foreign, or strange, lands.)"},{"num":28,"verse":"And they made sacrifice to Baalpeor; and they ate the sacrifices of dead beasts. (And then they sacrificed to Baalpeor; and they ate the sacrifices offered to dead, or lifeless, gods.)"},{"num":29,"verse":"And they wrathed God in their findings; and falling, either death, was multiplied in them. (And they angered God with their deeds; and many died from the plague.)"},{"num":30,"verse":"And Phinehas stood, and pleased God; and the vengeance ceased. (But then Phinehas stood up, and pleased God; and the plague ceased.)"},{"num":31,"verse":"And it was areckoned to him to rightfulness; in generation and into generation, till into without end. (And it was counted unto him as righteousness; throughout all generations, forever.)"},{"num":32,"verse":"And they wrathed God at the waters of against-saying; and Moses was travailed for them, that is, troubled in soul, (And then they angered God again, this time at the waters of Meribah; and Moses was travailed for them, that is, his soul was troubled over them/and Moses was in great trouble because of them,)"},{"num":33,"verse":"for they made bitter his spirit, and he parted in his lips. (for they made his spirit so bitter, that he spoke rashly with his lips.)"},{"num":34,"verse":"They lost not [the] heathen men; which the Lord said to them (to do). (And they did not destroy the heathen; which the Lord had commanded them to do.)"},{"num":35,"verse":"And they were meddled among heathen men, and learned the works of them; (Indeed, they were mixed in among the heathen, and learned all their ways;)"},{"num":36,"verse":"and served the graven images of them; and it was made to them into cause of stumbling. (and served their carved idols; and that became their falling, or their trap.)"},{"num":37,"verse":"And they offered their sons, and their daughters, to fiends. (And they sacrificed their sons and their daughters, to demons and to devils.)"},{"num":38,"verse":"And they shedded out innocent blood, the blood of their sons and of their daughters; which they sacrificed to the graven images of Canaan. And the earth was slain in bloods, (And so they shed innocent blood, the blood of their own sons and daughters; whom they sacrificed to the carved idols of Canaan. And the earth was polluted with their children’s blood,)"},{"num":39,"verse":"and was defouled in the works of them; and they did fornication in their findings. (and they were defiled by their works; and they wantonly abandoned God with their deeds.)"},{"num":40,"verse":"And the Lord was wroth by strong vengeance against his people; and he had abomination of his heritage. (And the Lord grew more and more angry in his fury against his people; and he had abomination for his own inheritance.)"},{"num":41,"verse":"And he betook them into the hands of heathen men; and they that hated them, were lords of them. (And he delivered them into the hands of the heathen; and so they who hated them, were their lords.)"},{"num":42,"verse":"And their enemies did tribulation to them, and they were meeked under the hands of enemies; (And their enemies troubled them/oppressed them, and they were humbled at the hands of their enemies;)"},{"num":43,"verse":"oft he delivered them. But they wrathed him in their counsel; and they were made low in their wickednesses. (and often he rescued them. But then they stirred him to anger again with their deeds/But still they chose to rebel against him; and so they were brought down low for their wickednesses.)"},{"num":44,"verse":"And he saw, when they were set in tribulation; and he heard the prayer of them (and he heard their prayers)."},{"num":45,"verse":"And he was mindful of his testament; and it repented him by the multitude of his mercy. (And he remembered his covenant with them; and he relented because of his great love.)"},{"num":46,"verse":"And he gave them into mercies; in the sight of all men, that had taken them. (And he made the people, who had taken them captive, to have compassion for them.)"},{"num":47,"verse":"Our Lord God, make thou us safe; and gather together us from nations. That we acknowledge to thine holy name; and have glory in thy praising. (Lord our God, save thou us; and gather us back from among the nations. So that we may give thanks to thy holy name; and receive glory in thy praising.)"},{"num":48,"verse":"Blessed be the Lord God of Israel from the world and till into the world (Blessed be the Lord God of Israel forever and ever); and all the people shall say, Be it done, be it done."}]