[{"num":11,"verse":"however, I was already standing up to support and help Daryavesh the Mede in the first year of his reign. "},{"num":2,"verse":"What I am going to tell you now is true."},{"num":3,"verse":"“Then a powerful king will appear who will rule a vast kingdom and do whatever he pleases. "},{"num":4,"verse":"But once he appears, his kingdom will be broken up and divided to the four winds of heaven. It won’t be inherited by his descendants, and it won’t be ruled with the power he had, because his kingship will be uprooted and will pass to others than his own posterity."},{"num":5,"verse":"“The king in the south will be strong, and one of his princes will gain power over him and have dominion; his domain will be a great dominion. "},{"num":6,"verse":"After a number of years they will form an alliance. The daughter of the king of the south will approach the king of the north to make an agreement, but she won’t retain her power; and he and his power won’t last either. Rather, she will be surrendered, along with her attendants, her father and the one who supported her during those times. "},{"num":7,"verse":"But another branch from the same roots as hers will appear in her father’s place. He will attack the army of the king of the north, enter his fortress and succeed in conquering them. "},{"num":8,"verse":"He will also carry off as booty to Egypt their gods, their cast metal images and their valuable gold and silver vessels. Then for some years, he will refrain from attacking the king of the north."},{"num":9,"verse":"“Afterwards, the king of the north will invade the kingdom of the king of the south, but he will retire to his own land. "},{"num":10,"verse":"His sons will rouse themselves to muster a large and powerful army, which will advance like a flood passing through. In another campaign, it will march on the enemy stronghold. "},{"num":11,"verse":"The king of the south, enraged, will set out to do battle with the king of the north, who, in turn, will muster a large army; but this army will be defeated by his enemy "},{"num":12,"verse":"and carried off. The conqueror will grow proud as he slaughters tens of thousands, yet he will not prevail. "},{"num":13,"verse":"Rather, the king of the north will again muster an army, larger than the first one, at the end of this period, after a number of years; it will be a large, well-supplied army. "},{"num":14,"verse":"Those will be times in which many will resist the king of the south; and the more violent ones among your own people will rebel in order to fulfill their vision; but they will fail."},{"num":15,"verse":"“Then the king of the north will come, set up siege-works and capture a fortified city; the forces of the south will be insufficient defense, even his elite troops will not be strong enough to resist. "},{"num":16,"verse":"The invader will do as he pleases; no one will be able to withstand him. So he will establish himself in the Land of Glory, and he will have the power to destroy it. "},{"num":17,"verse":"He will determinedly advance with the full force of his kingdom, but he will make an agreement with the king of the south and give him a daughter in marriage. His object will be to destroy him, but the agreement will not last or work out in his favor. "},{"num":18,"verse":"Next, he will put his attention on the coastlands and islands and capture many, but an army commander will put a stop to his outrages and cause his outrages to come back upon him. "},{"num":19,"verse":"After this, he will put his attention on the strongholds in his own land; but he will stumble, fall and not be seen again."},{"num":20,"verse":"“In his place will arise one who will send a tax collector through the Glorious Kingdom; but within a few days, he will be broken, though neither in anger nor in battle."},{"num":21,"verse":"“There will arise in his place a despicable man not entitled to inherit the majesty of the kingdom, but he will come without warning and gain the kingdom by intrigue. "},{"num":22,"verse":"Large armies will be broken and swept away before him, as well as the prince of the covenant. "},{"num":23,"verse":"Alliances will be made with him, but he will undermine them by deceit. Then, although he will have but a small following, he will emerge and become strong. "},{"num":24,"verse":"Without warning, he will assail the most powerful men in each province and do things his predecessors never did, either recently or in the distant past; he will reward them with plunder, spoil and wealth while devising plots against their strongholds, but only for a time."},{"num":25,"verse":"“He will summon his power and courage against the king of the south with a great army, and the king of the south will fight back with a very large and powerful army; but he will not succeed, because of plots devised against him. "},{"num":26,"verse":"Yes, those who shared his food will destroy him; his army will be swept away; and many will fall in the slaughter. "},{"num":27,"verse":"These two kings, bent on mischief, will sit at the same table, speaking lies to each other; but none of this will succeed; because the appointed end will not have come yet. "},{"num":28,"verse":"Then the king of the north will return to his own land with great wealth; with his heart set against the holy covenant, he will take action and then return home."},{"num":29,"verse":"“At the time designated, he will come back to the south. But this time, things will turn out differently than before; "},{"num":30,"verse":"because ships from Kittim will come against him, so that his courage will fail him. Then, in retreat, he will take furious action against the holy covenant, again showing favor to those who abandon the holy covenant. "},{"num":31,"verse":"Armed forces will come at his order and profane the sanctuary and fortress. They will abolish the daily burnt offering and set up the abomination that causes desolation. "},{"num":32,"verse":"Those who act wickedly against the covenant he will corrupt with his blandishments, but the people who know their God will stand firm and prevail. "},{"num":33,"verse":"Those among the people who have discernment will cause the rest of the people to understand what is happening; nevertheless, for a while they will fall victim to sword, fire, exile and pillage. "},{"num":34,"verse":"When they stumble, they will receive a little help, although many who join them will be insincere. "},{"num":35,"verse":"Even some of those with discernment will stumble, so that some of them will be refined, purified and cleansed for an end yet to come at the designated time."},{"num":36,"verse":"“The king will do as he pleases. He will exalt himself and consider himself greater than any god, and he will utter monstrous blasphemies against the God of gods. He will prosper only until the period of wrath is over, for what has been determined must take place. "},{"num":37,"verse":"He will show no respect for the gods his ancestors worshipped, or for the god women worship — he won’t show respect for any god, because he will consider himself greater than all of them. "},{"num":38,"verse":"But instead, he will honor the god of strongholds; with gold, silver, precious stones and other costly things he will honor a god unknown to his ancestors. "},{"num":39,"verse":"He will deal with the strongest fortresses with the help of a foreign god. He will confer honor on those he acknowledges, causing them to rule over many and distributing land as a reward."},{"num":40,"verse":"“When the time for the end comes, the king of the south will push at him; while the king of the north will attack him like a whirlwind, with chariots, cavalry and a large navy. He will invade countries, overrun them and move on. "},{"num":41,"verse":"He will also enter the Land of Glory, and many [countries] will come to grief, but these will be saved from his power — Edom, Mo’av and the people of ‘Amon. "},{"num":42,"verse":"He will reach out his hand to seize other countries too. The land of Egypt will not escape — "},{"num":43,"verse":"he will control the treasures of gold and silver, as well as everything else in Egypt of value. Put and Ethiopia will be subject to him. "},{"num":44,"verse":"However, news from the east and north will frighten him, so that he moves out in great fury to ruin and completely do away with many. "},{"num":45,"verse":"Finally, when he pitches the tents of his palace between the seas and the mountain of the holy Glory, he will come to his end, with no one to help him."}]