[{"num":3,"verse":"¶ Finally, brethren, pray for us, that the word of the Lord may have free course and be glorified, even as it is with you,"},{"num":2,"verse":"And that we may be delivered from perverse and wicked men, for the faith is not of everyone."},{"num":3,"verse":"But the Lord is faithful, who shall confirm you and keep you from evil."},{"num":4,"verse":"And we have confidence in the Lord regarding you, that ye both do and will do the things which we command you."},{"num":5,"verse":"And the Lord make your hearts upright in the charity of God and in the hope of the Christ."},{"num":6,"verse":"¶ Now we charge you, brethren, in the name of our Lord Jesus Christ, that ye withdraw yourselves from every brother that walks out of order, and not after the doctrine which ye received of us."},{"num":7,"verse":"For you know in what manner you ought to imitate us, for we did not walk disorderly among you,"},{"num":8,"verse":"neither did we eat any man’s bread for nought, but working with labour and travail night and day, that we might not be a burden to any of you,"},{"num":9,"verse":"Not because we did not have authority, but to give you an example that you might imitate us."},{"num":10,"verse":"For even when we were with you, this we declared unto you, that if anyone desires not to work neither should he eat."},{"num":11,"verse":"For we hear that there are some who walk among you out of order, not working at all, but are busybodies."},{"num":12,"verse":"Now those that are such, we charge and exhort in our Lord Jesus Christ, that working with quietness, they eat their bread."},{"num":13,"verse":"But ye, brethren, be not weary in well doing."},{"num":14,"verse":"And if anyone does not hearken unto our word by this epistle, note that one and do not join with him, that he may be ashamed."},{"num":15,"verse":"Yet count him not as an enemy, but admonish him as a brother."},{"num":16,"verse":"¶ Now the Lord of peace himself give you peace always by every means. The Lord be with you all."},{"num":17,"verse":"Receive saving health from my hand, Paul, which is the sign in all my letters: so I write."},{"num":18,"verse":"The grace of our Lord Jesus Christ be with you all. Amen."}]