[{"header":"Chapter 3[a]"},{"num":1,"verse":"Request for Prayers. Finally, brothers, pray for us, so that the word of the Lord may speed forward and be glorified, as it did among you, "},{"num":2,"verse":"and that we may be delivered from perverse and wicked people, for not all have faith. "},{"num":3,"verse":"But the Lord is faithful; he will strengthen you and guard you from the evil one. "},{"num":4,"verse":"We are confident of you in the Lord that what we instruct you, you [both] are doing and will continue to do. "},{"num":5,"verse":"May the Lord direct your hearts to the love of God and to the endurance of Christ."},{"num":6,"verse":"Neglect of Work. We instruct you, brothers, in the name of [our] Lord Jesus Christ, to shun any brother who conducts himself in a disorderly way and not according to the tradition they received from us. "},{"num":7,"verse":"For you know how one must imitate us. For we did not act in a disorderly way among you, "},{"num":8,"verse":"nor did we eat food received free from anyone. On the contrary, in toil and drudgery, night and day we worked, so as not to burden any of you. "},{"num":9,"verse":"Not that we do not have the right. Rather, we wanted to present ourselves as a model for you, so that you might imitate us. "},{"num":10,"verse":"In fact, when we were with you, we instructed you that if anyone was unwilling to work, neither should that one eat. "},{"num":11,"verse":"We hear that some are conducting themselves among you in a disorderly way, by not keeping busy but minding the business of others. "},{"num":12,"verse":"Such people we instruct and urge in the Lord Jesus Christ to work quietly and to eat their own food. "},{"num":13,"verse":"But you, brothers, do not be remiss in doing good. "},{"num":14,"verse":"If anyone does not obey our word as expressed in this letter, take note of this person not to associate with him, that he may be put to shame. "},{"num":15,"verse":"Do not regard him as an enemy but admonish him as a brother. "},{"num":16,"verse":"May the Lord of peace himself give you peace at all times and in every way. The Lord be with all of you."},{"num":17,"verse":"This greeting is in my own hand, Paul’s. This is the sign in every letter; this is how I write. "},{"num":18,"verse":"The grace of our Lord Jesus Christ be with all of you."}]