[{"header":"Parents and Children"},{"num":6,"verse":"Children, obey your parents in the Lord, for this is right. "},{"num":2,"verse":"“Honor your father and mother,” which is the first commandment with a promise: "},{"num":3,"verse":"“that it may go well with you and that you may live a long life on the earth.” "},{"num":4,"verse":"Fathers, do not provoke your children to anger, but bring them up in the training and instruction of the Lord."},{"header":"Slaves and Masters"},{"num":5,"verse":"Slaves, obey your human masters with respect and reverence, and with a sincere heart, just as you obey Christ. "},{"num":6,"verse":"Do this not just when they are watching, as if merely to please people, but as slaves of Christ, doing the will of God from the heart. "},{"num":7,"verse":"Serve with eagerness, as for the Lord and not for people, "},{"num":8,"verse":"because you know that each person, whether slave or free, will receive back from the Lord whatever good he has done. "},{"num":9,"verse":"And masters, do the same for your slaves. Do not threaten them, because you know that the one who is both their Master and yours is in heaven, and with him there is no favoritism."},{"header":"The Armor of God"},{"num":10,"verse":"Finally, be strong in the Lord and in his mighty power. "},{"num":11,"verse":"Put on the full armor of God, so that you can stand against the schemes of the Devil. "},{"num":12,"verse":"For our struggle is not against flesh and blood, but against the rulers, against the authorities, against the world rulers of this darkness, against the spiritual forces of evil in the heavenly places. "},{"num":13,"verse":"For this reason, take up the full armor of God, so that you will be able to take a stand on the evil day and, after you have done everything, to stand. "},{"num":14,"verse":"Stand, then, with the belt of truth buckled around your waist, with the breastplate of righteousness fastened in place, "},{"num":15,"verse":"and with the readiness that comes from the gospel of peace tied to your feet like sandals. "},{"num":16,"verse":"At all times hold up the shield of faith, with which you will be able to extinguish all the flaming arrows of the Evil One. "},{"num":17,"verse":"Also take the helmet of salvation and the sword of the Spirit, which is the word of God."},{"header":"Prayer Requests"},{"num":18,"verse":"At every opportunity, pray in the Spirit with every kind of prayer and petition. Stay alert for the same reason, always persevering in your intercession for all the saints. "},{"num":19,"verse":"Pray for me also, that when I open my mouth a message will be given to me that boldly reveals the mystery of the gospel, "},{"num":20,"verse":"for which I am an ambassador in chains. Pray that I may speak about it boldly, as it is necessary for me to speak."},{"header":"Final Comments"},{"num":21,"verse":"Tychicus, our dear brother and a faithful minister in the Lord, will tell you everything, so that you also may know how I am and what I am doing. "},{"num":22,"verse":"I am sending him to you for this very reason, that you may know how we are, and that he may comfort your hearts. "},{"num":23,"verse":"Peace to the brothers, and love with faith from God the Father and the Lord Jesus Christ. "},{"num":24,"verse":"Grace be with all who have an undying love for our Lord Jesus Christ. Amen."}]