[{"header":"Advice for Children and Parents"},{"num":6,"verse":"Children, obey your parents in the Lord, for this is the right thing to do. "},{"num":2,"verse":"“Honor your father and mother…” (This is a very important commandment with a promise.) "},{"num":3,"verse":"“…so that it may go well for you, and that you may have a long life on the earth.”"},{"num":4,"verse":"Fathers, do not provoke your children to anger, but bring them up by training and instructing them about the Lord."},{"header":"Advice for Slaves and Masters"},{"num":5,"verse":"Slaves, obey your earthly masters with fear, trembling, and sincerity, as when you obey the Messiah. "},{"num":6,"verse":"Do not do this only while you’re being watched in order to please them, but be like slaves of the Messiah, who are determined to obey God’s will. "},{"num":7,"verse":"Serve willingly, as if you were serving the Lord and not merely people, "},{"num":8,"verse":"because you know that everyone will receive a reward from the Lord for whatever good he has done, whether he is a slave or free."},{"num":9,"verse":"Masters, treat your slaves the same way. Do not threaten them, for you know that both of you have the same Master in heaven, and there is no favoritism with him."},{"header":"Putting on the Whole Armor of God"},{"num":10,"verse":"Finally, be strong in the Lord, relying on his mighty strength. "},{"num":11,"verse":"Put on the whole armor of God so that you may be able to stand firm against the Devil’s strategies. "},{"num":12,"verse":"For our struggle is not against human opponents, but against rulers, authorities, cosmic powers in the darkness around us, and evil spiritual forces in the heavenly realm. "},{"num":13,"verse":"For this reason, take up the whole armor of God so that you may be able to take a stand whenever evil comes. And when you have done everything you could, you will be able to stand firm."},{"num":14,"verse":"Stand firm, therefore, having fastened the belt of truth around your waist, and having put on the breastplate of righteousness, "},{"num":15,"verse":"and being firm-footed in the gospel of peace. "},{"num":16,"verse":"In addition to having clothed yourselves with these things, having taken up the shield of faith, with which you will be able to put out all the flaming arrows of the evil one, "},{"num":17,"verse":"also take the helmet of salvation and the sword of the Spirit, which is the word of God. "},{"num":18,"verse":"Pray in the Spirit at all times with every kind of prayer and request. Likewise, be alert with your most diligent efforts and pray for all the saints. "},{"num":19,"verse":"Pray also for me, so that, when I begin to speak, the right words will come to me. Then I will boldly make known the secret of the gospel, "},{"num":20,"verse":"for whose sake I am an ambassador in chains, desiring to declare the gospel as boldly as I should."},{"header":"Final Greeting"},{"num":21,"verse":"So that you may know what has happened to me and how I am doing, Tychicus, our dear brother and a faithful minister in service to the Lord, will tell you everything. "},{"num":22,"verse":"I am sending him to you for this very reason, so that you may know how we are doing and that he may encourage your hearts."},{"num":23,"verse":"May peace and love, with faith, be with the brothers, from God the Father and the Lord Jesus, the Messiah!"},{"num":24,"verse":"May grace be with all who sincerely love the Lord Jesus, the Messiah!"}]