[{"num":6,"verse":"Children, obey your parents as believers in the Lord. Obey them because it’s the right thing to do. "},{"num":2,"verse":"Scripture says, “Honor your father and mother.” That is the first commandment that has a promise. "},{"num":3,"verse":"“Then things will go well with you. You will live a long time on the earth.” (Deuteronomy 5:16)"},{"num":4,"verse":"Fathers, don’t make your children angry. Instead, instruct them and teach them the ways of the Lord as you raise them."},{"num":5,"verse":"Slaves, obey your masters here on earth. Respect them and honor them with a heart that is true. Obey them just as you would obey Christ. "},{"num":6,"verse":"Don’t obey them only to please them when they are watching. Do it because you are slaves of Christ. Be sure your heart does what God wants. "},{"num":7,"verse":"Serve your masters with all your heart. Work as serving the Lord and not as serving people. "},{"num":8,"verse":"You know that the Lord will give each person a reward. He will give to them in keeping with the good they do. It doesn’t matter whether they are a slave or not."},{"num":9,"verse":"Masters, treat your slaves in the same way. When you warn them, don’t be too hard on them. You know that the God who is their Master and yours is in heaven. And he treats everyone the same."},{"header":"God’s Armor for Believers"},{"num":10,"verse":"Finally, let the Lord make you strong. Depend on his mighty power. "},{"num":11,"verse":"Put on all of God’s armor. Then you can remain strong against the devil’s evil plans. "},{"num":12,"verse":"Our fight is not against human beings. It is against the rulers, the authorities and the powers of this dark world. It is against the spiritual forces of evil in the heavenly world. "},{"num":13,"verse":"So put on all of God’s armor. Evil days will come. But you will be able to stand up to anything. And after you have done everything you can, you will still be standing. "},{"num":14,"verse":"So remain strong in the faith. Put the belt of truth around your waist. Put the armor of godliness on your chest. "},{"num":15,"verse":"Wear on your feet what will prepare you to tell the good news of peace. "},{"num":16,"verse":"Also, pick up the shield of faith. With it you can put out all the flaming arrows of the evil one. "},{"num":17,"verse":"Put on the helmet of salvation. And take the sword of the Holy Spirit. The sword is God’s word."},{"num":18,"verse":"At all times, pray by the power of the Spirit. Pray all kinds of prayers. Be watchful, so that you can pray. Always keep on praying for all the Lord’s people. "},{"num":19,"verse":"Pray also for me. Pray that whenever I speak, the right words will be given to me. Then I can be bold as I tell the mystery of the good news. "},{"num":20,"verse":"Because of the good news, I am being held by chains as the Lord’s messenger. So pray that I will be bold as I preach the good news. That’s what I should do."},{"header":"Final Greetings"},{"num":21,"verse":"Tychicus is a dear brother. He is faithful in serving the Lord. He will tell you everything about me. Then you will know how I am and what I am doing. "},{"num":22,"verse":"That’s why I am sending him to you. I want you to know how we are. And I want him to encourage you."},{"num":23,"verse":"May God the Father and the Lord Jesus Christ give peace to the brothers and sisters. May they also give the believers love and faith."},{"num":24,"verse":"May grace be given to everyone who loves our Lord Jesus Christ with a love that will never die."}]