[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If any of them that believe not. . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—How should a Christian act if a heathen friend invited him to a feast? Should he inquire whether there was any sacrificial meat at the feast, and so avoid eating it? No. The same principle applies here—no question need be asked.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 10:27-30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:27-30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If any of them that believe not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Any heathen who lives in your neighbourhood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bid you to a feast ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Invite you to his house; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and ye be disposed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To accept the invitation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whatever is set before you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— At the entertainment; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eat, asking no question ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— About its having been sacrificed to idols; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for conscience’ sake. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But receiving it, whatever it may be, as that supply which Divine Providence has then been pleased to send you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But if any man say, This ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "food ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "part of what hath been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offered in sacrifice unto idols, eat not, for his sake that showed it ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Whether he be a heathen, who might thereby be confirmed in his idolatry, or a brother, who might otherwise be insnared by thy example, and tempted to violate the dictates of his own mind; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and for conscience’ sake",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — For the sake of his weak conscience, lest it should be wounded by seeing thee do what he judged to be unlawful. To explain this further, “The heathen often, in their own houses, made an ordinary feast of a part of the sacrifice, see on chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to these entertainments, the apostle told the Corinthian brethren, they might lawfully go when invited. But on such occasions, if a Christian domestic or slave, by informing them that this or that dish consisted of things which had been sacrificed to an idol, signified that they considered their eating these things as sinful, they were to abstain from them, for the reasons mentioned in the text.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the earth is the Lord’s, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This clause, inserted in our copies, is omitted in the Alex. Clermont, and other manuscripts, and the Syriac, Arabic, and Vulgate versions; and some other critics think it disturbs the sense. “But,” says Macknight, “it renders the argument more complete; for the meaning is, The Lord, to whom the earth and all its fulness belong, having allowed men a sufficiency of other wholesome food, no one is under any necessity of offending those who are either ignorant or scrupulous, by eating a particular kind.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Conscience, I say, not thine own ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I speak of his conscience, not thine, lest it be troubled, and his mind be disquieted; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for why is my liberty judged by another’s conscience ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I ought not to use my liberty so as to do that which another man thinks in his conscience to be evil, and so judges me a transgressor for it. Or, as Dr. Doddridge paraphrases the verse, “I mean not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thine own conscience ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "immediately, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but that of another ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "person; for how indifferent soever thou mayest esteem the matter, thou art obliged in duty to be very cautious that thou dost not wound and grieve that of thy brother: but you will observe, that I here speak only of acts obvious to human observation; for, as to what immediately lies between God and my own soul, why is my liberty to be judged, arraigned, and condemned at the bar of another man’s conscience? I am not, in such cases, to govern myself by the judgment and apprehension of others; nor have they any authority to judge or censure me for not concurring with them in their own narrow notions and declarations.” Others think it is an objection in the mouths of the Corinthians, and to be thus understood: “But why should I suffer myself to be thus imposed on, and receive law from any, where Christ has left me free?” But the above interpretation seems more probable, which supposes that this and the following verse come in as a kind of parenthesis, to prevent their extending the former caution beyond what he designed by it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For if I, by grace ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The divine favour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be a partaker ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Of the common gifts of Providence; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "why am I evil spoken of for ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "my free and cheerful use of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that for which I give thanks ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As tracing it up to the hand of the great Supreme Benefactor?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:23-33 There were cases wherein Christians might eat what had been offered to idols, without sin. Such as when the flesh was sold in the market as common food, for the priest to whom it had been given. But a Christian must not merely consider what is lawful, but what is expedient, and to edify others. Christianity by no means forbids the common offices of kindness, or allows uncourteous behaviour to any, however they may differ from us in religious sentiments or practices. But this is not to be understood of religious festivals, partaking in idolatrous worship. According to this advice of the apostle, Christians should take care not to use their liberty to the hurt of others, or to their own reproach. In eating and drinking, and in all we do, we should aim at the glory of God, at pleasing and honouring him. This is the great end of all religion, and directs us where express rules are wanting. A holy, peaceable, and benevolent spirit, will disarm the greatest enemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If any of them that believe not - That are not Christians; that are still pagans.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Bid you to a feast - Evidently not a feast in the temple of an idol, but at his own house. If he asks you to partake of his hospitality.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And ye be disposed to go - Greek, \"And you will to go.\" It is evidently implied here that it would be not improper to go. The Saviour accepted such invitations to dine with the Pharisees (see the note at Luke 11:37); and Christianity is not designed to abolish the courtesies of social life; or to break the bonds of contact; or to make people misanthropes or hermits. It allows and cultivates, under proper Christian restraints, the contact in society which will promote the comfort of people, and especially that which may extend the usefulness of Christians. It does not require, therefore, that we should withdraw from social life, or regard as improper the courtesies of society; see the note at 1 Corinthians 5:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ye be disposed to go - Greek, \"And you will to go.\" It is evidently implied here that it would be not improper to go. The Saviour accepted such invitations to dine with the Pharisees (see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 11:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and Christianity is not designed to abolish the courtesies of social life; or to break the bonds of contact; or to make people misanthropes or hermits. It allows and cultivates, under proper Christian restraints, the contact in society which will promote the comfort of people, and especially that which may extend the usefulness of Christians. It does not require, therefore, that we should withdraw from social life, or regard as improper the courtesies of society; see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Whatsoever is set before you ... - Whether it has been offered in sacrifice or not; for so the connection requires us to understand it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eat - This should be interpreted strictly. The apostle says \"eat,\" not \"drink;\" and the principle will not authorize us to \"drink\" whatever is set before us, asking no questions for conscience sake; for while it was matter of indifference in regard to eating, whether the meat had been sacrificed to idols or not, it is not a matter of indifference whether a man may drink intoxicating liquor. That is a point on which the \"conscience\" should have much to do; and on which its honest decisions, and the will of the Lord, should be faithfully and honestly regarded. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Eat - This should be interpreted strictly. The apostle says \"eat,\" not \"drink;\" and the principle will not authorize us to \"drink\" whatever is set before us, asking no questions for conscience sake; for while it was matter of indifference in regard to eating, whether the meat had been sacrificed to idols or not, it is not a matter of indifference whether a man may drink intoxicating liquor. That is a point on which the \"conscience\" should have much to do; and on which its honest decisions, and the will of the Lord, should be faithfully and honestly regarded. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. ye be disposed to go—tacitly implying, they would be as well not to go, but yet not forbidding them to go (1Co 10:9) [Grotius]. The feast is not an idol feast, but a general entertainment, at which, however, there might be meat that had been offered to an idol.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for conscience' sake—(See on [2289]1Co 10:25).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The apostle puts another case, in which they might lawfully enough eat of meat offered to an idol; that was in case any of their neighbours, that were heathens, invited them to dinner or supper in a private house (some add, or in the idol’s temple, if it were a feast of friendship, not a feast upon a sacrifice; but I doubt that, and also whether in the idol-temples there were any feasts but upon sacrifices): he determineth it lawful for them to go and eat whatsoever was set before them; but in this case he would also have them ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "ask no questions for conscience sake.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If any of them that believe not,.... In Christ, and make no profession of faith in him; but are infidels to his person, office, grace, righteousness, Gospel, and ordinances, as there were many such at Corinth: \"bid you\" to a feast; invite you to dine or sup with them in their own houses: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and ye be disposed to go; the apostle does not lay any commands upon them to go, or not go, but leaves them to their own will, inclination, and discretion; for as circumstances might be, it might be either proper or improper to listen to an invitation from such a quarter; but if they were inclined, and did think fit to go, which they might without sin; for as it is lawful to trade, so to eat and drink with unbelievers; then his advice is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whatsoever is set before you, eat, asking no questions for conscience sake; that is, as before, as whether it is offered to idols or not; lest either their own, or another's conscience should be hurt thereby. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "whatsoever is set before you, eat, asking no questions for conscience sake; that is, as before, as whether it is offered to idols or not; lest either their own, or another's conscience should be hurt thereby. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If any of them that believe not bid you to a feast, and ye be disposed to go; whatsoever is set before you, eat, asking no question for conscience sake.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] of continuation. In the matter of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "invitations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " too the same principle holds good, only with the incidental limitation adduced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Note the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "emphasis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " conveyed by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unusual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " place of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καλεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in contrast to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ ἐν μακέλλῳ πωλούμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". which has been already spoken of. Attention is thus called to the fact that a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "second",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a new",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " situation is now to be discussed; before, the reader was in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fleshmarket",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; now, he is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a guest at a feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is plain, at the same time, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that what is meant is not the invitation to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "festivals in express connection with sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " heathen feasts, at which, however, flesh offered to idols might occur; for in the case of a sacrificial feast the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἱερόθυτόν ἐστι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was a matter of course.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ θέλετε πορ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] “Admonet tacite, melius forte facturos, si non eant, ire tamen non prohibet,” Grotius.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "[1568] parallel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1569] classical.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1570] Greek, or Grotius’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Annotationes in N.T.[1571]",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Annotationes in N.T.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "[1571]",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "idd. Liddell and Scott’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Greek-English Lexicon.[1572]",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Greek-English Lexicon.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "[1572]",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Grimm-Thayer’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Greek-English Lexicon of the N.T.[1573] ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Greek-English Lexicon of the N.T.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "[1573] ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " English Version.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1574] Bengel’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gnomon Novi Testamenti.[1575]",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Gnomon Novi Testamenti.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "[1575]",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " C. J. Ellicott’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "St. Paul’s First Epistle to the Corinthians",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If any of them that believe not bid you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. to a feast in a private house. Although some of the Corinthians had gone so far as to declare that a Christian might innocently sit at meat in the idol temple, confident in his conviction that an idol was ‘nothing in the world’ (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet the Christian religion could not permit them thus to abuse their freedom. To sit at meat in the idol temple was directly to countenance idol worship, and thus to become ‘partaker’ of the ‘table of devils.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Θέλετε πορεύεσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you wish to go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Paul does not much approve of this, nor does he forbid it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Bid you to a feast.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is assumed that the feast is to take place in a private house, not an idol temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye be disposed to go;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ye wish to go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with an emphasis on the \"wish,\" which, as Grotius says, perhaps implies that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "wish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not particularly commendable, although the apostle, in his large-hearted tolerance, does not actually blame it. The rabbis decided very differently. \"If,\" said Rabbi Ishmael, \"an idolater makes a feast in honour of his son, and invites all the Jews of his town, they eat of the sacrifices of the dead, even though they eat and drink of their own\" ('Avodah Zarah,' fol. 18, 1). There are many passages of the Talmud which raise the suspicion that the rabbis are ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "purposely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " running counter to the teaching of the New Testament. 1 Corinthians 10:27",
        "children": []
      }
    ]
  }
]