[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That spiritual Rock that followed them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There was a Jewish tradition that the Rock—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a fragment broken off from the rock smitten by Moses—followed the Israelites through their journey, and St. Paul, for the purpose of illustration, adopts that account instead of the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The emphatic repetition of the word “spiritual” before “drink” and “rock” reminds the reader that it is the spiritual and not the historic aspect of the fact which is present to St. Paul’s mind. The traditional account of the Rock was a more complete illustration of the abiding presence of God, which was the point that the Apostle here desires to bring forward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And that Rock was Christ.—As Christ was “God manifest in the flesh” in the New Dispensation, so God manifest in the Rock (the source of sustaining life) was the Christ of the Old Dispensation. The Jews had become familiar with the thought of God as a Rock. (See 1Samuel 2:2; Psalm 91:12; Isaiah 32:2.) Though the Jews may have recognised the Rock poetically as God, they knew not that it was, as a manifestation of God’s presence, typical of the manifestation which was yet to be given in the Incarnation. Such seems to be the force of the statement and of the word “But” which emphatically introduces it. But though they thought it only a Rock, or applied the word poetically to Jehovah, that Rock was Christ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And that Rock was Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As Christ was “God manifest in the flesh” in the New Dispensation, so God manifest in the Rock (the source of sustaining life) was the Christ of the Old Dispensation. The Jews had become familiar with the thought of God as a Rock. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 91:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 32:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Though the Jews may have recognised the Rock poetically as God, they knew not that it was, as a manifestation of God’s presence, typical of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " manifestation which was yet to be given in the Incarnation. Such seems to be the force of the statement and of the word “But” which emphatically introduces it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "But",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though they thought it only a Rock, or applied the word poetically to Jehovah, that Rock ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Christ.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 10:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And did all drink the same spiritual — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, typical; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drink ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, typical of Christ and of the living water, the divine influence derived from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For they drank of that spiritual ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or mysterious; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rock ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The wonderful streams of which followed them in their several journeyings for many years through the wilderness. It must be observed, water was twice brought from a rock by a miracle, for the Israelites in the wilderness; once in Rephidim, which was their eleventh station, and in the first year after they came out of Egypt; of which miracle we have an account, Exodus 17.; the second time was at Kadesh, which was their thirty-third station, and in the fortieth year after their leaving Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To both places the name of Meribah was given; but the latter was called Meribah-Kadesh, to distinguish it from Meribah of Rephidim. It is the miracle performed in Rephidim of which the apostle here speaks. The water, it appears, that issued from this rock formed a brook, which (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is said to have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "descended out of the mount, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, out of Horeb; (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";) for before that miracle there was no brook in these parts. And it issued in such abundance as to be termed ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Indeed, six hundred thousand men, with their women and children, and cattle, required a river to supply them with drink. And Horeb being a high mountain, there seems to have been a descent from it to the sea; and the Israelites, during the thirty-seven years of their journeying, appear to have gone by those tracts of country in which the waters from Horeb could follow them, till in the thirty-ninth year they came to Ezion-Gaber, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) a port of the Red sea, far down the Arabian side, where it is supposed the water from Horeb went into that sea. The country through which the Israelites journeyed so long a time, being watered by this river, produced, no doubt, herbage for the cattle of the Israelites, which, in this desert, must otherwise have perished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And that Rock was Christ ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— A manifest type of him, the Rock of ages, who, being smitten in his death and sufferings, poured forth streams of redemption, grace, and heavenly blessings, which follow his people through all this wilderness, and will end in rivers of pleasure at the right hand of God for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-5 To dissuade the Corinthians from communion with idolaters, and security in any sinful course, the apostle sets before them the example of the Jewish nation of old. They were, by a miracle, led through the Red Sea, where the pursuing Egyptians were drowned. It was to them a typical baptism. The manna on which they fed was a type of Christ crucified, the Bread which came down from heaven, which whoso eateth shall live for ever. Christ is the Rock on which the Christian church is built; and of the streams that issue therefrom, all believers drink, and are refreshed. It typified the sacred influences of the Holy Spirit, as given to believers through Christ. But let none presume upon their great privileges, or profession of the truth; these will not secure heavenly happiness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And did all drink the same spiritual drink - The idea here is essentially the same as in the previous verse, that they had been highly favored of God, and enjoyed tokens of the divine care and guardianship. That was manifested in the miraculous supply of water in the desert, thus showing that they were under the divine protection, and were objects of the divine favor. There can be no doubt that by \"spiritual drink\" here, the apostle refers to the water that was made to gush from the rock that was smitten by Moses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Why this is called \"spiritual\" has been a subject on which there has been much difference of opinion. It cannot be because there was anything special in the nature of the water, for it was evidently real water, suited to allay their thirst. There is no evidence, as many have supposed, that there was a reference in this to the drink used in the Lord's Supper. But it must mean that it was bestowed in a miraculous and supernatural manner; and the word \"spiritual\" must be used in the sense of supernatural, or that which is immediately given by God. Spiritual blessings thus stand opposed to natural and temporal blessings, and the former denote those which are immediately given by God as an evidence of the divine favor. That the Jews used the word \"spiritual\" in this manner is evident from the writings of the Rabbis. Thus, they called the manna \"spiritual food\" (Yade Mose in Shemor Rabba, fol. 109. 3); and their sacrifices they called \"spiritual bread\" (Tzeror Hammer, fol. 93. 2). - Gill. The drink, therefore, here referred to was that bestowed in a supernatural manner and as a proof of the divine favor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For they drank of that spiritual Rock - Of the waters which flowed from that Rock. The Rock here is called \"spiritual,\" not from anything special in the nature of the rock, but because it was the source to them of supernatural mercies, and became thus the emblem and demonstration of the divine favor, and of spiritual mercies conferred upon them by God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That followed them - Margin. \"Went with\" ἀκολουθούσης  akolouthousēs. This evidently cannot mean that the rock itself literally followed them, any more than that they literally drank the rock, for one is as expressly affirmed, if it is taken literally, as the other. But as when it is said they \"drank of the rock,\" it must mean that they drank of the water that flowed from the rock; so when it is said that the \"rock followed\" or accompanied them, it must mean that the water that flowed from the rock accompanied them. This figure of speech is common everywhere. Thus, the Saviour said 1 Corinthians 11:25, \"This cup is the new testament,\" that is, the wine in this cup represents my blood, etc.; and Paul says 1 Corinthians 11:25, 1 Corinthians 11:27, \"whosoever shall drink this cup of the Lord unworthily,\" that is, the wine in the cup, etc., and \"as often as ye drink this cup,\" etc., that is, the wine contained in the cup. It would be absurd to suppose that the rock that was smitten by Moses literally followed them in the wilderness; and there is not the slightest evidence in the Old Testament that it did. Water was twice brought out of a rock to supply the needs of the children of Israel. Once at Mount Horeb, as recorded in Exodus 17:6, in the wilderness of Sin, in the first year of their departure from Egypt. The second time water was brought from a rock about the time of the death of Miriam at Kadesh, and probably in the 40th year of their departure from Egypt, Numbers 20:1. It was to the former of these occasions that the apostle evidently refers. In regard to this we may observe:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That followed them - Margin. \"Went with\" ἀκολουθούσης  akolouthousēs. This evidently cannot mean that the rock itself literally followed them, any more than that they literally drank the rock, for one is as expressly affirmed, if it is taken literally, as the other. But as when it is said they \"drank of the rock,\" it must mean that they drank of the water that flowed from the rock; so when it is said that the \"rock followed\" or accompanied them, it must mean that the water that flowed from the rock accompanied them. This figure of speech is common everywhere. Thus, the Saviour said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"This cup is the new testament,\" that is, the wine in this cup represents my blood, etc.; and Paul says ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"whosoever shall drink this cup of the Lord unworthily,\" that is, the wine in the cup, etc., and \"as often as ye drink this cup,\" etc., that is, the wine contained in the cup. It would be absurd to suppose that the rock that was smitten by Moses literally followed them in the wilderness; and there is not the slightest evidence in the Old Testament that it did. Water was twice brought out of a rock to supply the needs of the children of Israel. Once at Mount Horeb, as recorded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the wilderness of Sin, in the first year of their departure from Egypt. The second time water was brought from a rock about the time of the death of Miriam at Kadesh, and probably in the 40th year of their departure from Egypt, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was to the former of these occasions that the apostle evidently refers. In regard to this we may observe:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That there must have been furnished a large quantity of water to have supplied the needs of more than two million people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it is expressly stated Deuteronomy 9:21), that \"the brook נחל  nachal, stream, torrent, or river, see Numbers 34:5; Joshua 15:4, Joshua 15:47; 1 Kings 8:65; 2 Kings 24:7) descended out of the mount,\" and was evidently a stream of considerable size.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) it is expressly stated ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that \"the brook נחל  nachal, stream, torrent, or river, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 34:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:65",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 24:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") descended out of the mount,\" and was evidently a stream of considerable size.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) mount Horeb was higher than the adjacent country, and the water that thus gushed from the rock, instead of collecting into a pool and becoming stagnant, would flow off in the direction of the sea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) the sea to which it would naturally flow would be the Red Sea, in the direction of the Eastern or Elanitic branch of that sea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) the Israelites would doubtless, in their journeyings, be influenced by the natural direction of the water, or would not wander far from it, as it was daily needful for the supply of their needs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) at the end of thirty-seven years we find the Israelites at Ezion-geber, a seaport on the eastern branch of the Red Sea, where the waters probably flowed into the sea; Numbers 33:36. In the 40th year of their departure from Egypt, they left this place to go into Canaan by the country of Edom, and were immediately in distress again by the lack of water. It is thus probable that the water from the rock continued to flow, and that it constituted a stream, or river; that it was near their camp all the time until they came to Ezion-geber; and that thus, together with the daily supply of manna, it was a proof of the protection of God, and an emblem of their dependence. If it be said that there is now no such stream to be found there, it is to be observed that it is represented as miraculous, and that it would be just as reasonable to look for the daily descent of manna there in quantities sufficient to supply more than two million people, as to expect to find the gushing and running river of water. The only question is, whether God can work a miracle, and whether there is evidence that he has done it. This is not the place to examine that question. But the evidence is as strong that he performed this miracle as that he gave the manna, and neither of them is inconsistent with the power, the wisdom, or the benevolence of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(6) at the end of thirty-seven years we find the Israelites at Ezion-geber, a seaport on the eastern branch of the Red Sea, where the waters probably flowed into the sea; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 33:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the 40th year of their departure from Egypt, they left this place to go into Canaan by the country of Edom, and were immediately in distress again by the lack of water. It is thus probable that the water from the rock continued to flow, and that it constituted a stream, or river; that it was near their camp all the time until they came to Ezion-geber; and that thus, together with the daily supply of manna, it was a proof of the protection of God, and an emblem of their dependence. If it be said that there is now no such stream to be found there, it is to be observed that it is represented as miraculous, and that it would be just as reasonable to look for the daily descent of manna there in quantities sufficient to supply more than two million people, as to expect to find the gushing and running river of water. The only question is, whether God can work a miracle, and whether there is evidence that he has done it. This is not the place to examine that question. But the evidence is as strong that he performed this miracle as that he gave the manna, and neither of them is inconsistent with the power, the wisdom, or the benevolence of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And that Rock was Christ - This cannot be intended to be understood literally, for it was not literally true. The rock from which the water flowed was evidently an ordinary rock, a part of Mount Horeb; and all that this can mean is, that that rock, with the stream of water thus gushing from it, was a representation of the Messiah. The word was is thus often used to denote similarity or representation, and is not to be taken literally. Thus, in the institution of the Lord's Supper, the Saviour says of the bread, \"This is my body,\" that is, it represents my body. Thus, also of the cup, \"This cup is the new testament in my blood,\" that is, it represents my blood, 1 Corinthians 11:24-25. Thus, the gushing fountain of water might be regarded as a representation of the Messiah, and of the blessings which result from him. The apostle does not say that the Israelites knew that this was designed to be a representation of the Messiah, and of the blessings which flow from him, though there is nothing improbable in the supposition that they so understood and regarded it, since all their institutions were probably regarded as typical. But he evidently does mean to say that the rock was a vivid and affecting representation of the Messiah; that the Jews did partake of the mercies that flow from him; and that even in the desert they were under his care, and had in fact among them a vivid representation of him in some sense corresponding with the emblematic representation of the same favors which the Corinthian and other Christians had in the Lord's Supper. This representation of the Messiah, perhaps, was understood by Paul to consist in the following things:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And that Rock was Christ - This cannot be intended to be understood literally, for it was not literally true. The rock from which the water flowed was evidently an ordinary rock, a part of Mount Horeb; and all that this can mean is, that that rock, with the stream of water thus gushing from it, was a representation of the Messiah. The word was is thus often used to denote similarity or representation, and is not to be taken literally. Thus, in the institution of the Lord's Supper, the Saviour says of the bread, \"This is my body,\" that is, it represents my body. Thus, also of the cup, \"This cup is the new testament in my blood,\" that is, it represents my blood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:24-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus, the gushing fountain of water might be regarded as a representation of the Messiah, and of the blessings which result from him. The apostle does not say that the Israelites knew that this was designed to be a representation of the Messiah, and of the blessings which flow from him, though there is nothing improbable in the supposition that they so understood and regarded it, since all their institutions were probably regarded as typical. But he evidently does mean to say that the rock was a vivid and affecting representation of the Messiah; that the Jews did partake of the mercies that flow from him; and that even in the desert they were under his care, and had in fact among them a vivid representation of him in some sense corresponding with the emblematic representation of the same favors which the Corinthian and other Christians had in the Lord's Supper. This representation of the Messiah, perhaps, was understood by Paul to consist in the following things:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Christians, like the children of Israel, are passing through the world as pilgrims, and to them that world is a wilderness - a desert.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) they need continued supplies, as the Israelites did, in their journey. The world, like that wilderness, does not meet their necessities, or supply their needs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) that rock was a striking representation of the fulness of the Messiah, of the abundant grace which he imparts to his people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) it was an illustration of their continued and constant dependence on him for the daily supply of their needs. It should be observed that many expositors understand this literally. Bloomfield translates it: \"and they were supplied with drink from the spiritual Rock which followed them, even Christ.\" So Rosenmuller, Calvin, Glass, etc. In defense of this interpretation, it is said, that the Messiah is often called \"a rock\" in the Scriptures; that the Jews believe that the \"angel of Jehovah\" who who attended them (Exodus 3:2, and other places) was the Messiah; and that the design of the apostle was, to show that this \"attending Rock,\" the Messiah, was the source of all their blessings, and particularly of the water that gushed from the rock. But the interpretation suggested above seems to me to be most natural. The design of the apostle is apparent. It is to show to the Corinthians, who relied so much on their privileges, and felt themselves so secure, that the Jews had the very same privileges - had the highest tokens of the divine favor and protection, were under the guidance and grace of God, and were partakers constantly of that which adumbrated or typified the Messiah, in a manner as real, and in a form as much suited to keep up the remembrance of their dependence, as even the bread and wine in the Lord's Supper. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) it was an illustration of their continued and constant dependence on him for the daily supply of their needs. It should be observed that many expositors understand this literally. Bloomfield translates it: \"and they were supplied with drink from the spiritual Rock which followed them, even Christ.\" So Rosenmuller, Calvin, Glass, etc. In defense of this interpretation, it is said, that the Messiah is often called \"a rock\" in the Scriptures; that the Jews believe that the \"angel of Jehovah\" who who attended them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other places) was the Messiah; and that the design of the apostle was, to show that this \"attending Rock,\" the Messiah, was the source of all their blessings, and particularly of the water that gushed from the rock. But the interpretation suggested above seems to me to be most natural. The design of the apostle is apparent. It is to show to the Corinthians, who relied so much on their privileges, and felt themselves so secure, that the Jews had the very same privileges - had the highest tokens of the divine favor and protection, were under the guidance and grace of God, and were partakers constantly of that which adumbrated or typified the Messiah, in a manner as real, and in a form as much suited to keep up the remembrance of their dependence, as even the bread and wine in the Lord's Supper. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. drink—(Ex 17:6). In Nu 20:8, \"the beasts\" also are mentioned as having drunk. The literal water typified \"spiritual drink,\" and is therefore so called.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "spiritual Rock that followed them—rather, \"accompanied them.\" Not the literal rock (or its water) \"followed\" them, as Alford explains, as if Paul sanctioned the Jews' tradition (Rabbi Solomon on Nu 20:2) that the rock itself, or at least the stream from it, followed the Israelites from place to place (compare De 9:21). But Christ, the \"Spiritual Rock\" (Ps 78:20, 35; De 32:4, 15, 18, 30, 31, 37; Isa 28:16; 1Pe 2:6), accompanied them (Ex 33:15). \"Followed\" implies His attending on them to minister to them; thus, though mostly going before them, He, when occasion required it, followed \"behind\" (Ex 14:19). He satisfied all alike as to their bodily thirst whenever they needed it; as on three occasions is expressly recorded (Ex 15:24, 25; 17:6; Nu 20:8); and this drink for the body symbolized the spiritual drink from the Spiritual Rock (compare Joh 4:13, 14; see on [2288]1Co 10:3).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " And all the Jews, as well those that perished in the wilderness, as those that were preserved to go into Canaan, they drank of the water which came out of the rock, of which we read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 17:6 Numbers 20:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which water was ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "spiritual drink",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the same respects that the manna was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spiritual meat, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being miraculously produced, and being a figure of Christ. For, saith the apostle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that rock was Christ; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, that rock did signify or prefigure Christ; the rock was Christ in the same sense that the bread in the Lord’s supper is the body of Christ, that is, a sign which by Divine institution did signify Christ. Here ariseth a question in what sense it is said, that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "rock followed them?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That by the rock is to be understood the water that God made to flow out of the rock, is evident; but though we read of water twice fetched out of the rock upon Moses smiting of it; once at Rephidim, before they came so far as Mount Sinai, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 17:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; another time at Kadesh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 20:7,8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; yet we no where read in the history of the Jewish journeyings to Canaan, that the rock followed them. But this is not the only thing that we read in the New Testament relating to the history of the Old Testament, with some circumstances which we do not find recorded there; it is enough that it is plainly asserted here, and it must be presumed, or how can we imagine that the Israelites were supplied with water for forty years together? Whereas some object, that if the water, which came out of the rock at Rephidim, had followed them, there would have been no need of Moses striking the rock at Kadesh; it is answered, that God, to try them, probably caused the water to stop. For the analogy between the rock and Christ, divines make it to lie in these particulars: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. That Christ is the firm and unmovable foundation of his church, called therefore a stone, a tried stone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 28:16 Romans 9:33 1 Peter 2:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. As this rock sent out no water for the refreshment of the Israelites, till Moses had struck it; so all the benefit we have from Christ as Mediator, floweth from him as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "smitten of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "afflicted.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. As the water of the rock served both for cleansing, and upholding life in satisfying thirst; so the blood of Christ is useful to the soul, both for washing from the guilt of sin, and the upholding spiritual life in a soul. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. As the rock that followed the Israelites afforded water not only to that generation that were alive and present when the rock was smitten, but to all the succeeding generations, until the Israelites came into Canaan; so the blood of Christ is useful not only to his people in this or that place or age, but to all that shall believe in him, and that till they shall come into the heavenly Canaan. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And did all drink the same spiritual drink,.... By which is meant the water out of the rock, which was typical of the blood of Christ, which is drink indeed, and not figurative, as this was, for which reason it is called spiritual; or of the grace of Christ, often signified by water, both in the Old and New Testament; and is what Moses and the law could not give; for righteousness and life, grace and salvation, could never be had by the works of the law: and very unpromising it was, and is to carnal men, that these should come by a crucified Christ, as it was to the Israelites, that water, in such plenty, should gush out of the rock in Horeb; but as those waters did not flow from thence without the rock being stricken by the rod of Moses, so the communication of the blessings of grace from Christ is through his being smitten by divine justice with the rod of the law; through his being, stricken for the transgressions of his people, and and being made sin, and a curse of the law in their room and stead. And as those waters continued through the wilderness as a constant supply for them, so the grace of Christ is always sufficient for his people; a continual supply is afforded them; goodness and mercy follow them all the days of their lives: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they drank, of that spiritual rock that followed them; by which the apostle means not Christ himself, for he went before them as the angel of God's presence, but the rock that typified him; not that the rock itself removed out of its place, and went after them, but the waters out of the rock ran like rivers, and followed them in the wilderness wherever they went, for the space of eight and thirty years, or thereabout, and then were stopped, to make trial of their faith once more; this was at Kadesh when the rock was struck again, and gave forth its waters, which, as the continual raining of the manna, was a constant miracle wrought for them. And this sense of the apostle is entirely agreeable to the sentiments of the Jews, who say, that the Israelites had the well of water all the forty years (k). The Jerusalem Targum (l) says of the ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"well given at Mattanah, that it again became unto them violent overflowing brooks, and again ascended to the tops of the mountains, and descended with them into the ancient valleys.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And to the same purpose the Targum of Jonathan ben Uzziel (m), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that it again ascended with them to the highest mountains, and from the highest mountains it descended with them to the hills, and encompassed the whole camp of Israel, and gave drink to everyone at the gate of his own dwelling place; and from the high mountains it descended with them into the deep valleys.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea, they speak of the rock in much the same language the apostle does, and seem to understand it of the rock itself, as if that really went along with the Israelites in the wilderness. Thus one of their writers (n) on those words, \"must we fetch you water out of this rock?\" makes this remark: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for they knew it not,  , \"for that rock went\", and remained among the rocks.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And in another place it is said (o), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that the rock became in the form of a beehive; (elsewhere (p) it is said to be round as a sieve;) and rolled along,  , \"and came with them\", in their journeys; and when the standard bearers encamped, and the tabernacle stood still, the rock came, and remained in the court of the tent of the congregation; and the princes came and stood upon the top of it, and said, ascend, O well, and it ascended.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now, though in this account there is a mixture of fable, yet there appears something of the old true tradition received in the Jewish church, which the apostle has here respect to. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the rock was Christ: that is, it signified Christ, it was a type of him. So the Jews (q) say, that the Shekinah is called , \"the holy rock\"; and Philo the Jew says (r) of this rock, that the broken rock is   , \"the wisdom of God\". Christ may be compared to the rock for his outward meanness in his parentage and education, in his ministry and audience, in his life and death; and for his height also, being made higher than the kings of the earth, than the angels in heaven, and than the heavens themselves; and for shelter and safety from the wrath of God, and from the rage of men; and for firmness, solidity, and strength, which are seen in his upholding all things by his power, in bearing the sins of his people, and the punishment due unto them, in the support of his church, and bearing up his people under all afflictions and temptations, and in preserving them from a total and final falling away: and a rock he appears to be, as he is the foundation of his church and every believer, against which hell and earth can never prevail; and to it he may be likened for duration, his love being immovable, his righteousness everlasting, his salvation eternal, and he, as the foundation of his church, abiding for ever. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Jarchi in Numbers 20.2.((l) In Numbers 21.20. (m) In ib. (n) Jarchi in Numbers 20.10. (o) Bemidbar Rabba, sect. 1. fol. 177. 2.((p) Gloss. in T. Bab. Pesach. fol. 54. 1.((q) Zohar in Num. fol. 87. 4. & Imre Binah in ib. (r) Lib. Allegor. l. 3. p. 1103. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) Jarchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".2.((l) In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".20. (m) In ib. (n) Jarchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".10. (o) Bemidbar Rabba, sect. 1. fol. 177. 2.((p) Gloss. in T. Bab. Pesach. fol. 54. 1.((q) Zohar in Num. fol. 87. 4. & Imre Binah in ib. (r) Lib. Allegor. l. 3. p. 1103. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And did all drink the same spiritual drink: for they drank of that spiritual Rock that {f} followed them: and that Rock was {g} Christ.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And did all drink the same spiritual drink: for they drank of that spiritual Rock that ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " followed them: and that Rock was ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Christ.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Of the River and running Rock, who followed the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Did signify Christ as an ordinance, so that together with the sign, there was the thing signified, and the truth itself. For God does not offer a bare sign, but the thing signified by the sign together with it, which is to be received with faith.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and did all drink the same spiritual drink",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This miraculous supply of water, vouchsafed on two occasions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") belonged, like the manna, not to the natural, but to the spiritual order of God’s Providence, which has its necessary points of contact with the lower and more contracted natural order, and issues in what we call miracles. Hence they were types of still greater miracles, which belong however more exclusively to the spiritual order of things, namely, the nourishing the Christian Church with the “spiritual food of the Body and Blood of Christ” In this sense, St Augustine (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tract",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 26 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "super Joannem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") says well, “Sacramenta illa fuerunt, in signis diversa fed in re quæ significatur paria,” because it was Christ who was the miraculous support and preservation of the Israelites in the wilderness, as well as of Christians in their pilgrimage through the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for they drank of that spiritual Rock that followed them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Targums of Onkelos and Jonathan speak of a ‘well’ which followed the Israelites in their wanderings. In the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bemidbar Rabbah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (c. i.) it is a Rock, in shape like a bee-hive, which rolled. continually forward to accompany the Israelites on their way (for the tradition consult Wetstein, or Schöttgen). Our great Rabbinical scholar Lightfoot rejects this interpretation, and believes that the expression refers, not to the rock, but the streams which issued from it, and which were gathered into pools wherever they encamped. It was to this, and not to the rock, that the words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are supposed to be addressed. Estius cites ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in support of the same view. See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘the brook that descended from the mount.’ Meyer thinks that the tradition was a later invention of the Rabbis, since the Targums in their present shape cannot be traced back farther than the second century. It possibly grew out of an older tradition, here referred to, that a spiritual power invisibly accompanied the Israelites, and ministered to their temporal wants.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and that Rock was Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See last note but one. Christ was the true source of all their nourishment, and He went with them whithersoever they went He, the Angel of the Covenant (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was their guide and their support. Cf. St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:37-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the term Rock, as applied to God, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and many other passages in the Psalms too numerous to quote. We can hardly dismiss this passage without quoting Bengel’s remark; “Had there been more than two Sacraments, St Paul would have pointed out some spiritual resemblance to them.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πόμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drink",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This relates rather to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", than to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where mention is made also of cattle.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γὰρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Such as is the rock, such is the water.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκ πνευματικῆς ἀκολουθούσης πέτρας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the spiritual rock, that followed them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The article ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not added. The people did not know, what the rock was; therefore Paul long after adds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but the rock was Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This spiritual rock is spoken of as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "following them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not on account of its following the people; for it rather went before them; but because, although at that time it was really present with them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet it was only in after ages that at length it was made known to them; comp. on the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀκολουθεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to follow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; on the order of natural and spiritual things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The same spiritual drink.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The water from the smitten rock might (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") be called a \"spiritual\" drink, both as being a miraculous gift (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Isaac is said to be \"born ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "after the spirit\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as being a type of that \"living water\" which \"springs up into everlasting life\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and of the blood of Christ in the Eucharist (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These \"waters in the wilderness\" and \"rivers in the desert\" were a natural symbol of the grace of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), especially as bestowed in the sacrament through material signs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They drank;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "they were drinking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", implying a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "continuous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gift. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of that spiritual Rock that followed them;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of a spiritual following Rock.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is explained ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a mere figure of speech, in which the natural rock which Moses smote is left out of sight altogether; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as meaning that not the rock, but the water from the rock, followed after them in their wanderings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There can, however, be little or no doubt that St. Paul refers to the common Jewish Hagadah, that the actual material rock did follow the Israelites in their wanderings. The rabbis said that it was round, and rolled itself up like a swarm of bees, and that, when the tabernacle was pitched, this rock came and settled in its vestibule, and began to flow when the princes came to it and sang, \"Spring up, O well; sing ye unto it\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It does not, of course, follow from this allusion that St. Paul, or even the rabbis, believed their Hagadah ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "other than a metaphorical sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Jewish Hagadoth - legends and illustrations and inferences of an imaginative Oriental people - are not to be taken ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "au pied de la lettre.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " St. Paul obviates the laying of any stress on the mere legend by the qualifying word, \"a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "spiritual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rock.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And that Rock was Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The writings of Philo, and the Alexandrian school of thought in general, had familiarized all Jewish readers with language of this kind. They were accustomed to see types of God, or of the Word (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Logos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in almost every incident of the deliverance from Egypt and the wanderings in the wilderness. Thus in Wisd. 10:15 and Wisdom 11:4 it is Wisdom - another form of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Logos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - who leads and supports the Israelites. The frequent comparison, of God to a Rock in the Old Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "passim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) would render the symbolism more easy, especially as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we find, \"Behold, I [Jehovah] will stand before thee there upon the rock in Horeb.\" 1 Corinthians 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Drink - spiritual drink",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Spiritual, like the meat, in being supernaturally given. The aorist tense denotes something past, yet without limiting it to a particular occasion. They drank at Rephidim (Exodus 17:6), but they continued to drink spiritual drink, for - ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Spiritual, like the meat, in being supernaturally given. The aorist tense denotes something past, yet without limiting it to a particular occasion. They drank at Rephidim (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but they continued to drink spiritual drink, for - ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They drank (ἔπινον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The imperfect tense denoting continued action - throughout their journey.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That spiritual rock",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For that read a. Paul appears to recall a rabbinic tradition that there was a well formed out of the spring in Horeb, which gathered itself up into a rock like a swarm of bees, and followed the people for forty years; sometimes rolling itself, sometimes carried by Miriam, and always addressed by the elders, when they encamped, with the words, \"Spring up, O well!\" Numbers 21:17. Stanley says: \"In accordance with this notion, the Rock of Moses, as pointed out by the local tradition of Mt. Sinai, is not a cleft in the mountain, but a detached fragment of rock about fifteen feet high, with twelve or more fissures in its surface, from which the water is said to have gushed out for the twelve tribes. This local tradition is as old as the Koran, which mentions this very stone.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For that read a. Paul appears to recall a rabbinic tradition that there was a well formed out of the spring in Horeb, which gathered itself up into a rock like a swarm of bees, and followed the people for forty years; sometimes rolling itself, sometimes carried by Miriam, and always addressed by the elders, when they encamped, with the words, \"Spring up, O well!\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Stanley says: \"In accordance with this notion, the Rock of Moses, as pointed out by the local tradition of Mt. Sinai, is not a cleft in the mountain, but a detached fragment of rock about fifteen feet high, with twelve or more fissures in its surface, from which the water is said to have gushed out for the twelve tribes. This local tradition is as old as the Koran, which mentions this very stone.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Was Christ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Showing that he does not believe the legend, but only uses it allegorically. The important point is that Christ the Word was with His people under the old covenant. \"In each case we recognize the mystery of a 'real presence\"' (Ellicott). \"God was in Christ\" here, as from the beginning. The mosaic and the christian economies are only different sides of one dispensation, which is a gospel dispensation throughout. The Jewish sacraments are not mere types of ours. They are identical. ",
        "children": []
      }
    ]
  }
]