[{"num":7,"verse":"1 After the wall once built, is the watch appointed. 6 They that returned from the captivity are numbered."},{"num":1,"verse":"Now when the wall was built, and I had set up the doors, and the porters, and the singers and the Levites were appointed,"},{"num":2,"verse":"Then I commanded my brother Hanani and Hananiah, the prince of the palace in Jerusalem (for he was doubtless a faithful man, and feared God above many)"},{"num":3,"verse":"And I said unto them, Let not the gates of Jerusalem be opened, until the heat of the sun: and while they stand by, let them shut the doors, and make them fast: and I appointed wards of the inhabitants of Jerusalem, everyone in his ward, and everyone over against his house."},{"num":4,"verse":"Now the city was large and great, but the people were few therein, and the houses were not built."},{"num":5,"verse":"And my God put into mine heart, and I gathered the princes, and the rulers, and the people, to count their genealogies: and I found a book of the genealogy of them, which came up at the first, and found written therein,"},{"num":6,"verse":"These are the sons of the province that came up from the captivity that was carried away (whom Nebuchadnezzar king of Babel had carried away) and they returned to Jerusalem and to Judah, every one unto his city."},{"num":7,"verse":"They which came with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahamani, Mordecai, Bilshan, Mispereth, Bigvai, Nehum, Baanah. This is the number of the men of the people of Israel."},{"num":8,"verse":"The sons of Parosh, two thousand an hundred seventy and two."},{"num":9,"verse":"The sons of Shephatiah, three hundred seventy and two."},{"num":10,"verse":"The sons of Arah, six hundred fifty and two."},{"num":11,"verse":"The sons of Pahath-Moab of the sons of Jeshua and Joab, two thousand eight hundred and eighteen."},{"num":12,"verse":"The sons of Elam, a thousand two hundred fifty and four."},{"num":13,"verse":"The sons of Zattu, eight hundred and five and forty."},{"num":14,"verse":"The sons of Zaccai, seven hundred and three-score."},{"num":15,"verse":"The sons of Binnui, six hundred and eight and forty."},{"num":16,"verse":"The sons of Bebai, six hundred and eight and twenty."},{"num":17,"verse":"The sons of Azgad, two thousand three hundred and two and twenty."},{"num":18,"verse":"The sons of Adonikam, six hundred threescore and seven."},{"num":19,"verse":"The sons of Bigvai, two thousand threescore and seven."},{"num":20,"verse":"The sons of Adin, six hundred and five and fifty."},{"num":21,"verse":"The sons of Ater of Hezekiah, ninety and eight."},{"num":22,"verse":"The sons of Hashum, three hundred and eight and twenty."},{"num":23,"verse":"The sons of Bezai, three hundred and four and twenty."},{"num":24,"verse":"The sons of Hariph, an hundred and twelve."},{"num":25,"verse":"The sons of Gibeon, ninety and five."},{"num":26,"verse":"The men of Bethlehem and Netophah, an hundred fourscore and eight."},{"num":27,"verse":"The men of Anathoth, an hundred and eight and twenty."},{"num":28,"verse":"The men of Beth Azmaveth, two and forty."},{"num":29,"verse":"The men of Kirjath Jearim, Chephirah, and Beeroth, seven hundred and three and forty."},{"num":30,"verse":"The men of Ramah and Geba, six hundred and one and twenty."},{"num":31,"verse":"The men of Michmas, an hundred and two and twenty."},{"num":32,"verse":"The men of Bethel and Ai, an hundred and three and twenty."},{"num":33,"verse":"The men of the other Nebo, two and fifty."},{"num":34,"verse":"The sons of the other Elam, a thousand two hundred and four and fifty."},{"num":35,"verse":"The sons of Harim, three hundred and twenty."},{"num":36,"verse":"The sons of Jericho, three hundred and five and forty."},{"num":37,"verse":"The sons of Lod, Hadid and Ono, seven hundred and one and twenty."},{"num":38,"verse":"The sons of Senaah, three thousand nine hundred and thirty."},{"num":39,"verse":"The Priests: the sons of Jedaiah of the house of Jeshua, nine hundred seventy and three."},{"num":40,"verse":"The sons of Immer, a thousand and two and fifty."},{"num":41,"verse":"The sons of Pashur, a thousand two hundred and seven and forty."},{"num":42,"verse":"The sons of Harim, a thousand and seventeen."},{"num":43,"verse":"¶ The Levites: the sons of Jeshua of Kadmiel, and of the sons of Hodevah, seventy and four."},{"num":44,"verse":"¶ The singers: the children of Asaph, an hundred and eight and forty."},{"num":45,"verse":"The porters: the sons of Shallum, the sons of Ater, the sons of Talmon, the sons of Akkub, the sons of Hatita, the sons of Shobai, an hundred and eight and thirty."},{"num":46,"verse":"¶ The Nethinim: the sons of Ziha, the sons of Hasupha, the sons of Tabbaoth,"},{"num":47,"verse":"The sons of Keros, the sons of Sia, the sons of Padon,"},{"num":48,"verse":"The sons of Lebana, the sons of Hagaba, the sons of Shalmai,"},{"num":49,"verse":"The sons of Hanan, the sons of Giddel, the sons of Gahar,"},{"num":50,"verse":"The sons of Reaiah, the sons of Rezin, the sons of Nekoda,"},{"num":51,"verse":"The sons of Gazzam, the sons of Uzza, the sons of Paseah,"},{"num":52,"verse":"The sons of Besai, the sons of Meunim, the sons of Nephishesim,"},{"num":53,"verse":"The sons of Bakbuk, the sons of Hakupha, the sons of Harhur,"},{"num":54,"verse":"The sons of Bazlith, the sons of Mehida, the sons of Harsha,"},{"num":55,"verse":"The sons of Barkos, the sons of Sisera, the sons of Tamah,"},{"num":56,"verse":"The sons of Neziah, the sons of Hatipha,"},{"num":57,"verse":"The sons of Solomon’s servants, the sons of Sotai, the sons of Sophereth, the sons of Perida,"},{"num":58,"verse":"The sons of Jaala, the sons of Darkon, the sons of Giddel,"},{"num":59,"verse":"The sons of Shephatiah, the sons of Hattil, the sons of Pochereth of Zebaim, the sons of Amon."},{"num":60,"verse":"All the Nethinim, and the sons of Solomon’s servants were three hundred, ninety and two."},{"num":61,"verse":"¶ And these came up from Tel Melah, Tel Harsha, Cherub, Addon, and Immer: but they could not show their father’s house, nor their seed, or if they were of Israel."},{"num":62,"verse":"The sons of Delaiah: the sons of Tobiah, the sons of Nekoda, six hundred and two and forty."},{"num":63,"verse":"And of the Priests: the sons of Habaiah, the sons of Koz, the sons of Barzillai, which took one of the daughters of Barzillai the Gileadite to wife, and was named after their name."},{"num":64,"verse":"These sought their writing of the genealogies, but it was not found: therefore they were put from the Priesthood."},{"num":65,"verse":"And the Tirshatha said unto them, that they should not eat of the most holy, till there rose up a Priest with Urim and Thummim."},{"num":66,"verse":"All the Congregation together was two and forty thousand, three hundred and threescore,"},{"num":67,"verse":"Besides their servants and their maids, which were seven thousand, three hundred and seven and thirty: and they had two hundred and five and forty singing men and singing women."},{"num":68,"verse":"Their horses were seven hundred and six and thirty, and their mules two hundred and five and forty."},{"num":69,"verse":"The camels four hundred and five and thirty, and six thousand seven hundred and twenty asses."},{"num":70,"verse":"And certain of the chief fathers gave unto the work. The Tirshatha gave to the treasure, a thousand drams of gold, fifty basins, five hundred and thirty Priest’s garments."},{"num":71,"verse":"And some of the chief fathers gave unto the treasure of the work, twenty thousand drams of gold, and two thousand and two hundred pieces of silver."},{"num":72,"verse":"And the rest of the people gave twenty thousand drams of gold, and two thousand pieces of silver, and threescore and seven Priest’s garments."},{"num":73,"verse":"And the Priests, and the Levites, and the porters and the singers, and the rest of the people and the Nethinim, and all Israel dwelt in their cities: and when the seventh month came, the children of Israel were in their cities."}]