[{"num":7,"verse":"¶ Now it came to pass, when the wall was built and I had set up the doors and the porters and the singers and the Levites were appointed,"},{"num":2,"verse":"that I commanded my brother Hanani, and Hananiah, the prince of the palace in Jerusalem (for he was as a man of truth and feared God above many);"},{"num":3,"verse":"and I said unto them, Do not let the gates of Jerusalem be opened until the sun is hot and even with the guards present, let them shut the doors and bar them. And appoint guards of the inhabitants of Jerusalem, each one in his watch and each one to be in front of his house."},{"num":4,"verse":"Now the city was large and great, but there were few people in it, and the houses were not rebuilt."},{"num":5,"verse":"¶ And my God put it into my heart to gather together the principals and the rulers and the people, that they might be reckoned by genealogy. And I found the register of the genealogy of those who had come up before and found written therein:"},{"num":6,"verse":"These are the sons of the province, that came up out of the captivity, of those that had been carried away, whom Nebuchadnezzar, the king of Babylon, had carried away and returned to Jerusalem and to Judah, each one unto his city,"},{"num":7,"verse":"who came with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahamani, Mordecai, Bilshan, Mispereth, Bigvai, Nehum, and Baanah. The number of the men of the people of Israel:"},{"num":8,"verse":"The sons of Parosh, two thousand one hundred and seventy-two."},{"num":9,"verse":"The sons of Shephatiah, three hundred and seventy-two."},{"num":10,"verse":"The sons of Arah, six hundred and fifty-two."},{"num":11,"verse":"The sons of Pahathmoab, of the sons of Jeshua and Joab, two thousand eight hundred and eighteen."},{"num":12,"verse":"The sons of Elam, one thousand two hundred and fifty-four."},{"num":13,"verse":"The sons of Zattu, eight hundred and forty-five."},{"num":14,"verse":"The sons of Zaccai, seven hundred and sixty."},{"num":15,"verse":"The sons of Binnui, six hundred and forty-eight."},{"num":16,"verse":"The sons of Bebai, six hundred and twenty-eight."},{"num":17,"verse":"The sons of Azgad, two thousand three hundred and twenty-two."},{"num":18,"verse":"The sons of Adonikam, six hundred and seventy-seven."},{"num":19,"verse":"The sons of Bigvai, two thousand sixty-seven."},{"num":20,"verse":"The sons of Adin, six hundred and fifty-five."},{"num":21,"verse":"The sons of Ater of Hezekiah, ninety-eight."},{"num":22,"verse":"The sons of Hashum, three hundred and twenty-eight."},{"num":23,"verse":"The sons of Bezai, three hundred and twenty-four."},{"num":24,"verse":"The sons of Hariph, one hundred and twelve."},{"num":25,"verse":"The sons of Gibeon, ninety-five."},{"num":26,"verse":"The men of Bethlehem and Netophah, one hundred and eighty-eight."},{"num":27,"verse":"The men of Anathoth, one hundred and twenty-eight."},{"num":28,"verse":"The men of Bethazmaveth, forty-two."},{"num":29,"verse":"The men of Kirjathjearim, Chephirah, and Beeroth, seven hundred and forty-three."},{"num":30,"verse":"The men of Ramah and of Geba, six hundred and twenty-one."},{"num":31,"verse":"The men of Michmas, one hundred and twenty-two."},{"num":32,"verse":"The men of Bethel and Ai, one hundred and twenty-three."},{"num":33,"verse":"The men of the other Nebo, fifty-two."},{"num":34,"verse":"The sons of the other Elam, one thousand two hundred and fifty-four."},{"num":35,"verse":"The sons of Harim, three hundred and twenty."},{"num":36,"verse":"The sons of Jericho, three hundred and forty-five."},{"num":37,"verse":"The sons of Lod, Hadid, and Ono, seven hundred and twenty-one."},{"num":38,"verse":"The sons of Senaah, three thousand nine hundred and thirty."},{"num":39,"verse":"The priests: the sons of Jedaiah, of the house of Jeshua, nine hundred and seventy-three."},{"num":40,"verse":"The sons of Immer, one thousand fifty-two."},{"num":41,"verse":"The sons of Pashur, one thousand two hundred and forty-seven."},{"num":42,"verse":"The sons of Harim, one thousand and seventeen."},{"num":43,"verse":"The Levites: the sons of Jeshua, of Kadmiel, and of the sons of Hodevah, seventy-four."},{"num":44,"verse":"The singers: the sons of Asaph, one hundred and forty-eight."},{"num":45,"verse":"The porters: the sons of Shallum, the sons of Ater, the sons of Talmon, the sons of Akkub, the sons of Hatita, the sons of Shobai, one hundred thirty-eight."},{"num":46,"verse":"The Nethinims: the sons of Ziha, the sons of Hashupha, the sons of Tabbaoth,"},{"num":47,"verse":"the sons of Keros, the sons of Sia, the sons of Padon,"},{"num":48,"verse":"the sons of Lebana, the sons of Hagaba, the sons of Shalmai,"},{"num":49,"verse":"the sons of Hanan, the sons of Giddel, the sons of Gahar,"},{"num":50,"verse":"the sons of Reaiah, the sons of Rezin, the sons of Nekoda,"},{"num":51,"verse":"the sons of Gazzam, the sons of Uzza, the sons of Phaseah,"},{"num":52,"verse":"the sons of Besai, the sons of Meunim, the sons of Nephishesim,"},{"num":53,"verse":"the sons of Bakbuk, the sons of Hakupha, the sons of Harhur,"},{"num":54,"verse":"the sons of Bazlith, the sons of Mehida, the sons of Harsha,"},{"num":55,"verse":"the sons of Barkos, the sons of Sisera, the sons of Tamah,"},{"num":56,"verse":"the sons of Neziah, the sons of Hatipha."},{"num":57,"verse":"The sons of Solomon’s slaves: the sons of Sotai, the sons of Sophereth, the sons of Perida,"},{"num":58,"verse":"the sons of Jaala, the sons of Darkon, the sons of Giddel,"},{"num":59,"verse":"the sons of Shephatiah, the sons of Hattil, the sons of Pochereth of Zebaim, the sons of Amon."},{"num":60,"verse":"All the Nethinims, and the sons of Solomon’s slaves, were three hundred and ninety-two."},{"num":61,"verse":"And these were they which came up also from Telmelah, Telharesha, Cherub, Addon, and Immer; but they could not show their father’s house, nor their seed, whether they were of Israel."},{"num":62,"verse":"The sons of Delaiah, the sons of Tobiah, the sons of Nekoda, six hundred and forty-two."},{"num":63,"verse":"And of the priests: the sons of Habaiah, the sons of Koz, the sons of Barzillai, who took one of the daughters of Barzillai the Gileadite to wife, and was called after their name."},{"num":64,"verse":"These sought their register among those that were reckoned by genealogy, but it was not found; therefore, were they, as polluted, put from the priesthood."},{"num":65,"verse":"And the Tirshatha said unto them that they should not eat of the most holy things until there stood up a priest with Urim and Thummim."},{"num":66,"verse":"The whole congregation united as one man was forty-two thousand three hundred and sixty,"},{"num":67,"verse":"not counting their menslaves and their maidslaves, of whom there were seven thousand three hundred and thirty-seven; and they had two hundred and forty-five men and women singers."},{"num":68,"verse":"Their horses, seven hundred and thirty-six; their mules, two hundred and forty-five:"},{"num":69,"verse":"Their camels, four hundred and thirty-five; their asses, six thousand seven hundred and twenty."},{"num":70,"verse":"And some of the princes of the families gave unto the work. The Tirshatha gave for the treasure one thousand drams of gold, fifty basins, and five hundred and thirty priests’ garments."},{"num":71,"verse":"And the princes of the families gave for the treasure of the work twenty thousand drams of gold and two thousand two hundred pounds of silver."},{"num":72,"verse":"And that which the rest of the people gave was twenty thousand drams of gold and two thousand pounds of silver and sixty-seven priests’ garments."},{"num":73,"verse":"So the priests and the Levites and the porters and the singers and those of the people and the Nethinims and all Israel dwelt in their cities; and when the seventh month came, the sons of Israel were in their cities."}]