[{"num":7,"verse":"When the wall was built and I had set up the doors, and the gate-keepers and singers and Levites were chosen, "},{"num":2,"verse":"I gave my brother Hanani, and Hanaiah the captain of the strong place, the work of watching over Jerusalem. For he was a faithful man and honored God with fear more than many. "},{"num":3,"verse":"I said to them, “Do not let the gates of Jerusalem be opened until the sun is hot. And while the soldiers are on duty watching the gates, let them shut and lock the doors. Choose soldiers from the people of Jerusalem, each one for the place he is to keep watch, and each in front of his own house.”"},{"header":"The Jews Return to Jerusalem"},{"num":4,"verse":"Now the city was wide and large, but the people in it were few and the houses were not built. "},{"num":5,"verse":"Then my God put it into my heart to gather together the rulers, the leaders and the people to have their names written down by families. And I found the book of the family names of those who came up first. This is what I found written in it: "},{"num":6,"verse":"These are the people who left the land of Babylon and returned to Jerusalem and Judah, each to his own city. Their families had been taken away to Babylon by Nebuchadnezzar the king of Babylon. "},{"num":7,"verse":"These people returned with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahamani, Mordecai, Bilshan, Mispereth, Bigvai, Nehum, and Baanah."},{"num":8,"verse":"2,172 sons of Parosh, "},{"num":9,"verse":"372 sons of Shephatiah, "},{"num":10,"verse":"652 sons of Arah, "},{"num":11,"verse":"2,818 sons of Pahath-moab, of the sons of Jeshua and Joab, "},{"num":12,"verse":"1,254 sons of Elam, "},{"num":13,"verse":"845 sons of Zattu, "},{"num":14,"verse":"760 sons of Zaccai, "},{"num":15,"verse":"648 sons of Binnui, "},{"num":16,"verse":"628 sons of Bebai, "},{"num":17,"verse":"2,322 sons of Azgad, "},{"num":18,"verse":"667 sons of Adonikam, "},{"num":19,"verse":"2,067 sons of Bigvai, "},{"num":20,"verse":"655 sons of Adin, "},{"num":21,"verse":"98 sons of Ater, of Hezekiah, "},{"num":22,"verse":"328 sons of Hashum, "},{"num":23,"verse":"324 sons of Bezai, "},{"num":24,"verse":"112 sons of Hariph, "},{"num":25,"verse":"95 sons of Gibeon, "},{"num":26,"verse":"188 sons of Bethlehem and Netophah, "},{"num":27,"verse":"128 sons of Anathoth, "},{"num":28,"verse":"42 sons of Beth-azmaveth, "},{"num":29,"verse":"743 sons of Kiriath-jearim, Chephirah, and Beeroth, "},{"num":30,"verse":"621 sons of Ramah and Geba, "},{"num":31,"verse":"122 sons of Michmas, "},{"num":32,"verse":"123 sons of Bethel and Ai, "},{"num":33,"verse":"52 sons of the other Nebo, "},{"num":34,"verse":"1,254 sons of the other Elam, "},{"num":35,"verse":"320 sons of Harim, "},{"num":36,"verse":"345 sons of Jericho, "},{"num":37,"verse":"721 sons of Lod, Hadid, and Ono, "},{"num":38,"verse":"and 3,930 sons of Senaah."},{"num":39,"verse":"The religious leaders: 973 sons of Jedaiah of the house of Jeshua, "},{"num":40,"verse":"1,052 sons of Immer, "},{"num":41,"verse":"1,247 sons of Pashhur, "},{"num":42,"verse":"1,017 sons of Harim."},{"num":43,"verse":"The Levites: 74 sons of Jeshua, of Kadmiel, of the sons of Hodevah. "},{"num":44,"verse":"The singers: 148 sons of Asaph. "},{"num":45,"verse":"The gate-keepers: 138 sons of Shallum, of Ater, of Talmon, of Akkub, of Hatita, and of Shobai."},{"num":46,"verse":"The servants of the house of God: the sons of Ziha, the sons of Hasupha, the sons of Tabbaoth, "},{"num":47,"verse":"the sons of Keros, the sons of Sia, the sons of Padon, "},{"num":48,"verse":"the sons of Lebana, the sons of Hagaba, the sons of Shalmai, "},{"num":49,"verse":"the sons of Hanan, the sons of Giddel, the sons of Gahar, "},{"num":50,"verse":"the sons of Reaiah, the sons of Rezin, the sons of Nekoda, "},{"num":51,"verse":"the sons of Gazzam, the sons of Uzza, the sons of Paseah, "},{"num":52,"verse":"the sons of Besai, the sons of Meunim, the sons of Nephushesim, "},{"num":53,"verse":"the sons of Bakbuk, the sons of Hakupha, the sons of Harhur, "},{"num":54,"verse":"the sons of Bazlith, the sons of Mehida, the sons of Harsha, "},{"num":55,"verse":"the sons of Barkos, the sons of Sisera, the sons of Temah, "},{"num":56,"verse":"the sons of Neziah, and the sons of Hatipha."},{"num":57,"verse":"The sons of Solomon’s servants: the sons of Sotai, the sons of Sophereth, the sons of Perida, "},{"num":58,"verse":"the sons of Jaala, the sons of Darkon, the sons of Giddel, "},{"num":59,"verse":"the sons of Shephatiah, the sons of Hattil, the sons of Pochereth-hazzebaim, and the sons of Amon. "},{"num":60,"verse":"All the servants in the house of God and the sons of Solomon’s servants were 392."},{"num":61,"verse":"Now these were the men who came up from Tel-melah, Tel-harsha, Cherub, Addon, and Immer. But they were not able to prove their fathers’ houses or that they were children of Israel: "},{"num":62,"verse":"642 sons of Delaiah, Tobiah, and Nekoda. "},{"num":63,"verse":"And the sons of the religious leaders: the sons of Hobaiah, Hakkoz, and Barzillai, who had married one of the daughters of Barzillai the Gileadite, and was called by their name. "},{"num":64,"verse":"These men looked for their names among the names of all the families, but could not find them. So they were thought of as being unclean, and were not allowed to work as religious leaders. "},{"num":65,"verse":"And the leader told them that they should not eat from the most holy things until a religious leader learned God’s will by the Urim and Thummin."},{"num":66,"verse":"There were 42,360 people in all, "},{"num":67,"verse":"besides the 7,337 men and women servants, and 245 singing men and women. "},{"num":68,"verse":"They had 736 horses, 245 mules, "},{"num":69,"verse":"435 camels, and 6,720 donkeys."},{"num":70,"verse":"Some from among the heads of the family groups gave to the work. The ruler gave 1,000 gold pieces, fifty deep dishes, and 530 sets of clothing for the religious leaders. "},{"num":71,"verse":"And some of the leaders of family groups gave 20,000 gold pieces and 2,200 silver pieces. "},{"num":72,"verse":"The rest of the people gave 20,000 gold pieces, 2,000 silver pieces, and 67 sets of clothing for the religious leaders."},{"num":73,"verse":"Now the religious leaders, the Levites, the gate-keepers, the singers, some of the people, the servants in the house of the Lord, and all Israel, lived in their cities."}]