[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 55:16-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:16-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As for me, I will call upon God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Let them take what course they please to secure themselves; let violence and strife be their guards, prayer shall be mine. By this I have found deliverance, support, and comfort, and therefore this I will abide by. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord shall save me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "While he destroys them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For whosoever shall call on the name of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in a right manner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be saved, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As they and I differ in the course of our lives, so shall we in our end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Evening and morning, &c., at noon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The three stated times of prayer among the Jews; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will I pray — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is probable this had been his constant practice, and he resolves to continue it, now he is in his distress. And he could come more boldly, and with greater confidence, to God in his trouble, inasmuch as he did not then first begin to call upon him, but it was what he had long constantly, practised and especially in all his difficulties, dangers, and distresses he had been accustomed to have recourse to him his strong helper, and that not in vain. “They,” says Henry, “that think three meals a day little enough for the body, ought much more to think three solemn prayers a day little enough for the soul, and to count it a pleasure, not a task. As it is fit in the morning we should begin the day with God, and in the evening close it with God; so it is fit that, in the midst of the day, we should retire a while to converse with him. It was Daniel’s practice to pray three times a day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And noon was one of Peter’s hours of prayer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Let us not be weary of praying often, for God is not weary of hearing.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And cry aloud — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Pray fervently. The former word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אשׂיחה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "asicha, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will pray, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "means also, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will meditate, speak with my heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "converse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Then we pray aright when we pray with all that is within us; when we think first, and then pray; for the true nature of prayer is lifting up our hearts to God. David, having meditated, will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cry, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yea, will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cry aloud: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the fervour of his spirit in prayer shall be expressed, and yet more excited by the intenseness and earnestness of his voice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he shall hear my voice — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Lord shall hear and answer my prayer, by granting my petitions, and will not blame me, either for coming too often, or being too earnest and importunate. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "55:16-23 In every trial let us call upon the Lord, and he will save us. He shall hear us, and not blame us for coming too often; the oftener the more welcome. David had thought all were against him; but now he sees there were many with him, more than he supposed; and the glory of this he gives to God, for it is he that raises us up friends, and makes them faithful to us. There are more true Christians, and believers have more real friends, than in their gloomy hours they suppose. His enemies should be reckoned with, and brought down; they could not ease themselves of their fears, as David could, by faith in God. Mortal men, though ever so high and strong, will easily be crushed by an eternal God. Those who are not reclaimed by the rod of affliction, will certainly be brought down to the pit of destruction. The burden of afflictions is very heavy, especially when attended with the temptations of Satan; there is also the burden of sin and corruption. The only relief under it is, to look to Christ, who bore it. Whatever it is that thou desirest God should give thee, leave it to him to give it in his own way and time. Care is a burden, it makes the heart stoop. We must commit our ways and works to the Lord; let him do as seemeth him good, and let us be satisfied. To cast our burden upon God, is to rest upon his providence and promise. And if we do so, he will carry us in the arms of his power, as a nurse carries a child; and will strengthen our spirits by his Spirit, so that they shall sustain the trial. He will never suffer the righteous to be moved; to be so shaken by any troubles, as to quit their duty to God, or their comfort in him. He will not suffer them to be utterly cast down. He, who bore the burden of our sorrows, desires us to leave to him to bear the burden of our cares, that, as he knows what is best for us, he may provide it accordingly. Why do not we trust Christ to govern the world which he redeemed?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As for me, I will call upon God - That is, I have no other refuge in my troubles, yet I can go to him, and pour out all the desires of my heart before him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the Lord shall save me - This expresses strong confidence. On the supposition that the psalm refers to the rebellion of Absalom, David was driven from his home, and his throne, and from the house of God - a poor exile, forsaken by nearly all. But his faith did not fail. He confided in God, and believed that He was able to effect his deliverance, and that He would do it. Rarely can we be placed in circumstances so trying and discouraging as were those of David; never should we, in any circumstances, fall to believe, as he did, that God can deliver us, and that, if we are his friends, we shall be ultimately safe. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the Lord shall save me - This expresses strong confidence. On the supposition that the psalm refers to the rebellion of Absalom, David was driven from his home, and his throne, and from the house of God - a poor exile, forsaken by nearly all. But his faith did not fail. He confided in God, and believed that He was able to effect his deliverance, and that He would do it. Rarely can we be placed in circumstances so trying and discouraging as were those of David; never should we, in any circumstances, fall to believe, as he did, that God can deliver us, and that, if we are his friends, we shall be ultimately safe. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16-18. God answers his constant and repeated prayers.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16 As for me, I will call upon God; and the Lord shall save me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 Evening, and morning, and at noon, will I pray, and cry aloud: and he shall hear my voice.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 He hath delivered my soul in peace from the battle that was against me: for there were many with me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19 God shall hear, and afflict them, even he that abideth of old. Selah. Because they have no changes, therefore they fear not God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 55:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"As for me, I will call upon God.\" The Psalmist would not endeavour to meet the plots of his adversaries by counterplots, nor imitate their incessant violence, but in direct opposition to their godless behaviour would continually resort to his God. Thus Jesus did, and it has been the wisdom of all believers to do the same. As this exemplifies the contrast of their character, so it will foretell the contrast of their end - the righteous shall ascend to their God, the wicked shall sink to ruin. \"And the Lord shall save me.\" Jehovah will fulfil my desire, and glorify himself to my deliverance. The Psalmist is quite sure. He knows that he will pray, and is equally clear that he will be heard. The covenant name is the pledge of the covenant promise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 55:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Evening, and morning, and at noon, will I pray.\" Often, but none too often. Seasons of great need call for frequent seasons of devotion. The three periods chosen are most fitting; to begin, continue, and end the day with God is supreme wisdom. Where time has naturally set up a boundary, there let us set up an altar-stone. The Psalmist means that he will always pray; he will run a line of prayer right along the day and track the sun with his petitions. Day and night he saw his enemies busy (Psalm 55:10), and therefore he would meet their activity by continuous prayer. \"And cry aloud.\" He would give a tongue to his complaint; he would be very earnest in his pleas with heaven. Some cry aloud who never say a word. It is the bell of the heart that rings loudest in heaven. Some read it, \"I will muse and murmur;\" deep heart-thoughts should be attended with inarticulate but vehement utterances of grief. Blessed be God, moaning is translatable in heaven. A father's heart reads a child's heart. \"And he shall hear my voice.\" He is confident that he will prevail; he makes no question that he would be heard, he speaks as if already he were answered. When our window is opened towards heaven, the windows of heaven are open to us. Have but a pleading heart and God will have a plenteous hand.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Evening, and morning, and at noon, will I pray.\" Often, but none too often. Seasons of great need call for frequent seasons of devotion. The three periods chosen are most fitting; to begin, continue, and end the day with God is supreme wisdom. Where time has naturally set up a boundary, there let us set up an altar-stone. The Psalmist means that he will always pray; he will run a line of prayer right along the day and track the sun with his petitions. Day and night he saw his enemies busy (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and therefore he would meet their activity by continuous prayer. \"And cry aloud.\" He would give a tongue to his complaint; he would be very earnest in his pleas with heaven. Some cry aloud who never say a word. It is the bell of the heart that rings loudest in heaven. Some read it, \"I will muse and murmur;\" deep heart-thoughts should be attended with inarticulate but vehement utterances of grief. Blessed be God, moaning is translatable in heaven. A father's heart reads a child's heart. \"And he shall hear my voice.\" He is confident that he will prevail; he makes no question that he would be heard, he speaks as if already he were answered. When our window is opened towards heaven, the windows of heaven are open to us. Have but a pleading heart and God will have a plenteous hand.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 55:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:18",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"He hath delivered my soul in peace from the battle that was against me.\" The deliverance has come. Joab has routed the rebels. The Lord has justified the cause of his anointed. Faith sees as well as foresees; to her foresight is sight. He is not only safe but serene, \"delivered in peace\" - peace in his inmost soul. \"For there were many with me;\" many contending against me. Or it may be that he thankfully acknowledges that the Lord raised him up unexpected allies, fetched him succour when he most needed it, and made the friendless monarch once more the head of a great army. The Lord can soon change our condition, and he often does so when our prayers become fervent. The crisis of life is usually the secret place of wrestling. Jabbok makes Jacob a prevailing prince. He who stripped us of all friends to make us see himself in their absence, can give them back again in greater numbers that we may see him more joyfully in the fact of their presence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 55:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:19",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"God shall hear, and afflict them.\" They make a noise as well as I, and God will hear them. The voice of slander, malice, and pride, is not alone heard by those whom it grieves, it reaches to heaven, it penetrates the divine ear, it demands vengeance, and shall have it. God hears and delivers his people, he hears and destroys the wicked. Their cruel jests, their base falsehoods, their cowardly insults, their daring blasphemies are heard, and shall be repaid to them by the eternal Judge. \"Even he that abideth of old.\" He sits in eternity, enthroned judge for evermore; all the prayers of saints and profanities of sinners are before his Judgment-seat, and he will see that justice is done. \"Selah.\" The singer pauses, overwhelmed with awe in the presence of the everlasting God. \"Because they have no changes, therefore they fear not God.\" His own reverential feeling causes him to remember the daring godlessness of the wicked; he feels that his trials have driven him to his God, and he declares that their uninterrupted prosperity was the cause of their living in such neglect of the Most High. It is a very manifest fact that long-continued ease and pleasure are sure to produce the worst influences upon graceless men: though troubles do not convert them, yet the absence of them makes their corrupt nature more readily develop itself. Stagnant water becomes putrid. Summer heat breeds noxious insects. He who is without trouble is often without God. It is a forcible proof of human depravity that man turns the mercy of God into nutriment for sin: the Lord save us from this. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whilst he destroys them. As they and I differ in the courses of our lives, so shall we in our ends. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As for me, I will call upon God,.... Not upon a creature, on idols and images, on angels or saints departed; but upon God, in his time of trouble, for salvation and deliverance from enemies; who is able to save. This is to be understood of calling upon God in prayer; as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " explains it, and the Targum here renders it; though sometimes invocation of the name of God takes in the whole of divine worship; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord shall save me; which confidence was founded partly upon his promise to deliver such that call upon him in the day of trouble, Psalm 50:15; and partly upon his power, whose hand is not shortened that it cannot save. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord shall save me; which confidence was founded partly upon his promise to deliver such that call upon him in the day of trouble, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 50:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and partly upon his power, whose hand is not shortened that it cannot save. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the Word of the Lord shall redeem me.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"the Word of the Lord shall redeem me.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As for me, I will call upon God; and the LORD shall save me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 55:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " the name Jehovah is significant. It is the covenant-God of revelation to Whom he can appeal, and under Whose protection he can rest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "16–18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Psalmist’s assurance that his prayer will be answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "16–23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this division of the Psalm the storm of indignation dies away, and the Psalmist’s trustful confidence revives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 16-23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - In conclusion, the psalmist turns altogether to God, whom he now addresses as \"Jehovah\" (vers. 16, 22), and expresses his confidence that, in answer to his continual prayers (ver. 17), God will come to his aid, will deliver his soul from the machinations of his enemies, and will visit them with \"affliction\" (ver. 19) and \"destruction\" (ver. 23). Still grieved chiefly by the defection of his unfaithful friend, he once more describes the treachery and heinousness of his conduct (vers. 20. 21), before winding up with a word of comfort for all the righteous (ver. 22), and of menace against all the ungodly (ver. 23). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As for me, I will call upon God; and the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Jehovah) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall save me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The call is upon the God known to man by nature as the Almighty Ruler of the universe; the answer is from the covenant God of Israel, the Self-existent One, in whom Israel trusts. The two are different aspects of one and the same Being. Psalm 55:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the second group anger is the prevailing feeling. In the city all kinds of party passions have broken loose; even his bosom friend has taken a part in this hostile rising. The retrospective reference to the confusion of tongues at Babel which is contained in the word פּלּג (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), also in remembrance of בּלל (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), involves the choice of the word בּלּע, which here, after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", denotes a swallowing up, i.e., annihilation by means of confounding and rendering utterly futile. לשׁונם is the object to both imperatives, the second of which is פּלּג (like the pointing usual in connection with a final guttural) for the sake of similarity of sound. Instead of חמס וריב, the pointing is חמס וריב, which is perfectly regular, because the וריב with a conjunctive accent logically hurries on to בּעיר as its supplement.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Certain exceptions, however, exist, inasmuch as ו sometimes remains even in connection with a disjunctive accent, Isaiah 49:4; Jeremiah 40:10; Jeremiah 41:16; and it is pointed ו in connection with a conjunctive in Genesis 45:23; Genesis 46:12; Leviticus 9:3; Micah 2:11; Job 4:16; Ecclesiastes 4:8.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Certain exceptions, however, exist, inasmuch as ו sometimes remains even in connection with a disjunctive accent, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 41:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it is pointed ו in connection with a conjunctive in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 4:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The subjects to Psalm 55:11 are not violence and strife (Hengstenberg, Hitzig), for it is rather a comical idea to make these personified run round about upon the city walls; but (cf. Psalm 59:7, Psalm 59:15) the Absalomites, and in fact the spies who incessantly watch the movements of David and his followers, and who to this end roam about upon the heights of the city. The narrative in 2 Samuel 15 shows how passively David looked on at this movement, until he abandoned the palace of his own free will and quitted Jerusalem  The espionage in the circuit of the city is contrasted with the movements going on within the city itself by the word בּקרב. We are acquainted with but few details of the affair; but we can easily fill in the details for ourselves in accordance with the ambitious, base, and craftily malicious character of Absalom. The assertion that deceit (מרמה) and the extremest madness had taken possession of the city is confirmed in Psalm 55:13 by כּי. It is not open enemies who might have had cause for it that are opposed to him, but faithless friends, and among them that Ahithophel of Giloh, the scum of perfidious ingratitude. The futures ואשּׂא and ואסּתר are used as subjunctives, and ו is equivalent to alioqui, as in Psalm 51:18, cf. Job 6:14. He tells him to his face, to his shame, the relationship in which he had stood to him whom he now betrays. Psalm 55:14 is not to be rendered: and thou art, etc., but: and thou (who dost act thus) wast, etc.; for it is only because the principal clause has a retrospective meaning that the futures נמתּיק and נהלּך describe what was a custom in the past. The expression is designedly אנושׁ כּערכּי and not אישׁ כערכי; David does not make him feel his kingly eminence, but places himself in the relation to him of man to man, putting him on the same level with himself and treating him as his equal. The suffix of כערכי is in this instance not subjective as in the כערכך of the law respecting the asham or trespass-offering: according to my estimation, but objectively: equal to the worth at which I am estimated, that is to say, equally valued with myself. What heart-piercing significance this word obtains when found in the mouth of the second David, who, although the Son of God and peerless King, nevertheless entered into the most intimate human relationship as the Son of man to His disciples, and among them to that Iscariot! אלּוּף from אלף, Arabic alifa, to be accustomed to anything, assuescere, signifies one attached to or devoted to any one; and מידּא, according to the Hebrew meaning of the verb ידע, an intimate acquaintance. The first of the relative clauses in Psalm 55:15 describes their confidential private intercourse; the second the unrestrained manifestation of it in public. סוד here, as in Job 19:19 (vid., supra on Psalm 25:14). המתּיק סוד, to make friendly intercourse sweet, is equivalent to cherishing it. רגשׁ stands over against סוד, just like סוד, secret counsel, and רגשׁה, loud tumult, in Psalm 64:3. Here רגשׁ is just the same as that which the Korahitic poet calls המון חוגג in Psalm 42:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The subjects to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are not violence and strife (Hengstenberg, Hitzig), for it is rather a comical idea to make these personified run round about upon the city walls; but (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the Absalomites, and in fact the spies who incessantly watch the movements of David and his followers, and who to this end roam about upon the heights of the city. The narrative in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shows how passively David looked on at this movement, until he abandoned the palace of his own free will and quitted Jerusalem  The espionage in the circuit of the city is contrasted with the movements going on within the city itself by the word בּקרב. We are acquainted with but few details of the affair; but we can easily fill in the details for ourselves in accordance with the ambitious, base, and craftily malicious character of Absalom. The assertion that deceit (מרמה) and the extremest madness had taken possession of the city is confirmed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by כּי. It is not open enemies who might have had cause for it that are opposed to him, but faithless friends, and among them that Ahithophel of Giloh, the scum of perfidious ingratitude. The futures ואשּׂא and ואסּתר are used as subjunctives, and ו is equivalent to alioqui, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He tells him to his face, to his shame, the relationship in which he had stood to him whom he now betrays. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not to be rendered: and thou art, etc., but: and thou (who dost act thus) wast, etc.; for it is only because the principal clause has a retrospective meaning that the futures נמתּיק and נהלּך describe what was a custom in the past. The expression is designedly אנושׁ כּערכּי and not אישׁ כערכי; David does not make him feel his kingly eminence, but places himself in the relation to him of man to man, putting him on the same level with himself and treating him as his equal. The suffix of כערכי is in this instance not subjective as in the כערכך of the law respecting the asham or trespass-offering: according to my estimation, but objectively: equal to the worth at which I am estimated, that is to say, equally valued with myself. What heart-piercing significance this word obtains when found in the mouth of the second David, who, although the Son of God and peerless King, nevertheless entered into the most intimate human relationship as the Son of man to His disciples, and among them to that Iscariot! אלּוּף from אלף, Arabic alifa, to be accustomed to anything, assuescere, signifies one attached to or devoted to any one; and מידּא, according to the Hebrew meaning of the verb ידע, an intimate acquaintance. The first of the relative clauses in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " describes their confidential private intercourse; the second the unrestrained manifestation of it in public. סוד here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (vid., supra on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). המתּיק סוד, to make friendly intercourse sweet, is equivalent to cherishing it. רגשׁ stands over against סוד, just like סוד, secret counsel, and רגשׁה, loud tumult, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 64:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here רגשׁ is just the same as that which the Korahitic poet calls המון חוגג in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the face of the faithless friends who has become the head of the Absalomite faction David now breaks out, in Psalm 55:16, into fearful imprecations. The Chethb is ישׁימות, desolationes (super eos); but this word occurs only in the name of a place (\"House of desolations\"), and does not well suit such direct reference to persons. On the other hand, the Ker ישּׁיאמות, let death ensnare or impose upon them, gives a sense that is not to be objected to; it is a pregnant expression, equivalent to: let death come upon them unexpectedly. To this ישּׁיא corresponds the חיּים of the second imprecation: let them go down alive into Hades (שׁאול, perhaps originally שׁאולה, the ה of which may have been lost beside the ח that follows), i.e., like the company of Korah, while their life is yet vigorous, that is to say, let them die a sudden, violent death. The drawing together of the decipiat (opprimat) mors into one word is the result of the ancient scriptio continua and of the defective mode of writing, ישּׁי, like יני, Psalm 141:5, אבי, 1 Kings 21:29. Bttcher renders it differently: let death crash in upon them; but the future form ישּׁי  equals  ישׁאה from שׁאה  equals  שׁאי is an imaginary one, which cannot be supported by Numbers 21:30. Hitzig renders it: let death benumb them (ישּׁים); but this gives an inconceivable figure, with the turgidity of which the trepidantes Manes in Virgil, Aenid viii. 246, do not admit of comparison. In the confirmation, Psalm 55:16, בּמגוּרם, together with the בּקרבּם which follows, does not pretend to be any advance in the thought, whether מגור be rendered a settlement, dwelling, παροικία (lxx, Targum), or an assembly (Aquila, Symmachus, Jerome). Hence Hitzig's rendering: in their shrine, in their breast ( equals  ἐν τῷ θησαυρῷ τῆς καρδίας αὐτῶν, Luke 6:45), מגוּרם being short for מגוּרתם in accordance with the love of contraction which prevails in poetry (on Psalm 25:5). But had the poet intended to use this figure he would have written בּמגוּרת קרבם, and is not the assertion that wickedness is among them, that it is at home in them, really a climax? The change of the names of God in Psalm 55:17 is significant. He calls upon Him who is exalted above the world, and He who mercifully interposes in the history of the world helps him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the face of the faithless friends who has become the head of the Absalomite faction David now breaks out, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", into fearful imprecations. The Chethb is ישׁימות, desolationes (super eos); but this word occurs only in the name of a place (\"House of desolations\"), and does not well suit such direct reference to persons. On the other hand, the Ker ישּׁיאמות, let death ensnare or impose upon them, gives a sense that is not to be objected to; it is a pregnant expression, equivalent to: let death come upon them unexpectedly. To this ישּׁיא corresponds the חיּים of the second imprecation: let them go down alive into Hades (שׁאול, perhaps originally שׁאולה, the ה of which may have been lost beside the ח that follows), i.e., like the company of Korah, while their life is yet vigorous, that is to say, let them die a sudden, violent death. The drawing together of the decipiat (opprimat) mors into one word is the result of the ancient scriptio continua and of the defective mode of writing, ישּׁי, like יני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", אבי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Bttcher renders it differently: let death crash in upon them; but the future form ישּׁי  equals  ישׁאה from שׁאה  equals  שׁאי is an imaginary one, which cannot be supported by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hitzig renders it: let death benumb them (ישּׁים); but this gives an inconceivable figure, with the turgidity of which the trepidantes Manes in Virgil, Aenid viii. 246, do not admit of comparison. In the confirmation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", בּמגוּרם, together with the בּקרבּם which follows, does not pretend to be any advance in the thought, whether מגור be rendered a settlement, dwelling, παροικία (lxx, Targum), or an assembly (Aquila, Symmachus, Jerome). Hence Hitzig's rendering: in their shrine, in their breast ( equals  ἐν τῷ θησαυρῷ τῆς καρδίας αὐτῶν, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 6:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), מגוּרם being short for מגוּרתם in accordance with the love of contraction which prevails in poetry (on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But had the poet intended to use this figure he would have written בּמגוּרת קרבם, and is not the assertion that wickedness is among them, that it is at home in them, really a climax? The change of the names of God in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is significant. He calls upon Him who is exalted above the world, and He who mercifully interposes in the history of the world helps him. ",
            "children": []
          }
        ]
      }
    ]
  }
]