[{"header":"Immorality Rebuked"},{"num":5,"verse":"It is actually reported [everywhere] that there is sexual immorality among you, a kind of immorality that is condemned even among the [unbelieving] Gentiles: that someone has [an intimate relationship with] his father’s wife. "},{"num":2,"verse":"And you are proud and arrogant! You should have mourned in shame so that the man who has done this [disgraceful] thing would be removed from your fellowship!"},{"num":3,"verse":"For I, though absent [from you] in body but present in spirit, have already passed judgment on him who has committed this [act], as if I were present. "},{"num":4,"verse":"In the name of our Lord Jesus, when you are assembled, and I am with you in spirit, with the power of our Lord Jesus, "},{"num":5,"verse":"you are to hand over this man to Satan for the destruction of his body, so that his spirit may be saved in the day of the Lord Jesus."},{"num":6,"verse":"Your boasting [over the supposed spirituality of your church] is not good [indeed, it is vulgar and inappropriate]. Do you not know that [just] a little leaven ferments the whole batch [of dough, just as a little sin corrupts a person or an entire church]? "},{"num":7,"verse":"Clean out the old leaven so that you may be a new batch, just as you are, still unleavened. For Christ our Passover Lamb has been sacrificed. "},{"num":8,"verse":"Therefore, let us celebrate the feast, not with old leaven, nor with leaven of vice and malice and wickedness, but with the unleavened bread of sincerity and [untainted] truth."},{"num":9,"verse":"I wrote you in my [previous] letter not to associate with [sexually] immoral people— "},{"num":10,"verse":"not meaning the immoral people of this world, or the greedy ones and swindlers, or idolaters, for then you would have to get out of the world and human society altogether! "},{"num":11,"verse":"But actually, I have written to you not to associate with any so-called [Christian] brother if he is sexually immoral or greedy, or is an idolater [devoted to anything that takes the place of God], or is a reviler [who insults or slanders or otherwise verbally abuses others], or is a drunkard or a swindler—you must not so much as eat with such a person. "},{"num":12,"verse":"For what business is it of mine to judge outsiders (non-believers)? Do you not judge those who are within the church [to protect the church as the situation requires]? "},{"num":13,"verse":"God alone sits in judgment on those who are outside [the faith]. Remove the wicked one from among you [expel him from your church]."}]