[{"header":"Sin in the Church"},{"num":5,"verse":"Someone has told me about a sex sin among you. It is so bad that even the people who do not know God would not do it. I have been told that one of the men is living with his father’s wife as if she were his wife. "},{"num":2,"verse":"Instead of being sorry, you are proud of yourselves. The man who is living like that should be sent away from you. "},{"num":3,"verse":"I am far from you. Even if I am not there, my spirit is with you. I have already said that the man is guilty of this sin. I am saying this as if I were there with you. "},{"num":4,"verse":"Call a meeting of the church. I will be with you in spirit. In the name of the Lord Jesus Christ, and by His power, "},{"num":5,"verse":"hand this person over to the devil. His body is to be destroyed so his spirit may be saved on the day the Lord comes again."},{"num":6,"verse":"It is not good for you to be proud of the way things are going in your church. You know a little yeast makes the whole loaf of bread rise. "},{"num":7,"verse":"Clean out the old yeast. Then you will be new bread with none of the old yeast in you. The Jews killed lambs when they left Egypt. Christ is our lamb. He has already been killed as a gift on the altar to God for us. "},{"num":8,"verse":"Bread with yeast in it is like being full of sin and hate. Let us eat this supper together with bread that has no yeast in it. This bread is pure and true."},{"num":9,"verse":"I told you in my letter not to keep on being with people who do any kind of sex sins. "},{"num":10,"verse":"I was not talking about people doing sex sins who are bad people of this world. I was not talking about people of this world who always want to get more or those who get things in a wrong way or those who worship false gods. To get away from people like that you would have to leave this world! "},{"num":11,"verse":"What I wrote was that you should not keep on being with a person who calls himself a Christian if he does any kind of sex sins. You should not even eat with a person who says he is a Christian but always wants to get more of everything or uses bad language or who gets drunk or gets things in a wrong way. "},{"num":12,"verse":"It is not for me to judge those outside the church. You are to judge those who belong to the church. "},{"num":13,"verse":"God will judge those outside the church. So you must put that sinful person out of your church."}]