[{"num":5,"verse":"Zenut (fornication) is actually reported among you, and such zenut which is not even among the Goyim, that one of you Corinthians has the isha (wife) of his abba [VAYIKRA 18:8]."},{"num":2,"verse":"And you have been puffed up with ga’avah (pride). Should you not rather have been filled with agmat nefesh (grief), so that he who has done this would have been taken away from among you?"},{"num":3,"verse":"For I indeed being not present in habasar but being not absent in the Ruach Hakodesh have already, as being present, pronounced the Rebbe, Melech HaMoshiach’s Bet Din mishpat on the one who has done such a thing."},{"num":4,"verse":"In the name of Adoneinu Yehoshua, when you have assembled in your shul (Ya 2:2) and I am with you by the same Ruach Hakodesh along with the gevurat Adoneinu Yehoshua,"},{"num":5,"verse":"You are to transmit and hand over to Hasatan such a person for the churban of the basar (3:16-17), that his neshamah may be spared in the Yom Hashem (AMOS 5:18; MALACHI 3:19; YOEL 2:1-17; TZEFANYAH 1:14-18)."},{"num":6,"verse":"Your boasting is not good. Do you not have da’as that a little chametz all the mixture leavens?"},{"num":7,"verse":"Purge out the old chametz (leavened bread), that you may be issa chadasha (new dough, batzek, deaf dough, having no indication of fermentation), as you are indeed like matzot (unleavened bread). More than that, our Korban Pesach has been sacrificed, Moshiach. [SHEMOT 12:3-6,21]"},{"num":8,"verse":"So let us celebrate Pesach, not with old chametz, nor with the chametz of kavvanah ra’ah (malice) and wickedness, but with matzot of kenut (sincerity) and emes. [SHEMOT 12:14,15; DEVARIM 16:3]"},{"num":9,"verse":"I wrote to you in the iggeret not to mix with those engaging in acts of zenut (fornication),"},{"num":10,"verse":"Not meaning to completely disassociate from the zannayim of the Olam Hazeh or those guilty of chamdanut (greed) and the ones practicing hona’ah (swindling) or those guilty of avodah zarah (idol worship), als (since) in that case you would have to exit the Olam Hazeh."},{"num":11,"verse":"But, now I wrote to you not to mix with any “Ach b’Moshiach” who is a zannay (fornicator) or a kamtzan (miser) or an oved elilim (idolater) or a megadef (reviler) or a shikkor (drunkard) or a shoded (robber); with such a man do not sit at tish (table), do not share betzi’at halechem (breaking of bread)."},{"num":12,"verse":"For what is it to me to sit as a dayan in the Bet Din and then judge ones outside the kehillah? Will your Bet Din not judge the ones within [the kehillah]?"},{"num":13,"verse":"But the outsiders Hashem judges. UVI’ARTA HARA MIKKIR’BECHA \"You must purge the evil from among you\" [DEVARIM 17:7; 19:19; 22:21,24; 24:7]"}]