[{"header":"A horrible sin and a stern remedy"},{"num":1,"verse":"It is actually reported that there is sexual immorality among you, and immorality of a kind that even pagans condemn—a man has apparently taken his father’s wife! Are you still proud of your church? Shouldn’t you be overwhelmed with sorrow and shame? The man who has done such a thing should certainly be expelled from your fellowship!"},{"num":3,"verse":"I know I am not with you physically but I am with you in spirit, and I assure you as solemnly as if I were actually present before your assembly that I have already pronounced judgment in the name of the Lord Jesus on the man who has done this thing, and I do this with full divine authority. My judgment is this: that the man should be left to the mercy of Satan so that while his body will experience the destructive powers of sin his spirit may yet be saved in the day of the Lord Jesus."},{"num":6,"verse":"Your pride in your church is lamentably out of place. Don’t you know how a little yeast can permeate the whole lump? Clear out every bit of the old yeast that you may be new unleavened bread! We Christians have had a Passover lamb sacrificed for us—none other than Christ himself! So let us “keep the feast” with no trace of the yeast of the old life, nor the yeast of vice and wickedness, but with the unleavened bread of unadulterated truth!"},{"num":9,"verse":"In my previous letter I said, “Don’t mix with the immoral.” I didn’t mean, of course, that you were to have no contact at all with the immoral of this world, nor with any cheats or thieves or idolaters—for that would mean going out of the world altogether! But in this letter I tell you not to associate with any professing Christian who is known to be an impure man or a swindler, an idolater, a man with a foul tongue, a drunkard or a thief. My instruction is: “Don’t even eat with such a man.” Those outside the church it is not my business to judge. but surely it is your business to judge those who are inside the church—God alone can judge those who are outside. It is your plain duty to ‘put away from yourselves that wicked person’."}]