[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15-18) A third retrospect follows—the third scene in the sacred drama of Israel’s early fortunes. It sets forth the glory of God’s chosen mountain. A finer passage could hardly be found. The towering ranges of Bashan—Hermon with its snowy peaks—are personified. They become, in the poet’s imagination, envious of the distinction given to the petty heights of Judæa. (Perhaps a similar envy is implied in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 133:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The contrast between the littleness of Palestine and the vast extent of the empires which hung upon its northern and southern skirts, is rarely absent from the minds of the prophets and psalmists. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Here the watchful jealousy with which these powers regarded Israel is represented by the figure of the high mountain ranges watching Zion (see Note below) like hungry beasts of prey ready to spring. And what do they see? The march of God Himself, surrounded by an army of angels, from Sinai to His new abode.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(15) The hill of God is . . .—Better,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(15) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The hill of",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "God is . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Mountain of God, mount Basan;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mountain of peaks, mount Basan.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even if the range of Hermon were not included, the basalt (basanite, probably from the locality) ranges, always rising up before the eyes of those looking eastward from Palestine, must have been doubly impressive from their superior height, and the contrast of their bold and rugged outlines with the monotonous rounded forms of the limestone hills of Judæa. And it is quite possible that, in a poetic allusion, the term “mountains of Bashan” might include all the heights to the eastward of Jordan, stretching southward as well as northward. There would then be an additional propriety in their introduction as jealously watching the march of Israel from Sinai to take possession of the promised land. Why these trans-Jordanic ranges should be styled “mountains of God” has been much discussed. Some explain the term to denote ancient seats of religious worship; others take it simply as a general term expressing grandeur—“a ridge of god-like greatness.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even if the range of Hermon were not included, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "basalt ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "basanite, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "probably from the locality) ranges, always rising up before the eyes of those looking eastward from Palestine, must have been doubly impressive from their superior height, and the contrast of their bold and rugged outlines with the monotonous rounded forms of the limestone hills of Judæa. And it is quite possible that, in a poetic allusion, the term “mountains of Bashan” might include all the heights to the eastward of Jordan, stretching southward as well as northward. There would then be an additional propriety in their introduction as jealously watching the march of Israel from Sinai to take possession of the promised land. Why these trans-Jordanic ranges should be styled “mountains of God” has been much discussed. Some explain the term to denote ancient seats of religious worship; others take it simply as a general term expressing grandeur—“a ridge of god-like greatness.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 68:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The hill of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, Zion, the seat of God’s ark; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is as the hill of Bashan — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Equal, yea, superior to it. Bashan was a rich and fruitful mountain beyond Jordan, called by the LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πιον ορος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fat mountain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ορος τετυρωμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a mountain that yielded much butter and cheese. But Zion had greater advantages, and yielded much better fruits. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A high hill as the hill of Bashan — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Though it be but a low, mean hill, compared with Bashan, in outward appearance, yet it is as high as it, yea, is exalted far above it, through its spiritual privileges, being the place where God’s worship is established, where he is peculiarly present, and where he confers his choicest blessings; in which respect ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the mountain of the Lord’s house ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "established on the top of the mountains, and exalted above the hills. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Dr. Chandler supposes that this and the two following verses were begun to be sung when the ark came in view of mount Zion, the place of its fixed residence for the future, and probably when they began to ascend the hill. And he reads this, as well as the following verse, with an interrogation, conceiving that it makes them appear more suitable to the occasion, and worthy of the genuine spirit of poetry; thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is the hill of Bashan, is the craggy hill of Bashan the hill of God? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As if he had said, Bashan may boast of its proud eminences, its craggy summits, but is this the hill where God will fix his residence?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "68:15-21 The ascension of Christ must here be meant, and thereto it is applied, Eph 4:8. He received as the purchase of his death, the gifts needful for the conversion of sinners, and the salvation of believers. These he continually bestows, even on rebellious men, that the Lord God might dwell among them, as their Friend and Father. He gave gifts to men. Having received power to give eternal life, the Lord Jesus bestows it on as many as were given him, Joh 17:2. Christ came to a rebellious world, not to condemn it, but that through him it might be saved. The glory of Zion's King is, that he is a Saviour and Benefactor to all his willing people, and a consuming fire to all that persist in rebellion against him. So many, so weighty are the gifts of God's bounty, that he may be truly said to load us with them. He will not put us off with present things for a portion, but will be the God of our salvation. The Lord Jesus has authority and power to rescue his people from the dominion of death, by taking away the sting of it from them when they die, and giving them complete victory over it when they rise again. The crown of the head, the chief pride and glory of the enemy, shall be smitten; Christ shall crush the head of the serpent.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The hill of God - The phrase \"the hill of God,\" or the mountain of God, is elsewhere applied in the Scriptures only to Mount Horeb or Sinai ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to Mount Zion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is no reason for supposing that there is a reference here to Mount Horeb or Sinai, as the psalm does not particularly relate to that mountain, and as there is nothing in the psalm to bring that mountain into comparison with other mountains. The allusion is, I think, clearly to Mount Zion; and the idea is, that that mountain, though it was not distinguished for its elevation or grandeur - though it had nothing in itself to claim attention, or to excite wonder - yet, from the fact that it had been selected as the place where God was to be worshipped, had an honor not less than that of the loftiest mountain, or than those which showed forth the divine perfections by their loftiness and sublimity. There is connected with this, also, the idea that, although it might be less defensible by its natural position, yet, because God resided there, it was defended by his presence more certainly than loftier mountains were by their natural strength. It should be remarked, however, that many other interpretations have been given of the passage, but this seems to me to be its natural meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Is as the hill of Bashan - Luther renders this, \"The mount of God is a fruit-bearing hill; a great and fruitbearing mountain.\" On the word Bashan, see the notes at Isaiah 2:13; notes at Isaiah 33:9; notes at Psalm 22:12. Bashan was properly the region beyond Jordan, bounded on the north by Mount Hermon or the Anti-Libanus, and extending south as far as the stream Jabbok, and the mountains of Gilead. The \"hill\" of Bashan, or the \"mountain of Bashan,\" was properly Mount Hermon - the principal mountain pertaining to Bashan. The name Bashan was properly given to the country, and not to the mountain. The mountain referred to - Hermon - is that lofty range which lies on the east of the Jordan, and in the northern part of the country - a range some twelve thousand feet in height. See the notes at Psalm 42:6. It is the most lofty and distinguished mountain in Palestine, and the idea here, as above expressed, is, that Mount Zion, though not so lofty, or not having so much in itself to attract attention, was not less honored, and not less safe, as being the special dwelling-place of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Is as the hill of Bashan - Luther renders this, \"The mount of God is a fruit-bearing hill; a great and fruitbearing mountain.\" On the word Bashan, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Bashan was properly the region beyond Jordan, bounded on the north by Mount Hermon or the Anti-Libanus, and extending south as far as the stream Jabbok, and the mountains of Gilead. The \"hill\" of Bashan, or the \"mountain of Bashan,\" was properly Mount Hermon - the principal mountain pertaining to Bashan. The name Bashan was properly given to the country, and not to the mountain. The mountain referred to - Hermon - is that lofty range which lies on the east of the Jordan, and in the northern part of the country - a range some twelve thousand feet in height. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is the most lofty and distinguished mountain in Palestine, and the idea here, as above expressed, is, that Mount Zion, though not so lofty, or not having so much in itself to attract attention, was not less honored, and not less safe, as being the special dwelling-place of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "An high hill ... - Or rather; a mount of peaks or ridges as Bashan. Mount Hermon was not a single hill, or a detached mountain, but a chain of mountains - a range of lofty peaks or summits. So of Zion. It was by the presence and protection of God what Bashan was by its natural strength and grandeur. Comparatively low and unimportant as Zion was, it had in fact more in it to show what God is, and to constitute safety, than there was in the loftiness and grandeur of Bashan. The latter, though thus lofty and grand, had no \"advantage\" over Zion, but Zion might in every way be compared with that lofty range of hills which, by their natural position, their strength, and their grandeur, showed forth so much the greatness and glory of God. The teaching would be, as applied to Zion, or the Church, that there is \"as much\" there to show the divine perfections, to illustrate the greatness and the power of God, as there is in the most sublime works of nature; or that they who look upon the works of God in nature to learn his perfections, have no advantage over those who seek to learn what he is in his church. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An high hill ... - Or rather; a mount of peaks or ridges as Bashan. Mount Hermon was not a single hill, or a detached mountain, but a chain of mountains - a range of lofty peaks or summits. So of Zion. It was by the presence and protection of God what Bashan was by its natural strength and grandeur. Comparatively low and unimportant as Zion was, it had in fact more in it to show what God is, and to constitute safety, than there was in the loftiness and grandeur of Bashan. The latter, though thus lofty and grand, had no \"advantage\" over Zion, but Zion might in every way be compared with that lofty range of hills which, by their natural position, their strength, and their grandeur, showed forth so much the greatness and glory of God. The teaching would be, as applied to Zion, or the Church, that there is \"as much\" there to show the divine perfections, to illustrate the greatness and the power of God, as there is in the most sublime works of nature; or that they who look upon the works of God in nature to learn his perfections, have no advantage over those who seek to learn what he is in his church. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15, 16. Mountains are often symbols of nations (Ps 46:2; 65:6). That of Bashan, northeast of Palestine, denotes a heathen nation, which is described as a \"hill of God,\" or a great hill. Such are represented as envious of the hill (Zion) on which God resides;",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15 The hill of God is as the hill of Bashan; an high hill as the hill of Bashan.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16 Why leap ye, ye high hills? this is the hill which God desireth to dwell in; yea, the Loud will dwell in it for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 The chariots of God are twenty thousand, even thousands of angels: the Lord is among them, as in Sinai, in the holy place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 Thou hast ascended on high, thou hast led captivity captive: thou hast received gifts for men; yea, for the rebellious also, that the Lord God might dwell among them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19 Blessed be the Lord, who daily loadeth us with benefits, even the God of our salvation. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 68:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Here the priests on the summit of the chosen hill begin to extol the Lord for his choice of Zion as his dwelling-place. \"The hill of God is as the hill of Bashan,\" or more accurately, \"a hill of God is Bashan,\" that is to say, Bashan is an eminent mountain, far exceeding Zion in height. According to the Hebrew custom, every great or remarkable thing is thus designated. Where we talk of the Devil's Dyke, the Devil's Ditch, the Devil's Punch Bowl, etc., the more commendable idiom of the Hebrews speaks of the hill of God, the trees of the Lord, the river of God, etc. \"An high hill as the hill of Bashan,\" or rather, \"a mount of peaks is Bashan.\" It does not appear that Zion is compared with Bashan, but contrasted with it. Zion certainly was not a high hill comparatively; and it is here conceded that Bashan is a greater mount, but not so glorious, for the Lord in choosing Zion had exalted it above the loftier hills. The loftiness of nature is nothing before the Lord. He chooses as pleases him, and, according to the counsel of his own will, he selects Zion, and passes by the proud, uplifted peaks of Bashan; thus doth he make the base things of this world, and things that are despised, to become monuments of his grace and sovereignty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 68:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Why leap ye, ye high hills?\" Why are ye moved to envy? Envy as ye may, the Lord's choice is fixed. Lift up yourselves, and even leap from your seats, ye cannot reach the sublimity which Jehovah's presence has bestowed on the little hill of Moriah. \"This is the hill which God desireth to dwell in.\" Elohim makes Zion his abode, yea, Jehovah resides there. \"Yea, the Lord will dwell in it forever.\" Spiritually the Lord abides eternally in Zion, his chosen church, and it was Zion's glory to be typical thereof. What were Carmel and Sirion, with all their height, compared to Zion, the joy of the whole earth! God's election is a patent of nobility. They are choice men whom God has chosen, and that place is superlatively honoured which he honours with his presence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 68:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The chariots of God are twenty thousand.\" Other countries, which in the former verse were symbolically referred to as \"high hills,\" gloried in their chariots of war; but Zion, though far more lowly, was stronger than they, for the omnipotence of God was to her as two myriads of chariots, The Lord of Hosts could summon more forces into the field than all the petty lords who boasted in their armies: his horses of fire and chariots of fire would be more than a match for their fiery steeds and flashing cars. The original is grandly expressive, \"the war-chariots of Elohim are myriads, a thousand thousands.\" The marginal reading of our Bibles, \"even many thousands,\" is far more correct than the rendering, \"even thousands of angels.\" It is not easy to see where our venerable translators found these \"angels,\" for they are not in the text; however, as it is a blessing to entertain them unawares, we are glad to meet with them in English, even though the Hebrew knows them not; and the more so because it cannot be doubted that they constitute a right noble squadron of the myriad hosts of God. We read in Deuteronomy 33:2, of the Lord's coming \"with ten thousands of saints,\" or holy ones, and in Hebrews 12:22, we find upon Mount Zion \"an innumerable company of angels,\" so that our worthy translators putting the texts together, inferred the angels, and the clause is so truthfully explanatory, that we have no fault to find with it. \"The Lord is among them, as in Sinai, in the holy place,\" or, \"it is a Sinai in holiness.\" God is in Zion as the Commander-in-chief of his countless hosts, and where he is, there is holiness. The throne of grace on Zion is as holy as the throne of justice on Sinai. The displays of his glory may not be so terrible under the new covenant as under the old; but they are even more marvellous if seen by the spiritual eye. Sinai has no excellency of glory beyond Zion; but the rather it pales its light of law before the noontide splendours of Zion's grace and truth. How joyful was it to a pious Hebrew to know that God was as truly with his people in the tabernacle and temple as amid the terrors of the Mount of Horeb; but it is even more heart-cheering to us to be assured that the Lord abides in his church, and has chosen it to be his rest for ever. May we be zealous for the maintenance of holiness in the spiritual house which God condescends to occupy: let a sense of his presence consume, as with flames of fire, every false way. The presence of God is the strength of the church; all power is ours when God is ours. Twenty thousand chariots shall bear the gospel to the ends of the earth; and myriads of agencies shall work for its success. Providence: is on our side, and it \"has servants everywhere.\" There is no room for a shade of doubt or discouragement, but every reason for exultation and confidence.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"The chariots of God are twenty thousand.\" Other countries, which in the former verse were symbolically referred to as \"high hills,\" gloried in their chariots of war; but Zion, though far more lowly, was stronger than they, for the omnipotence of God was to her as two myriads of chariots, The Lord of Hosts could summon more forces into the field than all the petty lords who boasted in their armies: his horses of fire and chariots of fire would be more than a match for their fiery steeds and flashing cars. The original is grandly expressive, \"the war-chariots of Elohim are myriads, a thousand thousands.\" The marginal reading of our Bibles, \"even many thousands,\" is far more correct than the rendering, \"even thousands of angels.\" It is not easy to see where our venerable translators found these \"angels,\" for they are not in the text; however, as it is a blessing to entertain them unawares, we are glad to meet with them in English, even though the Hebrew knows them not; and the more so because it cannot be doubted that they constitute a right noble squadron of the myriad hosts of God. We read in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of the Lord's coming \"with ten thousands of saints,\" or holy ones, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we find upon Mount Zion \"an innumerable company of angels,\" so that our worthy translators putting the texts together, inferred the angels, and the clause is so truthfully explanatory, that we have no fault to find with it. \"The Lord is among them, as in Sinai, in the holy place,\" or, \"it is a Sinai in holiness.\" God is in Zion as the Commander-in-chief of his countless hosts, and where he is, there is holiness. The throne of grace on Zion is as holy as the throne of justice on Sinai. The displays of his glory may not be so terrible under the new covenant as under the old; but they are even more marvellous if seen by the spiritual eye. Sinai has no excellency of glory beyond Zion; but the rather it pales its light of law before the noontide splendours of Zion's grace and truth. How joyful was it to a pious Hebrew to know that God was as truly with his people in the tabernacle and temple as amid the terrors of the Mount of Horeb; but it is even more heart-cheering to us to be assured that the Lord abides in his church, and has chosen it to be his rest for ever. May we be zealous for the maintenance of holiness in the spiritual house which God condescends to occupy: let a sense of his presence consume, as with flames of fire, every false way. The presence of God is the strength of the church; all power is ours when God is ours. Twenty thousand chariots shall bear the gospel to the ends of the earth; and myriads of agencies shall work for its success. Providence: is on our side, and it \"has servants everywhere.\" There is no room for a shade of doubt or discouragement, but every reason for exultation and confidence.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 68:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:18",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Thou hast ascended on high.\" The ark was conducted to the summit of Zion; God himself took possession of the high places of the earth, being extolled and very high. The antitype of the ark, the Lord Jesus, has ascended into the heavens with signal marks of triumph. To do battle with our enemies, the Lord descended and left his throne; but now the fight is finished, he returns to his glory, high above all things is he now exalted. \"Thou hast led captivity captive.\" A multitude of the sons of men are the willing captives of Messiah's power. As great conquerors of old led whole nations into captivity, so Jesus leads forth from the territory of his foe a vast company as the trophies of his mighty grace. From the gracious character of his reign it comes to pass that to be led into captivity by him is for our captivity to cease, or to be itself led captive; a glorious result indeed. The Lord Jesus destroys his foes with their own weapons; he puts death to death, entombs the grave, and leads captivity captive. \"Thou hast received gifts for men,\" or, received gifts among men: they have paid thee tribute, O mighty Conqueror, and shall in every age continue to do so willingly, delighting in thy reign. Paul's rendering is the gospel one: Jesus has \"received gifts for men,\" of which he makes plentiful distribution, enriching his church with the priceless fruits of his ascension, such as apostles, evangelists, pastors, and teachers, and all their varied endowments. In him, the man who received gifts for man, we are endowed with priceless treasures, and, moved with gratitude, we return gifts to him, yea, we give him ourselves, our all. \"Yea, for the rebellious also:\" these gifts the rebels are permitted to share in; subdued by love, they are indulged with the benefits peculiar to the chosen. The original runs, \"even the rebellious,\" or, \"even from the rebellious,\" of which the sense is that rebels become captives to the Lord's power, and tributaries to his throne.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Great King of grace, my heart subdue,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The hill of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the seat of God’s ark. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the hill of Bashan; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " equal to it, to wit, in height, as the next clause explains it; which yet is not to be understood of an external and visible height, for Zion was a low and little hill, and Bashan a very high hill; but of its spiritual height, or exaltation, in regard of the glorious privileges of God’s presence, and worship, and blessing conferred upon it, in which respect ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the mountain of the Lord’s house is said to be established on the top of the mountains, and exalted above the hills",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 2:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The hill of God is as the hill of Bashan,.... The church is the hill of God, an excellent and supereminent one, and in which he dwells, as is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; called an hill for its visibility, and especially as it will be in the latter day, when it will be established and exalted above the mountains and hills, the kingdoms of this world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; this is compared to the hill of Bashan for fertility and fruitfulness; hence we read of the kine and bulls, the rams and lambs, and fatlings of Bashan, and of the oaks thereof, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the ordinances of the church are green pastures, where his people become fat and flourishing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "an high hill, as the hill of Bashan; or \"an hill of eminences\" (h); it had several tops, or little hills that rose up from it; so the church of Christ, though but one hill or church in general, yet there are several little hills belong unto it, or particular congregational churches, of which it consists: for \"a mountain abounding with cheese\" (i); which fed much cattle, and these produced much milk, of which large quantities of cheese were made, and so is expressive of the fruitfulness of it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h)  \"mons gibborum\", Montanus; \"vel eminentiarum\", Gejerus; \"monte frequente gibbis\", Junius & Tremellius; \"mons fastigiorum\", Cocceius. (i) \"Mons qui caseis abundat\", Tigurine version. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h)  \"mons gibborum\", Montanus; \"vel eminentiarum\", Gejerus; \"monte frequente gibbis\", Junius & Tremellius; \"mons fastigiorum\", Cocceius. (i) \"Mons qui caseis abundat\", Tigurine version. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{m} The hill of God is as the hill of Bashan; an high hill as the hill of Bashan.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The hill of God ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is as",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the hill of Bashan; an high hill ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "as",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the hill of Bashan.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Zion the Church of God exceeds all worldly things, not in pomp and outward show, but by the inward grace of God, which remains because of his dwelling there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A mountain of God is the mountain of Bashan:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "An high-peaked mountain is the mountain of Bashan.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mount Hermon is probably meant, rather than the mountains of Bashan generally. It is the grandest of the mountains of Palestine, and was the northern boundary of Bashan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It has three summits of nearly equal height. Its natural preeminence seemed to mark it as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a mountain of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a mountain worthy to be the abode of God; and the early conquest of Bashan seemed to confirm its prior claim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15–18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the conquest of the land, God chose for His abode not the stately mountains of Bashan, whose natural preeminence might seem to mark them out for that privilege, but the insignificant hill of Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The hill of God is as the hill of Bashan;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a mountain of God is the mountain of Bashan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A sudden transition, and perhaps a quotation from an ancient poem. The special object of the psalmist's  thought is not Bashan, but Mount Zion; and what he is about to celebrate is Jehovah's choice of Mount Zion for his dwelling place, and his establishment on it. But he prefers to introduce the subject by a contrast with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "great",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " range of Canaan. Bashan, he says, is truly \"a mountain of God\" - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". a very great mountain (see the comment on Psalm 36:6) - \"one which seemed in an especial degree to show forth creative power.\" It is also an high hill; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a mountain of peaks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", containing numerous pointed summits. Yet God did not choose one of these for his habitation. Psalm 68:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This victory of Israel over the kings of the Gentiles gives the poet the joyful assurance that Zion is the inaccessible dwelling-place of Elohim, the God of the heavenly hosts. The mention of Zalmon leads him to mention other mountains. He uses the mountains of Bashan as an emblem of the hostile powers east of Jordan. These stand over against the people of God, as the mighty mountains of Bashan rising in steep, only slightly flattened peaks, to little hill-like Zion. In the land on this side Jordan the limestone and chalk formation with intermingled strata of sandstone predominates; the mountains of Bashan, however, are throughout volcanic, consisting of slag, lava, and more particularly basalt (basanites), which has apparently taken its name from Bashan (Basan).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This is all the more probable as Semitism has no proper word for basalt; in Syria it is called hag'ar aswad, \"black stone.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As a basalt range the mountains of Bashan are conspicuous among other creations of God, and are therefore called \"the mountain of Elohim:\" the basalt rises in the form of a cone with the top lopped off, or even towers aloft like so many columns precipitous and rugged to sharp points; hence the mountains of Bashan are called הר גּבננּים, i.e., a mountain range (for הר, as is well known, signifies both the single eminence and the range of summits) of many peaks  equals  a many-peaked mountain; גּבנן is an adjective like רענן, אמלל. With this boldly formed mass of rock so gloomily majestic, giving the impression of antiquity and of invincibleness, when compared with the ranges on the other side of unstable porous limestone and softer formations, more particularly with Zion, it is an emblem of the world and its powers standing over against the people of God as a threatening and seemingly invincible colossus. The poet asks these mountains of Bashan \"why,\" etc.? רצד is explained from the Arabic rṣd, which, in accordance with its root Arab. rṣ, signifies to cleave firmly to a place (firmiter inhaesit loco), properly used of a beast of prey couching down and lying in wait for prey, of a hunter on the catch, and of an enemy in ambush; hence then: to lie in wait for, lurk, ἐνεδρεύειν, craftily, insidiose (whence râṣid, a lier-in-wait, tarraṣṣud, an ambush), here: to regard enviously, invidiose. In Arabic, just as in this instance, it is construed as a direct transitive with an accusative of the object, whereas the original signification would lead one to look for a dative of the object (רצד ל), which does also really occur in the common Arabic. Olewejored is placed by גבננים, but what follows is not, after all, the answer: \"the mountain - Elohim has chosen it as the seat of His throne,\" but ההר is the object of the interrogative clause: Quare indiviose observatis, montes cacuminosi, hunc montem (δεικτικῶς: that Zion yonder), quem, etc. (an attributive clause after the determinate substantive, as in Psalm 52:9; Psalm 89:50, and many other instances, contrary to the Arabic rule of style). Now for the first time, in Psalm 68:17, follows that which is boastfully and defiantly contrasted with the proud mountains: \"Jahve will also dwell for ever;\" not only that Elohim has chosen Zion as the seat of His throne, it will also continue to be the seat of His throne, Jahve will continue to dwell [there] for ever. Grace is superior to nature, and the church superior to the world, powerful and majestic as this may seem to be. Zion maintains its honour over against the mountains of Bashan.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As a basalt range the mountains of Bashan are conspicuous among other creations of God, and are therefore called \"the mountain of Elohim:\" the basalt rises in the form of a cone with the top lopped off, or even towers aloft like so many columns precipitous and rugged to sharp points; hence the mountains of Bashan are called הר גּבננּים, i.e., a mountain range (for הר, as is well known, signifies both the single eminence and the range of summits) of many peaks  equals  a many-peaked mountain; גּבנן is an adjective like רענן, אמלל. With this boldly formed mass of rock so gloomily majestic, giving the impression of antiquity and of invincibleness, when compared with the ranges on the other side of unstable porous limestone and softer formations, more particularly with Zion, it is an emblem of the world and its powers standing over against the people of God as a threatening and seemingly invincible colossus. The poet asks these mountains of Bashan \"why,\" etc.? רצד is explained from the Arabic rṣd, which, in accordance with its root Arab. rṣ, signifies to cleave firmly to a place (firmiter inhaesit loco), properly used of a beast of prey couching down and lying in wait for prey, of a hunter on the catch, and of an enemy in ambush; hence then: to lie in wait for, lurk, ἐνεδρεύειν, craftily, insidiose (whence râṣid, a lier-in-wait, tarraṣṣud, an ambush), here: to regard enviously, invidiose. In Arabic, just as in this instance, it is construed as a direct transitive with an accusative of the object, whereas the original signification would lead one to look for a dative of the object (רצד ל), which does also really occur in the common Arabic. Olewejored is placed by גבננים, but what follows is not, after all, the answer: \"the mountain - Elohim has chosen it as the seat of His throne,\" but ההר is the object of the interrogative clause: Quare indiviose observatis, montes cacuminosi, hunc montem (δεικτικῶς: that Zion yonder), quem, etc. (an attributive clause after the determinate substantive, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and many other instances, contrary to the Arabic rule of style). Now for the first time, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", follows that which is boastfully and defiantly contrasted with the proud mountains: \"Jahve will also dwell for ever;\" not only that Elohim has chosen Zion as the seat of His throne, it will also continue to be the seat of His throne, Jahve will continue to dwell [there] for ever. Grace is superior to nature, and the church superior to the world, powerful and majestic as this may seem to be. Zion maintains its honour over against the mountains of Bashan.",
            "children": []
          }
        ]
      }
    ]
  }
]