[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that overcometh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "conquereth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall not be hurt.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words used are precise, and give certainty to the promise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The second death.—This phrase is a new one in Bible language. It is said that Jews were familiar with it through its use in the Chaldee Paraphrase. It clearly points to a death which is other than that of the body; it stands in contrast with the crown of life. The expressions of Revelation 20:14; Revelation 21:8, exclude the idea that a cessation of conscious existence is intended. The life of the spirit is the knowledge of God (John 17:3); the death of the spirit, or the second death, is the decay or paralysis of the powers by which such a knowledge was possible, and the experience of the awfulness of a life which is “without God.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The second death.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This phrase is a new one in Bible language. It is said that Jews were familiar with it through its use in the Chaldee Paraphrase. It clearly points to a death which is other than that of the body; it stands in contrast with the crown of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "life.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The expressions of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", exclude the idea that a cessation of conscious existence is intended. The life of the spirit is the knowledge of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the death of the spirit, or the second death, is the decay or paralysis of the powers by which such a knowledge was possible, and the experience of the awfulness of a life which is “without God.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Revelation",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. THE VICTOR’S LIFE-CROWN",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Two of the seven Churches, viz., Smyrna, to which our text is addressed, and Philadelphia offered nothing, to the pure eyes of Christ, that needed rebuke. The same two and these only, were warned to expect persecution. The higher the tone of Christian life in the Church, the more likely it is to attract dislike and, if circumstances permit, hostility. Hence the whole gist of this letter is to encourage to steadfastness, even if the penalty is death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That purpose determined at once the aspect of Christ which is presented in the beginning, and the aspect of future blessedness which is held forth at the close. The aspect of Christ is ‘these things saith the First and the Last, which was dead and is alive’; a fitting thought to encourage the men who were to be called upon to die for Him. And, in like manner, the words of our text naturally knit themselves with the previous mention of death as the penalty of the Smyrneans’ faithfulness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now this promise is sharply distinguished from those to the other Churches by two peculiarities: one, that it is merely negative, whilst all the rest are radiantly positive; the other, that there is no mention of our Lord in it, whilst in all the others He stands forth with His emphatic and majestic ‘I will give’; ‘I will write upon him My new Name’; ‘I will make him a pillar in the temple of My God.’ The first peculiarity may partially account for the second, because the Giver is naturally more prominent in a promise of positive gifts, than in one of a merely negative exemption. But another reason is to be found for the omission of the mention of our Lord in this promise. If you will refer to the verse immediately preceding my text, you will find the missing positive promise with the missing reference to Jesus Christ: ‘ I will give thee a crown of life.’ So that we are naturally led to link together both these statements when taking account of the hopes that were held forth to animate the Christians of Smyrna in the prospect of persecution even to the death; and we have to consider them both in conjunction now. I think I shall best do so by simply asking you to look at these two things: the Christian motive contained in the victor’s immunity from a great evil, and the Christian motive contained in the victor’s possession of a great good. ‘He shall not be hurt of the second death.’ ‘I will give thee a crown of life.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The Christian motive contained in the victor’s immunity from a great evil. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now that solemn and thrilling expression ‘the second death’ is peculiar to this book of the Apocalypse. The name is peculiar; the thing is common to all the New Testament writers. Here it comes with especial appropriateness, in contrast with the physical death which was about to be inflicted upon some members of the Smyrnean Church. But beyond that there lies in the phrase a very solemn and universally applicable meaning. I do not feel, dear brethren that such a thing ought to be made matter of pulpit rhetoric. The bare vagueness of it seems to me to shake the heart a great deal more than any weakening expansion of it that we can give. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But yet, let me say one word. Then, behind that grim figure, the shadow feared of man that waits for all at some turn of their road, cloaked and shrouded, there rises a still grimmer and more awful form, ‘ if form it can be called which form hath none.’ There is something, at the back of physical death, which can lay its grip upon the soul that is already separated from the body; something running on the same lines somehow, and worthy to bear that name of terror and disintegration ‘the second death.’ What can it be? Not the cessation of conscious existence; that is never the meaning of death. But let us apply the key which opens so many of the locks of the New Testament sayings about the future that the true and deepest meaning of death is separation from Him who is the fountain of life, and in a very deep sense is the only life of the universe. Separation from God; that is death. What touches the surface of mere bodily life is but a faint shadow and parable, and the second death, like a second tier of mountains, rises behind and above it, sterner and colder than the lower hills of the foreground. What desolation, what unrest, what blank misgivings, what pealing off of capacities, faculties, opportunities, delights, may be involved in that solemn conception, we never can tell here God grant that we may never know! Like some sea-creature, cast high and dry on the beach, and gasping out its pained being, the men that are separated from God die whilst they live, and live a living death. The second is the comparative degree, of which the first is the positive. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now note again that immunity from this solemn fate is no small part of the victor’s blessedness. At first sight we feel as if the mere negative promise of my text stands on a lower level than what I have called the radiantly positive ones in the other letters; but it is worthy to stand beside these. Gather them together, and think of how manifold and glorious the dim suggestions which they make of felicity and progress are, and then set by the side of them this one of our text as worthy to stand there. To eat of the Tree of Life; to have power over the nations; to rule them with a rod of iron; to blaze with the brightness of the morning star; to eat of the hidden manna; to bear the new name known only to those who receive it; to have that name confessed before the Father and His angels; to be a pillar in the Temple of the Lord; to go no more out; and to sit with Christ on His throne: these are the positive promises, along with which this barely negative one is linked, and is worthy to be linked: ‘He shall not be hurt of the second death.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If this immunity from that fate is fit to stand in line with these glimpses of an inconceivable glory, how solemn must be the fate, and how real the danger of our falling into it I Brethren, in this day it has become unfashionable to speak of that future, especially of its sterner aspects. The dimness of the brightest revelations in the New Testament, the unwillingness to accept it as the source of certitude with regard to the future, the recoil from the stern severity of Divine retribution, the exaggerated and hideous guise in which that great truth was often presented in the past, the abounding worldliness of this day, many of its best tendencies and many of its worst ones concur in making some of us look with very little interest, and scarcely credence, at the solemn words of which the New Testament is full. But I, for my part, accept them; and I dare not but, in such proportion to the rest of revelation as seems to me to be right, bring them before you. I beseech you, recognize the solemn teaching that lies in this thought that this negative promise of immunity from the second death stands parallel with all these promises of felicity and blessedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Further, note that such immunity is regarded here as the direct outcome of the victor’s conduct and character. I have already pointed out the peculiarities marking our text. The omission of any reference to our Lord in it is accounted for, as suggested, by that reference occurring in the immediately preceding context, but it may also be regarded as suggesting when considered in contrast with the other promises, where He stands forward as the giver of heavenly blessedness that that future condition is to be regarded not only as retribution, which implies the notion of a judge, and a punitive or rewarding energy on his part, but also as being the necessary result of the earthly life that is lived; a harvest of which we sow the seeds here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Transient deeds consolidate into permanent character. Beds of sandstone rock, thousands of feet thick, are the sediment dropped from vanished seas, or borne down by long dried-up rivers. The actions which we often so unthinkingly perform, whatever may be the width and the permanency of their effects external to us, react upon ourselves, and tend to make our permanent bent or twist or character. The chalk cliffs at Dover are the skeletons of millions upon millions of tiny organisms, and our little lives are built up by the recurrence of transient deeds, which leave their permanent marks upon us. They make character, and character determines position yonder. As said the Apostle, with tender sparingness, and yet with profound truth, ‘he went to his own place,’ wherever that was. The surroundings that he was fitted for came about him, and the company that he was fit for associated themselves with him. So in another part of this book where the same solemn expression, ‘the second death,’ is employed, we read, ‘These shall have their part in . . . the second death’: the lot that belongs to them. Character and conduct determine position. However small the lives here, they settle the far greater ones hereafter, just as a tiny wheel in a machine may, by cogs and other mechanical devices, transmit its motion to another wheel at a distance, many times its diameter. You move this end of a lever through an arc of an inch, and the other end will move through an arc of yards. The little life here determines the sweep of the great one that is lived yonder. The victor wears his past conduct and character, if I may so say, as a fireproof garment, and if he entered the very furnace, heated seven times hotter than before, there would be no smell of fire upon him. ‘He that overcometh shall not be hurt of the second death.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now note, secondly, the Christian motive contained in the victor’s reception of a great good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I will give him a crown of life.’ I need not remind you, I suppose, that this metaphor of ‘the crown’ is found in other instructively various places in the New Testament. Paul, for instance, speaks of his own personal hope of ‘the crown of righteousness.’ James speaks, as does the letter to the Smyrnean Church, of ‘the crown of life.’ Peter speaks ‘of the crown of glory.’ Paul, in another place, speaks of ‘the crown incorruptible.’ And all these express substantially the one idea. There may be a question as to whether the word employed here for the crown is to be taken in its strictly literal acceptation as meaning, not a kingly coronal, but a garland. But seeing that, although that is the strict meaning of the word, it is employed in a subsequent part of the letter to designate what must evidently be kingly crowns viz., in the fourth chapter there seems to be greater probability in the supposition that we are warranted in including under the symbolism here both the aspects of the crown as royal, and also as laid upon the brows of the victors in the games or the conflict. I venture to take it in that meaning. Substantially the promise is the same as that which we were considering in the previous letter, ‘I will give him to eat of the Tree of Life’; the promise of life in all the depth and fullness and sweep of that great encyclopaedical word. But it is life considered from a special point of view that is set forth here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is a kingly life. Of course that notion of regality and dominion, as the prerogative of the redeemed and glorified servants of Jesus Christ, is for ever cropping up in this book of the Revelation. And you remember how our Lord has set the example of its use when He said, ‘Have thou authority over ten cities.’ What may lie in that great symbol it is not for us to say. The rule over ourselves, over circumstances, the deliverance from the tyranny of the external, the deliverance from the slavery of the body and its lusts and passions, these are all included. The man that can will rightly, and can do completely as he rightly wills, that man is a king. But there is more than that. There is the participation in wondrous, and for us inconceivable, ways, in the majesty and regality of the King of kings and Lord of lords. Therefore did the crowned elders before the throne sing a new song to the Lamb, who made redeemed men out of every tribe and tongue, to be to God a kingdom, and priests who should reign upon the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But, brethren, remember that this conception of a kingly life is to be interpreted according to Christ’s own teaching of that wherein royalty in His kingdom consists. For heaven, as for earth, the purpose of dominion is service, and the use of power is beneficence. ‘He that is chiefest of all, let him be servant of all,’ is the law for the regalities of heaven as well as for the lowliness of earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That life is a triumphant life. The crown was laid on the head of the victor in the games. Think of the victor as he went back, flushed and modest, to his village away up on the slopes of some of the mountain chains of Greece. With what a tumult of acclaim he would be hailed! If we do our work and fight our fight down here as we ought, we shall enter into the great city not unnoticed, not unwelcomed, but with the praise of the King and the paeans of His attendants. ‘I will confess his name before My Father and the holy angels.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That life is a festal life. The garlands are twined on the heated brows of revelers, and the fumes of the wine and the closeness of the chamber soon make them wilt and droop. This amaranthine crown fadeth never. And the feast expresses for us the felicities, the abiding satisfactions without satiety, the blessed companionship, the repose which belong to the crowned. Royalty, triumph, festal goodness, all fused together, are incomplete, but they are not useless symbols. May we experience their fulfilment! ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Brethren, the crown is promised not merely to the man that says, ‘I have faith in Jesus Christ,’ but to him who has worked out his faith into faithfulness, and by conduct and character has made himself capable of the felicities of the heavens. If that immortal crown were laid upon the head of another, it would be a crown of thorns; for the joys of that future require the fitness which comes from the apprenticeship to faith and faithfulness here on earth. We evangelical preachers are often taunted with preaching that future blessedness comes as the result of the simple act of belief. Yes; but only if, and when, the simple act of faith, which is more than belief, is wrought out in the loveliness of faithfulness. ‘We are made partakers of Christ, if we hold fast the beginning of our confidence firm unto the end.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, dear friends, I dare say that some of you may be disposed to brush aside these fears and hopes as very low motives, unworthy to be appealed to; but I cannot so regard them. I know that the appeal to fear is directed to the lower order of sentiments, but it is a legitimate motive. It is meant to stir us up to gird ourselves against the dangers which we wisely dread. And I, for my part, believe that we preachers are going aside from our Pattern, and are flinging away a very powerful weapon, in the initial stages of religious experience, if we are afraid to bring before men’s hearts and answering consciences the solemn facts of the future which Jesus Christ Himself has revealed to us. We are no more to be blamed for it than the signalman for waving his red flag. And I fancy that there are some of my present hearers who would be nearer the love of God if they took more to heart the fear of the Lord and of His judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hope is surely a perfectly legitimate motive to appeal to. We are not to be good because we thereby escape hell and secure heaven. We are to be good, because Jesus Christ wills us to be, and has won us to love Him, or has sought to win us to love Him, by His great sacrifice for us. But that being the basis, men can be brought to build upon it by the compulsion of fear and by the attraction of hope. And that being the deepest motive, there is a perfectly legitimate and noble sphere for the operation of these two other lower motives, the consideration of the personal evils that attend the opposite course, and of the personal good that follows from cleaving to Him. Am I to be told that Polycarp, Bishop of Smyrna, who went to his martyrdom, and was ‘faithful unto death,’ with the words on his lips: ‘Eighty-and-six years have I served Him, and He has done me nothing but good; how shall I deny my King and my Saviour!’ was yielding to a low motive when to him the crown that the Master promised to the Church of which he was afterwards bishop floated above the head that was soon to be shorn off, and on whose blood-stained brows it was then to fall ? Would that we had more of such low motives! Would that we had more of such high lives as fear nothing because they ‘have respect to the recompense of the reward,’ and are ready for service or martyrdom, because they hear and believe the crowned Christ saying to them: ‘Be thou faithful unto death, and I will give thee a crown of life.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:8-11 Our Lord Jesus is the First, for by him were all things made; he was before all things, with God, and is God himself. He is the Last, for he will be the Judge of all. As this First and Last, who was dead and is alive, is the believer's Brother and Friend, he must be rich in the deepest poverty, honourable amidst the lowest abasement, and happy under the heaviest tribulation, like the church of Smyrna. Many who are rich as to this world, are poor as to the next; and some who are poor outwardly, are inwardly rich; rich in faith, in good works, rich in privileges, rich in gifts, rich in hope. Where there is spiritual plenty, outward poverty may be well borne; and when God's people are made poor as to this life, for the sake of Christ and a good conscience, he makes all up to them in spiritual riches. Christ arms against coming troubles. Fear none of these things; not only forbid slavish fear, but subdue it, furnishing the soul with strength and courage. It should be to try them, not to destroy them. Observe, the sureness of the reward; I will give thee: they shall have the reward from Christ's own hand. Also, how suitable it is; a crown of life: the life worn out in his service, or laid down in his cause, shall be rewarded with a much better life, which shall be eternal. The second death is unspeakably worse than the first death, both in the agonies of it, and as it is eternal death: it is indeed awful to die, and to be always dying. If a man is kept from the second death and wrath to come, he may patiently endure whatever he meets with in this world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that hath an ear ... - See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He that overcometh - See the notes on Revelation 2:7. The particular promise here is made to him that should \"overcome\"; that is, that would gain the victory in the persecutions which were to come upon them. The reference is to him who would show the sustaining power of religion in times of persecution; who would not yield his principles when opposed and persecuted; who would be triumphant when so many efforts were made to induce him to apostatize and abandon the cause.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He that overcometh - See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The particular promise here is made to him that should \"overcome\"; that is, that would gain the victory in the persecutions which were to come upon them. The reference is to him who would show the sustaining power of religion in times of persecution; who would not yield his principles when opposed and persecuted; who would be triumphant when so many efforts were made to induce him to apostatize and abandon the cause.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall not be hurt of the second death - By a second death. That is, he will have nothing to fear in the future world. The punishment of hell is often called death, not in the sense that the soul will cease to exist, but:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) because death is the most fearful thing of which we have any knowledge, and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) because there is a striking similarity, in many respects, between death and future punishment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Death cuts off from life - and so the second death cuts off from eternal life; death puts an end to all our hopes here, and the second death to all our hopes forever; death is attended with terrors and alarms - the faint and feeble emblem of the terrors and alarms in the world of woe. The phrase, \"the second death,\" is three times used elsewhere by John in this book Revelation 20:6, Revelation 20:14; Revelation 21:8, but does not occur elsewhere in the New Testament. The words \"death\" and \"to die,\" however, are not infrequently used to denote the future punishment of the wicked.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Death cuts off from life - and so the second death cuts off from eternal life; death puts an end to all our hopes here, and the second death to all our hopes forever; death is attended with terrors and alarms - the faint and feeble emblem of the terrors and alarms in the world of woe. The phrase, \"the second death,\" is three times used elsewhere by John in this book ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but does not occur elsewhere in the New Testament. The words \"death\" and \"to die,\" however, are not infrequently used to denote the future punishment of the wicked.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The promise here made would be all that was necessary to sustain them in their trials. Nothing more is requisite to make the burdens of life tolerable than an assurance that, when we reach the end of our earthly journey, we have arrived at the close of suffering, and that beyond the grave there is no power that can harm us. Religion, indeed, does not promise to its friends exemption from death in one form. To none of the race has such a promise ever been made, and to but two has the favor been granted to pass to heaven without tasting death. It could have been granted to all the redeemed, but there were good reasons why it should not be; that is, why it would be better that even they who are to dwell in heaven should return to the dust, and sleep in the tomb, than that they should be removed by perpetual miracle, translating them to heaven. Religion, therefore, does not come to us with any promise that we shall not die. But it comes with the assurance that we shall be sustained in the dying hour; that the Redeemer will accompany us through the dark valley; that death to us will be a calm and quiet slumber, in the hope of awakening in the morning of the resurrection; that we shall be raised up again with bodies incorruptible and undecaying; and that beyond the grave we shall never fear death in any form. What more is needful to enable us to bear with patience the trials of this life, and to look upon death when it does come, disarmed as it is of its sting 1 Corinthians 15:55-57, with calmness and peace?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The promise here made would be all that was necessary to sustain them in their trials. Nothing more is requisite to make the burdens of life tolerable than an assurance that, when we reach the end of our earthly journey, we have arrived at the close of suffering, and that beyond the grave there is no power that can harm us. Religion, indeed, does not promise to its friends exemption from death in one form. To none of the race has such a promise ever been made, and to but two has the favor been granted to pass to heaven without tasting death. It could have been granted to all the redeemed, but there were good reasons why it should not be; that is, why it would be better that even they who are to dwell in heaven should return to the dust, and sleep in the tomb, than that they should be removed by perpetual miracle, translating them to heaven. Religion, therefore, does not come to us with any promise that we shall not die. But it comes with the assurance that we shall be sustained in the dying hour; that the Redeemer will accompany us through the dark valley; that death to us will be a calm and quiet slumber, in the hope of awakening in the morning of the resurrection; that we shall be raised up again with bodies incorruptible and undecaying; and that beyond the grave we shall never fear death in any form. What more is needful to enable us to bear with patience the trials of this life, and to look upon death when it does come, disarmed as it is of its sting ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:55-57",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with calmness and peace?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Epistle to the Church at Pergamos",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The contents of the epistle Revelation 2:12-17 are as follows:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The contents of the epistle ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:12-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are as follows:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) A reference, as is usual in these epistles, to some attribute of Him who addressed them, suited to inspire respect, and adapted to a state of things existing in the church, Revelation 2:12. That to which the Saviour here directs their attention is, that he has \"the sharp sword with two edges\" - implying Revelation 2:16 that he had the power of punishing.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) A reference, as is usual in these epistles, to some attribute of Him who addressed them, suited to inspire respect, and adapted to a state of things existing in the church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That to which the Saviour here directs their attention is, that he has \"the sharp sword with two edges\" - implying ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that he had the power of punishing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) a statement, in the usual form, that he was thoroughly acquainted with the state of the church; that he saw all their difficulties; all that there was to commend, and all that there was to reprove, Revelation 2:13.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) a statement, in the usual form, that he was thoroughly acquainted with the state of the church; that he saw all their difficulties; all that there was to commend, and all that there was to reprove, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) a commendation to the church for its fidelity, especially in a time of severe persecution, when one of her faithful friends was slain, Revelation 2:13.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) a commendation to the church for its fidelity, especially in a time of severe persecution, when one of her faithful friends was slain, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) A reproof of the church for tolerating some who held false and pernicious doctrines - doctrines such as were taught by Balaam, and the doctrines of the Nicolaitanes, Revelation 2:14-15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) A reproof of the church for tolerating some who held false and pernicious doctrines - doctrines such as were taught by Balaam, and the doctrines of the Nicolaitanes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) a solemn threat that, unless they repented, he would come against them, and inflict summary punishment on them, Revelation 2:16.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(5) a solemn threat that, unless they repented, he would come against them, and inflict summary punishment on them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. shall not be hurt—Greek, \"shall not by any means (or possibly) be hurt.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the second death—\"the lake of fire.\" \"The death in life of the lost, as contrasted with the life in death of the saved\" [Trench]. The phrase \"the second death\" is peculiar to the Apocalypse. What matter about the first death, which sooner or later must pass over us, if we escape the second death? \"It seems that they who die that death shall be hurt by it; whereas, if it were annihilation, and so a conclusion of their torments, it would be no way hurtful, but highly beneficial to them. But the living torments are the second death\" [Bishop Pearson]. \"The life of the damned is death\" [Augustine]. Smyrna (meaning myrrh) yielded its sweet perfume in being bruised even to death. Myrrh was used in embalming dead bodies (Joh 19:39); was an ingredient in the holy anointing oil (Ex 30:23); a perfume of the heavenly Bridegroom (Ps 45:8), and of the bride (So 3:6). \"Affliction, like it, is bitter for the time being, but salutary; preserving the elect from corruption, and seasoning them for immortality, and gives scope for the exercise of the fragrantly breathing Christian virtues\" [Vitringa]. Polycarp's noble words to his heathen judges who wished him to recant, are well known: \"Fourscore and six years have I served the Lord, and He never wronged me, how then can I blaspheme my King and Saviour?\" Smyrna's faithfulness is rewarded by its candlestick not having been removed out of its place (Re 2:5); Christianity has never wholly left it; whence the Turks call it, \"Infidel Smyrna.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He that hath an ear, let him hear what the Spirit saith unto the churches; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " He that overcometh:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the opening of these passages: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Revelation 2:7\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not be hurt of the second death; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we read of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the second death, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Revelation 20:6,14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": the meaning is, that he shall escape the eternal damnation of soul and body in the day of judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Those that make these epistles prophetical say, that the church of Smyrna was a type of all the churches of Christ to the year 325, (when Constantine overcame Lycinius, and gave rest and peace to the churches of Christ), which was all a time of severe persecution under the Roman emperors, who to that time were all heathens. It is very observable, that Christ blameth nothing in this church; the church of God keeps always its purity best in the fire; but doubtless there were in this time many apostacies, and other errors, but God allows much to his people’s temptations; hence, though Job showed much impatience, yet we are called to behold him as a pattern of patience. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that hath an ear, let him hear,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he that overcometh; and is not intimidated by poverty, confiscation of goods, tribulation, persecution, and death itself, but through Christ is a conqueror, and more than a conqueror over all these things: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall not be hurt of the second death; by which is meant eternal death, in distinction from a corporeal and temporal one; and lies in a destruction of both body and soul in hell, and in an everlasting separation from God, and a continual sense of divine wrath; but of this the saints shall never be hurt, they are ordained to eternal life; this is secured for them in Christ, and he has it in his hands for them, and will give it to them. The phrase is Jewish, and is opposed to the first death, or the death of the body; which is the effect of sin, and is appointed of God, and which the people of God die as well as others; but the second death is peculiar to wicked men. So the Jerusalem Targum on Deuteronomy 33:6; paraphrases those words, \"let Reuben live, and not die\", thus, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shall not be hurt of the second death; by which is meant eternal death, in distinction from a corporeal and temporal one; and lies in a destruction of both body and soul in hell, and in an everlasting separation from God, and a continual sense of divine wrath; but of this the saints shall never be hurt, they are ordained to eternal life; this is secured for them in Christ, and he has it in his hands for them, and will give it to them. The phrase is Jewish, and is opposed to the first death, or the death of the body; which is the effect of sin, and is appointed of God, and which the people of God die as well as others; but the second death is peculiar to wicked men. So the Jerusalem Targum on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; paraphrases those words, \"let Reuben live, and not die\", thus, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"let Reuben live in this world, and not die , \"by the second death\", with which the wicked die in the world to come. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of which sense of the text and phrase Epiphanius makes mention (q). See the same phrase in the Targum of Jonathan ben Uzziel, in Isaiah 22:14; and in Jeremiah 51:39; and in Philo the Jew (r), ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of which sense of the text and phrase Epiphanius makes mention (q). See the same phrase in the Targum of Jonathan ben Uzziel, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in Philo the Jew (r), ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Contr. Haeres. Haeres. 9. (r) De Praemiis & Poenis, p. 921. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) Contr. Haeres. Haeres. 9. (r) De Praemiis & Poenis, p. 921. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{9} He that hath an ear, let him hear what the Spirit saith unto the churches; He that overcometh shall not be hurt {10} of the second death.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{9}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He that hath an ear, let him hear what the Spirit saith unto the churches; He that overcometh shall not be hurt ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{10}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the second death.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(9) The conclusion, as in Re 2:7.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(10) See Re 10:6.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The promise, which, in addition to the general command to hear,[1092] is contained in the concluding verse, is framed in accordance with what precedes.[1093] The victory recalls the struggle with the afflictions of persecution,[1094] through which there has been a victorious battle in their fidelity unto death.[1095] The victorious warrior reaches peace before the throne of God and the Lamb,[1096] or, as here said in reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[1097] “He shall not be hurt of the second death.” On ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ μή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. Winer, p. 471.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀδικηθῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and often ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", causal, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[1098]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "second death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " designates eternal damnation in hell,[1099] eternal after temporal death. The expression is derived from Jewish theology,[1100] but is pervaded with a meaning specifically Christian, since they incur the second death, who have no part in the marriage of the Lamb, and therefore are outside of Christ.[1101] [See Note XXXI., p. 156.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1092] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1093] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1094] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 16:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1095] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1096] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1097] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄχρι θανάτου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1098] Winer, p. 344.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1099] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1100] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Targ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “The wicked who die the second death, and are consigned to Gehenna.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Targum of Jerusalem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. Wetst.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1101] Chs. 20, 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "NOTES BY THE AMERICAN EDITOR",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "XXXI. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὲκ τοῦ θανάτου τοῦ δευτέχρου",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Cremer: that “to which they are appointed whose names are not written in the book of life, and which follows the general resurrection (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:12-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), must be a judgment which comes as a second and final sentence, and which is something still future before the first resurrection, for the partakers of that resurrection are not affected by it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Their perfect freedom from all the consequences of sin, and the full realization of their salvation, is also expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” Gebhardt: “The second death, the intensified death, is the coming of sins to the eternal death, from which there is no resurrection; or to perdition (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 17:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 17:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which consists, not in the ‘destruction of the wicked,’ but in the definite loss of happiness, in eternally restless pangs, and perpetual consciousness of consummated death.” Trench quotes the gloss of Augustine: “Vita damnatorum est mors,” and notes, “The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δευτέρος θάνατος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this book is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γέενα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:43-49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ μὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (emphatic): no true Christian, much less one who dies a martyr’s death, need fear anything beyond the pang of the first death. The second death of condemnation in the lake of fire leaves the faithful scatheless, no matter how others may suffer from the terrors (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which haunted the ancient outlook (especially the Egyptian) upon the dark interval between death and heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the sketch of Ani, seated on his throne and robed in white, holding sceptre and staff, and crying: “I am not held to be a person of no account, and violence shall not be done me. I am thy son, O Great One, and I have seen the hidden things that belong to thee. I am crowned king of the gods, and shall not die a second time in the underworld” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "E. B. D.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 99). If a Christian keep himself loyal till death, the prophet here guarantees that Christ will keep him safe after death. After the promise of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " however, this sounds like an anticlimax. The general tenor of the message indicates that John was rather more cordial and sympathetic to the Smyrniote church than to the Ephesian.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the second death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τοῦ θανάτου τοῦ δευτέρου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Chaldee Paraphrase has this phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מותא תנינא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". [Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He that hath an ear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ver. 7). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall not be hurt of the second death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; more literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall in no wise be injured at the hands of the second death.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The negative is the strongest form; the injury seems to be of the nature of a wrong, and the second death is regarded as the source of the wrong (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οὐ μὴ ἀδικηθῇ ἐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"the second death\" is almost personified, as here: \"Over these the second death has no authority.\" The phrase is peculiar to this book (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Revelation 21:8, where it is defined to be \"the lake of fire\"). The corresponding phrase, \"the first death,\" does not occur. The one is the death of the body, to which the faithful Smyrnaeans must submit; the other is the death of the soul, from which the crown of life secures them: though they die, yet shall they live, and shall in no wise die, forever (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:25, 26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This second death, or death of the soul, is absolute exclusion from God, who is the Source of eternal life. The expression, \"the second death,\" seems to be borrowed from Jewish theological phraseology. (On the repetition of the article, \"the death, the second (death),\" see note on ver. 13.) Revelation 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be hurt (ἀδικηθῇ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Strictly, wronged.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second death",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "An expression peculiar to the Revelation. See Revelation 20:6, Revelation 20:14; Revelation 21:8. In those two passages it is defined as the lake of fire. The death awaiting the wicked after judgment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An expression peculiar to the Revelation. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In those two passages it is defined as the lake of fire. The death awaiting the wicked after judgment. ",
            "children": []
          }
        ]
      }
    ]
  }
]