[{"num":26,"verse":"When Jesus had finished this talk with his disciples, he told them,"},{"num":2,"verse":"“As you know, the Passover celebration begins in two days, and I shall be betrayed and crucified.”"},{"num":3,"verse":"At that very moment the chief priests and other Jewish officials were meeting at the residence of Caiaphas the high priest, "},{"num":4,"verse":"to discuss ways of capturing Jesus quietly and killing him. "},{"num":5,"verse":"“But not during the Passover celebration,” they agreed, “for there would be a riot.”"},{"num":6,"verse":"Jesus now proceeded to Bethany, to the home of Simon the leper. "},{"num":7,"verse":"While he was eating, a woman came in with a bottle of very expensive perfume and poured it over his head."},{"num":8,"verse":"The disciples were indignant. “What a waste of good money,” they said. “Why, she could have sold it for a fortune and given it to the poor.”"},{"num":10,"verse":"Jesus knew what they were thinking and said, “Why are you criticizing her? For she has done a good thing to me. "},{"num":11,"verse":"You will always have the poor among you, but you won’t always have me. "},{"num":12,"verse":"She has poured this perfume on me to prepare my body for burial. "},{"num":13,"verse":"And she will always be remembered for this deed. The story of what she has done will be told throughout the whole world, wherever the Good News is preached.”"},{"num":14,"verse":"Then Judas Iscariot, one of the twelve apostles, went to the chief priests "},{"num":15,"verse":"and asked, “How much will you pay me to get Jesus into your hands?” And they gave him thirty silver coins. "},{"num":16,"verse":"From that time on, Judas watched for an opportunity to betray Jesus to them."},{"num":17,"verse":"On the first day of the Passover ceremonies, when bread made with yeast was purged from every Jewish home, the disciples came to Jesus and asked, “Where shall we plan to eat the Passover?”"},{"num":18,"verse":"He replied, “Go into the city and see Mr. So-and-So, and tell him, ‘Our Master says, my time has come, and I will eat the Passover meal with my disciples at your house.’” "},{"num":19,"verse":"So the disciples did as he told them and prepared the supper there."},{"num":20,"verse":"That evening as he sat eating with the Twelve, he said, “One of you will betray me.”"},{"num":22,"verse":"Sorrow chilled their hearts, and each one asked, “Am I the one?”"},{"num":23,"verse":"He replied, “It is the one I served first. "},{"num":24,"verse":"For I must die just as was prophesied, but woe to the man by whom I am betrayed. Far better for that one if he had never been born.”"},{"num":25,"verse":"Judas, too, had asked him, “Rabbi, am I the one?” And Jesus had told him, “Yes.”"},{"num":26,"verse":"As they were eating, Jesus took a small loaf of bread and blessed it and broke it apart and gave it to the disciples and said, “Take it and eat it, for this is my body.”"},{"num":27,"verse":"And he took a cup of wine and gave thanks for it and gave it to them and said, “Each one drink from it, "},{"num":28,"verse":"for this is my blood, sealing the new covenant. It is poured out to forgive the sins of multitudes. "},{"num":29,"verse":"Mark my words—I will not drink this wine again until the day I drink it new with you in my Father’s Kingdom.”"},{"num":30,"verse":"And when they had sung a hymn, they went out to the Mount of Olives."},{"num":31,"verse":"Then Jesus said to them, “Tonight you will all desert me. For it is written in the Scriptures that God will smite the Shepherd, and the sheep of the flock will be scattered. "},{"num":32,"verse":"But after I have been brought back to life again, I will go to Galilee and meet you there.”"},{"num":33,"verse":"Peter declared, “If everyone else deserts you, I won’t.”"},{"num":34,"verse":"Jesus told him, “The truth is that this very night, before the cock crows at dawn, you will deny me three times!”"},{"num":35,"verse":"“I would die first!” Peter insisted. And all the other disciples said the same thing."},{"num":36,"verse":"Then Jesus brought them to a garden grove, Gethsemane, and told them to sit down and wait while he went on ahead to pray. "},{"num":37,"verse":"He took Peter with him and Zebedee’s two sons James and John, and began to be filled with anguish and despair."},{"num":38,"verse":"Then he told them, “My soul is crushed with horror and sadness to the point of death . . . stay here . . . stay awake with me.”"},{"num":39,"verse":"He went forward a little, and fell face downward on the ground, and prayed, “My Father! If it is possible, let this cup be taken away from me. But I want your will, not mine.”"},{"num":40,"verse":"Then he returned to the three disciples and found them asleep. “Peter,” he called, “couldn’t you even stay awake with me one hour? "},{"num":41,"verse":"Keep alert and pray. Otherwise temptation will overpower you. For the spirit indeed is willing, but how weak the body is!”"},{"num":42,"verse":"Again he left them and prayed, “My Father! If this cup cannot go away until I drink it all, your will be done.”"},{"num":43,"verse":"He returned to them again and found them sleeping, for their eyes were heavy, "},{"num":44,"verse":"so he went back to prayer the third time, saying the same things again."},{"num":45,"verse":"Then he came to the disciples and said, “Sleep on now and take your rest . . . but no! The time has come! I am betrayed into the hands of evil men! "},{"num":46,"verse":"Up! Let’s be going! Look! Here comes the man who is betraying me!”"},{"num":47,"verse":"At that very moment while he was still speaking, Judas, one of the Twelve, arrived with a great crowd armed with swords and clubs, sent by the Jewish leaders. "},{"num":48,"verse":"Judas had told them to arrest the man he greeted, for that would be the one they were after. "},{"num":49,"verse":"So now Judas came straight to Jesus and said, “Hello, Master!” and embraced him in friendly fashion."},{"num":50,"verse":"Jesus said, “My friend, go ahead and do what you have come for.” Then the others grabbed him."},{"num":51,"verse":"One of the men with Jesus pulled out a sword and slashed off the ear of the high priest’s servant."},{"num":52,"verse":"“Put away your sword,” Jesus told him. “Those using swords will get killed. "},{"num":53,"verse":"Don’t you realize that I could ask my Father for thousands of angels to protect us, and he would send them instantly? "},{"num":54,"verse":"But if I did, how would the Scriptures be fulfilled that describe what is happening now?” "},{"num":55,"verse":"Then Jesus spoke to the crowd. “Am I some dangerous criminal,” he asked, “that you had to arm yourselves with swords and clubs before you could arrest me? I was with you teaching daily in the Temple and you didn’t stop me then. "},{"num":56,"verse":"But this is all happening to fulfill the words of the prophets as recorded in the Scriptures.”"},{"num":57,"verse":"Then the mob led him to the home of Caiaphas, the high priest, where all the Jewish leaders were gathering. "},{"num":58,"verse":"Meanwhile, Peter was following far to the rear, and came to the courtyard of the high priest’s house and went in and sat with the soldiers, and waited to see what was going to be done to Jesus."},{"num":59,"verse":"The chief priests and, in fact, the entire Jewish Supreme Court assembled there and looked for witnesses who would lie about Jesus, in order to build a case against him that would result in a death sentence. "},{"num":60,"verse":"But even though they found many who agreed to be false witnesses, these always contradicted each other."},{"num":62,"verse":"Then the high priest stood up and said to Jesus, “Well, what about it? Did you say that, or didn’t you?” "},{"num":63,"verse":"But Jesus remained silent."},{"num":64,"verse":"“Yes,” Jesus said, “I am. And in the future you will see me, the Messiah, sitting at the right hand of God and returning on the clouds of heaven.”"},{"num":65,"verse":"Then the high priest tore at his own clothing, shouting, “Blasphemy! What need have we for other witnesses? You have all heard him say it! What is your verdict?”"},{"num":67,"verse":"Then they spat in his face and struck him and some slapped him, "},{"num":68,"verse":"saying, “Prophesy to us, you Messiah! Who struck you that time?”"},{"num":69,"verse":"Meanwhile, as Peter was sitting in the courtyard, a girl came over and said to him, “You were with Jesus, for both of you are from Galilee.”"},{"num":70,"verse":"But Peter denied it loudly. “I don’t even know what you are talking about,” he angrily declared."},{"num":71,"verse":"Later, out by the gate, another girl noticed him and said to those standing around, “This man was with Jesus—from Nazareth.”"},{"num":72,"verse":"Again Peter denied it, this time with an oath. “I don’t even know the man,” he said."},{"num":73,"verse":"But after a while the men who had been standing there came over to him and said, “We know you are one of his disciples, for we can tell by your Galilean accent.”"},{"num":74,"verse":"Peter began to curse and swear. “I don’t even know the man,” he said."},{"num":75,"verse":"Then Peter remembered what Jesus had said, “Before the cock crows, you will deny me three times.” And he went away, crying bitterly."}]