[{"num":26,"verse":"And so this is what happened, finally. Jesus finished all His teaching, and He said to His disciples,"},{"num":3,"verse":"And almost as He spoke, the chief priests were getting together with the elders at the home of the high priest, Caiaphas. "},{"num":4,"verse":"They schemed and mused about how they could trick Jesus, sneak around and capture Him, and then kill Him."},{"num":6,"verse":"Meanwhile Jesus was at Bethany staying at the home of Simon the leper. "},{"num":7,"verse":"While He was at Simon’s house, a woman came to see Him. She had an alabaster flask of very valuable ointment with her, and as Jesus reclined at the table, she poured the ointment on His head. "},{"num":8,"verse":"The disciples, seeing this scene, were furious."},{"num":10,"verse":"Jesus knew what the disciples were saying among themselves, so He took them to task."},{"num":14,"verse":"At that, one of the twelve, Judas Iscariot, went to the chief priests."},{"num":16,"verse":"And from that moment, he began to watch for a chance to betray Jesus."},{"num":17,"verse":"On the first day of the Festival of Unleavened Bread, the disciples said to Jesus,"},{"num":19,"verse":"So the disciples went off, followed Jesus’ instructions, and got the Passover meal ready. "},{"num":20,"verse":"When evening came, Jesus sat down with the twelve. "},{"num":21,"verse":"And they ate their dinner."},{"num":22,"verse":"The disciples, of course, were horrified."},{"num":25,"verse":"At that, Judas, who was indeed planning to betray Him, said,"},{"num":26,"verse":"As they were eating, Jesus took some bread. He offered a blessing over the bread, and then He broke it and gave it to His disciples."},{"num":27,"verse":"And then He took the cup of wine, He made a blessing over it, and He passed it around the table."},{"num":30,"verse":"The meal concluded. Together, all the men sang a hymn of praise and thanksgiving, and then they took a late evening walk to the Mount of Olives."},{"num":36,"verse":"At that, Jesus led His disciples to the place called Gethsemane."},{"num":37,"verse":"Then He took Peter and the two sons of Zebedee with Him, and He grew sorrowful and deeply distressed."},{"num":39,"verse":"He walked a little farther and finally fell prostrate and prayed."},{"num":40,"verse":"When He came back to the disciples, He saw that they were asleep. Peter awoke a little less confident and slightly chagrined."},{"num":42,"verse":"With that, Jesus returned to His secluded spot to pray again."},{"num":43,"verse":"Again Jesus returned to His disciples and found them asleep. Their eyes were heavy-lidded. "},{"num":44,"verse":"So Jesus left them again and returned to prayer, praying the same sentiments with the same words. "},{"num":45,"verse":"Again He returned to His disciples."},{"num":47,"verse":"There he was, Judas, one of the twelve leading a crowd of people from the chief priests and elders with swords and clubs; the chief priests and the elders were right there, ready to arrest Jesus. "},{"num":48,"verse":"And Judas, the one who intended to betray Him, had said to the elders and the chief priests that he would give them a sign."},{"num":49,"verse":"So at once, he went up to Jesus."},{"num":51,"verse":"One of the men with Jesus grabbed his sword and swung toward the high priest’s slave, slicing off his ear."},{"num":57,"verse":"The crowd that had arrested Jesus took Him to Caiaphas, the high priest. The scribes and elders had gathered at Caiaphas’s house and were waiting for Jesus to be delivered. "},{"num":58,"verse":"Peter followed Jesus (though at some distance so as not to be seen). He slipped into Caiaphas’s house and attached himself to a group of servants. And he sat watching, waiting to see how things would unfold."},{"num":59,"verse":"The high priest and his council of advisors first produced false evidence against Jesus—false evidence meant to justify some charge and Jesus’ execution. "},{"num":60,"verse":"But even though many men were willing to lie, the council couldn’t come up with the evidence it wanted. Finally, two men stood up."},{"num":62,"verse":"Then Caiaphas the high priest stood up and addressed Jesus."},{"num":63,"verse":"Jesus remained silent."},{"num":65,"verse":"The high priest tore his robes and screeched."},{"num":67,"verse":"Then they spat in His face and hit Him. Some of them smacked Him, slapped Him across the cheeks, "},{"num":68,"verse":"and jeered."},{"num":69,"verse":"As all this was going on in Caiaphas’s chamber, Peter was sitting in the courtyard with some servants. One of the servant girls came up to him."},{"num":70,"verse":"And just as Jesus had predicted, Peter denied it before everyone."},{"num":71,"verse":"He went out to stand by the gate. And as he walked past, another servant girl recognized him."},{"num":72,"verse":"Again, just as Jesus had predicted, Peter denied it, swearing an oath."},{"num":73,"verse":"Peter then went to chat with a few of the servants. A little while later, some other servants approached him:"},{"num":74,"verse":"Cursing and swearing, Peter denied Him again."},{"num":75,"verse":"And Peter remembered. He remembered that Jesus had looked at him with something like pity and said, “This very night, before the cock crows in the morning, you will deny Me three times.” And Peter went outside, sat down on the ground, and wept."}]