[{"num":26,"verse":"And it came to pass, when Jesus finished all these words, he said to his disciples,"},{"num":2,"verse":"`Ye have known that after two days the passover cometh, and the Son of Man is delivered up to be crucified.'"},{"num":3,"verse":"Then were gathered together the chief priests, and the scribes, and the elders of the people, to the court of the chief priest who was called Caiaphas;"},{"num":4,"verse":"and they consulted together that they might take Jesus by guile, and kill [him],"},{"num":5,"verse":"and they said, `Not in the feast, that there may not be a tumult among the people.'"},{"num":6,"verse":"And Jesus having been in Bethany, in the house of Simon the leper,"},{"num":7,"verse":"there came to him a woman having an alabaster box of ointment, very precious, and she poured on his head as he is reclining (at meat)."},{"num":8,"verse":"And having seen [it], his disciples were much displeased, saying, `To what purpose [is] this waste?"},{"num":9,"verse":"for this ointment could have been sold for much, and given to the poor.'"},{"num":10,"verse":"And Jesus having known, said to them, `Why do ye give trouble to the woman? for a good work she wrought for me;"},{"num":11,"verse":"for the poor always ye have with you, and me ye have not always;"},{"num":12,"verse":"for she having put this ointment on my body -- for my burial she did [it]."},{"num":13,"verse":"Verily I say to you, Wherever this good news may be proclaimed in the whole world, what this [one] did shall also be spoken of -- for a memorial of her.'"},{"num":14,"verse":"Then one of the twelve, who is called Judas Iscariot, having gone unto the chief priests, said,"},{"num":15,"verse":"`What are ye willing to give me, and I will deliver him up to you?' and they weighed out to him thirty silverlings,"},{"num":16,"verse":"and from that time he was seeking a convenient season to deliver him up."},{"num":17,"verse":"And on the first [day] of the unleavened food came the disciples near to Jesus, saying to him, `Where wilt thou [that] we may prepare for thee to eat the passover?'"},{"num":18,"verse":"and he said, `Go away to the city, unto such a one, and say to him, The Teacher saith, My time is nigh; near thee I keep the passover, with my disciples;'"},{"num":19,"verse":"and the disciples did as Jesus appointed them, and prepared the passover."},{"num":20,"verse":"And evening having come, he was reclining (at meat) with the twelve,"},{"num":21,"verse":"and while they are eating, he said, `Verily I say to you, that one of you shall deliver me up.'"},{"num":22,"verse":"And being grieved exceedingly, they began to say to him, each of them, `Is it I, Sir?'"},{"num":23,"verse":"And he answering said, `He who did dip with me the hand in the dish, he will deliver me up;"},{"num":24,"verse":"the Son of Man doth indeed go, as it hath been written concerning him, but wo to that man through whom the Son of Man is delivered up! good it were for him if that man had not been born.'"},{"num":25,"verse":"And Judas -- he who delivered him up -- answering said, `Is it I, Rabbi?' He saith to him, `Thou hast said.'"},{"num":26,"verse":"And while they were eating, Jesus having taken the bread, and having blessed, did brake, and was giving to the disciples, and said, `Take, eat, this is my body;'"},{"num":27,"verse":"and having taken the cup, and having given thanks, he gave to them, saying, `Drink ye of it -- all;"},{"num":28,"verse":"for this is my blood of the new covenant, that for many is being poured out -- to remission of sins;"},{"num":29,"verse":"and I say to you, that I may not drink henceforth on this produce of the vine, till that day when I may drink it with you new in the reign of my Father.'"},{"num":30,"verse":"And having sung a hymn, they went forth to the mount of the Olives;"},{"num":31,"verse":"then saith Jesus to them, `All ye shall be stumbled at me this night; for it hath been written, I will smite the shepherd, and the sheep of the flock shall be scattered abroad;"},{"num":32,"verse":"but, after my having risen, I will go before you to Galilee.'"},{"num":33,"verse":"And Peter answering said to him, `Even if all shall be stumbled at thee, I will never be stumbled.'"},{"num":34,"verse":"Jesus said to him, `Verily I say to thee, that, this night, before cock-crowing, thrice thou wilt deny me.'"},{"num":35,"verse":"Peter saith to him, `Even if it may be necessary for me to die with thee, I will not deny thee;' in like manner also said all the disciples."},{"num":36,"verse":"Then come with them doth Jesus to a place called Gethsemane, and he saith to the disciples, `Sit ye here, till having gone away, I shall pray yonder.'"},{"num":37,"verse":"And having taken Peter, and the two sons of Zebedee, he began to be sorrowful, and to be very heavy;"},{"num":38,"verse":"then saith he to them, `Exceedingly sorrowful is my soul -- unto death; abide ye here, and watch with me.'"},{"num":39,"verse":"And having gone forward a little, he fell on his face, praying, and saying, `My Father, if it be possible, let this cup pass from me; nevertheless, not as I will, but as Thou.'"},{"num":40,"verse":"And he cometh unto the disciples, and findeth them sleeping, and he saith to Peter, `So! ye were not able one hour to watch with me!"},{"num":41,"verse":"watch, and pray, that ye may not enter into temptation: the spirit indeed is forward, but the flesh weak.'"},{"num":42,"verse":"Again, a second time, having gone away, he prayed, saying, `My Father, if this cup cannot pass away from me except I drink it, Thy will be done;'"},{"num":43,"verse":"and having come, he findeth them again sleeping, for their eyes were heavy."},{"num":44,"verse":"And having left them, having gone away again, he prayed a third time, saying the same word;"},{"num":45,"verse":"then cometh he unto his disciples, and saith to them, `Sleep on henceforth, and rest! lo, the hour hath come nigh, and the Son of Man is delivered up to the hands of sinners."},{"num":46,"verse":"Rise, let us go; lo, he hath come nigh who is delivering me up.'"},{"num":47,"verse":"And while he is yet speaking, lo, Judas, one of the twelve did come, and with him a great multitude, with swords and sticks, from the chief priests and elders of the people."},{"num":48,"verse":"And he who did deliver him up did give them a sign, saying, `Whomsoever I will kiss, it is he: lay hold on him;'"},{"num":49,"verse":"and immediately, having come to Jesus, he said, `Hail, Rabbi,' and kissed him;"},{"num":50,"verse":"and Jesus said to him, `Comrade, for what art thou present?' Then having come near, they laid hands on Jesus, and took hold on him."},{"num":51,"verse":"And lo, one of those with Jesus, having stretched forth the hand, drew his sword, and having struck the servant of the chief priest, he took off his ear."},{"num":52,"verse":"Then saith Jesus to him, `Turn back thy sword to its place; for all who did take the sword, by the sword shall perish;"},{"num":53,"verse":"dost thou think that I am not able now to call upon my Father, and He will place beside me more than twelve legions of messengers?"},{"num":54,"verse":"how then may the Writings be fulfilled, that thus it behoveth to happen?'"},{"num":55,"verse":"In that hour said Jesus to the multitudes, `As against a robber ye did come forth, with swords and sticks, to take me! daily with you I was sitting teaching in the temple, and ye did not lay hold on me;"},{"num":56,"verse":"but all this hath come to pass, that the Writings of the prophets may be fulfilled;' then all the disciples, having left him, fled."},{"num":57,"verse":"And those laying hold on Jesus led [him] away unto Caiaphas the chief priest, where the scribes and the elders were gathered together,"},{"num":58,"verse":"and Peter was following him afar off, unto the court of the chief priest, and having gone in within, he was sitting with the officers, to see the end."},{"num":59,"verse":"And the chief priests, and the elders, and all the council, were seeking false witness against Jesus, that they might put him to death,"},{"num":60,"verse":"and they did not find; and many false witnesses having come near, they did not find; and at last two false witnesses having come near,"},{"num":61,"verse":"said, `This one said, I am able to throw down the sanctuary of God, and after three days to build it.'"},{"num":62,"verse":"And the chief priest having stood up, said to him, `Nothing thou dost answer! what do these witness against thee?"},{"num":63,"verse":"and Jesus was silent. And the chief priest answering said to him, `I adjure thee, by the living God, that thou mayest say to us, if thou art the Christ -- the Son of God.'"},{"num":64,"verse":"Jesus saith to him, `Thou hast said; nevertheless I say to you, hereafter ye shall see the Son of Man sitting on the right hand of the power, and coming upon the clouds, of the heaven.'"},{"num":65,"verse":"Then the chief priest rent his garments, saying, -- `He hath spoken evil; what need have we yet of witnesses? lo, now ye heard his evil speaking;"},{"num":66,"verse":"what think ye?' and they answering said, `He is worthy of death.'"},{"num":67,"verse":"Then did they spit in his face and buffet him, and others did slap,"},{"num":68,"verse":"saying, `Declare to us, O Christ, who he is that struck thee?'"},{"num":69,"verse":"And Peter without was sitting in the court, and there came near to him a certain maid, saying, `And thou wast with Jesus of Galilee!'"},{"num":70,"verse":"And he denied before all, saying, `I have not known what thou sayest.'"},{"num":71,"verse":"And he having gone forth to the porch, another female saw him, and saith to those there, `And this one was with Jesus of Nazareth;'"},{"num":72,"verse":"and again did he deny with an oath -- `I have not known the man.'"},{"num":73,"verse":"And after a little those standing near having come, said to Peter, `Truly thou also art of them, for even thy speech doth make thee manifest.'"},{"num":74,"verse":"Then began he to anathematise, and to swear -- `I have not known the man;' and immediately did a cock crow,"},{"num":75,"verse":"and Peter remembered the saying of Jesus, he having said to him -- `Before cock-crowing, thrice thou wilt deny me;' and having gone without, he did weep bitterly."}]