[{"num":39,"verse":"1 He showeth the destruction of Gog, and Magog. 11 The graves of Gog and his host. 17 They shall be devoured of birds and beasts. 23 Wherefore the house of Israel is captive. 24 Their bringing again from captivity is promised."},{"num":1,"verse":"Therefore thou son of man, prophesy against Gog, and say, Thus saith the Lord God, Behold, I come against thee, O Gog, the chief prince of Meshech and Tubal."},{"num":2,"verse":"And I will destroy thee and leave but the sixth part of thee, and will cause thee to come up from the North parts, and will bring thee upon the mountains of Israel:"},{"num":3,"verse":"And I will smite thy bow out of thy left hand, and I will cause thine arrows to fall out of thy right hand."},{"num":4,"verse":"Thou shalt fall upon the mountains of Israel, and all thy bands and the people, that is with thee: for I will give thee unto the birds, and to every feathered fowl and beast of the field to be devoured."},{"num":5,"verse":"Thou shalt fall upon the open field: for I have spoken it, saith the Lord God."},{"num":6,"verse":"And I will send a fire on Magog, and among them that dwell safely in the isles, and they shall know that I am the Lord."},{"num":7,"verse":"So will I make mine holy Name known in the midst of my people Israel, and I will not suffer them to pollute mine holy Name anymore, and the heathen shall know that I am the Lord, the Holy one of Israel."},{"num":8,"verse":"Behold, it is come, and it is done, saith the Lord God: and this is the day whereof I have spoken."},{"num":9,"verse":"And they that dwell in the cities of Israel shall go forth, and shall burn and set fire upon the weapons, and on the shields, and bucklers, upon the bows, and upon the arrows, and upon the staves in their hands, and upon the spears, and they shall burn them with fire seven years."},{"num":10,"verse":"So that they shall bring no wood out of the field, neither cut down any out of the forests: for they shall burn the weapons with fire, and they shall rob those that robbed them, and spoil those that spoiled them, saith the Lord God."},{"num":11,"verse":"And at the same time will I give unto Gog a place there for burial in Israel, even the valley, whereby men go toward the East part of the sea: and it shall cause them that pass by, to stop their noses, and there shall they bury Gog with all his multitude: and they shall call it the valley of Hamon Gog."},{"num":12,"verse":"And seven months long shall the house of Israel be burying of them, that they may cleanse the land."},{"num":13,"verse":"Yea, all the people of the land shall bury them, and they shall have a name, when I shall be glorified, saith the Lord God."},{"num":14,"verse":"And they shall choose out men to go continually through the land with them that travail, to bury those that remain upon the ground, to cleanse it: they shall search to the end of seven months."},{"num":15,"verse":"And the travelers that pass through the land, if any see a man’s bone, then shall he set up a sign by it, till the buriers have buried it in the valley of Hamon Gog."},{"num":16,"verse":"And also the name of the city shall be Hamonah: thus shall they cleanse the land."},{"num":17,"verse":"And thou son of man, thus saith the Lord God, Speak unto every feathered fowl, and to all the beasts of the field, Assemble yourselves, and come: gather yourselves on every side to my sacrifice: for I do sacrifice a great sacrifice for you upon the mountains of Israel, that ye may eat flesh, and drink blood."},{"num":18,"verse":"Ye shall eat the flesh of the valiant, and drink the blood of the princes of the earth, of the weathers, of the lambs, and of the goats, and of bullocks, even of all fat beasts of Bashan."},{"num":19,"verse":"And ye shall eat fat till ye be full, and drink blood till ye be drunken of my sacrifice, which I have sacrificed for you."},{"num":20,"verse":"Thus you shall be filled at my table with horses and chariots, with valiant men, and with all men of war, saith the Lord God."},{"num":21,"verse":"And I will set my glory among the heathen, and all the heathen shall see my judgment, that I have executed, and mine hand, which I have laid upon them."},{"num":22,"verse":"So the house of Israel shall know, that I am the Lord their God from that day and so forth."},{"num":23,"verse":"And the heathen shall know that the house of Israel went into captivity for their iniquity, because they trespassed against me: therefore hid I my face from them, and gave them into the hand of their enemies: so fell they all by the sword."},{"num":24,"verse":"According to their uncleanness, and according to their transgressions have I done unto them, and hid my face from them."},{"num":25,"verse":"Therefore thus saith the Lord God, Now will I bring again the captivity of Jacob, and have compassion upon the whole house of Israel, and will be jealous for mine holy Name,"},{"num":26,"verse":"After that they have borne their shame, and all their transgression, whereby they have transgressed against me, when they dwelt safely in their land, and without fear of any."},{"num":27,"verse":"When I have brought them again from the people, and gathered them out of their enemies’ lands, and am sanctified in them in the sight of many nations,"},{"num":28,"verse":"Then shall they know, that I am the Lord their God, which caused them to be led into captivity among the heathen: but I have gathered them unto their own land, and have left none of them anymore there,"},{"num":29,"verse":"Neither will I hide my face anymore from them: for I have poured out my Spirit upon the house of Israel, saith the Lord God."}]