[{"header":"The Death of Gog and His Army"},{"num":39,"verse":"“Human being, prophesy against Gog and say: ‘This is what the Lord God says: I am against you, Gog, chief ruler of Meshech and Tubal. "},{"num":2,"verse":"I will turn you around and lead you. I will bring you from the far north. I will send you to attack the mountains of Israel. "},{"num":3,"verse":"I will knock your bow out of your left hand. I will throw down your arrows from your right hand. "},{"num":4,"verse":"You will fall dead on the mountains of Israel. You, all your troops and the nations with you will fall dead. I will let you be food for every bird that eats meat and every wild animal. "},{"num":5,"verse":"You will die in the country. I have spoken, says the Lord God. "},{"num":6,"verse":"I will send fire on Magog and those who live in safety on the coastlands. Then they will know that I am the Lord."},{"num":7,"verse":"“‘And I will make myself known among my people Israel. I will not let myself be dishonored anymore. Then the nations will know that I am the Lord. They will know I am the Holy One in Israel. "},{"num":8,"verse":"It is coming! It will happen, says the Lord God. The day I talked about is coming."},{"num":9,"verse":"“‘Then those who live in the cities of Israel will go out. They will make fires with the enemy’s weapons and burn them. They will burn both large and small shields. They will burn bows and arrows, war clubs and spears. They will use the weapons to burn in their fires for seven years. "},{"num":10,"verse":"They won’t need to take wood from the field or chop firewood from the forests. This is because they will make fires with the weapons. They will take the valuable things of those who took their valuable things. They will grab the things of those who grabbed their things, says the Lord God."},{"num":11,"verse":"“‘On that day I will give Gog a place to be buried in Israel. It will be the Valley of the Travelers, east of the Dead Sea. It will block the road for travelers. This is because Gog and all his army will be buried there. People will call it The Valley of Gog’s Army."},{"num":12,"verse":"“‘The people of Israel will be burying them for seven months to make the land clean again. "},{"num":13,"verse":"All the people of the land will bury them. The people of Israel will be honored on the day of my victory, says the Lord God."},{"num":14,"verse":"“‘They will choose men to work through the land to make it clean. With others they will bury Gog’s soldiers still lying dead on the ground. After the seven months are finished, they will still search. "},{"num":15,"verse":"They will go through the land. If one person sees a human bone, he will put a marker by it. The sign will stay there until the gravediggers come. They will bury the bone in The Valley of Gog’s Army. "},{"num":16,"verse":"A city will be there named Hamonah. So they will make the land clean again.’"},{"num":17,"verse":"“Human being, this is what the Lord God says: Speak to every kind of bird and wild animal: ‘Come together, come! Come together from all around to my sacrifice. I will prepare it for you. It is a great sacrifice on the mountains of Israel. Then you can eat flesh and drink blood. "},{"num":18,"verse":"You will eat the flesh of mighty men. You will drink the blood of the rulers of the earth. You will do it as people eat all the fat animals from Bashan: male sheep, lambs, goats and bulls. "},{"num":19,"verse":"You will eat and drink from my sacrifice which I have made ready for you. So you will eat fat until you are full. You will drink blood until you are drunk. "},{"num":20,"verse":"At my table you will eat until you are full of horses and riders and all kinds of soldiers,’ says the Lord God."},{"num":21,"verse":"“And I will show my greatness among the nations. All the nations will feel my power when I punish them. "},{"num":22,"verse":"From that day on the people of Israel will know that I am the Lord their God. "},{"num":23,"verse":"And the nations will know Israel was taken away captive because they turned against me. So I turned away from them. And I let their enemies defeat them. All of them died in war. "},{"num":24,"verse":"I punished them for their uncleanness and their sins. I turned away from them."},{"num":25,"verse":"“So this is what the Lord God says: Now I will bring the people of Jacob back from captivity. I will have mercy on the whole nation of Israel. I will not let them dishonor me. "},{"num":26,"verse":"The people will forget their shame. And they will forget how they rejected me. They will live in safety on their own land. No one will make them afraid. "},{"num":27,"verse":"I will bring the people back from other lands. I will gather them from the lands of their enemies. That is how I will show that I am holy through my people. And many nations will see that I am holy. "},{"num":28,"verse":"Then my people will know that I am the Lord their God. This is because I sent them into captivity among the nations. But then I brought them back to their own land. And I didn’t leave any behind. "},{"num":29,"verse":"I will not turn away from them anymore. I will put my Spirit into the people of Israel, says the Lord God.”"}]