[{"header":"Paul’s Introduction"},{"num":1,"verse":"Dear friends,"},{"num":2,"verse":"I’m writing this letter to all the devoted believers who have been made holy by being one with Jesus, the Anointed One."},{"header":"Our Sonship and the Father’s Plan"},{"num":3,"verse":"Every spiritual blessing in the heavenly realm has already been lavished upon us as a love gift from our wonderful heavenly Father, the Father of our Lord Jesus—all because he sees us wrapped into Christ. This is why we celebrate him with all our hearts!"},{"num":4,"verse":"And in love he chose us before he laid the foundation of the universe! Because of his great love, he ordained us, so that we would be seen as holy in his eyes with an unstained innocence."},{"num":5,"verse":"For it was always in his perfect plan to adopt us as his delightful children, through our union with Jesus, the Anointed One, so that his tremendous love that cascades over us would glorify his grace—for the same love he has for the Beloved, Jesus, he has for us. And this unfolding plan brings him great pleasure!"},{"num":7,"verse":"Since we are now joined to Christ, we have been given the treasures of redemption by his blood—the total cancellation of our sins—all because of the cascading riches of his grace. "},{"num":8,"verse":"This superabundant grace is already powerfully working in us, releasing all forms of wisdom and practical understanding. "},{"num":9,"verse":"And through the revelation of the Anointed One, he unveiled his secret desires to us—the hidden mystery of his long-range plan, which he was delighted to implement from the very beginning of time. "},{"num":10,"verse":"And because of God’s unfailing purpose, this detailed plan will reign supreme through every period of time until the fulfillment of all the ages finally reaches its climax—when God makes all things new in all of heaven and earth through Jesus Christ."},{"num":11,"verse":"Through our union with Christ we too have been claimed by God as his own inheritance. Before we were even born, he gave us our destiny; that we would fulfill the plan of God who always accomplishes every purpose and plan in his heart. "},{"num":12,"verse":"God’s purpose was that we Jews, who were the first to long for the messianic hope, would be the first to believe in the Anointed One and bring great praise and glory to God!"},{"num":13,"verse":"And because of him, when you who are not Jews heard the revelation of truth, you believed in the wonderful news of salvation. Now we have been stamped with the seal of the promised Holy Spirit."},{"num":14,"verse":"He is given to us like an engagement ring, as the first installment of what’s coming! He is our hope-promise of a future inheritance which seals us until we have all of redemption’s promises and experience complete freedom—all for the supreme glory and honor of God!"},{"header":"Paul Prays for the Spirit of Wisdom and Revelation"},{"num":15,"verse":"Because of this, since I first heard about your strong faith in the Lord Jesus Christ and your tender love toward all his devoted ones, "},{"num":16,"verse":"my heart is always full and overflowing with thanks to God for you as I constantly remember you in my prayers. "},{"num":17,"verse":"I pray that the Father of glory, the God of our Lord Jesus Christ, would impart to you the riches of the Spirit of wisdom and the Spirit of revelation to know him through your deepening intimacy with him."},{"num":18,"verse":"I pray that the light of God will illuminate the eyes of your imagination, flooding you with light, until you experience the full revelation of the hope of his calling—that is, the wealth of God’s glorious inheritances that he finds in us, his holy ones!"},{"num":19,"verse":"I pray that you will continually experience the immeasurable greatness of God’s power made available to you through faith. Then your lives will be an advertisement of this immense power as it works through you! This is the mighty power "},{"num":20,"verse":"that was released when God raised Christ from the dead and exalted him to the place of highest honor and supreme authority in the heavenly realm! "},{"num":21,"verse":"And now he is exalted as first above every ruler, authority, government, and realm of power in existence! He is gloriously enthroned over every name that is ever praised, not only in this age, but in the age that is coming!"},{"num":22,"verse":"And he alone is the leader and source of everything needed in the church. God has put everything beneath the authority of Jesus Christ and has given him the highest rank above all others. "},{"num":23,"verse":"And now we, his church, are his body on the earth and that which fills him who is being filled by it!"}]