[{"num":139,"verse":"O Lord, you have examined my heart and know everything about me. "},{"num":2,"verse":"You know when I sit or stand. When far away you know my every thought. "},{"num":3,"verse":"You chart the path ahead of me and tell me where to stop and rest. Every moment you know where I am. "},{"num":4,"verse":"You know what I am going to say before I even say it. "},{"num":5,"verse":"You both precede and follow me and place your hand of blessing on my head."},{"num":6,"verse":"This is too glorious, too wonderful to believe! "},{"num":7,"verse":"I can never be lost to your Spirit! I can never get away from my God! "},{"num":8,"verse":"If I go up to heaven, you are there; if I go down to the place of the dead, you are there. "},{"num":9,"verse":"If I ride the morning winds to the farthest oceans, "},{"num":10,"verse":"even there your hand will guide me, your strength will support me. "},{"num":11,"verse":"If I try to hide in the darkness, the night becomes light around me. "},{"num":12,"verse":"For even darkness cannot hide from God; to you the night shines as bright as day. Darkness and light are both alike to you."},{"num":13,"verse":"You made all the delicate, inner parts of my body and knit them together in my mother’s womb. "},{"num":14,"verse":"Thank you for making me so wonderfully complex! It is amazing to think about. Your workmanship is marvelous—and how well I know it. "},{"num":15,"verse":"You were there while I was being formed in utter seclusion! "},{"num":16,"verse":"You saw me before I was born and scheduled each day of my life before I began to breathe. Every day was recorded in your book!"},{"num":17,"verse":"How precious it is, Lord, to realize that you are thinking about me constantly! I can’t even count how many times a day your thoughts turn toward me. And when I waken in the morning, you are still thinking of me!"},{"num":19,"verse":"Surely you will slay the wicked, Lord! Away, bloodthirsty men! Begone! "},{"num":20,"verse":"They blaspheme your name and stand in arrogance against you—how silly can they be? "},{"num":21,"verse":"O Lord, shouldn’t I hate those who hate you? Shouldn’t I be grieved with them? "},{"num":22,"verse":"Yes, I hate them, for your enemies are my enemies too."},{"num":23,"verse":"Search me, O God, and know my heart; test my thoughts. "},{"num":24,"verse":"Point out anything you find in me that makes you sad, and lead me along the path of everlasting life."}]