[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is not this the word that we did tell thee . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?—At one time they had refused to listen to Moses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") but in the main they had acquiesced in his proceedings, and allowed him to act in their name. The reproach was therefore unjust and undeserved; but it is in human nature to make such reproaches in times of danger and difficulty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:10-14 There was no way open to Israel but upward, and thence their deliverance came. We may be in the way of duty, following God, and hastening toward heaven, yet may be troubled on every side. Some cried out unto the Lord; their fear led them to pray, and that was well. God brings us into straits, that he may bring us to our knees. Others cried out against Moses; fear set them murmuring as if God were not still able to work miracles. They quarrel with Moses for bringing them out of Egypt; and so were angry with God for the greatest kindness ever done them; thus gross are the absurdities of unbelief. Moses says, Fear ye not. It is always our duty and interest, when we cannot get out of troubles, yet to get above our fears; let them quicken our prayers and endeavours, but not silence our faith and hope. Stand still, think not to save yourselves either by fighting or flying; wait God's orders, and observe them. Compose yourselves, by confidence in God, into peaceful thoughts of the great salvation God is about to work for you. If God brings his people into straits, he will find a way to bring them out.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let us alone - This is a gross exaggeration, yet not without a semblance of truth: for although the Israelites welcomed the message of Moses at first, they gave way completely at the first serious trial. See the reference in the margin. The whole passage foreshadows the conduct of the people in the wilderness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. when Pharaoh drew nigh, the children of Israel lifted up their eyes—The great consternation of the Israelites is somewhat astonishing, considering their vast superiority in numbers, but their deep dismay and absolute despair at the sight of this armed host receives a satisfactory explanation from the fact that the civilized state of Egyptian society required the absence of all arms, except when they were on service. If the Israelites were entirely unarmed at their departure, they could not think of making any resistance [Wilkinson and Hengstenberg].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is not this the word that we did tell thee in Egypt,.... The thing they suggested to him, and talked with him about while they were in the land of Egypt, before they came out of it, particularly after their service and bondage were made more severe and cruel upon Moses and Aaron's demanding their dismission, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, let us alone, that we may serve the Egyptians? peaceably and quietly, as we have been used to do, since there is no likelihood of being freed, and since we are more evilly treated than before: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for it had been better for us to serve the Egyptians, than that we should die in the wilderness: of such mean spirits were they, and had so poor a notion of, and taste for liberty, and so ungrateful were they to their deliverer. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for it had been better for us to serve the Egyptians, than that we should die in the wilderness: of such mean spirits were they, and had so poor a notion of, and taste for liberty, and so ungrateful were they to their deliverer. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Is not this the word that we did tell thee in Egypt, saying, Let {g} us alone, that we may serve the Egyptians? For it had been better for us to serve the Egyptians, than that we should die in the wilderness.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "Is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not this the word that we did tell thee in Egypt, saying, Let ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " us alone, that we may serve the Egyptians? For ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it had been",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " better for us to serve the Egyptians, than that we should die in the wilderness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Such is the impatience of the flesh, that it cannot wait for God's appointed time.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They even declare that while they were still in Egypt they had been unfavourable to Moses’ plan. This is not mentioned before: in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they listen to Moses gladly; at most, they had blamed Moses when they found increased labour imposed upon them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (P) nothing like the words here used is placed in their mouth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Is not this the word that we did tell thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The reference was probably to that time of depression, after their burdens had been increased, and before the series of miracles began, when the Israelites had addressed reproaches to Moses and Aaron (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and refused to listen to words of encouragement (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was not true that they had uniformly held the same language, and desired Moses and Aaron to cease their efforts. It had been better for us to serve the Egyptians than that we should die. The spirit to prefer death to slavery, where they are the only alternatives, is not a common one; and we must not be surprised that a people which had grown up in servitude and had no traditions of national independence did not rise to the heroic height attained under other circumstances by Greeks, by Switzers. and by Poles. It would have been most extraordinary had they done so. Exodus 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the Israelites saw the advancing army of the Egyptians, they were greatly alarmed; for their situation to human eyes was a very unfortunate one. Shut in on the east by the sea, on the south and west by high mountains, and with the army of the Egyptians behind them, destruction seemed inevitable, since they were neither outwardly armed nor inwardly prepared for a successful battle. Although they cried unto the Lord, they had no confidence in His help, notwithstanding all the previous manifestation so the fidelity of the true God; they therefore gave vent to the despair of their natural heart in complaints against Moses, who had brought them out of the servitude of Egypt to give them up to die in the desert. \"Hast thou, because there were no graves at all (אין מבּלי, a double negation to give emphasis) in Egypt, fetched us to die in the desert?\" Their further words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " exaggerated the true state of the case from cowardly despair. For it was only when the oppression increased, after Moses' first interview with Pharaoh, that they complained of what Moses had done (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whereas at first they accepted his proposals most thankfully (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and even afterwards implicitly obeyed his directions. ",
        "children": []
      }
    ]
  }
]