[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The chariots, and the horsemen, and all the host . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This translation is misleading. The Heb. runs thus: “The chariots and the horsemen (who were) all the host of Pharaoh that came into the sea.” It is implied that his footmen did not enter the sea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There remained not so much as one of them.—The armour of an Egyptian warrior would make it impossible for him to escape by swimming from such a catastrophe. All who were caught by the tide would certainly be drowned. The question whether the Pharaon was drowned or no cannot be ruled by the expression here used, nor by any parallel one in the Psalms (Psalm 78:53; Psalm 106:11); it depends on more general considerations. In the first place, is it likely that if the Pharaoh had been killed there would have been no explicit mention of it? Would the point have remained one open to question? Secondly, if the Pharaoh had been killed, would the Egyptian annals have retained no trace of it? Must we not have had some account of a great king cut off in the flower of his age, after a reign of two, or at the most three, years? (Comp. Exodus 2:23; Exodus 4:19, &c.) But Menephthah, to whom all the indications point, reigned at least eight years. The latter part of his reign was inglorious, and he left the empire a prey to pretenders; but he was not suddenly cut off after reigning a year or two. Thirdly, was an Egyptian king sure to lead an attack, and place himself in the position of most peril? This has been asserted, and it is so far true, that most Egyptian kings, according to the records which they have left of themselves, so acted. But it happens that Menephthah records it of himself that on one great occasion, at any rate, he kept himself out of danger. His country was invaded by a vast army of Libyans and others from the northwest in the fifth year of his reign; the assailants menaced his chief cities, and the peril was great. Menephthah collected all his forces to meet the danger, but declined to lead them out in person, pretending that one of the Egyptian gods, Phthah, had forbidden him to quit Memphis (Brugsch, History of Egypt, vol. ii., p. 119). It is thus quite probable that he would remain with the reserve of footmen when the chariots and horsemen entered the bed of the sea.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "There remained not so much as one of them.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The armour of an Egyptian warrior would make it impossible for him to escape by swimming from such a catastrophe. All who were caught by the tide would certainly be drowned. The question whether the Pharaon was drowned or no cannot be ruled by the expression here used, nor by any parallel one in the Psalms (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:53",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); it depends on more general considerations. In the first place, is it likely that if the Pharaoh had been killed there would have been no explicit mention of it? Would the point have remained one open to question? Secondly, if the Pharaoh had been killed, would the Egyptian annals have retained no trace of it? Must we not have had some account of a great king cut off in the flower of his age, after a reign of two, or at the most three, years? (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 4:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c.) But Menephthah, to whom all the indications point, reigned at least eight years. The latter part of his reign was inglorious, and he left the empire a prey to pretenders; but he was not suddenly cut off after reigning a year or two. Thirdly, was an Egyptian king sure to lead an attack, and place himself in the position of most peril? This has been asserted, and it is so far true, that ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "most ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Egyptian kings, according to the records which they have left of themselves, so acted. But it happens that Menephthah records it of himself that on one great occasion, at any rate, he kept himself out of danger. His country was invaded by a vast army of Libyans and others from the northwest in the fifth year of his reign; the assailants menaced his chief cities, and the peril was great. Menephthah collected all his forces to meet the danger, but declined to lead them out in person, pretending that one of the Egyptian gods, Phthah, had forbidden him to quit Memphis (Brugsch, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "History of Egypt, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "vol. ii., p. 119). It is thus quite probable that he would remain with the reserve of footmen when the chariots and horsemen entered the bed of the sea.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:21-31 The dividing the Red sea was the terror of the Canaanites, Jos 2:9; the praise and triumph of the Israelites, Ps 114:3; 106:9; 136:13. It was a type of baptism, 1Co 10:1,2. Israel's passage through it was typical of the conversion of souls, Isa 11:15; and the Egyptians being drowned in it was typical of the final ruin of all unrepenting sinners. God showed his almighty power, by opening a passage through the waters, some miles over. God can bring his people through the greatest difficulties, and force a way where he does not find it. It was an instance of his wonderful favour to his Israel. They went through the sea, they walked upon dry land in the midst of the sea. This was done, in order to encourage God's people in all ages to trust him in the greatest straits. What cannot he do who did this? What will not he do for those that fear and love him, who did this for these murmuring, unbelieving Israelites? Then followed the just and righteous wrath of God upon his and his people's enemies. The ruin of sinners is brought on by their own rage and presumption. They might have let Israel alone, and would not; now they would flee from the face of Israel, and cannot. Men will not be convinced, till it is too late, that those who meddle with God's people, meddle to their own hurt. Moses was ordered to stretch out his hand over the sea; the waters returned, and overwhelmed all the host of the Egyptians. Pharaoh and his servants, who had hardened one another in sin, now fell together, not one escaped. The Israelites saw the Egyptians dead upon the sands. The sight very much affected them. While men see God's works, and feel the benefit, they fear him and trust in him. How well were it for us, if we were always in as good a frame as sometimes! Behold the end to which a Christian may look forward. His enemies rage, and are mighty; but while he holds fast by God, he shall pass the waves in safety guarded by that very power of his Saviour, which shall come down on every spiritual foe. The enemies of his soul whom he hath seen to-day, he shall see no more for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Not so much as one of them - Escape would be impossible ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pharaoh's destruction, independent of the distinct statement of the Psalmist, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 136:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was in fact inevitable. The station of the king was in the vanguard: on every monument the Pharaoh is represented as the leader of the army. The death of the Pharaoh, and the entire loss of the chariotry and cavalry accounts for the undisturbed retreat of the Israelites through a district then subject to Egypt and easily accessible to their forces. If, as appears probable, Tothmosis II was the Pharaoh, the first recorded expedition into the Peninsula took place 17 years after his death; and 22 years elapsed before any measures were taken to recover the lost ascendancy of Egypt in Syria. So complete, so marvelous was the deliverance: thus the Israelites were \"baptized unto Moses in the cloud and in the sea\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When they left Baal-Zephon they were separated finally from the idolatry of Egypt: when they passed the Red Sea their independence of its power was sealed; their life as a nation then began, a life inseparable henceforth from belief in Yahweh and His servant Moses, only to be merged in the higher life revealed by His Son. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. there remained not so much as one of them—It is surprising that, with such a declaration, some intelligent writers can maintain there is no evidence of the destruction of Pharaoh himself (Ps 106:11).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "After them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. after the children of Israel. Note here, the relative is put without an antecedent before it; the antecedent being to be understood and gathered out of the following verse, or out of the course of the story. An observation which is very useful for the understanding of many scriptures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Genesis 3:1\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the waters returned,.... To their place, and so in the above tradition related by Diodorus Siculus, it is said that the sea returning with a mighty force was restored to its place again; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and covered the chariots and the horsemen; the wall they made being much higher than a man on horseback, when they fell down, covered even those who had the advantage of horses and chariots; and much more must the infantry be covered by them, who may be meant in the next clause: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the host of Pharaoh that came into the sea after them; the foot, that went into the sea after the chariots and horsemen, or the whole army, including the cavalry and infantry, which went into the sea after the children of Israel. Who this Pharaoh was is not agreed; according to Berosus (x) his name was Cenchres, or Chenchres, whom Acherres succeeded; according to Bishop Usher (y) it was Amenophis; but our English poet (z) calls him Busiris; though Strabo (a) says there was no king or governor of that name. Diodorus Siculus (b) indeed speaks of two so called; yet he elsewhere (c) says, not that there was any king of the name, only the sepulchre of Osiris was so called: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there remained not so much as one of them; wherefore it must be a falsehood which is related by some, that Pharaoh himself was preserved, and afterwards reigned in Nineveh (d), since not one was saved; see Psalm 106:11 and so Artapanus (e) the Heathen says, they all perished, and among these are said (f) to be Jannes and Jambres, the magicians of Egypt mentioned in 2 Timothy 3:8 but this is contradicted by those (g) who ascribe the making of the golden calf to them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there remained not so much as one of them; wherefore it must be a falsehood which is related by some, that Pharaoh himself was preserved, and afterwards reigned in Nineveh (d), since not one was saved; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so Artapanus (e) the Heathen says, they all perished, and among these are said (f) to be Jannes and Jambres, the magicians of Egypt mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but this is contradicted by those (g) who ascribe the making of the golden calf to them. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Antiqu. l. 5. fol. 88. 2. & 90. 2.((y) Annal. Vet. Test. p. 19. (z) \"-------whose waves o'erthrew Busiris, and his Memphian chivalry.\" Milton's Paradise Lost, B. 1. v. 306, 307. (a) Geograph. l. 17. p. 552. (b) Bibliothec. l. 1. p. 42. (c) Bibliothec. l. 1. p. 79. (d) Dibre Hayamim, fol. 13. 2.((e) Ut supra. (Apud Euseb. Praepar. Evangel. l. 9. c. 27. p. 436.) (f) Midrash in Exodus 15.10. & Arab. MS. apud Gregory's Notes & Observ. p. 6. (g) Shalshalet, fol. 7. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Antiqu. l. 5. fol. 88. 2. & 90. 2.((y) Annal. Vet. Test. p. 19. (z) \"-------whose waves o'erthrew Busiris, and his Memphian chivalry.\" Milton's Paradise Lost, B. 1. v. 306, 307. (a) Geograph. l. 17. p. 552. (b) Bibliothec. l. 1. p. 42. (c) Bibliothec. l. 1. p. 79. (d) Dibre Hayamim, fol. 13. 2.((e) Ut supra. (Apud Euseb. Praepar. Evangel. l. 9. c. 27. p. 436.) (f) Midrash in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".10. & Arab. MS. apud Gregory's Notes & Observ. p. 6. (g) Shalshalet, fol. 7. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the waters returned, and covered the chariots, and the horsemen, and all the host of Pharaoh that came into the sea after them; there remained not so much as one of them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The chariots and the horsemen, and all the host of Pharaoh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Rather \"The chariots, and the chariot men of all the host of Pharaoh.\" So Knobel correctly. Kalisch thinks - \"We are not permitted to suppose that only the Egyptian chariots pursued the Israelites into the sea, while the infantry remained behind, so that the former alone were devoured by the waves.\" But even he admits that \"both in this and in the following chapter, and in most other parts generally, the destruction of the chariots (chariot force?) and its warriors is chiefly alluded to, so ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that this particular stress would perhaps justify that conclusion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".\" What is clear is, that no force but the chariot force is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to have entered the bed of the sea in pursuit of Israel. There remained not so much as one of them. On the proper understanding of this statement, see the introductory paragraph to the chapter. Exodus 14:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then God directed Moses to stretch out his staff again over the sea, and the sea came back with the turning of the morning (when the morning turned, or approached) to its position (איתן perennitas, the lasting or permanent position), and the Egyptians were flying to meet it. \"When the east wind which divided the sea ceased to blow, the sea from the north and south began to flow together on the western side;\" whereupon, to judge from Exo 15:10, the wind began immediately to blow from the west, and drove the waves in the face of the flying Egyptians. \"And thus Jehovah shook the Egyptians (i.e., plunged them into the greatest confusion) in the midst of the sea,\" so that Pharaoh's chariots and horsemen, to the very last man, were buried in the waves. ",
        "children": []
      }
    ]
  }
]