[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Israel saw that great work.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The destruction of the Pharaoh’s chariot force and cavalry in the Red Sea secured the retreat of Israel, and saved them from any further molestation at the hands of the Egyptians. The spirit of the nation was effectually broken for the time; and it was not till after several reigns, and an interval of anarchy, that there was a revival. The king himself probably despaired of effecting anything against a foe that was supernaturally protected; and the army, having lost the flower of the chariot force, on which it mainly depended for success, desired no further contest. The Israelites, as will be seen further on, in their rapid march to Sinai avoided the Egyptian settlements, and having once reached the Sinaitic region, they were beyond the dominion of Egypt, and for forty years quite out of the path of Egyptian conquest. The episode in the life of the nation begun by the descent of Jacob into Egypt now terminated, and a fresh beginning was made. In the open air of the desert, cut off from all other races, admitted to close communion with Jehovah, the people entered upon that new and higher existence which culminated in the teaching of the prophets, in the noble struggles of Ezra and Nehemiah, and in the memorable stand on behalf of religious truth and national independence which was made by the Maccabees.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 14:31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people feared the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This great work, which the Lord had done upon the Egyptians, was a means of begetting in them, for the present at least, awful thoughts of God, and devout affections toward him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they believed the Lord and his servant Moses — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Now they were ashamed of their distrusts and murmurings; and in the mind they were in, they would never again despair of help from heaven, no, not in the greatest straits! They would never again quarrel with Moses, nor talk of returning to Egypt. How well were it for us if we were always in as good a frame as we are in sometimes!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:21-31 The dividing the Red sea was the terror of the Canaanites, Jos 2:9; the praise and triumph of the Israelites, Ps 114:3; 106:9; 136:13. It was a type of baptism, 1Co 10:1,2. Israel's passage through it was typical of the conversion of souls, Isa 11:15; and the Egyptians being drowned in it was typical of the final ruin of all unrepenting sinners. God showed his almighty power, by opening a passage through the waters, some miles over. God can bring his people through the greatest difficulties, and force a way where he does not find it. It was an instance of his wonderful favour to his Israel. They went through the sea, they walked upon dry land in the midst of the sea. This was done, in order to encourage God's people in all ages to trust him in the greatest straits. What cannot he do who did this? What will not he do for those that fear and love him, who did this for these murmuring, unbelieving Israelites? Then followed the just and righteous wrath of God upon his and his people's enemies. The ruin of sinners is brought on by their own rage and presumption. They might have let Israel alone, and would not; now they would flee from the face of Israel, and cannot. Men will not be convinced, till it is too late, that those who meddle with God's people, meddle to their own hurt. Moses was ordered to stretch out his hand over the sea; the waters returned, and overwhelmed all the host of the Egyptians. Pharaoh and his servants, who had hardened one another in sin, now fell together, not one escaped. The Israelites saw the Egyptians dead upon the sands. The sight very much affected them. While men see God's works, and feel the benefit, they fear him and trust in him. How well were it for us, if we were always in as good a frame as sometimes! Behold the end to which a Christian may look forward. His enemies rage, and are mighty; but while he holds fast by God, he shall pass the waves in safety guarded by that very power of his Saviour, which shall come down on every spiritual foe. The enemies of his soul whom he hath seen to-day, he shall see no more for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Not so much as one of them - Escape would be impossible ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pharaoh's destruction, independent of the distinct statement of the Psalmist, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 136:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was in fact inevitable. The station of the king was in the vanguard: on every monument the Pharaoh is represented as the leader of the army. The death of the Pharaoh, and the entire loss of the chariotry and cavalry accounts for the undisturbed retreat of the Israelites through a district then subject to Egypt and easily accessible to their forces. If, as appears probable, Tothmosis II was the Pharaoh, the first recorded expedition into the Peninsula took place 17 years after his death; and 22 years elapsed before any measures were taken to recover the lost ascendancy of Egypt in Syria. So complete, so marvelous was the deliverance: thus the Israelites were \"baptized unto Moses in the cloud and in the sea\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When they left Baal-Zephon they were separated finally from the idolatry of Egypt: when they passed the Red Sea their independence of its power was sealed; their life as a nation then began, a life inseparable henceforth from belief in Yahweh and His servant Moses, only to be merged in the higher life revealed by His Son. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30. Israel saw the Egyptians dead upon the sea-shore, &c.—The tide threw them up and left multitudes of corpses on the beach; a result that brought greater infamy on the Egyptians, but that tended, on the other hand, to enhance the triumph of the Israelites, and doubtless enriched them with arms, which they had not before. The locality of this famous passage has not yet been, and probably never will be, satisfactorily fixed. Some place it in the immediate neighborhood of Suez; where, they say, the part of the sea is most likely to be affected by \"a strong east wind\" [Ex 14:21]; where the road from the defile of Migdol (now Muktala) leads directly to this point; and where the sea, not above two miles broad, could be crossed in a short time. The vast majority, however, who have examined the spot, reject this opinion, and fix the passage, as does local tradition, about ten or twelve miles further down the shore at Wady Tawarik. \"The time of the miracle was the whole night, at the season of the year, too, when the night would be about its average length. The sea at that point extends from six and a half to eight miles in breadth. There was thus ample time for the passage of the Israelites from any part of the valley, especially considering their excitement and animation by the gracious and wonderful interposition of Providence in their behalf\" [Wilson].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Israel saw the great work,.... Or \"hand\" (l); the hand of the Lord, the mighty power of God, and took notice of it, and seriously considered the greatness of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which the Lord did upon the Egyptians; which mighty hand he laid upon them, and which great power he exercised on them, and which great work, the effect thereof, he wrought in destroying them in such a manner, by causing the waters, which divided for them and their safety, to return upon the Egyptians to their utter destruction: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the people feared the Lord; had an awe of his power and greatness upon their minds, and a sense of his goodness to them upon their hearts, which influenced their fear of him, and caused them to fear him with a filial and godly fear: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and believed the Lord and his servant Moses; they believed the Lord to be the only Jehovah, the supreme Being, the one only living and true God, faithful to his word, able to do all things, and wise to do them in the fittest season, for his own glory and his people's good; and they believed his promises, and the fulfilment of them; and that as he had now saved them out of the hands of the Egyptians, he would bring them to the land of Canaan, which he had promised their fathers to give unto them; and they believed Moses was sent of God to be their deliverer out of Egypt, and to be their leader to the promised land; see Psalm 106:12 and who were now by the apostle said to be baptized unto Moses in the cloud and in the sea, 1 Corinthians 10:1 and of their passage through the Red sea under the direction of Moses being an emblem of baptism; see Gill on 1 Corinthians 10:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and believed the Lord and his servant Moses; they believed the Lord to be the only Jehovah, the supreme Being, the one only living and true God, faithful to his word, able to do all things, and wise to do them in the fittest season, for his own glory and his people's good; and they believed his promises, and the fulfilment of them; and that as he had now saved them out of the hands of the Egyptians, he would bring them to the land of Canaan, which he had promised their fathers to give unto them; and they believed Moses was sent of God to be their deliverer out of Egypt, and to be their leader to the promised land; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and who were now by the apostle said to be baptized unto Moses in the cloud and in the sea, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and of their passage through the Red sea under the direction of Moses being an emblem of baptism; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l)  Sept. Manum, Pagninus, Montanus, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l)  Sept. Manum, Pagninus, Montanus, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Israel saw that great work which the LORD did upon the Egyptians: and the people feared the LORD, and believed the LORD, and his {n} servant Moses.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Israel saw that great work which the LORD did upon the Egyptians: and the people feared the LORD, and believed the LORD, and his ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " servant Moses.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) That is, the doctrine which he taught them in the Name of the Lord.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The effects of the great deliverance thus wrought for Israel: an increased fear of God, and belief in God, and also in Moses’ Divine commission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", fig. for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "act",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believed in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘The idiom rendered “he believed in” (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "האמין ב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a very striking one: the belief intended is, not merely a crediting of a testimony concerning a person or a thing (this would be ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "האמין ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "laying firm hold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " morally ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a person or a thing, without the help of any intermediate agency’ (Cheyne, s.v. Faith in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "EB.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The root idea of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "האמין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shew firmness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "steadiness towards",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a person or a word: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 39:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " RVm., and the cognate subst. in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lex.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Moses’ hands were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "firmness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his servant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A title applied to Moses elsewhere in the Pent. only ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (both JE). It is very common in the book of Joshua (mostly in parts which are the work of the Deuteronomic editor): ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 8:31; Jos 8:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 11:12; Jos 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 22:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 22:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 31.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Israel saw that great work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"work\" was, at the least, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the (almost) entire destruction of that arm of the service - the chariot force-on which the Egyptian kings mainly relied for success in all their wars; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the defeat and disgrace of the Egyptian king himself, in an expedition for which he was alone responsible, involving permanent discredit to his military capacity, and naturally tending to shake his authority over his subjects. It secured the Israelites from further persecution, mainly by the reminiscences which it left behind, but partly also by removing them to a distance from the natural course of Egyptian warlike or commercial movement. Though Egypt had mining establishments in the Sinaitic peninsula, at Wady-Magharah and Sarabit-el-Khadim, yet as these were avoided by the Israelites on their way to Sinai, and never afterwards approached, there naturally was no collision between them and the Pharaonic garrisons at those sites. Still more remote were they during their wanderings from the Egyptian military route, which proceeded along the coast from Pelusium to Gaza, and then ran northwards through the Shephelah. Thus the Passage of the Red Sea brought one phase in the life of the people to an end, and was the commencement of another. It separated them from Egypt until the time came when their king would hold communication with its monarch on equal terms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It secured their independence, and raised them at once into a nation. It further caused them to exchange the artificial life of a bureaucratical and convention-loving community for the open space and untrammelled freedom of the desert. It thus rejuvenated and reinvigorated the race, and enabled them to enter on that career of conquest which culminated in the Kingdom -  may we not say the Empire? - of David. some writers have supposed that the blow to the Egyptian power was greater than here represented. They believe the entire warrior caste or class to have taken part in the expedition, and to have been destroyed in the Red Sea Thus they describe the calamity as \"the total annihilation of the whole military force of the Egyptians\" (Kalisch). They also believe the Pharaoh to have perished with his host. To the present writer it seems that the former opinion is contrary both to the text of Scripture, and to the after course of Egyptian history, for it is agreed on all hands that Egypt continued nearly as powerful as before, while the latter he regards as at least exceedingly doubtful. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is quoted as asserting it; but it appears to him ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that \"overthrow\" is not necessarily \"death;\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that \"Pharaoh and his host ' may be put for \"Pharaoh's host\" by ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hendiadys. The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " absence of any prophecy that God would take the Pharaoh's life, and the entire silence of Moses on the subject in chs. 14. and 15. seems to be scarcely explicable on any other theory than that he escaped, not having accompanied his chariot force in its rash pursuit of the Israelites.  ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Exodus 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"The great hand:\" i.e., the might which Jehovah had displayed upon Egypt. In addition to the glory of God through the judgment upon Pharaoh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the guidance of Israel through the sea was also designed to establish Israel still more firmly in the fear of the Lord and in faith. But faith in the Lord was inseparably connected with faith in Moses as the servant of the Lord. Hence the miracle was wrought through the hand and staff of Moses. But this second design of the miraculous guidance of Israel did not exclude the first, viz., glory upon Pharaoh. From this manifestation of Jehovah's omnipotence, the Israelites were to discern not only the merciful Deliverer, but also the holy Judge of the ungodly, that they might grow in the fear of God, as well as in the faith which they had already shown, when, trusting in the omnipotence of Jehovah, they had gone, as though upon dry land (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), between the watery walls which might at any moment have overwhelmed them. ",
        "children": []
      }
    ]
  }
]