[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The heart of Pharaoh and of his servants was turned against the people.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No doubt the change began as soon as Israel commenced its march. The emigration left Eastern Egypt a solitude, suspended all the royal works that were in progress, threw the whole course of commerce and business into disorder. Beforehand, neither the king nor the people had understood what the loss of six hundred thousand labourers—some of them highly skilled—would be. When Israel was gone they realised it; consequently both king and people regretted what they had done.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 14:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It was told the king that the people fled ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As they had been ordered by the Lord to turn a different way from that which led directly to mount Horeb, it is probable that, as soon as Pharaoh heard of it, he concluded they had no intention of going thither, but were escaping out of Egypt. He either forgot, or would not own, that they had departed with his consent; and therefore was willing it should be represented to him as a revolt from their allegiance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why have we done this? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They, who never truly repented of their sins, now heartily repent of their only good action.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-9 Pharaoh would think that all Israel was entangled in the wilderness, and so would become an easy prey. But God says, I will be honoured upon Pharaoh. All men being made for the honour of their Maker, those whom he is not honoured by, he will be honoured upon. What seems to tend to the church's ruin, is often overruled to the ruin of the church's enemies. While Pharaoh gratified his malice and revenge, he furthered the bringing to pass God's counsels concerning him. Though with the greatest reason he had let Israel go, yet now he was angry with himself for it. God makes the envy and rage of men against his people, a torment to themselves. Those who set their faces heavenward, and will live godly in Christ Jesus, must expect to be set upon by Satan's temptations and terrors. He will not tamely part with any out of his service.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The people fled - This was a natural inference from the change of direction, which indicated a determination to escape from Egypt. Up to the time when that information reached Pharaoh both he and his people understood that the Israelites would return after keeping a festival in the district adjoining Etham. From Etham the intelligence would be forwarded by the commander of the garrison to Rameses in less than a day, and the cavalry, a highly-disciplined force, would be ready for immediate departure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the heart of Pharaoh and of his servants was turned against the people, &c.—Alas, how soon the obduracy of this reprobate king reappears! He had been convinced, but not converted—overawed, but not sanctified by the appalling judgments of heaven. He bitterly repented of what he now thought a hasty concession. Pride and revenge, the honor of his kingdom, and the interests of his subjects, all prompted him to recall his permission to reclaim those runaway slaves and force them to their wonted labor. Strange that he should yet allow such considerations to obliterate or outweigh all his painful experience of the danger of oppressing that people. But those whom the Lord has doomed to destruction are first infatuated by sin.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " That the people fled; did not only depart for three days to sacrifice at Horeb, as Moses pretended, but designed an escape and flight, as appeared by their speedy march, and other circumstances. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Why have we done this?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They who never truly repented of their sins, now heartily repent of their only good action. That the people fled; did not only depart for three days to sacrifice at Horeb, as Moses pretended, but designed an escape and flight, as appeared by their speedy march, and other circumstances. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why have we done this?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They who never truly repented of their sins, now heartily repent of their only good action. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it was told the king of Egypt,.... By some of the Egyptians, or mixed multitude that went out with Israel, but returned upon their encampment at the Red sea, or by some spies Pharaoh sent with them to observe their motions: the Targums of Jonathan and Jarchi make use of a word which Buxtorf translates military officers: and the latter says, they went out with them the three days' journey, but the Israelites not returning to Egypt (as expected), they tell Pharaoh of it the fourth day; and on the fifth and sixth he pursued them, and in the night of the seventh went into the sea after them, and on the morning they (the Israelites) sung the song, which was the seventh of the passover: these reported to Pharaoh: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that the people fled; that under a pretence of going three days' journey into the wilderness, to serve and sacrifice to the Lord, they were about to make their escape out of the land: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the heart of Pharaoh and of his servants were turned against the people; who had so much favour in their sight, not only to give them leave to go, and to hasten their departure, but to lend and give them things of great value; but now their hearts were filled with hatred of them, and with malice and revenge: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they said, why have we done this, that we have let Israel go from serving us? not Pharaoh only, but his servants said so, even those who had entreated him to let them go, Exodus 10:7 yet now repent of it, and cannot think what reason they had to do it, when at that time they saw reason, and gave a very sufficient one, namely, the destruction of Egypt; but now the judgments and plagues of God being no more upon them, they recollect the great service of the Israelites to them and the benefits and advantages they had reaped by it, and the loss they had sustained by parting with them, and therefore reflect upon themselves for such a piece of conduct. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they said, why have we done this, that we have let Israel go from serving us? not Pharaoh only, but his servants said so, even those who had entreated him to let them go, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " yet now repent of it, and cannot think what reason they had to do it, when at that time they saw reason, and gave a very sufficient one, namely, the destruction of Egypt; but now the judgments and plagues of God being no more upon them, they recollect the great service of the Israelites to them and the benefits and advantages they had reaped by it, and the loss they had sustained by parting with them, and therefore reflect upon themselves for such a piece of conduct. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it was told the king of Egypt that the people fled: and the heart of Pharaoh and of his servants was turned against the people, and they said, Why have we done this, that we have let Israel go from serving us?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were fled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. were not gone merely on a pilgrimage, to ‘serve’ Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.), but had departed altogether.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the heart … was changed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. their mind, or opinion, was altered; they regretted that they had given the permission of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; they felt that they had lost the services of the Israelites, and wished, if possible, to get them back.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from serving us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ch. 5, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 5-9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE PURSUIT OF ISRAEL BY THE EGYPTIANS. A short respite from suffering was sufficient to enable Pharaoh to recover from his extreme alarm. No further deaths had followed on the destruction of the firstborn; and he might think no further danger was to be apprehended. The worst of Moses' threats had been accomplished- perhaps Jehovah had no more arrows in his quiver. At any rate, as he realised to himself what it would be to lose altogether the services of so vast a body of slaves, many of them highly skilled in different arts, he more and more regretted the permission which he had given. Under these circumstances intelligence was brought him of the change which the Israelites had made in their route, and the dangerous position into which they had Brought themselves. Upon this he resolved to start in pursuit, with such troops as he could hastily muster. As his chariots were six hundred, we may presume that his footmen were at least 100,000, all trained and disciplined soldiers, accustomed to warfare. The timid horde of escaped slaves, unused to war, though it might be five or six times as numerous as his host, was not likely to resist it. Pharaoh no doubt expected an unconditional surrender on the part of the Israelites, as soon as they saw his forces. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It was told the King of Egypt that the people fled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pharaoh, when he let the Israelites go, must have felt tolerably certain that they would not voluntarily return. Formally, however, he had only consented to their going a three days' journey into the wilderness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When, being at Etham, on the edge of the wilderness, they did not enter it, but marched southward to Pi-hahiroth, the Egyptians might naturally report that instead of sacrificing, they were flying - hasting forwards - placing as much distance as they could between themselves and the Egyptian headquarters. But this report alone would scarcely have moved Pharaoh to action. It was in the accompanying circumstances, in the particular line of route, that he thought to find his opportunity. The people \"were entangled\" (ver. 3). They might be taken at a disadvantage, and might be reduced to choosing between starvation and a. return to Egypt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The heart of Pharaoh, and of his servants, was turned against the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reaction of feeling was not confined to Pharaoh. His subjects participated in it. The loss of such a large body of labourers would be generally felt as a severe blow to the prosperity of the nation. It would affect all classes. The poor labourers might be benefited; but the employers of labour are the influential classes, and they would be injured. So \"Pharaoh's servants\" were of one mind with their master, and they \"turned against\" the Israelites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Why have we done this?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In the retrospect, the afflictions which they had suffered did not seem so very great. They at any rate had survived them, and were not perhaps even seriously impoverished. Royal favour will find a way of making up any losses which court minions have suffered, out of the general taxation of the country. But in prospect, the loss of 600,000 (more or less skilled) labourers appeared a terrible thing. The official class was quite ready to make a strenuous effort to avert the loss. Exodus 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When it was announced that Israel had fled, \"the heart of Pharaoh and his servants turned against the people,\" and they repented that they had let them go. When and whence the information came, we are not told. The common opinion, that it was brought after the Israelites changed their route, has no foundation in the text. For the change in Pharaoh's feelings towards the Israelites, and his regret that he had let them go, were caused not by their supposed mistake, but by their flight. Now the king and his servants regarded the exodus as a flight, as soon as they recovered from the panic caused by the death of the first-born, and began to consider the consequences of the permission given to the people to leave his service. This may have occurred as early as the second day after the exodus. In that case, Pharaoh would have had time to collect chariots and horsemen, and overtake the Israelites at Hachiroth, as they could easily perform the same journey in two days, or one day and a half, to which the Israelites had taken more than three. \"He yoked his chariot (had it yoked, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and took his people (i.e., his warriors) with him,\" viz., \"six hundred chosen war chariots (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and all the chariots of Egypt\" (sc., that he could get together in the time), and \"royal guards upon them all.\" שׁלשׁים, τριστάται, tristatae qui et terni statores vocantur, nomen est secundi gradus post regiam dignitatem (Jerome on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 23:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not charioteers (see my Com. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the army raised by Pharaoh consisted of chariot horses (רכב סוּס), riding horses (פּרשׁים, lit., runners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and חיל, the men belonging to them. War chariots and cavalry were always the leading force of the Egyptians (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 36:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Three times (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") it is stated that Jehovah hardened Pharaoh's heart, so that he pursued the Israelites, to show that God had decreed this hardening, to glorify Himself in the judgment and death of the proud king, who would not honour God, the Holy One, in his life. \"And the children of Israel were going out with a high hand:\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is a conditional clause in the sense of, \"although they went out\" (Ewald, 341). רמה יד, the high hand, is the high hand of Jehovah with the might which it displayed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not the armed hand of the Israelites. This is the meaning also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it is different in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The very fact that Pharaoh did not discern the lifting up of Jehovah's hand in the exodus of Israel displayed the hardening of his heart. \"Beside Pihachiroth:\" see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]