[{"header":"Naomi Loses"},{"num":1,"verse":"In the days when the judges ruled, there was a famine in the land. And a man from Bethlehem in Judah went to live in the land of Moab, he and his wife and his two sons. "},{"num":2,"verse":"The name of the man was Elimelek, the name of his wife was Naomi, and the names of his two sons were Mahlon and Kilion. They were Ephrathites from Bethlehem in Judah. And they went to Moab and lived there."},{"num":3,"verse":"Now Elimelek, the husband of Naomi, died, so she was left alone with her two sons. "},{"num":4,"verse":"They took Moabite wives for themselves; the name of one was Orpah and the name of the other Ruth. They lived there about ten years. "},{"num":5,"verse":"Then Mahlon and Kilion also died, and Naomi was left without her two sons and her husband."},{"num":6,"verse":"So she got up with her daughters-in-law to return from the land of Moab, for in the land of Moab, she had heard that the Lord had visited His people by giving them food. "},{"num":7,"verse":"She set out from the place where she had been, with her two daughters-in-law, and they went on their way to return to the land of Judah."},{"num":8,"verse":"Then Naomi said to her two daughters-in-law, “Go, return each to her mother’s house. May the Lord deal kindly with you, as you have dealt with your deceased husbands and with me. "},{"num":9,"verse":"May the Lord grant that you each find rest in the house of another husband.”"},{"num":10,"verse":"They said to her, “We will return with you to your people.”"},{"num":11,"verse":"But Naomi said, “Turn back, my daughters. Why would you go with me? Are there sons in my womb, who could become your husbands? "},{"num":12,"verse":"Turn back, my daughters! Go, for I am too old to have a husband. Even if I thought that there was still hope for me, that I could have a husband tonight and give birth to sons, "},{"num":13,"verse":"would you wait until they were grown? Would you refrain from getting married? No, my daughters. It is much more bitter for me than for you, for the hand of the Lord has turned against me.”"},{"num":14,"verse":"Then they raised their voices and wept aloud once more. Orpah kissed her mother-in-law, but Ruth clung to her."},{"num":15,"verse":"Naomi said, “Look, your sister-in-law has returned to her people and her gods. Return with her!”"},{"num":16,"verse":"But Ruth said, “Do not urge me to leave you or to turn back from following you. For wherever you go, I will go, and wherever you stay, I will stay. Your people shall be my people and your God my God. "},{"num":17,"verse":"Where you die, I will die, and there I will be buried. May the Lord do thus to me, and worse, if anything but death separates you and me!” "},{"num":18,"verse":"When Naomi saw that she was determined to go with her, she said no more to her."},{"num":19,"verse":"So they both went on until they came to Bethlehem. When they came to Bethlehem, the whole town was stirred because of them, and the women asked, “Is this Naomi?”"},{"num":20,"verse":"But she said to them, “Do not call me Naomi. Call me Mara, because the Almighty has brought great bitterness to me. "},{"num":21,"verse":"I was full when I left, but the Lord has caused me to return empty. Why should you call me Naomi when the Lord has opposed me? The Almighty has brought misfortune upon me!”"},{"num":22,"verse":"So Naomi returned from the land of Moab with Ruth the Moabite, her daughter-in-law. They came to Bethlehem at the start of the spring barley harvest."}]