[{"num":1,"verse":"In the days of one judge, when judges were sovereigns in Israel, hunger was made in the land; and a man of Bethlehem of Judah went to be a pilgrim in the country of Moab, with his wife and [his] two free sons. (In the days of the judges, when they were the rulers in Israel, there was hunger in the land; and a man of Bethlehem of Judah went to live in the country of Moab, with his wife and their two sons.)"},{"num":2,"verse":"He was called Elimelech, and his wife (was) Naomi, and his two sons, the one was called Mahlon, and the tother Chilion, Ephrathites of Bethlehem of Judah; and they entered into the country of Moab, and they dwelled there (and they went to the country of Moab, and they lived there)."},{"num":3,"verse":"And Elimelech, the husband of Naomi, died, and she (was) left with her sons;"},{"num":4,"verse":"and they took wives of Moab, of which wives one was called Orpah, the tother Ruth. And the sons dwelled there ten years (And the sons lived there for ten years),"},{"num":5,"verse":"and both died, that is, Mahlon and Chilion; and the woman (was) left, and was made bare of her two free sons, and her husband. (and then both of them died, that is, Mahlon and Chilion; and so the woman was bereaved of her two sons, and her husband.)"},{"num":6,"verse":"And she rose to go with ever either wife of her sons into her country from the country of Moab; for she had heard, that the Lord had beheld his people, and had given meats to them. (And she rose up to go with the wives of both of her sons back to her country from the country of Moab; for she had heard, that the Lord had looked kindly again upon his people, and had given them food.)"},{"num":7,"verse":"And so she went out from the place of her pilgrimage with ever either wife of her sons; and now when she was set in the way of turning again into the land of Judah, (And so she went out from the place where she lived with the wives of both of her sons; and now when she was set on the way, returning to the land of Judah,)"},{"num":8,"verse":"she said to them, Go ye (again) into the house of your mother; the Lord do mercy with you, as ye did with the dead men, and with me;"},{"num":9,"verse":"the Lord give to you to find rest in the houses of [the] husbands which ye shall take. And she kissed them. And they began to weep with (a) high voice,"},{"num":10,"verse":"and to say, We shall go with thee to thy people."},{"num":11,"verse":"To whom she answered, My daughters, turn ye again, why come ye with me? I have no more sons in my womb, that ye may hope husbands of me (To whom she answered, My daughters, return ye home, why come ye with me? I have no more sons in my womb, that ye may have any hope of husbands from me;)"},{"num":12,"verse":"my daughters of Moab, turn ye again, and go (my daughters of Moab, return ye, and go home); for now I am made eld, and I am not able to the bond of marriage; yea, though I might conceive in this night, and bear sons,"},{"num":13,"verse":"though ye will abide till they waxed, and [ful]fill the years of marriage, ye shall sooner be eld women than ye shall be wedded; I beseech (thee), my daughters, mourn ye not, for your anguish oppresseth me the more, and the hand of the Lord is gone out against me."},{"num":14,"verse":"Therefore, when the voice was raised (up), again they began to weep. And Orpah kissed her mother-in-law, and turned again, and Ruth abode with her mother-in-law (And Orpah kissed her mother-in-law, and returned home, but Ruth stayed with her mother-in-law)."},{"num":15,"verse":"To whom Naomi said, Lo! thy kinswoman turned again to her people, and to her gods; go thou with her."},{"num":16,"verse":"And Ruth answered, Be thou not against me, that I forsake thee, and go away; whither ever thou shalt go, I shall go, and where thou shalt dwell, I shall dwell together (with thee); thy people is my people, and thy God is my God; (And Ruth answered, Be thou not against me, that I should desert thee, and go away from thee; wherever thou shalt go, I shall go, and where thou shalt live, I shall live with thee; thy people is my people, and thy God is my God;)"},{"num":17,"verse":"what land shall receive thee dying, I shall die therein also, and there I shall take place of burying; God do to me these things, and add these things, if death alone shall not part me and thee. (whatever land shall receive thee when thou diest, I shall die there also, and that shall be the place where I am buried; yea, God do to me terrible things, and add other things as well, if anything but death separate me and thee.)"},{"num":18,"verse":"Therefore Naomi saw, that Ruth had deemed with steadfast soul to go with her, and she would not be against her, neither counsel further turning again to her countrymen (and so she would not be against her, nor further counsel her to return to her own people)."},{"num":19,"verse":"And (so) they went forth together, and came into Bethlehem; and when they entered into the city, swift fame (a)rose with all men, and women said, This is that Naomi."},{"num":20,"verse":"To whom she said, Call ye not me Naomi, that is, fair, but call ye me Mara, that is, bitter; for Almighty God hath filled me greatly with bitterness. (To whom she said, Do not ye call me Naomi, or Delightful, or Pleasant, but call ye me Mara, or Bitter; for Almighty God hath filled me with great bitterness.)"},{"num":21,"verse":"I went out full, and the Lord led me again void; why therefore call ye me Naomi, whom the Lord hath made low, and (whom) Almighty God hath tormented?"},{"num":22,"verse":"Therefore Naomi came with Ruth of Moab, the wife of her son, from the land of her pilgrimage, and turned again into Bethlehem, when barley was reaped first. (And so Naomi came with Ruth the Moabite, her son’s wife, from the land where she had lived, and returned to Bethlehem with her, when the barley was first harvested.)"}]