[[],[{"type":"header","content":"A Levite’s Concubine Degraded"},{"type":"prose","content":"Now it happened in those days, when there was no king in Israel, that a certain Levite living [as an alien] in the most remote part of the hill country of Ephraim, who took a concubine for himself from Bethlehem in Judah. "}],[{"type":"prose","content":"But his concubine was unfaithful to him, and left him and went to her father’s house in Bethlehem of Judah, and stayed there for a period of four months. "}],[{"type":"prose","content":"Then her husband arose and went after her to speak kindly  tenderly to her in order to bring her back, taking with him his servant and a pair of donkeys. So she brought him into her father’s house, and when the father of the girl saw him, he was happy to meet him. "}],[{"type":"prose","content":"So his father-in-law, the girl’s father, detained him; and he stayed there with him for three days. So they ate and drank, and he lodged there. "}],[{"type":"prose","content":"On the fourth day they got up early in the morning, and the Levite prepared to leave; but the girl’s father said to his son-in-law, “Strengthen yourself with a piece of bread, and afterward go your way.” "}],[{"type":"prose","content":"So both men sat down and ate and drank together; and the girl’s father said to the man, “Please be willing to spend the night and enjoy yourself.” "}],[{"type":"prose","content":"Then the man got up to leave, but his father-in-law urged him [strongly to remain]; so he spent the night there again. "}],[{"type":"prose","content":"On the fifth day he got up early in the morning to leave, but the girl’s father said, “Please strengthen yourself, and wait until the end of the day.” So both of them ate. "}],[{"type":"prose","content":"When the man and his concubine and his servant got up to leave, his father-in-law, the girl’s father, said to him, “Behold, now the day has drawn to a close; please spend the night. Look, now the day comes to an end; spend the night here and celebrate, enjoy yourself. Then tomorrow you may get up early for your journey and go home.”"}],[{"type":"prose","content":"But the man was not willing to stay the night; so he got up and left and came to  opposite Jebus that is Jerusalem. With him were two saddled donkeys [and his servant] and his concubine. "}],[{"type":"prose","content":"When they were near Jebus, the day was almost gone, and the servant said to his master, “Please come and let us turn aside into this Jebusite city and spend the night in it.” "}],[{"type":"prose","content":"But his master said to him, “We will not turn aside into a city of foreigners who are not of the sons (descendants) of Israel. We will go on as far as Gibeah.” "}],[{"type":"prose","content":"And he said to his servant, “Come and let us approach one of  places: and we will spend the night in Gibeah or in Ramah.” "}],[{"type":"prose","content":"So they passed by and went on their way, and the sun set on them near Gibeah, which belongs to [the tribe of] Benjamin, "}],[{"type":"prose","content":"and they turned aside there to go in and spend the night in Gibeah. And the Levite went in and sat down in the open square of the city, because no man invited them into his house to spend the night."}],[{"type":"prose","content":"Then behold,  an old man  was coming out of the field from his work at evening. He was from the hill country of Ephraim but was staying in Gibeah, and the men of the place were sons (descendants) of Benjamin. "}],[{"type":"prose","content":"When he looked up, he saw the traveler [and his companions] in the city square; and the old man said, “Where are you going, and where do you come from?” "}],[{"type":"prose","content":"The Levite replied, “We are passing through from Bethlehem [in the territory] of Judah to the most remote part of the hill country of Ephraim; I am from there. I went to Bethlehem of Judah, but I am  going [home] to my house, and there is no man [in the city] who will take me into his house [for the night]. "}],[{"type":"prose","content":"Yet we have both straw and feed for our donkeys, and also bread and wine for me, and for your handmaid, and for the young man who is with your servant; there is no lack of anything.” "}],[{"type":"prose","content":"Then the old man said, “Peace be to you. Only  all your needs to me; and do not spend the night in the open square.” "}],[{"type":"prose","content":"So he brought him into his house and fed the donkeys; and they washed their feet and ate and drank."}],[{"type":"prose","content":"While they were celebrating, behold, men of the city, certain worthless  evil men, surrounded the house, pounding on the door; and they spoke to the master of the house, the old man, saying, “Bring out the man who came to your house so that we may have relations with him.” "}],[{"type":"prose","content":"Then the man, the master of the house, went out and said to them, “No, my fellow citizens, please do not act so wickedly. Since this man has come to my house [as my guest], do not commit this sacrilege. "}],[{"type":"prose","content":"Here is my virgin daughter and this man’s concubine. I will bring them out now; abuse  humiliate them and do to them whatever you want, but do not commit this act of sacrilege against this man.” "}],[{"type":"prose","content":"But the men would not listen to him. So the man took the Levite’s concubine and brought her outside to them; and they had relations with her and abused her all night until morning; and when daybreak came, they let her go. "}],[{"type":"prose","content":"At daybreak the woman came and collapsed at the door of the man’s house where her master was, until it was [fully] light."}],[{"type":"prose","content":"When her master got up in the morning and opened the doors of the house and went out to go on his way, he saw his concubine lying at the door of the house, and her hands were on the threshold. "}],[{"type":"prose","content":"He said to her, “Get up, and let us go.” But there was no answer [for she had died]. Then he put her [body] on the donkey; and the man left and went home. "}],[{"type":"prose","content":"When he arrived at his house, he took a knife, and taking hold of his [dead] concubine, he cut her [corpse] limb by limb into twelve pieces, and sent her [body parts] throughout all the territory of Israel. "}],[{"type":"prose","content":"All who saw  said, “Nothing like this has  happened or been seen from the day that the sons of Israel came up from the land of Egypt to this day. Consider it, take counsel, and speak [your minds]!”"}]]