[{"num":19,"verse":"At this time before Israel had a king, there was a man of the tribe of Levi living on the far side of the hill country of Ephraim, who brought home a girl from Bethlehem in Judah to be his concubine. "},{"num":2,"verse":"But she became angry with him and ran away, and returned to her father’s home in Bethlehem, and was there about four months. "},{"num":3,"verse":"Then her husband, taking along a servant and an extra donkey, went to see her to try to win her back again. When he arrived at her home, she let him in and introduced him to her father, who was delighted to meet him. "},{"num":4,"verse":"Her father urged him to stay awhile, so he stayed three days, and they all had a very pleasant time."},{"num":5,"verse":"On the fourth day they were up early, ready to leave, but the girl’s father insisted on their having breakfast first. "},{"num":6,"verse":"Then he pleaded with him to stay one more day, as they were having such a good time. "},{"num":7,"verse":"At first the man refused, but his father-in-law kept urging him until finally he gave in. "},{"num":8,"verse":"The next morning they were up early again, and again the girl’s father pleaded, “Stay just today and leave sometime this evening.” So they had another day of feasting."},{"num":9,"verse":"That afternoon as he and his wife and servant were preparing to leave, his father-in-law said, “Look, it’s getting late. Stay just tonight, and we will have a pleasant evening together and tomorrow you can get up early and be on your way.”"},{"num":10,"verse":"But this time the man was adamant, so they left, getting as far as Jerusalem (also called Jebus) before dark."},{"num":11,"verse":"His servant said to him, “It’s getting too late to travel; let’s stay here tonight.”"},{"num":12,"verse":"“No,” his master said, “we can’t stay in this heathen city where there are no Israelites—we will go on to Gibeah, or possibly Ramah.”"},{"num":14,"verse":"So they went on. The sun was setting just as they came to Gibeah, a village of the tribe of Benjamin, "},{"num":15,"verse":"so they went there for the night. But as no one invited them in, they camped in the village square. "},{"num":16,"verse":"Just then an old man came by on his way home from his work in the fields. (He was originally from the hill country of Ephraim, but was living now in Gibeah, even though it was in the territory of Benjamin.) "},{"num":17,"verse":"When he saw the travelers camped in the square, he asked them where they were from and where they were going."},{"num":18,"verse":"“We’re on the way home from Bethlehem, in Judah,” the man replied. “I live on the far edge of the Ephraim hill country, near Shiloh. But no one has taken us in for the night, "},{"num":19,"verse":"even though we have fodder for our donkeys and plenty of food and wine for ourselves.”"},{"num":20,"verse":"“Don’t worry,” the old man said, “be my guests; for you mustn’t stay here in the square. It’s too dangerous.”"},{"num":21,"verse":"So he took them home with him. He fed their donkeys while they rested, and afterward they had supper together. "},{"num":22,"verse":"Just as they were beginning to warm to the occasion, a gang of sex perverts gathered around the house and began beating at the door and yelling at the old man to bring out the man who was staying with him, so they could rape him. "},{"num":23,"verse":"The old man stepped outside to talk to them."},{"num":24,"verse":"Here, take my virgin daughter and this man’s wife. I’ll bring them out and you can do whatever you like to them—but don’t do such a thing to this man.”"},{"num":25,"verse":"But they wouldn’t listen to him. Then the girl’s husband pushed her out to them, and they abused her all night, taking turns raping her until morning. Finally, just at dawn, they let her go. "},{"num":26,"verse":"She fell down at the door of the house and lay there until it was light. "},{"num":27,"verse":"When her husband opened the door to be on his way, he found her there, fallen down in front of the door with her hands digging into the threshold."},{"num":28,"verse":"“Well, come on,” he said. “Let’s get going.”"},{"num":29,"verse":"When he got there he took a knife and cut her body into twelve parts and sent one piece to each tribe of Israel. "},{"num":30,"verse":"Then the entire nation was roused to action against the men of Benjamin because of this awful deed."}]