[{"header":"Jesus Cures a Demon-Possessed Man(A)"},{"num":5,"verse":"They arrived in the territory of the Gerasenes on the other side of the Sea of Galilee. "},{"num":2,"verse":"As Jesus stepped out of the boat, a man came out of the tombs and met him. The man was controlled by an evil spirit "},{"num":3,"verse":"and lived among the tombs. No one could restrain him any longer, not even with a chain. "},{"num":4,"verse":"He had often been chained hand and foot. However, he snapped the chains off his hands and broke the chains from his feet. No one could control him. "},{"num":5,"verse":"Night and day he was among the tombs and on the mountainsides screaming and cutting himself with stones."},{"num":6,"verse":"The man saw Jesus at a distance. So he ran ⌞to Jesus⌟, bowed down in front of him, "},{"num":7,"verse":"and shouted, “Why are you bothering me now, Jesus, Son of the Most High God? Swear to God that you won’t torture me.” "},{"num":8,"verse":"He shouted this because Jesus said, “You evil spirit, come out of the man.”"},{"num":9,"verse":"Jesus asked him, “What is your name?”"},{"num":10,"verse":"He begged Jesus not to send them out of the territory."},{"num":11,"verse":"A large herd of pigs was feeding on a mountainside nearby. "},{"num":12,"verse":"The demons begged him, “Send us into the pigs! Let us enter them!”"},{"num":13,"verse":"Jesus let them do this. The evil spirits came out of the man and went into the pigs. The herd of about two thousand pigs rushed down the cliff into the sea and drowned."},{"num":14,"verse":"Those who took care of the pigs ran away. In the city and countryside they reported everything that had happened. So the people came to see what had happened. "},{"num":15,"verse":"They came to Jesus and saw the man who had been possessed by the legion of demons. The man was sitting there dressed and in his right mind. The people were frightened. "},{"num":16,"verse":"Those who saw this told what had happened to the demon-possessed man and the pigs. "},{"num":17,"verse":"Then the people began to beg Jesus to leave their territory."},{"num":18,"verse":"As Jesus stepped into the boat, the man who had been demon-possessed begged him, “Let me stay with you.” "},{"num":19,"verse":"But Jesus would not allow it. Instead, he told the man, “Go home to your family, and tell them how much the Lord has done for you and how merciful he has been to you.”"},{"num":20,"verse":"So the man left. He began to tell how much Jesus had done for him in the Ten Cities. Everyone was amazed."},{"header":"Jairus’ Daughter and a Woman with Chronic Bleeding(B)"},{"num":21,"verse":"Jesus again crossed to the other side of the Sea of Galilee in a boat. A large crowd gathered around him by the seashore."},{"num":22,"verse":"A synagogue leader named Jairus also arrived. When he saw Jesus, he quickly bowed down in front of him. "},{"num":23,"verse":"He begged Jesus, “My little daughter is dying. Come, lay your hands on her so that she may get well and live.”"},{"num":24,"verse":"Jesus went with the man. A huge crowd followed Jesus and pressed him on every side."},{"num":25,"verse":"In the crowd was a woman who had been suffering from chronic bleeding for twelve years. "},{"num":26,"verse":"Although she had been under the care of many doctors and had spent all her money, she had not been helped at all. Actually, she had become worse. "},{"num":27,"verse":"Since she had heard about Jesus, she came from behind in the crowd and touched his clothes. "},{"num":28,"verse":"She said, “If I can just touch his clothes, I’ll get well.” "},{"num":29,"verse":"Her bleeding stopped immediately. She felt cured from her illness."},{"num":30,"verse":"At that moment Jesus felt power had gone out of him. He turned around in the crowd and asked, “Who touched my clothes?”"},{"num":31,"verse":"His disciples said to him, “How can you ask, ‘Who touched me,’ when you see the crowd pressing you on all sides?”"},{"num":32,"verse":"But he kept looking around to see the woman who had done this. "},{"num":33,"verse":"The woman trembled with fear. She knew what had happened to her. So she quickly bowed in front of him and told him the whole truth."},{"num":34,"verse":"Jesus told her, “Daughter, your faith has made you well. Go in peace! Be cured from your illness.”"},{"num":35,"verse":"While Jesus was still speaking to her, some people came from the synagogue leader’s home. They told the synagogue leader, “Your daughter has died. Why bother the teacher anymore?”"},{"num":36,"verse":"When Jesus overheard what they said, he told the synagogue leader, “Don’t be afraid! Just believe.”"},{"num":37,"verse":"Jesus allowed no one to go with him except Peter and the two brothers James and John. "},{"num":38,"verse":"When they came to the home of the synagogue leader, Jesus saw a noisy crowd there. People were crying and sobbing loudly. "},{"num":39,"verse":"When he came into the house, he asked them, “Why are you making so much noise and crying? The child isn’t dead. She’s just sleeping.”"},{"num":40,"verse":"They laughed at him. So he made all of them go outside. Then he took the child’s father, mother, and his three disciples and went to the child. "},{"num":41,"verse":"Jesus took the child’s hand and said to her, “Talitha, koum!” which means, “Little girl, I’m telling you to get up!”"},{"num":42,"verse":"The girl got up at once and started to walk. (She was twelve years old.) They were astonished."},{"num":43,"verse":"Jesus ordered them not to let anyone know about this. He also told them to give the little girl something to eat."}]