[{"header":"Jesus Heals a Demon-Possessed Man"},{"num":5,"verse":"So they arrived at the other side of the lake, in the region of the Gerasenes."},{"num":2,"verse":"When Jesus climbed out of the boat, a man possessed by an evil spirit came out from the tombs to meet him."},{"num":3,"verse":"This man lived in the burial caves and could no longer be restrained, even with a chain."},{"num":4,"verse":"Whenever he was put into chains and shackles—as he often was—he snapped the chains from his wrists and smashed the shackles. No one was strong enough to subdue him."},{"num":5,"verse":"Day and night he wandered among the burial caves and in the hills, howling and cutting himself with sharp stones."},{"num":6,"verse":"When Jesus was still some distance away, the man saw him, ran to meet him, and bowed low before him."},{"num":7,"verse":"With a shriek, he screamed, “Why are you interfering with me, Jesus, Son of the Most High God? In the name of God, I beg you, don’t torture me!”"},{"num":8,"verse":"For Jesus had already said to the spirit, “Come out of the man, you evil spirit.”"},{"num":9,"verse":"Then Jesus demanded, “What is your name?”"},{"num":10,"verse":"Then the evil spirits begged him again and again not to send them to some distant place."},{"num":11,"verse":"There happened to be a large herd of pigs feeding on the hillside nearby."},{"num":12,"verse":"“Send us into those pigs,” the spirits begged. “Let us enter them.”"},{"num":13,"verse":"So Jesus gave them permission. The evil spirits came out of the man and entered the pigs, and the entire herd of about 2,000 pigs plunged down the steep hillside into the lake and drowned in the water."},{"num":14,"verse":"The herdsmen fled to the nearby town and the surrounding countryside, spreading the news as they ran. People rushed out to see what had happened."},{"num":15,"verse":"A crowd soon gathered around Jesus, and they saw the man who had been possessed by the legion of demons. He was sitting there fully clothed and perfectly sane, and they were all afraid."},{"num":16,"verse":"Then those who had seen what happened told the others about the demon-possessed man and the pigs."},{"num":17,"verse":"And the crowd began pleading with Jesus to go away and leave them alone."},{"num":18,"verse":"As Jesus was getting into the boat, the man who had been demon possessed begged to go with him."},{"num":19,"verse":"But Jesus said, “No, go home to your family, and tell them everything the Lord has done for you and how merciful he has been.”"},{"num":20,"verse":"So the man started off to visit the Ten Towns of that region and began to proclaim the great things Jesus had done for him; and everyone was amazed at what he told them."},{"header":"Jesus Heals in Response to Faith"},{"num":21,"verse":"Jesus got into the boat again and went back to the other side of the lake, where a large crowd gathered around him on the shore."},{"num":22,"verse":"Then a leader of the local synagogue, whose name was Jairus, arrived. When he saw Jesus, he fell at his feet,"},{"num":23,"verse":"pleading fervently with him. “My little daughter is dying,” he said. “Please come and lay your hands on her; heal her so she can live.”"},{"num":24,"verse":"Jesus went with him, and all the people followed, crowding around him."},{"num":25,"verse":"A woman in the crowd had suffered for twelve years with constant bleeding."},{"num":26,"verse":"She had suffered a great deal from many doctors, and over the years she had spent everything she had to pay them, but she had gotten no better. In fact, she had gotten worse."},{"num":27,"verse":"She had heard about Jesus, so she came up behind him through the crowd and touched his robe."},{"num":28,"verse":"For she thought to herself, “If I can just touch his robe, I will be healed.”"},{"num":29,"verse":"Immediately the bleeding stopped, and she could feel in her body that she had been healed of her terrible condition."},{"num":30,"verse":"Jesus realized at once that healing power had gone out from him, so he turned around in the crowd and asked, “Who touched my robe?”"},{"num":31,"verse":"His disciples said to him, “Look at this crowd pressing around you. How can you ask, ‘Who touched me?’”"},{"num":32,"verse":"But he kept on looking around to see who had done it."},{"num":33,"verse":"Then the frightened woman, trembling at the realization of what had happened to her, came and fell to her knees in front of him and told him what she had done."},{"num":34,"verse":"And he said to her, “Daughter, your faith has made you well. Go in peace. Your suffering is over.”"},{"num":35,"verse":"While he was still speaking to her, messengers arrived from the home of Jairus, the leader of the synagogue. They told him, “Your daughter is dead. There’s no use troubling the Teacher now.”"},{"num":36,"verse":"But Jesus overheard them and said to Jairus, “Don’t be afraid. Just have faith.”"},{"num":37,"verse":"Then Jesus stopped the crowd and wouldn’t let anyone go with him except Peter, James, and John (the brother of James)."},{"num":38,"verse":"When they came to the home of the synagogue leader, Jesus saw much commotion and weeping and wailing."},{"num":39,"verse":"He went inside and asked, “Why all this commotion and weeping? The child isn’t dead; she’s only asleep.”"},{"num":40,"verse":"The crowd laughed at him. But he made them all leave, and he took the girl’s father and mother and his three disciples into the room where the girl was lying."},{"num":41,"verse":"Holding her hand, he said to her, “Talitha koum,” which means “Little girl, get up!”"},{"num":42,"verse":"And the girl, who was twelve years old, immediately stood up and walked around! They were overwhelmed and totally amazed."},{"num":43,"verse":"Jesus gave them strict orders not to tell anyone what had happened, and then he told them to give her something to eat."}]