[{"header":"Jesus meets a violent lunatic"},{"num":1,"verse":"So they arrived on the other side of the lake in the country of the Gerasenes. As Jesus was getting out of the boat, a man in the grip of an evil spirit rushed to meet him from among the tombs where he was living. It was no longer possible for any human being to restrain him even with a chain. Indeed he had frequently been secured with fetters and lengths of chain, but he had simply snapped the chains and broken the fetters in pieces. No one could do anything with him. All through the night as well as in the day-time he screamed among the tombs and on the hill-side, and cut himself with stones. Now, as soon as he saw Jesus in the distance, he ran and knelt before him, yelling at the top of his voice, “What have you got to do with me, Jesus, Son of the most high God? For God’s sake, don’t torture me!”"},{"num":8,"verse":"For Jesus had already said, “Come out of this man, you evil spirit!”"},{"num":9,"verse":"Then he asked him, “What is your name?” “My name is legion,” he replied, “for there are many of us.”"},{"num":10,"verse":"Then he begged and prayed him not to send “them” out of the country."},{"num":11,"verse":"A large herd of pigs was grazing there on the hill-side, and the evil spirits implored him, “Send us over to the pigs and we’ll get into them!”"},{"num":13,"verse":"So Jesus allowed them to do this, and they came out of the man, and made off and went into the pigs. The whole herd of about two thousand stampeded down the cliff into the lake and was drowned. The swineherds took to their heels and spread their story in the city and all over the countryside. Then the people came to see what had happened. As they approached Jesus, they saw the man who had been devil-possessed sitting there properly clothed and perfectly sane—the same man who had been possessed by “legion”—and they were really frightened. Those who had seen the incident told them what had happened to the devil-possessed man and about the disaster to the pigs. Then they began to implore Jesus to leave their district. As he was embarking on the small boat, the man who had been possessed begged that he might go with him. But Jesus would not allow this. “Go home to your own people,” he told him, “And tell them what the Lord has done for you, and how kind he has been to you!”"},{"num":20,"verse":"So the man went off and began to spread throughout the Ten Towns the story of what Jesus had done for him. And they were all simply amazed."},{"header":"Faith is followed by healing"},{"num":21,"verse":"When Jesus had crossed again in the boat to the other side of the lake, a great crowd collected around him as he stood on the shore. Then came a man called Jairus, one of the synagogue presidents. And when he saw Jesus, he knelt before him, pleading desperately for his help. “My little girl is dying,” he said. “Will you come and put your hands on her—then she will get better and live.”"},{"num":24,"verse":"Jesus went off with him, followed by large crowds jostling at his elbow. Among them was a woman who had a haemorrhage for twelve years and who had gone through a great deal at the hands of many doctors (or physicians), spending all her money in the process. She had derived no benefit from them but, on the contrary, was getting worse. This woman had heard about Jesus and came up behind him under cover of the crowd, and touched his cloak, “For if I can only touch his clothes,” she said, “I shall be all right.”"},{"num":29,"verse":"The haemorrhage stopped immediately, and she knew in herself that she was cured of her trouble. At once Jesus knew intuitively that power had gone out of him, and he turned round in the middle of the crowd and said, “Who touched my clothes?”"},{"num":31,"verse":"His disciples replied, “You can see this crowd jostling you. How can you ask, ‘Who touched me?’”"},{"num":32,"verse":"But he looked all round at their faces to see who had done so. Then the woman, scared and shaking all over because she knew that she was the one to whom this thing had happened, came and flung herself before him and told him the whole story. But he said to her, “Daughter, it is your faith that has healed you. Go home in peace, and be free from your trouble.”"},{"num":35,"verse":"While he was still speaking, messengers arrived from the synagogue president’s house, saying, “Your daughter is dead—there is no need to bother the master any further.”"},{"num":36,"verse":"But when Jesus heard this, he said, “Now don’t be afraid, just go on believing!”"},{"num":37,"verse":"Then he allowed no one to follow him except Peter and James and John, James’s brother. They arrived at the president’s house and Jesus noticed the hubbub and all the weeping and wailing, and as he went in, he said to the people in the house, “Why are you making such a noise with your crying? The child is not dead; she is fast asleep.”"},{"num":40,"verse":"They greeted this with a scornful laugh. But Jesus turned them all out, and taking only the father and mother and his own companions with him, went into the room where the child was. Then he took the little girl’s hand and said to her in Aramaic, “Little girl, I tell you to get up!”"},{"num":42,"verse":"At once she jumped to her feet and walked around the room, for she was twelve years old. This sight sent the others nearly out their minds with joy. But Jesus gave them strict instructions not to let anyone know what had happened—and ordered food to be given to the little girl."}]