[{"num":5,"verse":"1 He threateneth the rich with God’s severe judgment, for their pride, 7 that the poor hearing the miserable end of the rich, 8 may patiently bear afflictions, 11 as Job did, 14 even in their distresses."},{"num":1,"verse":"Go to now, ye rich men: weep, and howl for your miseries that shall come upon you."},{"num":2,"verse":"Your riches are corrupt, and your garments are moth eaten."},{"num":3,"verse":"Your gold and silver is cankered, and the rust of them shall be a witness against you, and shall eat your flesh, as it were fire. Ye have heaped up treasure for the last days."},{"num":4,"verse":"Behold, the hire of the laborers, which have reaped your fields (which is of you kept back by fraud) crieth, and the cries of them which have reaped, are entered into the ears of the Lord of hosts."},{"num":5,"verse":"Ye have lived in pleasure on the earth, and in wantonness. Ye have nourished your hearts, as in a day of slaughter."},{"num":6,"verse":"Ye have condemned, and have killed the just, and he hath not resisted you."},{"num":7,"verse":"Be patient therefore, brethren, unto the coming of the Lord. Behold, the husbandman waiteth for the precious fruit of the earth, and hath long patience for it, until he receive the former, and the latter rain."},{"num":8,"verse":"Be ye also patient therefore, and settle your hearts: for the coming of the Lord draweth near."},{"num":9,"verse":"Grudge not one against another, brethren, lest ye be condemned: behold, the judge standeth before the door."},{"num":10,"verse":"Take, my brethren, the Prophets for an example of suffering adversity, and of long patience, which have spoken in the name of the Lord."},{"num":11,"verse":"Behold, we count them blessed which endure. Ye have heard of the patience of Job, and have known what end the Lord made. For the Lord is very pitiful and merciful."},{"num":12,"verse":"But before all things, my brethren, swear not, neither by heaven, nor by earth, nor by any other oath: but let your yea, be yea, and your nay, nay, lest ye fall into condemnation."},{"num":13,"verse":"Is any among you afflicted? Let him pray. Is any merry? Let him sing."},{"num":14,"verse":"Is any sick among you? Let him call for the Elders of the Church, and let them pray for him, and anoint him with oil in the Name of the Lord."},{"num":15,"verse":"And the prayer of faith shall save the sick, and the Lord shall raise him up: and if he have committed sins, they shall be forgiven him."},{"num":16,"verse":"Acknowledge your faults one to another, and pray one for another, that ye may be healed: for the prayer of a righteous man availeth much, if it be fervent."},{"num":17,"verse":"Elijah was a man subject to like passions as we are, and he prayed earnestly that it might not rain, and it rained not on the earth for three years and six months."},{"num":18,"verse":"And he prayed again: and the heaven gave rain, and the earth brought forth her fruit."},{"num":19,"verse":"Brethren, If any of you hath erred from the truth, and some man hath converted him,"},{"num":20,"verse":"Let him know that he which hath converted the sinner from going astray out of his way, shall save a soul from death, and shall hide a multitude of sins."}]