[{"num":5,"verse":"¶ Come now, Oh ye rich, weep and howl for your miseries that shall come upon you."},{"num":2,"verse":"Your riches are rotten, and your garments are motheaten."},{"num":3,"verse":"Your gold and silver is corrupted with rust; and the rust of them shall be a witness against you and shall completely eat your flesh, as fire. Ye have heaped treasure together for the last days."},{"num":4,"verse":"Behold, the hire of the labourers who have reaped your fields (which you have kept back by fraud) cries out; and the cries of those who have reaped have entered into the ears of the Lord of the hosts."},{"num":5,"verse":"Ye have lived in pleasure on the earth and been wanton; ye have refreshed your hearts, as in the day of slaughter of sacrifices."},{"num":6,"verse":"Ye have condemned and murdered the just, and he does not resist you."},{"num":7,"verse":"Be patient, therefore, brethren, unto the coming of the Lord. Behold, the husbandman waits for the precious fruit of the earth, waiting patiently until it receives the early and latter rain."},{"num":8,"verse":"Be ye also patient and confirm your hearts, for the coming of the Lord draws near."},{"num":9,"verse":"Complain not one against another, brethren, that ye not be condemned: behold, the judge stands before the door."},{"num":10,"verse":"Take, my brethren, the prophets, who have spoken in the name of the Lord, for an example of suffering affliction, and of patience."},{"num":11,"verse":"Behold, we count blessed those who endure. Ye have heard of the patience of Job and have seen the end of the Lord, that the Lord is very merciful, and full of compassion."},{"num":12,"verse":"¶ But above all things, my brethren, do not swear by heaven or by the earth or by any other oath, but let your yes be yes and your no, no; lest ye fall into condemnation."},{"num":13,"verse":"Is anyone among you afflicted? let them pray. Is anyone happy? let them sing."},{"num":14,"verse":"Is any sick among you? let him call for the elders of the congregation; {Gr. ekklesia – called out ones} and let them pray for him, anointing him with oil in the name of the Lord;"},{"num":15,"verse":"and the prayer of faith shall cause the one who is sick to be saved, and the Lord shall raise him up; and if he has committed sins, he shall be forgiven them."},{"num":16,"verse":"Confess your faults one to another and pray one for another that ye may be whole. The effectual prayer of the righteous is very powerful."},{"num":17,"verse":"Elijah was a man subject to passions like unto ours, and he asked in prayer that it might not rain, and it did not rain on the earth for three years and six months."},{"num":18,"verse":"And he prayed again, and the heaven gave rain, and the earth brought forth her fruit."},{"num":19,"verse":"Brethren, if any of you have erred from the truth, and someone should convert him;"},{"num":20,"verse":"let that one know, that whosoever causes the sinner to convert from the error of his way shall save a soul from death and shall cover a multitude of sins."}]