[{"num":5,"verse":"To the overcomer, on the heritages, the psalm of David. Lord, perceive thou my words with ears; understand thou my cry. (To the overcomer, for the inheritance, the song of David. Lord, hear thou my words; understand my cry.)"},{"num":2,"verse":"My king (My King), and my God; give thou attention to the voice of my prayer. For, Lord, I shall pray to thee;"},{"num":3,"verse":"hear thou early my voice. Early I shall stand nigh to thee, and I shall see; (hear thou my voice in the morning. Early in the morning I shall stand near to thee, and I shall see thee;)"},{"num":4,"verse":"for thou art God not desiring wickedness. Neither an evil-willed man shall dwell beside thee; (for thou art not a God who desireth wickedness. No one with an evil will shall stand beside thee;)"},{"num":5,"verse":"neither unjust men shall dwell before thine eyes. Thou hatest all them that work wickedness; (nor shall the unrighteous stand before thine eyes. Thou hatest all those who do evil;)"},{"num":6,"verse":"thou shalt lose them that speak leasing. The Lord shall hold abominable a man-queller, and a guileful man. (thou shalt destroy those who tell lies. And the Lord shall hold as abominable man-killers, that is, murderers, and liars.)"},{"num":7,"verse":"But Lord, in the multitude of thy mercy, I shall enter into thine house; I shall worship to(ward) thine holy temple in thy dread. (But Lord, because of thy great love, I shall enter into thy House; I shall bow toward thy holy Temple in reverence for thee.)"},{"num":8,"verse":"Lord, lead thou forth me in thy rightwiseness for mine enemies; (ad)dress thou my way in thy sight. (Lord, lead thou me forth in thy righteousness, because my enemies be all around me; direct thou my way before thee/direct thou me along thy way.)"},{"num":9,"verse":"For truth is not in their mouth; their heart is vain. Their throat is an open sepulchre, they did guilefully with their tongues; (For truth is not in their mouths; their hearts be empty. Their throats be an open tomb, or an open grave, and everything they say is deceitful, or corrupt;)"},{"num":10,"verse":"God, deem thou them. Fall they down from their thoughts; after the multitude of their wickednesses, or unpiousnesses, cast thou them down; for, Lord, they have stirred thee to wrath. (God, judge thou them. Let them fall by their own thoughts; throw thou them down after all their wickednesses; for, Lord, they have rebelled against thee.)"},{"num":11,"verse":"And all that hope in thee, be they glad; they shall make full out joy [into] without end, and thou shalt dwell in them. And all that love thy name shall have glory in thee; (But all who hope in thee, be they glad; they shall rejoice forever, and thou shalt live with them. And all who love thy name shall have glory in thee;)"},{"num":12,"verse":"for thou shalt bless the just man. Lord, thou hast crowned us, as with a shield of thy good will. (for thou shalt bless the righteous. Lord, thou hast surrounded us with thy favour, yea, like with a shield.)"}]