[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An hundred and fourscore days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As a period of mere feasting, this long time (half a year) is simply incredible, but we must understand it as a time during which troops were collected, and the plan of invasion settled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 1:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Many days, even a hundred and fourscore days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Making every day a magnificent feast either for all his princes, or for some of them, who might come to the feast successively, as the king ordered them to do. The Persian feasts are much celebrated in authors for their length and luxury.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-9 The pride of Ahasuerus's heart rising with the grandeur of his kingdom, he made an extravagant feast. This was vain glory. Better is a dinner of herbs with quietness, than this banquet of wine, with all the noise and tumult that must have attended it. But except grace prevails in the heart, self-exaltation and self-indulgence, in one form or another, will be the ruling principle. Yet none did compel; so that if any drank to excess, it was their own fault. This caution of a heathen prince, even when he would show his generosity, may shame many called Christians, who, under pretence of sending the health round, send sin round, and death with it. There is a woe to them that do so; let them read it, and tremble, Hab 2:15,16.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the third year - In this year, 483 B.C., Xerxes assembled the governors of provinces at Susa, in connection with his contemplated expedition against Greece.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The nobles - literally, \"the first men.\" The Hebrew word used is one adopted from the Persian. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The nobles - literally, \"the first men.\" The Hebrew word used is one adopted from the Persian. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. made a feast unto all his princes and his servants—Banquets on so grand a scale, and extending over so great a period, have been frequently provided by the luxurious monarchs of Eastern countries, both in ancient and modern times. The early portion of this festive season, however, seems to have been dedicated to amusement, particularly an exhibition of the magnificence and treasures of the court, and it was closed by a special feast of seven days' continuance, given within the gardens of the royal palace. The ancient palace of Susa has been recently disinterred from an incumbent mass of earth and ruins; and in that palace, which is, beyond all doubt, the actual edifice referred to in this passage, there is a great hall of marble pillars. \"The position of the great colonnade corresponds with the account here given. It stands on an elevation in the center of the mound, the remainder of which we may well imagine to have been occupied, after the Persian fashion, with a garden and fountains. Thus the colonnade would represent the 'court of the garden of the king's palace' with its 'pillars of marble.' I am even inclined to believe the expression, 'Shushan the palace,' applies especially to this portion of the existing ruins, in contradistinction to the citadel and the city of Shushan\" [Loftus, Chaldaea and Susiana].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Making every day a magnificent feast, either for all his princes, or for some of them, who might come to the feast successively, as the king ordered them to do. The Persian feasts are much celebrated in authors for their length and luxury. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When he showed the riches of his glorious kingdom,.... Xerxes was the fourth king of the Persian monarchy, and was \"far richer than all\" that went before him, all their riches coming into his hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and now that prophecy began to be fulfilled, \"that by his strength, through his riches, he should stir up all against the realm of Grecia\"; which he began to do in the third year of his reign, and for which these his nobles might be called together, as to have their advice, so to animate them to come in the more readily into the expedition, by showing them the riches he was possessed of; for to none of the kings of Persia does this largeness of riches better belong than to Xerxes: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the honour of his excellent majesty; the grandeur he lived in, the pomp and splendour of his court; he was the most grand and magnificent of all the kings of the Medes and Persians (i): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and this he did many days, even an hundred and fourscore days; to which seven more being added, as in the following verse, it made one hundred and eighty seven, the space of full six months; though some think the feast did not last so long, only seven days, and that the one hundred and eighty days were spent in preparing for it; but the Persian feasts were very long, large, and sumptuous. Dr. Frye (k) says, this custom of keeping an annual feast one hundred and eighty days still continues in Persia. Cheus (l), a Chinese emperor, used frequently to make a feast which lasted one hundred and twenty days; though it cannot be well thought that the same individual persons here were feasted so long, but, when one company was sufficiently treated, they removed and made way for another; and so it continued successively such a number of days as here related, which was six months, or half a year; a year then in use consisting of three hundred and sixty days, as was common with the Jews, and other nations, and so the Persians (m). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Pausan. Laconica, sive, l. 3. p. 165. (k) Travels, p. 348. apud Patrick in loc. (l) In Martin. Sinic. Hist. l. 3. p. 78. (m) Prideaux's Connect. par. 1. p. 197. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Pausan. Laconica, sive, l. 3. p. 165. (k) Travels, p. 348. apud Patrick in loc. (l) In Martin. Sinic. Hist. l. 3. p. 78. (m) Prideaux's Connect. par. 1. p. 197. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When he shewed the riches of his glorious kingdom and the honour of his excellent majesty many days, even an hundred and fourscore days.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the riches etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Herod. (vii. 27) tells of the golden plane tree and the golden vine given by Pythius, a rich man of Celaenae, to Darius. Aeschylus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Persae",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 161) mentions the walls hung with gold.[57] The text may refer among other things to the ingots of gold which Darius had stored in the treasury (Herod. iii. 96).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[57] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χρυσεοστόλμους δόμους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an hundred and fourscore days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This may mean a series of entertainments to successive relays of guests. The ‘princes’ could scarcely be all spared from their satrapies at once.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When he showed the riches",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ostentation was a main feature in the character of Xerxes. The huge army with which he invaded Greece was more for display than for service. Vain parade is apparent at every step of his expedition (Herod., 7:31, 40, 41, 44, 59, etc.). He now exhibits \"the riches of his kingdom\" to his nobles and chief officers, showing them doubtless all the splendours of the palace, the walls draped with gold (AEschyl., 'Pers.,' 50:161), the marble pillars and rich hangings, the golden plane tree and the golden vine (Herod., 7:27), and perhaps the ingots of gold wherewith Darius had filled the treasury (ibid. 3:96). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An hundred and fourscore days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We need not suppose that the same persons were enter. tained during the whole of this period. All the provincial governors could not quit their provinces at the same time, nor could any of them remain away very long. There was no doubt a succession of guests during the six months that the entertainment lasted. Esther 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"When he showed the glorious riches of his kingdom and the excellent honour of his greatness many days, one hundred and eighty days.\" This verse has been understood by most expositors as stating that the king magnificently and splendidly entertained all the grandees mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for a full half-year, and gave them a banquet which lasted 180 days. Clericus supposes proceedings to have been so arranged, that the proceres omnium provinciarum were not entertained at one and the same time, but alii post alios, because all could not be absent together per sex menses a suis provinciis. Bertheau, however, thinks that the historian did not purpose to give an exact and graphic description of the proceeding, but only to excite astonishment, and that they who are astonished will not inquire as to the manner in which all took place. The text, however, does not say, that the feast lasted 180 days, and hence offers no occasion for such a view, which is founded on a mistaken comprehension of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which combines וגו בּהראתו with משׁתּה עשׂה of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", while the whole of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is but a further amplification of the circumstantial clause: when the forces, etc., were before him; the description of the banquet not following till ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where, however, it is joined to the concluding words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"when these (180) days were full, the king made a feast to all the people that were found in the citadel of Susa, from great to small, seven days, in the court of the garden of the king's house.\" This verse is thus explained by Bertheau: after the soldiers, nobles, and princes of the district had been entertained for six months, all the male inhabitants of Susa were also entertained in a precinct of the palace garden, the women being feasted by Vashti the queen in the palace (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), It is, however, obvious, even from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which says that on the seventh day of this banquet the king commanded the queen to appear \"to show the people and the princes her beauty,\" that such a view of the occurrence is inadmissible. For this command presupposes, that the people and princes were assembled at the king's banquet; while, according to the view of Bertheau and older expositors, who insist on two banquets, one lasting 180 days, the other seven, the latter was given to the male inhabitants of Susa only. The princes and people of the whole kingdom did not, however, dwell in Susa. These princes and people, to whom the queen was to show her beauty, are undoubtedly the princes and servants of the king, the forces of Persia and Media, and the nobles and princes of the provinces enumerated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". With this agrees also the description of the guests invited to the seven days feast. בּשׁוּשׁן הנּמצאים כּל־העם does not signify \"all the inhabitants of Susa,\" but all then present, i.e., then assembled in the citadel of Susa. הנּמצאים used of persons means, those who for some purpose are found or present in any place, in distinction from its usual inhabitants; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 29:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 34:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 8:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and העם does not here signify people in the sense of population, but people who are met in a certain place, and is used both here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 12:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of an assembly of nobles and princes. קטן ועד למגּדול, moreover, does not mean old and young, but high and low, the greater and lesser servants (עבדים) of the king, and informs us that of those assembled at Susa, both princes and servants participated without exception in the banquet.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This view of Esther 1:3-5 is confirmed by the consideration, that if the seven days banquet were a different one from that mentioned in Esther 1:3, there could be no reason for naming the latter, which would then be not only entirely unconnected with the narrative, but for which no object at all would be stated; for בּהראתו cannot be translated, as in the Vulgate, by ut ostenderet, because, as Bertheau justly remarks, ב cannot indicate a purpose. From all these reasons it is obvious, that the feast of which further particulars are given in Esther 1:5-8 is the same משׁתּה which the king, according to Esther 1:3, gave to his שׂרים and עבדים, and that the text, rightly understood, says nothing of two consecutive banquets. The sense of Esther 1:3-5 is accordingly as follows: King Ahasuerus gave to his nobles and princes, when he had assembled them before him, and showed them the glorious riches of his kingdom and the magnificence of his greatness for 180 days, after these 180 days, to all assembled before him in the fortress of Susa, a banquet which lasted seven days. The connection of the more particular description of this banquet, by means of the words: when these (the previously named 180) days were over, following upon the accessory clause, Esther 1:4, is anacoluthistic, and the anacoluthon has given rise to the misconception, by which Esther 1:5 is understood to speak of a second banquet differing from the משׁתּה of Esther 1:3. The purpose for which the king assembled the grandees of his kingdom around him in Susa fore a whole half-year is not stated, because this has no connection with the special design of the present book. If, however, we compare the statement of Herod. vii. 8, that Xerxes, after the re-subjection of Egypt, summoned the chief men of his kingdom to Susa to take counsel with them concerning the campaign against Greece, it is obvious, that the assembly for 180 days in Susa, of the princes and nobles mentioned in the book of Esther, took place for the purpose of such consultation. When, too, we compare the statement of Herod. vii. 20, that Xerxes was four years preparing for this war, we receive also a corroboration of the particular mentioned in Esther 1:3, that he assembled his princes and nobles in the third year of his reign. In this view \"the riches of his kingdom,\" etc., mentioned in Esther 1:4, must not be understood of the splendour and magnificence displayed in the entertainment of his guests, but referred to the greatness and resources of the realm, which Xerxes descanted on to his assembled magnates for the purpose of showing them the possibility of carrying into execution his contemplated campaign against Greece. The banquet given them after the 180 days of consultation, was held in the court of the garden of the royal palace. בּיתן is a later form of בּית, which occurs only here and Esther 7:7-8. חצר, court, is the space in the park of the royal castle which was prepared for the banquet. The fittings and furniture of this place are described in Esther 1:6. \"White stuff, variegated and purple hangings, fastened with cords of byssus and purple to silver rings and marble pillars; couches of gold and silver upon a pavement of malachite and marble, mother-of-pearl and tortoise-shell.\" The description consists of mere allusions to, or exclamations at, the splendour of the preparations. In the first half of the verse the hangings of the room, in the second, the couches for the guests, are noticed. חוּר from חור means a white tissue of either linen or cotton. Bertheau supposes that the somewhat larger form of ch is intended to denote, even by the size of letter employed, the commencement of the description. כּרפּס, occurring in Sanscrit, Persian, Armenian, and Arabic, in Greek κάρπασος, means originally cotton, in Greek, according to later authorities, a kind of fine flax, here undoubtedly a cotton texture of various colours. תּכלת, deep blue, purple. The hangings of the space set apart were of these materials. Blue and white were, according to Curtius Esther 6:6, Esther 6:4, the royal colours of the Persians; comp. M. Duncker, Gesch. des Alterthums, ii. pp. 891 and 951 of the third edition, in which is described also the royal table, p. 952. The hangings were fastened (אחוּז) with cords of white byssus and purple to rings and pillars of white marble. מטּות, couches (divans) of gold and silver, i.e., covered with cloth woven of gold and silver thread, were prepared for the guests at the feast. These couches were placed upon a tesselated, mosaic-like floor; the tesselation being composed of stones of various colours. בּהט, in Arabic a mock stone, in lxx σμαραγδίτης, a spurious emerald, i.e., a green-coloured stone resembling the emerald, probably malachite or serpentine. שׁשׁ is white marble; דּר, Arabic darrun, darratun, pearl, lxx πίννινος λίθος, a pearl-like stone, perhaps mother-of-pearl. סחרת, a kind of dark-coloured stone (from סחר  equals  שׁחר, to be dark), black, black marble with shield-like spots (all three words occur only here).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This view of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is confirmed by the consideration, that if the seven days banquet were a different one from that mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", there could be no reason for naming the latter, which would then be not only entirely unconnected with the narrative, but for which no object at all would be stated; for בּהראתו cannot be translated, as in the Vulgate, by ut ostenderet, because, as Bertheau justly remarks, ב cannot indicate a purpose. From all these reasons it is obvious, that the feast of which further particulars are given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:5-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is the same משׁתּה which the king, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", gave to his שׂרים and עבדים, and that the text, rightly understood, says nothing of two consecutive banquets. The sense of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is accordingly as follows: King Ahasuerus gave to his nobles and princes, when he had assembled them before him, and showed them the glorious riches of his kingdom and the magnificence of his greatness for 180 days, after these 180 days, to all assembled before him in the fortress of Susa, a banquet which lasted seven days. The connection of the more particular description of this banquet, by means of the words: when these (the previously named 180) days were over, following upon the accessory clause, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is anacoluthistic, and the anacoluthon has given rise to the misconception, by which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is understood to speak of a second banquet differing from the משׁתּה of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The purpose for which the king assembled the grandees of his kingdom around him in Susa fore a whole half-year is not stated, because this has no connection with the special design of the present book. If, however, we compare the statement of Herod. vii. 8, that Xerxes, after the re-subjection of Egypt, summoned the chief men of his kingdom to Susa to take counsel with them concerning the campaign against Greece, it is obvious, that the assembly for 180 days in Susa, of the princes and nobles mentioned in the book of Esther, took place for the purpose of such consultation. When, too, we compare the statement of Herod. vii. 20, that Xerxes was four years preparing for this war, we receive also a corroboration of the particular mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he assembled his princes and nobles in the third year of his reign. In this view \"the riches of his kingdom,\" etc., mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", must not be understood of the splendour and magnificence displayed in the entertainment of his guests, but referred to the greatness and resources of the realm, which Xerxes descanted on to his assembled magnates for the purpose of showing them the possibility of carrying into execution his contemplated campaign against Greece. The banquet given them after the 180 days of consultation, was held in the court of the garden of the royal palace. בּיתן is a later form of בּית, which occurs only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 7:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". חצר, court, is the space in the park of the royal castle which was prepared for the banquet. The fittings and furniture of this place are described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"White stuff, variegated and purple hangings, fastened with cords of byssus and purple to silver rings and marble pillars; couches of gold and silver upon a pavement of malachite and marble, mother-of-pearl and tortoise-shell.\" The description consists of mere allusions to, or exclamations at, the splendour of the preparations. In the first half of the verse the hangings of the room, in the second, the couches for the guests, are noticed. חוּר from חור means a white tissue of either linen or cotton. Bertheau supposes that the somewhat larger form of ch is intended to denote, even by the size of letter employed, the commencement of the description. כּרפּס, occurring in Sanscrit, Persian, Armenian, and Arabic, in Greek κάρπασος, means originally cotton, in Greek, according to later authorities, a kind of fine flax, here undoubtedly a cotton texture of various colours. תּכלת, deep blue, purple. The hangings of the space set apart were of these materials. Blue and white were, according to Curtius ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 6:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the royal colours of the Persians; comp. M. Duncker, Gesch. des Alterthums, ii. pp. 891 and 951 of the third edition, in which is described also the royal table, p. 952. The hangings were fastened (אחוּז) with cords of white byssus and purple to rings and pillars of white marble. מטּות, couches (divans) of gold and silver, i.e., covered with cloth woven of gold and silver thread, were prepared for the guests at the feast. These couches were placed upon a tesselated, mosaic-like floor; the tesselation being composed of stones of various colours. בּהט, in Arabic a mock stone, in lxx σμαραγδίτης, a spurious emerald, i.e., a green-coloured stone resembling the emerald, probably malachite or serpentine. שׁשׁ is white marble; דּר, Arabic darrun, darratun, pearl, lxx πίννινος λίθος, a pearl-like stone, perhaps mother-of-pearl. סחרת, a kind of dark-coloured stone (from סחר  equals  שׁחר, to be dark), black, black marble with shield-like spots (all three words occur only here).",
            "children": []
          }
        ]
      }
    ]
  }
]