[[],[{"type":"header","content":"Serve God Willingly"},{"type":"prose","content":"Therefore, I strongly urge the elders among you [pastors, spiritual leaders of the church], as a fellow elder and as an eyewitness [called to testify] of the sufferings of Christ, as well as one who shares in the glory that is to be revealed: "}],[{"type":"prose","content":"shepherd  guide  protect the flock of God among you, exercising oversight not under compulsion, but voluntarily, according to  God; and not [motivated] for shameful gain, but with wholehearted enthusiasm; "}],[{"type":"prose","content":"not lording it over those assigned to your care [do not be arrogant or overbearing], but be examples [of Christian living] to the flock [set a pattern of integrity for your congregation]. "}],[{"type":"prose","content":"And when the Chief Shepherd (Christ) appears, you will receive the [conqueror’s] unfading crown of glory. "}],[{"type":"prose","content":"Likewise, you younger men [of lesser rank and experience], be subject to your elders [seek their counsel]; and all of you, clothe yourselves with humility toward one another [tie on the servant’s apron], for  [the disdainful, the presumptuous, and He defeats them], ."}],[{"type":"prose","content":"Therefore humble yourselves under the mighty hand of God [set aside self-righteous pride], so that He may exalt you [to a place of honor in His service] at the appropriate time, "}],[{"type":"prose","content":"casting all your cares [all your anxieties, all your worries, and all your concerns, once and for all] on Him, for He cares about you [with deepest affection, and watches over you very carefully]. "}],[{"type":"prose","content":"Be sober [well balanced and self-disciplined], be alert  cautious at all times. That enemy of yours, the devil, prowls around like a roaring lion [fiercely hungry], seeking someone to devour. "}],[{"type":"prose","content":"But resist him, be firm in  faith [against his attack—rooted, established, immovable], knowing that the same experiences of suffering are being experienced by your brothers and sisters throughout the world. [You do not suffer alone.] "}],[{"type":"prose","content":"After you have suffered for a little while, the God of all grace [who imparts His blessing and favor], who called you to His  eternal glory in Christ, will Himself complete, confirm, strengthen, and establish you [making you what you ought to be]. "}],[{"type":"prose","content":"To Him be dominion (power, authority, sovereignty) forever and ever. Amen."}],[{"type":"prose","content":"By Silvanus, our faithful brother as I consider him, I have written to you briefly, to counsel and testify that this is the true grace [the undeserved favor] of God. Stand firm in it! "}],[{"type":"prose","content":"She [the church] who is in Babylon, chosen together with you, sends you greetings, and  my son [in the faith], Mark. "}],[{"type":"prose","content":"Greet one another with a kiss of love.To all of you who are in Christ, may there be peace."}]]