[{"num":5,"verse":"So I am talking to the leaders among you. I am also a leader. I saw the sufferings of Christ. And I will have some part of his greatness when he comes again."},{"num":2,"verse":"Take good care of God's people. They have been given to you to care for. Do this, not because you must do it, but because you want to please God. Do it not for the money that you get for doing it, but because you are glad to do it."},{"num":3,"verse":"Do not be like a boss over the people you care for, telling them how to live. But show them how to live by the way you live."},{"num":4,"verse":"Christ the big Shepherd who takes care of all people is coming. When he comes, he will give you a crown to show that you are great. You will have it for ever."},{"num":5,"verse":"Also, you who are younger men, obey your leaders. I say to all of you, do not be proud. Do not think you are better than the others. The holy writings say, `God fights against proud people, but he helps those who are not proud.'"},{"num":6,"verse":"You are under God's power. Do not be proud, so that at the right time he may put you into a higher place."},{"num":7,"verse":"Turn all your troubles over to him, because he cares for you and is watching over you."},{"num":8,"verse":"Keep awake! Watch! Your enemy the devil is walking around like a growling lion. He is looking for someone to catch."},{"num":9,"verse":"Fight against the devil. Be strong because you believe. Remember that your brothers all over the world suffer the same kind of trouble as you."},{"num":10,"verse":"God gives all blessings. He has called you through Christ to be great with him for ever. When you have suffered for a short time, he will make you all right. He will make you strong and steady."},{"num":11,"verse":"He has power for ever. Yes, he has!"},{"num":12,"verse":"Silas has written this short letter for me. I believe he is a brother who can be trusted. I have written to help you and tell you the true way to have God's blessing. Stand firm in that way!"},{"num":13,"verse":"The church people in the city of Babylon greet you. God has also chosen them. My son Mark also greets you."},{"num":14,"verse":"Greet one another with a kiss of love. May all of you who are Christians have peace."}]