[{"header":"Jacob Fears Esau"},{"num":32,"verse":"And Jacob went on his way, and angels of God met him. "},{"num":2,"verse":"And when he saw them, Jacob said, “This is the camp of God!” And he called the name of that place Mahanaim."},{"num":3,"verse":"Then Jacob sent messengers before him to Esau his brother, to the land of Seir, the territory of Edom. "},{"num":4,"verse":"And he instructed them, saying, “Thus you must say to my lord, to Esau, ‘Thus says your servant Jacob, I have dwelled as an alien with Laban, and I have remained there until now. "},{"num":5,"verse":"And I have acquired cattle, male donkeys, flocks, and male and female slaves, and I have sent to tell my lord, to find favor in your eyes.’” "},{"num":6,"verse":"And the messengers returned to Jacob and said, “We came to your brother, to Esau, and he is coming to meet you, and four hundred men are with him.” "},{"num":7,"verse":"Then Jacob was very frightened and distressed. So he divided the people, flocks, cattle, and camels that were with him into two companies. "},{"num":8,"verse":"And he thought, “If Esau comes to one company and destroys it, the remaining company will be able to escape.” "},{"num":9,"verse":"Then Jacob said, “O God of my father Abraham, and God of my father Isaac, O Yahweh, who said to me, ‘Return to your land and to your family, and I will deal well with you.’ "},{"num":10,"verse":"I am not worthy of all the loyal love and all the faithfulness that you have shown your servant, for with only my staff I crossed this Jordan, and now I have become two camps. "},{"num":11,"verse":"Please rescue me from the hand of my brother, from the hand of Esau, for I fear him, lest he come and attack mother and children alike. "},{"num":12,"verse":"Now you yourself said, ‘I will surely deal well with you and make your offspring as the sand of the sea that cannot be counted for abundance.’”"},{"num":13,"verse":"And he lodged there that night. Then he took from what he had with him a gift for Esau his brother: "},{"num":14,"verse":"two hundred female goats, twenty male goats, two hundred ewes, twenty rams, "},{"num":15,"verse":"thirty milk camels with their young, forty cows, ten bulls, twenty female donkeys, and ten male donkeys. "},{"num":16,"verse":"And he put them under the hand of his servants, herd by herd, and said to his servants, “Cross on ahead before me, and put some distance between herds. "},{"num":17,"verse":"And he instructed the foremost, saying, “When Esau my brother comes upon you and asks you, saying, ‘Whose are you and where are you going? To whom do these animals belong ahead of you?’ "},{"num":18,"verse":"Then you must say, ‘To your servant, to Jacob. It is a gift sent to my lord, to Esau. Now behold, he is also coming after us.’” "},{"num":19,"verse":"And he also instructed the second servant and the third, and everyone else who was behind the herds, saying, “You must speak to Esau according to this word when you find him. "},{"num":20,"verse":"And moreover, you shall say, ‘Look, your servant Jacob is behind us.’” For he thought, “Let me appease him with the gift going before me, and afterward I will see his face. Perhaps he will show me favor.” "},{"num":21,"verse":"So the gift passed on before him, but he himself spent that night in the camp."},{"header":"Jacob Wrestles with God"},{"num":22,"verse":"That night he arose and took his two wives, his two female servants, and his eleven children and crossed the ford of the Jabbok. "},{"num":23,"verse":"And he took them and sent them across the stream. Then he sent across all his possessions. "},{"num":24,"verse":"And Jacob remained alone, and a man wrestled with him until the breaking of the dawn. "},{"num":25,"verse":"And when he saw that he could not prevail against him, he struck his hip socket, so that Jacob’s hip socket was sprained as he wrestled with him. "},{"num":26,"verse":"Then he said, “Let me go, for dawn is breaking.” But he answered, “I will not let you go unless you bless me.” "},{"num":27,"verse":"Then he said to him, “What is your name?” And he said, “Jacob.” "},{"num":28,"verse":"And he said, “Your name shall no longer be called Jacob, but Israel, for you have struggled with God and with men and have prevailed.” "},{"num":29,"verse":"Then Jacob asked and said, “Please tell me your name.” And he said, “Why do you ask this—for my name?” And he blessed him there. "},{"num":30,"verse":"Then Jacob called the name of the place Peniel which means “I have seen God face to face and my life was spared.” "},{"num":31,"verse":"Then the sun rose upon him as he passed Penuel, and he was limping because of his hip. "},{"num":32,"verse":"Therefore the Israelites do not eat the sinew of the sciatic nerve that is upon the socket of the hip unto this day, because he struck the socket of the thigh of Jacob at the sinew of the sciatic nerve."}]