[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 24:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 24:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When they had gone through all the land — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But not numbered all the people, for the work grew so tedious that they omitted Levi and Benjamin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joab gave up the number of the people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "There are two returns left us of this numbering, (one here and the other 1 Chronicles 21,) which differ considerably from one another; especially in relation to the men of Israel; which, in the first, are returned but eight hundred thousand, but in the last, one million one hundred thousand. “But I think,” says Delaney, “a careful attendance to both the texts, and to the nature of the thing, will easily reconcile them. The matter appears to me thus: Joab, who resolved from the beginning, not to number the whole of the people, but who, at the same time, wished to show his own tribe in the best light, and make their number as considerable as he could, numbered every man among them, from twenty years old and upward, and so returned them to be five hundred thousand: but in Israel he only made a return of such men as were exercised and approved in arms: and therefore the number of persons above twenty years old is less in his return here than in Chronicles. In a word, here the whole of Judah is returned, and only the men of approved valour in Israel. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the whole of Israel is expressly returned; but the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is not prefixed to those of Judah; and therefore possibly the men of tried valour in that tribe are only included in that return: and if so, the returns must of necessity be very different.” Perhaps, however, some mistake has been made in one of the texts by the copyists. In which case Houbigant prefers the smaller number.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-9 For the people's sin David was left to act wrong, and in his chastisement they received punishment. This example throws light upon God's government of the world, and furnishes a useful lesson. The pride of David's heart, was his sin in numbering of the people. He thought thereby to appear the more formidable, trusting in an arm of flesh more than he should have done, and though he had written so much of trusting in God only. God judges not of sin as we do. What appears to us harmless, or, at least, but a small offence, may be a great sin in the eye of God, who discerns the thoughts and intents of the heart. Even ungodly men can discern evil tempers and wrong conduct in believers, of which they themselves often remain unconscious. But God seldom allows those whom he loves the pleasures they sinfully covet.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The strong hold of Tyre - \"The fenced city,\" as it is generally rendered throughout the historical books.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The cities of the Hivites - Gibeon, Chephirah, Beeroth, and Kirjath-jearim, and perhaps Shechem, besides those at the foot of Hermon and Lebanon, of which we do not know the names. This continuance of distinct communities of Hivites so late as the end of David's reign is remarkable. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The cities of the Hivites - Gibeon, Chephirah, Beeroth, and Kirjath-jearim, and perhaps Shechem, besides those at the foot of Hermon and Lebanon, of which we do not know the names. This continuance of distinct communities of Hivites so late as the end of David's reign is remarkable. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. the land of Tahtim-hodshi—that is, the land lately acquired; namely, that of the Hagarites conquered by Saul (1Ch 5:10). The progress was northward. Thence they crossed the country, and, proceeding along the western coast to the southern extremities of the country, they at length arrived in Jerusalem, having completed the enumeration of the whole kingdom in the space of nine months and twenty days.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So when they had gone through all the land,.... Beginning at the east, and from thence to the north, and then going about to the west, came to the south, which finished their circuit: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they came to Jerusalem, at the end of nine months and twenty days: they were ten months wanting ten days in numbering the people; in which they seem to have been very expeditious. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they came to Jerusalem, at the end of nine months and twenty days: they were ten months wanting ten days in numbering the people; in which they seem to have been very expeditious. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So when they had gone through all the land, they came to Jerusalem at the end of nine months and twenty days.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "through all the land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Joab however omitted the Levites, in accordance with the direction given to Moses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.), because they were exempt from military service; and the Benjamites, possibly in order to avoid exciting disaffection in a tribe specially ready to take offence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Nine months and twenty days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This long period seems excessive, if nothing more was intended than merely counting the heads of the people, especially as the census was left unfinished. But there might very probably be difficulties with the aliens dwelling in Israel; and it is still more probable that there was a complete examination of all the military resources of the land. The result showed a very different state of things from that described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and we can well understand the existence of much elation and war lust among the Israelites on the first flush of pride in their new empire. 2 Samuel 24:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When they had traversed the whole land, they came back to Jerusalem, at the end of nine months and twenty days, and handed over to the king the number of the people mustered: viz., 800,000 men of Israel fit for military service, drawing the sword, and 500,000 men of Judah. According to the Chronicles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there were 1,100,000 Israelites and 470,000 Judaeans. The numbers are not given by thousands, and therefore are only approximative statements in round numbers; and the difference in the two texts arose chiefly from the fact, that the statements were merely founded upon oral tradition, since, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the result of the census was not inserted in the annals of the kingdom. There is no ground, however, for regarding the numbers as exaggerated, if we only bear in mind that the entire population of a land amounts to about four times the number of those who are fit for military service, and therefore 1,300,000, or even a million and a half, would only represent a total population of five or six millions, - a number which could undoubtedly have been sustained in Palestine, according to thoroughly reliable testimony as to its unusual fertility (see the discussion of this subject at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Pentateuch, pp. 651-57). Still less can we adduce as a proof of exaggeration the fact, that according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:1-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", David had only an army of 288,000; for it is a well-known fact, that in all lands the army, or number of men in actual service, is, as a rule, much smaller than the total number of those who are capable of bearing arms. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the tribes of Levi and Benjamin were not numbered, because, as the chronicler adds, giving his own subjective view, \"the word of the king was an abomination to Joab,\" or, as it is affirmed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to the objective facts, \"because the numbering was not completed.\" It is evident from this, that in consequence of Joab's repugnance to the numbering of the people, he had not hurried with the fulfilment of the kings' command; so that when David saw his own error, he revoked the command before the census was complete, and so the tribe of Benjamin was not numbered at all, the tribe of Levi being of course eo ipso exempt from a census that was taken for the sake of ascertaining the number of men who were capable of bearing arms. ",
        "children": []
      }
    ]
  }
]