[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In Israel eight hundred thousand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The numbers here differ greatly from those given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 21:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but there is no reason to suppose any corruption of the text in either case. Joab undertook the work unwillingly, and performed it imperfectly. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he refused altogether to number Levi and Benjamin; and according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 27:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “he finished not,” and no official record was made of the result; “neither was the number put in the account of the chronicles of king David.” The numbers were, therefore, in part mere estimates. Here Israel is said to be 800,000, in Chronicles 1,100,000; but the latter probably includes an estimate of the omitted tribes of Benjamin and Levi, and perhaps of portions of other tribes. On the other hand, Judah is here 500,000 (a round number like all the rest), and in Chronicles 470,000. The difference is due perhaps to an estimate of the officiating priests and Levities reckoned to Judah. Another supposition is that the regular army of 288,000 (twelve divisions of 24,000 each) is included in Israel in one case and excluded in the other, and that in the same way in regard to Judah “the thirty” may have had command of a special body of 30,000. Possibly in one case the descendants of the old Canaanites were reckoned (since it appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that David “had numbered them”), and in the other were excluded. There is no reason to doubt the general reliability of the numbers, which would give a probable total population of five or six millions, or from 415 to 500 to a geographical square mile—a number not at all impossible in so fertile a country. (Robinson’s estimate of the area of the country is about 12,000 geographical square miles.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-9 For the people's sin David was left to act wrong, and in his chastisement they received punishment. This example throws light upon God's government of the world, and furnishes a useful lesson. The pride of David's heart, was his sin in numbering of the people. He thought thereby to appear the more formidable, trusting in an arm of flesh more than he should have done, and though he had written so much of trusting in God only. God judges not of sin as we do. What appears to us harmless, or, at least, but a small offence, may be a great sin in the eye of God, who discerns the thoughts and intents of the heart. Even ungodly men can discern evil tempers and wrong conduct in believers, of which they themselves often remain unconscious. But God seldom allows those whom he loves the pleasures they sinfully covet.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " indicates sufficiently why the numbering was sinful. It is also stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Joab purposely omitted Levi and Benjamin from the reckoning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eight hundred thousand ... five hundred thousand - In Chronicles the numbers are differently given. It is probable therefore that the Chronicler has included in his statement of the sum total some numbers which are not included here. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Eight hundred thousand ... five hundred thousand - In Chronicles the numbers are differently given. It is probable therefore that the Chronicler has included in his statement of the sum total some numbers which are not included here. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. Joab gave up the sum of the number of the people unto the king—The amount here stated, compared with 1Ch 21:5, gives a difference of three hundred thousand. The discrepancy is only apparent, and admits of an easy reconciliation; thus (see 1Ch 27:1-15), there were twelve divisions of generals, who commanded monthly, and whose duty was to keep guard on the royal person, each having a body of troops consisting of twenty-four thousand men, which, together, formed an army of two hundred eighty-eight thousand; and as a separate detachment of twelve thousand was attendant on the twelve princes of the twelve tribes mentioned in the same chapter, so both are equal to three hundred thousand. These were not reckoned in this book, because they were in the actual service of the king as a regular militia. But 1Ch 21:5 joins them to the rest, saying, \"all those of Israel were one million, one hundred thousand\"; whereas the author of Samuel, who reckons only the eight hundred thousand, does not say, \"all those of Israel,\" but barely \"and Israel were,\" &c. It must also be observed that, exclusive of the troops before mentioned, there was an army of observation on the frontiers of the Philistines' country, composed of thirty thousand men, as appears from 2Sa 6:1; which, it seems, were included in the number of five hundred thousand of the people of Judah by the author of Samuel. But the author of Chronicles, who mentions only four hundred seventy thousand, gives the number of that tribe exclusive of those thirty thousand men, because they were not all of the tribe of Judah, and therefore he does not say, \"all those of Judah,\" as he had said, \"all those of Israel,\" but only, \"and those of Judah.\" Thus both accounts may be reconciled [Davidson].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Eight hundred thousand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Object",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Chronicles 21:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", they are numbered 1,100,000. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Answ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sum here expressed is only of such as were not in the ordinary and settled militia waiting upon the king, which being 24,000 for every month, as is largely related, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 1Ch 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", amounts to 288,000, which either with their several commanders, or with the soldiers, placed in several garrisons, might very well make up 300,000. Or 288,000 may pass in such accounts for 300,000; it being frequent in such great sums to neglect a smaller number. But in the Book of the Chronicles, which was to gather up the fragments omitted in the former books, both sorts are put together, and so they amount to 1,100,000. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Five hundred thousand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Chronicles 21:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but 470,000. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. They were exactly no more, but are called 500,000 in a round sum, as is usual in Scripture and other authors. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The garrison soldiers, and such as were employed in other services about the king, are here included, which are there excluded. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. They were 300,000 when Joab gave up the number to the king, though presently after that they were but 470,000; 30,000 being slain by the plague in the tribe of Judah; which being David’s own tribe, it was but just and fit it should suffer more than the rest for this sin. And though it be true that Joab gave up the sum before the plague begun, yet the sacred penman of the Book of Chronicles thought fit to make a defalcation of them who had been swept away by the plague, that the judgment of God therein might be observed. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. There are included here the 30,000 which belonged to the thirty colonels mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 2Sa 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who are excluded ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 1Ch 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although it be questionable whether those were all of the tribe of Judah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joab gave up the sum of the number of the people unto the king,.... Having collected from the several captains employed in this work their several particular numbers, he put them together, and gave in the sum total to David: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and there were in Israel eight hundred thousand valiant men that drew the sword; though many of them might be under the age of twenty, yet being robust and tall, and fit to bear arms, though but sixteen, seventeen, eighteen, or nineteen years of age, were mustered, contrary to the law; which, according to Cornelius Bertram (z) was David's sin, see 1 Chronicles 27:23. In 1 Chronicles 21:5, they are said to be a million and an hundred thousand, which is three hundred thousand more than the sum here given; several methods are taken to reconcile this; but what seems to be the best solution of the difficulty is what is observed by a Jew (a), that here the number of the people in the several parts of the land of Israel was given, which were eight hundred thousand, there along with them, the numbers of the standing army which waited on the king in their courses, which were twenty four thousand every, month, and amounted in the twelve months to 288,000, and reckoning lo thousand officers to them, they make the sum of three hundred thousand wanted, see 1 Chronicles 27:1, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and there were in Israel eight hundred thousand valiant men that drew the sword; though many of them might be under the age of twenty, yet being robust and tall, and fit to bear arms, though but sixteen, seventeen, eighteen, or nineteen years of age, were mustered, contrary to the law; which, according to Cornelius Bertram (z) was David's sin, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", they are said to be a million and an hundred thousand, which is three hundred thousand more than the sum here given; several methods are taken to reconcile this; but what seems to be the best solution of the difficulty is what is observed by a Jew (a), that here the number of the people in the several parts of the land of Israel was given, which were eight hundred thousand, there along with them, the numbers of the standing army which waited on the king in their courses, which were twenty four thousand every, month, and amounted in the twelve months to 288,000, and reckoning lo thousand officers to them, they make the sum of three hundred thousand wanted, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the men of Judah were five hundred thousand men. In 1 Chronicles 21:5, they are said to be only 470,000, thirty thousand less than here; which may be accounted for by making use of a round number, though something wanting, as is often done; or else the thirty companies, consisting of a thousand each, under the eighty captains mentioned in 2 Samuel 23:8, are taken into the account here, but left out in the book of Chronicles; or there were so many in the sum total of the men of Judah before the plague, but thirty thousand being consumed thereby, are left out in the latter accounts, so Kimchi; but the other solutions seem best: Levi and Benjamin were not counted; it being abominable to Joab, he did not finish it, and especially being displeasing to God, who smote Israel for it, 1 Chronicles 21:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the men of Judah were five hundred thousand men. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", they are said to be only 470,000, thirty thousand less than here; which may be accounted for by making use of a round number, though something wanting, as is often done; or else the thirty companies, consisting of a thousand each, under the eighty captains mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are taken into the account here, but left out in the book of Chronicles; or there were so many in the sum total of the men of Judah before the plague, but thirty thousand being consumed thereby, are left out in the latter accounts, so Kimchi; but the other solutions seem best: Levi and Benjamin were not counted; it being abominable to Joab, he did not finish it, and especially being displeasing to God, who smote Israel for it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Lucubrat. Frauktall, c. 2.((a) R. Eliezer in Halicot Olam, tract. 4. c. 3. p. 181. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Lucubrat. Frauktall, c. 2.((a) R. Eliezer in Halicot Olam, tract. 4. c. 3. p. 181. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joab gave up the sum of the number of the people unto the king: and there were in Israel {d} eight hundred thousand valiant men that drew the sword; and the men of Judah were {e} five hundred thousand men.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Joab gave up the sum of the number of the people unto the king: and there were in Israel ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " eight hundred thousand valiant men that drew the sword; and the men of Judah ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " five hundred thousand men.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) According to Joab's count: for in all there were eleven hundred thousand, 1Ch 21:5.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Including the Benjamites with them, or else they had but four hundred and seventy thousand.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eight hundred thousand … five hundred thousand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the numbers are given as 1,100,000 for Israel, and 470,000 for Judah. This discrepancy may be due to textual corruption, but more probably arises from a difference in the original estimates, or in the oral tradition with respect to them, since the result of the census was not authoritatively registered in the state records (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The conjecture that the standing army of 288,000 men (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:1-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is here deducted from Israel, and some body of 30,000 troops added to Judah, is ingenious, but rendered improbable by the fact that it is necessary to add to the one and subtract from the other to make the totals equal to those of 1 Chron.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The numbers have been attacked as exaggerated, and far exceeding the possible capacity of the country. The numbers given imply a total population of five or six millions at least, and the area of the country is estimated at about 11,000 square miles. This gives (making allowance for the excepted tribes) between 500 and 600 to the square mile, a high but not impossible rate of population when the extreme fertility of the country in ancient times is taken into consideration. The ruins with which Palestine is covered in every direction prove that the population was exceptionally dense. See Smith’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Art. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Census",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There were in Israel eight hundred thousand valiant men that drew the sword; and the men of Judah were five hundred thousand men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In Chronicles the numbers are, \"of Israel eleven hundred thousand men, and of Judah four hundred and sixty-five thousand men.\" These discrepancies are a remarkable confirmation of the truth of what is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that because of the outbreak of the Divine wrath, \"the number was not put in the account of the Chronicles of King David.\" Neither the writer of the Books of Samuel nor of Chronicles had any official document to refer to; and as the numbers are lump sums, and derived probably from what was said by the enumerators, the more exact four hundred and sixty-five thousand men of the Chronicles might easily in round numbers be called a half million. The other is a much larger discrepancy, and no satisfactory explanation of it has been given. It  is, however, quite possible that the additional three hundred thousand men were made up of the thirty-eight thousand Levites, as numbered on a later occasion by David, of the Benjamites, and of the aborigines, who belonged to the northern part of the kingdom, and might be included among \"all they of Israel\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The numbers are further attacked on the ground of exaggeration. A million and a half of fighting men means a general population of six or seven millions. Now, Palestine at most does not contain more than eleven thousand square miles, and a population of six millions means five hundred and forty-five persons to every square mile, or one to every acre. The country was undoubtedly very fertile in ancient times, and the ruins of populous cities are found where now there is a waste. But there were vast forests and pasture lands and downs, where there were the means of subsistence for only a few. But we must remember that the enumerators went as far north as Tyre, and counted the inhabitants, therefore, of the seaboard between it and Sidon. Probably they also acted in the same way in the south, where the limits of Simeon were very uncertain. Besides this, there is a very remarkable undesigned coincidence. We read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". that David had a force of two hundred and eighty-eight thousand men, who formed his regular army, and of whom twenty-four thousand were called up for training every month. But there are reasons for believing that David took for this purpose each fifth man of those of the military age (see Sime, 'Kingdom of All Israel,' p. 389); and thus the whole number of such men would be one million four hundred and forty thousand. This, as Mr. Sime has shown (ibid., p. 378), holds a middle place between the one million three hundred thousand of the Book of Samuel, and the one million five hundred and seventy thousand of Chronicles, and shows that these numbers are not to be rejected on the score of exaggeration. 2 Samuel 24:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When they had traversed the whole land, they came back to Jerusalem, at the end of nine months and twenty days, and handed over to the king the number of the people mustered: viz., 800,000 men of Israel fit for military service, drawing the sword, and 500,000 men of Judah. According to the Chronicles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there were 1,100,000 Israelites and 470,000 Judaeans. The numbers are not given by thousands, and therefore are only approximative statements in round numbers; and the difference in the two texts arose chiefly from the fact, that the statements were merely founded upon oral tradition, since, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the result of the census was not inserted in the annals of the kingdom. There is no ground, however, for regarding the numbers as exaggerated, if we only bear in mind that the entire population of a land amounts to about four times the number of those who are fit for military service, and therefore 1,300,000, or even a million and a half, would only represent a total population of five or six millions, - a number which could undoubtedly have been sustained in Palestine, according to thoroughly reliable testimony as to its unusual fertility (see the discussion of this subject at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Pentateuch, pp. 651-57). Still less can we adduce as a proof of exaggeration the fact, that according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:1-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", David had only an army of 288,000; for it is a well-known fact, that in all lands the army, or number of men in actual service, is, as a rule, much smaller than the total number of those who are capable of bearing arms. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the tribes of Levi and Benjamin were not numbered, because, as the chronicler adds, giving his own subjective view, \"the word of the king was an abomination to Joab,\" or, as it is affirmed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to the objective facts, \"because the numbering was not completed.\" It is evident from this, that in consequence of Joab's repugnance to the numbering of the people, he had not hurried with the fulfilment of the kings' command; so that when David saw his own error, he revoked the command before the census was complete, and so the tribe of Benjamin was not numbered at all, the tribe of Levi being of course eo ipso exempt from a census that was taken for the sake of ascertaining the number of men who were capable of bearing arms. ",
        "children": []
      }
    ]
  }
]