[{"num":43,"verse":"But the famine was severe in the land; "},{"num":2,"verse":"so when they had eaten up the grain which they had brought out of Egypt, their father said to them, “Go again, buy us a little food.” "},{"num":3,"verse":"Y’hudah said to him, “The man expressly warned us, ‘You will not see my face unless your brother is with you.’ "},{"num":4,"verse":"If you will send our brother with us, we will go down and buy you food; "},{"num":5,"verse":"but if you will not send him, we will not go down; for the man said to us, ‘You will not see my face unless your brother is with you.’” "},{"num":6,"verse":"Isra’el said, “Why did you bring such trouble my way by telling the man you had another brother?” "},{"num":7,"verse":"They answered, “The man kept questioning us about ourselves and about our kinsmen. He asked, ‘Is your father still alive?’ ‘Do you have another brother?’ and we answered according to the literal meaning of his questions. How were we to know he would say, ‘Bring your brother down’?”"},{"num":8,"verse":"Y’hudah said to Isra’el his father, “Send the boy with me; and we will make preparations and leave; so that we may stay alive and not die, both we and you, and also our little ones. "},{"num":9,"verse":"I myself will guarantee his safety; you can hold me responsible. If I fail to bring him to you and present him to your face, let me bear the blame forever. "},{"num":10,"verse":"Except for our lengthy delay, we would have been there again by now.”"},{"num":11,"verse":"Their father Isra’el answered them, “If that’s how it is, do this: take in your containers some of the land’s best products, and bring the man a gift — some healing resin, a little honey, aromatic gum, opium, pistachio nuts and almonds. "},{"num":12,"verse":"Take twice the amount of money with you; and return the money that came back with you in your packs — it could have been an oversight. "},{"num":13,"verse":"Yes, and take your brother too; and get ready; and go again to the man. "},{"num":14,"verse":"May El Shaddai give you favor in the man’s sight, so that he will release to you your other brother as well as Binyamin. As for me, if I must lose my children, lose them I will.” "},{"num":15,"verse":"The men took that gift, and they took twice the money with them, and Binyamin; then they prepared, went down to Egypt and stood before Yosef."},{"num":16,"verse":"(vi) When Yosef saw Binyamin with them, he said to his household manager, “Take the men inside the house, kill the animals and prepare the meat. These men will dine with me at noon.” "},{"num":17,"verse":"The man did as Yosef ordered and brought the men into Yosef’s house."},{"num":18,"verse":"Upon being ushered inside Yosef’s house, the men became fearful. They said, “It’s because of the money that was returned in our packs the first time that we have been brought inside — so that he can use it as an excuse to attack us, take us as slaves and seize our donkeys too.” "},{"num":19,"verse":"So they approached the manager of Yosef’s household and spoke to him at the entrance of the house: "},{"num":20,"verse":"“Please, my lord, the first time we indeed came down to buy food; "},{"num":21,"verse":"but when we got to camp, we opened our packs, and there inside our packs was each man’s money, the full amount. We have brought it back with us; "},{"num":22,"verse":"moreover, we have brought down other money to buy food. We have no idea who put our money in our packs.” "},{"num":23,"verse":"“Stop worrying,” he replied, “don’t be afraid. Your God and the God of your father put treasure in your packs. As for your money — I was the one who received it.” Then he brought Shim‘on out to them."},{"num":24,"verse":"The man brought the men into Yosef’s house and gave them water, and they washed their feet, and he provided fodder for their donkeys. "},{"num":25,"verse":"Then they got their gift ready for Yosef’s arrival at noon, for they had heard that they were going to eat a meal there. "},{"num":26,"verse":"When Yosef arrived home, they went in the house and presented him with the gift they had brought with them, then prostrated themselves before him on the ground. "},{"num":27,"verse":"He asked them how they were and inquired, “Is your father well, the old man of whom you spoke? Is he still alive?” "},{"num":28,"verse":"They answered, “Your servant our father is well; yes, he is still alive,” as they bowed in respect. "},{"num":29,"verse":"He looked up and saw Binyamin his brother, his mother’s son, and said, “Is this your youngest brother, of whom you spoke to me?” and added, “May God be good to you, my son.”"},{"num":30,"verse":"(vii) Then Yosef hurried out, because his feelings toward his brother were so strong that he wanted to cry; he went into his bedroom and there he wept. "},{"num":31,"verse":"Then he washed his face and came out, but he controlled himself as he gave the order to serve the meal. "},{"num":32,"verse":"They served him by himself, the brothers by themselves, and the Egyptians included at the meal by themselves — Egyptians don’t eat with Hebrews, because that is abhorrent to them. "},{"num":33,"verse":"So they sat there facing him, the firstborn in the place of honor, the youngest in last place; and the men expressed their amazement to each other. "},{"num":34,"verse":"Each was given his serving there in front of him, but Binyamin’s portion was five times as large as any of theirs. So they drank and enjoyed themselves with him."}]