[[],[],[{"type":"header","content":"Simon the Wizard"},{"type":"prose","content":"That set off a terrific persecution of the church in Jerusalem. The believers were all scattered throughout Judea and Samaria. All, that is, but the apostles. Good and brave men buried Stephen, giving him a solemn funeral—not many dry eyes that day!"}],[{"type":"prose","content":"And Saul just went wild, devastating the church, entering house after house after house, dragging men and women off to jail. Forced to leave home base, the followers of Jesus all became missionaries. Wherever they were scattered, they preached the Message about Jesus. Going down to a Samaritan city, Philip proclaimed the Message of the Messiah. When the people heard what he had to say and saw the miracles, the clear signs of God’s action, they hung on his every word. Many who could neither stand nor walk were healed that day. The evil spirits protested loudly as they were sent on their way. And what joy in the city!"}],[{"type":"prose","content":"Previous to Philip’s arrival, a certain Simon had practiced magic in the city, posing as a famous man and dazzling all the Samaritans with his wizardry. He had them all, from little children to old men, eating out of his hand. They all thought he had supernatural powers, and called him “the Great Wizard.” He had been around a long time and everyone was more or less in awe of him."}],[{"type":"prose","content":"But when Philip came to town announcing the news of God’s kingdom and proclaiming the name of Jesus Christ, they forgot Simon and were baptized, becoming believers right and left! Even Simon himself believed and was baptized. From that moment he was like Philip’s shadow, so fascinated with all the God-signs and miracles that he wouldn’t leave Philip’s side."}],[{"type":"prose","content":"When the apostles in Jerusalem received the report that Samaria had accepted God’s Message, they sent Peter and John down to pray for them to receive the Holy Spirit. Up to this point they had only been baptized in the name of the Master Jesus; the Holy Spirit hadn’t yet fallen on them. Then the apostles laid their hands on them and they did receive the Holy Spirit."}],[{"type":"prose","content":"When Simon saw that the apostles by merely laying on hands conferred the Spirit, he pulled out his money, excited, and said, “Sell me your secret! Show me how you did that! How much do you want? Name your price!”"}],[{"type":"prose","content":"Peter said, “To hell with your money! And you along with it. Why, that’s unthinkable—trying to buy God’s gift! You’ll never be part of what God is doing by striking bargains and offering bribes. Change your ways—and now! Ask the Master to forgive you for trying to use God to make money. I can see this is an old habit with you; you reek with money-lust.”"}],[{"type":"prose","content":"“Oh!” said Simon, “pray for me! Pray to the Master that nothing like that will ever happen to me!”"}],[{"type":"prose","content":"And with that, the apostles were on their way, continuing to witness and spread the Message of God’s salvation, preaching in every Samaritan town they passed through on their return to Jerusalem."}],[{"type":"header","content":"The Ethiopian Eunuch"},{"type":"prose","content":"Later God’s angel spoke to Philip: “At noon today I want you to walk over to that desolate road that goes from Jerusalem down to Gaza.” He got up and went. He met an Ethiopian eunuch coming down the road. The eunuch had been on a pilgrimage to Jerusalem and was returning to Ethiopia, where he was minister in charge of all the finances of Candace, queen of the Ethiopians. He was riding in a chariot and reading the prophet Isaiah."}],[{"type":"prose","content":"The Spirit told Philip, “Climb into the chariot.” Running up alongside, Philip heard the eunuch reading Isaiah and asked, “Do you understand what you’re reading?”"}],[{"type":"prose","content":"He answered, “How can I without some help?” and invited Philip into the chariot with him. The passage he was reading was this:"},{"type":"poetry","content":"As a sheep led to slaughter,"},{"type":"poetry","content":"He was silent, saying nothing."},{"type":"poetry","content":"But who now can count his kin"}],[{"type":"prose","content":"The eunuch said, “Tell me, who is the prophet talking about: himself or some other?” Philip grabbed his chance. Using this passage as his text, he preached Jesus to him."}],[{"type":"prose","content":"As they continued down the road, they came to a stream of water. The eunuch said, “Here’s water. Why can’t I be baptized?” He ordered the chariot to stop. They both went down to the water, and Philip baptized him on the spot. When they came up out of the water, the Spirit of God suddenly took Philip off, and that was the last the eunuch saw of him. But he didn’t mind. He had what he’d come for and went on down the road as happy as he could be."}],[{"type":"prose","content":"Philip showed up in Azotus and continued north, preaching the Message in all the villages along that route until he arrived at Caesarea."}]]