[{"header":"It Is Hard for the Christians in Jerusalem"},{"num":8,"verse":"Saul thought it was all right that Stephen was killed. On that day people started to work very hard against the church in Jerusalem. All the followers, except the missionaries, were made to leave. They went to parts of the countries of Judea and Samaria. "},{"num":2,"verse":"Good men put Stephen in a grave. There was much sorrow because of him. "},{"num":3,"verse":"During this time Saul was making it very hard for the church. He went into every house of the followers of Jesus and took men and women and put them in prison."},{"header":"Philip Preaches in Samaria"},{"num":4,"verse":"Those who had been made to go to other places preached the Word as they went. "},{"num":5,"verse":"Philip went down to a city in Samaria and preached about Christ. "},{"num":6,"verse":"The people all listened to what Philip said. As they listened, they watched him do powerful works. "},{"num":7,"verse":"There were many people who had demons in their bodies. The demons cried with loud voices when they went out of the people. Many of the people could not move their bodies or arms and legs. They were all healed. "},{"num":8,"verse":"There was much joy in that city."},{"header":"Simon the Witch Doctor"},{"num":9,"verse":"A man by the name of Simon had done witchcraft there. The people of Samaria were surprised at the things he did. He pretended that he was a great man. "},{"num":10,"verse":"All the people watched and listened to him. They said, “This man must be that great power of God.” "},{"num":11,"verse":"They kept running after him. For a long time he fooled them with his witchcraft."},{"num":12,"verse":"Philip told the Good News of the holy nation of God and of Jesus Christ. Both men and women put their trust in Christ and were baptized. "},{"num":13,"verse":"Even Simon believed in Christ and was baptized. He went along with Philip everywhere. He was surprised when he saw the powerful works that were being done."},{"num":14,"verse":"The missionaries in Jerusalem heard that the people of Samaria had received the Word of God. They sent Peter and John to them. "},{"num":15,"verse":"When Peter and John got there, they prayed that the new followers might receive the Holy Spirit. "},{"num":16,"verse":"He had not yet come on any of them. They had only been baptized in the name of the Lord Jesus. "},{"num":17,"verse":"They laid their hands on them and the followers received the Holy Spirit."},{"num":18,"verse":"When Simon saw that the Holy Spirit was given when the missionaries laid their hands on the people, he wanted to give money to the missionaries. "},{"num":19,"verse":"He said, “Let me also have this power. Then I can give the Holy Spirit to anyone I lay my hands on.” "},{"num":20,"verse":"Peter said to him, “May your money be destroyed with you because you thought you could buy the gift of God with money! "},{"num":21,"verse":"You have no part or place in this work. Your heart is not right in God’s sight. "},{"num":22,"verse":"You must be sorry for this sin of yours and turn from it. Pray to the Lord that He will forgive you for having such a thought in your heart. "},{"num":23,"verse":"I see that you are full of jealousy and chained by your sin.” "},{"num":24,"verse":"Simon said, “Pray to the Lord for me that nothing you have said will come to me.”"},{"num":25,"verse":"Peter and John went back to Jerusalem after telling what they had seen and heard. They had preached the Word of the Lord also. On the way they preached the Good News in many other towns in the country of Samaria."},{"header":"Philip and the Man from Ethiopia"},{"num":26,"verse":"An angel of the Lord spoke to Philip saying, “Get up and go south. Take the road that goes down from Jerusalem to the country of Gaza. It goes through the desert.” "},{"num":27,"verse":"Philip got up and went. A man from the country of Ethiopia had come to Jerusalem to worship. He had been made so he could not have children. He cared for all the riches that belonged to Candace who was Queen of Ethiopia. "},{"num":28,"verse":"As he was going back home, he was sitting in his wagon reading about the early preacher Isaiah. "},{"num":29,"verse":"The Holy Spirit said to Philip, “Go over to that wagon and get on it.” "},{"num":30,"verse":"Philip ran up to him. He saw that the man from Ethiopia was reading from the writings of the early preacher Isaiah and said, “Do you understand what you are reading?” "},{"num":31,"verse":"The man from Ethiopia said, “How can I, unless someone teaches me?” Then he asked Philip to come up and sit beside him."},{"num":32,"verse":"He was reading the part in the Holy Writings which says He was taken like a lamb to be put to death. A sheep does not make a sound while its wool is cut. So He made no sound. "},{"num":33,"verse":"No one listened to Him because of His shame. Who will tell the story of His day? For His life was taken away from the earth. "},{"num":34,"verse":"The man from Ethiopia said to Philip, “Who is the early preacher talking about, himself, or someone else?” "},{"num":35,"verse":"So Philip started with this part of the Holy Writings and preached the Good News of Jesus to him."},{"num":36,"verse":"As they went on their way, they came to some water. The man from Ethiopia said, “See! Here is water. What is to stop me from being baptized?” "},{"num":37,"verse":"(*Philip said, “If you believe with all your heart, you may.” The man said, “I believe that Jesus Christ is the Son of God.”) "},{"num":38,"verse":"He stopped the wagon. Then both Philip and the man from Ethiopia went down into the water and Philip baptized him."},{"num":39,"verse":"When they came up out of the water, the Holy Spirit took Philip away. The man from Ethiopia did not see Philip again. He went on his way full of joy. "},{"num":40,"verse":"Philip found himself at the city of Azotus. Then Philip went through all the towns as far as the city of Caesarea preaching the Good News at each place."}]