[{"num":8,"verse":"And Rav Sha’ul was giving approval to the murder of Stefanos. And there came about in that day a great pogrom keneged (against) the Brit Chadasha Kehillah in Yerushalayim, and everyone was scattered throughout the regions of Yehudah and Shomron except the Moshiach’s Shlichim."},{"num":2,"verse":"And chasidim came and gave kevurah (burial) to Stefanos and they made loud lamentation over him."},{"num":3,"verse":"But Rav Sha’ul was making havoc of the Moshiach’s Kehillah, barging in bais by bais, dragging off both anashim and nashim, and delivering them over to the beis hasohar."},{"num":4,"verse":"The ones therefore having been scattered went about preaching the dvar Hashem."},{"num":5,"verse":"Now Philippos [Ac 6:5], having gone down to the city of Shomron, was preaching to them the Rebbe, Melech HaMoshiach."},{"num":6,"verse":"And the multitudes with one accord were paying attention to the things being said by Philippos, as they heard him and saw the otot which he was accomplishing."},{"num":7,"verse":"For many had ruchot teme’ot coming out, crying out with a kol gadol, and many having been paralyzed and many pisechim (lame ones) were given refu’ah shleimah."},{"num":8,"verse":"And there was great simchah in that city."},{"num":9,"verse":"Now a certain ish by name Shimon was previously in the city practicing magic and astonishing the people of Shomron, saying that he himself was an ish of gadlus (with remarkable superiority) and gadol."},{"num":10,"verse":"And to this certain Shimon everyone from katon to gadol was paying attention, saying, \"Hinei! This man is the ko’ach (power) of Hashem, the ko’ach hagadol.\""},{"num":11,"verse":"And they were giving heed to him, because he for a long time had astonished them by magic tricks."},{"num":12,"verse":"But when they had emunah (faith) in what Philippos preached about the Malchut Hashem and the Shem of Rebbe, Melech HaMoshiach Yehoshua, they, both anashim and nashim, were submitting to Moshiach’s tevilah of teshuva."},{"num":13,"verse":"And Shimon himself also had emunah, and, having submitted to Moshiach’s tevilah of teshuva, was following Philippos, and, seeing otot and nifla’ot and moftim hagedolim taking place, he was constantly mishpoyel (standing in awe)."},{"num":14,"verse":"And when Moshiach’s Shlichim heard in Yerushalayim that Shomron has accepted the dvar Hashem, they sent Kefa and Yochanan to them,"},{"num":15,"verse":"Who, having come down, davened for them that they might receive the Ruach Hakodesh."},{"num":16,"verse":"For the Ruach Hakodesh had not yet fallen upon any one of them, but only they had received a tevilah of teshuva in a mikveh mayim b’Shem Rebbe, Melech HaMoshiach Yehoshua Adoneinu."},{"num":17,"verse":"Then Kefa and Yochanan were laying their hands upon them, and they were receiving the Ruach Hakodesh."},{"num":18,"verse":"And when Shimon saw that through the laying on of hands of Moshiach’s Shlichim that the Ruach Hakodesh is given, he brought to them kesef,"},{"num":19,"verse":"Saying, \"Give me also this samchut that on whomever I may lay my hands such may receive the Ruach Hakodesh.\""},{"num":20,"verse":"But Kefa said to him, \"May your kesef perish with you because the matnat Hashem you thought by kesef to acquire. [2Kg 5:16; Dt 5:17]"},{"num":21,"verse":"\"There is not to you a chelek (allotted portion) nor share in this matter, for your lev (heart) is krum (deviant) and not upright before Hashem. [Neh 2:20; Ps 78:37]"},{"num":22,"verse":"\"Therefore make teshuva from your wickedness and daven (pray) to Hashem if efsher (perhaps) you will receive selicha (forgiveness) for the intent of your lev,"},{"num":23,"verse":"\"For I see you are in bitter gall and the bond of haresha.\" [Dt 29:18 TARGUM HASHIVIM; Jer 4:18; Isa 58:6]"},{"num":24,"verse":"And in reply Shimon said, \"Daven for me to Hashem that nothing may come upon me of which you have spoken.\" [SHEMOT 8:8; BAMIDBAR 21:7; MELACHIM ALEF 13:6; YIRMEYAH 42:2]"},{"num":25,"verse":"The ones then having testified and spoken the dvar Adonoi were returning to Yerushalayim and to many villages of the Shomronim preaching the Besuras HaGeulah."},{"num":26,"verse":"And a malach Adonoi spoke to Philippos, saying, \"Get up and go south on the derech going down from Yerushalayim to Gaza.\" This is desert."},{"num":27,"verse":"And having got up, Philippos went. And, hinei, an Ethiopian man, a eunuch, a court official of the Kandake of the Ethiopians! He was over all of her Otzrot (treasury) and had come worshipping to Yerushalayim, [Ps 68:31; 87:4; Zeph 3:10; Isa 56:3-5; 1Kgs 8:41-43]"},{"num":28,"verse":"And he was returning and sitting in his chariot and he was reading Yeshayah HaNavi."},{"num":29,"verse":"And the Ruach Hakodesh said to Philippos, \"Approach and join this chariot.\""},{"num":30,"verse":"And having run, Philippos heard him reading Yeshayah HaNavi, and Philippos said, \"So do you have binah of what you are reading?\""},{"num":31,"verse":"And he said, \"How then might I be able, unless someone will guide me?\" And he invited Philippos to come up and sit with him."},{"num":32,"verse":"Now the keta (section) of the Tanakh which he was reading was this: KASEH LATEVACH YUVAL (\"He [Moshiach] was led as a lamb to the slaughter\") and as a Seh (Lamb, YESHAYAH 53:7) before the one having sheared it is silent, LO YIFTACH PIV (\"He does not open his mouth\")."},{"num":33,"verse":"‘In humiliation his justice was taken away. The descendants of him who will tell? Because he is taken away from HA’ARETZ CHAYYIM.' [Isa 53:7,8; 57:7f TARGUM HASHIVIM]"},{"num":34,"verse":"And in reply the eunuch said to Philippos, \"I ask you about whom the Navi (prophet) says this? About himself or about some other person?\""},{"num":35,"verse":"And having opened his mouth, and beginning from this keta (section) of the Kitvei Hakodesh, Philippos began to preach and fier ois (elucidate) Yehoshua/Yeshua to him."},{"num":36,"verse":"And as they were going along the derech, they came upon some mayim and the eunuch says, \"Hinei, mayim! What prevents me from being given Moshiach’s tevilah of teshuva in the mikveh mayim?\""},{"num":37,"verse":"[And Philippos said, “If you have emunah b’chol levavcha, it is mutar. And he answered, saying, Ani ma’amin ki Rebbe Melech HaMoshiach Yehoshua Ben HaElohim hu.]"},{"num":38,"verse":"And he commanded the chariot to stop and both went down into the mikveh mayim, both Philippos and the eunuch, and Philippos gave him Moshiach’s tevilah of teshuva in the mikveh mayim."},{"num":39,"verse":"And when they came up from the mikveh mayim, the Ruach Hakodesh of Hashem took Philippos away, and the eunuch did not see him any longer, but was going on his way with lev same’ach. [1Kgs 18:12; 2Kgs 2:16; Ezek 3:12,14; 8:3; 11:1,24; 43:5]"},{"num":40,"verse":"But Philippos was found in Ashdod, and passing through, he was preaching the Besuras HaGeulah to all the towns until he came to"}]