[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every one that lappeth of the water with his tongue.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Josephus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antt. v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 6, § 4) says that Gideon led them down to the spring in the fiercest heat of the noonday, and that he judged those to be the bravest who flung themselves down and drank, and those to be the cowards who lapped the water hastily and tumultuously. Theodoret also thinks that the Divine aid was shown by the fact that the greatest cowards were chosen. This may have been a Jewish legend (Hagadah); but it seems more reasonable to suppose that greater self-control would be shown by stooping and drinking the water out of the hand than by flinging themselves at full length to drink, which would be the natural instinct of a thirsty man. Rashi says that those who went down on their knees to drink were secret ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "idolators, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "who had “bowed the knee to Baal” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 19:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As a dog lappeth.—Some commentators fancy that this is an allusion to Egyptian dogs, who, out of fear for the Nile crocodiles, only venture to lap the water while they are running along the banks.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As a dog lappeth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Some commentators fancy that this is an allusion to Egyptian dogs, who, out of fear for the Nile crocodiles, only venture to lap the water while they are running along the banks.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:1-8. God provides that the praise of victory may be wholly to himself, by appointing only three hundred men to be employed. Activity and prudence go with dependence upon God for help in our lawful undertakings. When the Lord sees that men would overlook him, and through unbelief, would shrink from perilous services, or that through pride they would vaunt themselves against him, he will set them aside, and do his work by other instruments. Pretences will be found by many, for deserting the cause and escaping the cross. But though a religious society may thus be made fewer in numbers, yet it will gain as to purity, and may expect an increased blessing from the Lord. God chooses to employ such as are not only well affected, but zealously affected in a good thing. They grudged not at the liberty of the others who were dismissed. In doing the duties required by God, we must not regard the forwardness or backwardness of others, nor what they do, but what God looks for at our hands. He is a rare person who can endure that others should excel him in gifts or blessings, or in liberty; so that we may say, it is by the special grace of God that we regard what God says to us, and not look to men what they do.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Try - The word used for refining metals by separating the dross from the pure ore. They who threw themselves on the ground and drank freely were the more self-indulgent; while they who, remembering the near presence of the enemy, slaked their thirst with moderation, and without being off their guard for an instant, were the true soldiers of the army of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. bring them down unto the water—When the wandering people in Asia, on a journey or in haste, come to water, they do not stoop down with deliberation on their knees, but only bend forward as much as is necessary to bring their hand in contact with the stream, and throw it up with rapidity, and at the same time such address, that they do not drop a particle. The Israelites, it seems, were acquainted with the practice; and those who adopted it on this occasion were selected as fit for a work that required expedition. The rest were dismissed according to the divine direction.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is true, there may be natural reasons given why some did only lap of the water, when others bowed down to drink; from the temperance, or fortitude, or patience, or strength, or diligence of the one, and the intemperance, or cowardice, or impatience, or weakness, or slothfulness of the other; but these seem to be mere conjectures: the true reason and design of this course seems to be only this, that God would reduce them to a very small number, which was likely to be done by this means; for the season of the year being hot, and the generality of the soldiers weary, and thirsty, and faint, they would most probably bow down upon their knees, that they might more fully refresh themselves by a liberal draught, as indeed they did; and it could be expected that there would be but few, who either could or would deny themselves in this matter, especially when God concurred in the work, and so disposed of the minds and bodies of them, that all, except three hundred, should lie down to drink. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So he brought them down to the water,.... His whole army of 10,000 men: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord said unto Gideon, everyone that lappeth of the water with his tongue, as a dog lappeth, him shall thou set by himself; this has led some, as particularly Grotius, to think of the Egyptian dogs; of whom Aelianus relates (b), that they do not drink at once freely, and to satiety, being afraid of the crocodiles in the river; but run about the bank, and by stealth snatch a little here and a little there, and so satisfy themselves: but the allusion here is to dogs in common, whose usual way it is not to sup in, and drink a drought, but by putting out their tongues to lick and lap water with them, as Aristotle (c) says all creatures do that have teeth like saws; and the likeness between the drinking of these men, to be observed lay not in anything else but in the single action of lapping; for they first took the water in the hollow of their hands, out of the stream, and then lapped it, as in Judges 7:6 whereas a dog does not and cannot take water that way; and this lapping was standing upright, whereas dogs in common, as Aelianus in the same place suggests, bow themselves, and lap as much water as will satisfy their thirst; and by this these men were distinguished from those that bowed on their knees to drink; for had they not taken up water in their hands, they must have bowed down on their knees to have lapped, as well as those did, to sup it, or take in a large draught of it; now all those that thus lapped were to be set apart by themselves; but whether they were to go with Gideon or not, as yet he knew not: likewise everyone that boweth down on his knee to drink; were to be set by themselves also, but which of those were to go with him is after related. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord said unto Gideon, everyone that lappeth of the water with his tongue, as a dog lappeth, him shall thou set by himself; this has led some, as particularly Grotius, to think of the Egyptian dogs; of whom Aelianus relates (b), that they do not drink at once freely, and to satiety, being afraid of the crocodiles in the river; but run about the bank, and by stealth snatch a little here and a little there, and so satisfy themselves: but the allusion here is to dogs in common, whose usual way it is not to sup in, and drink a drought, but by putting out their tongues to lick and lap water with them, as Aristotle (c) says all creatures do that have teeth like saws; and the likeness between the drinking of these men, to be observed lay not in anything else but in the single action of lapping; for they first took the water in the hollow of their hands, out of the stream, and then lapped it, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whereas a dog does not and cannot take water that way; and this lapping was standing upright, whereas dogs in common, as Aelianus in the same place suggests, bow themselves, and lap as much water as will satisfy their thirst; and by this these men were distinguished from those that bowed on their knees to drink; for had they not taken up water in their hands, they must have bowed down on their knees to have lapped, as well as those did, to sup it, or take in a large draught of it; now all those that thus lapped were to be set apart by themselves; but whether they were to go with Gideon or not, as yet he knew not: likewise everyone that boweth down on his knee to drink; were to be set by themselves also, but which of those were to go with him is after related. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Var. Hist. l. 1. c. 4. (c) Hist. Animal. l. 8. c. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) Var. Hist. l. 1. c. 4. (c) Hist. Animal. l. 8. c. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So he brought down the people unto the water: and the LORD said unto Gideon, Every one that lappeth of the water with his tongue, as a dog lappeth, him shalt thou set by himself; {c} likewise every one that boweth down upon his knees to drink.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So he brought down the people unto the water: and the LORD said unto Gideon, Every one that lappeth of the water with his tongue, as a dog lappeth, him shalt thou set by himself; ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " likewise every one that boweth down upon his knees to drink.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Let them depart as unfit for this enterprise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At the end of the verse LXX. cod. A and Luc. adds ‘him shalt thou set by himself,’ completing the parallel with the foregoing sentence. The words have probably fallen out by accident.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 5, 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz., of the well or spring of Harod. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That lappeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. It showed a much more soldierly and self-controlled spirit just to quench the thirst by lapping the water out of the palm of the hand, than to kneel down and drink without stint out of the spring itself. The Lord saw the difference of character indicated by the two actions, and chose his instruments accordingly. Judges 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Gideon was to divide the people by putting all those who should lick the water with their tongue as a dog licketh into one class, and all those who knelt down to drink into another, and so separating the latter from the former. The number of those who licked the water into their mouth with their hand amounted to 300, and all the rest knelt down to drink. \"To lick with their hand to their mouth,\" i.e., to take the water from the brook with the hollow of their hand, and lap it into the mouth with their tongue as a dog does, is only a more distinct expression for \"licking with the tongue.\" The 300 men who quenched their thirst in this manner were certainly not the cowardly or indolent who did not kneel down to drink in the ordinary way, either from indolence or fear, as Josephus, Theodoret, and others supposed, but rather the bravest-namely those who, when they reached a brook before the battle, did not allow themselves time to kneel down and satisfy their thirst in the most convenient manner, but simply took up some water with their hands as they stood in their military accoutrements, to strengthen themselves for the battle, and then proceeded without delay against the foe. By such a sign as this, Bertheau supposes that even an ordinary general might have been able to recognise the bravest of his army. No doubt: but if this account had not been handed down, it is certain that it would never have occurred to an ordinary or even a distinguished general to adopt such a method of putting the bravery of his troops to the test; and even Gideon, the hero of God, would never have thought of diminishing still further through such a trial an army which had already become so small, or of attempting to defeat an army of more than 100,000 men by a few hundred of the bravest men, if the Lord himself had not commanded it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whilst the Lord was willing to strengthen the feeble faith of Gideon by the sign with the fleece of wool, and thus to raise him up to full confidence in the divine omnipotence, He also required of him, when thus strengthened, an attestation of his faith, by the purification of his army that he might give the whole glory to Him, and accept the victory over that great multitude from His hand alone.",
        "children": []
      }
    ]
  }
]