[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the Lord spake unto Moses and Aaron.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "We read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that the Israelites “provoked (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "made to rebel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") his spirit, so that he spake unadvisedly with his lips.” Whatever was the nature of the sin thus committed, it is clear that Aaron was a participator in it with Moses. Some have thought that the sin of Moses consisted in addressing the people as rebels (or as rebellious ones); but this is the charge repeatedly brought against them in the book of Deuteronomy (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 31:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), under circumstances in which it is impossible to suppose that Moses committed the same sin. It has also been thought that the sin of Moses and Aaron consisted in arrogating to themselves the honour which was due only to God. “Must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "fetch you water?” but the personal pronoun does not occur in the Hebrew, as it might, and probably would, have occurred, if intended to be emphatic. The more probable explanation appears to be that, notwithstanding the miraculous supply of water which had begun at Rephidim, and which had been subsequently continued, Moses and Aaron distrusted the word and power (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of God, and that they yielded to the impulse of impatience and anger, as betrayed both by the language which they used and by the double smiting of the rock, to which Moses had been commanded only to speak. To what degree Aaron was concerned in these sins can be inferred only from the facts that he, as well as Moses, was charged with the sin of unbelief, and that the punishment of exclusion from the land of Canaan was inflicted upon both.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(12) Therefore ye shall not bring this congregation . . . —In Numbers 14:30 Caleb and Joshua are mentioned as the only exceptions to the general sentence of exclusion pronounced against the generation which had come out of Egypt, and which consisted of those who were above twenty years of age. It does not appear, however, from that passage whether the sentence pronounced against Moses and Aaron had, or had not, been delivered at that time, inasmuch as they were the speakers on that occasion, and they belonged to the tribe of Levi, which was not included in the numbering to which reference is made in Numbers 20:29.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(12) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Therefore ye shall not bring this congregation . . . —",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Caleb and Joshua are mentioned as the only exceptions to the general sentence of exclusion pronounced against the generation which had come out of Egypt, and which consisted of those who were above twenty years of age. It does not appear, however, from that passage whether the sentence pronounced against Moses and Aaron had, or had not, been delivered at that time, inasmuch as they were the speakers on that occasion, and they belonged to the tribe of Levi, which was not included in the numbering to which reference is made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 20:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye believed me not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But showed your infidelity; which they did, either by smiting the rock, and that twice, which is emphatically noted, as if they doubted whether once smiting would have done it; whereas, they were not commanded to smite so much as once, but only to speak to it: or, by the doubtfulness of these words, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Must we fetch water out of the rock? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which implied a suspicion of it; whereas they should have spoken positively and confidently to the rock to give forth water. And yet they did not doubt of the power of God, but of his will, whether he would gratify these rebels with this further miracle, after so many of the like kind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To sanctify me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To give me the glory of my power in doing this miracle, and of my truth in punctually fulfilling my promise, and of my goodness in doing it, notwithstanding the people’s perverseness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the eyes of Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This made their sin a cause of stumbling to the Israelites, who of themselves were too prone to infidelity; and, to prevent the contagion, God leaves a monument of his displeasure upon them, and inflicts a punishment as public as their sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:1-13 After thirty-eight years' tedious abode in the wilderness, the armies of Israel advanced towards Canaan again. There was no water for the congregation. We live in a wanting world, and wherever we are, must expect to meet with something to put us out. It is a great mercy to have plenty of water, a mercy which, if we found the want of, we should more own the worth of. Hereupon they murmured against Moses and Aaron. They spake the same absurd and brutish language their fathers had done. It made their crime the worse, that they had smarted so long for the discontent and distrusts of their fathers, yet they venture in the same steps. Moses must again, in God's name, command water out of a rock for them; God is as able as ever to supply his people with what is needful for them. But Moses and Aaron acted wrong. They took much of the glory of this work of wonder to themselves; Must we fetch water? As if it were done by some power or worthiness of their own. They were to speak to the rock, but they smote it. Therefore it is charged upon them, that they did not sanctify God, that is, they did not give to him alone that glory of this miracle which was due unto his name. And being provoked by the people, Moses spake unadvisedly with his lips. The same pride of man would still usurp the office of the appointed Mediator; and become to ourselves wisdom, righteousness, and sanctification, and redemption. Such a state of sinful independence, such a rebellion of the soul against its Saviour, the voice of God condemns in every page of the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The command ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was \"Speak ye unto the rock.\" The act of smiting, and especially with two strokes, indicates violent irritation on the part of Moses; as does also his unseemly mode of addressing the people: \"Hear now, ye rebels.\" The form too of the question, \"must we, etc.,\" directs the people not, as ought to have been the case, to God as their deliverer, but to Moses and Aaron personally. In fact the faithful servant of God, worn out by the reiterated perversities of the people, breaks down; and in the actual discharge of his duty as God's representative before Israel, acts unworthily of the great function entrusted to him. Thus, Moses did not \"sanctify God in the eyes of the children of Israel.\" Aaron might have checked the intemperate words and acts of Moses, and did not. Hence, God punishes both by withdrawing them from their work for Him, and handing over its accomplishment to another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. The Lord spake unto Moses and Aaron, Because ye believed me not, &c.—The act of Moses in smiting twice betrayed a doubt, not of the power, but of the will of God to gratify such a rebellious people, and his exclamation seems to have emanated from a spirit of incredulity akin to Sarai's (Ge 18:13). These circumstances indicate the influence of unbelief, and there might have been others unrecorded which led to so severe a chastisement.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye believed me not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but showed your infidelity; which they did either by their looks and gestures, or rather by the matter and manner of their expressions and actions; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. By smiting the rock, and that twice, which is emphatically noted, as if he doubted whether once smiting would have done it, whereas he was not commanded to smite so much as once, but only to speak to it; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. By the doubtfulness of these words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 20:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Must we fetch water out of the rock?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which implies a suspicion of it, as the like words do, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 18:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whereas they should have spoken positively and confidently to the rock to give forth waters. And yet they did not doubt of the power of God, but of his will, whether he would gratify these rebels with this further miracle, after so many of the like kind. And besides the words themselves, it is considerable, both with what mind they were spoken, which God saw to be distrustful, and in what manner they were delivered, which the people might discern to come from misbelief or doubt. And there might be divers other unbelieving words used by them at this time and place, though they be not here recorded, it being usual in Scripture to give only the sum or principal heads of discourses or events, leaving the rest to be gathered out of them. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 106:32,33",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To sanctify me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. to give me glory of my power in doing this miracle, and of my truth in punctually fulfilling my promise so to do, and of my goodness in doing it notwithstanding the people’s perverseness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the eyes of the children of Israel:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this made their sin scandalous to the Israelites, who of themselves were too prone to infidelity, and little needed such an ill example; to prevent the contagion whereof God leaves a monument of his great displeasure upon them, and inflicts a punishment as public and manifest as their sin was. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord spake unto Moses and Aaron,.... Out of the cloud, where his glory appeared, and still continued: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because ye believed me not, to sanctify me in the eyes of the children of Israel; that Moses and Aaron committed an evil which was displeasing to the Lord is certain, but what that was is variously represented. Some say their sin was, that the order was to speak to the rock, whereas it was smitten, and not spoken to; but why then was Moses bid to take the rod with him, if it was not to smite with it, as he had done before at Horeb? and besides, this would only have been the sin of Moses, and not of Aaron; others think, that what provoked the Lord was, that the Israelites were called \"rebels\"; but this is a name the Lord himself gave them, Numbers 17:10, and was what they justly deserved; and what after this Moses says of them, which, had this been the case, he would have been careful to have abstained from, Deuteronomy 9:24. Others are of opinion, that what was displeasing to the Lord was, that the bringing the water out of the rock was ascribed to themselves, and not to him; \"must we fetch you water\", &c. Others suppose the sin was in smiting the rock twice, and in anger; but this could only be the fault of Moses at most. Dr. Lightfoot (b) thinks the particular fault was this, that Moses expressed his displeasure and resentment to the Israelites, that on their murmuring a new rock was opening, which portended a new and long stay in the wilderness, as the opening of the first rock at Horeb did when he and Aaron were in expectation of being soon out of the wilderness, and now they feared they were beginning anew their abode in it; but it is certain from the text that unbelief was their sin; they were diffident about the will of God to bring water out of the rock for such a rebellious people, and they did not put them in mind of the miracles God had wrought in former time, to encourage their faith; and so the Lord was not sanctified by them before the people, as he ought to have been: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because ye believed me not, to sanctify me in the eyes of the children of Israel; that Moses and Aaron committed an evil which was displeasing to the Lord is certain, but what that was is variously represented. Some say their sin was, that the order was to speak to the rock, whereas it was smitten, and not spoken to; but why then was Moses bid to take the rod with him, if it was not to smite with it, as he had done before at Horeb? and besides, this would only have been the sin of Moses, and not of Aaron; others think, that what provoked the Lord was, that the Israelites were called \"rebels\"; but this is a name the Lord himself gave them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and was what they justly deserved; and what after this Moses says of them, which, had this been the case, he would have been careful to have abstained from, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Others are of opinion, that what was displeasing to the Lord was, that the bringing the water out of the rock was ascribed to themselves, and not to him; \"must we fetch you water\", &c. Others suppose the sin was in smiting the rock twice, and in anger; but this could only be the fault of Moses at most. Dr. Lightfoot (b) thinks the particular fault was this, that Moses expressed his displeasure and resentment to the Israelites, that on their murmuring a new rock was opening, which portended a new and long stay in the wilderness, as the opening of the first rock at Horeb did when he and Aaron were in expectation of being soon out of the wilderness, and now they feared they were beginning anew their abode in it; but it is certain from the text that unbelief was their sin; they were diffident about the will of God to bring water out of the rock for such a rebellious people, and they did not put them in mind of the miracles God had wrought in former time, to encourage their faith; and so the Lord was not sanctified by them before the people, as he ought to have been: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore ye shall not bring this congregation into the land which I have given them; the land of Canaan, a grant of which was made to their fathers, and particularly to this generation, and into which they would certainly be brought; but not by Moses and Aaron, who were excluded because of their unbelief, and accordingly both died before the entrance of the people into the land. This, according to the Targum of Jonathan, and Jarchi, was said with an oath; see Hebrews 3:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "therefore ye shall not bring this congregation into the land which I have given them; the land of Canaan, a grant of which was made to their fathers, and particularly to this generation, and into which they would certainly be brought; but not by Moses and Aaron, who were excluded because of their unbelief, and accordingly both died before the entrance of the people into the land. This, according to the Targum of Jonathan, and Jarchi, was said with an oath; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) See his Works, vol. 1. p. 36. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) See his Works, vol. 1. p. 36. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD spake unto Moses and Aaron, Because ye believed me not, to {f} sanctify me in the eyes of the children of Israel, therefore ye shall not bring this congregation into the land which I have given them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD spake unto Moses and Aaron, Because ye believed me not, to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sanctify me in the eyes of the children of Israel, therefore ye shall not bring this congregation into the land which I have given them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That the children of Israel should believe and acknowledge my power and so honour me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Had Moses and Aaron shewn a true faith they would have been the means of exhibiting God’s holiness before the eyes of the people. By their unbelief they detracted from it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Because ye believed me not, to sanctify me in the eyes of the children of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Israel. It is very important, and at the same time very difficult, to understand what the precise sin of Moses and Aaron was upon this occasion. That it was very serious is manifest from the punishment which is entailed. Aaron, indeed, does not appear in the narrative, save in his usual subordinate position as associated with his brother by the Divine mandate. It has been said that he might have checked the unadvised words of Moses, but that is wholly beside the mark. Aaron had obviously no control whatever over his far more able and energetic brother, and therefore could have no responsibility in that respect. We can only suppose that he inwardly assented to the language and conduct with which he was outwardly associated, and therefore shared the guilt. A less degree of sin was (so to speak) necessary in his cause, because he had on former occasions so greatly dishonoured his office; and the anger of God against the sin of his ministers, although laid to sleep, is ever ready to awake upon the recurrence ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a similar provocation. We may therefore dismiss him, and consider only the case of Moses. It is impossible to suppose that Moses actually doubted the power of God to supply the present need, for he held in his hand the very rod with which he had struck the rock in Rephidim, nor is there anything in his words or acts upon this occasion to imply any such disbelief. The language of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:21, 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be cited on the other side, but that was spoken in passion, and spoken to God, and cannot be held as expressing an actual failure of faith. Nor do subsequent references point to unbelief as having been the sin of Moses (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Rather, they point to disobedience and indiscretion; to such disloyal conduct and language as produced a bad impression upon the people, and did not place the Divine character before them in its true light. We must understand, therefore, that the want of belief with which Moses stood charged was not a want of faith in the power of God, but a want of obedience to the will of God, bearing in mind that the two faults of disbelief and disobedience are but two sides of one inward fact, and are perpetually confounded in the language of Scripture (compare the use of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀπειθεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the New Testament). What then was the disobedience of Moses? Here, again, the more obvious answer is insufficient. It is true that Moses struck the rock twice instead of (or perhaps in addition to) speaking to it; but God had bid him take the rod, and he might naturally think he was meant to use it as before; moreover, the people could not have known anything of the exact terms of the command, and would have thought no more of his striking the rock at Kadesh than at Rephidim; but it was the fact of the bad impression made upon the people which was the ground of the Divine rebuke. We come back, therefore, to the simple conclusion expressed by the Psalmist (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:32, 33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that Moses lost his temper, and in the irritation of the moment spoke and acted in such a way and in such a spirit as to dishonour his Master and to impair the good effect of the Divine beneficence. It is quite likely that the repeated striking of the rock was one sign of the anger to which Moses gave way, but we could hardly have attached any serious character to the act if it had stood alone. It is in the words of Moses, words in which he associated Aaron with himself, that we must find the explanation of the displeasure he incurred. That he called the people \"rebels\" was unseemly, not because it was untrue, or because it was an uncalled-for term of reproach, but because he himself was at that very moment a rebel, and disloyal in heart to his Master (cf. verse 24). That he should say, \"Must we fetch you water out of this rock?\" showed how completely he was carried away. It is true that God had said to him, \"Thou shalt bring forth to them water,\" and, \"Thou shalt give the congregation...  drink\" (compare this with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it is probable that his own words were more or less consciously dictated by this remembrance; but he knew very well that the Divine mandate afforded him no real justification; that he and Aaron were the merest instruments in the hand of God; that it was peculiarly necessary to keep this fact before the minds of the people; nevertheless, his vexation and anger betrayed him into putting himself - a mere man, and a man too in a very bad temper - into the place of God before the eyes of the whole congregation. Moses had fallen at least once before (see on Numbers 11:11-15) into a similar error, one so natural to an angry mind; but this was the first time that he had made his error public, and thereby dishonoured the Master whom it was his special duty to uphold and glorify. This was the sin, and if the punishment seem disproportionate, it must be remembered that the heinousness of a sin depends quite as much on the position of the sinner as upon its intrinsic enormity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye shall not bring this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "congregation into the land.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That they should die in the wilderness was implied in this sentence, but was not strictly a part of the sentence itself. Moses, indeed, although he did not enter the land of promise in its narrower sense, yet he died within the inheritance of Israel. Since they had behaved unworthily of their high office as leaders of the people, therefore that office should be taken from them before the glorious end. Numbers 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord then said to both of them, both Moses and Aaron, \"Because ye have not trusted firmly in Me, to sanctify Me before the eyes of the children of Israel, therefore ye shall not bring this congregation into the land which I have given them.\" The want of belief or firm confidence in the Lord, through which both of them had sinned, was not actual unbelief or distrust in the omnipotence and grace of God, as if God could not relieve the want of water or extend His help to the murmuring people; for the Lord had promised His help to Moses, and Moses did what the Lord had commanded him. It was simply the want of full believing confidence, a momentary wavering of that immovable assurance, which the two heads of the nation ought to have shown to the congregation, but did not show. Moses did even more than God had commanded him. Instead of speaking to the rock with the rod of God in his hand, as God directed him, he spoke to the congregation, and in these inconsiderate words, \"Shall we fetch you water out of the rock?\" words which, if they did not express any doubt in the help of the Lord, were certainly fitted to strengthen the people in their unbelief, and are therefore described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as prating (speaking unadvisedly) with the lips (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He then struck the rock twice with the rod, \"as if it depended upon human exertion, and not upon the power of God alone,\" or as if the promise of God \"would not have been fulfilled without all the smiting on his part\" (Knobel). In the ill-will expressed in these words the weakness of faith was manifested, by which the faithful servant of God, worn out with the numerous temptations, allowed himself to be overcome, so that he stumbled, and did not sanctify the Lord before the eyes of the people, as he ought to have done. Aaron also wavered along with Moses, inasmuch as he did nothing to prevent Moses' fall. But their sin became a grievous one, from the fact that they acted unworthily of their office. God punished them, therefore, by withdrawing their office from them before they had finished the work entrusted to them. They were not to conduct the congregation into the promised land, and therefore were not to enter in themselves (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The rock, from which water issued, is distinguished by the article הסּלע, not as being already known, or mentioned before, but simply as a particular rock in that neighbourhood; though the situation is not described, so as to render it possible to search for it now.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Moses Nachmanides has given a correct interpretation of the words, \"Speak to the rock before their eyes\" (Numbers 20:8): viz., \"to the first rock in front of them, and standing in their sight.\" The fable attributed to the Rabbins, viz., that the rock of Rephidim followed the Israelites all about in the desert, and supplied them with water, cannot be proved from the talmudical and rabbinical passages given by Buxtorf (historia Petrae in deserto) in his exercitatt. c. v., but is simply founded upon a literal interpretation of certain rabbinical statements concerning the identity of the well at Rephidim with that at Kadesh, which were evidently intended to be figurative, as Abarbanel expressly affirms (Buxtorf, l. c. pp. 422ff.). \"Their true meaning,\" he says, \"was, that those waters which flowed out in Horeb were the gift of God granted to the Israelites, and continued all through the desert, just like the manna. For wherever they went, fountains of living waters were opened to them as the occasion required. And for this reason, the rock in Kadesh was the same rock as that in Horeb. Still less ground is there for supposing that the Apostle Paul alluded to any such rabbinical fable when he said, \"They drank of that spiritual rock that followed them\" (1 Corinthians 10:4), and gave it a spiritual interpretation in the words, \"and that rock was Christ.\") ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Moses Nachmanides has given a correct interpretation of the words, \"Speak to the rock before their eyes\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): viz., \"to the first rock in front of them, and standing in their sight.\" The fable attributed to the Rabbins, viz., that the rock of Rephidim followed the Israelites all about in the desert, and supplied them with water, cannot be proved from the talmudical and rabbinical passages given by Buxtorf (historia Petrae in deserto) in his exercitatt. c. v., but is simply founded upon a literal interpretation of certain rabbinical statements concerning the identity of the well at Rephidim with that at Kadesh, which were evidently intended to be figurative, as Abarbanel expressly affirms (Buxtorf, l. c. pp. 422ff.). \"Their true meaning,\" he says, \"was, that those waters which flowed out in Horeb were the gift of God granted to the Israelites, and continued all through the desert, just like the manna. For wherever they went, fountains of living waters were opened to them as the occasion required. And for this reason, the rock in Kadesh was the same rock as that in Horeb. Still less ground is there for supposing that the Apostle Paul alluded to any such rabbinical fable when he said, \"They drank of that spiritual rock that followed them\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and gave it a spiritual interpretation in the words, \"and that rock was Christ.\") ",
            "children": []
          }
        ]
      }
    ]
  }
]