[{"header":"The Yeast of the Pharisees and the Sadducees"},{"num":16,"verse":"The Pharisees and Sadducees approached, and as a test, asked Him to show them a sign from heaven."},{"num":2,"verse":"He answered them: “When evening comes you say, ‘It will be good weather because the sky is red.’ "},{"num":5,"verse":"The disciples reached the other shore, and they had forgotten to take bread."},{"num":6,"verse":"Then Jesus told them, “Watch out and beware of the yeast of the Pharisees and Sadducees.”"},{"num":7,"verse":"And they discussed among themselves, “We didn’t bring any bread.”"},{"num":8,"verse":"Aware of this, Jesus said, “You of little faith! Why are you discussing among yourselves that you do not have bread? "},{"num":12,"verse":"Then they understood that He did not tell them to beware of the yeast in bread, but of the teaching of the Pharisees and Sadducees."},{"header":"Peter’s Confession of the Messiah"},{"num":13,"verse":"When Jesus came to the region of Caesarea Philippi, He asked His disciples, “Who do people say that the Son of Man is?”"},{"num":14,"verse":"And they said, “Some say John the Baptist; others, Elijah; still others, Jeremiah or one of the prophets.”"},{"num":16,"verse":"Simon Peter answered, “You are the Messiah, the Son of the living God!”"},{"num":17,"verse":"And Jesus responded, “Simon son of Jonah, you are blessed because flesh and blood did not reveal this to you, but My Father in heaven. "},{"num":20,"verse":"And He gave the disciples orders to tell no one that He was the Messiah."},{"header":"His Death and Resurrection Predicted"},{"num":21,"verse":"From then on Jesus began to point out to His disciples that He must go to Jerusalem and suffer many things from the elders, chief priests, and scribes, be killed, and be raised the third day. "},{"num":22,"verse":"Then Peter took Him aside and began to rebuke Him, “Oh no, Lord! This will never happen to You!”"},{"num":23,"verse":"But He turned and told Peter, “Get behind Me, Satan! You are an offense to Me because you’re not thinking about God’s concerns, but man’s.”"},{"header":"Take Up Your Cross"},{"num":24,"verse":"Then Jesus said to His disciples, “If anyone wants to come with Me, he must deny himself, take up his cross, and follow Me. "}]