[{"header":"The Demand for a Sign from Heaven"},{"num":16,"verse":"One day some of the Pharisees and those of the Jewish sect known as the Sadducees approached Jesus, insisting that he prove to them that he was the Messiah. “Show us a supernatural sign from heaven,” they demanded."},{"num":2,"verse":"Jesus answered, “You can read the signs of the weather, for you say, ‘Red sky at night, sailors delight.’ "},{"num":3,"verse":"And, ‘Red sky in the morning, sailors take warning.’ You’re so adept at forecasting the weather by looking at the sky, but you’re absolutely clueless in reading the obvious signs of the times. "},{"num":4,"verse":"A wicked and wayward generation always asks for signs, but the only sign I provide for you will be the sign of Jonah the prophet.” Then he turned away and left them."},{"header":"The Hypocrisy of the Pharisees and Sadducees"},{"num":5,"verse":"Later, as Jesus and his disciples crossed over to the other side of Lake Galilee, the disciples realized they had forgotten to bring any loaves of bread. "},{"num":6,"verse":"Jesus spoke up and said, “Watch out for the yeast of the Pharisees and the Sadducees.”"},{"num":7,"verse":"Thinking Jesus was scolding them over not bringing bread, they began to discuss it among themselves. "},{"num":8,"verse":"Knowing their thoughts, Jesus said to them, “You have such little faith! Why are you arguing with one another about having no bread? "},{"num":9,"verse":"Are you so slow to understand? Have you forgotten the miracle of feeding the five thousand families and how each of you ended up with a basket full of fragments? "},{"num":10,"verse":"And how seven loaves of bread fed four thousand families with baskets left over? "},{"num":11,"verse":"Don’t you understand? I’m not talking about bread, but I’m warning you to avoid the yeast of the Pharisees and the Sadducees.”"},{"num":12,"verse":"Then finally they realized he wasn’t talking about yeast found in bread, but the error of the teachings of the Pharisees and the Sadducees."},{"header":"Peter’s Revelation of Christ"},{"num":13,"verse":"When Jesus came to Caesarea Philippi, he asked his disciples this question: “What are the people saying about me, the Son of Man? Who do they believe I am?”"},{"num":14,"verse":"They answered, “Some are convinced you are John the Baptizer, others say you are Elijah reincarnated, or Jeremiah, or one of the prophets.”"},{"num":15,"verse":"“But you—who do you say that I am?” Jesus asked."},{"num":16,"verse":"Simon Peter spoke up and said, “You are the Anointed One, the Son of the living God!”"},{"num":17,"verse":"Jesus replied, “You are favored and privileged Simeon, son of Jonah! For you didn’t discover this on your own, but my Father in heaven has supernaturally revealed it to you. "},{"num":18,"verse":"I give you the name Peter, a stone. And this rock will be the bedrock foundation on which I will build my church—my legislative assembly, and the power of death will not be able to overpower it! "},{"num":19,"verse":"I will give you the keys of heaven’s kingdom realm to forbid on earth that which is forbidden in heaven, and to release on earth that which is released in heaven.” "},{"num":20,"verse":"He then gave his disciples strict orders not to tell anyone that he was the Messiah."},{"header":"Jesus Prophesies His Death and Resurrection"},{"num":21,"verse":"From then on Jesus began to clearly reveal to his disciples that he was destined to go to Jerusalem and suffer injustice from the elders, leading priests, and religious scholars. He also explained that he would be killed and three days later be raised to life again."},{"num":22,"verse":"Peter took him aside to correct him privately. He reprimanded Jesus over and over, saying to him, “God forbid, Master! Spare yourself. You must never let this happen to you!”"},{"num":23,"verse":"Jesus turned to Peter and said, “Get out of my way, you Satan! You are a hindrance to me, because your thoughts are only filled with man’s viewpoints and not with the ways of God.”"},{"num":24,"verse":"Then Jesus said to his disciples, “If you truly want to follow me, you should at once completely reject and disown your own life. And you must be willing to share my cross and experience it as your own, as you continually surrender to my ways. "},{"num":25,"verse":"For if you choose self-sacrifice and lose your lives for my glory, you will continually discover true life. But if you choose to keep your lives for yourselves, you will forfeit what you try to keep. "},{"num":26,"verse":"For even if you were to gain all the wealth and power of this world—at the cost of your own life—what good would that be? And what could be more valuable to you than your own soul? "},{"num":27,"verse":"I, the Son of Man, will one day return with my messengers and in the splendor and majesty of my Father. And then I will reward each person according to what they have done. "},{"num":28,"verse":"But I promise you, there are some standing here now who won’t experience death until they have witnessed the coming of the Son of Man in the presence and the power of the kingdom realm of God!”"}]