[[],[{"type":"header","content":"Paul’s Use of Liberty"},{"type":"prose","content":"Am I not free [unrestrained and exempt from any obligation]? Am I not an apostle? Have I not seen Jesus our [risen] Lord [in person]? Are you not [the result and proof of] my work in the Lord? "}],[{"type":"prose","content":"If I am not [considered] an apostle to others, at least I am one to you; for you are the seal  the certificate  the living evidence of my apostleship in the Lord [confirming and authenticating it]."}],[{"type":"prose","content":"This is my defense to those who would put me on trial  interrogate me [concerning my authority as an apostle]: "}],[{"type":"prose","content":"Have we not the right to our food and drink [at the expense of the churches]? "}],[{"type":"prose","content":"Have we not the right to take along with us a believing wife, as do the rest of the apostles and the Lord’s brothers and Cephas (Peter)? "}],[{"type":"prose","content":"Or is it only Barnabas and I who have no right to stop doing manual labor [in order to support our ministry]? "}],[{"type":"prose","content":"[Consider this:] Who at any time serves as a soldier at his own expense? Who plants a vineyard and does not eat its fruit? Or who tends a flock and does not use the milk of the flock?"}],[{"type":"prose","content":"Do I say these things only from a man’s perspective? Does the Law not endorse the same principles? "}],[{"type":"prose","content":"For it is written in the Law of Moses, “ [to keep it from eating the grain].” Is it [only] for oxen that God cares? "}],[{"type":"prose","content":"Or does He speak entirely for our sake? Yes, it was written for our sake: The plowman ought to plow in hope, and the thresher to thresh in hope of sharing the harvest. "}],[{"type":"prose","content":"If we have sown [the good seed of] spiritual things in you, is it too much if we reap material things from you? "}],[{"type":"prose","content":"If others share in this rightful claim over you, do not we even more? However, we did not exercise this right, but we put up with everything so that we will not hinder [the spread of] the good news of Christ. "}],[{"type":"prose","content":"Do you not know that those who officiate in the sacred services of the temple eat from the temple [offerings of meat and bread] and those who regularly attend the altar have their share from the [offerings brought to the] altar? "}],[{"type":"prose","content":"So also [on the same principle] the Lord directed those who preach the gospel to get their living from the gospel."}],[{"type":"prose","content":"But I have used none of these privileges, nor am I writing this [to suggest] that any such provision be made for me now. For it would be better for me to die than to have anyone deprive me of my boast [in this matter of financial support]. "}],[{"type":"prose","content":"For if I [merely] preach the gospel, I have nothing to boast about, for I am compelled [that is, absolutely obligated to do it]. Woe to me if I do not preach the good news [of salvation]! "}],[{"type":"prose","content":"For if I do this work of my own free will, then I have a reward; but if it is not of my will [but by God’s choosing], I have been entrusted with a [sacred] stewardship. "}],[{"type":"prose","content":"What then is my reward? [Just this:] that, when I preach the gospel, I may offer the gospel without charge [to everyone], so as not to take advantage of my rights [as a preacher and apostle] in [preaching] the gospel."}],[{"type":"prose","content":"For though I am free from all men, I have made myself a slave to everyone, so that I may win more [for Christ]. "}],[{"type":"prose","content":"To the Jews I became as a Jew, so that I might win Jews [for Christ]; to men under the Law, [I became] as one under the Law, though not being under the Law myself, so that I might win those who are under the Law. "}],[{"type":"prose","content":"To those who are without (outside) the Law, [I became] as one without the Law, though [I am] not without the law of God, but under the law of Christ, so that I might win those who are without law. "}],[{"type":"prose","content":"To the weak I became [as the] weak, to win the weak. I have become all things to all men, so that I may by all means [in any and every way] save some [by leading them to faith in Jesus Christ]. "}],[{"type":"prose","content":"And I do all this for the sake of the gospel, so that I may share in its blessings along with you."}],[{"type":"prose","content":"Do you not know that in a race all the runners run [their very best to win], but only one receives the prize? Run [your race] in such a way that you may seize the prize  make it yours! "}],[{"type":"prose","content":"Now every athlete who [goes into training and] competes in the games is disciplined  exercises self-control in all things. They do it to win a crown that withers, but we [do it to receive] an imperishable [crown that cannot wither]. "}],[{"type":"prose","content":"Therefore I do not run without a definite goal; I do not flail around like one beating the air [just shadow boxing]. "}],[{"type":"prose","content":"But [like a boxer] I strictly discipline my body and make it my slave, so that, after I have preached [the gospel] to others, I myself will not somehow be disqualified [as unfit for service]."}]]