[{"num":9,"verse":"Am I not an apostle? Am I not free? Have I not seen Jesus Christ our Lord? Are you not my work in the Lord? "},{"num":2,"verse":"If I am not an apostle to others, yet I am to you. For you in the Lord are the seal of my apostleship."},{"num":3,"verse":"My answer to those who ask me is this: "},{"num":4,"verse":"Do we not have the right to eat and to drink? "},{"num":5,"verse":"Or do we not have the right to have with us a sister as wife, as well as the other apostles, and the brethren of the Lord, and Cephas? "},{"num":6,"verse":"Or do only Barnabas and I not have the right to do this?"},{"num":7,"verse":"Who plants a vineyard, and eats not of the fruit? Who feeds a flock, and drinks not of the milk? "},{"num":8,"verse":"Do I say these things after the manner of men, or does the law not say the same also? "},{"num":9,"verse":"For it is written in the law of Moses: You shall not muzzle the mouth of the ox that treads out the grain. Is God taking thought for oxen, "},{"num":10,"verse":"or does he say it not altogether for our sakes? For our sakes no doubt this is written, because he who ploughs should plough in hope, and because he who threshes in hope should be partaker of his hope. "},{"num":11,"verse":"If we sow spiritual things unto you, is it a great matter if we reap your carnal things? "},{"num":12,"verse":"If others are partakers of this right over you, why not rather we? Nevertheless, we have not exercised this right, but endure all things, lest we hinder the gospel of Christ."},{"num":13,"verse":"Do you not understand that those who minister in the temple have their provision from the temple? And those who wait at the altar are partakers with the altar? "},{"num":14,"verse":"Likewise also did the Lord ordain that those who preach the gospel should live from the gospel. "},{"num":15,"verse":"But I have availed myself of none of these things. Neither have I written these things so that it would be done so for me. For it would be better for me to die than for anyone to take this claim from me."},{"num":16,"verse":"In that I preach the gospel, I have nothing to boast of, for necessity is put upon me; woe it is to me, if I do not preach the gospel! "},{"num":17,"verse":"If I do it with a good will, I have a reward. But if I do it against my will, an office is committed to me. "},{"num":18,"verse":"What is my reward then? Truly, that when I preach the gospel, I make the gospel of Christ free: that I do not misuse my authority in the gospel."},{"num":19,"verse":"For though no man is my master, yet I have made myself a servant to all, so that I might win the more. "},{"num":20,"verse":"To the Jews I became as a Jew, to win the Jews. To those who were under the law, I was as though under the law, to win those who were under the law. "},{"num":21,"verse":"To those who were without law, I became as though I were without law (when I was not without law as pertaining to God, but under a law as concerning Christ), to win those who were without law. "},{"num":22,"verse":"To the weak I became as weak, to win the weak. In all things I fashioned myself to all men, to save at least some. "},{"num":23,"verse":"And this I do for the gospel’s sake, so that I may have my part in it."},{"num":24,"verse":"Do you not perceive that of those who run in a race, all run, yet but one receives the reward? So run that you may prevail. "},{"num":25,"verse":"Athletes who compete discipline themselves in all things. And they do it to obtain a corruptible crown, but we to obtain an incorruptible crown. "},{"num":26,"verse":"I therefore run accordingly: not as at an uncertain thing. I fight accordingly: not as one who beats the air, "},{"num":27,"verse":"but I tame my body, and bring it into subjection, lest after I have preached to others, I myself should be a castaway."}]