[{"header":"Servant Leadership Wins Over All"},{"num":9,"verse":"Am I not free? Am I not an emissary? Have I not seen Yeshua our Lord? Are you not my work in the Lord? "},{"num":2,"verse":"If to others I am not an emissary, at least I am to you—for you are the seal of my office of emissary in the Lord."},{"num":3,"verse":"My defense to those who examine me is this. "},{"num":4,"verse":"Don’t we have the right to food and drink? "},{"num":5,"verse":"Don’t we have the right to take along a believing wife, as do the other emissaries and the Lord’s brothers and Kefa? "},{"num":6,"verse":"Or is it only Barnabas and I who have no right to not work? "},{"num":7,"verse":"What soldier ever serves at his own expense? Who plants a vineyard and does not eat its fruit? Or who tends a flock and does not drink its milk?"},{"num":8,"verse":"I don’t say these things merely as a man, do I? Doesn’t Torah also say these things? "},{"num":9,"verse":"For it is written in the Torah of Moses, “You shall not muzzle an ox while it is threshing.” Is it the oxen that concern God, "},{"num":10,"verse":"or is He speaking entirely for our sake? Yes, it was written for our sake, because the one plowing ought to plow in hope and the one threshing in hope of a share in the crop. "},{"num":11,"verse":"If we sowed spiritual things into you, is it too much if we reap material things from you? "},{"num":12,"verse":"If others have a share in this claim over you, shouldn’t we even more?"},{"num":13,"verse":"Don’t you know that those who perform the holy services eat from the Temple, and those who wait on the altar receive a share at the altar?"},{"num":14,"verse":" So also the Lord ordered those who proclaim the Good News to get their living from the Good News."},{"num":15,"verse":"But I have used none of these things, and I am not writing these things so it will happen this way in my case—for I would rather die than let anyone deprive me of my reason to boast. "},{"num":16,"verse":"For if I proclaim the Good News, I have no reason to boast—for pressure is put on me and woe to me if I don’t proclaim the Good News! "},{"num":17,"verse":"For if I do this of my own will, I have a reward. But if not of my own will, I have been entrusted with a commission. "},{"num":18,"verse":"What then is my reward? That when I preach, I may present the Good News free of charge, not making use of my right in the Good News."},{"num":19,"verse":"For though I am free from all men, I have made myself a slave to all, so that I might win over more of them. "},{"num":20,"verse":"To the Jewish people I identified as a Jew, so that I might win over the Jewish people. To those under Torah I became like one under Torah (though not myself being under Torah), so that I might win over those under Torah; "},{"num":21,"verse":"to those outside Torah, like one outside Torah (though not being outside God’s Torah but in Messiah’s Torah), so that I might win over those outside Torah. "},{"num":22,"verse":"To the weak I became weak, so that I might win over the weak. I have become all things to all men, so that by all means possible I might save some. "},{"num":23,"verse":"I do it all for the sake of the Good News, so that I might be a fellow partaker of it."},{"num":24,"verse":"Don’t you know that in a stadium the runners all run, but one receives the prize? Run in such a way that you may win! "},{"num":25,"verse":"Every competitor exercises self-control in all respects. They do it to receive a perishable crown, but we do it to receive an imperishable one. "},{"num":26,"verse":"So I run in this way—not aimlessly. So I box in this way—not beating the air. "},{"num":27,"verse":"Rather, I punish my body and bring it into submission, so that after I have preached to others, I myself will not be disqualified."}]