[{"num":9,"verse":"Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you people not proof of the work I do for the Lord?"},{"num":2,"verse":"If other people do not call me an apostle, yet surely I am an apostle to you. You people are the proof that I am an apostle for the Lord."},{"num":3,"verse":"Here is what I say to the people who say wrong things about me."},{"num":4,"verse":"Do we not have the right to eat and drink?"},{"num":5,"verse":"Do we not have the right to have a Christian wife with us as do the other apostles, and the brothers of our Lord, and Cephas?"},{"num":6,"verse":"Must Barnabas and I work for our living though the other apostles do not?"},{"num":7,"verse":"What soldier pays for his own food when he goes to war? Who plants a garden and does not eat what grows in it? Who takes care of animals and does not get any of the milk?"},{"num":8,"verse":"Am I saying only what men say? Does not God's law also say the same?"},{"num":9,"verse":"Moses wrote in his books of the law of God, `Do not tie shut the mouth of an ox when it is treading the grain.' Does God care about the oxen?"},{"num":10,"verse":"Does he not say this altogether for our sakes? Yes, he said it for our sakes. There are people who plough the ground and beat the grain. They do this work because they believe they will have a part of the food for themselves."},{"num":11,"verse":"We have planted seed by teaching you the good things of the Spirit. So we should receive something from you to help us to pay for our living."},{"num":12,"verse":"If it is right for other teachers to receive something from you, then we have more of a right to receive it. But we did not use our right. Instead, we do anything we can so that we will not stop the good news of Christ from going out."},{"num":13,"verse":"You know there are men who do the work in the temple. They get their food from the temple. Those who help to make sacrifices in the temple get a part of the sacrifice."},{"num":14,"verse":"It is the same with those who work telling the good news. The Lord said they should get their living from that work."},{"num":15,"verse":"And I am not writing this to ask you to do these things for me. I would rather die! It is something I am proud of, and no one shall take it away from me."},{"num":16,"verse":"My telling the good news is not something for me to be proud of. It is something I must do. Yes, it would be very, very wrong for me if I did not tell the good news."},{"num":17,"verse":"If I do it because I want to do it, I get my pay. But if I do not want to do it, it is still my duty to do it."},{"num":18,"verse":"So what is my pay? My pay is to tell the good news and not be paid for it! That is why I do not use my right to take pay for telling the good news."},{"num":19,"verse":"Even though I am no one's slave, yet I have made myself a slave to everyone. I have done this so that I might win more people to Christ."},{"num":20,"verse":"When I was with the Jews, I lived like the Jews, so that I might win the Jews to Christ. I was not under the law. But I lived as if I was under the law of the Jews. I did this so that I might win to Christ those who are under the law."},{"num":21,"verse":"When I was with those who do not have the law of the Jews, I lived as if I did not have the law of the Jews. I did this so that I might win them also. Of course, I myself have laws. I follow the laws of Christ."},{"num":22,"verse":"When I was with weak people, I lived like a weak person. I did this so that I might win weak people to Christ. I lived like all kinds of people to save some of them."},{"num":23,"verse":"I do all this for the good news, so that I also will have some of its blessing."},{"num":24,"verse":"You know when people are running a race, they all run. But only one man will win. The way you should run is to run to win."},{"num":25,"verse":"Everyone who wants to show his strength must control himself in every way. They do it for a prize that will spoil. But what we do, we do for a reward that will never, never spoil."},{"num":26,"verse":"So I do not run as if I did not know where I was going. And I do not fight like a man just beating the air."},{"num":27,"verse":"But I control my own body really well. I make my body obey me. After telling others the good news, I myself do not want to be left out."}]