[{"num":5,"verse":"Now [we come to] the sons of Reuben the firstborn of Israel. For [Reuben] was the eldest, but because he polluted his father’s couch [with Bilhah his father’s concubine] his birthright was given to the sons of Joseph [favorite] son of Israel; so the genealogy is not to be reckoned according to the birthright."},{"num":2,"verse":"Judah prevailed above his brethren, and from him came the prince and leader [and eventually the Messiah]; yet the birthright was Joseph’s."},{"num":3,"verse":"The sons of Reuben the firstborn of Israel: Hanoch, Pallu, Hezron, and Carmi."},{"num":4,"verse":"The sons of Joel: Shemaiah his son, Gog his son, Shimei his son,"},{"num":5,"verse":"Micah his son, Reaiah his son, Baal his son,"},{"num":6,"verse":"Beerah his son, whom Tilgath-pilneser king of Assyria carried away captive; he was a prince of the Reubenites."},{"num":7,"verse":"And his brethren by their families, when the genealogy of their generations was reckoned: the chief Jeiel, and Zechariah,"},{"num":8,"verse":"Bela son of Azaz, the son of Shema, the son of Joel, who dwelt in Aroer as far as Nebo and Baal-meon."},{"num":9,"verse":"Eastward [Bela] inhabited the land as far as the entrance into the desert this [west] side of the river Euphrates, because their cattle had multiplied in the land of Gilead."},{"num":10,"verse":"In the days of [King] Saul they made war with the Hagrites or Ishmaelites, who fell by their hands; they dwelt in their tents in all the land east of Gilead."},{"num":11,"verse":"The children of Gad who dwelt opposite them in the land of Bashan, as far as Salecah:"},{"num":12,"verse":"Joel the chief, Shapham the next, Janai, and Shaphat in Bashan."},{"num":13,"verse":"Their kinsmen of the houses of their fathers: Michael, Meshullam, Sheba, Jorai, Jacan, Zia, and Eber—seven in all."},{"num":14,"verse":"These were the sons of Abihail son of Huri, the son of Jaroah, the son of Gilead, the son of Michael, the son of Jeshishai, the son of Jahdo, the son of Buz."},{"num":15,"verse":"Ahi son of Abdiel, the son of Guni, was chief in their fathers’ houses."},{"num":16,"verse":"They dwelt in Gilead, in Bashan and in its towns, and in all the suburbs and pasturelands of Sharon to their limits."},{"num":17,"verse":"All these were enrolled by genealogies in the days of Jotham king of Judah and in the days of Jeroboam [II] king of Israel."},{"num":18,"verse":"The sons of Reuben, the Gadites, and the half-tribe of Manasseh—valiant men able to bear buckler and sword and to shoot with bow and skillful in war—were 44,760 able and ready to go forth to war."},{"num":19,"verse":"And [these Israelites, on the east side of the Jordan River] made war with the Hagrites [a tribe of northern Arabia], Jetur, Naphish, and Nodab."},{"num":20,"verse":"They were given help against them, and the Hagrites or Ishmaelites were delivered into their hands, and all who were allied with them, for they cried to God in the battle; and He granted their entreaty, because they relied on, clung to, and trusted in Him."},{"num":21,"verse":"And [these Israelites] took away their adversaries’ herds: of their camels 50,000, and of sheep 250,000, and of donkeys 2,000, and of the lives of men 100,000."},{"num":22,"verse":"For a great number fell mortally wounded, because the battle was God’s. And [these Israelites] dwelt in their territory until the captivity [by Assyria more than five centuries later]."},{"num":23,"verse":"And the people of the half-tribe of Manasseh dwelt in the land; their settlements spread from Bashan to Baal-hermon, Senir, and Mount Hermon."},{"num":24,"verse":"And these were the heads of their fathers’ houses: Epher, Ishi, Eliel, Azriel, Jeremiah, Hodaviah, and Jahdiel, mighty men of strength of mind and spirit [enabling them to encounter danger with firmness and personal bravery], famous men, and heads of the houses of their fathers."},{"num":25,"verse":"They transgressed against the God of their fathers and played the harlot [by unfaithfulness to their own God and running] after the gods of the native peoples, whom God had destroyed before them."},{"num":26,"verse":"So the God of Israel stirred up the spirit of Pul king of Assyria, [that is,] the spirit of Tilgath-pilneser king of Assyria, and he carried them away, the Reubenites, Gadites, and half-tribe of Manasseh and brought them to Halah, Habor, Hara, and the river Gozan, to this day."}]