[{"header":"Descendants of Reuben"},{"num":5,"verse":"The oldest son of Israel was Reuben. But since he dishonored his father by sleeping with one of his father’s concubines, his birthright was given to the sons of his brother Joseph. For this reason, Reuben is not listed in the genealogical records as the firstborn son."},{"num":2,"verse":"The descendants of Judah became the most powerful tribe and provided a ruler for the nation, but the birthright belonged to Joseph."},{"num":3,"verse":"The sons of Reuben, the oldest son of Israel, were Hanoch, Pallu, Hezron, and Carmi."},{"num":4,"verse":"The descendants of Joel were Shemaiah, Gog, Shimei,"},{"num":5,"verse":"Micah, Reaiah, Baal,"},{"num":6,"verse":"and Beerah. Beerah was the leader of the Reubenites when they were taken into captivity by King Tiglath-pileser of Assyria."},{"num":7,"verse":"Beerah’s relatives are listed in their genealogical records by their clans: Jeiel (the leader), Zechariah,"},{"num":8,"verse":"and Bela son of Azaz, son of Shema, son of Joel."},{"num":9,"verse":"And since they had so many livestock in the land of Gilead, they spread east toward the edge of the desert that stretches to the Euphrates River."},{"num":10,"verse":"During the reign of Saul, the Reubenites defeated the Hagrites in battle. Then they moved into the Hagrite settlements all along the eastern edge of Gilead."},{"header":"Descendants of Gad"},{"num":11,"verse":"Next to the Reubenites, the descendants of Gad lived in the land of Bashan as far east as Salecah."},{"num":12,"verse":"Joel was the leader in the land of Bashan, and Shapham was second-in-command, followed by Janai and Shaphat."},{"num":13,"verse":"Their relatives, the leaders of seven other clans, were Michael, Meshullam, Sheba, Jorai, Jacan, Zia, and Eber."},{"num":14,"verse":"These were all descendants of Abihail son of Huri, son of Jaroah, son of Gilead, son of Michael, son of Jeshishai, son of Jahdo, son of Buz."},{"num":15,"verse":"Ahi son of Abdiel, son of Guni, was the leader of their clans."},{"num":16,"verse":"The Gadites lived in the land of Gilead, in Bashan and its villages, and throughout all the pasturelands of Sharon."},{"num":17,"verse":"All of these were listed in the genealogical records during the days of King Jotham of Judah and King Jeroboam of Israel."},{"header":"The Tribes East of the Jordan"},{"num":18,"verse":"There were 44,760 capable warriors in the armies of Reuben, Gad, and the half-tribe of Manasseh. They were all skilled in combat and armed with shields, swords, and bows."},{"num":19,"verse":"They waged war against the Hagrites, the Jeturites, the Naphishites, and the Nodabites."},{"num":20,"verse":"They cried out to God during the battle, and he answered their prayer because they trusted in him. So the Hagrites and all their allies were defeated."},{"num":21,"verse":"The plunder taken from the Hagrites included 50,000 camels, 250,000 sheep and goats, 2,000 donkeys, and 100,000 captives."},{"num":22,"verse":"Many of the Hagrites were killed in the battle because God was fighting against them. The people of Reuben, Gad, and Manasseh lived in their land until they were taken into exile."},{"num":23,"verse":"The half-tribe of Manasseh was very large and spread through the land from Bashan to Baal-hermon, Senir, and Mount Hermon."},{"num":24,"verse":"These were the leaders of their clans: Epher, Ishi, Eliel, Azriel, Jeremiah, Hodaviah, and Jahdiel. These men had a great reputation as mighty warriors and leaders of their clans."},{"num":25,"verse":"But these tribes were unfaithful to the God of their ancestors. They worshiped the gods of the nations that God had destroyed."},{"num":26,"verse":"So the God of Israel caused King Pul of Assyria (also known as Tiglath-pileser) to invade the land and take away the people of Reuben, Gad, and the half-tribe of Manasseh as captives. The Assyrians exiled them to Halah, Habor, Hara, and the Gozan River, where they remain to this day."}]