[{"num":5,"verse":"Now the Bnei Reuven the bechor Yisroel, for he was the bechor; but forasmuch as he defiled the bed of aviv, his bechorah (firstborn birthright) was given unto the Bnei Yosef Ben Yisroel, though [the latter was] not listed in the family registers as the bechorah."},{"num":2,"verse":"For Yehudah prevailed above his brethren, and of him came the nagid; but the bechorah (portion of the firstborn) was Yosef’s."},{"num":3,"verse":"The Bnei Reuven bechor Yisroel were Chanoch, and Pallu, Chetzron, and Carmi."},{"num":4,"verse":"The Bnei Yoel: Shema’yah bno, Gog bno, Shimei bno,"},{"num":5,"verse":"Michah bno, Reayah bno, Ba’al bno,"},{"num":6,"verse":"Be’erah bno, whom Tilgat Pilneser Melech Ashur carried away into the Golus; he was nasi of the Reuveni."},{"num":7,"verse":"And his relatives by their mishpekhot, when the genealogy of their toldot was reckoned, were the rosh, Ye’i’el, and Zecharyah,"},{"num":8,"verse":"And Bela Ben Azaz Ben Shema Ben Yoel who dwelt in Aroer, even unto Nevo and Baal Meon;"},{"num":9,"verse":"And eastward he inhabited as far as the beginning of the midbar from the river Euphrates, because their mikneh (livestock) were multiplied in Eretz Gil’ad."},{"num":10,"verse":"And in the days of Sha’ul they made milchamah with the Hagari’im, who fell by their yad; and they dwelt in their ohalim (tents) throughout all the area east of Gil’ad."},{"num":11,"verse":"And the Bnei Gad dwelt next to them, in the Eretz Bashan as far as Salchah;"},{"num":12,"verse":"Yoel the rosh, and Shapham the mishneh (second), and Ya’nai, and Shaphat in Bashan."},{"num":13,"verse":"And their achim of the bais avoteihem were Micha’el, and Meshullam, and Sheva, and Yorai, and Yakan, and Zia, and Ever, shivah (seven) in all."},{"num":14,"verse":"These are the Bnei Avichayil Ben Churi Ben Yaroach Ben Gil’ad Ben Micha’el Ben Yeshishai Ben Yachdo Ben Buz."},{"num":15,"verse":"Achi Ben Avdi’el Ben Guni was rosh of the bais avoteihem."},{"num":16,"verse":"And they dwelt in Gil’ad in Bashan, and in her towns, and in all the migrashim (open lands) of Sharon, within their borders."},{"num":17,"verse":"All these were reckoned by genealogies in the days of Yotam Melech Yehudah, and in the days of Yarov’am Melech Yisroel."},{"num":18,"verse":"The Bnei Reuven, and the Gadi, and half the shevet (tribe) of Menasheh, of bnei chayil, anashim able to bear mogen and cherev, and to shoot with keshet, and trained for milchamah, were four and forty elef seven hundred and threescore, that were ready for military service."},{"num":19,"verse":"And they waged milchamah against the Hagari’im, with Yetur, and Naphish, and Nodav."},{"num":20,"verse":"And they were helped against them, and the Hagari’im were delivered into their yad, and all that were with them, for they cried to Elohim in the milchamah, and He was entreated of them [T.N. These genealogies establish the massively eyewitnessed veracity of the death and resurrection of Israel in and from the Golus.] because they put their trust in Him."},{"num":21,"verse":"And they took away their mikneh: of their gemalim fifty elef, and of tzon two hundred and fifty elef, and of chamorim two thousand, and of nefesh adam a hundred elef."},{"num":22,"verse":"For there fell down many slain, because the milchamah was Elohim’s. And they took up residence in their place until the Golus."},{"num":23,"verse":"And Bnei chatzi (half) shevet Menasheh dwelt in the land. They increased from Bashan unto Ba’al Chermon and Senir, and unto Har Chermon."},{"num":24,"verse":"And these were the heads of the bais avotam, even Epher, Yishi, Eliel, Azriel, Yirmeyah, and Hodavyah, and Yachdiel, anashim gibborei chayil, famous men, and heads of the bais avotam."},{"num":25,"verse":"And they transgressed against Elohei Avoteihem, and went a-whoring after the elohim of the peoples of the land, whom Elohim made shmad before them."},{"num":26,"verse":"And Elohei Yisroel stirred up the ruach of Pul Melech Ashur, and the ruach of Tilgat Pilneser Melech Ashur, and he carried them away into Golus, even the Reuveni, and the Gadi, and the half tribe of Menasheh, and brought them unto Chalach, and Chavor, and Hara, and to the river Gozan, unto this day."}]