[{"header":"Descendants of Reuben"},{"num":5,"verse":"The sons of Reuben the first-born of Israel (for he was the first-born; but because he polluted his father’s couch, his birthright was given to the sons of Joseph the son of Israel, so that he is not enrolled in the genealogy according to the birthright; "},{"num":2,"verse":"though Judah became strong among his brothers and a prince was from him, yet the birthright belonged to Joseph), "},{"num":3,"verse":"the sons of Reuben, the first-born of Israel: Hanoch, Pallu, Hezron, and Carmi. "},{"num":4,"verse":"The sons of Jo′el: Shemai′ah his son, Gog his son, Shim′e-i his son, "},{"num":5,"verse":"Micah his son, Re-a′iah his son, Ba′al his son, "},{"num":6,"verse":"Be-er′ah his son, whom Til′gath-pilne′ser king of Assyria carried away into exile; he was a chieftain of the Reubenites. "},{"num":7,"verse":"And his kinsmen by their families, when the genealogy of their generations was reckoned: the chief, Je-i′el, and Zechari′ah, "},{"num":8,"verse":"and Bela the son of Azaz, son of Shema, son of Jo′el, who dwelt in Aro′er, as far as Nebo and Ba′al-me′on. "},{"num":9,"verse":"He also dwelt to the east as far as the entrance of the desert this side of the Euphra′tes, because their cattle had multiplied in the land of Gilead. "},{"num":10,"verse":"And in the days of Saul they made war on the Hagrites, who fell by their hand; and they dwelt in their tents throughout all the region east of Gilead."},{"header":"Descendants of Gad"},{"num":11,"verse":"The sons of Gad dwelt over against them in the land of Bashan as far as Sal′ecah: "},{"num":12,"verse":"Jo′el the chief, Shapham the second, Ja′nai, and Shaphat in Bashan. "},{"num":13,"verse":"And their kinsmen according to their fathers’ houses: Michael, Meshul′lam, Sheba, Jo′rai, Jacan, Zi′a, and Eber, seven. "},{"num":14,"verse":"These were the sons of Ab′ihail the son of Huri, son of Jaro′ah, son of Gilead, son of Michael, son of Jeshish′ai, son of Jahdo, son of Buz; "},{"num":15,"verse":"Ahi the son of Ab′di-el, son of Guni, was chief in their fathers’ houses; "},{"num":16,"verse":"and they dwelt in Gilead, in Bashan and in its towns, and in all the pasture lands of Sharon to their limits. "},{"num":17,"verse":"All of these were enrolled by genealogies in the days of Jotham king of Judah, and in the days of Jerobo′am king of Israel."},{"num":18,"verse":"The Reubenites, the Gadites, and the half-tribe of Manas′seh had valiant men, who carried shield and sword, and drew the bow, expert in war, forty-four thousand seven hundred and sixty, ready for service. "},{"num":19,"verse":"They made war upon the Hagrites, Jetur, Naphish, and Nodab; "},{"num":20,"verse":"and when they received help against them, the Hagrites and all who were with them were given into their hands, for they cried to God in the battle, and he granted their entreaty because they trusted in him. "},{"num":21,"verse":"They carried off their livestock: fifty thousand of their camels, two hundred and fifty thousand sheep, two thousand asses, and a hundred thousand men alive. "},{"num":22,"verse":"For many fell slain, because the war was of God. And they dwelt in their place until the exile."},{"header":"The Half-Tribe of Manasseh"},{"num":23,"verse":"The members of the half-tribe of Manas′seh dwelt in the land; they were very numerous from Bashan to Ba′al-her′mon, Senir, and Mount Hermon. "},{"num":24,"verse":"These were the heads of their fathers’ houses: Epher, Ishi, Eli′el, Az′riel, Jeremiah, Hodavi′ah, and Jah′di-el, mighty warriors, famous men, heads of their fathers’ houses. "},{"num":25,"verse":"But they transgressed against the God of their fathers, and played the harlot after the gods of the peoples of the land, whom God had destroyed before them. "},{"num":26,"verse":"So the God of Israel stirred up the spirit of Pul king of Assyria, the spirit of Til′gath-pilne′ser king of Assyria, and he carried them away, namely, the Reubenites, the Gadites, and the half-tribe of Manas′seh, and brought them to Halah, Habor, Hara, and the river Gozan, to this day."}]