[[],[{"type":"header","content":"Jesus Heals on the Sabbath"},{"type":"prose","content":"Again Jesus went into a synagogue; and a man was there whose hand was withered. "}],[{"type":"prose","content":"The Pharisees were watching Jesus  if He would heal him on the Sabbath, so that they might accuse Him [in the Jewish high court]. "}],[{"type":"prose","content":"He said to the man whose hand was withered,  "}],[{"type":"prose","content":"He asked them,  But they kept silent. "}],[{"type":"prose","content":"After looking around at them with anger, grieved at the hardness  arrogance of their hearts, He told the man,  And he held it out, and his hand was [completely] restored. "}],[{"type":"prose","content":"Then the Pharisees went out and immediately  conspiring with the Herodians [to plot] against Him, as to how they might [fabricate some legal grounds to] put Him to death."}],[{"type":"prose","content":"Jesus withdrew to the sea with His disciples; and a large crowd from Galilee followed Him; and  from Judea, "}],[{"type":"prose","content":"and from Jerusalem, and from Idumea, and [from the region] beyond the Jordan, and around Tyre and Sidon; a vast number of people came to Him because they were hearing about all [the things] that He was doing. "}],[{"type":"prose","content":"And He told His disciples to have a small boat stand ready for Him because of the many people, so that they would not crowd Him; "}],[{"type":"prose","content":"for He had healed many, and as a result all who had diseases pressed around Him to touch Him. "}],[{"type":"prose","content":"Whenever the unclean spirits saw Him, they fell down before Him and screamed out, “You are the Son of God!” "}],[{"type":"prose","content":"Jesus sternly warned them [again and again] not to tell who He was."},{"type":"header","content":"The Twelve Are Chosen"}],[{"type":"prose","content":"He went up on the hillside and called those whom He Himself wanted  chose; and they came to Him. "}],[{"type":"prose","content":"And He appointed twelve [disciples], so that they would be with Him [for instruction] and so that He could send them out to preach [the gospel as apostles—that is, as His special messengers, personally chosen representatives], "}],[{"type":"prose","content":"and to have authority  power to cast out demons. "}],[{"type":"prose","content":"He appointed the twelve: Simon to whom He gave the name Peter, "}],[{"type":"prose","content":"and James, the son of Zebedee, and John the brother of James to them He gave the name Boanerges, that is, “Sons of Thunder”; "}],[{"type":"prose","content":"and [He also appointed] Andrew, and Philip, and Bartholomew (Nathanael), and Matthew (Levi the tax collector), and Thomas, and James the son of Alphaeus, and Thaddaeus (Judas the son of James), and Simon the Zealot; "}],[{"type":"prose","content":"and Judas Iscariot, who betrayed Him."}],[{"type":"prose","content":"Then He came to a house [in Capernaum], and a crowd formed again, so [many people] that Jesus and His disciples could not even eat a meal [together]. "}],[{"type":"prose","content":"When His own family heard this they went to take custody of Him; for they were saying, “He is out of His mind.” "}],[{"type":"prose","content":"The scribes who came down from Jerusalem were saying, “He is possessed by Beelzebul (Satan),” and “He is driving out the demons by the [power of the] ruler of the demons.” "}],[{"type":"prose","content":"So He called them to Himself and spoke to them in parables,   [split into factions and rebelling]      [by attributing the miracles done by Me to Satan]  [a sin which is unforgivable in this present age as well as in the age to come]”— "}],[{"type":"prose","content":"[Jesus said this] because the scribes and Pharisees were [attributing His miracles to Satan by] saying, “He has an unclean spirit.”"}],[{"type":"prose","content":"Then His mother and His brothers arrived, and standing outside they sent  to Him and called for Him. "}],[{"type":"prose","content":"A crowd was sitting around Him, and they said to Him, “Look! Your mother and Your brothers are outside asking for You.” "}],[{"type":"prose","content":"And He replied,  "}],[{"type":"prose","content":"Looking at those who were sitting in a circle around Him, He said,   [by believing in Me, and following Me], "}]]