[{"num":3,"verse":"Jesus entered the synagogue again, and a man was there who had a shriveled hand. "},{"num":2,"verse":"In order to accuse him, they were watching him closely to see whether he would heal him on the Sabbath. "},{"num":3,"verse":"He told the man with the shriveled hand, “Stand before us.” "},{"num":4,"verse":"Then he said to them, “Is it lawful to do good on the Sabbath or to do evil, to save life or to kill?” But they were silent. "},{"num":5,"verse":"After looking around at them with anger, he was grieved at the hardness of their hearts and told the man, “Stretch out your hand.” So he stretched it out, and his hand was restored. "},{"num":6,"verse":"Immediately the Pharisees went out and started plotting with the Herodians against him, how they might kill him."},{"header":"Ministering to the Multitude"},{"num":7,"verse":"Jesus departed with his disciples to the sea, and a large crowd followed from Galilee, and a large crowd followed from Judea, "},{"num":8,"verse":"Jerusalem, Idumea, beyond the Jordan, and around Tyre and Sidon. The large crowd came to him because they heard about everything he was doing. "},{"num":9,"verse":"Then he told his disciples to have a small boat ready for him, so that the crowd wouldn’t crush him. "},{"num":10,"verse":"Since he had healed many, all who had diseases were pressing toward him to touch him. "},{"num":11,"verse":"Whenever the unclean spirits saw him, they fell down before him and cried out, “You are the Son of God!”  "},{"num":12,"verse":"And he would strongly warn them not to make him known."},{"header":"The Twelve Apostles"},{"num":13,"verse":"Jesus went up the mountain and summoned those he wanted, and they came to him. "},{"num":14,"verse":"He appointed twelve, whom he also named apostles, to be with him, to send them out to preach, "},{"num":15,"verse":"and to have authority to drive out demons. "},{"num":16,"verse":"He appointed the Twelve: To Simon, he gave the name Peter; "},{"num":17,"verse":"and to James the son of Zebedee, and to his brother John, he gave the name “Boanerges” (that is, “Sons of Thunder”); "},{"num":18,"verse":"Andrew; Philip and Bartholomew; Matthew and Thomas; James the son of Alphaeus, and Thaddaeus; Simon the Zealot, "},{"num":19,"verse":"and Judas Iscariot, who also betrayed him."},{"header":"A House Divided"},{"num":20,"verse":"Jesus entered a house, and the crowd gathered again so that they were not even able to eat. "},{"num":21,"verse":"When his family heard this, they set out to restrain him, because they said, “He’s out of his mind.”"},{"num":22,"verse":"The scribes who had come down from Jerusalem said, “He is possessed by Beelzebul,” and, “He drives out demons by the ruler of the demons.”"},{"num":23,"verse":"So he summoned them and spoke to them in parables: “How can Satan drive out Satan? "},{"num":24,"verse":"If a kingdom is divided against itself, that kingdom cannot stand. "},{"num":25,"verse":"If a house is divided against itself, that house cannot stand. "},{"num":26,"verse":"And if Satan opposes himself and is divided, he cannot stand but is finished. "},{"num":27,"verse":"But no one can enter a strong man’s house and plunder his possessions unless he first ties up the strong man. Then he can plunder his house."},{"num":28,"verse":"“Truly I tell you, people will be forgiven for all sins and whatever blasphemies they utter. "},{"num":29,"verse":"But whoever blasphemes against the Holy Spirit never has forgiveness, but is guilty of an eternal sin”—"},{"num":30,"verse":"because they were saying, “He has an unclean spirit.”"},{"header":"True Relationships"},{"num":31,"verse":"His mother and his brothers came, and standing outside, they sent word to him and called him. "},{"num":32,"verse":"A crowd was sitting around him and told him, “Look, your mother, your brothers, and your sisters are outside asking for you.”"},{"num":33,"verse":"He replied to them, “Who are my mother and my brothers?” "},{"num":34,"verse":"Looking at those sitting in a circle around him, he said, “Here are my mother and my brothers! "},{"num":35,"verse":"Whoever does the will of God is my brother and sister and mother.”"}]