[[],[{"type":"header","content":"Healing on the Sabbath(A)"},{"type":"prose","content":"And He entered the synagogue again, and a man was there who had a withered hand. "}],[{"type":"prose","content":"So they watched Him closely, whether He would heal him on the Sabbath, so that they might accuse Him. "}],[{"type":"prose","content":"And He said to the man who had the withered hand,  "}],[{"type":"prose","content":"Then He said to them,  But they kept silent. "}],[{"type":"prose","content":"And when He had looked around at them with anger, being grieved by the hardness of their hearts, He said to the man,  And he stretched  out, and his hand was restored as whole as the other. "}],[{"type":"prose","content":"Then the Pharisees went out and immediately plotted with the Herodians against Him, how they might destroy Him."}],[{"type":"header","content":"A Great Multitude Follows Jesus(H)"},{"type":"prose","content":"But Jesus withdrew with His disciples to the sea. And a great multitude from Galilee followed Him, and from Judea "}],[{"type":"prose","content":"and Jerusalem and Idumea and beyond the Jordan; and those from Tyre and Sidon, a great multitude, when they heard how many things He was doing, came to Him. "}],[{"type":"prose","content":"So He told His disciples that a small boat should be kept ready for Him because of the multitude, lest they should crush Him. "}],[{"type":"prose","content":"For He healed many, so that as many as had afflictions pressed about Him to touch Him. "}],[{"type":"prose","content":"And the unclean spirits, whenever they saw Him, fell down before Him and cried out, saying, “You are the Son of God.” "}],[{"type":"prose","content":"But He sternly warned them that they should not make Him known."}],[{"type":"header","content":"The Twelve Apostles(P)"},{"type":"prose","content":"And He went up on the mountain and called to  those He Himself wanted. And they came to Him. "}],[{"type":"prose","content":"Then He appointed twelve, that they might be with Him and that He might send them out to preach, "}],[{"type":"prose","content":"and to have power to heal sicknesses and to cast out demons: "}],[{"type":"prose","content":"Simon, to whom He gave the name Peter; "}],[{"type":"prose","content":"James the  of Zebedee and John the brother of James, to whom He gave the name Boanerges, that is, “Sons of Thunder”; "}],[{"type":"prose","content":"Andrew, Philip, Bartholomew, Matthew, Thomas, James the  of Alphaeus, Thaddaeus, Simon the Cananite; "}],[{"type":"prose","content":"and Judas Iscariot, who also betrayed Him. And they went into a house."}],[{"type":"header","content":"A House Divided Cannot Stand(S)"},{"type":"prose","content":"Then the multitude came together again, so that they could not so much as eat bread. "}],[{"type":"prose","content":"But when His own people heard  they went out to lay hold of Him, for they said, “He is out of His mind.”"}],[{"type":"prose","content":"And the scribes who came down from Jerusalem said, “He has Beelzebub,” and, “By the ruler of the demons He casts out demons.”"}],[{"type":"prose","content":"So He called them to  and said to them in parables:  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":" "}],[{"type":"prose","content":" "}],[],[{"type":"header","content":"The Unpardonable Sin(AA)"},{"type":"prose","content":" "}],[{"type":"prose","content":"— "}],[{"type":"prose","content":"because they said, “He has an unclean spirit.”"}],[{"type":"header","content":"Jesus’ Mother and Brothers Send for Him(AD)"},{"type":"prose","content":"Then His brothers and His mother came, and standing outside they sent to Him, calling Him. "}],[{"type":"prose","content":"And a multitude was sitting around Him; and they said to Him, “Look, Your mother and Your brothers are outside seeking You.”"}],[{"type":"prose","content":"But He answered them, saying,  "}],[{"type":"prose","content":"And He looked around in a circle at those who sat about Him, and said,  "}],[{"type":"prose","content":" "}]]