[{"num":3,"verse":"And Rebbe, Melech HaMoshiach entered again into the shul. And there was there a man having a withered hand."},{"num":2,"verse":"And they were watching Rebbe, Melech HaMoshiach [to see] if on Shabbos he will heal him, in order that they might accuse him."},{"num":3,"verse":"And he says to the man, the one with the withered hand, Stand up here in the center."},{"num":4,"verse":"And Rebbe, Melech HaMoshiach says to them, Is it mutar (permissible) on Shabbos to do tov or rah, to restore nefesh or to destroy [it]? But they were silent."},{"num":5,"verse":"And having looked [at] them with ka’as and having agmat nefesh (grief) at the stubborn hardness of their levavot, Rebbe, Melech HaMoshiach says to the man, Stretch out your hand. And the man stretched it out, and his hand was restored."},{"num":6,"verse":"And ofen ort (immediately) the Perushim went out and held consultation with the party of Herod against him, as to how they might destroy him."},{"num":7,"verse":"And Rebbe, Melech HaMoshiach with his talmidim went away to the lake, and a great multitude from the Galil and also from Yehudah followed Rebbe, Melech HaMoshiach."},{"num":8,"verse":"And from Yerushalayim and from Idumea and from the other side of the Yarden and from around Tzor-Tzidon area, a great multitude [followed], hearing everything that he was doing, and they came to Rebbe Melech HaMoshiach."},{"num":9,"verse":"And he said to his talmidim that a sirah (boat) should stand ready for him, lest the multitude might crush him."},{"num":10,"verse":"For he had brought refuah to many, with the result that as many as had afflictions pressed in on him in order to touch him."},{"num":11,"verse":"And the ruchot hatemeiot (unclean spirits), whenever they saw Rebbe, Melech HaMoshiach, were falling before him and were crying out, saying, You are the Ben HaElohim!"},{"num":12,"verse":"And he sternly rebuked them, lest they should make him known."},{"num":13,"verse":"And Rebbe, Melech HaMoshiach goes up to the mountain and summons those whom he wanted, and they came to him."},{"num":14,"verse":"And Rebbe, Melech HaMoshiach appointed and gave smichah to Shneym Asar (Twelve), whom also he designated Shlichim, that they might be with him [be mishtatef in Moshiach’s chavurah], and that he might send them out as his Shlichim to preach,"},{"num":15,"verse":"and to have samchut (authority) to cast out shedim."},{"num":16,"verse":"And Rebbe, Melech HaMoshiach appointed the Shneym Asar: Shimon, to whom he gave the name Kefa,"},{"num":17,"verse":"And Yaakov Ben Zavdai and Yochanan, Yaakov’s brother. He gave to them the name Bnei Regesh, (Sons of Thunder)."},{"num":18,"verse":"And Andrew and Philippos and Bar-Talmai, and Mattityahu, and Toma, and Yaakov Ben Chalfai, and Taddai, and Shimon the Zealot,"},{"num":19,"verse":"And Yehudah from Kriot, the one who betrayed Rebbe, Melech HaMoshiach."},{"num":20,"verse":"And Rebbe, Melech HaMoshiach goes to his home shtetl; and again the multitude assembles, with the result that they were not able to have okhel (food)."},{"num":21,"verse":"And when his own mishpochah heard of this, they went out to constrain him. For they were saying, He is meshuga."},{"num":22,"verse":"And the Sofrim (Scribes), the ones coming down from Yerushalayim, were saying, He is possessed by Baal-zibbul and by the Sar HaShedim he casts out shedim."},{"num":23,"verse":"But having called them, Rebbe, Melech HaMoshiach was speaking to them in meshalim: How can Hasatan cast out Hasatan?"},{"num":24,"verse":"And if a malchut is divided against itself, it is not possible for that malchut to stand."},{"num":25,"verse":"And if a bais is divided against itself, it will not be possible for that bais to stand."},{"num":26,"verse":"And if Hasatan has risen up against himself and is divided, it is not possible for him to stand, but his end has arrived."},{"num":27,"verse":"But no one is able, having entered into the house of the Gibbor to plunder his possessions, unless first, he binds HaGibbor, and then he will plunder the Bayit HaGibbor."},{"num":28,"verse":"Omein, I say to you that for everything—for the averos (sins) and the Chillul Hashem (Desecration of the Name), whatever blasphemies they may utter—the Bnei Adam will be granted selicha."},{"num":29,"verse":"But whoever commits Chillul Hashem gidduf against the Ruach Hakodesh, can never have selicha, but is guilty of a Chet Olam."},{"num":30,"verse":"For they were saying, He has a ruach hatumah (an unclean spirit)."},{"num":31,"verse":"And the Em (Mother) of Rebbe, Melech HaMoshiach and his achim come and stand outside and they sent word to him."},{"num":32,"verse":"And a multitude was sitting around him, and they are saying to him, Hinei! Your Em (Mother)! And your achim (brothers)! And your achayot (sisters) are outside looking for you."},{"num":33,"verse":"And in reply to them, Rebbe, Melech HaMoshiach says, Who is immi? And my achim (brothers)?"},{"num":34,"verse":"And having looked around at the ones sitting around him, Rebbe, Melech HaMoshiach says, Hinei! Immi and my achim!"},{"num":35,"verse":"For whoever does the ratzon Hashem, this one is my brother and my sister and mother."}]