[{"num":1,"verse":"On another occasion when he went into the synagogue, there was a man there whose hand was shrivelled, and they were watching Jesus closely to see whether he would heal him on the Sabbath day, so that they might bring a charge against him. Jesus said to the man with the shrivelled hand, “Stand up and come out here in front!”"},{"num":4,"verse":"Then he said to them, “Is it right to do good on the Sabbath day, or to do harm? Is it right to save life or to kill?”"},{"num":5,"verse":"There was a dead silence. Then Jesus, deeply hurt as he sensed their inhumanity, looked round in anger at the faces surrounding him, and said to the man, “Stretch out your hand!” And he stretched it out, and the hand was restored as sound as the other one. The Pharisees walked straight out and discussed with Herod’s party how they could have Jesus put out of the way."},{"header":"Jesus’ enormous popularity"},{"num":7,"verse":"Jesus now retired to the lake-side with his disciples. A huge crowd of people followed him, not only from Galilee, but from Judea, Jerusalem and Idumea, some from the district beyond the Jordan and from the neighbourhood of Tyre and Sidon. This vast crowd came to him because they had heard about the sort of things he was doing. So Jesus told his disciples to have a small boat kept in readiness for him, in case the people should crowd him too closely. For he healed so many people that all those who were in pain kept pressing forward to touch him with their hands. Evil spirits, as soon as they saw him, acknowledged his authority and screamed, “You are the Son of God!”"},{"num":12,"verse":"But he warned them repeatedly that they must not make him known."},{"header":"Jesus chooses the twelve apostles"},{"num":13,"verse":"Later he went up on to the hill-side and summoned the men whom he wanted, and they went up to him. He appointed a band of twelve to be his companions, whom he could send out to preach, with power to drive out evil spirits. These were the twelve he appointed: Peter (which was the new name he gave Simon), James the son of Zebedee, and John his brother (He gave them the name of Boanerges, which means the “Thunderers”.) Andrew, Philip, Bartholomew, Matthew, Thomas, James the son of Alphaeus, Thaddaeus, Simon the Patriot, and Judas Iscariot, who betrayed him."},{"header":"Jesus exposes an absurd accusation"},{"num":20,"verse":"Then he went indoors, but again such a crowd collected that it was impossible for them even to eat a meal. When his relatives heard of this, they set out to take charge of him, for people were saying, “He must be mad!”"},{"num":22,"verse":"The scribes who had come down from Jerusalem were saying that he was possessed by Beelzebub, and that he drove out devils because he was in league with the prince of devils. So Jesus called them to him and spoke to them in a parable—“How can Satan be the one who drives out Satan? If a kingdom is divided against itself, it cannot last either. And if Satan leads a rebellion against Satan—his days are certainly numbered. No one can break into a strong man’s house and steal his property, without first tying up the strong man hand and foot. But if he did that, he could ransack the whole house."},{"num":28,"verse":"“Believe me, all men’s sins can be forgiven and their blasphemies. But there can never be any forgiveness for blasphemy against the Holy Spirit. That is an eternal sin.”"},{"num":30,"verse":"He said this because they were saying, “He is in the power of an evil spirit.”"},{"header":"The new relationships in the kingdom"},{"num":31,"verse":"Then his mother and his brothers arrived. They stood outside the house and sent a message asking him to come out to them. There was a crowd sitting round him when the message was brought telling him, “Your mother and your brothers are outside looking for you.”"},{"num":33,"verse":"Jesus replied, “And who are really my mother and my brothers?”"},{"num":34,"verse":"And he looked round at the faces of those sitting in a circle about him."},{"num":35,"verse":"“Look!” he said, “my mother and my brothers are here. Anyone who does the will of God is brother and sister and mother to me.”"}]