[{"header":"Prophecy against Babylon"},{"num":50,"verse":"The word which the Lord spoke concerning Babylon, the land of the Chaldeans, through Jeremiah the prophet:"},{"num":3,"verse":"For a nation has come up against her out of the north; it will make her land an object of horror, and there will be no inhabitant in it. Both man and beast have wandered off, they have gone away!"},{"num":4,"verse":"“In those days and at that time,” declares the Lord, “the sons of Israel will come, both they and the sons of Judah as well; they will go along weeping as they go, and it will be the Lord their God they will seek."},{"num":5,"verse":"They will ask for the way to Zion, turning their faces in its direction; they will come that they may join themselves to the Lord in an everlasting covenant that will not be forgotten."},{"num":17,"verse":"“Israel is a scattered flock, the lions have driven them away. The first one who devoured him was the king of Assyria, and this last one who has broken his bones is Nebuchadnezzar king of Babylon."},{"num":18,"verse":"Therefore thus says the Lord of hosts, the God of Israel: ‘Behold, I am going to punish the king of Babylon and his land, just as I punished the king of Assyria."},{"num":19,"verse":"And I will bring Israel back to his pasture and he will graze on Carmel and Bashan, and his desire will be satisfied in the hill country of Ephraim and Gilead."},{"num":20,"verse":"In those days and at that time,’ declares the Lord, ‘search will be made for the iniquity of Israel, but there will be none; and for the sins of Judah, but they will not be found; for I will pardon those whom I leave as a remnant.’"},{"num":44,"verse":"“Behold, one will come up like a lion from the thicket of the Jordan to a perennially watered pasture; for in an instant I will make them run away from it, and whoever is chosen I will appoint over it. For who is like Me, and who will summon Me into court? And who then is the shepherd who can stand before Me?”"},{"num":45,"verse":"Therefore hear the plan of the Lord which He has planned against Babylon, and His purposes which He has purposed against the land of the Chaldeans: surely they will drag them off, even the little ones of the flock; surely He will make their pasture desolate because of them."},{"num":46,"verse":"At the shout, “Babylon has been seized!” the earth is shaken, and an outcry is heard among the nations."}]