[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Egypt shall be a desolation.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Egypt and Edom always excited feelings of abhorrence in the hearts of the Jews. The memory of the exile in Egypt was always fresh and keen; no retrospect of their past history could leave it out of account. And the national detestation of the false and cruel-hearted Idumæan kinsmen is recalled by Obadiah in his prophecy and touching record; as also in Psalms 137, as rendered in the Prayer Book, “Remember the children of Edom, O Lord, in the day of Jerusalem, how they said, Down with it, down with it, even to the ground.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 3:19-20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:19-20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Egypt shall be a desolation, and Edom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — These two people were remarkable for the spite they bore to the Jews. The Egyptians were their oppressors when they first became a nation, and afterward exercised great cruelties upon them, during the reign of the Egyptian kings who were Alexander’s successors. The Idumeans are often reproved and threatened with judgments by the prophets, for the malice they took all occasions to vent against the Israelites, though nearly related to them: see the margin. These two nations, therefore, are taken, in a general sense, for the enemies of God’s people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But Judah — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The redeemed of the Lord, his church, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall dwell, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or continue, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ever — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Free from the annoyance of enemies. The Christian Church is evidently intended, including probably the conversion and final restoration of the Jews.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:18-21 There shall be abundant Divine influences, and the gospel will spread speedily into the remotest corners of the earth. These events are predicted under significant emblems; there is a day coming, when every thing amiss shall be amended. The fountain of this plenty is in the house of God, whence the streams take rise. Christ is this Fountain; his sufferings, merit, and grace, cleanse, refresh, and make fruitful. Gospel grace, flowing from Christ, shall reach to the Gentile world, to the most remote regions, and make them abound in fruits of righteousness; and from the house of the Lord above, from his heavenly temple, flows all the good we daily taste, and hope to enjoy eternally.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Egypt shall be a desolation - \"Egypt\" and \"Edom\" represent each a different class of enemies of the people of God, and both together exhibit the lot of all. Egypt was the powerful oppressor, who kept Israel long time in hard bondage, and tried, by the murder of their male children, to extirpate them. Edom was, by birth, the nearest allied to them, but had, from the time of their approach to the promised land, been hostile to them, and showed a malicious joy in all their calamities (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:10-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 25:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 35:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 137:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"Their land,\" in which Egypt and Edom shed the \"innocent blood of the children of Judah,\" may either be Edom, Egypt, or Judaea. If the land was Judaea, the sin is aggravated by its being God's land, the possession of which they were disputing with God. If it was Egypt and Edom, then it was probably the blood of those who took refuge there, or, as to Edom, of prisoners delivered up to them (see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is the first prophecy of the humiliation of Egypt. Hosea had threatened, that Egypt should be the grave of those of Israel who should flee there Hosea 9:6. He speaks of it as the vain trust, and a real evil to Israel Hosea 7:11-12, Hosea 7:16; Hosea 8:13; Hosea 9:3; Hosea 11:5; of its own future he says nothing. Brief as Joel's words are, they express distinctly an abiding condition of Egypt. They are expanded by Ezekiel EZechariah 29:9-12, Ezekiel 29:15; particular chastisements are foretold by Isaiah Isa. 19; Isaiah 20:1-6, Jeremiah Jer. 46, Ezekiel Ezek. 29-32, Zechariah Zechariah 10:11. But the three words of Joel , \"Egypt shall become desolation,\" are more comprehensive than any prophecy, except those by Ezekiel. They foretell that abiding condition, not only by the force of the words, but by the contrast with an abiding condition of bliss. The words say, not only \"it shall be desolated,\" as by a passing scourge sweeping over it, but \"it shall itself 'pass over into' that state;\" it shall become what it had not been ; and this, in contrast with the abiding condition of God's people. The contrast is like that of the Psalmist, \"He turneth a fruitful land into barrenness for the wickedness of them that dwell therein. He turneth the wilderness into a standing water, and dry ground into water-springs\" Psalm 107:33-35. Judah should overflow with blessing, and the streams of God's grace should pass beyond its bounds, and carry fruitfulness to what now was dry and barren. But what should reject His grace should be itself rejected.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This is the first prophecy of the humiliation of Egypt. Hosea had threatened, that Egypt should be the grave of those of Israel who should flee there ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He speaks of it as the vain trust, and a real evil to Israel ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 7:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; of its own future he says nothing. Brief as Joel's words are, they express distinctly an abiding condition of Egypt. They are expanded by Ezekiel E",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 29:9-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; particular chastisements are foretold by Isaiah Isa. 19; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Jeremiah Jer. 46, Ezekiel Ezek. 29-32, Zechariah Zechariah 10:11. But the three words of Joel , \"Egypt shall become desolation,\" are more comprehensive than any prophecy, except those by Ezekiel. They foretell that abiding condition, not only by the force of the words, but by the contrast with an abiding condition of bliss. The words say, not only \"it shall be desolated,\" as by a passing scourge sweeping over it, but \"it shall itself 'pass over into' that state;\" it shall become what it had not been ; and this, in contrast with the abiding condition of God's people. The contrast is like that of the Psalmist, \"He turneth a fruitful land into barrenness for the wickedness of them that dwell therein. He turneth the wilderness into a standing water, and dry ground into water-springs\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 107:33-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Judah should overflow with blessing, and the streams of God's grace should pass beyond its bounds, and carry fruitfulness to what now was dry and barren. But what should reject His grace should be itself rejected.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet when Joel thus threatened Egypt, there were no human symptoms of its decay; the instruments of its successive overthrows were as yet wild hordes, (as the Chaldees, Persians, and Macedonians,) to be consolidated thereafter into powerful empires, or (as Rome) had not the beginnings of being. : \"The continuous monumental history of Egypt\" went back seven centuries before this, to about 1520 b.c. They had had a line of conquerors among their kings, who subdued much of Asia, and disputed with Assyria the country which lay between there . Even after the time of Joel, they had great conquerors, as Tirhaka; Psammetichus won Ashdod back from Assyria , Neco was probably successful against it, as well as against Syria and king Josiah, for he took Cadytis on his return  from his expedition against Carchemish 2 Kings 23:29; Pharaoh Hophra, or Apries, until he fell by his pride Ezekiel 29:3, renewed for a time the prosperity of Psammetichus ; the reign of Amasis, even after Nebuchadnezzars conquest, was said to be \"the most prosperous time which Egypt ever saw\" ; it was still a period of foreign conquest , and its cities could be magnified into 20,000.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet when Joel thus threatened Egypt, there were no human symptoms of its decay; the instruments of its successive overthrows were as yet wild hordes, (as the Chaldees, Persians, and Macedonians,) to be consolidated thereafter into powerful empires, or (as Rome) had not the beginnings of being. : \"The continuous monumental history of Egypt\" went back seven centuries before this, to about 1520 b.c. They had had a line of conquerors among their kings, who subdued much of Asia, and disputed with Assyria the country which lay between there . Even after the time of Joel, they had great conquerors, as Tirhaka; Psammetichus won Ashdod back from Assyria , Neco was probably successful against it, as well as against Syria and king Josiah, for he took Cadytis on his return  from his expedition against Carchemish ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Pharaoh Hophra, or Apries, until he fell by his pride ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 29:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", renewed for a time the prosperity of Psammetichus ; the reign of Amasis, even after Nebuchadnezzars conquest, was said to be \"the most prosperous time which Egypt ever saw\" ; it was still a period of foreign conquest , and its cities could be magnified into 20,000.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Persian invasion was drawn upon it by an alliance with Lydia, where Amasis sent 120,000 men ; its, at times, successful struggles against the gigantic armies of its Persian conquerors  betoken great inherent strength; yet it sank for ever, a perpetual desolation. \"Rent, twenty-three centuries ago, from her natural proprietors,\" says an unbelieving writer , \"she has seen Persians, Macedonians, Romans, Greeks, Arabs, Georgians, and at length, the race of Tartars, distinguished by the name of Ottoman Turks, establish themselves in her bosom.\" \"The system of oppression is methodical;\" \"an universal air of misery is manifest in all which the traveler meets.\" : \"Mud-walled cottages are now the only habitations, where the ruins of temples and palaces abound. The desert covers many extensive regions, which once raised Egypt among the chief of the kingdoms.\" The desolation of Egypt is the stranger, because exceeding misrule alone could have effected it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Egypt in its largest dimensions, has been calculated to contain 123,527 square miless or 79,057,339 acres, and to be three fourths of the size of France  Memoire sur le lae de Moeris. (1843). The mountains which hem in Upper Egypt, diverge at Cairo, parting, the one range, due east, the other northwest. The mountains on the west sink into the plains; those on the east retain their height as far as Suez. About 10 miles below Cairo, the Nile parted, enclosing within the outside of its seven branches, that triangle of wondrous fertility, the Delta. A network of canals, formed by the stupendous industry of the ancient Egyptians, enclosed this triangle in another yet larger, whose base, along the coast, was 235 miles, in direct distance about 181. East of the eastern-most branch of the Nile, lay the \"land of Goshen,\" formerly, at least for cattle, \"the good of the land\" Genesis 47:6, Genesis 47:11, a part, at least, of the present esh-Sharkiyyeh, second in size of the provinces of Egypt, but which, 1375 a.d., yielded the highest revenue of the state .",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Egypt in its largest dimensions, has been calculated to contain 123,527 square miless or 79,057,339 acres, and to be three fourths of the size of France  Memoire sur le lae de Moeris. (1843). The mountains which hem in Upper Egypt, diverge at Cairo, parting, the one range, due east, the other northwest. The mountains on the west sink into the plains; those on the east retain their height as far as Suez. About 10 miles below Cairo, the Nile parted, enclosing within the outside of its seven branches, that triangle of wondrous fertility, the Delta. A network of canals, formed by the stupendous industry of the ancient Egyptians, enclosed this triangle in another yet larger, whose base, along the coast, was 235 miles, in direct distance about 181. East of the eastern-most branch of the Nile, lay the \"land of Goshen,\" formerly, at least for cattle, \"the good of the land\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a part, at least, of the present esh-Sharkiyyeh, second in size of the provinces of Egypt, but which, 1375 a.d., yielded the highest revenue of the state .",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "On the western side of the Nile, and about a degree south of the apex of the Delta, a stupendous work, the artificial lake of Moeris , enclosing within masonry 64 34 square miles of water, received the superfluous waters of the river, and thus at once prevented the injury incidental on any too great rise of the Nile, and supplied water during six months for the irrigation of 1724 square miles, or 1,103, 375, acres .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Nile which, when it overflowed, spread like a sea over Egypt , encircling its cities like islands, carried with it a fertilizing power, attested by all, but which, unless so attested, would seem fabulous. Beneath a glowing heat, greater than its latitude will account for, the earth, supplied with continual moisture and an ever renewed alluvial deposit which supersedes all need of \"dressing\" the soil, yields, within the year, three harvests of varied produce . This system of canalising Egypt must have been of very early antiquity. That giant conception of the water system of lake Moeris is supposed to have been the work of Ammenemhes, perhaps about 1673, b.c. . But such a giant plan presupposes the existence of an artificial system of irrigation which it expanded. In the time of Moses, we hear incidentally of \"the streams\" of Egypt, \"the canals\"  (that is, those used for irrigation), and \"the ponds\" Exodus 7:19; Exodus 8:1, the receptacles of the water which was left when the Nile retired.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Nile which, when it overflowed, spread like a sea over Egypt , encircling its cities like islands, carried with it a fertilizing power, attested by all, but which, unless so attested, would seem fabulous. Beneath a glowing heat, greater than its latitude will account for, the earth, supplied with continual moisture and an ever renewed alluvial deposit which supersedes all need of \"dressing\" the soil, yields, within the year, three harvests of varied produce . This system of canalising Egypt must have been of very early antiquity. That giant conception of the water system of lake Moeris is supposed to have been the work of Ammenemhes, perhaps about 1673, b.c. . But such a giant plan presupposes the existence of an artificial system of irrigation which it expanded. In the time of Moses, we hear incidentally of \"the streams\" of Egypt, \"the canals\"  (that is, those used for irrigation), and \"the ponds\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the receptacles of the water which was left when the Nile retired.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Besides these, an artificial mode of irrigation \"by the foot\" Deuteronomy 11:40 is mentioned, now no longer distinctly known, but used, like the present plans of the water-wheel and the lever , to irrigate the lands for the later harvests. This system of irrigation had, in the time of Joel, lasted probably for above 1000 years. The Egyptians ascribed the first turning of the Nile to their first king, Menes , of fabulous antiquity. But while it lasted in any degree, Egypt could not become barren except by miracle. Even now it recovers, whenever water is applied. \"Wherever there is water, there is fertility.\" : \"The productive powers of the soil of Egypt are incalculable. Wherever water is scattered, there springs up a rapid and beautiful vegetation. The seed is sown and watered, and scarcely any other care is requisite for the ordinary fruits of the earth. Even in spots adjacent to the desert and which seem to be taken possession of by the sands, irrigation brings rapidly forth a variety of green herbs and plants.\" For its first crop, there needed but to cast the seed, and have it trodden in by cattle .",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Besides these, an artificial mode of irrigation \"by the foot\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is mentioned, now no longer distinctly known, but used, like the present plans of the water-wheel and the lever , to irrigate the lands for the later harvests. This system of irrigation had, in the time of Joel, lasted probably for above 1000 years. The Egyptians ascribed the first turning of the Nile to their first king, Menes , of fabulous antiquity. But while it lasted in any degree, Egypt could not become barren except by miracle. Even now it recovers, whenever water is applied. \"Wherever there is water, there is fertility.\" : \"The productive powers of the soil of Egypt are incalculable. Wherever water is scattered, there springs up a rapid and beautiful vegetation. The seed is sown and watered, and scarcely any other care is requisite for the ordinary fruits of the earth. Even in spots adjacent to the desert and which seem to be taken possession of by the sands, irrigation brings rapidly forth a variety of green herbs and plants.\" For its first crop, there needed but to cast the seed, and have it trodden in by cattle .",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Nothing then could desolate Egypt, except man's abiding negligence or oppression. No passing storm or inroad could annihilate a fertility, which poured in upon it in everrenewing richness. For 1000 years, the Nile had brought to Egypt unabated richness. The Nile overflows still, but in vain amid depopulation, and grinding, uniform, oppression. Not the country is exhausted, but man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"If\" says Mengin , \"it is true that there is no country richer than Egypt in its territorial productions, still there is perhaps no one whose inhabitants are more miserable. It is owing solely to the fertility of its soil and the sobriety of its cultivators, that it retains the population which it still has.\" The marked diminution of the population had begun before the Birth of our Lord. \"Of old,\" says Diodorus , \"it far exceeded in denseness of population all the known countries in the world, and in our days too it seems to be inferior to no other. For in ancient times it had more than 18,000 considerable villages and towns, as you may see registered in the sacred lists. In the time of Ptolemy Lagus more than 30,000 were counted, a number which has continued until now. But the whole people are said of old to have been about seven million, and in our days not less than three\" .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A modern estimate supposes that Egypt, if cultivated to the utmost, would, in plentiful years, support eight million . It is difficult to calculate a population where different ranks wish to conceal it. It has been guessed however, that two centuries ago, it was four million; that, at the beginning of this century, it was two million and a half; and that, in 1845, it was 1,800,000 . The great diminution then had begun 1900 years ago. Temporary causes, plague, smallpox; conscription, have, in this last century, again halved the population; but down to that time, it had sunk to no lower level than it had already reached at least 18 centuries before. The land still, for its fruitfulness, continues to supply more than its inhabitants consume; it yields over and above cotton , for strangers to employ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet its brilliant patches of vegetation are but indications how great the powers implanted in it. In vain \"the rising Nile overflows (as it is thought) a larger proportion of the soil\"  than heretofore; in vain has the rich alluvial deposit encroached upon the gradual slope of the desert; in vain, in Upper Egypt has a third been added since about the time of the Exodus. Egypt is stricken. Canals and even arms of the Nile, were allowed to choke up. Of the seven branches of the Nile, two only, at first artificial, remain. : \"The others have either entirely disappeared or are dry in summer.\" The great eastern arm, the Pelusian, is nearly effaced  \"buried almost wholly beneath the sands of the desert.\" : \"The land at the mouth of the canal which represents it, is a sand waste or a marsh.\" : \"There is now no trace of vegetation in the whole Pelusian plain. Only one slight isolated rise has some thickets on it, and some shafts of columns lie on the sand.\" : \"In the midst of a plain the most fertile, they want the barest necessaries of life.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sand of the desert, which was checked by the river and by the reeds on its banks, has swept over lands no longer fertilized. : \"The sea has not been less destructive. It has broken down the dykes wherewith man's labor held it in, and has carried barrenness over the productive lands which it converted into lakes and marshes.\" A glance at the map of Egypt will show how widely the sea has burst in, where land once was. On the east, the salt lake Menzaleh, (itself from west-northwest to southeast about 50 miles long, and above 10 miles from north to south) absorbs two more of the ancient arms of the Nile, the Tanitic and the Mendesian . The Tanitic branch is marked by a deeper channel below the shallow waters of the lake . The lake of Burlos  \"occupies from east to west more than half the basis of the Delta.\" Further westward are a succession of lakes, Edkou, Madyeh (above 12 12 miles) Mareotis (37 12 miles). : \"The ancient Delta has lost more than half its surface, of which one-filth is covered with the waters of the lakes Mareotis, Madyeh, Edkou, Bourlos, and Menzaleh, sad effects of the carelessness of the rulers or rather spoilers of this unhappy country.\" Even when the lake Mareotis was, before the English invasion in 1801, allowed nearly to dry up, it was but an unhealthy lagoon; and the Mareotic district, once famous for its wine and its olives and papyrus , had become a desert. So far from being a source of fertility, these lakes from time to time, at the low Nile, inundate the country with salt water, and are \"surrounded by low and barren plains\" .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The ancient populousness and capabilities of the western province are attested by its ruins. : \"The ruins which the French found everywhere in the military reconnaissances of this part of Egypt attest the truth of the historical accounts of the ancient population of the Province, now deserted\" ; \"so deserted, that you can scarce tell the numbers of ruined cities frequented only by wandering Arabs.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Edom—It was subjugated by David, but revolted under Jehoram (2Ch 21:8-10); and at every subsequent opportunity tried to injure Judah. Egypt under Shishak spoiled Jerusalem under Rehoboam of the treasures of the temple and the king's house; subsequently to the captivity, it inflicted under the Ptolemies various injuries on Judea. Antiochus spoiled Egypt (Da 11:40-43). Edom was made \"desolate\" under the Maccabees [Josephus, Antiquities, 12.11,12]. The low condition of the two countries for centuries proves the truth of the prediction (compare Isa 19:1, &c.; Jer 49:17; Ob 10). So shall fare all the foes of Israel, typified by these two (Isa 63:1, &c.).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Egypt:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was in Egypt that the people of God were long kept in bondage, which defiled Israel too with its idolatries, contrived the ruin of Israel by a barbarous and unparalleled cruelty, murdering all the new-born males, and with utmost obstinacy resisted the deliverer who came to fetch Israel out of bondage. By Egypt understand we then all the enemies of the church of Christ, who carry it toward the church as Egypt carried it toward Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall be a desolation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; most desolate, when God shall judge and punish; so shall spiritual Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 11:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Edom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the posterity of Esau, of near kin to Israel according to the flesh, whose first father envied Jacob the blessing and vowed his death, and made him flee from his father’s house and become a servant in a strange land, and was the first who denied Israel a friendly passage and the common civility of necessaries for their money, and came out in hostile manner to fight them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 20:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. It was Edom of whom you read in Obadiah, a most bloody, implacable enemy to Judah in his greatest distress. And all who come under Edom’s character are here intended, and threatened under this name. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall be a desolate wilderness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " most desolate, and which art cannot repair; desolate houses or vineyards may, but wildernesses cannot, by art be repaired. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The children of Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the people of God, his churches. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They have shed innocent blood in their land; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where distressed Jews should have found safety, they met their death; in Egypt and Judea. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Egypt shall be a desolation, and Edom shall be a desolate wilderness,.... These two nations having been the implacable enemies of Israel, are here put for the future adversaries of the church of Christ, Pagan, Papal, and Mahometan; who will all be destroyed as such, and be no more: Rome is called, spiritually or mystically, Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Edom is a name that well agrees with it, it signifying \"red\", as it is with the blood of the saints: and it is common, with the Jewish writers, by Edom to understand Rome; which though it may not be true of all places they so interpret, yet is of many, and so here. Kimchi, by Egypt understands the Ishmaelites, or the Turks; and, by Edom, Rome; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the violence of the children of Judah, because they have shed innocent blood is their land; either in the land of Judah; or rather in their own land, Egypt and Edom. This respects the violences and outrages committed by the antichristian states upon the true professors of the Christian religion, the Waldenses and Albigenses, and others, whose innocent blood, in great quantities, has been spilled by them. Antichrist is represented as, drunk with the blood of the martyrs of Jesus, and in whom will be found the blood of all the prophets and saints; and for this reason ruin and destruction will come upon him and his followers, and blood will be given them to drink, for they are worthy, Revelation 17:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the violence of the children of Judah, because they have shed innocent blood is their land; either in the land of Judah; or rather in their own land, Egypt and Edom. This respects the violences and outrages committed by the antichristian states upon the true professors of the Christian religion, the Waldenses and Albigenses, and others, whose innocent blood, in great quantities, has been spilled by them. Antichrist is represented as, drunk with the blood of the martyrs of Jesus, and in whom will be found the blood of all the prophets and saints; and for this reason ruin and destruction will come upon him and his followers, and blood will be given them to drink, for they are worthy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{m} Egypt shall be a desolation, and Edom shall be a desolate wilderness, for the violence against the children of Judah, because they have shed innocent blood in their land.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Egypt shall be a desolation, and Edom shall be a desolate wilderness, for the violence ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "against",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the children of Judah, because they have shed innocent blood in their land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) The malicious enemies will have no part of these graces.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The land of Judah’s foes, on the contrary, will become a barren waste. Egypt and Edom are mentioned, probably, as typical examples of countries hostile to Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The threat in the case of Egypt is the more pointed, as it was in general well-irrigated by the waters of the Nile: it may have been perhaps suggested by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 29:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a desolate wilderness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because they have shed innocent blood in their land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The expression hardly points to blood shed in warfare, but rather to the sudden and unprovoked massacre of Jews who were settled and living peaceably in the two countries named, possibly at the time of a revolt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Egypt shall be a desolation, and Edom a desolate wilderness, for the violence against the children of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The curse of barrenness and utter desolation falls on the enemies of Judah - the nearer and the more remote - because of that very enmity and the violence which was its outcome. The Edomite enemies in the south revolted from Judah in the days of Jehoram; the Edomites compassed him in, and, by thus surrounding him, placed him in extreme peril; and though it is said he smote them, yet his expedition proved unsuccessful, for it is added by the chronicler that \"the Edomites revolted from under the hand of Judah unto this day.\" The Egyptian enemies in the more distant south made a still more formidable attack on the capital city, Jerusalem, under the famous Shishak, in the fifth year of the reign of Rehoboam, plundering the palace and temple. What acts of violence were perpetrated in these or other wars unrecorded we know not. A more specific charge follows: ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Because they have shed innocent blood in their land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is understood by some to refer to the blood of captive or fugitive Jews in the lands of their Edomite and Egyptian enemies. It seems preferable to understand the suffix answering to \"their\" of the laud of Judah, on the occasion of some hostile inroad into Jewish territory. Joel 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the other hand, the curse of desolation will fall upon Egypt and Edom, on account of the sin which they have committed upon the sons of Judah. חמס בּני, with the genitive of the object, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. This sin is then more precisely defined, as consisting in the fact that they had shed innocent blood of the sons of Judah, i.e., of the people of God, in their land ('artsâm, the land of the Egyptians and Edomites, not of the Judaeans): that is to say, in the Egypt in the olden time, more especially by the command to slay all the Hebrew boys (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and in the Edom of more recent times, probably when throwing off the dominion of Judah (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These nations and lands had both thereby become types of the power of the world in its hostility to God, in which capacity they are mentioned here, and Edom again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and 63; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 35:1-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      }
    ]
  }
]