[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Prepare war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sanctify war.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It was to be taken up deliberately, and after due religious rites, according to the customs of the nations. They are thus challenged, or rather summoned, to a trial of strength with Jehovah at a typical “Armageddon.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 3:9-10. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Proclaim ye this among the Gentiles — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“God having foretold these judgments against Tyre and Sidon, the Philistines, and the neighbouring nations, who had used the Jews with injustice and cruelty, proceeds here to confirm his people in the belief of the certainty of their destruction; which he tells them should be as sure as though they themselves had gathered them together by proclamation for it: for so are these words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Proclaim ye, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., to be understood. Not as commanding what they were actually to do, but in order to excite their attention, and to let them know that God was as certainly preparing to bring this vengeance on their enemies, as though he had actually sent messengers from the Jews to proclaim it among them:” see Chandler. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prepare war, wake up the mighty men ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Rouse and bring forward into the field your strong and valiant men. In these words the prophet, in an ironical manner, encourages them to make their utmost effort to oppose the designs of Providence; but signifies that it should be all in vain. For, should they strengthen themselves by all the means in their power, yet they should be overcome and punished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Beat your plough-shares into swords, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, make all the provision and preparation for war, or for your own defence, that you possibly can. For a people to beat their very plough-shares into swords, &c., signifies a general arming of themselves, much beyond what had been usual.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:9-17 Here is a challenge to all the enemies of God's people. There is no escaping God's judgments; hardened sinners, in that day of wrath, shall be cut off from all comfort and joy. Most of the prophets foretell the same final victory of the church of God over all that oppose it. To the wicked it will be a terrible day, but to the righteous it will be a joyful day. What cause have those who possess an interest in Christ, to glory in their Strength and their Redeemer! The acceptable year of the Lord, a day of such great favour to some, will be a day of remarkable vengeance to others: let every one that is out of Christ awake, and flee from the wrath to come.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Proclaim ye this among the Gentiles - God having before said that He would \"gather all nations,\" now, by a solemn irony, bids them prepare, if, by any means, they can fight against Him. So in Isaiah; \"Associate yourselves, O ye people, and ye shall be broken in pieces; and give ear, all ye of far countries; gird yourselves, and ye shall be broken in pieces; gird yourselves, and ye shall be broken in pieces; take counsel together, and it shall come to nought; speak the word, and it shall not stand, for God is with us\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:7-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prepare - Literally, \"hallow, war.\" To \"hallow war\" was to make it holy, either in appearance or in truth, as the prophet bade them, \"sanctify a fast,\" i. e., keep it holily. So God calls the Medes, whom He employed against Babylon, \"My sanctified ones\" Isaiah 13, and bids, \"sanctify the nations against her\" Jeremiah 51:27; and the enemies of Judah encourage themselves, \"sanctify ye war against her\" Jeremiah 6:4; and Micah says, that whosover bribed not the false prophets, \"they sanctify war against him\" Micah 3:5, i. e., proclaim war against him in the Name of God. The enemies of God, of His people, of His truth, declare war against all, in the Name of God. The Jews would have stoned our Lord for blasphemy, and, at the last, they condemned Him as guilty of it. \"He hath spoken blasphemy. What further need have we of witttesses? behold, now ye have heard His blasphemy\" Matthew 26:65. And He foretold to His disciples, \"Whosoever killeth you, will think he doeth God service\" John 16:2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Prepare - Literally, \"hallow, war.\" To \"hallow war\" was to make it holy, either in appearance or in truth, as the prophet bade them, \"sanctify a fast,\" i. e., keep it holily. So God calls the Medes, whom He employed against Babylon, \"My sanctified ones\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and bids, \"sanctify the nations against her\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the enemies of Judah encourage themselves, \"sanctify ye war against her\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Micah says, that whosover bribed not the false prophets, \"they sanctify war against him\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i. e., proclaim war against him in the Name of God. The enemies of God, of His people, of His truth, declare war against all, in the Name of God. The Jews would have stoned our Lord for blasphemy, and, at the last, they condemned Him as guilty of it. \"He hath spoken blasphemy. What further need have we of witttesses? behold, now ye have heard His blasphemy\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:65",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And He foretold to His disciples, \"Whosoever killeth you, will think he doeth God service\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Stephen was persecuted for speaking \"blasphemous words against Moses and against God, this holy place and the law\" Acts 6:11, Acts 6:13. Paul was persecuted for \"persuading people to worship God contrary to the law and polluting this holy place\" Acts 18:13; Acts 21:28; Acts 24:6. Antichrist shall set himself up as God, \"so that he, as God, sitteth in the temple of God shewing himself that he is God\" 2 Thessalonians 2:4. Heretics and unbelievers declaim against the Gospel, as though it, and not themselves, were opposed to the holiness and Majesty and love of God. The Gnostics of old spake against the Creator in the Name of God. Arians affected reverence for the glory of God , being, on their own mis-belief, idolaters or polytheists . The Apollinarians charged the Church with ascribing to our Lord a sinful soul, as though the soul must needs be such , find themselves held the Godhead to have been united to a soulless, and so a brute, nature.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Stephen was persecuted for speaking \"blasphemous words against Moses and against God, this holy place and the law\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Paul was persecuted for \"persuading people to worship God contrary to the law and polluting this holy place\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 18:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 21:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 24:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Antichrist shall set himself up as God, \"so that he, as God, sitteth in the temple of God shewing himself that he is God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Heretics and unbelievers declaim against the Gospel, as though it, and not themselves, were opposed to the holiness and Majesty and love of God. The Gnostics of old spake against the Creator in the Name of God. Arians affected reverence for the glory of God , being, on their own mis-belief, idolaters or polytheists . The Apollinarians charged the Church with ascribing to our Lord a sinful soul, as though the soul must needs be such , find themselves held the Godhead to have been united to a soulless, and so a brute, nature.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Manichaeans accused her of making God the author of evil, and themselves, as do Pantheists now, invented a god who sinned . Novatians and Donatists accused the Church of laxity. Pelagians charged her with denying the perfectibility of man's nature, themselves denying the grace whereby it is perfected. Muhammed arrayed the truth of the Unity of God against His Being in Three Persons, and fought against the truth as idolatry. Some now array \"Theism,\" i. e., truths as to God which they have stolen from Holy Scripture, against the belief in God as He has revealed Himself. Indeed, no imposture ever long held its ground against truth, unless it masked itself under some truth of God which it perverted, and so \"hallowed\" its \"war\" against God in the Name of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wake up the mighty men - Arouse them, as if their former state had been a state of sleep; arouse all their dormant powers, all within them, that they may put forth all their strength, if so be they may prevail against God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let all the men of war draw near - , as if to contend, and close, as it were, with God and His people (see 1 Samuel 17:41. 2 Samuel 10:13), as, on the other hand, God says, \"I will come near to you to judgment\" (Malachi 3:5; see Isaiah 41:1; Isaiah 50:8). \"Let them come up\" into His very presence. Even while calling them to fulfill this their vain purpose of striving with God, the prophet keeps in mind, into whose presence they are summoned, and so calls them to \"come up,\" as to a place of dignity. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Let all the men of war draw near - , as if to contend, and close, as it were, with God and His people (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as, on the other hand, God says, \"I will come near to you to judgment\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"Let them come up\" into His very presence. Even while calling them to fulfill this their vain purpose of striving with God, the prophet keeps in mind, into whose presence they are summoned, and so calls them to \"come up,\" as to a place of dignity. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. The nations hostile to Israel are summoned by Jehovah to \"come up\" (this phrase is used because Jerusalem was on a hill) against Jerusalem, not that they may destroy it, but to be destroyed by the Lord (Eze 38:7-23; Zec 12:2-9; 14:2, 3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prepare war—literally, sanctify war: because the heathen always began war with religious ceremonies. The very phrase used of Babylon's preparations against Jerusalem (Jer 6:4) is now used of the final foes of Jerusalem. As Babylon was then desired by God to advance against her for her destruction, so now all her foes, of whom Babylon was the type, are desired to advance against her for their own destruction.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proclaim; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " publish, or make known, as by sound of trumpet: some say it is an irony; I rather think it is a declaration of what is to come to pass through some ages before the coming of the Messiah, as will appear probable from what followeth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or these things, which I am purposed to do in retaliating to the enemies of my people; proclaim wars which may make captives for sale under the hand of my people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Among the Gentiles; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Assyrians, Chaldeans, Babylonians, and Grecians successively. Prepare war; make ready for wars against the enemies of my people, who shall by these be corrected, but their enemies at last shall be destroyed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wake up the mighty men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the valiant men, who dare attempt any thing, and are of great strength to execute what they attempt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let all the men of war draw near; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all the captains, and experienced soldiers, let them appear at the rendezvous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let them come up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when marshalled, let them march up on their design, toward the seat of the war, which will now for many ages be in or about the valley of vision, the church, the valley of judgment from the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Proclaim ye this among the Gentiles,.... This decree of God, concerning the deliverance of his church; and the destruction of their enemies; which is to be proclaimed among them, to the terror of them, and the comfort of God's people, encouraging them to the battle, since they might be sure of victory; for the prophet here returns to give an account of the armies to be gathered together, and to be destroyed in the valley of Jehoshaphat, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to this end heralds are here ordered to make proclamation of war throughout the nations, and to gather them to the battle of Almighty God; whether seriously, or ironically, may be considered; what follows seems to be spoken in the latter way, to the enemies of the church; though they may be interpreted as spoken seriously to the people of God themselves: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "prepare war; get all things ready for it, men and arms: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wake up the mighty men; generals, captains, and other officers, men of strength and courage; let them arouse from the sleep and lethargy in which they are, and get themselves in a readiness for war, and put themselves at the head of their troops: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let all the men of war draw near, let them come up; to the land of Judea, and to Jerusalem; that is, either the Christian powers with their armies, to defend Jerusalem against the Turks, and deliver it out of their hands; let them appear on the behalf of the Jews: or else let the enemies of Christ's church and people come up against them, even the most powerful of them; let them muster up all their forces, and do the most they can, they shall not prevail. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "let all the men of war draw near, let them come up; to the land of Judea, and to Jerusalem; that is, either the Christian powers with their armies, to defend Jerusalem against the Turks, and deliver it out of their hands; let them appear on the behalf of the Jews: or else let the enemies of Christ's church and people come up against them, even the most powerful of them; let them muster up all their forces, and do the most they can, they shall not prevail. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Proclaim ye this among the Gentiles; Prepare war, wake up the mighty men, let all the men of war draw near; let them come up:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Proclaim ye",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words are addressed to those whose duty it would be to make such a proclamation (comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e. the heralds, whom the prophet pictures as ready to carry Jehovah’s command to the nations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. the following command.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gentiles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "nations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel 3:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (twice).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "sanctify",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "consecrate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "begin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " war; the phrase having reference to the custom of opening a campaign by means of sacrifices. So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:27-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the warriors are spoken of similarly as “sanctified.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "stir up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the mighty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " men] i.e. arouse the warriors (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the inactivity of peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] with a dramatic change of person, such as the Hebrew poets love (e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let draw near, let them come up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", consists of two short words only, the second following rapidly upon the first: the concise and forcible style can be better represented in Greek or Latin (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "accedant, ascendant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), than in English.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "come up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the expression used of an attacking or invading army (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9–17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the digression on the Phoenicians and Philistines (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel 3:4-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:4-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), the thought of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel 3:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is resumed; and the description of the judgement on the nations, announced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel 3:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is continued. The heathen are invited to arm themselves, and advance for the great contest with Israel in the valley of Jehoshaphat, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel 3:9-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:9-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but once arrived there, they are annihilated, amid celestial portents, by the agents of Jehovah’s will, whom He commissions to engage with them, while His own people look on securely.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 9-17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - After a parenthesis of five verses, viz. 4-8, detailing the injurious treatment of the Jews by some of the surrounding nations, and the righteous retribution visited on those nations, the prophet resumes the subject broached at the beginning of the chapter, especially in ver. 2, about the judgment to be visited on the nations in general. The verses now before us describe very graphically the execution of that judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " pictures the proclamation and other preliminaries of war. Heralds are sent out to make proclamation among the nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Prepare",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sanctify",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "war",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "war",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Certain formalities of a religious nature were customary among the heathen when war was proclaimed and prepared for. Thus also among the Jews supplication was made and sacrifices offered, as we read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that before the battle with the Philistines at Mizpeh, the people urged Samuel to make earnest supplication and sacrifice for them, when in compliance he \"took a sucking lamb, and offered it for a burnt offering wholly unto the Lord: and Samuel cried unto the Lord for Israel;\" and thus a preparation for war was a consecration of war by religious rites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Wake up the mighty men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " according to Keil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "waken up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "arouse the mighty men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A preferable rendering, according to Wunsche, is, \"Wake up, ye mighty men;\" while he understands the whole address as directed to the covenant people. It is observable theft one manuscript has ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "העיזו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to \"make strong,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the heroes. In either case, the heroes may be conceived as enjoying peaceful repose when they are rudely roused by the declaration of war; and as the word \"war\" is indefinite through the absence of the  article, it implies, \"What a war! how great and terrible!\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let all the men of war drew near; let them come up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The terms here used are technical military terms, summoning the warriors to advance and march onward in haste to the place of conflict. Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Fulfilment of the judgment upon all the heathen predicted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare the similar prediction of judgment in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The call is addressed to all nations to equip themselves for battle, and march into the valley of Jehoshaphat to war against the people of God, but in reality to be judged by the Lord through His heavenly heroes, whom He sends down thither. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Proclaim ye this among the nations; sanctify a war, awaken the heroes, let all the men of war draw near and come up! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Forge your coulters into swords, and your vine-sickles into spears: let the weak one say, A hero am I. Joe 3:11. Hasten and come, all ye nations round about, and assemble yourselves! Let thy heroes come down thither, O Jehovah! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The nations are to rise up, and come into the valley of Jehoshaphat; for there shall I sit to judge all the heathen round about.\" The summons to prepare for war (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is addressed, not to the worshippers of Jehovah or the Israelites scattered among the heathen (Cyr., Calv., Umbreit), but to the heathen nations, though not directly to the heroes and warriors among the heathen, but to heralds, who are to listen to the divine message, and convey it to the heathen nations. This change belongs to the poetical drapery of thought, that at a sign from the Lord the heathen nations are to assemble together for war against Israel. קדּשׁ מלחמה does not mean \"to declare war\" (Hitzig), but to consecrate a war, i.e., to prepare for war by sacrifices and religious rites of consecration (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). העירוּ: waken up or arouse (not wake up) the heroes from their peaceful rest to battle. With יגּשׁוּ the address passes over from the second person to the third, which Hitzig accounts for on the ground that the words state what the heralds are to say to the nations or heroes; but the continuance of the imperative kōttū in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not suit this. This transition is a very frequent one (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and may be very simply explained from the lively nature of the description. עלה is here applied to the advance of hostile armies against a land or city. The nations are to summon up all their resources and all their strength for this war, because it will be a decisive one. They are to forge the tools of peaceful agriculture into weapons of war (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Messianic times of peace are depicted as the turning of weapons of war into instruments of agriculture). Even the weak one is to rouse himself up to be a hero, \"as is generally the case when a whole nation is seized with warlike enthusiasm\" (Hitzig). This enthusiasm is expressed still further in the appeal in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to assemble together as speedily as possible. The ἁπ. λεγ. עוּשׁ is related to חוּשׁ, to hasten; whereas no support can be found in the language to the meaning \"assemble,\" adopted by the lxx, Targ., etc. The expression כּל־הגּוים by no means necessitates our taking these words as a summons or challenge on the part of Joel to the heathen, as Hitzig does; for this can be very well interpreted as a summons, with which the nations call one another to battle, as the following ונקבּצוּ requires; and the assumption of Hitzig, Ewald, and others, that this form is the imperative for הקּבצוּ, cannot be sustained from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not till ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that Joel steps in with a prayer addressed to the Lord, that He will send down His heavenly heroes to the place to which the heathen are flowing together. Hanchath an imper. hiph., with pathach instead of tzere, on account of the guttural, from nâchath, to come down. The heroes of Jehovah are heavenly hosts, or angels, who execute His commands as gibbōrē khōăch (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This prayer is answered thus by Jehovah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Let the nations rise up, and come into the valley of Jehoshaphat, for there will He hold judgment upon them.\" יעורוּ corresponds to העירוּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and at the close, \"all the heathen round about\" is deliberately repeated. Still there is no antithesis in this to \"all nations\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as though here the judgment was simply to come upon the hostile nations in the neighbourhood of Judah, and not upon all the heathen universally (Hitzig). For even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " כל הגוים are simply all the heathen who have attacked the people of Jehovah - that is to say, all the nations round about Israel. Only these are not merely the neighbouring nations to Judah, but all heathen nations who have come into contact with the kingdom of God, i.e., all the nations of the earth without exception, inasmuch as before the last judgment the gospel of the kingdom is to be preached in all the world for a testimony to all nations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is to the last decisive judgment, in which all the single judgments find their end, that the command of Jehovah to His strong heroes refers. Joel 3:13. \"Put ye in the sickle; for the harvest is ripe: come, tread, for the win-press is full, the vats overflow: for their wickedness is great.\" The judgment is represented under the double figure of the reaping of the fields and the treading out of the grapes in the wine-press. The angels are first of all summoned to reap the ripe corn (Isaiah 17:5; Revelation 14:16), and then commanded to tread the wine-presses that are filled with grapes. The opposite opinion expressed by Hitzig, viz., that the command to tread the wine-presses is preceded by the command to cut off the grapes, is supported partly by the erroneous assertion, that bâshal is not applied to the ripening of corn, and partly upon the arbitrary assumption that qâtsı̄r, a harvest, stands for bâtsı̄r, a vintage; and maggâl, a sickle (cf. Jeremiah 50:16), for mazmērâh, a vine-dresser's bill. But bâshal does not mean \"to boil,\" either primarily or literally, but to be done, or to be ripe, like the Greek πέσσω, πέπτω, to ripen, to make soft, to boil (see at Exodus 12:9), and hence in the piel both to boil and roast, and in the hiphil to make ripe of ripen (Genesis 40:10), applied both to grapes and corn. It is impossible to infer from the fact that Isaiah (Isaiah 16:9) uses the word qâtsı̄r for the vintage, on account of the alliteration with qayits, that this is also the meaning of the word in Joel. But we have a decisive proof in the resumption of this passage in Revelation 14:15 and Revelation 14:18, where the two figures (of the corn-harvest and the gathering of the grapes) are kept quite distinct, and the clause כּי בשׁל קציר is paraphrased and explained thus: \"The time is come for thee to reap, for the harvest of the earth is ripe.\" The ripeness of the corn is a figurative representation of ripeness for judgment. Just as in the harvest - namely, at the threshing and winnowing connected with the harvest - the grains of corn are separated from the husk, the wheat being gathered into the barns, the husk blown away by the wind, and the straw burned; so will the good be separated from the wicked by the judgment, the former being gathered into the kingdom of God for the enjoyment of eternal life, - the latter, on the other hand, being given up to eternal death. The harvest field is the earth (ἡ γῆ, Revelation 14:16), i.e., the inhabitants of the earth, the human race. The ripening began at the time of the appearance of Christ upon the earth (John 4:35; Matthew 9:38). With the preaching of the gospel among all nations, the judgment of separation and decision (ἡ κρίσις, John 3:18-21) commenced; with the spread of the kingdom of Christ in the earth it passes over all nations; and it will be completed in the last judgment, on the return of Christ in glory at the end of this world. Joel does not carry out the figure of the harvest any further, but simply presents the judgment under the similar figure of the treading of the grapes that have been gathered. רדוּ, not from yârad, to descend, but from râdâh, to trample under foot, tread the press that is filled with grapes. השׁיקוּ היקבים is used in Joel 2:24 to denote the most abundant harvest; here it is figuratively employed to denote the great mass of men who are ripe for the judgment, as the explanatory clause, for \"their wicked (deed) is much,\" or \"their wickedness is great,\" which recals Genesis 6:5, clearly shows. The treading of the wine-press does not express the idea of wading in blood, or the execution of a great massacre; but in Isaiah 63:3, as well as in Revelation 14:20, it is a figure denoting an annihilating judgment upon the enemies of God and of His kingdom. The wine-press is \"the wine-press of the wrath of God,\" i.e., \"what the wine-press is to ordinary grapes, the wrath of God is to the grapes referred to here\" (Hengstenberg on Revelation 14:19).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is to the last decisive judgment, in which all the single judgments find their end, that the command of Jehovah to His strong heroes refers. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Put ye in the sickle; for the harvest is ripe: come, tread, for the win-press is full, the vats overflow: for their wickedness is great.\" The judgment is represented under the double figure of the reaping of the fields and the treading out of the grapes in the wine-press. The angels are first of all summoned to reap the ripe corn (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and then commanded to tread the wine-presses that are filled with grapes. The opposite opinion expressed by Hitzig, viz., that the command to tread the wine-presses is preceded by the command to cut off the grapes, is supported partly by the erroneous assertion, that bâshal is not applied to the ripening of corn, and partly upon the arbitrary assumption that qâtsı̄r, a harvest, stands for bâtsı̄r, a vintage; and maggâl, a sickle (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for mazmērâh, a vine-dresser's bill. But bâshal does not mean \"to boil,\" either primarily or literally, but to be done, or to be ripe, like the Greek πέσσω, πέπτω, to ripen, to make soft, to boil (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and hence in the piel both to boil and roast, and in the hiphil to make ripe of ripen (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 40:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), applied both to grapes and corn. It is impossible to infer from the fact that Isaiah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") uses the word qâtsı̄r for the vintage, on account of the alliteration with qayits, that this is also the meaning of the word in Joel. But we have a decisive proof in the resumption of this passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the two figures (of the corn-harvest and the gathering of the grapes) are kept quite distinct, and the clause כּי בשׁל קציר is paraphrased and explained thus: \"The time is come for thee to reap, for the harvest of the earth is ripe.\" The ripeness of the corn is a figurative representation of ripeness for judgment. Just as in the harvest - namely, at the threshing and winnowing connected with the harvest - the grains of corn are separated from the husk, the wheat being gathered into the barns, the husk blown away by the wind, and the straw burned; so will the good be separated from the wicked by the judgment, the former being gathered into the kingdom of God for the enjoyment of eternal life, - the latter, on the other hand, being given up to eternal death. The harvest field is the earth (ἡ γῆ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., the inhabitants of the earth, the human race. The ripening began at the time of the appearance of Christ upon the earth (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). With the preaching of the gospel among all nations, the judgment of separation and decision (ἡ κρίσις, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:18-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") commenced; with the spread of the kingdom of Christ in the earth it passes over all nations; and it will be completed in the last judgment, on the return of Christ in glory at the end of this world. Joel does not carry out the figure of the harvest any further, but simply presents the judgment under the similar figure of the treading of the grapes that have been gathered. רדוּ, not from yârad, to descend, but from râdâh, to trample under foot, tread the press that is filled with grapes. השׁיקוּ היקבים is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to denote the most abundant harvest; here it is figuratively employed to denote the great mass of men who are ripe for the judgment, as the explanatory clause, for \"their wicked (deed) is much,\" or \"their wickedness is great,\" which recals ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", clearly shows. The treading of the wine-press does not express the idea of wading in blood, or the execution of a great massacre; but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as well as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is a figure denoting an annihilating judgment upon the enemies of God and of His kingdom. The wine-press is \"the wine-press of the wrath of God,\" i.e., \"what the wine-press is to ordinary grapes, the wrath of God is to the grapes referred to here\" (Hengstenberg on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The execution of this divine command is not expressly mentioned, but in Joel 3:14. the judgment is simply depicted thus: first of all we have a description of the streaming of the nations into the valley of judgment, and then of the appearance of Jehovah upon Zion in the terrible glory of the Judge of the world, and as the refuge of His people. Joel 3:14. \"Tumult, tumult in the valley of decision: for the day of Jehovah is near in the valley of decision.\" Hămōnı̄m are noisy crowds, whom the prophet sees in the Spirit pouring into the valley of Jehoshaphat. The repetition of the word is expressive of the great multitude, as in 2 Kings 3:16. עמק החרוּץ not valley of threshing; for though chârūts is used in Isaiah 28:27 and Isaiah 41:15 for the threshing-sledge, it is not used for the threshing itself, but valley of the deciding judgment, from chârats, to decide, to determine irrevocably (Isaiah 10:22; 1 Kings 20:40), so that chârūts simply defines the name Jehoshaphat with greater precision. כּי קרוב וגו (compare Joel 1:15; Joel 2:1) is used here to denote the immediate proximity of the judgment, which bursts at once, according to Joel 3:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The execution of this divine command is not expressly mentioned, but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". the judgment is simply depicted thus: first of all we have a description of the streaming of the nations into the valley of judgment, and then of the appearance of Jehovah upon Zion in the terrible glory of the Judge of the world, and as the refuge of His people. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Tumult, tumult in the valley of decision: for the day of Jehovah is near in the valley of decision.\" Hămōnı̄m are noisy crowds, whom the prophet sees in the Spirit pouring into the valley of Jehoshaphat. The repetition of the word is expressive of the great multitude, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". עמק החרוּץ not valley of threshing; for though chârūts is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the threshing-sledge, it is not used for the threshing itself, but valley of the deciding judgment, from chârats, to decide, to determine irrevocably (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 20:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that chârūts simply defines the name Jehoshaphat with greater precision. כּי קרוב וגו (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is used here to denote the immediate proximity of the judgment, which bursts at once, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]