[{"header":"The Great Faith of God’s People"},{"num":11,"verse":"Faith makes us sure of what we hope for and gives us proof of what we cannot see. "},{"num":2,"verse":"It was their faith that made our ancestors pleasing to God."},{"num":3,"verse":"Because of our faith, we know that the world was made at God’s command. We also know that what can be seen was made out of what cannot be seen."},{"num":4,"verse":"Because Abel had faith, he offered God a better sacrifice than Cain did. God was pleased with him and his gift, and even though Abel is now dead, his faith still speaks for him."},{"num":5,"verse":"Enoch had faith and did not die. He pleased God, and God took him up to heaven. That’s why his body was never found. "},{"num":6,"verse":"But without faith no one can please God. We must believe that God is real and that he rewards everyone who searches for him."},{"num":7,"verse":"Because Noah had faith, he was warned about something that had not yet happened. He obeyed and built a boat that saved him and his family. In this way the people of the world were judged, and Noah was given the blessings that come to everyone who pleases God."},{"num":8,"verse":"Abraham had faith and obeyed God. He was told to go to the land that God had said would be his, and he left for a country he had never seen. "},{"num":9,"verse":"Because Abraham had faith, he lived as a stranger in the promised land. He lived there in a tent, and so did Isaac and Jacob, who were later given the same promise. "},{"num":10,"verse":"Abraham did this, because he was waiting for the eternal city that God had planned and built."},{"num":11,"verse":"Even when Sarah was too old to have children, she had faith that God would do what he had promised, and she had a son. "},{"num":12,"verse":"Her husband Abraham was almost dead, but he became the ancestor of many people. In fact, there are as many of them as there are stars in the sky or grains of sand along the beach."},{"num":13,"verse":"Every one of those people died. But they still had faith, even though they had not received what they had been promised. They were glad just to see these things from far away, and they agreed that they were only strangers and foreigners on this earth. "},{"num":14,"verse":"When people talk this way, it is clear that they are looking for a place to call their own. "},{"num":15,"verse":"If they had been talking about the land where they had once lived, they could have gone back at any time. "},{"num":16,"verse":"But they were looking forward to a better home in heaven. That’s why God wasn’t ashamed for them to call him their God. He even built a city for them."},{"num":17,"verse":"Abraham had been promised that Isaac, his only son, would continue his family. But when Abraham was tested, he had faith and was willing to sacrifice Isaac, "},{"num":19,"verse":"because he was sure that God could raise people to life. This was just like getting Isaac back from death."},{"num":20,"verse":"Isaac had faith, and he promised blessings to Jacob and Esau. "},{"num":21,"verse":"Later, when Jacob was about to die, he leaned on his walking stick and worshiped. Then because of his faith he blessed each of Joseph’s sons. "},{"num":22,"verse":"And right before Joseph died, he had faith that God would lead the people of Israel out of Egypt. So he told them to take his bones with them."},{"num":23,"verse":"Because Moses' parents had faith, they kept him hidden until he was three months old. They saw that he was a beautiful child, and they were not afraid to disobey the king’s orders. "},{"num":24,"verse":"Then after Moses grew up, his faith made him refuse to be called Pharaoh’s grandson. "},{"num":25,"verse":"He chose to be mistreated with God’s people instead of having the good time that sin could bring for a little while. "},{"num":26,"verse":"Moses knew that the treasures of Egypt were not as wonderful as what he would receive from suffering for the Messiah, and he looked forward to his reward."},{"num":27,"verse":"Because of his faith, Moses left Egypt. Moses had seen the invisible God and wasn’t afraid of the king’s anger. "},{"num":28,"verse":"His faith also made him celebrate Passover. He sprinkled the blood of animals on the doorposts, so that the first-born sons of the people of Israel would not be killed by the destroying angel."},{"num":29,"verse":"Because of their faith, the people walked through the Red Sea on dry land. But when the Egyptians tried to do it, they were drowned."},{"num":30,"verse":"God’s people had faith, and when they had walked around the city of Jericho for seven days, its walls fell down."},{"num":31,"verse":"Rahab had been a prostitute, but she had faith and welcomed the spies. So she wasn’t killed with the people who disobeyed."},{"num":32,"verse":"What else can I say? There isn’t enough time to tell about Gideon, Barak, Samson, Jephthah, David, Samuel, and the prophets. "},{"num":33,"verse":"Their faith helped them conquer kingdoms, and because they did right, God made promises to them. They closed the jaws of lions "},{"num":34,"verse":"and put out raging fires and escaped from the swords of their enemies. Although they were weak, they were given the strength and power to chase foreign armies away."},{"num":35,"verse":"Some women received their loved ones back from death. Many of these people were tortured, but they refused to be released. They were sure that they would get a better reward when the dead are raised to life. "},{"num":36,"verse":"Others were made fun of and beaten with whips, and some were chained in jail. "},{"num":37,"verse":"Still others were stoned to death or sawed in two or killed with swords. Some had nothing but sheep skins or goat skins to wear. They were poor, mistreated, and tortured. "},{"num":38,"verse":"The world did not deserve these good people, who had to wander in deserts and on mountains and had to live in caves and holes in the ground."},{"num":39,"verse":"All of them pleased God because of their faith! But still they died without being given what had been promised. "},{"num":40,"verse":"This was because God had something better in store for us. And he did not want them to reach the goal of their faith without us."}]