[{"num":2,"verse":"And I raised mine eyes, and saw, and lo! a man, and lo! in his hand, a little cord of meters. (And I raised up my eyes, and saw, and lo! a man, and lo! in his hand, a little measuring cord.)"},{"num":2,"verse":"And I said, Whither goest thou? And he said to me, That I mete Jerusalem, and Judah; (to see) how much is the breadth thereof, and how much is the length thereof. (And I said, Where goest thou? And he said to me, So that I can measure Jerusalem, and Judah; to see how much is its breadth, and how much is its length.)"},{"num":3,"verse":"And lo! the angel that spake in me, went out, and another angel went out into the meeting of him, (And lo! the angel who spoke to me, went out, and another angel went out to meet him,)"},{"num":4,"verse":"and said to him, Run thou, speak to this young man, and say thou, Jerusalem shall be inhabited without wall, for the multitude of men and beasts in the middle thereof. (and said to him, Run thou, speak to this young man, and say thou, Jerusalem shall be inhabited like a city without walls, for the multitude of the people and of the beasts in its midst.)"},{"num":5,"verse":"And I shall be to it, saith the Lord, a wall of fire in compass; and I shall be in glory in [the] middle thereof. (And I shall be to it, saith the Lord, a wall of fire all around it; and I shall also be the glory in its midst.)"},{"num":6,"verse":"A! A! A! flee ye from the land of the north, saith the Lord, for in four winds of heaven I scattered you, saith the Lord. (O! O! O! flee ye from the land of the north, saith the Lord, for by the four winds of the heavens I have scattered you, saith the Lord.)"},{"num":7,"verse":"A! thou Zion, flee, that dwellest at the daughter of Babylon. (O! thou Zion, flee, thou who livest in Babylon.)"},{"num":8,"verse":"For the Lord of hosts saith these things, After glory he sent me to heathen men, which robbed you; for he that shall touch you, shall touch the apple of mine eye. (For the Lord of hosts saith these things, After the glory he hath sent me to the heathen, who robbed you; for he who toucheth you, toucheth the apple of my eye.)"},{"num":9,"verse":"For lo! I raise mine hand on them, and they shall be preys to these that served them; and ye shall know, that the Lord of hosts sent me. (For lo! I shall raise my hand against them, and they shall be prey for those who served them; and then ye shall know, that the Lord of hosts hath sent me.)"},{"num":10,"verse":"Daughter of Zion, praise thou, and be glad; for lo! I come, and I shall dwell in [the] middle of thee, saith the Lord. (Daughter of Zion, praise thou, and be happy; for lo! I come, and I shall live in thy midst, saith the Lord.)"},{"num":11,"verse":"And many folks shall be joined to the Lord in that day, and they shall be to me into a people, and I shall dwell in the middle of thee; and thou shalt know that the Lord of hosts sent me to thee. (And many nations shall join the Lord on that day, and they shall be his people, and he shall live in their midst; and then thou shalt know that the Lord of hosts hath sent me to thee.)"},{"num":12,"verse":"And the Lord shall wield Judah into his part, in the land hallowed, and shall choose yet Jerusalem. (And the Lord shall take Judah for his portion, in the hallowed, or in the consecrated, land, and shall once again choose Jerusalem.)"},{"num":13,"verse":"Each flesh be still from the face of the Lord, for he rose of his holy dwelling place. (Each person be still before the face of the Lord, for he hath risen up from his holy dwelling place.)"}]