[{"header":"The Queen of Sheba Visits Solomon"},{"num":10,"verse":"The Queen of Sheba heard about Solomon’s fame, which was connected with the fame of the Lord, so she came to test him with hard questions. "},{"num":2,"verse":"She came to Jerusalem with a very great entourage—with camels carrying spices and a large quantity of gold and precious stones. She came to Solomon and told him everything that was on her heart."},{"num":3,"verse":"Solomon answered all her questions. There was nothing hidden from the king that he could not explain to her."},{"num":4,"verse":"The Queen of Sheba saw all the wisdom of Solomon, the house which he built, "},{"num":5,"verse":"and the food on his table. When she saw the council meeting of his officials, the careful attention of his ministers, as well as their attire, his cupbearers, and the whole burnt offerings which he offered at the House of the Lord, it took her breath away."},{"num":6,"verse":"She said to the king, “The report I heard in my own country about your accomplishments and your wisdom is true. "},{"num":7,"verse":"I did not believe the report until I came and saw it with my own eyes. The truth is, not even half of it was told to me! Your wisdom and wealth surpass the report which I heard. "},{"num":8,"verse":"Blessed are your men, blessed are your servants, who stand before you continually hearing your wisdom! "},{"num":9,"verse":"May the Lord your God be blessed, who was pleased to put you on the throne of Israel. Because the Lord loves Israel forever, he made you king to administer justice and righteousness.”"},{"num":10,"verse":"Then she gave the king one hundred twenty talents of gold and a great quantity of spices and many precious stones. There was never again anything comparable to the huge amount of spices and incense which the Queen of Sheba gave to King Solomon."},{"num":11,"verse":"In addition, Hiram’s fleet brought gold from Ophir and a great quantity of almug wood and also precious stones. "},{"num":12,"verse":"The king made the almug wood into steps for the Lord’s house and for the house of the king, as well as lyres and harps for his singers. So much fine almug wood has never been brought or seen to this present day."},{"num":13,"verse":"King Solomon gave to the Queen of Sheba all she desired, whatever she asked for, besides what he had given to her from his royal resources. Then she and her servants returned to her country."},{"header":"Solomon’s Wealth and Glory"},{"num":14,"verse":"The weight of gold which came to Solomon in one year was six hundred sixty-six talents, "},{"num":15,"verse":"not counting what he collected from merchants and traders and from all the Arabian kings and the governors of the land."},{"num":16,"verse":"King Solomon made two hundred large shields of hammered gold. He put seven and a half pounds of gold into each large shield. "},{"num":17,"verse":"He also made three hundred small shields of hammered gold. He put almost four pounds of gold into each small shield. The king put them in the House of the Forest of Lebanon."},{"num":18,"verse":"The king made a large ivory throne and overlaid it with fine gold. "},{"num":19,"verse":"There were six steps to the throne. The throne had a rounded back and armrests on either side of the seat. Two lions were standing beside the armrests. "},{"num":20,"verse":"Twelve lions were standing on the steps, one on each end of each step. Nothing like it had ever been made for any kingdom."},{"num":21,"verse":"All of Solomon’s drinking vessels were gold, and all of the utensils in the House of the Forest of Lebanon were pure gold. No silver was used, because it was considered of little value in Solomon’s days, "},{"num":22,"verse":"because Solomon’s merchant fleet was at sea with Hiram’s fleet, and once every three years the fleet returned, carrying gold and silver, ivory, monkeys, and peacocks."},{"num":23,"verse":"King Solomon was greater than all the kings of the earth in wealth and wisdom. "},{"num":24,"verse":"The whole world sought an audience with Solomon to hear the wisdom which God put in his heart. "},{"num":25,"verse":"They each brought gifts: articles of gold and silver, clothing, scents, spices, horses and mules, year after year."},{"num":26,"verse":"Solomon accumulated chariots and charioteers until he had fourteen hundred chariots and twelve thousand charioteers. He stationed them in the chariot cities and with the king in Jerusalem. "},{"num":27,"verse":"The king made silver as plentiful as stone in Jerusalem and cedar wood as abundant as sycamore trees in the Shephelah. "},{"num":28,"verse":"Solomon’s horses were imported from Egypt and from Kue. The king’s dealers bought them from Kue for the market price. "},{"num":29,"verse":"A chariot could be imported from Egypt for six hundred silver shekels and a horse for one hundred fifty. In this same way they were exported to all the kings of the Hittites and the kings of Aram."}]