[{"header":"The Queen of Sheba Visits Solomon"},{"num":10,"verse":"The queen of Sheba heard about how famous Solomon was. She also heard about how he served and worshiped the Lord. So she came to test Solomon with hard questions. "},{"num":2,"verse":"She arrived in Jerusalem with a very large group of attendants. Her camels were carrying spices, huge amounts of gold, and valuable jewels. She came to Solomon and asked him about everything she wanted to know. "},{"num":3,"verse":"Solomon answered all her questions. There wasn’t anything too hard for the king to explain to her. "},{"num":4,"verse":"So the queen of Sheba saw how very wise Solomon was. She saw the palace he had built. "},{"num":5,"verse":"She saw the food on his table. She saw his officials sitting there. She saw the robes of the servants who waited on everyone. She saw his wine tasters. And she saw the burnt offerings Solomon sacrificed at the Lord’s temple. She could hardly believe everything she had seen."},{"num":6,"verse":"She said to the king, “Back in my own country I heard a report about you. I heard about how much you had accomplished. I also heard about how wise you are. Everything I heard is true. "},{"num":7,"verse":"But I didn’t believe those things. So I came to see for myself. And now I believe it! You are twice as wise and wealthy as people say you are. The report I heard doesn’t even begin to tell the whole story about you. "},{"num":8,"verse":"How happy your people must be! How happy your officials must be! They always get to serve you and hear the wise things you say. "},{"num":9,"verse":"May the Lord your God be praised. He takes great delight in you. He placed you on the throne of Israel. The Lord will love Israel for all time to come. That’s why he has made you king. He knows that you will do what is fair and right.”"},{"num":10,"verse":"She gave the king four and a half tons of gold. She also gave him huge amounts of spices and valuable jewels. No one would ever bring to King Solomon as many spices as the queen of Sheba gave him."},{"num":11,"verse":"Hiram’s ships brought gold from Ophir. From there they also brought huge amounts of almugwood and valuable jewels. "},{"num":12,"verse":"The king used the almugwood to make supports for the Lord’s temple and the royal palace. He also used it to make harps and lyres for those who played the music. That much almugwood has never been brought into Judah or seen there since that day."},{"num":13,"verse":"King Solomon gave the queen of Sheba everything she wanted and asked for. That was in addition to what he had given her out of his royal riches. Then she left. She returned to her own country with her attendants."},{"header":"Solomon’s Greatness"},{"num":14,"verse":"Each year Solomon received 25 tons of gold. "},{"num":15,"verse":"That didn’t include the money brought in by business and trade. It also didn’t include the money from all the kings of Arabia and the governors of the territories."},{"num":16,"verse":"King Solomon made 200 large shields out of hammered gold. Each one weighed 15 pounds. "},{"num":17,"verse":"He also made 300 small shields out of hammered gold. Each one weighed seven and a half pounds. The king put all the shields in the Palace of the Forest of Lebanon."},{"num":18,"verse":"Then he made a large throne. It was covered with ivory. And that was covered with fine gold. "},{"num":19,"verse":"The throne had six steps. Its back had a rounded top. The throne had armrests on both sides of the seat. A statue of a lion stood on each side of the throne. "},{"num":20,"verse":"Twelve lions stood on the six steps. There was one at each end of each step. Nothing like that throne had ever been made for any other kingdom. "},{"num":21,"verse":"All of King Solomon’s cups were made out of gold. All the things used in the Palace of the Forest of Lebanon were made out of pure gold. Nothing was made out of silver. When Solomon was king, silver wasn’t considered to be worth very much. "},{"num":22,"verse":"He had many ships that carried goods to be traded. His ships went to sea along with Hiram’s ships. Once every three years the ships returned. They brought gold, silver, ivory, apes and peacocks."},{"num":23,"verse":"King Solomon was richer than all the other kings on earth. He was also wiser than they were. "},{"num":24,"verse":"People from the whole world wanted to meet Solomon in person. They wanted to see for themselves how wise God had made him. "},{"num":25,"verse":"Year after year, everyone who came to him brought a gift. They brought gifts made out of silver and gold. They brought robes, weapons and spices. They also brought horses and mules."},{"num":26,"verse":"Solomon had 1,400 chariots and 12,000 horses. He kept some of his horses and chariots in the chariot cities. He kept the others with him in Jerusalem. "},{"num":27,"verse":"The king made silver as common in Jerusalem as stones. He made cedar wood as common there as sycamore-fig trees in the western hills. "},{"num":28,"verse":"Solomon got horses from Egypt and from Kue. The royal traders bought them from Kue at the current price. "},{"num":29,"verse":"They weighed out 15 pounds of silver for a chariot from Egypt. And they weighed out almost four pounds of silver for a horse. They also sold horses and chariots to all the kings of the Hittites and the kings of the Arameans."}]