[{"num":10,"verse":"The queen of Sheba was fascinated when she heard about the famous Solomon and his devotion to the name of the Eternal One. She traveled a long way to meet him and to challenge him with her difficult questions. "},{"num":2,"verse":"She arrived in Jerusalem accompanied by many advisors, assistants, and camels carrying spices and a lot of gold and rare jewels. When she met Solomon, she asked him about everything she could think of."},{"num":3,"verse":"Solomon gave her an answer to every question. The king knew all the answers, and he explained all she asked. "},{"num":4,"verse":"When the queen recognized Solomon’s wisdom and observed the palace he had envisioned and constructed, "},{"num":5,"verse":"the food on his table, the orderly arrangement of his servants, the attentive service and fine dress of his waiters, his wine servers, and the beautiful stairway that led up to the Eternal’s temple, she was in complete awe."},{"num":10,"verse":"The queen then presented Solomon with 9,000 pounds of gold and a large gift of spices and rare jewels. No other gift of spices given to the king ever compared to the gift the queen of Sheba gave to King Solomon. "},{"num":13,"verse":"King Solomon granted the queen of Sheba everything her heart desired (besides the usual royal gift). She then departed and returned to her own country with all those who were in her service."},{"num":11,"verse":"Hiram’s ships—the ones that transported all the gold from Ophir—also transported a large amount of almug trees and rare jewels. "},{"num":12,"verse":"The king transformed the almug trees into steps for the Eternal’s temple and the palace. He also made lyres and harps for the musicians. Almug trees like these had never before entered Israel, and they never have since."},{"num":14,"verse":"Solomon received 25 tons of gold each year. "},{"num":15,"verse":"This amount does not include the amount of gold received through taxation of explorers, traders, and merchants and revenue from the Arab kings and provincial governors. "},{"num":16,"verse":"King Solomon crafted 200 large shields, each made from 7½ pounds of hammered gold. "},{"num":17,"verse":"Then he crafted 300 shields made from 60 ounces of hammered gold. He kept them in the house of the forest of Lebanon. "},{"num":18,"verse":"He also crafted an ivory throne and covered it with the purest gold. "},{"num":19,"verse":"There were 6 steps leading up to the throne. The back of the throne was rounded, and a lion stood next to each armrest. "},{"num":20,"verse":"There were 12 lions on the 6 steps: 6 lions on one side and 6 on the other. Nothing anywhere in the world compared to it. "},{"num":21,"verse":"All of King Solomon’s cups were made out of gold, and all the cups in the house of the forest of Lebanon were made out of the purest gold as well. Nothing was crafted out of silver because silver was worthless during that time. "},{"num":22,"verse":"Tarshish’s ships and Hiram’s ships were out at sea under the rule of Solomon. Tarshish’s ships brought gold, silver, ivory, apes, and peacocks to Solomon once every 3 years."},{"num":23,"verse":"King Solomon became mightier than any other king in the entire world. He was wealthy in material and in wisdom. "},{"num":24,"verse":"People from around the world wanted to meet the famous Solomon. They desired to learn the wisdom God had planted in his heart. "},{"num":25,"verse":"They brought gifts—silver, gold, clothing, weapons, spices, horses, and mules. The gifts accumulated as the years passed."},{"num":26,"verse":"Solomon summoned his chariots and cavalrymen. He commanded 1,400 chariots and 12,000 cavalrymen, and he sent them to the appointed cities (known as chariot cities) or to guard Jerusalem’s king. "},{"num":27,"verse":"The king had made silver as common as stones are in Jerusalem, and he made cedars as common as sycamore trees are in the foothills. "},{"num":28,"verse":"Solomon brought his horses from Egypt and Kue, and the king’s businessmen paid the people of Kue for the horses. "},{"num":29,"verse":"One chariot was bought from Egypt for 15 pounds of silver, and one horse was bought for 60 ounces of silver. Some chariots and horses were then exported to the Hittite and Aramean kings along the route from Kue back to Israel."}]