[{"num":10,"verse":"But also the queen of Sheba, when the fame of Solomon was heard, came in the name of the Lord to assay him in dark and doubtful questions. (And the queen of Sheba, when she heard of Solomon’s fame, regarding his knowledge concerning the name of the Lord, came to test him with dark and doubtful questions.)"},{"num":2,"verse":"And she entered with much fellowship and riches into Jerusalem, and with camels bearing sweet smelling things, and gold greatly without number, and precious stones; and she came to king Solomon, and spake to him all things which she had in her heart."},{"num":3,"verse":"And Solomon taught her all [the] words which she had put forth; no word was, that might be hid from the king, and which he answered not to her. (And Solomon taught her all the things that she asked him about; there was nothing that was hid from the king, and which he did not answer to her, or share with her.)"},{"num":4,"verse":"And the queen of Sheba saw all the wisdom of Solomon, and the house that he had builded,"},{"num":5,"verse":"and the meats of his table (and the food on his table), and the dwelling places of his servants, and the orders of the men serving him, and the clothes of them, and the butlers, and the burnt sacrifices which he offered in the house of the Lord; and she had no more spirit."},{"num":6,"verse":"And she said to the king, The word is true, that I heard in my land, of thy words, and of thy wisdom;"},{"num":7,"verse":"and I believed not to men telling to me, till I myself came, and saw with mine eyes, and proved that the half part was not told to me; thy wisdom is more and thy works, than the fame that I heard. (and I did not believe what they told me, until I came myself, and saw with my eyes, and proved that the half part was not told to me; thy wisdom and thy works be more than the reports that I have heard.)"},{"num":8,"verse":"Thy men be blessed, and thy servants be blessed, these that stand before thee ever[more] (those who stand before thee forevermore), and hear thy wisdom."},{"num":9,"verse":"Blessed be thy Lord God, whom thou pleasedest, and hath set thee on the throne of Israel; for the Lord loved Israel without end, and hath ordained thee king, that thou shouldest do doom and rightfulness (so that thou can give judgement and show uprightness)."},{"num":10,"verse":"Therefore she gave to the king sixscore talents of gold, and full many sweet smelling things, and precious stones; so many sweet smelling things were no more brought (there were never brought there again so many sweet smelling things), as those which the queen of Sheba gave to king Solomon."},{"num":11,"verse":"But also the ship(s) of Hiram, that brought gold from Ophir, brought from Ophir full many trees of thyine, and precious stones. (And the ships of Hiram, that brought gold from Ophir, also brought from Ophir a great deal of thyine wood, and precious stones.)"},{"num":12,"verse":"And king Solomon made of the trees of thyine undersettings of the house of the Lord, and of the king’s house, and harps, and citoles to singers; such (fine) trees of thyine were not brought (there), neither seen (again), till into this present day. (And King Solomon made from the thyine wood undersettings for the House of the Lord, and for the king’s house, and harps and lutes for the singers; there was never such fine thyine wood brought there, nor seen again, unto this present day.)"},{"num":13,"verse":"Soothly king Solomon gave to the queen of Sheba all things which she would have, and asked of him, besides these things which he had given to her by the king’s gift willfully; and she turned again, and went into her land with her servants. (And King Solomon gave the queen of Sheba everything that she desired, and asked for from him, besides those things which he had willingly, or freely, given to her by the king’s gift; and then she returned, and went back to her land with her servants.)"},{"num":14,"verse":"Forsooth the weight of gold, that was offered to Solomon by each year, was of six hundred and six and sixty talents of gold,"},{"num":15,"verse":"besides that which the men that were on the tollages, that is, rents of things borne about in the land (that is, the rents for things borne about in the land), and that (the) merchants, and all men selling shields, and that all the kings of Arabia, and the dukes of the land, gave."},{"num":16,"verse":"And king Solomon made two hundred shields of purest gold; he gave six hundred shekels of gold into the plates of one shield (he gave six hundred shekels of gold to make the plates for one shield);"},{"num":17,"verse":"and he made three hundred bucklers of proved gold; three hundred talents of gold covered one buckler (three pounds of gold covered one buckler). And the king put those bucklers in the house of the forest of Lebanon."},{"num":18,"verse":"Also king Solomon made a great throne of ivory, and covered it with full fine gold;"},{"num":19,"verse":"and the throne had six degrees; and the highness of the throne was round in the hinder part (and the throne had six steps; and the top of the throne was round on the back part); and twain hands were on this side and on that side, holding the seat, and two lions stood beside each hand;"},{"num":20,"verse":"and twelve little lions standing on [the] six degrees, (and twelve little lions standing on the six steps), on this side and on that side; such a work was not made in all realms."},{"num":21,"verse":"But also all the vessels, of which king Solomon drank, were of gold, and all the purtenance of the house of the forest of Lebanon was of purest gold; silver was not (used at all), neither it was areckoned of any price in the days of Solomon."},{"num":22,"verse":"For the ship(s) of the king went once by three years with the ship(s) of Hiram into Tharshish, and brought (back) from thence gold, and silver, and teeth of elephants, and apes, and peacocks."},{"num":23,"verse":"Therefore king Solomon was magnified above all [the] kings of [the] earth in riches and wisdom."},{"num":24,"verse":"And all earth desired to see the cheer of Solomon, to hear the wisdom of him, which wisdom God had given in his heart. (And the whole earth desired to come see Solomon’s face, to hear his wisdom, which wisdom God had placed in his heart.)"},{"num":25,"verse":"And all men brought gifts to him, vessels of gold, and of silver, clothes, and armours of battle (and arms, or weapons, of battle), and sweet smelling things, and horses, and mules, by each year."},{"num":26,"verse":"And Solomon gathered together chariots, and horsemen; and a thousand and four hundred chariots were made to him, and twelve thousand horsemen; and he disposed them by [the] strengthened cities, and with the king in Jerusalem. (And Solomon gathered together chariots, and horsemen; and a thousand and four hundred chariots were made for him, and he had twelve thousand horsemen; and he stationed them in the fortified cities, and with the king himself in Jerusalem.)"},{"num":27,"verse":"And he made, that so great abundance of silver was in Jerusalem, (as) how great was also (that) of (the) stones; and he gave the multitude of cedars as (the) sycamores, that grow in field places (and he made cedars to be like the multitude of sycamores, which grow in the fields)."},{"num":28,"verse":"And the horses of Solomon were led out of Egypt, and (out) of Coa; for (the) merchants of the king bought them of Coa, and brought them to him, for [the] price ordained. (And Solomon’s horses were brought out of Egypt, and out of Coa; for the king’s merchants bought them in Coa, and then brought them to him, for the ordained price.)"},{"num":29,"verse":"For a chariot went out of Egypt for six hundred shekels of silver, and an horse for an hundred and fifty shekels; and by this manner all the kings of Hittites, and of Syria, sold horses."}]