[{"header":"Further Stops on David’s Flight"},{"num":22,"verse":"So David departed from there and escaped to the cave at Adullam. When his brothers and his father’s entire household heard about it, they went down to join him there. "},{"num":2,"verse":"Everyone who was in distress, everyone who was in debt, and everyone who was discontented gathered around him, and he became their commander. There were about four hundred men with him."},{"num":3,"verse":"David went from there to Mizpah in Moab, and he said to the king of Moab, “Please let my father and mother come and stay with you, until I find out what God will do for me.” "},{"num":4,"verse":"So he brought them to the king of Moab, and they stayed with him the whole time that David was in the stronghold."},{"num":5,"verse":"The prophet Gad said to David, “Do not stay in the stronghold. Leave and go to the land of Judah.” So David left and went to the Forest of Hereth."},{"header":"The Massacre of the Priests"},{"num":6,"verse":"Saul heard that David and the men with him had been located."},{"num":7,"verse":"Saul said to his attendants who were standing around him, “Listen, you Benjaminites! Will the son of Jesse give every one of you fields and vineyards? Will he make you all officers over thousands and officers over hundreds? "},{"num":8,"verse":"So why have all of you conspired against me? Why is there no one who informs me when my son makes a covenant with the son of Jesse? Why is there not one of you who sympathizes with me or informs me that my son has stirred up my servant against me, so that he is waiting to ambush me, as he is today?”"},{"num":9,"verse":"Then Doeg the Edomite, who was standing beside Saul’s attendants, replied, “I saw the son of Jesse come to Ahimelek son of Ahitub at Nob. "},{"num":10,"verse":"The priest inquired of the Lord for him and gave him supplies and the sword of Goliath the Philistine.”"},{"num":11,"verse":"Then the king summoned the priest, Ahimelek son of Ahitub, along with all of his father’s house, that is, all the priests who were in Nob, and all of them came to the king. "},{"num":12,"verse":"Saul said, “Listen, you son of Ahitub.”"},{"num":13,"verse":"Saul said to him, “Why have you conspired against me, you and the son of Jesse, by giving him bread and a sword and inquiring of God for him, so that he can rise up against me and lie in ambush, as he is doing today?”"},{"num":14,"verse":"Then Ahimelek answered the king, “Who among all your servants is as faithful as David? He is the king’s son-in-law, the head of your elite troops, and is honored in your house. "},{"num":15,"verse":"Have I just begun to inquire of God for him today? Certainly not! The king should not charge anything against his servant or against all the house of my father, for your servant knows nothing at all about this matter, in whole or in part.”"},{"num":16,"verse":"The king said, “You shall certainly die, Ahimelek, you and all your father’s house.” "},{"num":17,"verse":"Then the king said to the bodyguards who were standing around him, “Turn and kill the priests of the Lord, because their hand too is with David. They knew that he was fleeing, but they did not inform me.”"},{"num":18,"verse":"The king said to Doeg, “You turn and attack the priests!”"},{"num":19,"verse":"He struck Nob, the city of the priests, with the edge of the sword, both men and women, children and nursing babies, as well as cattle, donkeys, and sheep—all of them with the edge of the sword. "},{"num":20,"verse":"But one of the sons of Ahimelek son of Ahitub, whose name was Abiathar, escaped and fled to David."},{"num":21,"verse":"Abiathar told David that Saul had killed the Lord’s priests."},{"num":22,"verse":"David said to Abiathar, “On that day when Doeg the Edomite was present, I knew without a doubt that he would tell Saul. I am responsible for the death of all the members of your father’s house. "},{"num":23,"verse":"Stay with me. Do not be afraid, for the one who seeks my life also seeks your life. You will be safe with me.”"}]