[{"header":"Flight to a Cave and to Moab"},{"num":22,"verse":"So David walked from there and escaped to the cave of Adullam. When his brothers and all his father’s house heard about it, they went down there to him. "},{"num":2,"verse":"Anyone who was in distress, anyone in debt, and anyone embittered rallied around him, and he became their leader. There were about 400 men with him."},{"num":3,"verse":"Then David left from there to Mizpah of Moab, and he said to the king of Moab, “Please, let my father and my mother come and stay with you until I know what God will do for me.” "},{"num":4,"verse":"Then he brought them to the king of Moab, and they stayed with him all the time that David was in the stronghold."},{"num":5,"verse":"But the prophet Gad said to David, “Do not stay in the stronghold; depart, and go to the land of Judah.” So David left and went to the forest of Hereth."},{"num":6,"verse":"Then Saul heard that David and the men with him were located. Saul was in Gibeah, sitting under the tamarisk tree on the height, spear in his hand, and all his courtiers were attending him. "},{"num":7,"verse":"Saul said to his courtiers standing about him, “Listen now, Benjamites! Will the son of Jesse give every one of you fields and vineyards? Will he make all of you captains of thousands and captains of hundreds? "},{"num":8,"verse":"Yet all of you have conspired against me, and there was nobody disclosing to me when my son makes a covenant with the son of Jesse! None of you is sorry for me or discloses to me that my son has stirred up my servant against me to lie in ambush—as is the case today?”"},{"num":9,"verse":"Then Doeg the Edomite, who was standing among Saul’s courtiers, answered and said, “I saw the son of Jesse coming to Nob—to Ahimelech son of Ahitub—"},{"num":10,"verse":"and he inquired of Adonai for him, gave him provisions and gave him the sword of Goliath the Philistine.”"},{"num":11,"verse":"Then the king sent word to summon the kohen Ahimelech son of Ahitub and all the kohanim of his father’s house who were in Nob. So they all came to the king. "},{"num":12,"verse":"“Listen now, son of Ahitub,” Saul said."},{"num":13,"verse":"Then Saul said to him, “Why have you conspired against me—you and the son of Jesse—by giving him bread and a sword, and by inquiring of God for him, that he should rise against me by lying in ambush, as is the case today?”"},{"num":14,"verse":"Then Ahimelech answered the king saying, “Who among all your servants is as trusted as David, the king’s son-in-law, a captain of the royal guard, and honored in your house? "},{"num":15,"verse":"Just today I began to inquire of God for him? Far be it from the king to accuse his servant or to anyone of my father’s house. For your servant knows nothing of all this, whether little or much.”"},{"num":16,"verse":"But the king said, “You will surely die, Ahimelech, you and all your father’s house.” "},{"num":17,"verse":"Then the king ordered the guards attending him, “Turn around and kill the kohanim of Adonai, for they are in cahoots with David, for they knew that he was running away but did not inform me.” But the servants of the king were not willing to raise their hand to assault the kohanim of Adonai. "},{"num":18,"verse":"So the king said to Doeg, “You, turn around and kill the kohanim!” So Doeg the Edomite turned and fell upon the kohanim and on that day killed 85 men who wore the linen ephod. "},{"num":19,"verse":"Nob, the town of the kohanim, he struck with the edge of the sword: men and women, children and infants, oxen, asses, and sheep with the edge of the sword."},{"num":20,"verse":"Yet one of the sons of Ahimelech son of Ahitub, named Abiathar, escaped and fled to David. "},{"num":21,"verse":"Abiathar told David that Saul had slain Adonai’s kohanim. "},{"num":22,"verse":"Then David said to Abiathar, “I knew on that day, when Doeg the Edomite was there, that he would surely tell Saul. I have brought about the death of all the people of your father’s house. "},{"num":23,"verse":"Stay with me, and fear not; for the one who is seeking my life is seeking your life too—but with me you will be safe.”"}]