[[],[{"type":"header","content":"Parable of the Marriage Feast"},{"type":"prose","content":"Jesus spoke to them again in parables, saying,"},{"type":"header","content":"Poll-tax to Caesar"}],[{"type":"prose","content":"Then the Pharisees went and plotted together how they might trap Him in what He said."}],[{"type":"prose","content":"And they *sent their disciples to Him, along with the Herodians, saying, “Teacher, we know that You are truthful and teach the way of God in truth, and do not care what anyone thinks; for You are not partial to anyone."}],[{"type":"prose","content":"Tell us then, what do You think? Is it permissible to pay a poll-tax to Caesar, or not?”"}],[{"type":"prose","content":"But Jesus perceived their malice, and said,  And they brought Him a denarius."}],[{"type":"prose","content":"And He *said to them, "}],[{"type":"prose","content":"They *said to Him, “Caesar’s.” Then He *said to them, "}],[{"type":"prose","content":"And hearing , they were amazed; and they left Him and went away."},{"type":"header","content":"Jesus Answers the Sadducees"}],[{"type":"prose","content":"On that day  Sadducees (who say there is no resurrection) came to Jesus and questioned Him,"}],[{"type":"prose","content":"saying, “Teacher, Moses said, ‘If a man dies having no children, his brother as next of kin shall marry his wife, and raise up children for his brother.’"}],[{"type":"prose","content":"Now there were seven brothers among us; and the first married and died, and having no children, he left his wife to his brother."}],[{"type":"prose","content":" the same also  the second , and the third, down to the seventh."}],[{"type":"prose","content":"Last of all, the woman died."}],[{"type":"prose","content":"In the resurrection, therefore, whose wife of the seven will she be? For they all had her .”"}],[{"type":"prose","content":"But Jesus answered and said to them, "}],[{"type":"prose","content":"When the crowds heard , they were astonished at His teaching."}],[{"type":"prose","content":"But when the Pharisees heard that  had silenced the Sadducees, they gathered together."}],[{"type":"prose","content":"And one of them, a lawyer, asked Him a question, testing Him:"}],[{"type":"prose","content":"“Teacher, which is the great commandment in the Law?”"}],[{"type":"prose","content":"And He said to him, "}],[{"type":"prose","content":"Now while the Pharisees were gathered together, Jesus asked them a question: They *said to Him, “ of David.”"}],[{"type":"prose","content":"He *said to them, "},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"prose","content":"No one was able to offer Him a word in answer, nor did anyone dare from that day  to ask Him any more questions."}]]