[{"header":"A Story About a Wedding Feast"},{"num":22,"verse":"Jesus again used stories to teach them. He said, "},{"header":"Is It Right to Pay Taxes or Not?"},{"num":15,"verse":"Then the Pharisees left that place and made plans to trap Jesus in saying something wrong. "},{"num":16,"verse":"They sent some of their own followers and some people from the group called Herodians. They said, “Teacher, we know that you are an honest man and that you teach the truth about God’s way. You are not afraid of what other people think about you, because you pay no attention to who they are. "},{"num":17,"verse":"So tell us what you think. Is it right to pay taxes to Caesar or not?”"},{"num":18,"verse":"But knowing that these leaders were trying to trick him, Jesus said, “You hypocrites! Why are you trying to trap me? "},{"num":20,"verse":"Then Jesus asked, “Whose image and name are on the coin?”"},{"num":21,"verse":"The men answered, “Caesar’s.”"},{"num":22,"verse":"When the men heard what Jesus said, they were amazed and left him and went away."},{"header":"Some Sadducees Try to Trick Jesus"},{"num":23,"verse":"That same day some Sadducees came to Jesus and asked him a question. (Sadducees believed that people would not rise from the dead.) "},{"num":24,"verse":"They said, “Teacher, Moses said if a married man dies without having children, his brother must marry the widow and have children for him. "},{"num":25,"verse":"Once there were seven brothers among us. The first one married and died. Since he had no children, his brother married the widow. "},{"num":26,"verse":"Then the second brother also died. The same thing happened to the third brother and all the other brothers. "},{"num":27,"verse":"Finally, the woman died. "},{"num":28,"verse":"Since all seven men had married her, when people rise from the dead, whose wife will she be?”"},{"num":29,"verse":"Jesus answered, “You don’t understand, because you don’t know what the Scriptures say, and you don’t know about the power of God. "},{"num":33,"verse":"When the people heard this, they were amazed at Jesus’ teaching."},{"header":"The Most Important Command"},{"num":34,"verse":"When the Pharisees learned that the Sadducees could not argue with Jesus’ answers to them, the Pharisees met together. "},{"num":35,"verse":"One Pharisee, who was an expert on the law of Moses, asked Jesus this question to test him: "},{"num":36,"verse":"“Teacher, which command in the law is the most important?”"},{"num":37,"verse":"Jesus answered, “‘Love the Lord your God with all your heart, all your soul, and all your mind.’ "},{"header":"Jesus Questions the Pharisees"},{"num":41,"verse":"While the Pharisees were together, Jesus asked them, "},{"num":43,"verse":"Then Jesus said to them, “Then why did David call him ‘Lord’? David, speaking by the power of the Holy Spirit, said,"},{"num":46,"verse":"None of the Pharisees could answer Jesus’ question, and after that day no one was brave enough to ask him any more questions."}]