[{"header":"The Parable of the Wedding Feast"},{"num":22,"verse":"Jesus spoke to them once again in parables."},{"num":2,"verse":"‘The kingdom of heaven’, he said, ‘is like a king who made a wedding feast for his son. "},{"num":3,"verse":"He sent his slaves to call the invited guests to the wedding, and they didn’t want to come."},{"num":4,"verse":"‘Again he sent other slaves, with these instructions: “Say to the guests, Look! I’ve got my dinner ready; my bulls and fatted calves have been killed; everything is prepared. Come to the wedding!”"},{"num":5,"verse":"‘But they didn’t take any notice. They went off, one to his own farm, another to see to his business. "},{"num":6,"verse":"The others laid hands on his slaves, abused them and killed them. "},{"num":7,"verse":"(The king was angry, and sent his soldiers to destroy those murderers and burn down their city.) "},{"num":8,"verse":"Then he said to his slaves, “The wedding is ready, but the guests didn’t deserve it. "},{"num":9,"verse":"So go to the roads leading out of town, and invite everyone you find to the wedding.” "},{"num":10,"verse":"The slaves went off into the streets and rounded up everyone they found, bad and good alike. And the wedding was filled with partygoers."},{"num":11,"verse":"‘But when the king came in to look at the guests, he saw there a man who wasn’t wearing a wedding suit."},{"num":12,"verse":"‘ “My friend,” he said to him, “how did you get in here without a wedding suit?” And he was speechless. "},{"num":13,"verse":"Then the king said to the servants, “Tie him up, hands and feet, and throw him into the darkness outside, where people weep and grind their teeth.”"},{"num":14,"verse":"‘Many are called, you see, but few are chosen.’"},{"header":"Paying Taxes to Caesar"},{"num":15,"verse":"Then the Pharisees went and plotted how they might trap him into saying the wrong thing. "},{"num":16,"verse":"They sent their followers to him, with the Herodians."},{"num":17,"verse":"So tell us what you think. Is it lawful to pay tribute to Caesar, or not?’"},{"num":18,"verse":"Jesus knew their evil intentions."},{"num":19,"verse":"‘Show me the tribute coin.’ They brought him a dinar."},{"num":20,"verse":"‘This . . . image,’ said Jesus, ‘and this . . . inscription. Who do they belong to?’"},{"num":21,"verse":"‘Caesar,’ they said."},{"num":22,"verse":"When they heard that they were astonished. They left him and went away."},{"header":"The Question of the Resurrection"},{"num":23,"verse":"The same day some Sadducees came to him. (The Sadducees deny the resurrection.) Their question was this."},{"num":24,"verse":"‘Teacher,’ they began, ‘Moses said, “If a man dies without children, his brother should marry his widow and raise up seed for his brother.” "},{"num":25,"verse":"Well now, there were seven brothers living among us. The first got married, and then died, and since he didn’t have children he left his wife to his brother. "},{"num":26,"verse":"The same thing happened with the second and the third, and so on with all seven. "},{"num":27,"verse":"Last of all the woman died. "},{"num":28,"verse":"So: in the resurrection, whose wife will she be, of all the seven? All of them had married her, after all.’"},{"num":29,"verse":"This was Jesus’ answer to them: ‘You are quite mistaken,’ he said, ‘because you don’t know your Bibles or God’s power. "},{"num":30,"verse":"In the resurrection, you see, people don’t marry or get married off; they are like angels in heaven. "},{"num":31,"verse":"But as for the resurrection of the dead, did you never read what was said to you by God, in these words: "},{"num":32,"verse":"“I am the God of Abraham, and the God of Isaac, and the God of Jacob?” He isn’t God of the dead, but of the living.’"},{"num":33,"verse":"The crowds heard this, and they were astonished at his teaching."},{"header":"The Great Commandment, and David’s Master"},{"num":34,"verse":"When the Pharisees heard that Jesus had silenced the Sadducees, they got together in a group. "},{"num":35,"verse":"One of them, a lawyer, put him on the spot with this question."},{"num":36,"verse":"‘Teacher,’ he said, ‘which is the most important commandment in the law?’"},{"num":37,"verse":"‘You must love the Lord your God’, replied Jesus, ‘with all your heart, with all your life, and with all your mind. "},{"num":38,"verse":"This is the first commandment, and it’s the one that really matters. "},{"num":39,"verse":"The second is similar, and it’s this: You must love your neighbour as yourself. "},{"num":40,"verse":"The entire law hangs on these two commandments – and that goes for the prophets, too.’"},{"num":41,"verse":"While the Pharisees were gathered there, Jesus asked them, "},{"num":42,"verse":"‘What’s your view of the Messiah? Whose son is he?’"},{"num":43,"verse":"‘Why then’, said Jesus, ‘does David (speaking by the spirit) call him “Master”, when he says,"},{"num":45,"verse":"‘If David calls him “Master”, how can he be his son?’"},{"num":46,"verse":"Nobody was able to answer him a single word. From that day on nobody dared ask him anything any more."}]