[{"num":22,"verse":"And Jesus answering, again spake to them in similes, saying,"},{"num":2,"verse":"`The reign of the heavens was likened to a man, a king, who made marriage-feasts for his son,"},{"num":3,"verse":"and he sent forth his servants to call those having been called to the marriage-feasts, and they were not willing to come."},{"num":4,"verse":"`Again he sent forth other servants, saying, Say to those who have been called: Lo, my dinner I prepared, my oxen and the fatlings have been killed, and all things [are] ready, come ye to the marriage-feasts;"},{"num":5,"verse":"and they, having disregarded [it], went away, the one to his own field, and the other to his merchandise;"},{"num":6,"verse":"and the rest, having laid hold on his servants, did insult and slay [them]."},{"num":7,"verse":"`And the king having heard, was wroth, and having sent forth his soldiers, he destroyed those murderers, and their city he set on fire;"},{"num":8,"verse":"then saith he to his servants, The marriage-feast indeed is ready, and those called were not worthy,"},{"num":9,"verse":"be going, then, on to the cross-ways, and as many as ye may find, call ye to the marriage-feasts."},{"num":10,"verse":"`And those servants, having gone forth to the ways, did gather all, as many as they found, both bad and good, and the marriage-feast apartment was filled with those reclining."},{"num":11,"verse":"`And the king having come in to view those reclining, saw there a man not clothed with clothing of the marriage-feast,"},{"num":12,"verse":"and he saith to him, Comrade, how didst thou come in hither, not having clothing of the marriage-feast? and he was speechless."},{"num":13,"verse":"`Then said the king to the ministrants, Having bound his feet and hands, take him up and cast forth to the outer darkness, there shall be the weeping and the gnashing of the teeth;"},{"num":14,"verse":"for many are called, and few chosen.'"},{"num":15,"verse":"Then the Pharisees having gone, took counsel how they might ensnare him in words,"},{"num":16,"verse":"and they send to him their disciples with the Herodians, saying, `Teacher, we have known that thou art true, and the way of God in truth thou dost teach, and thou art not caring for any one, for thou dost not look to the face of men;"},{"num":17,"verse":"tell us, therefore, what dost thou think? is it lawful to give tribute to Caesar or not?'"},{"num":18,"verse":"And Jesus having known their wickedness, said, `Why me do ye tempt, hypocrites?"},{"num":19,"verse":"show me the tribute-coin?' and they brought to him a denary;"},{"num":20,"verse":"and he saith to them, `Whose [is] this image and the inscription?'"},{"num":21,"verse":"they say to him, `Caesar's;' then saith he to them, `Render therefore the things of Caesar to Caesar, and the things of God to God;'"},{"num":22,"verse":"and having heard they wondered, and having left him they went away."},{"num":23,"verse":"In that day there came near to him Sadducees, who are saying there is not a rising again, and they questioned him, saying,"},{"num":24,"verse":"`Teacher, Moses said, If any one may die not having children, his brother shall marry his wife, and shall raise up seed to his brother."},{"num":25,"verse":"`And there were with us seven brothers, and the first having married did die, and not having seed, he left his wife to his brother;"},{"num":26,"verse":"in like manner also the second, and the third, unto the seventh,"},{"num":27,"verse":"and last of all died also the woman;"},{"num":28,"verse":"therefore in the rising again, of which of the seven shall she be wife -- for all had her?'"},{"num":29,"verse":"And Jesus answering said to them, `Ye go astray, not knowing the Writings, nor the power of God;"},{"num":30,"verse":"for in the rising again they do not marry, nor are they given in marriage, but are as messengers of God in heaven."},{"num":31,"verse":"`And concerning the rising again of the dead, did ye not read that which was spoken to you by God, saying,"},{"num":32,"verse":"I am the God of Abraham, and the God of Isaac, and the God of Jacob? God is not a God of dead men, but of living.'"},{"num":33,"verse":"And having heard, the multitudes were astonished at his teaching;"},{"num":34,"verse":"and the Pharisees, having heard that he did silence the Sadducees, were gathered together unto him;"},{"num":35,"verse":"and one of them, a lawyer, did question, tempting him, and saying,"},{"num":36,"verse":"`Teacher, which [is] the great command in the Law?'"},{"num":37,"verse":"And Jesus said to him, `Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thine understanding --"},{"num":38,"verse":"this is a first and great command;"},{"num":39,"verse":"and the second [is] like to it, Thou shalt love thy neighbor as thyself;"},{"num":40,"verse":"on these -- the two commands -- all the law and the prophets do hang.'"},{"num":41,"verse":"And the Pharisees having been gathered together, Jesus did question them,"},{"num":42,"verse":"saying, `What do ye think concerning the Christ? of whom is he son?' They say to him, `Of David.'"},{"num":43,"verse":"He saith to them, `How then doth David in the Spirit call him lord, saying,"},{"num":44,"verse":"The Lord said to my lord, Sit at my right hand, till I may make thine enemies thy footstool?"},{"num":45,"verse":"If then David doth call him lord, how is he his son?'"},{"num":46,"verse":"And no one was able to answer him a word, nor durst any from that day question him any more."}]