[{"header":"David Is Made King of Israel"},{"num":5,"verse":"Then all the tribes of Israel came to David at Hebron. They said to him, “Look, we are your own family. "},{"num":2,"verse":"In the past Saul was king over us. But you were the one leading us in battle for Israel. The Lord said to you, ‘You will be like a shepherd for my people, the Israelites. You will become their ruler.’”"},{"num":3,"verse":"All the elders of Israel came to King David at Hebron. Then he made an agreement with them in Hebron in front of the Lord. Then they poured oil on David to make him king over Israel."},{"num":4,"verse":"David was 30 years old when he became king. He ruled 40 years. "},{"num":5,"verse":"He was king over Judah in Hebron for 7 years and 6 months. And he was king over all Israel and Judah in Jerusalem for 33 years."},{"num":6,"verse":"The king and his men went to Jerusalem to attack the Jebusites who lived there. The Jebusites said to David, “You can’t come into our city. Even our people who are blind and crippled can stop you.” They said this because they thought David could not enter their city. "},{"num":7,"verse":"But David did take the city of Jerusalem with its strong walls. It became the City of David."},{"num":8,"verse":"That day David said to his men, “To defeat the Jebusites you must go through the water tunnel. Then you can reach those ‘crippled’ and ‘blind’ enemies. This is why people say, ‘The blind and the crippled cannot enter the palace.’”"},{"num":9,"verse":"So David lived in the city with its strong walls. He called it the City of David. David built more buildings around it. He began where the land was filled in on the east side of the city. He also built more buildings inside the city. "},{"num":10,"verse":"He became stronger and stronger, because the Lord of heaven’s armies was with him."},{"num":11,"verse":"Hiram king of the city of Tyre sent messengers to David. He also sent cedar logs, carpenters and men to cut stone. They built a palace for David. "},{"num":12,"verse":"Then David knew the Lord really had made him king of Israel. And he knew the Lord had made his kingdom very important. This was because the Lord loved his people, the Israelites."},{"num":13,"verse":"In Jerusalem David took for himself more slave women and wives. This was after he moved there from Hebron. More sons and daughters were born to David. "},{"num":14,"verse":"These are the names of the sons born to David in Jerusalem: Shammua, Shobab, Nathan, Solomon, "},{"num":15,"verse":"Ibhar, Elishua, Nepheg, Japhia, "},{"num":16,"verse":"Elishama, Eliada and Eliphelet."},{"header":"David Defeats the Philistines"},{"num":17,"verse":"Now the Philistines heard that David had been made king over Israel. So all the Philistines went to look for him. But when David heard the news, he went down to a safe place. "},{"num":18,"verse":"So the Philistines came and camped in the Valley of Rephaim. David asked the Lord, “Should I attack the Philistines? Will you help me defeat them?”"},{"num":19,"verse":"The Lord said to David, “Go! I will certainly help you defeat them.”"},{"num":20,"verse":"So David went to Baal Perazim and defeated the Philistines there. David said, “Like a flood of water, the Lord has broken through my enemies.” So David named the place Baal Perazim. "},{"num":21,"verse":"The Philistines left their idols behind at Baal Perazim. And David and his men carried these idols away."},{"num":22,"verse":"Once again the Philistines came and camped at the Valley of Rephaim. "},{"num":23,"verse":"David prayed to the Lord. This time the Lord told David, “Don’t attack the Philistines from the front. Instead, go around them. Attack them opposite the balsam trees. "},{"num":24,"verse":"You will hear the sound of marching in the tops of the balsam trees. Then you must act quickly. I, the Lord, will have gone ahead of you and defeated the Philistine army.” "},{"num":25,"verse":"So David did what the Lord commanded. He defeated the Philistines and chased them all the way from Gibeon to Gezer."}]