[{"header":"Chapter 5"},{"num":1,"verse":"David King of Israel. All the tribes of Israel came to David in Hebron, and they said: “Look! We are your bone and your flesh. "},{"num":2,"verse":"In days past, when Saul was still our king, you were the one who led Israel out in all its battles and brought it back. And the Lord said to you: You shall shepherd my people Israel; you shall be ruler over Israel.” "},{"num":3,"verse":"Then all the elders of Israel came to the king in Hebron, and at Hebron King David made a covenant with them in the presence of the Lord; and they anointed David king over Israel. "},{"num":4,"verse":"David was thirty years old when he became king, and he reigned forty years: "},{"num":5,"verse":"in Hebron he was king over Judah seven years and six months, and in Jerusalem he was king thirty-three years over all Israel and Judah."},{"num":6,"verse":"Then the king and his men went to Jerusalem against the Jebusites who inhabited the land. They told David, “You shall not enter here: the blind and the lame will drive you away!” which was their way of saying, “David shall not enter here.” "},{"num":7,"verse":"David nevertheless captured the fortress of Zion, which is the City of David. "},{"num":8,"verse":"On that day David said: “All who wish to strike at the Jebusites must attack through the water shaft. The lame and the blind shall be the personal enemies of David.” That is why it is said, “The blind and the lame shall not enter the palace.” "},{"num":9,"verse":"David took up residence in the fortress which he called the City of David. David built up the city on all sides, from the Millo toward the center. "},{"num":10,"verse":"David became ever more powerful, for the Lord of hosts was with him. "},{"num":11,"verse":"Hiram, king of Tyre, sent envoys to David along with cedar wood, and carpenters and masons, who built a house for David. "},{"num":12,"verse":"David now knew that the Lord had truly established him as king over Israel and had exalted his kingdom for the sake of his people Israel."},{"num":13,"verse":"David’s Family in Jerusalem. David took more concubines and wives in Jerusalem after he had come from Hebron, and more sons and daughters were born to him. "},{"num":14,"verse":"These are the names of those who were born to him in Jerusalem: Shammua, Shobab, Nathan, Solomon, "},{"num":15,"verse":"Ibhar, Elishua, Nepheg, Japhia, "},{"num":16,"verse":"Elishama, Beeliada, and Eliphelet."},{"num":17,"verse":"Rout of the Philistines. When the Philistines had heard that David was anointed king over Israel, they marched out in force to come after him. When David heard this, he went down to the refuge. "},{"num":18,"verse":"Meanwhile the Philistines had come and deployed themselves in the valley of Rephaim. "},{"num":19,"verse":"David inquired of the Lord, “Shall I attack the Philistines, and will you deliver them into my power?” The Lord answered David: Attack, for I will surely deliver the Philistines into your power. "},{"num":20,"verse":"So David went to Baal-perazim, and he defeated them there. He said, “The Lord has broken through my enemies before me just as water breaks through a dam.” Therefore that place was called Baal-perazim. "},{"num":21,"verse":"The Philistines abandoned their gods there, and David and his men carried them away. "},{"num":22,"verse":"Once again the Philistines came up and deployed themselves in the valley of Rephaim, "},{"num":23,"verse":"and again David inquired of the Lord, who replied: Do not attack the front—circle behind them and come against them near the balsam trees. "},{"num":24,"verse":"When you hear the sound of marching in the tops of the balsam trees, act decisively, for then the Lord has already gone before you to strike the army of the Philistines. "},{"num":25,"verse":"David did as the Lord commanded him, and routed the Philistines from Gibeon as far as Gezer."}]