[{"header":"David Anointed King of Israel(A)"},{"num":5,"verse":"All the tribes of Israel came to David at Hebron. “We are your own flesh and blood,” they said. "},{"num":2,"verse":"“Even in the past when Saul ruled us, you were the one who led Israel in battle. Yahweh has said to you, ‘You will be shepherd of my people Israel, the leader of Israel.’”"},{"num":3,"verse":"All the leaders of Israel had come to Hebron. King David made an agreement with them at Hebron in front of Yahweh. So they anointed David king of Israel. "},{"num":4,"verse":"David was 30 years old when he became king, and he ruled for 40 years. "},{"num":5,"verse":"In Hebron he ruled Judah for seven years and six months. In Jerusalem he ruled for 33 years over all Israel and Judah."},{"header":"David Captures Jerusalem(B)"},{"num":6,"verse":"The king and his men went to Jerusalem to attack the Jebusites, who lived in that region. The Jebusites told David, “You will never get in here. Even the blind and the lame could turn you away” (meaning that David could never get in there). "},{"num":7,"verse":"But David captured the fortress Zion (that is, the City of David). "},{"num":8,"verse":"That day David said, “Whoever wants to defeat the Jebusites must reach the lame and the blind who hate me by using the water shaft.” So there is a saying, “The blind and the lame will not get into the palace.” "},{"num":9,"verse":"David lived in the fortress and called it the City of David. He built the city of Jerusalem around it from the Millo to the palace. "},{"num":10,"verse":"David continued to grow more powerful because Yahweh Elohim Tsebaoth was with him."},{"header":"David’s Palace, Wives, and Children in Jerusalem(C)"},{"num":11,"verse":"Then King Hiram of Tyre sent messengers to David, along with cedarwood, carpenters, and stonemasons. They built a palace for David. "},{"num":12,"verse":"So David realized that Yahweh had established him as king of Israel and made his kingship famous for the sake of Israel, Yahweh’s people."},{"num":13,"verse":"David married more concubines and wives from Jerusalem after he had come there from Hebron, and he fathered more sons and daughters. "},{"num":14,"verse":"These are the names of the children born to him in Jerusalem: Shammua, Shobab, Nathan, Solomon, "},{"num":15,"verse":"Ibhar, Elishua, Nepheg, Japhia, "},{"num":16,"verse":"Elishama, Eliada, and Eliphelet."},{"header":"David Defeats the Philistines(D)"},{"num":17,"verse":"When the Philistines heard that David had been anointed king of Israel, all of them came to attack David. But David heard about it and went to the fortress. "},{"num":18,"verse":"The Philistines had come and overrun the valley of Rephaim."},{"num":19,"verse":"David asked Yahweh, “Should I attack the Philistines? Will you hand them over to me?”"},{"num":20,"verse":"So David went to Baal Perazim and defeated the Philistines there. He said, “Yahweh has overwhelmed my enemies in front of me like an overwhelming flood.” That is why that place is called Baal Perazim [The Lord Overwhelms]. "},{"num":21,"verse":"The Philistines left their idols there, so David and his men carried the idols away."},{"num":22,"verse":"The Philistines again attacked and overran the valley of Rephaim. "},{"num":23,"verse":"David asked Yahweh, and he answered, “Don’t attack now, but circle around behind them, and come at them in front of the balsam trees. "},{"num":24,"verse":"When you hear the sound of marching in the tops of the balsam trees, act immediately because Yahweh has gone ahead of you to defeat the Philistine army.” "},{"num":25,"verse":"David did as Yahweh ordered him and defeated the Philistines from Geba to Gezer."}]