[{"header":"All Israel Anoints David King"},{"num":5,"verse":"Then all the tribes of Israel came to David at Hebron and spoke saying, “Here we are, your own flesh and blood. "},{"num":2,"verse":"Even before, when Saul was king over us, it was you who led Israel out and back. Also Adonai said to you, ‘You will shepherd My people Israel and be ruler over Israel.’” "},{"num":3,"verse":"So all the elders of Israel came to the king at Hebron, and King David cut a covenant with them at Hebron before Adonai. Then they anointed David king over Israel. "},{"num":4,"verse":"David was 30 years old when he began to reign and he reigned 40 years. "},{"num":5,"verse":"In Hebron he reigned over Judah seven years and six months, and in Jerusalem he reigned 33 years over all Israel and Judah."},{"header":"Securing Jerusalem"},{"num":6,"verse":"Now the king and his soldiers marched to Jerusalem against the Jebusites, the inhabitants of the region. But they said to David, “You’ll never get in here! Even the blind and the lame could ward you off,” thinking, “David can’t get in here.” "},{"num":7,"verse":"Nevertheless, David did capture the stronghold of Zion (that is, the City of David). "},{"num":8,"verse":"On that day David said, “Whoever would conquer the Jebusites must strike through the water shaft to those ‘lame and blind’ whom David’s soul despises.” That is why they used to say, “The blind or lame couldn’t get into the house.” "},{"num":9,"verse":"So David occupied the stronghold and renamed it the City of David. Then David fortified it all round from the Millo inward. "},{"num":10,"verse":"David continued to grow stronger, for Adonai Elohim-Tzva’ot was with him."},{"num":11,"verse":"Then King Hiram of Tyre sent envoys to David with cedar logs, carpenters and masons; and they built a palace for David. "},{"num":12,"verse":"David then realized that Adonai had established him as king over Israel, and that He had exalted his kingdom for the sake of His people Israel."},{"num":13,"verse":"Then David took more concubines and wives from Jerusalem, after he came from Hebron, and more sons and daughters were born to David. "},{"num":14,"verse":"Now these are the names of those who were born to him in Jerusalem: Shammua, Shobab, Nathan, Solomon, "},{"num":15,"verse":"Ibhar, Elishua, Nepheg, Japhia, "},{"num":16,"verse":"Elishama, Eliada, and Eliphelet."},{"header":"Master of Breakthroughs"},{"num":17,"verse":"Now when the Philistines heard that David was anointed king over Israel, all the Philistines marched up searching for David. When David heard about it, he went down to the stronghold. "},{"num":18,"verse":"The Philistines came and spread out in the valley of Rephaim. "},{"num":19,"verse":"Then David inquired of Adonai saying, “Should I go up against the Philistines? Will You give them over into my hand?”"},{"num":20,"verse":"So David came to Baal-perazim and David struck them down there. So he said, “Adonai has broken through my enemies before me like the breakthrough of waters!” That is why he named that place Baal-perazim. "},{"num":21,"verse":"They abandoned their idols there, so David and his men removed them."},{"num":22,"verse":"But the Philistines marched up and spread out in the valley of Rephaim again. "},{"num":23,"verse":"When David inquired of Adonai, He said, “Do not go up; instead circle around behind them and attack them in front of the balsam trees. "},{"num":24,"verse":"Now it will be when you hear the sound of marching in the tops of the balsam trees, then you must act, for then Adonai will have gone out before you to strike the camp of the Philistines. "},{"num":25,"verse":"David did just as Adonai had commanded him, and he struck down the Philistines from Geba as far as Gezer."}]