[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:11-22 Wisdom is as good as an inheritance, yea better. It shelters from the storms and scorching heat of trouble. Wealth will not lengthen out the natural life; but true wisdom will give spiritual life, and strengthen men for services under their sufferings. Let us look upon the disposal of our condition as the work of God, and at last all will appear to have been for the best. In acts of righteousness, be not carried into heats or passions, no, not by a zeal for God. Be not conceited of thine own abilities; nor find fault with every thing, nor busy thyself in other men's matters. Many who will not be wrought upon by the fear of God, and the dread of hell, will avoid sins which ruin their health and estate, and expose to public justice. But those that truly fear God, have but one end to serve, therefore act steadily. If we say we have not sinned, we deceive ourselves. Every true believer is ready to say, God be merciful to me a sinner. Forget not at the same time, that personal righteousness, walking in newness of life, is the only real evidence of an interest by faith in the righteousness of the Redeemer. Wisdom teaches us not to be quick in resenting affronts. Be not desirous to know what people say; if they speak well of thee, it will feed thy pride, if ill, it will stir up thy passion. See that thou approve thyself to God and thine own conscience, and then heed not what men say of thee; it is easier to pass by twenty affronts than to avenge one. When any harm is done to us, examine whether we have not done as bad to others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Destroy thyself - The Septuagint and Vulgate render it: \"be amazed.\" Compare \"marvel not\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. over much wicked—so worded, to answer to \"righteous over much.\" For if not taken thus, it would seem to imply that we may be wicked a little. \"Wicked\" refers to \"wicked man\" (Ec 7:15); \"die before thy time,\" to \"prolongeth his life,\" antithetically. There may be a wicked man spared to \"live long,\" owing to his avoiding gross excesses (Ec 7:15). Solomon says, therefore, Be not so foolish (answering antithetically to \"over wise,\" Ec 7:16), as to run to such excess of riot, that God will be provoked to cut off prematurely thy day of grace (Ro 2:5). The precept is addressed to a sinner. Beware of aggravating thy sin, so as to make thy case desperate. It refers to the days of Solomon's \"vanity\" (apostasy, Ec 7:15), when only such a precept would be applicable. By litotes it includes, \"Be not wicked at all.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Be not over-much wicked; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not take occasion, either from the impunity of sinners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 7:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 7:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or from the prohibition of excessive righteousness, to run into the contrary extreme, the defect of righteousness, or to give up thyself to the practice of all manner of wickedness, as the manner of many men is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 8:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 8:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But this is not to be understood as if he allowed a lower degree of wickedness, no more than that prohibition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not letting the sun go down upon a man’s wrath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 4:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 4:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", permits him to keep his wrath all the day long; and no more than the condemnation ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of excess of riot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abominable idolatries",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Peter 4:3,4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", doth justify any kind of rioting or idolatry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither be thou foolish; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which he adds to show that such sinners, howsoever they esteem themselves wise, yet in truth are egregious fools, as the following words prove. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Die before thy time; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either by the justice of the magistrate, or by the vengeance of God. For though I said that sometimes a wicked man prolongeth his days, &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 7:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 7:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet commonly such persons are cut off, and thou hast sufficient reason to expect and fear it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be not over much wicked,.... Not that a man should be wicked at all; but some, observing that wicked men prolong their days in wickedness, are encouraged to go into greater lengths in sin than they have yet done, and give up themselves to all iniquity; and run into excess of not, into the grossest and most scandalous enormities. Some render it, \"do not disturb\" or \"frighten thyself\" (a), distress and distract thyself with the business of life, bustling and stirring, restless and uneasy, to get wealth and riches; but be easy and satisfied with what is enjoyed, or comes without so much stir and trouble; this is the original sense of the word. The meaning seems to be, either do not multiply sin, add unto it, and continue in it; or do not aggravate it, making sins to be greater and more heinous than they are, and a man's case worse than it is, and so sink into despair; and thus it stands opposed to an ostentatious show of righteousness; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither be thou foolish; or give up thyself to a profligate life, to go on in a course of sin, which will issue in the ruin of body and soul; or in aggravating it in an excessive manner; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "why shouldest thou die before thy time? bring diseases on thy body by a wicked course of living, which will issue in death; or fall into the hands of the civil magistrate, for capital offences, for which sentence of death must pass and be executed, before a man comes to the common term of human life; see Psalm 55:23; or, as Mr. Broughton renders it, \"before thy ordinary time\"; not before the appointed time (b). The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "why shouldest thou die before thy time? bring diseases on thy body by a wicked course of living, which will issue in death; or fall into the hands of the civil magistrate, for capital offences, for which sentence of death must pass and be executed, before a man comes to the common term of human life; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or, as Mr. Broughton renders it, \"before thy ordinary time\"; not before the appointed time (b). The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"be the cause of death to thy soul;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or through despair commit suicide. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a)  \"ne paveas\", Pagninus; \"ne te occupes multum, aut distrahas te, sive inquietes\", some in Vatablus; so Aben Ezra and Ben Melech. (b) \"Ante diem\", Virgil. Aeneid. 4. prope finem. Vid. Servium in ib. Ovid. Metamorph. l. 1. Fab. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a)  \"ne paveas\", Pagninus; \"ne te occupes multum, aut distrahas te, sive inquietes\", some in Vatablus; so Aben Ezra and Ben Melech. (b) \"Ante diem\", Virgil. Aeneid. 4. prope finem. Vid. Servium in ib. Ovid. Metamorph. l. 1. Fab. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Be not {n} over much wicked, neither be thou foolish: why shouldest thou die before thy time?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Be not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " over much wicked, neither be thou foolish: why shouldest thou die before thy time?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Do not tarry long when you are admonished to come out of the way of wickedness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Be not over much wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] There seems something like a paradox in the counsel. Surely, we think, the teacher is carrying his doctrine of the mean too far when he gives a precept, which, by forbidding excess, seems to sanction a moderate amount of wickedness. Various attempts have been made to tone down the precept by taking “wicked” as = not subject to rule, or = engaged in worldly affairs (the “mammon of unrighteousness”) that so often lead to wickedness. The difficulty vanishes, however, if we will but admit that the writer might have learnt the art of a playful irony from his Greek teachers. He has uttered the precept, “Be not righteous over-much.” That most men would receive as a true application of the doctrine of “Nothing in excess,” or, in the phrase we owe to Talleyrand, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surtout, point de zêle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” He mentally sees, as it were, the complacent smile of those who were in no danger of that fault and who think that the precept gives them just the license they want, and he meets the feeling it expresses by another maxim. “Yes, my friends,” he seems to say, “but there is another ‘over-much,’ against which you need a warning, and its results are even more fatal than those of the other.” In avoiding one extreme men might fall easily into the other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "why shouldest thou die before thy time?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Not in thy time.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The form of the warning is singularly appropriate. The vices thought of and the end to which they lead are clearly those of the sensual license described in Proverbs 7. Death is the issue here, as the loss of spiritual discernment was of the Pharisaic or the over-philosophizing temper described in the preceding verse. In both precepts we may trace Koheleth’s personal experience. Ch. 2 traces the history of one who in his life experiments had been both “over much wise,” and, it must be feared, “over much wicked.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Be not over much wicked neither be thou foolish.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These two injunctions are parallel and correlative to those in ver. 16 concerning over-righteousness and over-wisdom. But the present verse cannot be meant, as at first sight it seems to do, to sanction a certain amount of wickedness provided it does not exceed due measure. To surmount this difficulty some have undeavored to modify the term \"wicked\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rasha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), taking it to mean \"engaged in worldly matters,\" or \"not subject to rule,\" \"lax,\" or again \"restless,\" as some translate the word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the word seems not to be used in any such senses, and bears uniformly the uncompromising signification assigned to it, \"to be wicked, unrighteous, guilty.\" The difficulty is not overcome by Plumptre's suggestion of the introduction of a little \"playful irony learned from Greek teachers,\" as if Koheleth meant, \"I have warned you, my friends, against over-righteousness, but do not jump at the conclusion that license is allowable. That was very far from my meaning.\" The connection of thought is this: in the previous verse Koheleth had denounced the Pharisaical spirit which virtually condemned the Divine ordering of circumstances, because vice was not at once and visibly punished, and virtue at once rewarded; and now he proceeds to warn against the deliberate and abominable wickedness which infers from God's long-suffering his absolute neglect and non- interference in mortal matters, and on this view plunges audaciously into vice and immorality, saying to itself, \"God hath forgotten: he hideth his face; he will never see it\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Such conduct may well be called \"foolish;\" it is that of \"the fool who says in his heart, There is no God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The actual wording of the injunction sounds to us somewhat strange; but its form is determined by the requirements of parallelism, and the aphorism must not be pressed beyond its general intention, \"Be not righteous nor wise to excess; be not wicked nor foolish to excess.\" Septuagint, \"Be not very wicked, and be not stubborn (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σκληρός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").\" Why shouldest thou die before thy time? literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "not in thy time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; prematurely, tempting God to punish thee by retributive judgment, or shortening thy days by vicious excesses. (For the former, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 10:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:31, 33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and for the latter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 7:23-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The Syriac contains a clause not given in any other version, \"that thou mayest not be hated.\" As is often the case, both in this book and in Proverbs, a general statement in one place ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is reduced",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by a contrariant or modified opinion in another. Thus the prolongation of the life of the wicked, noticed in ver. 15, is here shown to be abnormal, impiety in the usual course of events having a tendency to shorten life. In this way hasty generalization is corrected, and the Divine arrangement is vindicated. Ecclesiastes 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Up to this point all is clear: righteousness and wisdom are good and wholesome, and worth striving for; but even in these a transgressing of the right measure is possible (Luther remembers the summum just summa injuria), which has as a consequence, that they become destructive to man, because he thereby becomes a caricature, and either perishes rushing from one extreme into another, or is removed out of the way by others whose hatred he provokes. But it is strange that the author now warns against an excess in wickedness, so that he seems to find wickedness, up to a certain degree, praiseworthy and advisable. So much the stranger, since \"be no fool\" stands as contrast to \"show not thyself wise,\" etc.; so that \"but also be no wicked person\" was much rather to be expected as contrast to \"be not righteous over-much.\" Zckler seeks to get over this difficulty with the remark: \"Koheleth does not recommend a certain moderation in wickedness as if he considered it allowable, but only because he recognises the fact as established, that every man is by nature somewhat wicked.\" The meaning would then be: man's life is not free from wickedness, but be only not too wicked! The offensiveness of the advice is not thus removed; and besides, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " demands in a certain sense, an intentional wickedness, - indeed, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows, a wickedness in union with the fear of God. The correct meaning of \"be not wicked over-much\" may be found if for תרשׁע we substitute תּחטא; in this form the good counsel at once appears as impossible, for it would be immoral, since \"sinning,\" in all circumstances, is an act which carries in itself its own sentence of condemnation. Thus רשׁע must here be a setting oneself free from the severity of the law, which, although sin in the eyes of the over-righteous, is yet no sin in itself; and the author here thinks, in accordance with the spirit of his book, principally of that fresh, free, joyous life to which he called the young, that joy of life in its fulness which appeared to him as the best and fairest reality in this present time; but along with that, perhaps also of transgressions of the letter of the law, of shaking off the scruples of conscience which conformity to God-ordained circumstances brings along with it. He means to say: be not a narrow rigorist, - enjoy life, accommodate thyself to life; but let not the reins be too loose; and be no fool who wantonly places himself above law and discipline: Why wilt thou destroy thy life before the time by suffering vice to kill thee (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by want of understanding ruin thyself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: An old proverb, Sota 3a, says: \"A man commits no transgression unless there rules in him previously the spirit of folly.\") ",
        "children": []
      }
    ]
  }
]