[{"num":31,"verse":"In mid-May of the eleventh year of King Jehoiachin’s captivity, this message came to me from the Lord:"},{"num":2,"verse":"“Son of dust, tell Pharaoh, king of Egypt, and all his people: ‘You are as Assyria was—a great and mighty nation—like a cedar of Lebanon, full of thick branches and forest shade, with its head high up among the clouds. "},{"num":4,"verse":"Its roots went deep into the moist earth. It grew luxuriantly and gave streamlets of water to all the trees around. "},{"num":5,"verse":"It towered above all the other trees. It prospered and grew long thick branches because of all the water at its roots. "},{"num":6,"verse":"The birds nested in its branches, and in its shade the flocks and herds gave birth to young. All the great nations of the world lived beneath its shadow. "},{"num":7,"verse":"It was strong and beautiful, for its roots went deep to water. "},{"num":8,"verse":"This tree was taller than any other in the garden of God; no cypress had branches equal to it; none had boughs to compare; none equaled it in beauty. "},{"num":9,"verse":"Because of the magnificence that I gave it, it was the envy of all the other trees of Eden.’"},{"num":10,"verse":"“But Egypt has become proud and arrogant,” the Lord God says. “Therefore because she has set herself so high above the others, reaching to the clouds, "},{"num":11,"verse":"I will deliver her into the hands of a mighty nation, to destroy her as her wickedness deserves. I, myself, will cut her down. "},{"num":12,"verse":"A foreign army (from Babylon)—the terror of the nations—will invade her land and cut her down and leave her fallen on the ground. Her branches will be scattered across the mountains and valleys and rivers of the land. All those who live beneath her shade will go away and leave her lying there. "},{"num":13,"verse":"The birds will pluck off her twigs, and the wild animals will lie among her branches; "},{"num":14,"verse":"let no other nation exult with pride for its own prosperity, though it be higher than the clouds, for all are doomed, and they will land in hell along with all the proud men of the world.”"},{"num":15,"verse":"The Lord God says: “When she fell, I made the oceans mourn for her and restrained their tides. I clothed Lebanon in black and caused the trees of Lebanon to weep. "},{"num":16,"verse":"I made the nations shake with fear at the sound of her fall, for I threw her down to hell with all the others like her. And all the other proud trees of Eden, the choicest and the best of Lebanon, the ones whose roots went deep into the water, are comforted to find her there with them in hell. "},{"num":17,"verse":"Her allies, too, are all destroyed and perish with her. They went down with her to the netherworld—those nations that had lived beneath her shade."},{"num":18,"verse":"“O Egypt, you are great and glorious among the trees of Eden—the nations of the world. And you will be brought down to the pit of hell with all these other nations. You will be among the nations you despise, killed by the sword. This is the fate of Pharaoh and all his teeming masses,” says the Lord."}]