[{"header":"Joseph interprets dreams in prison"},{"num":40,"verse":"Some time later, both the wine steward and the baker for Egypt’s king offended their master, the king of Egypt."},{"num":2,"verse":"Pharaoh was angry with his two officers, the chief wine steward and the chief baker,"},{"num":3,"verse":"and he put them under arrest with the commander of the royal guard in the same jail where Joseph was imprisoned."},{"num":4,"verse":"The commander of the royal guard assigned Joseph to assist them. After they had been under arrest for some time,"},{"num":5,"verse":"both of them—the wine steward and the baker for Egypt’s king who were imprisoned in the jail—had dreams one night, and each man’s dream had its own meaning."},{"num":6,"verse":"When Joseph met them in the morning, he saw that they were upset."},{"num":7,"verse":"He asked the officers of Pharaoh who were under arrest with him in his master’s house, “Why do you look so distressed today?”"},{"num":8,"verse":"They answered, “We’ve both had dreams, but there’s no one to interpret them.”"},{"num":9,"verse":"The chief wine steward described his dream to Joseph: “In my dream there was a vine right in front of me,"},{"num":10,"verse":"and on the vine were three branches. When it budded, its blossoms appeared, and its clusters ripened into grapes."},{"num":11,"verse":"Pharaoh’s cup was in my hand, so I took the grapes, crushed them into Pharaoh’s cup, and put the cup in Pharaoh’s hand.”"},{"num":12,"verse":"Joseph said to him, “This is the dream’s interpretation: The three branches are three days."},{"num":13,"verse":"After three days, Pharaoh will give you an audience and return you to your position. You will put Pharaoh’s cup in his hand, just the way things were before when you were his wine steward."},{"num":14,"verse":"But please, remember me when you are doing well and be loyal to me. Put in a good word for me to Pharaoh, so he sets me free from this prison."},{"num":15,"verse":"I was stolen from the land of the Hebrews, and here too I’ve done nothing to be thrown into this dungeon.”"},{"num":16,"verse":"When the chief baker saw that the interpretation was favorable, he said to Joseph, “It was the same for me. In my dream, there were three baskets of white bread on my head."},{"num":17,"verse":"In the basket on top there were baked goods for Pharaoh’s food, but birds were eating them out of the basket on my head.”"},{"num":18,"verse":"Joseph responded, “This is the dream’s interpretation: The three baskets are three days."},{"num":19,"verse":"After three days, Pharaoh will give you an audience and will hang you from a tree where birds will peck your flesh from you.”"},{"num":20,"verse":"The third day was Pharaoh’s birthday, and he gave a party for all of his servants. Before all of his servants, he gave an audience to the chief wine steward and the chief baker."},{"num":21,"verse":"He returned the chief wine steward to his position, and he placed the cup in Pharaoh’s hand."},{"num":22,"verse":"But the chief baker he hanged, just as Joseph had said would happen when he interpreted their dreams for them."},{"num":23,"verse":"But the chief wine steward didn’t remember Joseph; he forgot all about him."}]