[{"header":"Pharaoh’s Two Servants"},{"num":40,"verse":"Some time later, both the senior security advisor to the king of Egypt and his head chef offended their master, Egypt’s king. "},{"num":2,"verse":"Pharaoh was so angry with his two officers—his senior security advisor and his head chef— "},{"num":3,"verse":"that he locked them up in the prison dungeon operated by the captain of the guard, the very place where Joseph was imprisoned. "},{"num":4,"verse":"The captain of the guard entrusted them to Joseph’s custody, who took care of them, since they were to remain there in custody for a number of days."},{"num":5,"verse":"Then the two of them each had a dream. They both had their dreams the same night, and there were separate interpretations for each dream—the senior security advisor and the head chef to the king of Egypt, who had confined them in prison. "},{"num":6,"verse":"When Joseph came to see them in the morning, he noticed how downcast they looked! They were both very sad. "},{"num":7,"verse":"So he asked Pharaoh’s officers, who were with him in prison in his master’s house, “Why are you so sad today?”"},{"num":8,"verse":"“We had a dream,” they replied, “but there’s no one to interpret it.”"},{"header":"The Security Advisor’s Dream"},{"num":9,"verse":"So the senior security advisor related his dream to Joseph. “In my dream,” he said, “all of a sudden there was a vine in front of me! "},{"num":10,"verse":"On the vine were three branches that budded. Blossoms shot out, and clusters grew up that produced ripe grapes. "},{"num":11,"verse":"Then, with Pharaoh’s cup in my hand, I took the grapes, squeezed them into Pharaoh’s cup, then handed the cup directly to Pharaoh.”"},{"num":12,"verse":"Then Joseph told him, “This is what your dream means: The three branches are three days. "},{"num":13,"verse":"Within three days, Pharaoh will encourage you and return you to your responsibilities. You’ll attend to Pharaoh’s personal wine cup, just as you did when you were his senior security advisor. "},{"num":14,"verse":"But keep me in mind when things go well for you. Be sure to extend kindness to me by remembering me to Pharaoh. Bring me out of this prison, "},{"num":15,"verse":"because I was kidnapped from the land of the Hebrews. Not only that, I haven’t done anything that deserves me being confined to this pit.”"},{"header":"The Head Chef’s Dream"},{"num":16,"verse":"When the head chef heard that the interpretation was good, he told Joseph, “I was also in my dream. All of a sudden, there were three baskets with white bread stacked on top of my head. "},{"num":17,"verse":"There was all kinds of food in the basket that was on top, including baked food for Pharaoh. The birds were eating them from the basket on my head.”"},{"num":18,"verse":"Joseph replied, “This is what your dream means: The three baskets are also three days. "},{"num":19,"verse":"Within three more days, Pharaoh will behead you and hang you on gallows, where birds will eat your flesh from you.”"},{"header":"The Dreams are Fulfilled"},{"num":20,"verse":"On the third day, which just happened to be Pharaoh’s birthday, he threw a party for all his servants. He lifted the head of both his senior security advisor and of his head chef in front of his servants— "},{"num":21,"verse":"that is, he restored his senior security advisor to his former responsibilities, including attending to Pharaoh’s personal wine cup, "},{"num":22,"verse":"but he beheaded and hanged the head chef, just as Joseph had interpreted for them. "},{"num":23,"verse":"Despite all of this, the senior security advisor not only didn’t remember Joseph, he deliberately forgot him."}]