[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15-17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then shall it be. . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The point on which the prophet dwells with indignant iteration is that it is a mere chance which half of the shapeless log is to be worshipped as a god, and which to be used for cooking the workmen’s dinner. Diagoras of Melos, the reputed atheist disciple of Democritus, is said to have thrown a wooden Hercules on his hearth, bidding the hero-god do a thirteenth labour, and boil his turnips (Del.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44:9-20 Image-making is described, to expose the folly of idolaters. Though a man had used part of a log for fuel, he fell down before an image made of the remainder, praying it to deliver him. Man greatly dishonours God, when he represents him after the image of man. Satan blinds the eyes of unbelievers, causing absurd reasonings in matters of religion. Whether men seek happiness in worldly things, or run into unbelief, superstition, or any false system, they feed on ashes. A heart deceived by pride, love of sin, and departure from God, turns men aside from his holy truth and worship. While the affections are depraved, a man holds fast the lie as his best treasure. Are our hearts set upon the wealth of the world and its pleasures? They will certainly prove a lie. If we trust to outward professions and doings, as if those would save us, we deceive ourselves. Self-suspicion is the first step towards self-deliverance. He that would deliver his soul, must question his conscience, Is there not a lie in my right hand?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then shall it be for a man to burn - It will afford materials for a fire. The design of this verse and the following is, to ridicule the idea of a man's using parts of the same tree to make a fire to cook his victuals, to warm himself, and to shape a god. Nothing could be more stupid than the conduct here referred to, and yet it is common all over the pagan world. It shows the utter debasement of the race, that they thus of the same tree make a fire, cook their food, and construct their gods. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. The same tree that furnishes the material for the god is in part used as fuel for a fire to cook his meals and warm himself!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thereto—rather, \"he falleth down before them,\" that is, such images [Maurer].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Having related the practices of idolaters, he now discovers the vanity and folly of them; that he maketh his fire and his god of the same materials, distinguished only by the art of man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then shall it be for a man to burn,.... And which indeed is the proper use of it, but not all that this man puts it to; only the boughs, and what he cuts off as useless to his purpose, and the chips he makes, which he commits to the fire: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he will take thereof, and warm himself; with some part of it he makes a fire in his parlour, and warms himself when it is cold weather: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, he kindleth it, and baketh bread; he heats his oven with another part of it, and bakes the bread he has made for himself and family to live on, and which is putting it to a good use: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, he maketh a god, and worshippeth it; he maketh a graven image, and falleth down thereto; the other part of the tree, and which is the better part, he makes an image of, and carves it, and calls it a god; and not only so, but when he has done, falls down and worships it; than which there cannot be a greater instance of stupidity and folly. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yea, he maketh a god, and worshippeth it; he maketh a graven image, and falleth down thereto; the other part of the tree, and which is the better part, he makes an image of, and carves it, and calls it a god; and not only so, but when he has done, falls down and worships it; than which there cannot be a greater instance of stupidity and folly. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then shall it be for a man to burn: for he will take of it, and {u} warm himself; indeed, he kindleth it, and baketh bread; yea, he maketh a god, and worshippeth it; he maketh it a graven image, and falleth down to it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then shall it be for a man to burn: for he will take of it, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{u}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " warm himself; indeed, he kindleth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and baketh bread; yea, he maketh a god, and worshippeth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; he maketh it a graven image, and falleth down to it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) He sets forth the obstinacy and malice of the idolaters who though they see by daily experience that their idols are no better than the rest of the matter of which they are made, yet they refuse the one part, and make a god of the other, as the papists make their cake god, and the rest of their idols.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. (with Lowth) Horace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sat.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. 8, 1 ff.:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Olim truncus eram ficulnus, inutile lignum,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Cum faber, incertus, scamnum faceretne Priapum,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Maluit esse Deum.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Also Wisd. Sol. 13:11–13.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word rendered “falleth down (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ṣâgad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")” is an Aramaic verb meaning “worship,” recurring in the O.T. only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 44:17; Isaiah 44:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is the root of the Arabic word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mosque",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (musğid).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then shall it be for a man to burn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The tree that has been planted, and nourished, and has grown up is naturally \"for a man to burn.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "That",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is its ordinary destination; and even the idolater applies it partly to this purpose; but out of a portion he maketh a god. The very same tree serves him both for fuel and for a divinity. Isaiah 44:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet now traces the origin of the idols still further back. Their existence or non-existence ultimately depends upon whether it rains or not. \"One prepares to cut down cedars, and takes holm and oak-tree, and chooses for himself among the trees of the forest. He has planted a fig, and the rain draws it up. And it serves the man for firing: he takes thereof, and warms himself; he also heats, and bakes bread; he also works it into a god, and prostrates himself; makes an idol of it, and falls down before it. The half of it he has burned in the fire: over the half of it he eats flesh, roasts a roast, and is satisfied; he also warms himself, and says, Hurrah, I am getting warm, I feel the heat. And the rest of it he makes into a god, into his idol, and says, Save me, for thou art my god.\" The subject of the sentence is not the carpenter of the previous verse, but \"any one.\" ארזים apparently stands first, as indicating the species; and in the Talmud and Midrash the trees named are really described as ארזים מיני. But tirzâh (from târaz, to be hard or firm) does not appear to be a coniferous tree; and the connection with 'allōn, the oak, is favourable to the rendering ἀγριοβάλανος (lxx, A. Th.), ilex (Vulg.). On 'immēts, to choose, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ארן (with Nun minusculum), plur. ארונים (b. Ros-ha Sana 23a) or ארנים (Para iii. 8), is explained by the Talmud as ערי, sing. ערא, i.e., according to Aruch and Rashi, laurier, the berries of which are called baies. We have rendered it \"fig,\" according to the lxx and Jerome, since it will not do to follow the seductive guidance of the similarity in sound to ornus (which is hardly equivalent to ὀρεινός).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The ἀρία of Theophrastus is probably quercus ilex, which is still called ἀρία; the laurus nobilis is now called βαΐηά, from the branches which serve instead of palm-branches.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The description is genealogical, and therefore moves retrogressively, from the felling to the planting. והיה in Isaiah 44:15 refers to the felled and planted tree, and primarily to the ash. מהם (of such as these) is neuter, as in Isaiah 30:6; at the same time, the prophet had the עצים (the wood, both as produce and material) in his mind. The repeated אף lays emphasis upon the fact, that such different things are done with the very same wood. It is sued for warming, and fore the preparation of food, as well as for making a god. On the verbs of adoration, hishtachăvâh (root shach, to sink, to settle down) and sâgad, which is only applied to idolatrous worship, and from which mes'gid, a mosque, is derived, see Holemann's Bibelstudien, i. 3. למו may no doubt be take as a plural ( equals  להם, as in Isaiah 30:5), \"such things (taila) does he worship,\" as Stier supposes; but it is probably pathetic, and equivalent to לו, as in Isaiah 53:8 (compare Psalm 11:7; Ewald, 247, a). According to the double application of the wood mentioned in Isaiah 44:15, a distinction is drawn in Isaiah 44:16, Isaiah 44:17 between the one half of the wood and the other. The repeated chetsyō (the half of it) in Isaiah 44:16 refers to the first half, which furnishes not only fuel for burning, but shavings and coals for roasting and baking as well. And as a fire made for cooking warms quite as much as one made expressly for the purpose, the prophet dwells upon this benefit which the wood of the idol does confer. On the tone upon the last syllable of chammōthı̄, see at Job 19:17; and on the use of the word ראה as a comprehensive term, embracing every kind of sensation and perception, see my Psychologie, p. 234. Diagoras of Melos, a pupil of Democritus, once threw a wooden standing figure of Hercules into the fire, and said jocularly, \"Come now, Hercules, perform thy thirteenth labour, and help me to cook the turnips.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The description is genealogical, and therefore moves retrogressively, from the felling to the planting. והיה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " refers to the felled and planted tree, and primarily to the ash. מהם (of such as these) is neuter, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; at the same time, the prophet had the עצים (the wood, both as produce and material) in his mind. The repeated אף lays emphasis upon the fact, that such different things are done with the very same wood. It is sued for warming, and fore the preparation of food, as well as for making a god. On the verbs of adoration, hishtachăvâh (root shach, to sink, to settle down) and sâgad, which is only applied to idolatrous worship, and from which mes'gid, a mosque, is derived, see Holemann's Bibelstudien, i. 3. למו may no doubt be take as a plural ( equals  להם, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), \"such things (taila) does he worship,\" as Stier supposes; but it is probably pathetic, and equivalent to לו, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Ewald, 247, a). According to the double application of the wood mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a distinction is drawn in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " between the one half of the wood and the other. The repeated chetsyō (the half of it) in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " refers to the first half, which furnishes not only fuel for burning, but shavings and coals for roasting and baking as well. And as a fire made for cooking warms quite as much as one made expressly for the purpose, the prophet dwells upon this benefit which the wood of the idol does confer. On the tone upon the last syllable of chammōthı̄, see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and on the use of the word ראה as a comprehensive term, embracing every kind of sensation and perception, see my Psychologie, p. 234. Diagoras of Melos, a pupil of Democritus, once threw a wooden standing figure of Hercules into the fire, and said jocularly, \"Come now, Hercules, perform thy thirteenth labour, and help me to cook the turnips.\" ",
            "children": []
          }
        ]
      }
    ]
  }
]