[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He feedeth on ashes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The verb passes readily through the meanings “feeding,” “pasturing,” “following after,” and the last is commonly accepted. The first, however, has the merit of greater vividness. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The “ashes” of the smith’s furnace become the symbols of the vanity of his work (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and yet he has not even the germ of truth which lies in the questions of the sceptic.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "FEEDING ON ASHESIsaiah 44:20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "FEEDING ON ASHES",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The prophet has been pouring fierce scorn on idolaters. They make, he says, the gods they worship. They take a tree and saw it up: one log serves for a fire to cook their food, and with compass and pencil and plane they carve the figure of a man, and then they bow down to it and say, ‘Deliver me, for thou art my god!’ He sums up the whole in this sentence of my text, in which the tone changes from bitter irony to astonished pity. Now, if this were the time and the place, one would like to expand and illustrate the deep thoughts in these words in reference to idolatry; thoughts which go dead in the teeth of a great deal that is now supposed to be scientifically established, but which may be none the more true for all that. He asserts that idolatry is empty, a feeding on ashes. He declares, in opposition to modern ideas, that the low, gross forms of polytheism and idol-worship are a departure from a previous higher stage, whereas to-day we are told by a hundred voices that all religion begins at the bottom, and slowly struggles up to the top. Isaiah says the very opposite. The pure form is the primitive; the secondary form is the gross, which is a corruption. They tell us too, nowadays, that all religion pursues a process of evolution, and gradually clears itself of its more imperfect and carnal elements. Isaiah says, ‘he cannot deliver his soul’; and no religion ever worked itself up, unless under the impulse of a revelation from without. That is Isaiah’s philosophy of idolatry, and I expect it will be accepted as the true one some day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But my text has a wider bearing. It not only describes, in pathetic language, the condition of the idolater, but it is true about all lives, which are really idolatrous in so far as they make anything else than God their aim and their joy. Every word of this text applies to such lives-that is to say, to the lives of a good many people listening to me now. And I would fain try to lay the truths here on some hearts. Let me just take them as they lie in the words before me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. A life that substantially ignores God is empty of all true satisfaction. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. A life that substantially ignores God is empty of all true satisfaction.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He feedeth on ashes’! Very little imagination will realise the force of that picture. The gritty cinders will irritate the lips and tongue, will dry up the moisture of the mouth, will interfere with the breathing, and there will be no nourishment in a sackful of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brethren, the underlying truth is this-God is the only food of a man’s soul. You pick up the skeleton of a bird upon a moor; and if you know anything about osteology-the science of bones-you will see, in the very make of its breast-bone and its wing-bones, the declaration that its destiny was to soar into the blue. You pick up the skeleton of a fish lying on the beach, and you will see in its very form and characteristics that its destiny is to expatiate in the depths of the sea. And, written on you, as distinctly as flight on the bird, or swimming on the fish, is this, that you are meant, by your very make, to soar up into the heights of the glory of God, and to plunge deep into the abysses of His infinite love and wisdom. Man is made for God. ‘Whose image and superscription hath it?’ said Christ. The coin belongs to the king whose head and titles are displayed upon it; and on your heart, friend, though a usurper has tried to recoin the piece, and put his own foul image on the top of the original one, is stamped deep that you belong to the King of kings, to God Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For what does our heart want? A perfect, changeless, all-powerful love. And what does our mind want? Reliable, guiding, inexhaustible, and yet accessible truth. And what does our will want? Commandments which have an authoritative ring in their very utterance, and which will serve for infallible guides for our lives. And what do our weak, sinful natures want? Something that shall free our consciences, and shall deliver us from the burden of our transgressions, and shall calm our fears, and shall quicken and warrant our lofty hopes. And what do men whose destiny is to live for ever want but something that shall go with them through all changes of condition, and, like a light in the midst of the darkest tunnel, shall burn in the passage between this and the other world, and shall never be taken away from them? We want a Person to be everything to us. No accumulation of things will satisfy a man. And we want all our treasures to be in one Person, and we need that that Person shall live as long as we live, and as long as we need shall be sufficient to supply us. And all this is only the spelling in many letters of the one name-God. That is what we want, that, and nothing less.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then the next step that I suggest to you is, that where a man will take God for the food of his spirit, and turn love and mind and will and conscience and practical life to Him, seeing Him in everything, and seeing all things in Him; saturating, as it were, the universe with the thought of God, and recreating his own spirit with communion of friendship to Him; to that man lower goods do first disclose their real sweetness, their most poignant delight, and their most solid satisfaction. To say of a world where God has set us, that it is all ‘vanity and vexation of spirit,’ goes in flat contradiction to what He said when, creation finished, He looked upon His world, and proclaimed to the waiting seraphim around that ‘it was very good.’ There is a view of the world which calls itself pious, but is really an insult to God; and the irreligious pessimism that is fashionable nowadays, as if human life were a great mistake, and everything were mean and poor and insufficient, is contrary to the facts and to the consciousness of every man. But if you make things first which were meant to be second, then you make what was meant to be food ‘ashes.’ They are all good in their place. Wealth is good; wisdom is good; success is good; love is good. And all these things may be enjoyed without God, and will each of them yield their proportional satisfaction to the part of our nature to which they belong. But if you put them first you degrade them; a change passes over them at once. A long row of cyphers means nothing; put a significant digit in front of it, and it means millions. Take away the digit, and it goes back to nothing again. The world, and all its fading sweets, if you put God in the forefront of it, and begin the series with Him, is sweet, though it may be fleeting, and is meant to be felt by us as such. But if you take away Him, it is a row of cyphers signifying nothing, and able to contribute nothing to the real, deepest necessities of the human soul. And so the old question comes-’Why do ye spend your money for that which is not bread?’ It is bread, if only you will remember first that God is the food of your souls. But if you try to nourish yourselves on it alone, then, as I said, a sackful of such ashes will not stay your appetite. Oh! brethren, God has not so blundered in making the world that He has surrounded us with things that are all lies, but He has so made it that whosoever flies in the face of the gracious commandment which is also an invitation, ‘Seek ye first the Kingdom of God and His righteousness,’ has not only no security that the ‘other things’ shall ‘be added unto him,’ but has the certainty that though they were added to him, in degree beyond his dreams and highest hopes, they would avail nothing to satisfy the hunger of his heart. As George Herbert puts it-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Shadows well mounted, dreams in a career,Embroidered lies, nothing between two dishes,These are the pleasures here.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Shadows well mounted, dreams in a career,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Embroidered lies, nothing between two dishes,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "These are the pleasures here.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He feedeth on ashes,’ because he does not take God for the food of his soul.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. So, secondly, notice that a life which thus ignores God is tragically unaware of its own emptiness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. So, secondly, notice that a life which thus ignores God is tragically unaware of its own emptiness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘A deceived heart hath turned him aside.’ That explains how the man comes to fancy that ashes are food. His whole nature is perverted, his vision distorted, his power of judgment marred. He is given over to hallucinations and illusions and dreams.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That explains, too, why men persist in this feeding on ashes after all experience. There is no fact stranger or more tragical in our histories than that we do not learn by a thousand failures that the world will not avail to make us restful and blessed. You will see a dog chasing a sparrow,-it has chased hundreds before and never caught one. Yet, when the bird rises from the ground, away it goes after it once more, with eager yelp and rush, to renew the old experience. Ah! that is like what a great many of you are doing, and you have not the same excuse that the dog has. You have been trying all your lives-and some of you have grey hairs on your heads-to slake your thirst by dipping leaky buckets into empty wells, and you are at it yet. As some one says, ‘experience throws a light on the wave behind us,’ but it does very little to fling a light on the sea before us. Experience confirms my text, for I venture to put it to the experience of every man-how many moments of complete satisfaction and rest can you summon up in your memory as having been yours in the past? ‘He that loveth silver shall not be satisfied with silver, nor he that loveth abundance with increase.’ Appetite always grows faster than supply. And so, though we have tried them in vain so often, we turn again to the old discredited sources, and fancy we shall do better this time. Is it not strange? Is there any explanation of it, other than that of my text? ‘A deceived heart hath turned him aside.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And that deceived heart, stronger than experience, is also stronger than conscience. Do you not know that you ought to be Christians? Do you not know that it is both wrong and foolish of you to ignore God? Do you not know that you will have to answer for it? Have you not had moments of illumination when there has risen up before you the whole vanity of your past lives, and when you have felt ‘I have played the fool, and erred exceedingly’? And yet, what has come of it all with some of you? Why, what comes of it with the drunkard in the Book of Proverbs, who, as soon as he has got over the bruises and the sickness of his last debauch, says, ‘I will seek it yet again.’ ‘A deceived heart hath turned him aside.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how is it that this hallucination that you have fed full and been satisfied, when all the while your hunger has not been appeased, can continue to act on us? For the very plain reason that every one of us has in himself a higher and a lower self, a set of desires for the grosser, more earthly, and, using the word in its proper sense, worldly sort-that is to say, directed towards material things, and a higher set which look right up to God if they were allowed fair play. And of these two sets-which really are one at bottom, if a man would only see it-the lower gets the upper hand, and suppresses the higher and the nobler. And so in many a man and woman the longing for God is crushed out by the grosser delights of sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One sometimes hears of cowardly, unmanly sailors, who in shipwreck push the women and children aside, and struggle to the boats. And there are in all of us groups of sturdy mendicants, so to speak, who elbow their way to the front, and will have their wants satisfied. What becomes of the gentler group that stand behind, unnoticed and silent? It is an awful thing when men and women do, as so many of us do, pervert the tastes that are meant to lead them to God, in order to stifle the consciousness that they need a God at all. There are tribes of low savages who are known as ‘clay-eaters.’ That is what a great many of us are; we feed upon the serpent’s meat, the dust of the earth, and let all the higher heavenly food, which addresses itself first to loftier desires, but also satisfies these lower ones, stand unnoticed, unsought for, unpartaken of. Dear friends, do not be befooled by that treacherous heart of yours, but let the deepest voices in your soul be heard. Understand, I beseech you, that their cry is for no created person or thing, and that only God Himself can satisfy them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, notice that a life thus ignoring God needs a power from without to set it free. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, notice that a life thus ignoring God needs a power from without to set it free.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He cannot deliver his soul.’ Can you? Do you think you can break the habits of a lifetime? Do you think that, left to yourself, you would ever have any inclination to break them? Certainly, left to yourselves, you will never have the power. These long indulged appetites of ours grow with indulgence; and that which first was light as a cobweb, and soft as a silken bracelet, becomes heavier and solider until it is an iron fetter upon the limb, which no man can break. There is nothing more awful in life than the influence of habit, so unthinkingly acquired, so inexorably certain, so limiting our possibilities and enclosing us in its grip.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brethren, there is something more wanted than yourselves to break this chain. You have tried, I have no doubt, in the course of your lives, more and more resolutely, to cure yourselves of some more or less unworthy habits. They may be but mere slight tricks of attitude or intonation, or movement. Has your success been such as to encourage you to think that you can revolutionise your lives, and dethrone the despots that have ruled over you in the past? I leave the question to yourselves. To me it seems that the world of men is certain to go on ignoring God, and seeking its delight only in the world of creatures, unless there comes in an outside power into the heart of the world and revolutionises all things.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is that power that I have to preach, the Christ who is the ‘Bread of God that came down from Heaven,’ who can lift up any soul from the most obstinate and long-continued grovelling amongst the transitory things of this limited world, and the superficial delights of sense and a gratified bodily life; who can bring the forgiveness which is essential, the deliverance from the power of evil which is not less essential, and who can fill our hearts with Himself the food of the world. He comes to each of us; He comes to you, with the old unanswerable question upon His lips, ‘Why do you spend your money for that which is not bread, and your labour for that which satisfieth not?’ It is unanswerable, for you can give no reason sufficient for such madness. All that you could say, and you durst not say it to Him, is, ‘a deceived heart hath turned me aside.’ He comes with the old gracious word upon His lips, ‘Take! eat! this is My body which is broken for you.’ He offers us Himself. He can stay all the hungers of all mankind. He can feed your heart with love, your mind with truth which is Himself, your will with His sweet commands.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As of old He made the thousands sit down upon the grass, and they did all eat and were filled, so He stands before the world to-day and says, ‘I am the Bread of Life; He that cometh to Me shall never hunger.’ And if you will only come to Him-that is to say, will trust yourselves altogether to the merits of His sacrifice, and the might of His indwelling Spirit-He will take away all the taste for the leeks and onions and garlic, and will give you the appetite for heavenly food. He will spread for you a table in the wilderness, and what would else be ashes will become sweet, wholesome, and nourishing. Nor will He cease there, for in His own good time He will call us to the banqueting house above, where He will make us to sit down to meat, and come forth Himself and serve us. Here, hunger often brings pain, and eating is followed by repletion. But there, appetite and satisfaction will produce each other perpetually, and the blessed ones who then hunger will not hunger so as to feel faintness or emptiness, nor be so filled as to cease to desire larger portions of the Bread of God. I beseech you, cry, ‘Lord, ever more give us this bread!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44:9-20 Image-making is described, to expose the folly of idolaters. Though a man had used part of a log for fuel, he fell down before an image made of the remainder, praying it to deliver him. Man greatly dishonours God, when he represents him after the image of man. Satan blinds the eyes of unbelievers, causing absurd reasonings in matters of religion. Whether men seek happiness in worldly things, or run into unbelief, superstition, or any false system, they feed on ashes. A heart deceived by pride, love of sin, and departure from God, turns men aside from his holy truth and worship. While the affections are depraved, a man holds fast the lie as his best treasure. Are our hearts set upon the wealth of the world and its pleasures? They will certainly prove a lie. If we trust to outward professions and doings, as if those would save us, we deceive ourselves. Self-suspicion is the first step towards self-deliverance. He that would deliver his soul, must question his conscience, Is there not a lie in my right hand?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He feedeth on ashes - There have been various interpretations of this. Jerome renders it, 'A part of it is ashes;' the Chaldee, 'Lo! half of the god is reduced to ashes;' the Septuagint, 'Know thou that their heart is ashes.' The word rendered here 'feedeth' (רעה  ro‛eh) means properly \"to feed, graze, pasture\"; and then, figuratively, to delight, or take pleasure in any person or thing ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 28:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 29:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'Ephraim feedeth on wind,' it means to strive after something vain or unprofitable; to seek that which will prove to be vain and unsatisfactory. So here it means, that in their idol-service they would not obtain that which they sought. It would be like a man who sought for food, and found it to be dust or ashes; and the service of an idol compared with what man needed, or compared with the true religion, would be like ashes compared with nutritious and wholesome diet. This graphic description of the effect of idolatry is just as true of the ways of sin, and of the pursuits of the world now. It is true of the frivolous and the fashionable; of those who seek happiness in riches and honors; of all those who make this world their portion, that they are feeding on ashes - they seek that which is vain, unsubstantial, unsatisfactory, and which will yet fill the soul itself with disgust and loathing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A deceived heart hath turned him aside - This is the true source of the difficulty; this is the fountain of all idolatry and sin. The heart is first wrong, and then the understanding, and the whole conduct is turned aside from the path of truth and duty (compare Romans 1:28).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A deceived heart hath turned him aside - This is the true source of the difficulty; this is the fountain of all idolatry and sin. The heart is first wrong, and then the understanding, and the whole conduct is turned aside from the path of truth and duty (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A lie in my right hand - The right hand is the instrument of action. A lie is a name often given to an idol as being false and delusive. The sense is, that that which they had been making, and on which they were depending, was deceitful and vain. The work of their right hand - the fruit of their skill and toil, was deceptive, and could not save them. The doctrine is, that that which sinners rely on to save their souls; that which has cost their highest efforts as a scheme to save them, is false and delusive. All schemes of religion of human origin are of this description: and all will be alike deceptive and ruinous to the soul. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A lie in my right hand - The right hand is the instrument of action. A lie is a name often given to an idol as being false and delusive. The sense is, that that which they had been making, and on which they were depending, was deceitful and vain. The work of their right hand - the fruit of their skill and toil, was deceptive, and could not save them. The doctrine is, that that which sinners rely on to save their souls; that which has cost their highest efforts as a scheme to save them, is false and delusive. All schemes of religion of human origin are of this description: and all will be alike deceptive and ruinous to the soul. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. feedeth on ashes—figuratively, for the idolater delights in what is vain (Pr 15:14; Ho 12:1). \"Feedeth on wind.\" There is an allusion, perhaps, also, to the god being made of a tree, the half of which was reduced to ashes by fire (Isa 44:15-17); the idol, it is implied, was no better, and could, and ought, to have been reduced to ashes like the other half.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "deceived heart—The heart and will first go astray, then the intellect and life (Ro 1:28; Eph 4:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lie in … right hand—Is not my handiwork (the idol) a self-deceit?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He feedeth on ashes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is an unsavoury, unprofitable, and pernicious food, and no less unsatisfying, uncomfortable, and mischievous is the worship of idols. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A deceived heart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a mind corrupted and deceived by long custom, deep prejudice, gross error, and especially by his own lusts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hath turned him aside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the way of truth, from the knowledge and worship of the true God, unto this brutish idolatry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Cannot deliver his soul from the snares.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and dangers of idolatry. This ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cannot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be understood morally, so as to note the great difficulty, but not the utter impossibility of it; for if idolaters would consider things, they might be convinced of and turned from that gross way of wickedness, as is implied from the foregoing verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is there not a lie in my right hand?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what is this idol, which I have made with my right hand, i.e. with all my strength? as was said before; the right hand being the strongest and the chief instrument of this and other actions: which I set at my right hand, as the true God is said in Scripture to be at ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the right hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 16:8 109:31 121:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 109:31 121:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": which I highly honour; for the most honourable place was on the right hand, as is known: to which I look and trust for relief and assistance, which God in Scripture is said to afford to his people, by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being at and holding of their right hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 73:23 110:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 110:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". What, I say, is this idol Is it not a lie, which though it seems and pretends to be something, and to be a god, yet in truth is nothing but vanity and falsehood, deceiving all that put their trust in it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He feedeth of ashes,.... That is, the idolater delights in his idol, pleases himself with seeks comfort and satisfaction from it, fills and feeds himself with hopes and expectations of being helped and delivered by it; but this is all vain hope, a mere delusion; it is as if a man fed on ashes instead of food; it is feeding on that which has no savour nor substance, can yield no nourishment, but, on the contrary, is pernicious and hurtful; and it is like Ephraim's feeding on wind, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or on chaff instead of wheat, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and so such who feed upon and delight themselves in sinful lusts, or false doctrines, may be said to feed on the same sort of food: and here it may be true of the idol in a literal sense; part of the wood of which it was made being reduced to ashes, to which some respect may be had, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that itself was capable of the same fate. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"behold his god, part of it is ashes;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so the Vulgate Latin version: \"a deceived heart hath turned him aside\" from the true God, and the right worship of him, unto idolatry; the heart of man is deceitful, and desperately wicked; a man needs no other to entice him, and draw him away into any sin, and from the living God, than his own evil heart; which, being deceived itself, deceives him, and leads him to the commission of such things as are contrary to reason and common sense: and he is so infatuated with them, and possessed with a strong belief of them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he cannot deliver his soul: divest himself of his erroneous and wicked principles, and leave his idolatrous practices, or be persuaded that he is in the wrong: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nor say, is there not a lie in my right hand? that the idol, which his right hand has made, is a lie, a mere vanity, not to be depended upon and trusted in: or which is in, or \"at his right hand\" (m); and worshipped by him, and is highly esteemed and loved as his right hand; this he cannot be persuaded to believe, and say that it is a falsehood and a work of errors; such is the force and fascination of idolatry, when once persons are ensnared and entangled with it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) \"quod est in dextera mea\", Piscator; \"ad dexteram meam\", Junius & Tremellius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) \"quod est in dextera mea\", Piscator; \"ad dexteram meam\", Junius & Tremellius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He feedeth {z} on ashes: a deceived heart hath turned him aside, that he cannot deliver his soul, nor say, Is there not a lie in my right hand?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He feedeth ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{z}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on ashes: a deceived heart hath turned him aside, that he cannot deliver his soul, nor say, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "Is there",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not a lie in my right hand?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) He is abused as one that would eat ashes, thinking to satisfy his hunger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He feedeth on ashes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit., “a shepherd of ashes”. Duhm rather fancifully suggests that the image may be that of a man trying to feed his flock on a pasture that has been reduced to ashes: “A shepherd of (or on) ashes is he whom a deceived heart hath turned aside” (from the ways of reason). Another rendering might be: “One who finds satisfaction in ashes is he whom, &c.” For this sense of the verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "râ‘âh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (?); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. (Gesenius, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lexicon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "12, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sub verbo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and he shall not",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "he",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall not",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deliver his soul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 44:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Is there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not a lie",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] Am I not cleaving to that which will disappoint my hope?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He feedeth on ashes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e. on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vanity - on what can give no support or sustenance (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A deceived heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either self-deceived, or imposed upon by illusions from without; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the seeming power of the idols, as seen in the victories and conquests of their worshippers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He cannot deliver his soul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The deceived soul is bound in trammels, which it feels to be irksome, and from which it would fain be free. But it cannot deliver itself. Deliverance must come from some external source; in other words, man needs a Deliverer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Is there not a lie in my right hand?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " An idol is \"a lie.\" It professes to have power, strength, ability to help and save, whereas it has no power at all. It cannot even save itself. Savages often beat their fetishes. Diagoras of Melos threw an image of Hercules into the fire on which he was cooking his dinner, and bade Hercules make himself of some use by boiling his turnips. The powerlessness of idols even to help themselves is represented with much force in the Book of Baruch (6:12-15, 17-22, 27, 49, etc.). Isaiah 44:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This exposure of the infatuation of idolatry closes with an epiphonem in the form of a gnome (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"He who striveth after ashes, a befooled heart has led him astray, and he does not deliver his soul, and does not think, Is there not a lie in my right hand?\" We have here a complete and self-contained sentence, which must not be broken up in the manner proposed by Knobel, \"He hunts after ashes; his heart is deceived,\" etc. He who makes ashes, i.e., things easily scattered, perishable, and worthless, the object of his effort and striving (compare rūăch in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), has bee led astray from the path of truth and salvation by a heart overpowered by delusion; he is so certain, that he does not think of saving his soul, and it never occurs to him to say, \"Is there not a lie in my right hand?\" All that belongs to idolatry is sheqer - a fabrication and a lie. רעה means primarily to pasture or tend, hence to be concerned about, to strive after. הותל is an attributive, from tâlal - hâtal, ludere, ludificare (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]