[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have blotted out, as a thick cloud.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mist. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Authorised Version half suggests the idea that it is the cloud that hides the sins from view. What is meant is that the sins of Israel are put away, as the sun and wind drive away the mists and fogs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and that this is, in idea at least, if not in time, prior to the conversion as that which makes it possible.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "MacLaren's ExpositionsIsaiahWRITING BLOTTED OUT AND MIST MELTEDIsaiah 44:22. Isaiah has often and well been called the Evangelical Prophet. Many parts of this second half of his prophecies referring to the Messiah read like history rather than prediction. But it is not only from the clearness with which the great figure of the future king of Israel stands out on his page that he deserves that title. Other thoughts belonging to the very substance of the gospel appear in him with a vividness and a frequency which well warrants its application to him. He speaks much of the characteristically Christian conceptions of sin, forgiveness, and redemption. The whole of the latter parts of this book are laden with that burden. They are gathered up in the extraordinarily pregnant and blessed words of my text, in which metaphors are blended with much disregard to oratorical propriety, in order to bring out the whole fulness of the prophet’s meaning. ‘I have blotted out’-that suggests a book. ‘I have blotted out as a cloud’-that suggests the thinning away of morning mists. The prophet blends the two thoughts together, and on that great revelation of a forgiveness granted before it has been asked, and given, not only to one penitent soul wailing out like the abased king of Israel in his deep contrition, ‘according to the multitude of Thy tender mercies blot out my transgressions,’ but promised to a whole people, is rested the great invitation, ‘Return unto Me, for I have redeemed thee.’ Let me try and bring out, as simply and earnestly as I can, the great teaching that is condensed into these words.I. Observe here the penetrating glance into the very essential characteristics of all sin. There are two words, as you see, employed in my text, ‘transgressions’ and ‘sins.’ They apply to the same kind of actions, but they look at them from different angles and points of view. They are partially synonymous, but they cover very various conceptions, and if we take note of the original significations of the two words, we get two very important and often forgotten thoughts. For that expression rendered in my text, and rendered correctly enough -transgressions-means at bottom, ‘rebellion,’ the rising up of a disobedient will, not only against a law, but against a lawgiver. There we have a deepening of that solemn fact of a man’s wrongdoing, which brings it into immediate connection with God, and marks its foulness by reason of that connection. Ah! brethren, it makes all the difference to a man’s notions of right and wrong, whether he stops on the surface or goes down to the depths; whether he says to himself, ‘The thing is a vice; it is wrong; it is contrary to what I ought to be’; or whether he gets down to the darker, deeper, and truer thought, and says, ‘The damnable thing about every little evil that I do is this, that in it I-poor puny I-perk myself up against God, and say to Him, “Thou wilt; wilt thou? I shall not!”‘ Sin is rebellion. And so what becomes of the hazy distinction between great sins and little ones? An overt act of rebellion is of the same gravity, whatsoever may be its form. The man that lifts his sword against the sovereign, and the man behind him that holds his horse, are equally criminal. And when once you let in the notion that in all our actions we have to do with a Person, to whom we are bound to be obedient, then the distinction which sophisticates so many people’s consciences, and does such infinite harm in so many lives, between great and small transgressions, disappears altogether. Sin is rebellion. Then the other word of my text is equally profound and significant. For it, literally taken, means-as the words for ‘sin’ do in other languages besides the Hebrew-missing a mark. Every wrong thing that any man does is beside the mark, at which he, by virtue of his manhood, and his very make and nature, ought to aim. It is beside the mark in another sense than that. As some one says, ‘A rogue is a roundabout fool.’ No man ever secures that, and only that, which he aims at by any departure from the straight path of imperative duty. For if he gets some vulgar and transient titillation of appetite, or satisfaction of desire, he gets along with it something that takes all the gilt off the gingerbread, and all the sweetness out of the satisfaction. So that it is always a blunder to be bad, and every arrow that is drawn by a sinful hand misses the target to which all our arrows should be pointed, and misses even the poor mark that we think we are aiming at. Take these two thoughts with you-I will not dwell on them, but I desire to lay them upon all your hearts-all evil is sin, and every sin is rebellion against God, and a blunder in regard to myself.II. And now I come to the second point of our text, and ask you to note the permanent record which every sin leaves. I explained in the earlier part of my remarks that we have a case here of the thing that horrifies rhetoricians, but does not matter a bit to a prophet, the blending or confusing of two metaphors. The first of them-’I have blotted out’-suggests a piece of writing, a book, or manuscript of some sort. And the plain English of what lies behind that metaphor is this solemn thought, which I would might blaze before each of us, in all our lives, that God’s calm and all-comprehensive knowledge and remembrance takes and keeps filed, and ready for reference, the whole story of our whole acts. There is a book. It is a violent metaphor, no doubt, but there is a solemn truth underlying it which we are too apt to forget. The world is groaning nowadays with two-volume memoirs of men that nobody wants to know anything more about. But every man is ever writing his autobiography with invisible but indelible ink. You have seen those old-fashioned ‘manifold writers’ in your places of business, and the construction of them is this: a flimsy sheet of tissue paper, a bit of black to be put in below it, and then another sheet on the other side; and the pen that writes on the flimsy top surface makes an impression that is carried through the black to the sheet below, and there is a duplicate which the writer keeps. You and I, upon the flimsinesses of this fleeting-sometimes, we think, futile-life, are penning what is neither flimsy nor futile, which goes through the opaque dark, and is reproduced and docketed yonder. That is what we are doing every day and every minute, writing, writing, writing our own biography. And who is going to read it? Well, God does read it now, and you will have to read it out one day, and how will you like that? This metaphor will bear a little further expansion. Scripture tells us, and conscience tells us, what manner of manuscript it is that we are each so busy adding line upon line to. It is a ledger; it is an indictment. Our own handwriting puts down in the ledger our own debts, and we cannot deny our own handwriting when we are confronted with it. It is an indictment, and our own hand draws it, and we have to plead ‘guilty,’ or ‘not guilty,’ to it. Which, being translated into plain fact, is this-that there goes with all our deeds some sense and reality of responsibility for them, and that all our rebellions against God, and our blunders against self, be they great or small, carry with them a sense of guilt and a reality of guilt whether we have the sense of it or not. God has a judgment at this moment about every man and woman, based upon the facts of the unfinished biography which they are writing. Mystical and awful, yet blessed and elevating, is the thought that nothing-nothing, ever dies; and that what was, is now, and always will be. Amongst the specimens from the coal measures in a museum you will find slabs upon which the tiniest fronds of ferns that grew nobody knows how many millenniums since are preserved for ever. Our lives, when the blow of the last hammer lays them open, will, in like manner, bear the impress of the minutest filament of every deed that we have ever done. But my metaphor will bear yet further expansion, for this autobiographical record which we are busy preparing, which is at once ledger and indictment, is to be read out one day. There is a great scene in the last book of Scripture, the whole solemn significance of which, I suppose, we shall not understand till we have learned it by experience, but the truth of which we have sufficient premonitions to assure us of, which declares that at a given time, on the confines of Eternity, the Great White Throne is to be set, and the books are to be opened, and the dead are judged ‘out of the books,’ which, the seer goes on to explain, is ‘according to their works.’ The story of Esther tells us how the sleepless monarch in the night-watches sent for the records of the kingdom and had them read to him. The King who never slumbers nor sleeps, in that dawning of heaven’s eternal morning, will have the books opened before Him, and my deeds will be read out. He and I will hear them, whether any else may hear or no. That is my second lesson.III. The third is, that we have here suggested the darkening power of sin. The prophet, as I said, mixes metaphors. ‘I have blotted out as a cloud thy transgressions.’ He uses two words for ‘cloud’ here; both of them mean substantially the same thing, and both suggest the same idea. When cloud fills the sky it darkens the earth, and shuts out the sunshine and the blue, it closes the petals of the little flowers, it hushes the songs of the birds. Sin makes for the sinning man ‘an under-roof of doleful grey,’ which shuts out all the glories above. Put that metaphor into plain English, and it is just this, ‘Your sins have separated between you and your God, and your iniquities have hid His face from you that He will not hear.’ It is impossible for a man that has his heart all stiffened by the rebellion of his will against God’s, or all seething with unrestrained passions, or perturbed with worldly longings and desires, to enter into calm fellowship with God or to keep the thought of God clear before his mind. For we know Him, not by sense nor by reason, but by sympathy and by feeling. And whatsoever comes in to disturb a man’s purity, comes in to hinder his vision of God. ‘Blessed are the pure in heart, for they’-and they only-’shall see God.’ Whenever from the undrained swamps of my own passions and sensualities, or from the as malarious though loftier grounds of my own self-regard, be I student or thinker, or moral man, there rise up these light mists, they will fill the sky and hide the sun. On a winter’s night you will see the Pleiades, or other bright constellations, varying in brilliancy from moment to moment as some invisible cloud-wrack floats across the heavens. So, brother, every evil thing that we do rises up and gets diffused through our atmosphere, and blots out from our vision the face of God Himself, the blessed Son. Not only by reason of dimming and darkening my thoughts of Him is my sin rightly compared to an obscuring cloud; but the comparison also holds good because, just as the blanket of a wet mist swathing the wintry fields prevents the sunshine from falling upon them in blessing, so the accumulated effect of my evil doings and evil designings and thinkings and willings comes between me and all spiritual blessings which God can bestow, so that the very light of light, the highest blessings that He yearns to give, and we faint for want of possessing, are impossible even to His love to communicate until the cloud is swept away. So my sin darkens my soul, and separates me from the light of life. But the metaphor carries with it, too, a suggestion of the limitations of the power of sin. For when the cloud is thickest and most obscuring it only hugs the earth, and rises but a little way Into the heavens; and far above it the blue is as blue, and the sunshine as bright, as if there were no mist or fog in the lower regions. Therefore, let us remember that, while the cloud must veil us from the light, the light is above it, and ‘every cloud that veileth love’ may some day be thinned away by the love it veils.IV. That brings me to the last word of my text,-viz. the prophet’s teaching as to the removal of the sin. We have to carry both the metaphors together with us here. ‘I have blotted out’-that is, as erasing from a book. ‘I have blotted out as a cloud’-that is, the thinning away of the mist. The blurred and stained page can be cancelled. Chemicals will take the ink out. ‘The blood of Jesus Christ cleanseth from all sin’; and it, passed over all that foul record, makes it pure and clean. ‘What I have written, I have written,’ said Pilate in his obstinacy. ‘What I have written, I have written,’ wails many a man in the sense of the irrevocableness of his past. Brother! be not afraid. Christ can take away all that stained record, and give you back the page ready to receive holier words. The cloud is thinned away. What thins the cloud? As I have said, the light which the cloud obscures, shining on the upper surface of it, dissipates it layer by layer till it gets down at last to the lowermost, and then rends a gap in it, and sends the shaft of the sunbeam through on to the green earth. And that is only a highly imaginative way of saying that it is the love against which we transgress that thins away the cloud of transgression, and at last, as the placid moon, by simply shining silently on, will sweep the whole sky clear of its clouds, dissipates them all, and leaves the calm blue. God forgives. The ledger account-if I may use so grossly commercial a figure-is settled in full; the indictment is endorsed, ‘acquitted.’ He remembers the sins only to breathe into the child’s heart the assurance of pardon, and no obstacle rises by reason of forgiven transgression between the sinning man and the reconciled God. Now, all this preaching of Isaiah’s is enlarged and confirmed, and to some extent the rationale of it is set before us in the great Gospel truth of forgiveness through the blood of Jesus Christ. Unless we know that truth, we may well stand amazed and questioning as to whether a righteous God, administering a rigorous universe, can ever pardon sin. And unless we know that by the Spirit of Jesus Christ, granted to our spirits, our whole nature may be remade and moulded, we might well be tempted to say, Ah! the Ethiopian cannot change his skin nor the leopard his spots. But Jesus Christ can change more than skin, even the heart and spirit, the inmost depths of the nature. Now, brother, my text speaks of this great blotting out as a past fact. It is so in the divine mind with regard to each of us, because Christ’s great work has made reconciliation and atonement for all the sins of all the world. And on the fact that it is past is based the exhortation, ‘Return unto Me, for I have redeemed thee.’ God does not say, ‘Come back and I will forgive’; He does not say, ‘Return and I will blot out’; but He says, ‘Return, for I have blotted out.’ Though accomplished, the forgiveness has to be appropriated by individual faith. The sins of the world have been borne, and borne away, by the Lamb of God, but your sins are not borne away unless your hand is laid on this head. If it is, then you do not need to say, ‘What I have written is written, and it cannot be blotted out.’ But as in the old days a monk would take some manuscript upon which filthy stories about heathen gods and foolish fables were written, and erase these to write the legends of saints, or perhaps the words of the Gospels themselves; so on our hearts, which have been scribbled all over with obscenities and follies, He will write His new best name of Love, and we may be epistles of Christ, written with the Spirit of the living God.Matthew Henry's Concise Commentary44:21-28 Return unto me. It is the great concern of those who have backslidden from God, like the Jews of old, to hasten their return to him. The work of redemption wrought for us by Christ, encourages to hope for all blessings from him. Our transgressions and our sins are as a thick cloud between heaven and earth: sins separate between us and God; they threaten a storm of wrath. When God pardons sin, he blots out, he dispels this cloud, this thick cloud, so that the way to heaven is open again. The cloud is scattered by the Sun of righteousness; it is quite gone. The comforts that flow into the soul when sin is pardoned, are like clear shining after clouds and rain. Let not Israel be discouraged; nothing is too hard for God: having made all, he can make what use he pleases of any. Those that learn to know Christ, see all knowledge to be foolishness, in comparison with the knowledge of him. And his enemies will find their counsels turned into foolishness, and themselves taken in their craftiness. The exact fulfilling the prophecies of Scripture confirms the truth of the whole, and proves its Divine origin. The particular favours God designed for his people in captivity, were foretold here, long before they went into captivity. Very great difficulties would be in the way of their deliverance; but it is promised that by Divine power they should all be removed. God knew who should be the Deliverer of his people; and let his church know it, that when they heard such a name talked of, they might know their redemption drew nigh. It is the greatest honour of the greatest men, to be employed as instruments of the Divine favour to his people. In things wherein men serve themselves, and look no further, God makes them do all his pleasure. And a nobler Shepherd than Cyrus does his Father's will, till his work is fully completed.Barnes' Notes on the BibleI have blotted out - The word used here (מחח  mâchâh), means properly \"to wipe away,\" and is often applied to sins, as if the account was wiped off, or as we express it, blotted out (Psalm 51:3, Psalm 51:11; see the note at Isaiah 43:25). The phrase, 'to blot out sins like a cloud,' however, is unusual, and the idea not very obvious. The true idea would be expressed by rendering it, 'I have made them to vanish as a thick cloud;' and the sense is, as the wind drives away a thick cloud, however dark and frowning it may be, so that the sky is clear and serene, so God had caused their sins to disappear, and had removed the storm of his anger. Nothing can more strikingly represent sin in its nature and consequences, than a dense, dark, frowning cloud that comes over the heavens, and shuts out the sun, and fills the air with gloom; and nothing can more beautifully represent the nature and effect of pardon than the idea of removing such a cloud, and leaving the sky pure, the air calm and serene, and the sun pouring down his beams of warmth and light on the earth. So the soul of the sinner is enveloped and overshadowed with a dense cloud; but pardon dissipates that cloud, and it is calm, and joyful, and serene.And as a cloud - The Chaldee render this, 'As a flying cloud.' The difference between the two words rendered here 'thick cloud,' and 'cloud' (  עב  ‛âb and ענן  ‛ânân) is, that the former is expressive of a cloud as dense, thick, compact; and the latter as covering or veiling the heavens. Lowth renders the latter word 'Vapour;' Noyes, 'Mist.' Both words, however, usually denote a cloud. A passage similar to this is found in Demosthenes, as quoted by Lowth: 'This decree made the danger then hanging over the city pass away like a cloud.Return unto me - Since your sins are pardoned, and such mercy has been shown, return now, and serve me. The argument here is derived from the mercy of God in forgiving them, and the doctrine is, that the fact that God has forgiven us imposes the strongest obligations to devote ourselves to his service. The fact that we are redeemed and pardoned is the highest argument why we should consecrate all our powers to him who has purchased and forgiven us. Jamieson-Fausset-Brown Bible Commentary22. blotted out—the debt of thy sin from the account-book in which it was entered (Ex 32:32, 33; Re 20:12).as a thick cloud—scattered away by the wind (Ps 103:12).as a cloud—a descending gradation. Not only the \"thick cloud\" of the heavier \"transgressions,\" but the \"cloud\" (\"vapor\" [Lowth], not so dense, but covering the sky as a mist) of the countless \"sins.\" These latter, though not thought much of by man, need, as much as the former, to be cleared away by the Sun of righteousness; else they will be a mist separating us from heaven (Ps 19:12, 13; 1Jo 1:7-9).return … for—The antecedent redemption is the ground of, and motive to, repentance. We do not repent in order that He may redeem us, but because He hath redeemed us (Zec 12:10; Lu 24:47; Ac 3:18,19). He who believes in his being forgiven cannot but love (Lu 7:43, 47).Matthew Poole's Commentary I have blotted out, as a thick cloud;  as the sun commonly dissolveth, or the wind scattereth, the thickest and blackest cloud, so as there is no remnant nor appearance of it left. Return from thine idolatry, and other wicked practices. I have redeemed thee;  therefore thou art mine, and obliged to return and adhere to me. Gill's Exposition of the Entire BibleI have blotted out as a thick cloud thy transgressions, and as a cloud thy sins,.... Sins and transgressions are compared to clouds, for the number of them, they being many as the fleeting clouds of the air; and for the nature and quality of them: as clouds are vapours rising out of the earth and sea, so these arise out of the earthly and corrupt heart of man, which is as a troubled sea; and, like the clouds, they reach up to the heavens, and the cry of them calls aloud for vengeance from thence; they cause darkness, even all that darkness, both in unregeneracy, and after conversion; they intercept the light of God's countenance, and interpose between God and the souls of men, and cause him to hide his face from them; they come between them and the sun of righteousness, and cover him out of their sight; and by means of them the light and comfort of the Holy Spirit are withdrawn; and they hinder the free passage of prayer to God, at least as to the apprehension of God's people; see Isaiah 59:2, and they portend a storm, and threaten with a tempest of divine wrath and vengeance; but God graciously forgives them; which is meant by \"blotting\" them out. Clouds are blotted out either by the wind dissipating and scattering them; or by the sun breaking through them, conquering and dispersing them, which perhaps is alluded to here; and designs not the satisfaction of Christ for sin; by which he has finished and made an end of it; but rather God's act of pardon upon it, and the application of it to his people; or the discoveries of it by Christ himself, the sun of righteousness, arising upon them with healing in his wings, that is, with pardon to their souls; saying to them, thy sins, though many, are forgiven thee; and they are so blotted out and removed as to be seen no more, and as if they had never been, as a cloud is; not only no more seen by the avenging eye of divine justice, but so removed from them as not to be seen by them, as to have no more conscience of them, or feel the load and burden of them; and though other clouds or sins may arise, yet these also are blotted out in the same way, and shall never appear against the saints to their condemnation. And as, when clouds are blotted out, there is a clear sky, a serene heaven, the sun shines in its brightness, and everything is pleasant and delightful; so when sin is pardoned, or it appears to be so, then God is beheld as the God of all grace, as all grace and love; the sinner can go with a holy boldness to him, through the blood of Christ, as being pardoned, and has fellowship with him; the evidences of interest in Christ become clear, and the comforts of the Holy Ghost are enjoyed. And let it be observed, that as no man can reach the clouds, and blot any of them out; so none can forgive sins but God, this is his sole prerogative, Isaiah 43:25. Here is mention made of a cloud, and a thick cloud; no clouds are so thick but God can blot them out, and these are no sins so great but he can forgive them; clouds, and thick clouds, are blotted out, lesser and greater sins are forgiven by him. Some read the words thus, \"I have blotted out\", wiped or washed away, \"as with a thick cloud, thy transgressions, and as with a cloud thy sins\" (n); and give the sense thus, as clouds pouring down with rain wash the streets from the filth of them, so the Lord, as with a deluge of pardoning grace and mercy, washes away the sins of his people; grace superabounds abounding sin, and carries it all before it, and removes it clear away; now this blessing of grace is mentioned, to attach the people of God to his service, as it follows: return unto me, for I have redeemed thee; this supposes them to have backslidden from the Lord in heart or in practice, in life and conversation, or in both, and yet the Lord had forgiven them; and which was a reason why they should return to him by repentance; as nothing is a greater motive to it, or more strongly influences it, than a discovery of pardoning grace; and then the people of God do return to God as their Father, who graciously receives them, and to Christ as their husband, to whom they are married, though backslidden, and to their duty to both. So the Targum, \"return to my worship or service;'' the reason or argument enforcing it is very strong, \"for I have redeemed thee\"; from sin, and all its sad effects; from the law, and the curses of it; and from death and hell, and wrath to come; and therefore need not fear any of these things, or fear coming to the Lord on account of them. Such, who are redeemed, need not doubt but they shall be kindly received, though they have backslidden, and that no good thing will be withheld from them; for if God has given his Son to redeem them, he will give all things freely with him; besides, being redeemed, they are the Lord's, and therefore ought to return to him, and glorify him with their bodies and spirits, which are his; and as they are redeemed from our vain conversation, they should return from it, and not indulge one, or otherwise the end of redemption is not answered: and this being joined with the forgiveness of sin in the preceding clause, shows that that proceeds upon the foot of redemption, or upon the foot of satisfaction made by Christ; and both furnish out arguments engaging to the service of God. (n) So some in Gataker. Geneva Study BibleI have blotted out, as a thick cloud, thy transgressions, and, as a cloud, thy sins: return unto me; for I have redeemed thee.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "MacLaren's Expositions",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Isaiah",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "WRITING BLOTTED OUT AND MIST MELTEDIsaiah 44:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Isaiah has often and well been called the Evangelical Prophet. Many parts of this second half of his prophecies referring to the Messiah read like history rather than prediction. But it is not only from the clearness with which the great figure of the future king of Israel stands out on his page that he deserves that title. Other thoughts belonging to the very substance of the gospel appear in him with a vividness and a frequency which well warrants its application to him. He speaks much of the characteristically Christian conceptions of sin, forgiveness, and redemption. The whole of the latter parts of this book are laden with that burden. They are gathered up in the extraordinarily pregnant and blessed words of my text, in which metaphors are blended with much disregard to oratorical propriety, in order to bring out the whole fulness of the prophet’s meaning. ‘I have blotted out’-that suggests a book. ‘I have blotted out as a cloud’-that suggests the thinning away of morning mists. The prophet blends the two thoughts together, and on that great revelation of a forgiveness granted before it has been asked, and given, not only to one penitent soul wailing out like the abased king of Israel in his deep contrition, ‘according to the multitude of Thy tender mercies blot out my transgressions,’ but promised to a whole people, is rested the great invitation, ‘Return unto Me, for I have redeemed thee.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Let me try and bring out, as simply and earnestly as I can, the great teaching that is condensed into these words.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I. Observe here the penetrating glance into the very essential characteristics of all sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "There are two words, as you see, employed in my text, ‘transgressions’ and ‘sins.’ They apply to the same kind of actions, but they look at them from different angles and points of view. They are partially synonymous, but they cover very various conceptions, and if we take note of the original significations of the two words, we get two very important and often forgotten thoughts.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " For that expression rendered in my text, and rendered correctly enough -transgressions-means at bottom, ‘rebellion,’ the rising up of a disobedient will, not only against a law, but against a lawgiver. There we have a deepening of that solemn fact of a man’s wrongdoing, which brings it into immediate connection with God, and marks its foulness by reason of that connection.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Ah! brethren, it makes all the difference to a man’s notions of right and wrong, whether he stops on the surface or goes down to the depths; whether he says to himself, ‘The thing is a vice; it is wrong; it is contrary to what I ought to be’; or whether he gets down to the darker, deeper, and truer thought, and says, ‘The damnable thing about every little evil that I do is this, that in it ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "I",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "-poor puny I-perk myself up against God, and say to Him, “Thou wilt; wilt thou? ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "I",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall not!”‘ Sin is rebellion.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And so what becomes of the hazy distinction between great sins and little ones? An overt act of rebellion is of the same gravity, whatsoever may be its form. The man that lifts his sword against the sovereign, and the man behind him that holds his horse, are equally criminal. And when once you let in the notion that in all our actions we have to do with a Person, to whom we are bound to be obedient, then the distinction which sophisticates so many people’s consciences, and does such infinite harm in so many lives, between great and small transgressions, disappears altogether. Sin is rebellion.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Then the other word of my text is equally profound and significant. For it, literally taken, means-as the words for ‘sin’ do in other languages besides the Hebrew-missing a mark. Every wrong thing that any man does is beside the mark, at which he, by virtue of his manhood, and his very make and nature, ought to aim. It is beside the mark in another sense than that. As some one says, ‘A rogue is a roundabout fool.’ No man ever secures that, and only that, which he aims at by any departure from the straight path of imperative duty. For if he gets some vulgar and transient titillation of appetite, or satisfaction of desire, he gets along with it something that takes all the gilt off the gingerbread, and all the sweetness out of the satisfaction. So that it is always a blunder to be bad, and every arrow that is drawn by a sinful hand misses the target to which all our arrows should be pointed, and misses even the poor mark that we think we are aiming at. Take these two thoughts with you-I will not dwell on them, but I desire to lay them upon all your hearts-all evil is sin, and every sin is rebellion against God, and a blunder in regard to myself.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "II. And now I come to the second point of our text, and ask you to note the permanent record which every sin leaves. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "I explained in the earlier part of my remarks that we have a case here of the thing that horrifies rhetoricians, but does not matter a bit to a prophet, the blending or confusing of two metaphors. The first of them-’I have blotted out’-suggests a piece of writing, a book, or manuscript of some sort. And the plain English of what lies behind that metaphor is this solemn thought, which I would might blaze before each of us, in all our lives, that God’s calm and all-comprehensive knowledge and remembrance takes and keeps filed, and ready for reference, the whole story of our whole acts. There ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a book. It is a violent metaphor, no doubt, but there is a solemn truth underlying it which we are too apt to forget. The world is groaning nowadays with two-volume memoirs of men that nobody wants to know anything more about. But every man is ever writing his autobiography with invisible but indelible ink. You have seen those old-fashioned ‘manifold writers’ in your places of business, and the construction of them is this: a flimsy sheet of tissue paper, a bit of black to be put in below it, and then another sheet on the other side; and the pen that writes on the flimsy top surface makes an impression that is carried through the black to the sheet below, and there is a duplicate which the writer keeps. You and I, upon the flimsinesses of this fleeting-sometimes, we think, futile-life, are penning what is neither flimsy nor futile, which goes through the opaque dark, and is reproduced and docketed yonder. That is what we are doing every day and every minute, writing, writing, writing our own biography. And who is going to read it? Well, God does read it now, and you will have to read it out one day, and how will you like that?",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " This metaphor will bear a little further expansion. Scripture tells us, and conscience tells us, what manner of manuscript it is that we are each so busy adding line upon line to. It is a ledger; it is an indictment. Our own handwriting puts down in the ledger our own debts, and we cannot deny our own handwriting when we are confronted with it. It is an indictment, and our own hand draws it, and we have to plead ‘guilty,’ or ‘not guilty,’ to it. Which, being translated into plain fact, is this-that there goes with all our deeds some sense and reality of responsibility for them, and that all our rebellions against God, and our blunders against self, be they great or small, carry with them a sense of guilt and a reality of guilt whether we have the sense of it or not. God has a judgment at this moment about every man and woman, based upon the facts of the unfinished biography which they are writing.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Mystical and awful, yet blessed and elevating, is the thought that nothing-",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "nothing,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ever dies; and that what was, is now, and always will be.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Amongst the specimens from the coal measures in a museum you will find slabs upon which the tiniest fronds of ferns that grew nobody knows how many millenniums since are preserved for ever. Our lives, when the blow of the last hammer lays them open, will, in like manner, bear the impress of the minutest filament of every deed that we have ever done.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But my metaphor will bear yet further expansion, for this autobiographical record which we are busy preparing, which is at once ledger and indictment, is to be read out one day. There is a great scene in the last book of Scripture, the whole solemn significance of which, I suppose, we shall not understand till we have learned it by experience, but the truth of which we have sufficient premonitions to assure us of, which declares that at a given time, on the confines of Eternity, the Great White Throne is to be set, and the books are to be opened, and the dead are judged ‘out of the books,’ which, the seer goes on to explain, is ‘according to their works.’ The story of Esther tells us how the sleepless monarch in the night-watches sent for the records of the kingdom and had them read to him. The King who never slumbers nor sleeps, in that dawning of heaven’s eternal morning, will have the books opened before Him, and my deeds will be read out. He and I will hear them, whether any else may hear or no. That is my second lesson.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "III. The third is, that we have here suggested the darkening power of sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The prophet, as I said, mixes metaphors. ‘I have blotted out as a cloud thy transgressions.’ He uses two words for ‘cloud’ here; both of them mean substantially the same thing, and both suggest the same idea. When cloud fills the sky it darkens the earth, and shuts out the sunshine and the blue, it closes the petals of the little flowers, it hushes the songs of the birds. Sin makes for the sinning man ‘an under-roof of doleful grey,’ which shuts out all the glories above. Put that metaphor into plain English, and it is just this, ‘Your sins have separated between you and your God, and your iniquities have hid His face from you that He will not hear.’ It is impossible for a man that has his heart all stiffened by the rebellion of his will against God’s, or all seething with unrestrained passions, or perturbed with worldly longings and desires, to enter into calm fellowship with God or to keep the thought of God clear before his mind. For we know Him, not by sense nor by reason, but by sympathy and by feeling. And whatsoever comes in to disturb a man’s purity, comes in to hinder his vision of God. ‘Blessed are the pure in heart, for they’-and they only-’shall see God.’ Whenever from the undrained swamps of my own passions and sensualities, or from the as malarious though loftier grounds of my own self-regard, be I student or thinker, or moral man, there rise up these light mists, they will fill the sky and hide the sun. On a winter’s night you will see the Pleiades, or other bright constellations, varying in brilliancy from moment to moment as some invisible cloud-wrack floats across the heavens. So, brother, every evil thing that we do rises up and gets diffused through our atmosphere, and blots out from our vision the face of God Himself, the blessed Son.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Not only by reason of dimming and darkening my thoughts of Him is my sin rightly compared to an obscuring cloud; but the comparison also holds good because, just as the blanket of a wet mist swathing the wintry fields prevents the sunshine from falling upon them in blessing, so the accumulated effect of my evil doings and evil designings and thinkings and willings comes between me and all spiritual blessings which God can bestow, so that the very light of light, the highest blessings that He yearns to give, and we faint for want of possessing, are impossible even to His love to communicate until the cloud is swept away. So my sin darkens my soul, and separates me from the light of life.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But the metaphor carries with it, too, a suggestion of the limitations of the power of sin. For when the cloud is thickest and most obscuring it only hugs the earth, and rises but a little way Into the heavens; and far above it the blue is as blue, and the sunshine as bright, as if there were no mist or fog in the lower regions. Therefore, let us remember that, while the cloud must veil us from the light, the light is above it, and ‘every cloud that veileth love’ may some day be thinned away by the love it veils.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "IV. That brings me to the last word of my text,-viz. the prophet’s teaching as to the removal of the sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "We have to carry both the metaphors together with us here. ‘I have blotted out’-that is, as erasing from a book. ‘I have blotted out as a cloud’-that is, the thinning away of the mist. The blurred and stained page can be cancelled. Chemicals will take the ink out. ‘The blood of Jesus Christ cleanseth from all sin’; and it, passed over all that foul record, makes it pure and clean. ‘What I have written, I have written,’ said Pilate in his obstinacy. ‘What I have written, I have written,’ wails many a man in the sense of the irrevocableness of his past. Brother! be not afraid. Christ can take away all that stained record, and give you back the page ready to receive holier words.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The cloud is thinned away. What thins the cloud? As I have said, the light which the cloud obscures, shining on the upper surface of it, dissipates it layer by layer till it gets down at last to the lowermost, and then rends a gap in it, and sends the shaft of the sunbeam through on to the green earth. And that is only a highly imaginative way of saying that it is the love against which we transgress that thins away the cloud of transgression, and at last, as the placid moon, by simply shining silently on, will sweep the whole sky clear of its clouds, dissipates them all, and leaves the calm blue. God forgives. The ledger account-if I may use so grossly commercial a figure-is settled in full; the indictment is endorsed, ‘acquitted.’ He remembers the sins only to breathe into the child’s heart the assurance of pardon, and no obstacle rises by reason of forgiven transgression between the sinning man and the reconciled God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Now, all this preaching of Isaiah’s is enlarged and confirmed, and to some extent the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "rationale",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of it is set before us in the great Gospel truth of forgiveness through the blood of Jesus Christ. Unless we know that truth, we may well stand amazed and questioning as to whether a righteous God, administering a rigorous universe, can ever pardon sin. And unless we know that by the Spirit of Jesus Christ, granted to our spirits, our whole nature may be remade and moulded, we might well be tempted to say, Ah! the Ethiopian cannot change his skin nor the leopard his spots. But Jesus Christ can change more than skin, even the heart and spirit, the inmost depths of the nature.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Now, brother, my text speaks of this great blotting out as a past fact. It is so in the divine mind with regard to each of us, because Christ’s great work has made reconciliation and atonement for all the sins of all the world. And on the fact that it is past is based the exhortation, ‘Return unto Me, for I have redeemed thee.’ God does not say, ‘Come back and I will forgive’; He does not say, ‘Return and I will blot out’; but He says, ‘Return, for I ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "have",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " blotted out.’ Though accomplished, the forgiveness has to be appropriated by individual faith. The sins of the world have been borne, and borne away, by the Lamb of God, but your sins are not borne away unless your hand is laid on this head.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " If it is, then you do not need to say, ‘What I have written is written, and it cannot be blotted out.’ But as in the old days a monk would take some manuscript upon which filthy stories about heathen gods and foolish fables were written, and erase these to write the legends of saints, or perhaps the words of the Gospels themselves; so on our hearts, which have been scribbled all over with obscenities and follies, He will write His new best name of Love, and we may be epistles of Christ, written with the Spirit of the living God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "44:21-28 Return unto me. It is the great concern of those who have backslidden from God, like the Jews of old, to hasten their return to him. The work of redemption wrought for us by Christ, encourages to hope for all blessings from him. Our transgressions and our sins are as a thick cloud between heaven and earth: sins separate between us and God; they threaten a storm of wrath. When God pardons sin, he blots out, he dispels this cloud, this thick cloud, so that the way to heaven is open again. The cloud is scattered by the Sun of righteousness; it is quite gone. The comforts that flow into the soul when sin is pardoned, are like clear shining after clouds and rain. Let not Israel be discouraged; nothing is too hard for God: having made all, he can make what use he pleases of any. Those that learn to know Christ, see all knowledge to be foolishness, in comparison with the knowledge of him. And his enemies will find their counsels turned into foolishness, and themselves taken in their craftiness. The exact fulfilling the prophecies of Scripture confirms the truth of the whole, and proves its Divine origin. The particular favours God designed for his people in captivity, were foretold here, long before they went into captivity. Very great difficulties would be in the way of their deliverance; but it is promised that by Divine power they should all be removed. God knew who should be the Deliverer of his people; and let his church know it, that when they heard such a name talked of, they might know their redemption drew nigh. It is the greatest honour of the greatest men, to be employed as instruments of the Divine favour to his people. In things wherein men serve themselves, and look no further, God makes them do all his pleasure. And a nobler Shepherd than Cyrus does his Father's will, till his work is fully completed.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "I have blotted out - The word used here (מחח  mâchâh), means properly \"to wipe away,\" and is often applied to sins, as if the account was wiped off, or as we express it, blotted out (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The phrase, 'to blot out sins like a cloud,' however, is unusual, and the idea not very obvious. The true idea would be expressed by rendering it, 'I have made them to vanish as a thick cloud;' and the sense is, as the wind drives away a thick cloud, however dark and frowning it may be, so that the sky is clear and serene, so God had caused their sins to disappear, and had removed the storm of his anger. Nothing can more strikingly represent sin in its nature and consequences, than a dense, dark, frowning cloud that comes over the heavens, and shuts out the sun, and fills the air with gloom; and nothing can more beautifully represent the nature and effect of pardon than the idea of removing such a cloud, and leaving the sky pure, the air calm and serene, and the sun pouring down his beams of warmth and light on the earth. So the soul of the sinner is enveloped and overshadowed with a dense cloud; but pardon dissipates that cloud, and it is calm, and joyful, and serene.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And as a cloud - The Chaldee render this, 'As a flying cloud.' The difference between the two words rendered here 'thick cloud,' and 'cloud' (  עב  ‛âb and ענן  ‛ânân) is, that the former is expressive of a cloud as dense, thick, compact; and the latter as covering or veiling the heavens. Lowth renders the latter word 'Vapour;' Noyes, 'Mist.' Both words, however, usually denote a cloud. A passage similar to this is found in Demosthenes, as quoted by Lowth: 'This decree made the danger then hanging over the city pass away like a cloud.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Return unto me - Since your sins are pardoned, and such mercy has been shown, return now, and serve me. The argument here is derived from the mercy of God in forgiving them, and the doctrine is, that the fact that God has forgiven us imposes the strongest obligations to devote ourselves to his service. The fact that we are redeemed and pardoned is the highest argument why we should consecrate all our powers to him who has purchased and forgiven us. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "22. blotted out—the debt of thy sin from the account-book in which it was entered (Ex 32:32, 33; Re 20:12).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "as a thick cloud—scattered away by the wind (Ps 103:12).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "as a cloud—a descending gradation. Not only the \"thick cloud\" of the heavier \"transgressions,\" but the \"cloud\" (\"vapor\" [Lowth], not so dense, but covering the sky as a mist) of the countless \"sins.\" These latter, though not thought much of by man, need, as much as the former, to be cleared away by the Sun of righteousness; else they will be a mist separating us from heaven (Ps 19:12, 13; 1Jo 1:7-9).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "return … for—The antecedent redemption is the ground of, and motive to, repentance. We do not repent in order that He may redeem us, but because He hath redeemed us (Zec 12:10; Lu 24:47; Ac 3:18,19). He who believes in his being forgiven cannot but love (Lu 7:43, 47).",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I have blotted out, as a thick cloud; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the sun commonly dissolveth, or the wind scattereth, the thickest and blackest cloud, so as there is no remnant nor appearance of it left. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Return from thine idolatry",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other wicked practices. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I have redeemed thee; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " therefore thou art mine, and obliged to return and adhere to me. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "I have blotted out as a thick cloud thy transgressions, and as a cloud thy sins,.... Sins and transgressions are compared to clouds, for the number of them, they being many as the fleeting clouds of the air; and for the nature and quality of them: as clouds are vapours rising out of the earth and sea, so these arise out of the earthly and corrupt heart of man, which is as a troubled sea; and, like the clouds, they reach up to the heavens, and the cry of them calls aloud for vengeance from thence; they cause darkness, even all that darkness, both in unregeneracy, and after conversion; they intercept the light of God's countenance, and interpose between God and the souls of men, and cause him to hide his face from them; they come between them and the sun of righteousness, and cover him out of their sight; and by means of them the light and comfort of the Holy Spirit are withdrawn; and they hinder the free passage of prayer to God, at least as to the apprehension of God's people; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and they portend a storm, and threaten with a tempest of divine wrath and vengeance; but God graciously forgives them; which is meant by \"blotting\" them out. Clouds are blotted out either by the wind dissipating and scattering them; or by the sun breaking through them, conquering and dispersing them, which perhaps is alluded to here; and designs not the satisfaction of Christ for sin; by which he has finished and made an end of it; but rather God's act of pardon upon it, and the application of it to his people; or the discoveries of it by Christ himself, the sun of righteousness, arising upon them with healing in his wings, that is, with pardon to their souls; saying to them, thy sins, though many, are forgiven thee; and they are so blotted out and removed as to be seen no more, and as if they had never been, as a cloud is; not only no more seen by the avenging eye of divine justice, but so removed from them as not to be seen by them, as to have no more conscience of them, or feel the load and burden of them; and though other clouds or sins may arise, yet these also are blotted out in the same way, and shall never appear against the saints to their condemnation. And as, when clouds are blotted out, there is a clear sky, a serene heaven, the sun shines in its brightness, and everything is pleasant and delightful; so when sin is pardoned, or it appears to be so, then God is beheld as the God of all grace, as all grace and love; the sinner can go with a holy boldness to him, through the blood of Christ, as being pardoned, and has fellowship with him; the evidences of interest in Christ become clear, and the comforts of the Holy Ghost are enjoyed. And let it be observed, that as no man can reach the clouds, and blot any of them out; so none can forgive sins but God, this is his sole prerogative, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here is mention made of a cloud, and a thick cloud; no clouds are so thick but God can blot them out, and these are no sins so great but he can forgive them; clouds, and thick clouds, are blotted out, lesser and greater sins are forgiven by him. Some read the words thus, \"I have blotted out\", wiped or washed away, \"as with a thick cloud, thy transgressions, and as with a cloud thy sins\" (n); and give the sense thus, as clouds pouring down with rain wash the streets from the filth of them, so the Lord, as with a deluge of pardoning grace and mercy, washes away the sins of his people; grace superabounds abounding sin, and carries it all before it, and removes it clear away; now this blessing of grace is mentioned, to attach the people of God to his service, as it follows: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "return unto me, for I have redeemed thee; this supposes them to have backslidden from the Lord in heart or in practice, in life and conversation, or in both, and yet the Lord had forgiven them; and which was a reason why they should return to him by repentance; as nothing is a greater motive to it, or more strongly influences it, than a discovery of pardoning grace; and then the people of God do return to God as their Father, who graciously receives them, and to Christ as their husband, to whom they are married, though backslidden, and to their duty to both. So the Targum, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"return to my worship or service;'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "the reason or argument enforcing it is very strong, \"for I have redeemed thee\"; from sin, and all its sad effects; from the law, and the curses of it; and from death and hell, and wrath to come; and therefore need not fear any of these things, or fear coming to the Lord on account of them. Such, who are redeemed, need not doubt but they shall be kindly received, though they have backslidden, and that no good thing will be withheld from them; for if God has given his Son to redeem them, he will give all things freely with him; besides, being redeemed, they are the Lord's, and therefore ought to return to him, and glorify him with their bodies and spirits, which are his; and as they are redeemed from our vain conversation, they should return from it, and not indulge one, or otherwise the end of redemption is not answered: and this being joined with the forgiveness of sin in the preceding clause, shows that that proceeds upon the foot of redemption, or upon the foot of satisfaction made by Christ; and both furnish out arguments engaging to the service of God. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(n) So some in Gataker. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "I have blotted out, as a thick cloud, thy transgressions, and, as a cloud, thy sins: return unto me; for I have redeemed thee.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “The sense of being forgotten of God is produced by the consciousness of guilt; hence the promise of forgiveness is here repeated” (Dillmann).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a thick cloud … as a cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An image of transitoriness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I have blotted out...  thy sins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The promise there made is here represented as having its fulfilment. Before God reverses his sentence and restores his people, he must first forgive them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As a thick cloud...  as a cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It would be better to translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as a cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "...  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as a thick cloud.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The latter of the two Hebrew words used is the more emphatic. Return unto me. This is an underlying condition, both of restoration and of forgiveness. Only the penitent can be received back into favour. The knowledge, however, that God has, in his counsels, \"redeemed\" his people generally, may act as a stimulus on individuals to repent and turn to him. Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second half of the prophecy commences with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It opens with an admonition. \"Remember this, Jacob and Israel; for thou art my servant: I have formed thee; thou art servant to me, O Israel: thou art not forgotten by me.\" The thing to which the former were blind - namely, that idolatry is a lie - Jacob was to have firmly impressed upon its mind. The words \"and Israel,\" which are attached, are a contract for \"and remember this, O Israel\" (compare the vocatives after Vâv in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the reason assigned, the tone rests upon my in the expression \"my servant,\" and for this reason \"servant to me\" is used interchangeably with it. Israel is the servant of Jehovah, and as such it was formed by Jehovah; and therefore reverence was due to Him, and Him alone. The words which follow are rendered by the lxx, Targum, Jerome, and Luther as though they read לא תנשׁני, though Hitzig regards the same rendering as admissible even with the reading תנּשנּי, inasmuch as the niphal נשּׁה has the middle sense of ἐπιλανθάνεσθαι, oblivisci. But it cannot be shown that nizkar is ever used in the analogous sense of μιμνήσκεσθαι, recordari. The niphal, which was no doubt originally reflective, is always used in Hebrew to indicate simply the passive endurance of something which originated with the subject of the action referred to, so that nisshâh could only signify \"to forget one's self.\" We must indeed admit the possibility of the meaning \"to forget one's self\" having passed into the meaning \"to be forgetful,\" and this into the meaning \"to forget.\" The Aramaean תנשׁי also signifies to be forgotten and (with an accent following) to forget, and the connection with an objective suffix has a support in ויּלּחמוּני in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the latter is really equivalent to אתּי וילחמו, so that it may be adduced with equal propriety in support of the other rendering, according to which תּנּשׁני is equivalent to לי תנש (Ges., Umbr., Ewald, Stier). There are many examples of this brachyological use of the suffix (Ges. 121, 4), so that this rendering is certainly the safer of the two. It also suits the context quite as well as the former, \"Oh, forget me not;\" the assurance \"thou wilt not be forgotten by me\" (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the lamentation of Israel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") being immediately followed by an announcement of the act of love, by which the declaration is most gloriously confirmed. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"I have blotted out thy transgressions as a mist, and thy sins as clouds: return to me; for I have redeemed thee.\" We have adopted the rendering \"mist\" merely because we have no synonym to \"cloud;\" we have not translated it \"thick cloud,\" because the idea of darkness, thickness, or opacity, which is the one immediately suggested by the word, had become almost entirely lost (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Moreover, קל עב is evidently intended here (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), inasmuch as the point of comparison is not the dark, heavy multitude of sins, but the facility and rapidity with which they are expunged. Whether we connect with מסהיתי the idea of a stain, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or that of a debt entered in a ledge, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and as we explained it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf., mâchâh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in any case sin is regarded as something standing between God and man, and impeding or disturbing the intercourse between them. This Jehovah clears away, just as when His wind sweeps away the clouds, and restores the blue sky again (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 26:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus does God's free grace now interpose at the very time when Israel thinks He has forgotten it, blotting out Israel's sin, and proving this by redeeming it from a state of punishment. What an evangelical sound the preaching of the Old Testament evangelist has in this passage also! Forgiveness and redemption are not offered on condition of conversion, but the mercy of God comes to Israel in direct contrast to what its works deserve, and Israel is merely called upon to reciprocate this by conversion and renewed obedience. The perfects denote that which has essentially taken place. Jehovah has blotted out Israel's sin, inasmuch as He does not impute it any more, and thus has redeemed Israel. All that yet remains is the outward manifestation of this redemption, which is already accomplished in the counsel of God. ",
        "children": []
      }
    ]
  }
]