[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they shall be unto you cities for refuge . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the cities shall be unto you for refuge ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a place of refuge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " from the avenger, that the manslayer may not die until he stand before the congregation for judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The avenger (Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was the near kinsman whose office it was to redeem the person or inheritance of his kinsman, if that kinsman was reduced by poverty to sell himself into slavery, or to sell his inheritance; and also to avenge his blood in the event of his being slain. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:25-55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Notes.) The law of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as contained in this chapter, served to keep in check the excited passions of the near relations of the man who had been slain, and to secure for him a fair and impartial trial. The duties which devolved upon the congregation are stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Christ, as our “Redeemer” (Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ever lives (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He has redeemed the persons and the inheritance of His people by His death; and He will in the last great day, ransom them from the power of the grave, and redeem them from death (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the cognate verb to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "occurs), and will avenge their blood on them that dwell on the earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 35:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From the avenger — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the redeemer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the next kinsman; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to whom, by the law, belonged the right of redemption of the lands of, and vindication of the injury done to, the person deceased. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Die not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Be not killed by the avenger meeting him in some other place. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Before the congregation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Before the judges or elders who were appointed in every city for the decision of criminal causes, who were to examine, and that publicly before the people, whether the murder was wilful or casual.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35:9-34 To show plainly the abhorrence of murder, and to provide the more effectually for the punishment of the murderer, the nearest relation of the deceased, under the title of avenger of blood, (or the redeemer of blood,) in notorious cases, might pursue, and execute vengeance. A distinction is made, not between sudden anger and malice aforethought, both which are the crime of murder; but between intentionally striking a man with any weapon likely to cause death, and an unintentional blow. In the latter case alone, the city of refuge afforded protection. Murder in all its forms, and under all disguises, pollutes a land. Alas! that so many murders, under the name of duels, prize-fights, &c. should pass unpunished. There were six cities of refuge; one or other might be reached in less than a day's journey from any part of the land. To these, man-slayers might flee for refuge, and be safe, till they had a fair trial. If acquitted from the charge, they were protected from the avenger of blood; yet they must continue within the bounds of the city till the death of the high priest. Thus we are reminded that the death of the great High Priest is the only means whereby sins are pardoned, and sinners set at liberty. These cities are plainly alluded to, both in the Old and New Testament, we cannot doubt the typical character of their appointment. Turn ye to the strong hold, ye prisoners of hope, saith the voice of mercy, Zec 9:12, alluding to the city of refuge. St. Paul describes the strong consolation of fleeing for refuge to the hope set before us, in a passage always applied to the gracious appointment of the cities of refuge, Heb 6:18. The rich mercies of salvation, through Christ, prefigured by these cities, demand our regard. 1. Did the ancient city rear its towers of safety on high? See Christ raised up on the cross; and is he not exalted at the right hand of his Father, to be a Prince and a Saviour, to give repentance and remission of sins? 2. Does not the highway of salvation, resemble the smooth and plain path to the city of refuge? Survey the path that leads to the Redeemer. Is there any stumbling-block to be found therein, except that which an evil heart of unbelief supplies for its own fall? 3. Waymarks were set up pointing to the city. And is it not the office of the ministers of the gospel to direct sinners to Him? 4. The gate of the city stood open night and day. Has not Christ declared, Him that cometh unto me I will in nowise cast out? 5. The city of refuge afforded support to every one who entered its walls. Those who have reached the refuge, may live by faith on Him whose flesh is meat indeed, and whose blood is drink indeed. 6. The city was a refuge for all. In the gospel there is no respect of persons. That soul lives not which deserves not Divine wrath; that soul lives not which may not in simple faith hope for salvation and life eternal, through the Son of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The avenger - Hebrew גאל  gā'al, a term of which the original import is uncertain. The very obscurity of its etymology testifies to the antiquity of the office which it denotes. That office rested on the principle of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"whoso sheddeth man's blood, by man shall his blood be shed.\" The unwritten code of the East conceded to the nearest kinsman of a murdered man the right of avenging the blood that had been shed. Such rude justice necessarily involved grave evils. It gave no opportunity to the person charged with crime of establishing is innocence; it recognized no distinction between murder, manslaughter, and accidental homicide; it perpetuated family blood-feuds, the avenger of blood being liable to be treated in his turn as a murderer by the kinsman of the man whom he had slain. These grievances could not be removed as long as there was no central government, but they might be mitigated; and to do this was the object of the institution in the text (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Among the Arab tribes, who are under the control of no central authority, the practice of blood-revenge subsists in full force to the present day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The congregation - i. e. local court, consisting of the elders of the city Joshua 20:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The congregation - i. e. local court, consisting of the elders of the city ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 20:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. that the slayer may flee thither, which killeth any person at unawares—The practice of Goelism, that is, of the nearest relation of an individual who was killed being bound to demand satisfaction from the author of his death, existed from a very remote antiquity (Ge 4:14; 27:45). It seems to have been an established usage in the age of Moses; and although in a rude and imperfect state of society, it is a natural and intelligible principle of criminal jurisprudence, it is liable to many great abuses; the chief of the evils inseparable from it is that the kinsman, who is bound in duty and honor to execute justice, will often be precipitate—little disposed, in the heat of passion or under the impulse of revenge, to examine into the circumstances of the case, to discriminate between the premeditated purpose of the assassin and the misfortune of the unintentional homicide. Moreover, it had a tendency, not only to foster a vindictive spirit, but in case of the Goel being unsuccessful in finding his victim, to transmit animosities and feuds against his descendants from one generation to another. This is exemplified among the Arabs in the present day. Should an Arab of one tribe happen to kill one of another tribe, there is \"blood\" between the tribes, and the stain can only be wiped out by the death of some individual of the tribe with which the offense originated. Sometimes the penalty is commuted by the payment of a stipulated number of sheep or camels. But such an equivalent, though offered, is as often refused, and blood has to be repaid only by blood. This practice of Goelism obtained among the Hebrews to such an extent that it was not perhaps expedient to abolish it; and Moses, while sanctioning its continuance, was directed, by divine authority, to make some special regulations, which tended both to prevent the unhappy consequences of sudden and personal vengeance, and, at the same time, to afford an accused person time and means of proving his innocence. This was the humane and equitable end contemplated in the institution of cities of refuge. There were to be six of these legalized asyla, three on the east of Jordan, both because the territory there was equal in length, though not in breadth, to Canaan, and because it might be more convenient for some to take refuge across the border. They were appointed for the benefit, not of the native Israelites only, but of all resident strangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The avenger, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, of the party slain, or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of blood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as it is fully expressed below, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 35:19,25",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the redeemer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the next kinsman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to whom by the law belonged the right of redemption of the lands of, and vindication of the injury done to the person deceased. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Die not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. be not killed by the avenger meeting him in some other place. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Before the congregation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. before the society or convention of judges or elders, who were appointed in every city for the decision of criminal causes, who were twenty-three, who were to examine the matter, and that publicly before the people, whether the murder was wilful or casual. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Quest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In what city was this cause to be tried? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Answ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some say in the city of refuge, others say in the city in or near which the fact was committed. It seems to me it was done in both, at first in the city of refuge, as is manifest in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Joshua 20:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 20:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but if that trial and sentence did not satisfy the avenger of blood, it was fully and finally determined in the other city, as is sufficiently evident both by comparing this place with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 35:25 Joshua 20:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 20:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and from the usual and most reasonable course of justice, which is that facts should be examined, as far as may be, in or near the places where they were committed, and where the witnesses and evidences were at hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In judgment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for judgment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. to receive sentence there according to the nature of the fact. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall be unto you cities of refuge from the avenger,.... Or near kinsman; for as the right of redemption of an estate that was mortgaged belonged to such an one, so of revenging the blood of any one that was killed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that the manslayer die not; by the hand of the avenger, who in the heat of his passion would, could he come at him, fall upon him, and slay him, to avenge the death of his relation on him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until he stand before the congregation in judgment; before the court of judicature, to be examined, tried, and judged, whether the murder was committed knowingly and willingly, or whether through mistake and at unawares: this was done either before the court of judicature in the city of refuge, who took cognizance of such cases directly, that they might know whom to harbour and protect, and whom not; or before the court in the place where the act was committed: interpreters are divided about this; and Calmet (l) is of opinion that he was examined in both courts, first more strictly in the city of refuge, and then more slightly in the place where it was done, which is not improbable; however, this seems manifest from Numbers 35:25, that the court where it was committed had power to fetch him from the city of refuge, and set him before them, and examine into the case; and, if an innocent person, restored him to the city of refuge, whither he had fled. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "until he stand before the congregation in judgment; before the court of judicature, to be examined, tried, and judged, whether the murder was committed knowingly and willingly, or whether through mistake and at unawares: this was done either before the court of judicature in the city of refuge, who took cognizance of such cases directly, that they might know whom to harbour and protect, and whom not; or before the court in the place where the act was committed: interpreters are divided about this; and Calmet (l) is of opinion that he was examined in both courts, first more strictly in the city of refuge, and then more slightly in the place where it was done, which is not improbable; however, this seems manifest from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that the court where it was committed had power to fetch him from the city of refuge, and set him before them, and examine into the case; and, if an innocent person, restored him to the city of refuge, whither he had fled. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Dictionary, on the word \"Refuge\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) Dictionary, on the word \"Refuge\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall be unto you cities for refuge from the {d} avenger; that the manslayer die not, until he stand before the congregation in judgment.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they shall be unto you cities for refuge from the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " avenger; that the manslayer die not, until he stand before the congregation in judgment.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Meaning, from the next of the kindred, who ought to pursue the cause.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the avenger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gô’çl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the nearest representative of the family of the slain man. Perhaps (with LXX. ) we should read ‘the avenger of blood,’ as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Numbers 35:19; Numbers 35:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gô’çl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and his duties see n. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the congregation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It is not clearly stated that this means the congregation of the manslayer’s city; and the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘çdah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " elsewhere in P denotes the whole community of Israel. But in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Numbers 35:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note there) the words ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "restore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him to his city of refuge’ imply that the ‘congregation’ have taken him to some other place for judgement, which would more probably be his own city than any other; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the judges in the case of murder are ‘the elders of his city.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "From the avenger.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "גֹאֵל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὁ ἀγχιστεύων τὸ αῖμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In all other passages (twelve in number) where the word occurs in this sense it is qualified by the addition ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " blood.\" Standing by itself, it is everywhere else translated \"kinsman,\" or (more properly) \"redeemer,\" and is constantly applied in that sense to God our Saviour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.). The two ideas, however, which seem to us so distinct, and even so opposed, are in their origin one. To the men of the primitive age, when public justice was not, and when might was right, the only protector was one who could and would avenge them of their wrongs, and by avenging prevent their repetition. This champion of the injured individual, or rather family, - for rights and wrongs were thought of as belonging to families rather than to individuals, was their goel, who had their peace, their safety, above all, their honour, in his charge. For no sentiments spring up quicker, and none exercise a more tyrannous sway, than the sentiment of honour, which in its various and often strangely distorted forms has always perhaps outweighed all other considerations in the minds of men. Now the earliest form in which the sentiment of honour asserted itself was in the blood-feud. If one member of a family was slain, an intolerable shame and sense of contumely  rested upon the family until blood had been avenged by blood, until \"satisfaction\" had been done by the death of the manslayer. He who freed the family from this intolerable pain and humiliation - who enabled it to hold up its head, and to breathe freely once more - was the goel; and in the natural order of things he was the nearest \"kinsman\" of the slain who could and would take the duty upon him. To these natural feelings was added in many cases a religious sentiment which regarded homicide as a sin against the higher Powers for which they too demanded the blood of the guilty. Such was the feeling among the Greeks, and probably among the Egyptians, while among the Hebrews it could plead Divine sanction, given in the most comprehensive terms: \"Your blood of your lives will I require, at the hand of every beast will I require it; and at the hand of man;...  whoso sheddeth man's blood, by man shall his blood be shed\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:5, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The moral difficulties of this proclamation need not here be considered; it is enough to take note that the Divine law itself recognized the duty as well as the lawfulness of private blood-revenge when public justice could not be depended on. The goel, therefore, was not merely the natural champion of his family, nor only the deliverer who satisfied the imperious demands of an artificial code of honour; he was a minister of God, in whose patient efforts to hunt down his victim the thirst for vengeance was to some extent at least superseded by, or rather transmuted into, the longing to glorify God (compare the difficult case of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was not merely human feelings of great reach and tenacity which were outraged by the immunity of the manslayer; it was still more the justice of God which received a grievous wound. Just because, however, God had made the cause of the slain man his own, and had sanctioned the avenging mission of the goel, he could therefore regulate the course of vengeance so as to make it run as even as possible with true justice. It was not indeed possible to distinguish ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ab initio",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " between the homicide which deserved and that which did not deserve capital punishment. Such distinction, difficult under any circumstances, was impossible when vengeance was in private hands. But while the goel could not be restrained from immediate pursuit unhindered by investigation or compunction (lest his whole usefulness be paralyzed), the manslayer might have opportunity to escape, and to be sheltered under the Divine mercy until he could establish (if that were possible) his innocence. No better instance can be found of the way in which the King of Israel adopted the sentiments and institutions of a semi-barbarous age, added to them the sanctions of religion, and so modified them as to secure the maximum of practical good consistent with the social state and moral feelings of the people. No doubt many an individual was overtaken and slain by the goel who did. not deserve to die according to our ideas; but where perfection was unattainable, this error was far less dangerous to that age than the opposite error of diminishing the sanctity of human life and the awfulness of Divine justice. The congregation. Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עֵדָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This word is used frequently from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the end of this chapter, and again in Joshua and the last two chapters of Judges. It is not found in Deuteronomy, nor often in the later books. In every case apparently ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "eydah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifies the whole nation as gathered together, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as represented by all who had an acknowledged right to appear, for of course 600,000 men could not gather together in any one place. The force of the word may be understood by reference to its use in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:10, 13, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Another word (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "קָהָל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is also used, less frequently in Leviticus and Numbers, but more frequently in the later books, for the general assembly of the people of Israel. No distinction of meaning can be drawn between the two words, and it cannot, therefore, be maintained that the \"congregation\" of this verse means the local elders of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The regulations there laid down are not inconsistent with the present law, but are quite independent of it. They refer to a preliminary hearing of the case as stated by the fugitive alone in order to determine his right to shelter in the mean time; which right, if accorded, was without prejudice to the future judgment of the \"congregation\" on the whole facts of the case (see below on verse 25). Numbers 35:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These towns were to serve for a refuge from the avenger of blood, that the manslayer might not die before he had taken his trial in the presence of the congregation. The number of cities was fixed at six, three on the other side of the Jordan, and three on this side in the land of Canaan, to which both the children of Israel, and also the foreigners and settlers who were dwelling among them, might flee. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., Moses advises the congregation to prepare (הכין) the way to these cities, and to divide the territory of the land which Jehovah would give them into three parts (שׁלּשׁ), i.e., to set apart a free city in every third of the land, that every manslayer might flee thither, i.e., might be able to reach the free city without being detained by length of distance or badness of road, lest, as is added in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the avenger of blood pursue the slayer while his heart is hot (יחם, imperf. Kal of חמם), and overtake him because the way is long, and slay him (נפשׁ הכּה, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whereas he was not worthy of death (i.e., there was no just ground for putting him to death), \"because he had not done it out of hatred.\" The three cities of refuge on the other side were selected by Moses himself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:41-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the three in Canaan were not appointed till the land was distributed among the nine tribes and a half (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 20:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Levitical or priests' towns were selected for all six, not only because it was to the priests and Levites that they would first of all look for an administration of justice (Schultz on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but also on the ground that these cities were the property of Jehovah, in a higher sense than the rest of the land, and for this reason answered the idea of cities of refuge, where the manslayer, when once received, was placed under the protection of divine grace, better than any other places possibly could.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The establishment of cities of refuge presupposed the custom and right of revenge. The custom itself goes back to the very earliest times of the human race (Genesis 4:15, Genesis 4:24; Genesis 27:45); it prevailed among the Israelites, as well as the other nations of antiquity, and still continues among the Arabs in unlimited force (cf. Niebuhr, Arab. pp. 32ff.; Burckhardt, Beduinen, 119, 251ff.). \"Revenge of blood prevailed almost everywhere, so long as there was no national life generated, or it was still in the first stages of its development; and consequently the expiation of any personal violation of justice was left to private revenge, and more especially to family zeal\" (Oehler in Herzog's B. Cycl., where the proofs may be seen). The warrant for this was the principle of retribution, the jus talionis, which lay at the foundation of the divine order of the world in general, and the Mosaic law in particular, and which was sanctioned by God, so far as murder was concerned, even in the time of Noah, by the command, \"Whoso sheddeth man's blood,\" etc. (Genesis 9:5-6). This warrant, however, or rather obligation to avenge murder, was subordinated to the essential principle of the theocracy, under the Mosaic law. Whilst God Himself would avenge the blood that was shed, not only upon men, but upon animals also (Genesis 9:5), and commanded blood-revenge, He withdrew the execution of it from subjective caprice, and restricted it to cases of premeditated slaying or murder, by appointing cities of refuge, which were to protect the manslayer from the avenger, until he took his trial before the congregation. גּאל, redeemer, is \"that particular relative whose special duty it was to restore the violated family integrity, who had to redeem not only landed property that had been alienated from the family (Leviticus 25:25.), or a member of the family that had fallen into slavery (Leviticus 25:47.), but also the blood that had been taken away from the family by murder\" (Oehler). In the latter respect he was called הדּם גּאל, (Numbers 35:19, Numbers 35:21, Numbers 35:24.; Deuteronomy 19:6, Deuteronomy 19:12). From 2 Samuel 14:7, we may see that it was the duty of the whole family to take care that blood-revenge was carried out. The performance of the duty itself, however, was probably regulated by the closeness of the relationship, and corresponded to the duty of redeeming from bondage (Leviticus 25:49), and to the right of inheritance (Numbers 27:8.). What standing before the congregation was to consist of, is defined more fully in what follows (Numbers 35:24, Numbers 35:25). If we compare with this Joshua 20:4., the manslayer, who fled from the avenger of blood into a free city, was to stand before the gates of the city, and state his cause before the elders. They were then to receive him into the city, and give him a place that he might dwell among them, and were not to deliver him up to the avenger of blood till he had stood before the congregation for judgment. Consequently, if the slayer of a man presented himself with the request to be received, the elders of the free city had to make a provisional inquiry into his case, to decide whether they should grant him protection in the city; and then if the avenger of blood appeared, they were not to deliver up the person whom they had received, but to hand him over, on the charge of the avenger of blood, to the congregation to whom he belonged, or among whom the act had taken place, that they might investigate the case, and judge whether the deed itself was wilful or accidental. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The establishment of cities of refuge presupposed the custom and right of revenge. The custom itself goes back to the very earliest times of the human race (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); it prevailed among the Israelites, as well as the other nations of antiquity, and still continues among the Arabs in unlimited force (cf. Niebuhr, Arab. pp. 32ff.; Burckhardt, Beduinen, 119, 251ff.). \"Revenge of blood prevailed almost everywhere, so long as there was no national life generated, or it was still in the first stages of its development; and consequently the expiation of any personal violation of justice was left to private revenge, and more especially to family zeal\" (Oehler in Herzog's B. Cycl., where the proofs may be seen). The warrant for this was the principle of retribution, the jus talionis, which lay at the foundation of the divine order of the world in general, and the Mosaic law in particular, and which was sanctioned by God, so far as murder was concerned, even in the time of Noah, by the command, \"Whoso sheddeth man's blood,\" etc. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This warrant, however, or rather obligation to avenge murder, was subordinated to the essential principle of the theocracy, under the Mosaic law. Whilst God Himself would avenge the blood that was shed, not only upon men, but upon animals also (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and commanded blood-revenge, He withdrew the execution of it from subjective caprice, and restricted it to cases of premeditated slaying or murder, by appointing cities of refuge, which were to protect the manslayer from the avenger, until he took his trial before the congregation. גּאל, redeemer, is \"that particular relative whose special duty it was to restore the violated family integrity, who had to redeem not only landed property that had been alienated from the family (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), or a member of the family that had fallen into slavery (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), but also the blood that had been taken away from the family by murder\" (Oehler). In the latter respect he was called הדּם גּאל, (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 19:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). From ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we may see that it was the duty of the whole family to take care that blood-revenge was carried out. The performance of the duty itself, however, was probably regulated by the closeness of the relationship, and corresponded to the duty of redeeming from bondage (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to the right of inheritance (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 27:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). What standing before the congregation was to consist of, is defined more fully in what follows (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). If we compare with this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 20:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., the manslayer, who fled from the avenger of blood into a free city, was to stand before the gates of the city, and state his cause before the elders. They were then to receive him into the city, and give him a place that he might dwell among them, and were not to deliver him up to the avenger of blood till he had stood before the congregation for judgment. Consequently, if the slayer of a man presented himself with the request to be received, the elders of the free city had to make a provisional inquiry into his case, to decide whether they should grant him protection in the city; and then if the avenger of blood appeared, they were not to deliver up the person whom they had received, but to hand him over, on the charge of the avenger of blood, to the congregation to whom he belonged, or among whom the act had taken place, that they might investigate the case, and judge whether the deed itself was wilful or accidental. ",
            "children": []
          }
        ]
      }
    ]
  }
]