[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35:1-8 The cities of the priests and Levites were not only to accommodate them, but to place them, as religious teachers, in several parts of the land. For though the typical service of the tabernacle or temple was only in one place, the preaching of the word of God, and prayer and praise, were not thus confined. These cities were to be given out of each tribe. Each thus made a grateful acknowledgement to God. Each tribe had the benefit of the Levites dwelling amongst them, to teach them the knowledge of the Lord; thus no parts of the country were left to sit in darkness. The gospel provides that he who is taught in the word, should communicate to him that teaches, in all good things, Ga 6:6. We are to free God's ministers from distracting cares, and to leave them at leisure for the duties of their station; so that they may be wholly employed therein, and avail themselves of every opportunity, by acts of kindness, to gain the good-will of the people, and to draw their attention.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Levitical cities were in an special manner the Lord's; and therefore the places of refuge, where the manslayer might remain under the protection of a special institution devised by divine mercy, were appropriately selected from among them. No doubt also the Priests and Levites would be the fittest persons to administer the law in the doubtful cases which would be sure to occur: compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nu 35:6-8. Cities of Refuge.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6. there shall be six cities for refuge, which ye shall appoint for the manslayer—The establishment of those privileged sanctuaries among the cities of the Levites is probably traceable to the idea, that they would be the most suitable and impartial judges—that their presence and counsels might calm or restrain the stormy passions of the blood avenger—and that, from their being invested with the sacred character, they might be types of Christ, in whom sinners find a refuge from the destroyer (see De 4:43; Jos 20:8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So all the cities which ye shall give to the Levites shall be forty eight cities,.... Of these forty eight cities, their names, and what tribes they were in, and which of them were particularly cities of refuge, an account is given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "them shall ye give, with their suburbs; according to the dimensions before prescribed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "them shall ye give, with their suburbs; according to the dimensions before prescribed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So all the cities which ye shall give to the Levites shall be forty and eight cities: them shall ye give with their suburbs.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Forty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and eight cities.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The  Levites numbered nearly 50,000 souls (see on Numbers 26:62), so that each Levitical city would have an average population of about 1000 to start with. There seems no sufficient reason for supposing that they shared their towns with men of the surrounding tribe. Even if the provision made for their habitation was excessive at first (which does not appear), yet their rate of increase should have been exceptionally high, inasmuch as they were not liable to military service. It is possible that mystical reasons led to the selection of the number forty-eight (12 x 4, both typical of universality), but it is at least equally probable that it was determined by the actual numbers of the tribe. Numbers 35:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Of these cities which were given up to the Levites, six were to serve as cities of refuge (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for manslayers, and in addition to these (עליהם, over upon them) the Israelites were to give of their possessions forty-two others, that is to say, forty-eight in all; and they were to do this, giving much from every tribe that had much, and little from the one which had little (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 26:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). With the accusatives הערים את and ערי שׁשׁ עת (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the writer has already in his mind the verbs תּרבּוּ and תּמעיטוּ of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where he takes up the object again in the word והערים. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Levites received nine cities in the territory of Judah and Simeon, four in the territory of each of the other tribes, with the exception of Naphtali, in which there were only three, that is to say, ten in the land to the east of the Jordan, and thirty-eight in Canaan proper, of which the thirteen given up by Judah, Simeon, and Benjamin were assigned to the families of the priests, and the other thirty-five to the three Levitical families. This distribution of the Levites among all the tribes - by which the curse of division and dispersion in Israel, which had been pronounced upon Levi in Jacob's blessing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was changed into a blessing both for the Levites themselves and also for all Israel - was in perfect accordance with the election and destination of this tribe. Called out of the whole nation to be the peculiar possession of Jehovah, to watch over His covenant, and teach Israel His rights and His law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Levites were to form and set forth among all the tribes the ἐκλογή of the nation of Jehovah's possession, and by their walk as well as by their calling to remind the Israelites continually of their own divine calling; to foster and preserve the law and testimony of the Lord in Israel, and to awaken and spread the fear of God and piety among all the tribes. Whilst their distribution among all the tribes corresponded to this appointment, the fact that they were not scattered in all the towns and villages of the other tribes, but were congregated together in separate towns among the different tribes, preserved them from the disadvantages of standing alone, and defended them from the danger of moral and spiritual declension. Lastly, in the number forty-eight, the quadrupling of the number of the tribes (twelve) is unmistakeable. Now, as the number four is the seal of the kingdom of God in the world, the idea of the kingdom of God is also represented in the four times twelve towns (cf. Bhr, Symbolik, ii. pp. 50, 51). ",
        "children": []
      }
    ]
  }
]