[{"header":"God Chooses Abram"},{"num":12,"verse":"The Lord had said to Abram, “Go from your country, your people and your father’s family. Go to the land I will show you."},{"num":4,"verse":"So Abram went, just as the Lord had told him. Lot went with him. Abram was 75 years old when he left Harran. "},{"num":5,"verse":"He took his wife Sarai and his nephew Lot. They took all the people and possessions they had acquired in Harran. They started out for the land of Canaan. And they arrived there."},{"num":6,"verse":"Abram traveled through the land. He went as far as the large tree of Moreh at Shechem. At that time the Canaanites were living in the land. "},{"num":7,"verse":"The Lord appeared to Abram at Shechem. He said, “I will give this land to your family who comes after you.” So Abram built an altar there to honor the Lord, who had appeared to him."},{"num":8,"verse":"From there, Abram went on toward the hills east of Bethel. He set up his tent there. Bethel was to the west, and Ai was to the east. Abram built an altar there and called on the name of the Lord."},{"num":9,"verse":"Then Abram left and continued south toward the Negev Desert."},{"header":"Abram Goes to Egypt"},{"num":10,"verse":"At that time there was not enough food in the land. So Abram went down to Egypt to live there for a while. "},{"num":11,"verse":"As he was about to enter Egypt, he spoke to his wife Sarai. He said, “I know what a beautiful woman you are. "},{"num":12,"verse":"The people of Egypt will see you and say, ‘This is his wife.’ Then they will kill me. But they will let you live. "},{"num":13,"verse":"Tell them you are my sister. Then I’ll be treated well and my life will be spared because of you.”"},{"num":14,"verse":"Abram arrived in Egypt. The Egyptians saw that Sarai was a very beautiful woman. "},{"num":15,"verse":"When Pharaoh’s officials saw her, they told Pharaoh how beautiful she was. So she was taken into his palace. "},{"num":16,"verse":"Pharaoh treated Abram well because of her. So Abram gained more sheep and cattle and male and female donkeys. He also gained more male and female servants and some camels."},{"num":17,"verse":"But the Lord sent terrible sicknesses on Pharaoh and everyone in his palace. The Lord did it because of Abram’s wife Sarai. "},{"num":18,"verse":"So Pharaoh sent for Abram. “What have you done to me?” he said. “Why didn’t you tell me she was your wife? "},{"num":19,"verse":"Why did you say she was your sister? That’s why I took her to be my wife. Now then, here’s your wife. Take her and go!” "},{"num":20,"verse":"Then Pharaoh gave orders to his men about Abram. They sent him on his way. So he left with his wife and everything he had."}]