[[],[{"type":"header","content":"Promises to Abram(A)"},{"type":"prose","content":"Now the  had said to Abram:"}],[{"type":"prose","content":"So Abram departed as the  had spoken to him, and Lot went with him. And Abram  seventy-five years old when he departed from Haran. "}],[{"type":"prose","content":"Then Abram took Sarai his wife and Lot his brother’s son, and all their possessions that they had gathered, and the people whom they had acquired in Haran, and they departed to go to the land of Canaan. So they came to the land of Canaan. "}],[{"type":"prose","content":"Abram passed through the land to the place of Shechem, as far as the terebinth tree of Moreh. And the Canaanites  then in the land."}],[{"type":"prose","content":"Then the  appeared to Abram and said, “To your descendants I will give this land.” And there he built an altar to the , who had appeared to him. "}],[{"type":"prose","content":"And he moved from there to the mountain east of Bethel, and he pitched his tent  Bethel on the west and Ai on the east; there he built an altar to the  and called on the name of the . "}],[{"type":"prose","content":"So Abram journeyed, going on still toward the South."},{"type":"header","content":"Abram in Egypt"}],[{"type":"prose","content":"Now there was a famine in the land, and Abram went down to Egypt to dwell there, for the famine  severe in the land. "}],[{"type":"prose","content":"And it came to pass, when he was close to entering Egypt, that he said to Sarai his wife, “Indeed I know that you  a woman of beautiful countenance. "}],[{"type":"prose","content":"Therefore it will happen, when the Egyptians see you, that they will say, ‘This  his wife’; and they will kill me, but they will let you live. "}],[{"type":"prose","content":"Please say you  my sister, that it may be well with me for your sake, and that I may live because of you.”"}],[{"type":"prose","content":"So it was, when Abram came into Egypt, that the Egyptians saw the woman, that she  very beautiful. "}],[{"type":"prose","content":"The princes of Pharaoh also saw her and commended her to Pharaoh. And the woman was taken to Pharaoh’s house. "}],[{"type":"prose","content":"He treated Abram well for her sake. He had sheep, oxen, male donkeys, male and female servants, female donkeys, and camels."}],[{"type":"prose","content":"But the  plagued Pharaoh and his house with great plagues because of Sarai, Abram’s wife. "}],[{"type":"prose","content":"And Pharaoh called Abram and said, “What  this you have done to me? Why did you not tell me that she  your wife? "}],[{"type":"prose","content":"Why did you say, ‘She  my sister’? I might have taken her as my wife. Now therefore, here is your wife; take  and go your way.” "}],[{"type":"prose","content":"So Pharaoh commanded  men concerning him; and they sent him away, with his wife and all that he had."}]]