[{"header":"[LECH LECHA]"},{"num":12,"verse":"Now Hashem had said unto Avram, Get thee out of thy country, and from thy kindred, and from the bais avicha, unto ha’aretz that I will show thee;"},{"num":2,"verse":"And I will make of thee a goy gadol (great nation), and I will bless thee, and make thy shem great; and thou shalt be a brocha (blessing);"},{"num":3,"verse":"And I will bless the one blessing you, and curse him that curses you; and kol mishpochot haadamah shall be blessed through you.[T.N. There is a brocha in this verse that many do not know but that every true follower of Moshiach should know.]"},{"num":4,"verse":"So Avram departed as Hashem had told him; and Lot went with him; and Avram was seventy and five years old when he departed out of Charan."},{"num":5,"verse":"And Avram took Sarai his isha, and Lot his brother’s son, and all their possessions that they had amassed, and the nefesh that they had gotten in Charan; and they went forth to go into the land of Kena’an; and they arrived in the land of Kena’an."},{"num":6,"verse":"And Avram passed through the land unto the makom Shechem, unto Elon Moreh. And the Kena’ani was then in ha’aretz."},{"num":7,"verse":"And Hashem appeared unto Avram, and said, Unto thy zera will I give ha’aretz hazot: and there built he a Mizbe’ach unto Hashem, Who appeared unto him."},{"num":8,"verse":"And he removed from there unto the harah mikedem Beit-El, and pitched his tent, having Beit-El on the west, and Ai on the east; and there he built a Mizbe’ach unto Hashem,and called upon the Shem of Hashem."},{"num":9,"verse":"And Avram journeyed, going on still toward the Negev."},{"num":10,"verse":"And there was a ra’av in the land; and Avram went down into Mitzrayim to sojourn there; for the ra’av was severe in ha’aretz."},{"num":11,"verse":"And it came to pass, when he was about to enter into Mitzrayim, that he said unto Sarai his isha, Hinei now, I know that thou art an isha yafeh to look upon;"},{"num":12,"verse":"Therefore it shall come to pass, when the Egyptians shall see thee, that they shall say, This is his isha; and they will kill me, but they will save thee alive."},{"num":13,"verse":"Say, now, thou art my achot; that it may be well with me for thy sake; and my nefesh shall live on account of thee."},{"num":14,"verse":"And it came to pass, that, when Avram was come into Mitzrayim, the Egyptians beheld the isha that she was yafeh me’od."},{"num":15,"verse":"The sarim of Pharaoh also saw her, and commended her before Pharaoh; and the isha was taken into Bais Pharaoh."},{"num":16,"verse":"And he treated Avram well for her sake: and he acquired sheep and oxen, and male donkeys, and avadim, and shfachot, and female donkeys, and camels."},{"num":17,"verse":"And Hashem plagued Pharaoh and his Bais with nega’im gedolim because of Sarai eshet Avram."},{"num":18,"verse":"And Pharaoh summoned Avram and said, What is this that thou hast done unto me? Why didst thou not tell me that she was thy isha?"},{"num":19,"verse":"Why saidst thou, She is my achot? So I might have taken her to me to wife; now therefore, hinei, thy wife, take her, and go!"},{"num":20,"verse":"And Pharaoh commanded his anashim concerning him; and they sent him away, and his isha, and all that he had."}]