[{"num":12,"verse":"God had told Abram, “Leave your own country behind you, and your own people, and go to the land I will guide you to. "},{"num":2,"verse":"If you do, I will cause you to become the father of a great nation; I will bless you and make your name famous, and you will be a blessing to many others. "},{"num":3,"verse":"I will bless those who bless you and curse those who curse you; and the entire world will be blessed because of you.”"},{"num":4,"verse":"So Abram departed as the Lord had instructed him, and Lot went too; Abram was seventy-five years old at that time. "},{"num":5,"verse":"He took his wife Sarai, his nephew Lot, and all his wealth—the cattle and slaves he had gotten in Haran—and finally arrived in Canaan. "},{"num":6,"verse":"Traveling through Canaan, they came to a place near Shechem, and set up camp beside the oak at Moreh. (This area was inhabited by Canaanites at that time.)"},{"num":7,"verse":"Then Jehovah appeared to Abram and said, “I am going to give this land to your descendants.” And Abram built an altar there to commemorate Jehovah’s visit. "},{"num":8,"verse":"Afterwards Abram left that place and traveled southward to the hilly country between Bethel on the west and Ai on the east. There he made camp, and made an altar to the Lord and prayed to him. "},{"num":9,"verse":"Thus he continued slowly southward to the Negeb, pausing frequently."},{"num":10,"verse":"There was at that time a terrible famine in the land: and so Abram went on down to Egypt to live. "},{"num":11,"verse":"But as he was approaching the borders of Egypt, he asked Sarai his wife to tell everyone that she was his sister! “You are very beautiful,” he told her, “and when the Egyptians see you they will say, ‘This is his wife. Let’s kill him and then we can have her!’ But if you say you are my sister, then the Egyptians will treat me well because of you, and spare my life!” "},{"num":14,"verse":"And sure enough, when they arrived in Egypt everyone spoke of her beauty. "},{"num":15,"verse":"When the palace aides saw her, they praised her to their king, the Pharaoh, and she was taken into his harem. "},{"num":16,"verse":"Then Pharaoh gave Abram many gifts because of her—sheep, oxen, donkeys, men and women slaves, and camels."},{"num":17,"verse":"But the Lord sent a terrible plague upon Pharaoh’s household on account of her being there. "},{"num":18,"verse":"Then Pharaoh called Abram before him and accused him sharply. “What is this you have done to me?” he demanded. “Why didn’t you tell me she was your wife? "},{"num":19,"verse":"Why were you willing to let me marry her, saying she was your sister? Here, take her and be gone!” "},{"num":20,"verse":"And Pharaoh sent them out of the country under armed escort—Abram, his wife, and all his household and possessions."}]