[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:20-33 It is here promised that they should be guided and kept in their way through the wilderness to the land of promise, Behold, I send an angel before thee, mine angel. The precept joined with this promise is, that they be obedient to this angel whom God would send before them. Christ is the Angel of Jehovah; this is plainly taught by St. Paul, 1Co 10:9. They should have a comfortable settlement in the land of Canaan. How reasonable are the conditions of this promise; that they should serve the only true God; not the gods of the nations, which are no gods at all. How rich are the particulars of this promise! The comfort of their food, the continuance of their health, the increase of their wealth, the prolonging their lives to old age. Thus hath godliness the promise of the life that now is. It is promised that they should subdue their enemies. Hosts of hornets made way for the hosts of Israel; such mean creatures can God use for chastising his people's enemies. In real kindness to the church, its enemies are subdued by little and little; thus we are kept on our guard, and in continual dependence on God. Corruptions are driven out of the hearts of God's people, not all at once, but by little and little. The precept with this promise is, that they should not make friendship with idolaters. Those that would keep from bad courses, must keep from bad company. It is dangerous to live in a bad neighbourhood; others' sins will be our snares. Our greatest danger is from those who would make us sin against God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Beast of the field - i. e. destructive animals. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29, 30. I will not drive … out … in one year; lest the land become desolate—Many reasons recommend a gradual extirpation of the former inhabitants of Canaan. But only one is here specified—the danger lest, in the unoccupied grounds, wild beasts should inconveniently multiply; a clear proof that the promised land was more than sufficient to contain the actual population of the Israelites.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By little and little I will drive them out from before thee,.... Not the beasts of the field, but the inhabitants of Canaan, who were left partly to keep up the cities and towns, that they might not fall to ruin, and to till the land, that it might not be desolate; and partly to be trials and exercises to the people of Israel, and to prove whether they would serve the Lord or not. Just as the corruptions of human nature remain with the people of God when converted, for the trial and exercise of their graces, and that they may have their dependence not on themselves, but on the grace of God to keep them in his ways, and to preserve them safe to eternal glory; and by completing the work of grace, which is gradually done, they might be made meet for it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until thou be increased, and inherit the land; for as their enemies were driven out gradually, by little and little, so they multiplied gradually, until at length they became a sufficient number to fill all the cities and towns in all the nations of Canaan, and take an entire possession of it, as their inheritance given unto them by God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "until thou be increased, and inherit the land; for as their enemies were driven out gradually, by little and little, so they multiplied gradually, until at length they became a sufficient number to fill all the cities and towns in all the nations of Canaan, and take an entire possession of it, as their inheritance given unto them by God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "By little and little I will drive them out from before thee, until thou be increased, and inherit the land.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In addition to the fear of God, hornets (הצּרעה construed as a generic word with the collective article), a very large species of wasp, that was greatly dreaded both by man and beast on account of the acuteness of its sting, should come and drive out the Canaanites, of whom three tribes are mentioned instar omnium, from before the Israelites. Although it is true that Aelian (hist. anim. 11, 28) relates that the Phaselians, who dwelt near the Solymites, and therefore probably belonged to the Canaanites, were driven out of their country by wasps, and Bochart (Hieroz. iii. pp. 409ff.) has collected together accounts of different tribes that have been frightened away from their possessions by frogs, mice, and other vermin, \"the sending of hornets before the Israelites\" is hardly to be taken literally, not only because there is not a word in the book of Joshua about the Canaanites being overcome and exterminated in any such way, but chiefly on account of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Joshua says that God sent the hornet before them, and drove out the two kings of the Amorites, referring thereby to their defeat and destruction by the Israelites through the miraculous interposition of God, and thus placing the figurative use of the term hornet beyond the possibility of doubt. These hornets, however, which are very aptly described in Wis. 12:8, on the basis of this passage, as προδρόμους, the pioneers of the army of Jehovah, do not denote merely varii generis mala, as Rosenmller supposes, but acerrimos timoris aculeos, quibus quodammodo volantibus rumoribus pungebantur, ut fugerent (Augustine, quaest. 27 in Jos.). If the fear of God which fell upon the Canaanites threw them into such confusion and helpless despair, that they could not stand before Israel, but turned their backs towards them, the stings of alarm which followed this fear would completely drive them away. Nevertheless God would not drive them away at once, \"in one year,\" lest the land should become a desert for want of men to cultivate it, and the wild beasts should multiply against Israel; in other words, lest the beasts of prey should gain the upper hand and endanger the lives of man and beast (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which actually was the case after the carrying away of the ten tribes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 17:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He would drive them out by degrees (מעט מעט, only used here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), until Israel was sufficiently increased to take possession of the land, i.e., to occupy the whole of the country. This promise was so far fulfilled, according to the books of Joshua and Judges, that after the subjugation of the Canaanites in the south and north of the land, when all the kings who fought against Israel had been smitten and slain and their cities captured, the entire land was divided among the tribes of Israel, in order that they might exterminate the remaining Canaanites, and take possession of those portions of the land that had not yet been conquered (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 13:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But the different tribes soon became weary of the task of exterminating the Canaanites, and began to enter into alliance with them, and were led astray by them to the worship of idols; whereupon God punished them by withdrawing His assistance, and they were oppressed and humiliated by the Canaanites because of their apostasy from the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and 2).",
        "children": []
      }
    ]
  }
]