[{"header":"Votive Offerings and Dedicated Things"},{"num":27,"verse":"The Lord spoke to Moses: "},{"num":2,"verse":"“Speak to the Israelites and say this to them.”"},{"num":3,"verse":"the set value of a male from twenty years to sixty years of age is fifty shekels of silver, using the sanctuary shekel as the standard. "},{"num":4,"verse":"If it is a female, the value is thirty shekels. "},{"num":5,"verse":"If the age is from five years to twenty years, the value is twenty shekels for a male and ten shekels for a female. "},{"num":6,"verse":"If the age is from one month to five years, the value for the male is five shekels of silver, while the value for the female is three shekels of silver. "},{"num":7,"verse":"If the age is sixty years or over, the value is fifteen shekels for a male and ten shekels for a female. "},{"num":8,"verse":"But if anyone making a dedication is too poor to pay that standard value, he shall appear before the priest with the dedicated person, and the priest shall assess a substitute valuation for the person. The priest shall assess a value on the basis of what the person who has made the vow can afford."},{"num":9,"verse":"If what is vowed is livestock which is acceptable as an offering to the Lord, anything that a person dedicates to the Lord is set apart as holy. "},{"num":10,"verse":"He may not exchange it or substitute another for it, either good for bad, or bad for good. If he substitutes one animal for another, both the animal and its substitute are set aside as holy. "},{"num":11,"verse":"If what has been vowed is any kind of unclean livestock, which may not be presented as an offering to the Lord, he shall present the animal before the priest "},{"num":12,"verse":"so that the priest may assess it. Whatever value is set by the priest, whether high or low, will be binding. "},{"num":13,"verse":"But if he does indeed redeem it, he must add one-fifth to its value."},{"num":14,"verse":"When a person dedicates his house as holy to the Lord, the priest shall assess it. Whatever value the priest assesses, whether high or low, will be binding. "},{"num":15,"verse":"But if the person who has dedicated his house redeems it, he must add one-fifth to its value in silver, so that it belongs to him again."},{"num":16,"verse":"If a person dedicates any field from his family property to the Lord, its value shall be based on how much seed is needed to sow it. Land sown by six bushels of barley seed is worth fifty shekels of silver. "},{"num":17,"verse":"If he dedicates his field during the year of Jubilee, its value stands as stated, "},{"num":18,"verse":"but if he dedicates his field after the Jubilee, the priest shall recalculate its value in silver based on the number of years that are left until the next year of Jubilee, and that much will be deducted from the value. "},{"num":19,"verse":"If the person who dedicated the field redeems it, he must add one-fifth to its value in silver, so that it may be returned to him. "},{"num":20,"verse":"But if he does not redeem the field but has sold the field to another person, it may no longer be redeemed. "},{"num":21,"verse":"When the field is released on the Jubilee, it will be set aside as holy. It belongs to the Lord as a dedicated field. It belongs to the priest as his holding."},{"num":22,"verse":"If someone dedicates to the Lord a field he has purchased that is not part of his family landholding, "},{"num":23,"verse":"the priest shall calculate the amount of value until the year of Jubilee, so that he may pay the value on that day as something holy to the Lord. "},{"num":24,"verse":"In the year of Jubilee, the field shall return to the person from whom the donor bought it, to the one to whom the landholding originally belonged. "},{"num":25,"verse":"Every value shall be based on the sanctuary shekel, which has twenty gerahs to the shekel."},{"num":26,"verse":"However, no one may dedicate a firstborn from the livestock that has already been designated for the Lord as a firstborn, whether it is a head of cattle or a sheep or a goat. It already belongs to the Lord. "},{"num":27,"verse":"But if it is one of the unclean livestock, he may buy it back at its set value plus one-fifth. If it is not redeemed, it may be sold at its set value."},{"num":28,"verse":"However, if anyone devotes anything that belongs to him to the Lord unconditionally, whether it is a human being or livestock or any part of his landholding, it may not be sold and may not be redeemed. Everything devoted unconditionally is most holy to the Lord."},{"num":29,"verse":"Any person who has been devoted to destruction may not be ransomed. He must certainly be put to death."},{"num":30,"verse":"But every tithe from the land, whether from the seed of the land or from the fruit of the trees, belongs to the Lord. It is holy to the Lord. "},{"num":31,"verse":"If anyone redeems any of his tithe, he must add one-fifth to it. "},{"num":32,"verse":"The tithe from the herd or the flock, that is, every tenth animal that passes under the staff of the shepherd, shall be set apart as holy to the Lord. "},{"num":33,"verse":"The donor must not sort out the good from the bad, and he must not make any substitutions for it. If he makes a substitution for it, then both the first animal and its substitute shall be set apart as holy. It cannot be redeemed."},{"num":34,"verse":"These are the commandments that the Lord commanded Moses for the people of Israel at Mount Sinai."}]