[{"header":"Redemption of Persons Given as Votive Offerings"},{"num":27,"verse":"The Lord spoke to Moses: "},{"num":2,"verse":"“Speak to the Israelites and tell them, ‘When a man makes a special votive offering based on the conversion value of a person to the Lord, "},{"num":3,"verse":"the conversion value of the male from twenty years old up to sixty years old is fifty shekels by the standard of the sanctuary shekel. "},{"num":4,"verse":"If the person is a female, the conversion value is thirty shekels. "},{"num":5,"verse":"If the person is from five years old up to twenty years old, the conversion value of the male is twenty shekels, and for the female ten shekels. "},{"num":6,"verse":"If the person is one month old up to five years old, the conversion value of the male is five shekels of silver, and for the female the conversion value is three shekels of silver. "},{"num":7,"verse":"If the person is from sixty years old and older, if he is a male the conversion value is fifteen shekels, and for the female ten shekels. "},{"num":8,"verse":"If the person making the votive offering is too poor to pay the conversion value, he must stand the person before the priest and the priest will establish his conversion value; according to what the man who made the votive offering can afford, the priest will establish his conversion value."},{"header":"Redemption of Animals Given as Votive Offerings"},{"num":9,"verse":"“‘If what is vowed is a kind of animal from which an offering may be presented to the Lord, anything which he gives to the Lord from this kind of animal will be holy. "},{"num":10,"verse":"He must not replace or exchange it, good for bad or bad for good, and if he does indeed exchange one animal for another animal, then both the original animal and its substitute will be holy. "},{"num":11,"verse":"If what is vowed is an unclean animal from which an offering must not be presented to the Lord, then he must stand the animal before the priest, "},{"num":12,"verse":"and the priest will establish its conversion value, whether good or bad. According to the conversion value assessed by the priest, thus it will be. "},{"num":13,"verse":"If, however, the person who made the vow redeems the animal, he must add one-fifth to its conversion value."},{"header":"Redemption of Houses Given as Votive Offerings"},{"num":14,"verse":"“‘If a man consecrates his house as holy to the Lord, the priest will establish its conversion value, whether good or bad. Just as the priest establishes its conversion value, thus it will stand. "},{"num":15,"verse":"If the one who consecrates it redeems his house, he must add to it one-fifth of its conversion value in silver, and it will belong to him."},{"header":"Redemption of Fields Given as Votive Offerings"},{"num":16,"verse":"“‘If a man consecrates to the Lord some of his own landed property, the conversion value must be calculated in accordance with the amount of seed needed to sow it, a homer of barley seed being priced at fifty shekels of silver. "},{"num":17,"verse":"If he consecrates his field in the Jubilee year, the conversion value will stand, "},{"num":18,"verse":"but if he consecrates his field after the Jubilee, the priest will calculate the price for him according to the years that are left until the next Jubilee year, and it will be deducted from the conversion value. "},{"num":19,"verse":"If, however, the one who consecrated the field redeems it, he must add to it one-fifth of the conversion price and it will belong to him. "},{"num":20,"verse":"If he does not redeem the field, but sells the field to someone else, he may never redeem it. "},{"num":21,"verse":"When it reverts in the Jubilee, the field will be holy to the Lord like a permanently dedicated field; it will become the priest’s property."},{"num":22,"verse":"“‘If he consecrates to the Lord a field he has purchased, which is not part of his own landed property, "},{"num":23,"verse":"the priest will calculate for him the amount of its conversion value until the Jubilee year, and he must pay the conversion value on that Jubilee day as something that is holy to the Lord. "},{"num":24,"verse":"In the Jubilee year the field will return to the one from whom he bought it, the one to whom it belongs as landed property. "},{"num":25,"verse":"Every conversion value must be calculated by the standard of the sanctuary shekel; twenty gerahs to the shekel."},{"header":"Redemption of the Firstborn"},{"num":26,"verse":"“‘Surely no man may consecrate a firstborn that already belongs to the Lord as a firstborn among the animals; whether it is an ox or a sheep, it belongs to the Lord. "},{"num":27,"verse":"If, however, it is among the unclean animals, he may ransom it according to its conversion value and must add one-fifth to it, but if it is not redeemed it must be sold according to its conversion value."},{"header":"Things Permanently Dedicated to the Lord"},{"num":28,"verse":"“‘Surely anything that a man permanently dedicates to the Lord from all that belongs to him, whether from people, animals, or his landed property, must be neither sold nor redeemed; anything permanently dedicated is most holy to the Lord. "},{"num":29,"verse":"Any human being who is permanently dedicated to the Lord must not be ransomed; such a person must be put to death."},{"header":"Redemption of the Tithe"},{"num":30,"verse":"“‘Any tithe of the land, from the grain of the land or from the fruit of the trees, belongs to the Lord; it is holy to the Lord. "},{"num":31,"verse":"If a man redeems part of his tithe, however, he must add one-fifth to it. "},{"num":32,"verse":"All the tithe of herds or flocks, everything which passes under the rod, the tenth one will be holy to the Lord. "},{"num":33,"verse":"The owner must not examine the animals to distinguish between good and bad, and he must not exchange it. If, however, he does exchange it, both the original animal and its substitute will be holy and must not be  redeemed.’”"},{"header":"Final Colophon"},{"num":34,"verse":"These are the commandments which the Lord commanded Moses to tell the Israelites at Mount Sinai."}]