[{"header":"Laws about Gifts to the Lord"},{"num":27,"verse":"Then the Lord said to Moses, "},{"num":2,"verse":"“Say to the sons of Israel, ‘When a man makes a special promise, you will decide upon the worth of this person for the Lord. "},{"num":3,"verse":"The price you put on a man from twenty to sixty years old will be fifty pieces of silver, by the weight of the holy place. "},{"num":4,"verse":"For a woman it will be thirty pieces of silver. "},{"num":5,"verse":"For a male from five to twenty years old it will be twenty pieces of silver. For a woman it will be ten pieces of silver. "},{"num":6,"verse":"Your price for a child from one month to five years old will be five pieces of silver for the boy, and three pieces of silver for the girl. "},{"num":7,"verse":"Your price for a person sixty years old and older will be fifteen pieces of silver for the man, and ten pieces of silver for the woman. "},{"num":8,"verse":"But if the person is too poor to pay your price, he will be brought to the religious leader. The religious leader will decide the worth of the person by how much he who made the promise is able to pay."},{"num":9,"verse":"‘If it is a kind of animal which men give as a gift to the Lord, any such animal that is given to the Lord will be holy. "},{"num":10,"verse":"He must not have another animal take its place, good for bad or bad for good. If he does trade one animal for another, then both animals will become holy. "},{"num":11,"verse":"But if the animal is unclean and not the kind which men give to the Lord, then he will bring the animal to the religious leader. "},{"num":12,"verse":"The religious leader will decide if it is good or bad. Whatever price the religious leader puts on it, so it will be. "},{"num":13,"verse":"If the man wants to buy it again, he will add a fifth to your price."},{"num":14,"verse":"‘When a man sets apart his house as holy to the Lord, the religious leader will decide if it is good or bad. Whatever price the religious leader puts on it, so it will be. "},{"num":15,"verse":"If the man who sets it apart wants to buy his house again, he will add one-fifth part to your price. Then it will be his."},{"num":16,"verse":"‘If a man sets apart to the Lord part of a field he owns, you will decide upon its price by the seed needed for it. Ten baskets of barley seed will be worth fifty pieces of silver. "},{"num":17,"verse":"If he sets apart his field during the Year of Jubilee, it will be worth your full price. "},{"num":18,"verse":"But if he sets apart his field after the Year of Jubilee, the religious leader will decide upon its worth by the years left until the next Year of Jubilee. It will be taken off your price. "},{"num":19,"verse":"If the man who sets it apart wants to buy his field again, he will add one-fifth part to your price. Then it will be his. "},{"num":20,"verse":"But if he does not want to buy the field again, or has sold the field to another man, it cannot be bought again. "},{"num":21,"verse":"And when the field becomes free in the Jubilee, it will be holy to the Lord, like a field set apart. It will belong to the religious leader. "},{"num":22,"verse":"If a man sets apart to the Lord a field he has bought, which is not a part of the land he was given by his father, "},{"num":23,"verse":"the religious leader will decide its worth until the Year of Jubilee. The man will pay that amount on that day as holy to the Lord. "},{"num":24,"verse":"In the Year of Jubilee the field will return from him who bought it to the one who owned it first. "},{"num":25,"verse":"The price of silver used in the holy place will decide its worth. One piece of silver will be worth twenty small pieces of money."},{"num":26,"verse":"‘But no man may set apart a first-born of the animals. A first-born of the cattle or the flock belongs to the Lord. "},{"num":27,"verse":"If it is an animal that is unclean, he will buy it again by paying your price and one-fifth part added to it. If it is not bought again, then it will be sold for your price."},{"num":28,"verse":"‘But nothing that a man sets apart to the Lord of all he has, of man or animal or his own land, will be sold or bought. Everything that has been set apart is most holy to the Lord. "},{"num":29,"verse":"No person who has been set apart to be destroyed from among men can be paid for. He must be put to death."},{"num":30,"verse":"‘The tenth part of all the land, of the seed of the land or of the fruit of the tree, is the Lord’s. It is holy to the Lord. "},{"num":31,"verse":"If a man wants to buy any of the tenth part that belongs to the Lord, he will add one-fifth part to its price. "},{"num":32,"verse":"And every tenth animal of the cattle or flock, whatever passes under the shepherd’s stick, the tenth one will be holy to the Lord. "},{"num":33,"verse":"The man will not ask if it is good or bad, or trade it for something else. If he does trade it for something else, then both will become holy. He cannot buy them again.’”"},{"num":34,"verse":"These are the Laws the Lord gave Moses on Mount Sinai for the sons of Israel."}]