[{"num":6,"verse":"¶ The sons of Levi: Gershon, Kohath, and Merari."},{"num":2,"verse":"The sons of Kohath: Amram, Izhar, Hebron, and Uzziel."},{"num":3,"verse":"The sons of Amram: Aaron, Moses, and Miriam. The sons of Aaron: Nadab, Abihu, Eleazar, and Ithamar."},{"num":4,"verse":"Eleazar begat Phinehas, and Phinehas begat Abishua,"},{"num":5,"verse":"and Abishua begat Bukki, and Bukki begat Uzzi,"},{"num":6,"verse":"and Uzzi begat Zerahiah, and Zerahiah begat Meraioth,"},{"num":7,"verse":"and Meraioth begat Amariah, and Amariah begat Ahitub,"},{"num":8,"verse":"and Ahitub begat Zadok, and Zadok begat Ahimaaz,"},{"num":9,"verse":"and Ahimaaz begat Azariah, and Azariah begat Johanan,"},{"num":10,"verse":"and Johanan begat Azariah, who had the priesthood in the house that Solomon built in Jerusalem,"},{"num":11,"verse":"and Azariah begat Amariah, and Amariah begat Ahitub,"},{"num":12,"verse":"and Ahitub begat Zadok, and Zadok begat Shallum,"},{"num":13,"verse":"and Shallum begat Hilkiah, and Hilkiah begat Azariah,"},{"num":14,"verse":"and Azariah begat Seraiah, and Seraiah begat Jehozadak,"},{"num":15,"verse":"and Jehozadak went into captivity, when the LORD carried away Judah and Jerusalem by the hand of Nebuchadnezzar."},{"num":16,"verse":"The sons of Levi: Gershon, Kohath, and Merari."},{"num":17,"verse":"And these are the names of the sons of Gershon: Libni and Shimei."},{"num":18,"verse":"The sons of Kohath: Amram, Izhar, Hebron, and Uzziel."},{"num":19,"verse":"The sons of Merari: Mahli, Mushi. These are the families of the Levites according to their fathers."},{"num":20,"verse":"Of Gershon: Libni, his son, Jahath his son, Zimmah his son,"},{"num":21,"verse":"Joah, his son, Iddo, his son, Zerah, his son, Jeaterai, his son."},{"num":22,"verse":"The sons of Kohath: Amminadab, his son, Korah, his son, Assir, his son,"},{"num":23,"verse":"Elkanah, his son, and Ebiasaph, his son, and Assir, his son,"},{"num":24,"verse":"Tahath, his son, Uriel, his son, Uzziah, his son, and Saul, his son."},{"num":25,"verse":"The sons of Elkanah: Amasai, Ahimoth, and Elkanah."},{"num":26,"verse":"The sons of Elkanah: Zophai, his son, and Nahath, his son,"},{"num":27,"verse":"Eliab, his son, Jeroham, his son, Elkanah, his son."},{"num":28,"verse":"The sons of Samuel: the firstborn Vashni and Abiah."},{"num":29,"verse":"The sons of Merari: Mahli, Libni, his son, Shimei, his son, Uzza, his son,"},{"num":30,"verse":"Shimea, his son, Haggiah, his son, Asaiah, his son."},{"num":31,"verse":"¶ And these are they whom David set over the service of song in the house of the LORD, after the ark had rest."},{"num":32,"verse":"And they served before the tent of the tabernacle of the testimony with singing until Solomon had built the house of the LORD in Jerusalem, and then they remained in their ministry according to their right."},{"num":33,"verse":"And these are those that remained with their sons. Of the sons of the Kohath: Heman, a singer, the son of Joel, the son of Shemuel,"},{"num":34,"verse":"the son of Elkanah, the son of Jeroham, the son of Eliel, the son of Toah,"},{"num":35,"verse":"the son of Zuph, the son of Elkanah, the son of Mahath, the son of Amasai,"},{"num":36,"verse":"the son of Elkanah, the son of Joel, the son of Azariah, the son of Zephaniah,"},{"num":37,"verse":"the son of Tahath, the son of Assir, the son of Ebiasaph, the son of Korah,"},{"num":38,"verse":"the son of Izhar, the son of Kohath, the son of Levi, the son of Israel."},{"num":39,"verse":"And his brother Asaph, who stood on his right hand, even Asaph the son of Berachiah, the son of Shimea,"},{"num":40,"verse":"the son of Michael, the son of Baaseiah, the son of Malchiah,"},{"num":41,"verse":"the son of Ethni, the son of Zerah, the son of Adaiah,"},{"num":42,"verse":"the son of Ethan, the son of Zimmah, the son of Shimei,"},{"num":43,"verse":"the son of Jahath, the son of Gershon, the son of Levi."},{"num":44,"verse":"And their brethren, the sons of Merari, stood on the left hand; Ethan, the son of Kishi, the son of Abdi, the son of Malluch,"},{"num":45,"verse":"the son of Hashabiah, the son of Amaziah, the son of Hilkiah,"},{"num":46,"verse":"the son of Amzi, the son of Bani, the son of Shamer,"},{"num":47,"verse":"the son of Mahli, the son of Mushi, the son of Merari, the son of Levi."},{"num":48,"verse":"Their brethren, also the Levites, were given over unto all the ministry of the tabernacle of the house of God."},{"num":49,"verse":"But Aaron and his sons made incense upon the altar of the burnt offering and on the altar of incense, in all the work of the holy of holies, and to make reconciliation for Israel, according to all that Moses, the slave of God, had commanded."},{"num":50,"verse":"And these are the sons of Aaron: Eleazar, his son, Phinehas, his son, Abishua, his son,"},{"num":51,"verse":"Bukki, his son, Uzzi, his son, Zerahiah, his son,"},{"num":52,"verse":"Meraioth, his son, Amariah, his son, Ahitub, his son,"},{"num":53,"verse":"Zadok, his son, Ahimaaz, his son."},{"num":54,"verse":"¶ Now these are their dwelling places throughout their palaces in their borders, of the sons of Aaron, of the families of the Kohathites; for theirs was the lot,"},{"num":55,"verse":"that they gave them Hebron in the land of Judah and its suburbs round about it."},{"num":56,"verse":"But the fields around the city and its villages, they gave to Caleb the son of Jephunneh."},{"num":57,"verse":"And to the sons of Aaron they gave the cities of refuge of Judah, namely, Hebron and Libnah with their suburbs, and Jattir and Eshtemoa, with their suburbs,"},{"num":58,"verse":"and Hilen with her suburbs, Debir with her suburbs,"},{"num":59,"verse":"and Ashan with her suburbs, and Bethshemesh with her suburbs."},{"num":60,"verse":"And out of the tribe of Benjamin; Geba with her suburbs and Alemeth with her suburbs and Anathoth with her suburbs. All their cities throughout their families were thirteen cities."},{"num":61,"verse":"And unto the sons of Kohath, who were left of that family, they gave ten cities of the half tribe of Manasseh, by lot."},{"num":62,"verse":"And to the sons of Gershon, throughout their families, out of the tribe of Issachar and out of the tribe of Asher and out of the tribe of Naphtali and out of the tribe of Manasseh in Bashan, thirteen cities."},{"num":63,"verse":"Unto the sons of Merari were given by lot, throughout their families, out of the tribe of Reuben and out of the tribe of Gad and out of the tribe of Zebulun, twelve cities."},{"num":64,"verse":"And the sons of Israel gave to the Levites these cities with their suburbs."},{"num":65,"verse":"And they gave by lot out of the tribe of the sons of Judah and out of the tribe of the sons of Simeon and out of the tribe of the sons of Benjamin, these cities, which are called by their names."},{"num":66,"verse":"And the residue of the families of the sons of Kohath had cities with their borders out of the tribe of Ephraim."},{"num":67,"verse":"And they gave unto them, of the cities of refuge, Shechem in Mount Ephraim with her suburbs; they gave also Gezer with her suburbs,"},{"num":68,"verse":"and Jokmeam with her suburbs and Bethhoron with her suburbs,"},{"num":69,"verse":"and Aijalon with her suburbs and Gathrimmon with her suburbs."},{"num":70,"verse":"And out of the half tribe of Manasseh; Aner with her suburbs and Bileam with her suburbs, for the family of the remnant of the sons of Kohath."},{"num":71,"verse":"Unto the sons of Gershon were given out of the family of the half tribe of Manasseh, Golan in Bashan with her suburbs and Ashtaroth with her suburbs;"},{"num":72,"verse":"and out of the tribe of Issachar; Kedesh with her suburbs, Daberath with her suburbs,"},{"num":73,"verse":"and Ramoth with her suburbs, and Anem with her suburbs;"},{"num":74,"verse":"and out of the tribe of Asher, Mashal with her suburbs and Abdon with her suburbs"},{"num":75,"verse":"and Hukok with her suburbs and Rehob with her suburbs."},{"num":76,"verse":"And out of the tribe of Naphtali; Kedesh in Galilee with her suburbs and Hammon with her suburbs and Kirjathaim with her suburbs."},{"num":77,"verse":"Unto the rest of the sons of Merari were given out of the tribe of Zebulun, Rimmon with her suburbs, Tabor with her suburbs;"},{"num":78,"verse":"and on the other side of the Jordan by Jericho, on the east side of the Jordan, were given them out of the tribe of Reuben, Bezer in the wilderness with her suburbs and Jahzah with her suburbs,"},{"num":79,"verse":"Kedemoth also with her suburbs and Mephaath with her suburbs;"},{"num":80,"verse":"and out of the tribe of Gad; Ramoth in Gilead with her suburbs and Mahanaim with her suburbs,"},{"num":81,"verse":"and Heshbon with her suburbs and Jazer with her suburbs."}]