[{"header":"The Priestly Line"},{"num":6,"verse":"The sons of Levi were Gershon, Kohath, and Merari."},{"num":2,"verse":"The descendants of Kohath included Amram, Izhar, Hebron, and Uzziel."},{"num":3,"verse":"The children of Amram were Aaron, Moses, and Miriam."},{"header":"The Levite Clans"},{"num":16,"verse":"The sons of Levi were Gershon, Kohath, and Merari."},{"num":17,"verse":"The descendants of Gershon included Libni and Shimei."},{"num":18,"verse":"The descendants of Kohath included Amram, Izhar, Hebron, and Uzziel."},{"num":19,"verse":"The descendants of Merari included Mahli and Mushi."},{"num":20,"verse":"The descendants of Gershon included Libni, Jahath, Zimmah,"},{"num":21,"verse":"Joah, Iddo, Zerah, and Jeatherai."},{"num":22,"verse":"The descendants of Kohath included Amminadab, Korah, Assir,"},{"num":23,"verse":"Elkanah, Abiasaph, Assir,"},{"num":24,"verse":"Tahath, Uriel, Uzziah, and Shaul."},{"num":25,"verse":"The descendants of Elkanah included Amasai, Ahimoth,"},{"num":26,"verse":"Elkanah, Zophai, Nahath,"},{"num":27,"verse":"Eliab, Jeroham, Elkanah, and Samuel."},{"num":28,"verse":"The sons of Samuel were Joel (the older) and Abijah (the second)."},{"num":29,"verse":"The descendants of Merari included Mahli, Libni, Shimei, Uzzah,"},{"num":30,"verse":"Shimea, Haggiah, and Asaiah."},{"header":"The Temple Musicians"},{"num":31,"verse":"David assigned the following men to lead the music at the house of the Lord after the Ark was placed there."},{"num":32,"verse":"They ministered with music at the Tabernacle until Solomon built the Temple of the Lord in Jerusalem. They carried out their work, following all the regulations handed down to them."},{"num":33,"verse":"These are the men who served, along with their sons:"},{"num":34,"verse":"Elkanah, Jeroham, Eliel, Toah,"},{"num":35,"verse":"Zuph, Elkanah, Mahath, Amasai,"},{"num":36,"verse":"Elkanah, Joel, Azariah, Zephaniah,"},{"num":37,"verse":"Tahath, Assir, Abiasaph, Korah,"},{"num":38,"verse":"Izhar, Kohath, Levi, and Israel."},{"num":39,"verse":"Heman’s first assistant was Asaph from the clan of Gershon. Asaph’s genealogy was traced back through Berekiah, Shimea,"},{"num":40,"verse":"Michael, Baaseiah, Malkijah,"},{"num":41,"verse":"Ethni, Zerah, Adaiah,"},{"num":42,"verse":"Ethan, Zimmah, Shimei,"},{"num":43,"verse":"Jahath, Gershon, and Levi."},{"num":44,"verse":"Heman’s second assistant was Ethan from the clan of Merari. Ethan’s genealogy was traced back through Kishi, Abdi, Malluch,"},{"num":45,"verse":"Hashabiah, Amaziah, Hilkiah,"},{"num":46,"verse":"Amzi, Bani, Shemer,"},{"num":47,"verse":"Mahli, Mushi, Merari, and Levi."},{"num":48,"verse":"Their fellow Levites were appointed to various other tasks in the Tabernacle, the house of God."},{"header":"Aaron’s Descendants"},{"num":49,"verse":"Only Aaron and his descendants served as priests. They presented the offerings on the altar of burnt offering and the altar of incense, and they performed all the other duties related to the Most Holy Place. They made atonement for Israel by doing everything that Moses, the servant of God, had commanded them."},{"num":50,"verse":"The descendants of Aaron were Eleazar, Phinehas, Abishua,"},{"num":51,"verse":"Bukki, Uzzi, Zerahiah,"},{"num":52,"verse":"Meraioth, Amariah, Ahitub,"},{"num":53,"verse":"Zadok, and Ahimaaz."},{"header":"Territory for the Levites"},{"num":54,"verse":"This is a record of the towns and territory assigned by means of sacred lots to the descendants of Aaron, who were from the clan of Kohath."},{"num":55,"verse":"This territory included Hebron and its surrounding pasturelands in Judah,"},{"num":56,"verse":"but the fields and outlying areas belonging to the city were given to Caleb son of Jephunneh."},{"num":57,"verse":"So the descendants of Aaron were given the following towns, each with its pasturelands: Hebron (a city of refuge), Libnah, Jattir, Eshtemoa,"},{"num":58,"verse":"Holon, Debir,"},{"num":59,"verse":"Ain, Juttah, and Beth-shemesh."},{"num":60,"verse":"And from the territory of Benjamin they were given Gibeon, Geba, Alemeth, and Anathoth, each with its pasturelands. So thirteen towns were given to the descendants of Aaron."},{"num":61,"verse":"The remaining descendants of Kohath received ten towns from the territory of the half-tribe of Manasseh by means of sacred lots."},{"num":62,"verse":"The descendants of Gershon received by sacred lots thirteen towns from the territories of Issachar, Asher, Naphtali, and from the Bashan area of Manasseh, east of the Jordan."},{"num":63,"verse":"The descendants of Merari received by sacred lots twelve towns from the territories of Reuben, Gad, and Zebulun."},{"num":64,"verse":"So the people of Israel assigned all these towns and pasturelands to the Levites."},{"num":65,"verse":"The towns in the territories of Judah, Simeon, and Benjamin, mentioned above, were assigned to them by means of sacred lots."},{"num":66,"verse":"The descendants of Kohath were given the following towns from the territory of Ephraim, each with its pasturelands:"},{"num":67,"verse":"Shechem (a city of refuge in the hill country of Ephraim), Gezer,"},{"num":68,"verse":"Jokmeam, Beth-horon,"},{"num":69,"verse":"Aijalon, and Gath-rimmon."},{"num":70,"verse":"The remaining descendants of Kohath were assigned the towns of Aner and Bileam from the territory of the half-tribe of Manasseh, each with its pasturelands."},{"num":71,"verse":"The descendants of Gershon received the towns of Golan (in Bashan) and Ashtaroth from the territory of the half-tribe of Manasseh, each with its pasturelands."},{"num":72,"verse":"From the territory of Issachar, they were given Kedesh, Daberath,"},{"num":73,"verse":"Ramoth, and Anem, each with its pasturelands."},{"num":74,"verse":"From the territory of Asher, they received Mashal, Abdon,"},{"num":75,"verse":"Hukok, and Rehob, each with its pasturelands."},{"num":76,"verse":"From the territory of Naphtali, they were given Kedesh in Galilee, Hammon, and Kiriathaim, each with its pasturelands."},{"num":77,"verse":"The remaining descendants of Merari received the towns of Jokneam, Kartah, Rimmon, and Tabor from the territory of Zebulun, each with its pasturelands."},{"num":78,"verse":"From the territory of Reuben, east of the Jordan River opposite Jericho, they received Bezer (a desert town), Jahaz,"},{"num":79,"verse":"Kedemoth, and Mephaath, each with its pasturelands."},{"num":80,"verse":"And from the territory of Gad, they received Ramoth in Gilead, Mahanaim,"},{"num":81,"verse":"Heshbon, and Jazer, each with its pasturelands."}]