[{"num":6,"verse":"The Bnei Levi: Gershon, Kehat, and Merari."},{"num":28,"verse":"And the Bnei Kehat: Amram, Yitzhar, and Chevron, and Uzziel."},{"num":29,"verse":"And the Bnei Amram: Aharon, and Moshe, and Miryam. The bnei Aharon; Nadav, and Avihu, Eleazar, and Itamar."},{"num":30,"verse":"Eleazar fathered Pinchas, Pinchas fathered Avishua,"},{"num":31,"verse":"And Avishua fathered Bukki, and Bukki fathered Uzzi,"},{"num":32,"verse":"And Uzzi fathered Zerachyah, and Zerachyah fathered Merayot,"},{"num":33,"verse":"Merayot fathered Amaryah, and Amaryah fathered Achituv,"},{"num":34,"verse":"And Achituv fathered Tzadok, and Tzadok fathered Achima’atz,"},{"num":35,"verse":"And Achima’atz fathered Azaryah, and Azaryah fathered Yochanan,"},{"num":36,"verse":"And Yochanan fathered Azaryah (he it is that executed the kohen’s office in the Beis [Hamikdash] that Sh’lomo built in Yerushalayim),"},{"num":37,"verse":"And Azaryah fathered Amaryah, and Amaryah fathered Achituv,"},{"num":38,"verse":"And Achituv fathered Tzadok, and Tzadok fathered Shallum,"},{"num":39,"verse":"And Shallum fathered Chilkiyah, and Chilkiyah fathered Azaryah,"},{"num":40,"verse":"And Azaryah fathered Serayah, and Serayah fathered Yehotzadak,"},{"num":41,"verse":"And Yehotzadak went into the Golus, when Hashem carried away Yehudah and Yerushalayim by the yad of Nevuchadnetzar."},{"num":6,"verse":"The Bnei Levi: Gershom, Kehat, and Merari."},{"num":6,"verse":"And these are the shmot of the Bnei Gershom: Livni and Shimei."},{"num":6,"verse":"And the Bnei Kehat were Amram, and Yitzhar, and Chevron, and Uzziel."},{"num":6,"verse":"The Bnei Merari: Machli and Mushi. And these are the mishpekhot of the Levi’im according to avoteihem."},{"num":6,"verse":"Of Gershom: Livni bno, Yachat bno, Zimmah bno,"},{"num":6,"verse":"Yoach bno, Iddo bno, Zerach bno, Yeaterai bno."},{"num":6,"verse":"The Bnei Kehat: Amminadav bno, Korach bno, Assir bno,"},{"num":6,"verse":"Elkanah bno, and Evyasaph bno, and Assir bno,"},{"num":6,"verse":"Tachat bno, Uriel bno, Uziyah bno, and Sha’ul bno."},{"num":6,"verse":"And the Bnei Elkanah: Amasai, and Achimot."},{"num":6,"verse":"As for Elkanah, the Bnei Elkanah: Tzophai bno, and Nachat bno,"},{"num":6,"verse":"Eliav bno, Yerocham bno, Elkanah bno."},{"num":6,"verse":"And the Bnei Shmuel: the bechor [Yoel], and the second, Aviyah."},{"num":6,"verse":"The Bnei Merari: Machli, Livni bno, Shimei bno, Uzzah bno,"},{"num":6,"verse":"Shimea bno, Chagiyah bno, Asayah bno."},{"num":6,"verse":"And these are they whom Dovid set over the service of shir (song) in the Beis Hashem, after the Menoach HaAron (the coming to rest of the Ark)."},{"num":6,"verse":"And they were the mesharetim (ministers) before the Mishkan Ohel Mo’ed with singing, until Sh’lomo had built the Beis Hashem in Yerushalayim, and then they performed their avodas [kodesh service] according to their mishpatim (regulations)."},{"num":6,"verse":"And these are they that stood [ministering] with their banim. Of the Bnei Kehati; Heman the meshorer (singer) Ben Yoel Ben Shemuel,"},{"num":6,"verse":"Ben Elkanah Ben Yerocham Ben Eliel Ben Toach,"},{"num":6,"verse":"Ben Tzuph Ben Elkanah Ben Machat Ben Amasai,"},{"num":6,"verse":"Ben Elkanah Ben Yoel Ben Azaryah Ben Tzephanyah,"},{"num":6,"verse":"Ben Tachat Ben Assir Ben Evyasaph Ben Korach,"},{"num":6,"verse":"Ben Yitzhar Ben Kehat Ben Levi Ben Yisroel."},{"num":6,"verse":"And achiv Asaph, who stood at his right hand, even Asaph Ben Berechyah Ben Shimea,"},{"num":6,"verse":"Ben Micha’el Ben Ba’aseyah Ben Malkiyah,"},{"num":6,"verse":"Ben Etni Ben Zerach Ben Adayah,"},{"num":6,"verse":"Ben Eitan Ben Zimmah Ben Shimei,"},{"num":6,"verse":"Ben Yachat Ben Gershom Ben Levi."},{"num":6,"verse":"And their achim the Bnei Merari stood on the left hand; Eitan Ben Kishi Ben Avdi Ben Maluch,"},{"num":6,"verse":"Ben Chashavyah Ben Amatzyah Ben Chilkiyah,"},{"num":6,"verse":"Ben Amtzi Ben Bani Ben Shemer,"},{"num":6,"verse":"Ben Machli Ben Mushi Ben Merari Ben Levi."},{"num":6,"verse":"Their achim also the Levi’im were appointed unto all the avodas Mishkan Beis HaElohim."},{"num":6,"verse":"But Aharon and his banim presented the offerings upon the Mizbe’ach HaOlah and on the Mizbe’ach HaKetoret, and were appointed for all the work of the Kodesh HaKodashim, and to make kapporah for Yisroel, according to all that Moshe eved HaElohim had commanded."},{"num":6,"verse":"And these are the Bnei Aharon; Eleazar bno, Pinchas bno, Avishua bno,"},{"num":6,"verse":"Bukki bno, Uzzi bno, Zerachyah bno,"},{"num":6,"verse":"Merayot bno, Amaryah bno, Achituv bno,"},{"num":6,"verse":"Tzadok bno, Achima’atz bno."},{"num":6,"verse":"Now these are their moshevot throughout their assigned territories, of the Bnei Aharon, of the mishpekhot of the Kehati, for the goral (lot) fell upon them."},{"num":6,"verse":"And they gave them Chevron in Eretz Yehudah, and the migrashim thereof all around it."},{"num":6,"verse":"The sadeh of the Ir, and the villages thereof, they gave to Kalev Ben Yephunneh."},{"num":6,"verse":"And to the Bnei Aharon they gave the cities of refuge, namely, Chevron, and Livnah with her migrashim, and Yatir, and Eshtemoa, with her migrashim,"},{"num":6,"verse":"Chilez with her migrashim, Devir with hers,"},{"num":6,"verse":"And Ashan with her migrashim, and Beit Shemesh with her migrashim;"},{"num":6,"verse":"And out of the tribe of Binyamin; Geva with her migrashim, and Alemet with her migrashim, and Anatot with her migrashim. All their towns throughout their mishpekhot were 13 towns."},{"num":6,"verse":"And unto the Bnei Kehat, which were left of the mishpakhat of that tribe, were towns given out of the half tribe, namely, out of the half tribe of Menasheh, by goral, ten towns."},{"num":6,"verse":"And to the Bnei Gershom throughout their mishpekhot out of the tribe of Yissakhar, out of that of Asher, out of that of Naphtali, out of the tribe of Menasheh in Bashan, 13 towns."},{"num":6,"verse":"Unto the Bnei Merari were given by goral, throughout their mishpekhot, out of the tribe of Reuven, and out of that of Gad, and out of that of Zevulun, 12 towns."},{"num":6,"verse":"And the Bnei Yisroel gave to the Levi’im these towns with their migrashim."},{"num":6,"verse":"And they gave by goral out of the tribe of the Bnei Yehudah, and out of the tribe of the Bnei Shim’on, and out of the tribe of the Bnei Binyamin, these towns, which are called by their shmot."},{"num":6,"verse":"For some of the mishpekhot of the Bnei Kehat had towns of their territories out of the tribe of Ephrayim."},{"num":6,"verse":"They gave unto them, of the cities of refuge, Shechem in Har Ephrayim with her migrashim; they gave Gezer with her migrashim,"},{"num":6,"verse":"And Yokmeam with her migrashim, and Beit Choron with her migrashim,"},{"num":6,"verse":"And Ayalon with her migrashim, and Gat Rimmon with her migrashim;"},{"num":6,"verse":"And out of the half tribe of Menasheh; Aner with her migrashim, and Bileam with her migrashim, for the mishpakhat of the rest of the Bnei Kehat."},{"num":6,"verse":"Unto the Bnei Gershom were given out of the mishpakhat of the half tribe of Menasheh Golan in Bashan with her migrashim, and Ashtarot with her migrashim;"},{"num":6,"verse":"And out of the tribe of Yissakhar; Kedesh with her migrashim, Davrat with her migrashim,"},{"num":6,"verse":"And Ramot with her migrashim, and Anem with her migrashim;"},{"num":6,"verse":"And out of the tribe of Asher; Mashal with her migrashim, and Avdon with her migrashim,"},{"num":6,"verse":"And Chukok with her migrashim, and Rechov with her migrashim;"},{"num":6,"verse":"And out of the tribe of Naphtali; Kedesh in Galil (Galilee) with her migrashim, and Chammon with her migrashim, and Kiryatayim with her migrashim."},{"num":6,"verse":"Unto the rest of the Bnei Merari were given out of the tribe of Zevulun, Rimmono with her migrashim, Tavor with her migrashim."},{"num":6,"verse":"And on the other side of the Yarden by Yericho, on the east side of Yarden, were given them out of the tribe of Reuven, Betzer in the midbar with her migrashim, and Yachtzah with her migrashim,"},{"num":6,"verse":"Kedemot also with her migrashim, and Mepha’at with her migrashim;"},{"num":6,"verse":"And out of the tribe of Gad: Ramot in Gil’ad with her migrashim, and Machanayim with her migrashim,"},{"num":6,"verse":"And Cheshbon with her migrashim, and Ya’zer with her migrashim."}]