[[],[{"type":"prose","content":"Sons of Levi: Gershon, Kohath, and Merari."}],[{"type":"prose","content":"And the sons of Kohath; Amram, Izhar, and Hebron, and Uzziel."}],[{"type":"prose","content":"And sons of Amram: Aaron, and Moses, and Miriam. And sons of Aaron: Nadab, and Abihu, Eleazar, and Ithamar."}],[{"type":"prose","content":"Eleazar begat Phinehas, Phinehas begat Abishua,"}],[{"type":"prose","content":"and Abishua begat Bukki, and Bukki begat Uzzi,"}],[{"type":"prose","content":"and Uzzi begat Zerahiah, and Zerahiah begat Meraioth,"}],[{"type":"prose","content":"Meraioth begat Amariah, and Amariah begat Ahitub,"}],[{"type":"prose","content":"and Ahitub begat Zadok, and Zadok begat Ahimaaz,"}],[{"type":"prose","content":"and Ahimaaz begat Azariah, and Azariah begat Johanan,"}],[{"type":"prose","content":"and Johanan begat Azariah, him who acted as priest in the house that Solomon built in Jerusalem."}],[{"type":"prose","content":"And Azariah begetteth Amariah, and Amariah begat Ahitub,"}],[{"type":"prose","content":"and Ahitub begat Zadok, and Zadok begat Shallum,"}],[{"type":"prose","content":"and Shallum begat Hilkiah, and Hilkiah begat Azariah,"}],[{"type":"prose","content":"and Azariah begat Seraiah, and Seraiah begat Jehozadak;"}],[{"type":"prose","content":"and Jehozadak hath gone in Jehovah's removing Judah and Jerusalem by the hand of Nebuchadnezzar."}],[{"type":"prose","content":"Sons of Levi: Gershom, Kohath, and Merari."}],[{"type":"prose","content":"And these [are] names of sons of Gershom: Libni and Shimei."}],[{"type":"prose","content":"And sons of Kohath: Amram, and Izhar, and Hebron, and Uzziel."}],[{"type":"prose","content":"Sons of Merari; Mahli and Mushi. And these [are] families of the Levite according to their fathers;"}],[{"type":"prose","content":"of Gershom: Libni his son, Jahath his son, Zimmah his son,"}],[{"type":"prose","content":"Joah his son, Iddo his son, Zerah his son, Jeaterai his son."}],[{"type":"prose","content":"Sons of Kohath: Amminadab his son, Korah his son, Assir his son,"}],[{"type":"prose","content":"Elkanah his son, and Ebiasaph his son, and Assir his son,"}],[{"type":"prose","content":"Tahath his son, Uriel his son, Uzziah his son, and Shaul his son."}],[{"type":"prose","content":"And sons of Elkanah; Amasai and Ahimoth."}],[{"type":"prose","content":"Elkanah; sons of Elkanah: Zophai his son, and Nahath his son,"}],[{"type":"prose","content":"Eliab his son, Jeroham his son, Elkanah his son."}],[{"type":"prose","content":"And sons of Samuel: the first-born Vashni, and the second Abijah."}],[{"type":"prose","content":"Sons of Merari: Mahli, Libni his son, Shimei his son, Uzzah his son,"}],[{"type":"prose","content":"Shimea his son, Haggiah his son, Asaiah his son."}],[{"type":"prose","content":"And these [are] they whom David stationed over the parts of the song of the house of Jehovah, from the resting of the ark,"}],[{"type":"prose","content":"and they are ministering before the tabernacle of the tent of meeting, in song, till the building by Solomon of the house of Jehovah in Jerusalem; and they stand according to their ordinance over their service."}],[{"type":"prose","content":"And these [are] those standing, and their sons: of the sons of the Kohathite: Heman the singer, son of Joel, son of Shemuel,"}],[{"type":"prose","content":"son of Elkanah, son of Jeroham, son of Eliel, son of Toah,"}],[{"type":"prose","content":"son of Zuph, son of Elkanah, son of Mahath, son of Amasai,"}],[{"type":"prose","content":"son of Elkanah, son of Joel, son of Azariah, son of Zephaniah,"}],[{"type":"prose","content":"son of Tahath, son of Assir, son of Ebiasaph, son of Korah,"}],[{"type":"prose","content":"son of Izhar, son of Kohath, son of Levi, son of Israel."}],[{"type":"prose","content":"And his brother Asaph, who is standing on his right -- Asaph, son of Berachiah, son of Shimea,"}],[{"type":"prose","content":"son of Michael, son of Baaseiah, son of Malchiah,"}],[{"type":"prose","content":"son of Ethni, son of Zerah, son of Adaiah,"}],[{"type":"prose","content":"son of Ethan, son of Zimmah, son of Shimei,"}],[{"type":"prose","content":"son of Jahath, son of Gershom, son of Levi."}],[{"type":"prose","content":"And sons of Merari, their brethren, [are] on the left. Ethan son of Kishi, son of Abdi, son of Malluch,"}],[{"type":"prose","content":"son of Hashabiah, son of Amaziah, son of Hilkiah,"}],[{"type":"prose","content":"son of Amzi, son of Bani, son of Shamer,"}],[{"type":"prose","content":"son of Mahli, son of Mushi, son of Merari, son of Levi."}],[{"type":"prose","content":"And their brethren the Levites are put to all the service of the tabernacle of the house of God."}],[{"type":"prose","content":"And Aaron and his sons are making perfume on the altar of the burnt-offering, and on the altar of the perfume, for all the work of the holy of holies, and to make atonement for Israel, according to all that Moses servant of God commanded."}],[{"type":"prose","content":"And these [are] sons of Aaron: Eleazar his son, Phinehas his son, Abishua his son,"}],[{"type":"prose","content":"Bukki his son, Uzzi his son, Zerahiah his son,"}],[{"type":"prose","content":"Meraioth his son, Amariah his son, Ahitub his son,"}],[{"type":"prose","content":"Zadok his son, Ahimaaz his son."}],[{"type":"prose","content":"And these [are] their dwellings, throughout their towers, in their borders, of the sons of Aaron, of the family of the Kohathite, for theirs was the lot;"}],[{"type":"prose","content":"and they give to them Hebron in the land of Judah and its suburbs round about it;"}],[{"type":"prose","content":"and the field of the city and its villages they gave to Caleb son of Jephunneh."}],[{"type":"prose","content":"And to the sons of Aaron they gave the cities of refuge: Hebron, and Libnah and its suburbs, and Jattir, and Eshtemoa and its suburbs,"}],[{"type":"prose","content":"and Hilen and its suburbs, Debir and its suburbs,"}],[{"type":"prose","content":"and Ashan and its suburbs, and Beth-Shemesh and its suburbs."}],[{"type":"prose","content":"And from the tribe of Benjamin, Geba and its suburbs, and Allemeth and its suburbs, and Anathoth and its suburbs. All their cities [are] thirteen cities, for their families."}],[{"type":"prose","content":"And to the sons of Kohath, those left of the family of the tribe, from the half of the tribe, the half of Manasseh, by lot, [are] ten cities."}],[{"type":"prose","content":"And to the sons of Gershom, for their families, from the tribe of Issachar, and from the tribe of Asher, and from the tribe of Naphtali, and from the tribe of Manasseh in Bashan, thirteen cities."}],[{"type":"prose","content":"To the sons of Merari, for their families, from the tribe of Reuben, and from the tribe of Gad, and from the tribe of Zebulun, by lot, twelve cities."}],[{"type":"prose","content":"And the sons of Israel give to the Levites the cities and their suburbs."}],[{"type":"prose","content":"And they give by lot from the tribe of the sons of Judah, and from the tribe of the sons of Simeon, and from the tribe of the sons of Benjamin, these cities which they call by name;"}],[{"type":"prose","content":"and some of the families of the sons of Kohath have cities of their border from the tribe of Ephraim;"}],[{"type":"prose","content":"and they give to them the cities of refuge, Shechem and its suburbs in the hill-country of Ephraim, and Gezer and its suburbs,"}],[{"type":"prose","content":"and Jokmeam and its suburbs, and Beth-Horan and its suburbs,"}],[{"type":"prose","content":"and Aijalon and its suburbs, and Gath-Rimmon and its suburbs;"}],[{"type":"prose","content":"and from the half tribe of Manasseh, Aner and its suburbs, and Bileam and its suburbs, for the family of the sons of Kohath who are left."}],[{"type":"prose","content":"To the sons of Gershom from the family of the half of the tribe of Manasseh [are] Golan in Bashan and its suburbs, and Ashtaroth and its suburbs;"}],[{"type":"prose","content":"and from the tribe of Issachar; Kedesh and its suburbs, Daberath and its suburbs,"}],[{"type":"prose","content":"and Ramoth and its suburbs, and Anem and its suburbs;"}],[{"type":"prose","content":"and from the tribe of Asher; Mashal and its suburbs, and Abdon and its suburbs,"}],[{"type":"prose","content":"and Hukok and its suburbs, and Rehob and its suburbs;"}],[{"type":"prose","content":"and from the tribe of Naphtali: Kedesh in Galilee and its suburbs, and Hammon and its suburbs, and Kirjathaim and its suburbs."}],[{"type":"prose","content":"To the sons of Merari who are left, from the tribe of Zebulun, [are] Rimmon and its suburbs, Tabor and its suburbs;"}],[{"type":"prose","content":"and from beyond the Jordan by Jericho, at the east of the Jordan, from the tribe of Reuben, Bezer in the wilderness and its suburbs, and Jahzah and its suburbs,"}],[{"type":"prose","content":"and Kedemoth and its suburbs, and Mephaath and its suburbs;"}],[{"type":"prose","content":"and from the tribe of Gad: Ramoth in Gilead and its suburbs, and Mahanaim and its suburbs,"}],[{"type":"prose","content":"and Heshbon and its suburbs, and Jazer and its suburbs."}]]