[{"header":"Daniel has a Vision of Four Animals Coming up from the Sea"},{"num":7,"verse":"In the first year of King Belshazzar of Babylon, Daniel had a dream filled with visions while he was lying on his bed. Then he wrote down the dream in summary fashion. "},{"num":2,"verse":"Daniel explained: “I was watching in my vision during the night as the four winds of the sky were stirring up the great sea. "},{"num":3,"verse":"Then four large beasts came up from the sea; they were different from one another."},{"num":4,"verse":"“The first one was like a lion with eagles’ wings. As I watched, its wings were pulled off and it was lifted up from the ground. It was made to stand on two feet like a human being, and a human mind was given to it."},{"num":5,"verse":"“Then a second beast appeared, like a bear. It was raised up on one side, and there were three ribs in its mouth between its teeth. It was told, ‘Get up and devour much flesh!’"},{"num":6,"verse":"“After these things, as I was watching, another beast like a leopard appeared, with four bird-like wings on its back. This beast had four heads, and ruling authority was given to it."},{"num":7,"verse":"“After these things, as I was watching in the night visions a fourth beast appeared—one dreadful, terrible, and very strong. It had two large rows of iron teeth. It devoured and crushed, and anything that was left it trampled with its feet. It was different from all the beasts that came before it, and it had ten horns."},{"num":8,"verse":"“As I was contemplating the horns, another horn—a small one—came up between them, and three of the former horns were torn out by the roots to make room for it. This horn had eyes resembling human eyes and a mouth speaking arrogant things."},{"num":9,"verse":"“While I was watching,"},{"num":11,"verse":"“Then I kept on watching because of the arrogant words of the horn that was speaking. I was watching until the beast was killed and its body destroyed and thrown into the flaming fire. "},{"num":12,"verse":"As for the rest of the beasts, their ruling authority had already been removed, though they were permitted to go on living for a time and a season."},{"header":"An Angel Interprets Daniel’s Vision"},{"num":15,"verse":"“As for me, Daniel, my spirit was distressed, and the visions of my mind were alarming me. "},{"num":16,"verse":"I approached one of those standing nearby and asked him about the meaning of all this. So he spoke with me and revealed to me the interpretation of the vision: "},{"num":17,"verse":"‘These large beasts, which are four in number, represent four kings who will arise from the earth. "},{"num":18,"verse":"The holy ones of the Most High will receive the kingdom and will take possession of the kingdom forever and ever.’"},{"num":19,"verse":"“Then I wanted to know the meaning of the fourth beast, which was different from all the others. It was very dreadful, with two rows of iron teeth and bronze claws, and it devoured, crushed, and trampled anything that was left with its feet. "},{"num":20,"verse":"I also wanted to know the meaning of the ten horns on its head, and of that other horn that came up and before which three others fell. This was the horn that had eyes and a mouth speaking arrogant things, whose appearance was more formidable than the others. "},{"num":21,"verse":"While I was watching, that horn began to wage war against the holy ones and was defeating them, "},{"num":22,"verse":"until the Ancient of Days arrived and judgment was rendered in favor of the holy ones of the Most High. Then the time came for the holy ones to take possession of the kingdom."},{"num":23,"verse":"“This is what he told me:"},{"num":28,"verse":"“This is the conclusion of the matter. As for me, Daniel, my thoughts troubled me greatly, and the color drained from my face. But I kept the matter to myself.”"}]