[{"header":"Abijah’s illness"},{"num":14,"verse":"At that time, Jeroboam’s son Abijah became sick."},{"num":2,"verse":"Jeroboam said to his wife, “Please go with a disguise so no one will recognize you as Jeroboam’s wife. Go to Shiloh where the prophet Ahijah is. He told me I would be king of this people."},{"num":3,"verse":"Take ten loaves of bread, cakes, and a bottle of honey with you. Go to him. He will tell you what will happen to the boy.”"},{"num":4,"verse":"Jeroboam’s wife did precisely this. She left and went to Shiloh and came to Ahijah’s house. Now Ahijah had become blind in his old age."},{"num":5,"verse":"The Lord said to Ahijah, “Look! Jeroboam’s wife has come seeking a word from you about her son. He is sick. Say this and that to her. When she comes, she will be disguised.”"},{"num":6,"verse":"When Ahijah heard the sound of her feet coming through the doorway, he said, “Come in, Jeroboam’s wife! Why have you disguised yourself? I have hard news for you."},{"num":7,"verse":"Tell Jeroboam: This is what the Lord, Israel’s God, says: When I lifted you up from among the people, I appointed you as a leader over my people Israel."},{"num":8,"verse":"I tore the kingdom from David’s house and gave it to you. But you haven’t been like my servant David, who kept my commands and followed me with all his heart by doing only what is right in my eyes."},{"num":9,"verse":"Instead, you have done more evil than any who were before you. You have made other gods and metal images to anger me. You have turned your back on me."},{"num":10,"verse":"Therefore, I’m going to bring disaster on Jeroboam’s house! Because of Jeroboam, I will eliminate everyone who urinates on a wall, whether slave or free. Then I will set fire to the house of Jeroboam, as one burns dung until it is gone."},{"num":11,"verse":"Dogs will eat any of Jeroboam’s family who die in town. Birds will eat those who die in the field. The Lord has spoken!"},{"num":12,"verse":"“As for you, get up and go back home. When your feet enter the town, the boy will die."},{"num":13,"verse":"All Israel will mourn for him and will bury him. Out of the whole line of Jeroboam, he alone will have a tomb, because only in him did Israel’s God, the Lord, find something good."},{"num":14,"verse":"For this reason the Lord will raise up a king over Israel who will eliminate the house of Jeroboam. This begins today. What’s that? Even now!"},{"num":15,"verse":"The Lord will strike Israel so that it shakes like a reed in water. He will uproot Israel from this fertile land that he gave to their ancestors and their offspring, and he will scatter them across the Euphrates River, because they made the Lord angry by making their sacred poles."},{"num":16,"verse":"Because of the sins Jeroboam committed, and because he made Israel sin too, God will give Israel up.”"},{"num":17,"verse":"Then Jeroboam’s wife left and went to Tirzah. When she stepped across the threshold of the house, the boy died."},{"num":18,"verse":"All Israel buried him and mourned him in agreement with the Lord’s word spoken through his servant the prophet Ahijah."},{"num":19,"verse":"The rest of Jeroboam’s deeds—how he fought and how he ruled—are written in the official records of Israel’s kings."},{"num":20,"verse":"Jeroboam ruled twenty-two years and he lay down with his ancestors. His son Nadab succeeded him as king."},{"header":"Rehoboam rules Judah"},{"num":21,"verse":"Rehoboam, Solomon’s son, ruled over Judah. Rehoboam was 41 years old when he became king. He ruled for seventeen years in Jerusalem, the city the Lord chose from among all the tribes of Israel to set his name. Rehoboam’s mother’s name was Naamah from Ammon."},{"num":22,"verse":"Judah did evil in the Lord’s eyes. The sins they committed made the Lord angrier than anything their ancestors had done."},{"num":23,"verse":"They also built shrines, standing stones, and sacred poles on top of every high hill and under every green tree."},{"num":24,"verse":"Moreover, the consecrated workers in the land did detestable things, just like those nations that the Lord had removed among the Israelites."},{"num":25,"verse":"During King Rehoboam’s fifth year, King Shishak of Egypt attacked Jerusalem."},{"num":26,"verse":"He seized the treasures of the Lord’s temple and the royal palace. He took everything, even all the gold shields that Solomon had made."},{"num":27,"verse":"King Rehoboam replaced them with bronze shields and assigned them to the officers of the guard who protected the entrance to the royal palace."},{"num":28,"verse":"Whenever the king entered the Lord’s temple, the guards would carry the shields and then return them to the guardroom."},{"num":29,"verse":"The rest of Rehoboam’s deeds and all that he accomplished, aren’t they written in the official records of Judah’s kings?"},{"num":30,"verse":"There was continual warfare between Rehoboam and Jeroboam."},{"num":31,"verse":"When Rehoboam died, he was buried with his ancestors in David’s City. His mother’s name was Naamah from Ammon. His son Abijam succeeded him as king."}]