[{"num":27,"verse":"Job’s final defense:"},{"num":2,"verse":"“I vow by the living God, who has taken away my rights, even the Almighty God who has embittered my soul, "},{"num":3,"verse":"that as long as I live, while I have breath from God, "},{"num":4,"verse":"my lips shall speak no evil, my tongue shall speak no lies. "},{"num":5,"verse":"I will never, never agree that you are right; until I die I will vow my innocence. "},{"num":6,"verse":"I am not a sinner—I repeat it again and again. My conscience is clear for as long as I live. "},{"num":7,"verse":"Those who declare otherwise are my wicked enemies. They are evil men."},{"num":8,"verse":"“But what hope has the godless when God cuts him off and takes away his life? "},{"num":9,"verse":"Will God listen to his cry when trouble comes upon him? "},{"num":10,"verse":"For he does not delight himself in the Almighty or pay any attention to God except in times of crisis."},{"num":11,"verse":"“I will teach you about God—"},{"num":12,"verse":"but really, I don’t need to, for you yourselves know as much about him as I do; yet you are saying all these useless things to me."},{"num":13,"verse":"“This is the fate awaiting the wicked from the hand of the Almighty: "},{"num":14,"verse":"If he has a multitude of children, it is so that they will die in war or starve to death. "},{"num":15,"verse":"Those who survive shall be brought down to the grave by disease and plague, with no one to mourn them, not even their wives."},{"num":16,"verse":"“The evil man may accumulate money like dust, with closets jammed full of clothing—"},{"num":17,"verse":"yes, he may order them made by his tailor, but the innocent shall wear that clothing and shall divide his silver among them. "},{"num":18,"verse":"Every house built by the wicked is as fragile as a spider web, as full of cracks as a leafy booth!"},{"num":19,"verse":"“He goes to bed rich but wakes up to find that all his wealth is gone. "},{"num":20,"verse":"Terror overwhelms him, and he is blown away in the storms of the night. "},{"num":21,"verse":"The east wind carries him away, and he is gone. It sweeps him into eternity. "},{"num":22,"verse":"For God shall hurl at him unsparingly. He longs to flee from God. "},{"num":23,"verse":"Everyone will cheer at his death and boo him into eternity."}]