[{"num":64,"verse":"I would that thou brakest heavens, and camest down, that hills floated away from thy face, (O that thou wouldest break open the heavens, and come down, and that the hills would flow down before thee,)"},{"num":2,"verse":"and failed, [(or) vanish(ed) away,] as the burning of fire, and (as) [waters] burnt in (the) fire; that thy name were made known to thine enemies, and folks were troubled of thy face. (and tremble, and perish, like something burned in the fire, or like water boiled by the fire; so that thy name was made known to thy enemies, and the nations were troubled before thee.)"},{"num":3,"verse":"When thou shalt do marvels, we shall not abide. Thou camest down, and hills floated away from thy face. (There was a time when thou camest down, and did terrible things, which we did not expect; and the hills flowed down before thee.)"},{"num":4,"verse":"From the world they heard not, neither perceived with ears; God, none eye saw, without thee, what things thou hast made ready to them that abide thee. (From the beginning of the world, none have heard of, nor have perceived with their ears; and not one eye hath seen anyone besides thee, O God, who hath made such things as thou hast, for those who wait for thee.)"},{"num":5,"verse":"Thou mettest him that is glad, and doeth rightfulness; in thy ways they shall bethink on thee. Lo! thou art wroth, and we sinned; in those sins we were ever, and we shall be saved. (Thou meetest him who is happy to do what is right; yea, all those who remember thee in thy ways. But lo! thou wast angry, for we sinned; and we were ever in those sins.)"},{"num":6,"verse":"And all we be made as an unclean man; all our rightfulnesses be as the cloth of a woman in menstruation, or unclean blood; and all we fell down as a leaf, and our wickednesses, as (the) wind, have taken away us. (And we all be made like an unclean man; all our righteousnesses be like the cloth of a woman in menstruation, or in unclean blood; and we all fell down like a leaf, and our wickednesses have taken us away, like the wind.)"},{"num":7,"verse":"None is, that calleth thy name to help, that riseth, and holdeth thee; thou hast hid thy face from us, and thou hast hurtled down us in(to) the hand of our wickedness. (There is no one who calleth on thy name for help, or who riseth up, and taketh hold of thee; and so thou hast hid thy face from us, and thou hast hurtled us down into the hand, or the power, of our own wickedness.)"},{"num":8,"verse":"And now, Lord, thou art our father; forsooth we be clay, and thou art our maker, and all we be the works of thine hands. (But now, Lord, thou art our father; and we be but clay, and thou art our Maker, and we all be the works of thy hands.)"},{"num":9,"verse":"Lord, be thou not wroth (any more than) enough, and have thou no more mind on our wickedness. Lo! Lord, behold thou, all we be thy people. (Lord, be thou not angry any more than enough, and no more remember thou our wickedness. Lo! Lord, behold thou, we all be thy people.)"},{"num":10,"verse":"The city of thy holy, either saintuary, is forsaken, Zion is made desert, Jerusalem is made desolate; (Thy holy cities be deserted, Zion is made a wilderness, Jerusalem is made desolate;)"},{"num":11,"verse":"the house of our hallowing and of our glory, where our fathers praised thee, is made into (a) burning of fire; and all our desirable things be turned into fallings. (our glorious holy Temple, where our forefathers praised thee, hath been burned into ashes; and all the things that we desired, or cherished, be turned into ruins.)"},{"num":12,"verse":"Lord, whether on these things thou shalt withhold thee? shalt thou be still, and shalt thou torment us greatly? (Lord, shalt thou still withhold thyself after all these things that have happened? shalt thou still be silent, and shalt thou still greatly torment us?)"}]