[{"num":9,"verse":"Now in the twelfth month, the month of Adar, on the thirteenth day of Adar when the king’s command and his edict were about to be executed, on the [very] day that the enemies of the Jews had planned for a massacre of them, it was turned to the contrary and the Jews had rule over those who hated them."},{"num":2,"verse":"The Jews gathered together in their cities throughout all the provinces of King Ahasuerus to lay hands on such as sought their hurt; and no man could withstand them, for the fear of them had fallen upon all the peoples."},{"num":3,"verse":"And all the princes of the provinces and the chief rulers and the governors and they who attended to the king’s business helped the Jews, because the fear of Mordecai had fallen upon them."},{"num":4,"verse":"For Mordecai was great in the king’s palace; and his fame went forth throughout all the provinces, for the man Mordecai became more and more powerful."},{"num":5,"verse":"So the Jews smote all their enemies with the sword, slaughtering and destroying them, and did as they chose with those who hated them."},{"num":6,"verse":"In Shushan, the capital itself, the Jews slew and destroyed 500 men."},{"num":7,"verse":"And they killed Parshandatha,"},{"num":8,"verse":"Dalphon, Aspatha, Poratha, Adalia,"},{"num":9,"verse":"Aridatha, Parmashta, Arisai, Aridai,"},{"num":10,"verse":"And Vaizatha, the ten sons of Haman son of Hammedatha, the Jews’ enemy; but on the spoil they laid not their hands."},{"num":11,"verse":"On that day the number of those who were slain in Shushan, the capital, was brought before the king."},{"num":12,"verse":"And the king said to Esther the queen, The Jews have slain and destroyed 500 men in Shushan, the capital, and the ten sons of Haman. What then have they done in the rest of the king’s provinces! Now what is your petition? It shall be granted to you. Or what is your request further? It shall be done."},{"num":13,"verse":"Then said Esther, If it pleases the king, let it be granted to the Jews which are in Shushan to do tomorrow also according to this day’s decree, and let [the dead bodies of] Haman’s ten sons be hanged on the gallows."},{"num":14,"verse":"And the king commanded it to be done; the decree was given in Shushan, and they hanged [the bodies of] Haman’s ten sons."},{"num":15,"verse":"And the Jews that were in Shushan gathered together on the fourteenth day also of the month of Adar and slew 300 men in Shushan, but on the spoil they laid not their hands."},{"num":16,"verse":"And the other Jews who were in the king’s provinces gathered to defend their lives and had relief and rest from their enemies and slew of them that hated them 75,000; but on the spoil they laid not their hands."},{"num":17,"verse":"This was done on the thirteenth day of the month of Adar, and on the fourteenth day they rested and made it a day of feasting and gladness."},{"num":18,"verse":"But the Jews who were in Shushan [Susa] assembled on the thirteenth day and on the fourteenth, and on the fifteenth day they rested and made it a day of feasting and gladness."},{"num":19,"verse":"Therefore the Jews of the villages, who dwell in the unwalled towns, make the fourteenth day of the month of Adar a day of gladness and feasting, a holiday, and a day for sending choice portions to one another."},{"num":20,"verse":"And Mordecai recorded these things, and he sent letters to all the Jews who were in all the provinces of the King Ahasuerus, both near and far,"},{"num":21,"verse":"To command them to keep the fourteenth day of the month of Adar and also the fifteenth, yearly,"},{"num":22,"verse":"As the days on which the Jews got rest from their enemies, and as the month which was turned for them from sorrow to gladness and from mourning into a holiday—that they should make them days of feasting and gladness, days of sending choice portions to one another and gifts to the poor."},{"num":23,"verse":"So the Jews undertook to do as they had begun and as Mordecai had written to them—"},{"num":24,"verse":"Because Haman son of Hammedatha, the Agagite, the enemy of all the Jews, had plotted against the Jews to destroy them and had cast Pur, that is, the lot, [to find a lucky day] to crush and consume and destroy them."},{"num":25,"verse":"But when Esther brought the matter before the king, he commanded in writing that Haman’s wicked scheme which he had devised against the Jews should return upon his own head, and that he and his sons should be hanged on the gallows."},{"num":26,"verse":"Therefore they called these days Purim, after the name Pur [lot]. Therefore, because of all that was in this letter and what they had faced in this matter and what had happened to them,"},{"num":27,"verse":"The Jews ordained and took it upon themselves and their descendants and all who joined them that without fail every year they would keep these two days at the appointed time and as it was written,"},{"num":28,"verse":"That these days should be remembered (imprinted on their minds) and kept throughout every generation in every family, province, and city, and that these days of Purim should never cease from among the Jews, nor the commemoration of them cease among their descendants."},{"num":29,"verse":"Then Queen Esther, the daughter of Abihail, with Mordecai the Jew, gave full power [written authority], confirming this second letter about Purim."},{"num":30,"verse":"And letters were sent to all the Jews, to the 127 provinces of the kingdom of Ahasuerus, in words of peace and truth,"},{"num":31,"verse":"To confirm that these days of Purim should be observed at their appointed times, as Mordecai the Jew and Queen Esther had commanded [the Jews], and as they had ordained for themselves and for their descendants in the matter of their fasts and their lamenting."},{"num":32,"verse":"And the command of Esther confirmed these observances of Purim, and it was written in the book."}]