[{"num":3,"verse":"Woe to the city of bloods, all of leasing, full of rending; raven shall not go away from thee. (Woe to the city of bloodshed, or to the murderous city, all of lies, full of tearing apart; all the spoils, or the prey, shall never be taken away from thee.)"},{"num":2,"verse":"Voice of scourge, and voice of rush of wheel, and of horse making noise, and of [a] four-horsed cart burning, (The sound of the scourge, and the sound of the rush of wheels, and of horses making noise, and of charging carts with four horses,)"},{"num":3,"verse":"and of knight going up, and of shining sword, and glistening spear, and of [the] slain multitude, and of grievous falling, neither there is end of carrions. And they shall fall together in their bodies, (and of horsemen going up, or mounting, and of shining swords, and of glistening spears, and of the slain multitude, and of grievous falling, and there is no end of corpses. Yea, they shall altogether fall, or shall stumble, over all the bodies,)"},{"num":4,"verse":"for the multitude of [the] fornications of the whore fair and pleasant, and having witchcrafts; which sold folks in her fornications, and families in her enchantments, either sorceries. (for the multitude of the fornications of Nineveh the whore, who is beautiful and pleasing, and useth witchcrafts; she who duped nations by her fornications, and families by her enchantments, or her sorceries.)"},{"num":5,"verse":"Lo! I to thee, saith the Lord God of hosts; and I shall show thy shameful things in thy face; and I shall show to folks thy nakedness, and to realms thine evil fame, either shame. (Lo! I am against thee, saith the Lord God of hosts; and I shall show thy shameful, or thy private, parts in public; yea, I shall show thy nakedness to the nations, and thy shame to every kingdom.)"},{"num":6,"verse":"And I shall cast out on thee thine abominations, and I shall punish thee with despites, and I shall put thee into ensample. (And I shall cast out upon thee thy abominations, and I shall punish thee with despising, and I shall make thee into an example.)"},{"num":7,"verse":"And it shall be, each man that shall see thee, shall leap away from thee, and shall say, Nineveh is destroyed. Who shall move head on thee? whereof shall I seek to thee a comforter? (And it shall be, that all who shall see thee, shall leap away from thee, and shall say, Nineveh is destroyed. Who shall shake their head in pity over thee? And now where shall I find a comforter for thee?)"},{"num":8,"verse":"Whether thou art better than Alexandria of peoples, that dwelleth in floods? Waters be in compass thereof, whose riches is the sea, waters be [the] walls thereof. (Art thou any better than Thebes, or No, of the peoples of Egypt, which is set by the river? Water is all around it, and its protection cometh from the sea, yea, the waters be its walls.)"},{"num":9,"verse":"Ethiopia is [the] strength thereof, and Egypt, and there is none end; Africa and Libya were in help thereof. (Ethiopia and Egypt were its strength, and there was no end to it’s power; Africa and Libya were its helpers.)"},{"num":10,"verse":"But and it in transmigration, or passing over, is led into captivity; the little children thereof be hurtled down in the head of all ways. And on the noble men thereof they cast lot, and all great men thereof be set together in gyves, either fetters. (But they were carried away into exile, and they were led off into captivity; its little children were hurtled down in the corners of all the streets. And they cast lots on its noble men, and all of its great men were placed in bonds, or in chains.)"},{"num":11,"verse":"And thou therefore shalt be drunken, and shalt be despised, and thou shalt seek help (because) of the enemy."},{"num":12,"verse":"All thy strongholds be as a fig tree, with his figs unripe (All thy fortresses be like fig trees, with their ripe figs); if they shall be shaken, they shall fall into the mouth of the eater."},{"num":13,"verse":"Lo! thy people be women in the middle of thee; the gates of thy land shall be showed to opening to thine enemies; fire shall devour thine hinges. (Lo! thy soldiers in thy midst be like women; the gates of thy land be wide open to thy enemies; and fire shall devour thy hinges.)"},{"num":14,"verse":"Draw up to thee water for asieging, build thy strongholds; enter in[to] fen, and tread, thou undergoing hold a tilestone. (Draw up for thyselves water for the siege, and build up thy fortresses; enter into the clay, and tread it, and form some bricks.)"},{"num":15,"verse":"There fire shall eat thee, thou shalt perish by sword, it shall devour thee, as bruchus doeth; be thou gathered together as a bruchus, be thou multiplied as a locust. (But even so, the fire shall still eat thee, and thou shalt perish by the sword, yea, it shall devour thee, like the bruchus doeth; be thou gathered together like the bruchuses, be thou multiplied like the locusts.)"},{"num":16,"verse":"Thou madest thy merchants more than be stars of heaven; a bruchus is spread abroad, and fly away. (Thou haddest more merchants, or more traders, than there be stars in the heavens; but now all of them be gone, like a bruchus that spreadeth its wings, and flieth away.)"},{"num":17,"verse":"Thy keepers be as locusts, and thy little children be as locusts of locusts, which sit together in hedges in the day of cold; (then) the sun is risen, and they fled away, and the place of them is not known, where they were. (Thy lords be like the locusts, and thy chiefs be like the grasshoppers, which sit together in hedges on a cold day; then when the sun is risen, they flee away/they fly away, and the place where they have gone is not known.)"},{"num":18,"verse":"Thy shepherds nap, thou king (of) Assur, thy princes shall be buried; thy people oft was hid in hills, and there is not that shall gather. (Thy shepherds nap, O king of Assyria, yea, thy princes, or thy leaders, now be buried; thy people be hid in the hills, and there is no one who shall gather them together, and lead them home.)"},{"num":19,"verse":"Thy sorrow is not privy, thy wound is worst; all men that heard thine hearing pressed together hand on thee, for on whom passed not thy malice evermore? (Thy sorrow shall never be assuaged, thy wound is the very worst it could be; all those who heard of thy news, or of thy fate, clapped their hands for joy over thee, for upon whom did not fall thy unceasing malice?)"}]