[{"num":3,"verse":"Wo [to] the city of blood, She is all with lies -- burglary -- full, Prey doth not depart."},{"num":2,"verse":"The sound of a whip, And the sound of the rattling of a wheel, And of a prancing horse, and of a bounding chariot, Of a horseman mounting."},{"num":3,"verse":"And the flame of a sword, and the lightning of a spear, And the abundance of the wounded, And the weight of carcases, Yea, there is no end to the bodies, They stumble over their bodies."},{"num":4,"verse":"Because of the abundance of the fornications of an harlot, The goodness of the grace of the lady of witchcrafts, Who is selling nations by her fornications, And families by her witchcrafts."},{"num":5,"verse":"Lo, I [am] against thee, An affirmation of Jehovah of Hosts, And have removed thy skirts before thy face, And have shewed nations thy nakedness, And kingdoms thy shame,"},{"num":6,"verse":"And I have cast upon thee abominations, And dishonoured thee, and made thee as a sight."},{"num":7,"verse":"And it hath come to pass, Each of thy beholders fleeth from thee, And hath said: `Spoiled is Nineveh, Who doth bemoan for her?' Whence do I seek comforters for thee?"},{"num":8,"verse":"Art thou better than No-Ammon, That is dwelling among brooks? Waters she hath round about her, Whose bulwark [is] the sea, waters her wall."},{"num":9,"verse":"Cush her might, and Egypt, and there is no end. Put and Lubim have been for thy help."},{"num":10,"verse":"Even she doth become an exile, She hath gone into captivity, Even her sucklings are dashed to pieces At the top of all out-places, And for her honoured ones they cast a lot, And all her great ones have been bound in fetters."},{"num":11,"verse":"Even thou art drunken, thou art hidden, Even thou dost seek a strong place, because of an enemy."},{"num":12,"verse":"All thy fortresses [are] fig-trees with first-fruits, If they are shaken, They have fallen into the mouth of the eater."},{"num":13,"verse":"Lo, thy people [are] women in thy midst, To thine enemies thoroughly opened Have been the gates of thy land, Consumed hath fire thy bars."},{"num":14,"verse":"Waters of a siege draw for thyself, Strengthen thy fortresses, Enter into mire, and tread on clay, Make strong a brick-kiln."},{"num":15,"verse":"There consume thee doth a fire, Cut thee off doth a sword, It doth consume thee as a cankerworm! Make thyself heavy as the cankerworm, Make thyself heavy as the locust."},{"num":16,"verse":"Multiply thy merchants above the stars of the heavens, The cankerworm hath stripped off, and doth flee away."},{"num":17,"verse":"Thy crowned ones [are] as a locust, And thy princes as great grasshoppers, That encamp in hedges in a day of cold, The sun hath risen, and it doth flee away, And not known is its place where they are."},{"num":18,"verse":"Slumbered have thy friends, king of Asshur, Rest do thine honourable ones, Scattered have been thy people on the mountains, And there is none gathering."},{"num":19,"verse":"There is no weakening of thy destruction, Grievous [is] thy smiting, All hearing thy fame have clapped the hand at thee, For over whom did not thy wickedness pass continually?"}]