[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shipmen that had knowledge of the sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—The Tyrians were known far and wide as the great sailors both of the Mediterranean and the seas beyond it, till they were rivalled and superseded by their own colonists in Carthage and by the Greeks. How greatly their seamanship, their commerce, and their civilisation impressed the imagination of Israel, is shown in the magnificent chapters of Ezekiel on the fate of Tyre (Ezekiel 26-28). The Israelites, on the contrary, had but little care for the sea, and little knowledge of seamanship. The coast line of Palestine is but scantily furnished with harbours; and even at the height of their power they were content to use the maritime skill of the Tyrians, without encroaching upon their commerce or attempting to seize their famous ports. This was natural; for their call to be a peculiar and separate people was absolutely incompatible with maritime enterprise and commerce. Even in this attempt at maritime expedition under Tyrian guidance, Solomon’s action was, as in other points, exceptional, departing from Israelite tradition; and we hear of no similar enterprise, except in the age of Ahab and Jehoshaphat, when the intermarriage of the royal houses of Israel and Phœnicia renewed the close connection with Tyre (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 22:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 20:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We observe, accordingly, that the sea is mostly regarded in the Old Testament in its terrible power of wave and storm, restrained from destroying only by the Almighty hand of God; and even the one psalm (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:23-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which describes the seafarer’s experience, dwells with awe on “God’s wonders in the deep.” In the description of the glory of “the new heaven and earth” of the hereafter, it is declared with emphasis that “there was no more sea” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:15-28 Here is a further account of Solomon's greatness. He began at the right end, for he built God's house first, and finished that before he began his own; then God blessed him, and he prospered in all his other buildings. Let piety begin, and profit follow; leave pleasure to the last. Whatever pains we take for the glory of God, and to profit others, we are likely to have the advantage. Canaan, the holy land, the glory of all lands, had no gold in it; which shows that the best produce is that which is for the present support of life, our own and others; such things did Canaan produce. Solomon got much by his merchandise, and yet has directed us to a better trade, within reach of the poorest. Wisdom is better than the merchandise of silver, and the gain thereof than fine gold, Pr 3:14.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shipmen - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. With respect to the acquaintance of the Phoenicians with this particular sea, it may be observed that they are not unlikely to have had trading settlements there, as they had in the Persian Gulf, even at this early period. The commerce with Ophir was probably an established trade, previously either in their hands or in those of the Egyptians, when Solomon determined to have a share in it. The Egyptians had navigated the other arm of the Red Sea, and perhaps its lower parts, from a much more ancient period. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26. Ezion-geber, which is beside Eloth—These were neighboring ports at the head of the eastern or Elanitic branch of the Red Sea. Tyrian ship carpenters and sailors were sent there for Solomon's vessels (see on [305]2Ch 8:17, 18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezion-geber—that is, \"the giant's backbone\"; so called from a reef of rocks at the entrance of the harbor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eloth—Elim or Elath; that is, \"the trees\"; a grove of terebinths still exists at the head of the gulf.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The Tyrians were famous for ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "knowledge of the sea.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He sent also ships to join with Solomon’s, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Chronicles 8:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 8:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; not from Tyre, the famous city of Phoenicia, which was in the midland sea, from whence he could not sail to the Red Sea without fetching a vast compass; but from an island in the Red Sea, called Tyre, because it was a colony of the Tyrians, as Strabo notes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Hiram sent in his navy his servants,.... And, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ships also but how he could send them from Tyre, which lay in the Mediterranean sea, to the above ports in the Red sea, without going a great way round, is not easy to conceive. Perhaps, as Gussetins conjectures (c), Hiram had a port in the Red sea for building and sending out ships, for the sake of his eastern navigation, and from thence he sent them to Solomon's ports in the same sea; but if what R. Japhet (d) observes is true, that the Red sea is mixed with the sea of Joppa by means of the river Rhinocurura, as is remarked by a learned man (e) and who approves of the observation, and thinks it does not deserve the censure Dr. Lightfoot (f) passes on it. If this, I say, can be supported, the difficulty is removed: so Abarbinel asserts (g), that a branch of the Nile flows into the Red sea: and another, passing through Alexandria, runs into the Mediterranean sea. This is the first navy of ships we read of; in the construction of which, as well as in the art of navigation, the Tyrians no doubt were greatly assisting to Solomon's servants, and which appears by what follows; and they are said (h) to be the first that made use of ships; and the invention of ships of burden, or merchant ships, such as these were, is by Pliny (i) ascribed to Hippus the Tyrian: and the Tyrians were famous for merchandise, which they could not carry on with foreign nations without shipping; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the servants Hiram sent in Solomon's navy were ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shipmen that had knowledge of the sea; of sea coasts and ports, of the manner of guiding and managing ships at sea, and of the whole art of navigation, so far as then known, for which the Tyrians were famous; see Ezekiel 27:3, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shipmen that had knowledge of the sea; of sea coasts and ports, of the manner of guiding and managing ships at sea, and of the whole art of navigation, so far as then known, for which the Tyrians were famous; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "with the servants of Solomon; to instruct and assist them in naval affairs, they not having been used thereunto. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Ebr. Comment p. 628. (d) In Aben Ezra in Jon. ii. 5. (e) Texelii Phoenix, l. 3. c. 6. p. 243, 244. (f) Miscellanies, c. 18. vol. 1. p. 1002, 1003. (g) Apud Manasseh, Spes Israelis, sect. 2. p. 20. (h) \"Prima ratem ventis credere docta Tyros\", Catullus. (i) Nat. Hist. l. 7. c. 56. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Ebr. Comment p. 628. (d) In Aben Ezra in Jon. ii. 5. (e) Texelii Phoenix, l. 3. c. 6. p. 243, 244. (f) Miscellanies, c. 18. vol. 1. p. 1002, 1003. (g) Apud Manasseh, Spes Israelis, sect. 2. p. 20. (h) \"Prima ratem ventis credere docta Tyros\", Catullus. (i) Nat. Hist. l. 7. c. 56. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Hiram sent in the navy his servants, shipmen that had knowledge of the sea, with the servants of Solomon.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that had knowledge of the sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For which knowledge in ancient times the Phœnicians were the most famous people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Hiram sent in the navy his servants, shipmen that had knowledge of the sea with the servants of Solomon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The chronicler states (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that he sent ships as well as servants, and it has been thought that ships were transported, in parts or entire, by land across the Isthmus of Suez, and there are certainly instances on record of the land transport of fleets. (Keil reminds us that Alexander the Great, according to Arrian, had snips transported - in pieces - from Phoenicia to the Euphrates, and that, according to Thucydides (Bell. Pelop. 4:8) the Peloponnesians conveyed 60 ships from Corcyra across the Leucadian Isthmus, etc.) But this, especially when the state of engineering science, etc., among the Hebrews is taken into account, is hardly to be thought cf. It is quite possible, however, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "timber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for shipbuilding was floated on the Mediterranean down to the river of Egypt, or some such place, and then transported either to Suez or to Akaba. Probably all that the chronicler means is that Hiram provided the materials and had the ships built. The Israelites, having hitherto had no fleet, and little or no experience of the sea, were unable to construct ships for themselves. And the Tyrians may have seen in the construction of a fleet for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "eastern",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " voyages, an opening for the extension of their own maritime trade. Possibly in the first voyages Tyriaus and Jews were copartners.] 1 Kings 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He sends ships to Ophir. - Solomon built a fleet (אני is collective, ships or fleet; the nom. unitatis is אניּה) at Eziongeber, near Eloth, on the coast of the Red Sea (ים־סוּף: see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in the land of Edom; and Hiram sent in the fleet \"shipmen that had knowledge of the sea\" along with Solomon's servants to Ophir, whence they brought to king Solomon 420 talents of gold. Eziongeber, a harbour at the north-eastern end of the Elanitic Gulf, was probably the \"large and beautiful town of Asziun\" mentioned by Makrizi (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and situated on the great bay of Wady Emrag (see Rppell, Reisen in Nubien, pp. 252-3). Eloth (lit., trees, a grove, probably so named from the large palm-grove in the neighbourhood), or Elath (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Aila and Aelana of the Greeks and Romans, Arab. Aileh, was situated at the northern point of the (Elanitic) gulf, which took its name from the town; and in the time of the Fathers it was an important commercial town. It was not far from the small modern fortress of Akaba, where heaps of rubbish still show the spot on which it formerly stood (compare Rppell, Nub. p. 248, with plates 6 and 7, and Robinson, Pal. i. p. 251ff.). - The corresponding text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", differs in many respects from the account before us. The statement in the Chronicles, that Solomon went to Eziongeber and Elath, is but a very unimportant deviation; for the building of the fleet makes it a very probable thing in itself that Solomon should have visited on that account the two towns on the Elanitic Gulf, which were very near to one another, to make the requisite arrangements upon the spot for this important undertaking. There is apparently a far greater deviation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where, in the place of the statement that Hiram sent בּאני, in the (or a) fleet, his servants as sailors who had knowledge of the sea, the chronicler affirms that Hiram sent by his servants ships and men who had knowledge of the sea. For the only way in which Hiram could send ships to Eziongeber was either by land or (as Ritter, Erdk. xiv. p. 365, supposes) out of the Persian Gulf, supposing that the Tyrians had a fleet upon that sea at so early a date as this. The statement in the Chronicles receives an apparent confirmation from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The king had a Tarshish fleet upon the sea with the fleet of Hiram,\" if indeed this passage also refers to the trade with Ophir, as is generally supposed; for then these words affirm that Hiram sent ships of his own to Ophir along with those of Solomon. We do not think it probable, however that the words \"Hiram sent ships by his own men\" are to be so pressed as to be taken to mean that he had whole ships, or ships taken to pieces, conveyed to Eziongeber either from Tyre or out of the Mediterranean Sea, although many cases might be cited from antiquity in support of this view.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Thus, for example, according to Arriani exped. Alex. l. v. p. 329, and vii. p. 485 (ed. Blanc), Alexander the Great had ships transported from Phoenicia to the Euphrates, and out of the Indus into the Hydaspes, the ships being taken to pieces for the land transport (ἐτμήθησαν), and the pieces (τμήματα) afterwards joined together again. Plutarch relates (vita Anton. p. 948, ed. Frkf. 1620) that Cleopatra would have had her whole fleet carried across the isthmus which separates Egypt from the Red Sea, and have escaped by that means, had not the Arabs prevented the execution of her plan by burning the first ships that were drawn up on the land. According to Thucydides, bell. Pelop. iv. 8, the Peloponnesians conveyed sixty ships which lay at Corcyra across the Leucadian isthmus. Compare also Polyaeni strateg. v. 2, 6, and Ammian. Marcell. xxiv. 7, and from the middle ages the account of Makrizi in Burckhardt's Reisen in Syrien, p. 331.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In all probability the words affirm nothing more than that Hiram supplied the ships for this voyage, that is to say, that he had them built at Eziongeber by his own men, and the requisite materials conveyed thither, so far as they were not to be obtained upon the spot. At any rate, Solomon was obliged to call the Tyrians to his help for the building of the ships, since the Israelites, who had hitherto carried in no maritime trade at all, were altogether inexperienced in shipbuilding. Moreover, the country round Eziongeber would hardly furnish wood adapted for the purpose, as there are only palms to be found there, whose spongy wood, however useful it may be for the inside of houses, cannot be applied to the building of ships. But if Hiram had ships built for Solomon by his own men and sent him sailors who were accustomed to the sea, he would certainly have some of his own ships engaged in this maritime trade; and this explains the statement in 1 Kings 10:22.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In all probability the words affirm nothing more than that Hiram supplied the ships for this voyage, that is to say, that he had them built at Eziongeber by his own men, and the requisite materials conveyed thither, so far as they were not to be obtained upon the spot. At any rate, Solomon was obliged to call the Tyrians to his help for the building of the ships, since the Israelites, who had hitherto carried in no maritime trade at all, were altogether inexperienced in shipbuilding. Moreover, the country round Eziongeber would hardly furnish wood adapted for the purpose, as there are only palms to be found there, whose spongy wood, however useful it may be for the inside of houses, cannot be applied to the building of ships. But if Hiram had ships built for Solomon by his own men and sent him sailors who were accustomed to the sea, he would certainly have some of his own ships engaged in this maritime trade; and this explains the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The destination of the fleet was Ophir, whence the ships brought 420 or (according to the Chronicles) 450 talents of gold. The difference between 420 and 450 may be accounted for from the substitution of the numeral letter נ (50) for כ (20). The sum mentioned amounted to eleven or twelve million dollars (from 1,600,000 to 1,800,000 - Tr.), and the question arises, whether this is to be taken as the result of one voyage, or as the entire profits resulting from the expeditions to Ophir. The words admit of either interpretation, although they are more favourable to the latter than to the former, inasmuch as there is no allusion whatever to the fact that they brought this amount all at once or on every voyage. (See also at 1 Kings 10:14, 1 Kings 10:22.) The question as to the situation of Ophir has given rise to great dispute, and hitherto no certain conclusion has been arrived at; in fact, it is possible that there are no longer any means of deciding it. Some have endeavoured to prove that it was in southern Arabia, others that it was on the eastern coast of Africa, and others again that it was in Hither India.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The destination of the fleet was Ophir, whence the ships brought 420 or (according to the Chronicles) 450 talents of gold. The difference between 420 and 450 may be accounted for from the substitution of the numeral letter נ (50) for כ (20). The sum mentioned amounted to eleven or twelve million dollars (from 1,600,000 to 1,800,000 - Tr.), and the question arises, whether this is to be taken as the result of one voyage, or as the entire profits resulting from the expeditions to Ophir. The words admit of either interpretation, although they are more favourable to the latter than to the former, inasmuch as there is no allusion whatever to the fact that they brought this amount all at once or on every voyage. (See also at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The question as to the situation of Ophir has given rise to great dispute, and hitherto no certain conclusion has been arrived at; in fact, it is possible that there are no longer any means of deciding it. Some have endeavoured to prove that it was in southern Arabia, others that it was on the eastern coast of Africa, and others again that it was in Hither India.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Compare the thorough examination of the different views concerning Ophir in C. Ritter's Erdk. xiv. pp. 348-431, with the briefer collection made by Gesenius in his Thes. p. 141f. and in the Allgem. Encyclop. der Wissenschaft u. Knste, 3 Sect. Bd. 4, p. 201ff., and by Pressel, art. \"Ophir,\" in Herzog's Cyclopaedia. - We need not dwell upon the different opinions held by the earlier writers. But among modern authors, Niebuhr, Gesenius, Rosenmller, and Seetzen decide in favour of Arabia; Quatremre (Mmoire sur le pays d'Ophir in Mm. de l'Instit. roy. 1845, t. xv. P. ii. p. 350ff.) and Movers, who takes Ophir to be the name of an emporium on the eastern coast of Africa, in favour of Sofala; while Chr. Lassen (Indische Alterthumskunde, i. p. 537ff., ii. p. 552ff.) and C. Ritter are the principal supporters of India. On the other hand, Albr. Roscher (Ptolemus und die Handelsstrassen in Central-Africa, Gotha 1857, p. 57ff.) has attempted to connect together all these views by assuming that the seamen of Hiram and Solomon fetched the gold of Western Africa from the island of Dahlak in the Red Sea, and having taken it to India to exchange, returned at the end of a three years' voyage enriched with gold and the productions of India.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The decision is dependent upon a previous question, whether 1 Kings 10:22, \"The king had a Tarshish fleet upon the sea with the fleet of Hiram; once in three years came the Tarshish fleet, bringing gold, silver,\" etc., also applies to the voyage to Ophir. The expression \"Tarshish fleet;\" the word בּיּם (\"on the sea\"), which naturally suggests that sea to which the Israelites applied the special epithet היּם, namely the Mediterranean; and lastly, the difference in the cargoes, - the ships from Ophir bringing gold and algummim wood (1 Kings 9:28 and 1 Kings 10:11), and the Tarshish fleet bringing gold, silver, ivory, apes, and peacocks (1 Kings 10:22), - appear to favour the conclusion that the Tarshish fleet did not sail to Ophir, but upon the Mediterranean Sea to Tarshish, i.e., Tartessus in Spain; to which we may add the fact that תרשׁישׁ אני is reproduced in 2 Chronicles 9:21 by תּרשׁישׁ הלכות אניּות, \"ships going to Tarshish.\" Nevertheless, however plausible these arguments may appear, after a renewed investigation of the subject I cannot regard them as having decisive weight: for (1) the expression \"Tarshish fleet\" is used in 1 Kings 22:49 in connection with ships that were intended to go to Ophir; (2) בּיּם (upon the sea) might receive its more precise definition from what precedes; and (3) the difference in the cargoes reduces itself to this, that in addition to the gold, which was the chief production of Ophir, there are a few other articles of trade mentioned, so that the account in 1 Kings 10:22 is more complete than that in 1 Kings 9:28 and 1 Kings 10:11. The statement concerning the Tarshish fleet in 1 Kings 10:22 contains a passing remark, like that in 1 Kings 10:11, from which we must infer that both passages treat in the same manner simply of the voyage to Ophir, and therefore that the term \"Tarshish ships,\" like our Indiamen (Indienfahrer), was applied to ships intended for long voyages. If, in addition to the ships sailing to Ophir, Solomon had also had a fleet upon the Mediterranean Sea which sailed with the Phoenicians to Tartessus, this would certainly have been mentioned here (1 Kings 9:27-28) at the same time as the Ophir voyage. On all these grounds we can come to no other conclusion than that the expression in 2 Chronicles 9:21, \"ships going to Tarshish,\" is simply a mistaken exposition of the term \"Tarshish fleet,\" - a mistake which may easily be explained from the fact, that at the time when the Chronicles were written, the voyages not only of the Israelites but also of the Tyrians both to Ophir and Tarshish had long since ceased, and even the geographical situation of these places was then unknown to the Jews (see my Introduction to the Old Test. p. 442, ed. 2).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The decision is dependent upon a previous question, whether ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"The king had a Tarshish fleet upon the sea with the fleet of Hiram; once in three years came the Tarshish fleet, bringing gold, silver,\" etc., also applies to the voyage to Ophir. The expression \"Tarshish fleet;\" the word בּיּם (\"on the sea\"), which naturally suggests that sea to which the Israelites applied the special epithet היּם, namely the Mediterranean; and lastly, the difference in the cargoes, - the ships from Ophir bringing gold and algummim wood (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 9:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the Tarshish fleet bringing gold, silver, ivory, apes, and peacocks (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), - appear to favour the conclusion that the Tarshish fleet did not sail to Ophir, but upon the Mediterranean Sea to Tarshish, i.e., Tartessus in Spain; to which we may add the fact that תרשׁישׁ אני is reproduced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by תּרשׁישׁ הלכות אניּות, \"ships going to Tarshish.\" Nevertheless, however plausible these arguments may appear, after a renewed investigation of the subject I cannot regard them as having decisive weight: for (1) the expression \"Tarshish fleet\" is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in connection with ships that were intended to go to Ophir; (2) בּיּם (upon the sea) might receive its more precise definition from what precedes; and (3) the difference in the cargoes reduces itself to this, that in addition to the gold, which was the chief production of Ophir, there are a few other articles of trade mentioned, so that the account in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is more complete than that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 9:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The statement concerning the Tarshish fleet in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contains a passing remark, like that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", from which we must infer that both passages treat in the same manner simply of the voyage to Ophir, and therefore that the term \"Tarshish ships,\" like our Indiamen (Indienfahrer), was applied to ships intended for long voyages. If, in addition to the ships sailing to Ophir, Solomon had also had a fleet upon the Mediterranean Sea which sailed with the Phoenicians to Tartessus, this would certainly have been mentioned here (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 9:27-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") at the same time as the Ophir voyage. On all these grounds we can come to no other conclusion than that the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"ships going to Tarshish,\" is simply a mistaken exposition of the term \"Tarshish fleet,\" - a mistake which may easily be explained from the fact, that at the time when the Chronicles were written, the voyages not only of the Israelites but also of the Tyrians both to Ophir and Tarshish had long since ceased, and even the geographical situation of these places was then unknown to the Jews (see my Introduction to the Old Test. p. 442, ed. 2).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The name Ophir occurs first of all in Genesis 10:29 among the tribes of Southern Arabia, that were descended from Joktan, between Seba and Havilah, i.e., the Sabaeans and Chaulotaeans. Hence it appears most natural to look for the gold-land of Ophir in Southern Arabia. But as there is still a possibility that the Joktanide tribe of Ophir, or one branch of it, may subsequently have emigrated either to the eastern coast of Africa or even to Hither India, and therefore that the Solomonian Ophir may have been an Arabian colony outside Arabia, the situation of this gold country cannot be determined without further evidence from Genesis 10:29 alone; but before arriving at an actual decision, we must first of all examine the arguments that may be adduced in support of each of the three countries named. Sofala in Eastern Africa, in the Mozambique Channel, has nothing in common with the name Ophir, but is the Arabic suflah (Heb. שׁפלה), i.e., lowland or sea-coast; and the old Portuguese accounts of the gold mines in the district of Fura there, as well as the pretended walls of the queen of Saba, have far too little evidence to support them, to have any bearing upon the question before us. The supposed connection between the name Ophir and the city of Σουπάρα mentioned by Ptolemaeus, or Οὔππαρα by Periplus (Geogr. min. i. p. 30), in the neighbourhood of Goa, or the shepherd tribe of Abhira, cannot be sustained. Σουπάρα or Sufra (Edrisi) answers to the Sanscrit Supara, i.e., beautiful coast (cf. Lassen, Ind. Alterthk. i. p. 107); and Οὔππαρα in Periplus is not doubt simply a false reading for Σουπάρα, which has nothing in common with אופיר. And the shepherd tribe of Abhira can hardly come into consideration, because the country which they inhabited, to the south-east of the mouths of the Indus, has no gold. - Again, the hypothesis that India is intended derives just as little support from the circumstance that, with the exception of Genesis 10:29, the lxx have always rendered אופיר either Σωφιρά or Σουφίρ, which is, according to the Coptic lexicographers, the name used by the Copts for India, and that Josephus (Ant. viii. 6, 4), who used the Old Test. in the Alexandrian version, has given India as the explanation of Ophir, as it does from this supposed resemblance in the names. For, according to the geographical ideas of the Alexandrians and later Greeks, India reached to Ethiopia, and Ethiopia to India, as Letronne has conclusively proved (see his Mmoire sur une mission arienne, etc., in Mm. de l'Instit. Acad. des Inscript. et Bell. Lettres, t. x. p. 220ff.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The name Ophir occurs first of all in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " among the tribes of Southern Arabia, that were descended from Joktan, between Seba and Havilah, i.e., the Sabaeans and Chaulotaeans. Hence it appears most natural to look for the gold-land of Ophir in Southern Arabia. But as there is still a possibility that the Joktanide tribe of Ophir, or one branch of it, may subsequently have emigrated either to the eastern coast of Africa or even to Hither India, and therefore that the Solomonian Ophir may have been an Arabian colony outside Arabia, the situation of this gold country cannot be determined without further evidence from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " alone; but before arriving at an actual decision, we must first of all examine the arguments that may be adduced in support of each of the three countries named. Sofala in Eastern Africa, in the Mozambique Channel, has nothing in common with the name Ophir, but is the Arabic suflah (Heb. שׁפלה), i.e., lowland or sea-coast; and the old Portuguese accounts of the gold mines in the district of Fura there, as well as the pretended walls of the queen of Saba, have far too little evidence to support them, to have any bearing upon the question before us. The supposed connection between the name Ophir and the city of Σουπάρα mentioned by Ptolemaeus, or Οὔππαρα by Periplus (Geogr. min. i. p. 30), in the neighbourhood of Goa, or the shepherd tribe of Abhira, cannot be sustained. Σουπάρα or Sufra (Edrisi) answers to the Sanscrit Supara, i.e., beautiful coast (cf. Lassen, Ind. Alterthk. i. p. 107); and Οὔππαρα in Periplus is not doubt simply a false reading for Σουπάρα, which has nothing in common with אופיר. And the shepherd tribe of Abhira can hardly come into consideration, because the country which they inhabited, to the south-east of the mouths of the Indus, has no gold. - Again, the hypothesis that India is intended derives just as little support from the circumstance that, with the exception of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the lxx have always rendered אופיר either Σωφιρά or Σουφίρ, which is, according to the Coptic lexicographers, the name used by the Copts for India, and that Josephus (Ant. viii. 6, 4), who used the Old Test. in the Alexandrian version, has given India as the explanation of Ophir, as it does from this supposed resemblance in the names. For, according to the geographical ideas of the Alexandrians and later Greeks, India reached to Ethiopia, and Ethiopia to India, as Letronne has conclusively proved (see his Mmoire sur une mission arienne, etc., in Mm. de l'Instit. Acad. des Inscript. et Bell. Lettres, t. x. p. 220ff.).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Greater stress has been laid upon the duration of the voyages to Ophir, - namely, that the Tarshish fleet came once in three years, according to 1 Kings 10:22, and brought gold, etc. But even Lassen, who follows Heeren, observes quite truly, that \"this expression need not be understood as signifying that three whole years intervened between the departure and return, but simply that the fleet returned once in the course of three years.\" Moreover, the stay in Ophir is to be reckoned in as part of the time occupied in the voyage; and that this is not to be estimated as a short one, is evident from the fact that, according to Homer, Odyss. xv. 454ff., a Phoenician merchantman lay for a whole year at one of the Cyclades before he had disposed of his wares of every description, in return for their articles of commerce, and filled his roomy vessel. If we add to this the slowness of the voyage, - considering that just as at the present day the Arabian coasters go but very slowly from port to port, so the combined fleet of Hiram and Solomon would not be able to proceed with any greater rapidity, inasmuch as the Tyrians were not better acquainted with the dangerous Arabian Sea than the modern Arabians are, and that the necessary provisions for a long voyage, especially the water for drinking, could not be taken on board all at once, but would have to be taken in at the different landing-places, and that on these occasions some trade would be done, - we can easily understand how a voyage from Eziongeber to the strait of Bab el Mandeb and the return might occupy more than a year,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Greater stress has been laid upon the duration of the voyages to Ophir, - namely, that the Tarshish fleet came once in three years, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and brought gold, etc. But even Lassen, who follows Heeren, observes quite truly, that \"this expression need not be understood as signifying that three whole years intervened between the departure and return, but simply that the fleet returned once in the course of three years.\" Moreover, the stay in Ophir is to be reckoned in as part of the time occupied in the voyage; and that this is not to be estimated as a short one, is evident from the fact that, according to Homer, Odyss. xv. 454ff., a Phoenician merchantman lay for a whole year at one of the Cyclades before he had disposed of his wares of every description, in return for their articles of commerce, and filled his roomy vessel. If we add to this the slowness of the voyage, - considering that just as at the present day the Arabian coasters go but very slowly from port to port, so the combined fleet of Hiram and Solomon would not be able to proceed with any greater rapidity, inasmuch as the Tyrians were not better acquainted with the dangerous Arabian Sea than the modern Arabians are, and that the necessary provisions for a long voyage, especially the water for drinking, could not be taken on board all at once, but would have to be taken in at the different landing-places, and that on these occasions some trade would be done, - we can easily understand how a voyage from Eziongeber to the strait of Bab el Mandeb and the return might occupy more than a year,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It is no proof to the contrary, that, according to the testimony of ancient writer, as collected by Movers (Phniz. ii. 3, p. 190ff.), the Phoenicians sailed almost as rapidly as the modern merchant ships; for this evident simply applies to the voyages on the Mediterranean Sea with which they were familiar, and to the period when the Phoenician navigation had reached its fullest development, so that it has no bearing upon the time of Solomon and a voyage upon the Arabian Sea, with which the Phoenicians were hitherto quite unacquainted. - Again, the calculation made by Lassen (ii. pp. 590-1), according to which a voyage from Eziongeber to the mouth of the Indus could have been accomplished in a hundred days, is founded upon the assumption that the Phoenicians were already acquainted with the monsoon and knew what was the best time for the navigation of the Red Sea, - an assumption which can neither be proved nor shown to be probable.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so that the time occupied in the voyage as given here cannot furnish any decisive proof that the fleet sailed beyond Southern Arabia to the East Indies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And lastly, the same remarks apply to the goods brought from Ophir, which many regard as decisive evidence in favour of India. The principal article for which Ophir became so celebrated, viz., the gold, is not found either in Sufra near Goa, or in the land of Abhira. Even if India be much richer in gold than was formerly supposed (cf. Lassen, ii. p. 592), the rich gold country lies to the north of Cashmir (see Lassen, ii. pp. 603-4). Moreover, not only is it impossible to conceive what goods the Phoenicians can have offered to the Indian merchants for their gold and the other articles named, since large sums of gold were sent to India every year in the Roman times to pay for the costly wares that were imported thence (see Roscher, pp. 53, 54); but it is still less possible to comprehend how the shepherd tribe of Abhira could have come into possession of so much gold as the Ophir fleet brought home. The conjecture of Ritter (Erdk. xiv. p. 399) and Lassen (ii. p. 592), that this tribe had come to the coast not very long before from some country of their own where gold abounded, and that as an uncultivated shepherd tribe they attached but very little value to the gold, so that they parted with it to the Phoenicians for their purple cloths, their works in brass and glass, and for other things, has far too little probability to appear at all admissible. If the Abhira did not know the value of the gold, they would not have brought it in such quantities out of their original home into these new settlements. We should therefore be obliged to assume that they were a trading people, and this would be at variance with all the known accounts concerning this tribe. - As a rule, the gold treasures of Hither Asia were principally obtained from Arabia in the most ancient times. If we leave Havilah (Genesis 2:11) out of the account, because its position cannot be determined with certainty, the only other place specially referred to in the Old Testament besides Ophir as being celebrated as a gold country is Saba, in the south-western portion of Yemen. The Sabaeans bring gold, precious stones, and incense (Isaiah 60:6; Ezekiel 27:22); and the queen of Saba presented Solomon with 120 talents of gold, with perfumes and with precious stones (1 Kings 10:10). This agrees with the accounts of the classical writers, who describe Arabia as very rich in gold (cf. Strabo, xvi. 777f. and 784; Diod. Sic. ii. 50, iii. 44; also Bochart, Phaleg, l. ii. c. 27). These testimonies, which we have already given in part at Exodus 38:31, are far too distinct to be set aside by the remark that there is no gold to be found in Arabia at the present time. For whilst, on the one hand, the wealth of Arabia in gold may be exhausted, just as Spain no longer yields any silver, on the other hand we know far too little of the interior of Southern Arabia to be able distinctly to maintain that there is no gold in existence there. - Silver, the other metal brought from Ophir, was also found in the land of the Nabataeans, according to Strabo, xvi. p. 784, although the wealth of the ancient world in silver was chiefly derived from Tarshish or Tartessus in Spain (cf. Movers, Phniz. ii. 3, p. 36ff., where the different places are enumerated in which silver was found). - That precious stones were to be found in Arabia is evident from the passages cited above concerning the Sabaeans. - On the other hand, however, it has been supposed that the remaining articles of Ophir could only have been brought from the East Indies.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And lastly, the same remarks apply to the goods brought from Ophir, which many regard as decisive evidence in favour of India. The principal article for which Ophir became so celebrated, viz., the gold, is not found either in Sufra near Goa, or in the land of Abhira. Even if India be much richer in gold than was formerly supposed (cf. Lassen, ii. p. 592), the rich gold country lies to the north of Cashmir (see Lassen, ii. pp. 603-4). Moreover, not only is it impossible to conceive what goods the Phoenicians can have offered to the Indian merchants for their gold and the other articles named, since large sums of gold were sent to India every year in the Roman times to pay for the costly wares that were imported thence (see Roscher, pp. 53, 54); but it is still less possible to comprehend how the shepherd tribe of Abhira could have come into possession of so much gold as the Ophir fleet brought home. The conjecture of Ritter (Erdk. xiv. p. 399) and Lassen (ii. p. 592), that this tribe had come to the coast not very long before from some country of their own where gold abounded, and that as an uncultivated shepherd tribe they attached but very little value to the gold, so that they parted with it to the Phoenicians for their purple cloths, their works in brass and glass, and for other things, has far too little probability to appear at all admissible. If the Abhira did not know the value of the gold, they would not have brought it in such quantities out of their original home into these new settlements. We should therefore be obliged to assume that they were a trading people, and this would be at variance with all the known accounts concerning this tribe. - As a rule, the gold treasures of Hither Asia were principally obtained from Arabia in the most ancient times. If we leave Havilah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") out of the account, because its position cannot be determined with certainty, the only other place specially referred to in the Old Testament besides Ophir as being celebrated as a gold country is Saba, in the south-western portion of Yemen. The Sabaeans bring gold, precious stones, and incense (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the queen of Saba presented Solomon with 120 talents of gold, with perfumes and with precious stones (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This agrees with the accounts of the classical writers, who describe Arabia as very rich in gold (cf. Strabo, xvi. 777f. and 784; Diod. Sic. ii. 50, iii. 44; also Bochart, Phaleg, l. ii. c. 27). These testimonies, which we have already given in part at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are far too distinct to be set aside by the remark that there is no gold to be found in Arabia at the present time. For whilst, on the one hand, the wealth of Arabia in gold may be exhausted, just as Spain no longer yields any silver, on the other hand we know far too little of the interior of Southern Arabia to be able distinctly to maintain that there is no gold in existence there. - Silver, the other metal brought from Ophir, was also found in the land of the Nabataeans, according to Strabo, xvi. p. 784, although the wealth of the ancient world in silver was chiefly derived from Tarshish or Tartessus in Spain (cf. Movers, Phniz. ii. 3, p. 36ff., where the different places are enumerated in which silver was found). - That precious stones were to be found in Arabia is evident from the passages cited above concerning the Sabaeans. - On the other hand, however, it has been supposed that the remaining articles of Ophir could only have been brought from the East Indies.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "According to 1 Kings 10:12, the Ophir ships brought a large quantity of אלמגּים עצי (almuggim wood: 2 Chronicles 2:7, אלגּמּים). According to Kimchi (on 2 Chronicles 2:7), the אלמוּג or אלגוּם is arbor rubri coloris, dicta lingua arabica albakam (Arabic ‛l-bqm), vulgo brasilica. This tree, according to Abulfadl (Celsius, Hierob. i. p. 176), is a native of India and Ethiopia; and it is still a question in dispute, whether we are to understand by this the Pterocarpus Santal., from which the true sandal-wood comes, and which is said to grow only in the East Indies on Malabar and Java, or the Caesalpinia Sappan L., a tree which grows in the East Indies, more especially in Ceylon, and also in different parts of Africa, the red wood of which is used in Europe chiefly for dyeing. Moreover the true explanation of the Hebrew name is still undiscovered. The derivation of it from the Sanscrit Valgu, i.e., pulcher (Lassen and Ritter), has been set aside by Gesenius as inappropriate, and mocha, mochta, which is said to signify sandal-wood in Sanscrit, has been suggested instead. But no evidence has been adduced in its favour, nor is the word to be found in Wilson's Sanscrit Lexicon. If, however, this derivation were correct, אל would be the Arabic article, and the introduction of this article in connection with the word mocha would be a proof that the sandal-wood, together with its name, came to the Hebrews through merchants who spoke Arabic. - The other articles from Ophir mentioned in 1 Kings 10:22 are שׁגהבּים, ὀδόντες ἐλεφάντινοι (lxx), dentes elephantorum or ebur (Vulg.), דפיל ,).gluV( שׁן, elephants' teeth (Targ.). But however certain the meaning of the word may thus appear, the justification of this meaning is quite as uncertain. In other cases ivory is designated by the simple term שׁן   (1 Kings 10:18; 1 Kings 22:39; Psalm 45:9; Amos 3:15, etc.), whereas Ezekiel (Ezekiel 27:15) calls the whole tusk קרנות שׁן, horns of the tooth. הבּים is said to signify elephants here; and according to Benary it is contracted from האבּים, the Sanscrit word ibha, elephant; according to Ewald, from הלבּים, from the Sanscrit Kalabha; and according to Hitzig, from נהבים  equals  להבים, Libyi; or else שׁגהבּים is a false reading for והבנים שׁן, ivory and ebony, according to Ezekiel 27:15 (see Ges. Thes. p. 1453). Of these four derivations the first two are decidedly wrong: the first, because ibha as a name for the elephant only occurs, according to Weber, in the later Indian writings, and is never used in the earlier writings in this sense (vid., Roediger, Addenda ad Ges. thes. p. 115); the second, because Kalabha does not signify the elephant, but catulum elephanti, before it possesses any teeth available for ivory. The third is a fancy which its originator himself has since given up and the fourth a conjecture, which is not raised to a probability even by the attempt of Bttcher to show that הבּים is a case of backward assimilation from הבנים, because the asyndeton הבּים שׁן between two couples connected by ו is without any analogy, and the passages adduced by Bttcher, viz., Deuteronomy 29:22; Joshua 15:54., and Even Ezekiel 27:33, are to be taken in quite a different way. -  The rendering of קפים by apes, and the connection of the name not only with the Sanscrit and Malabar kapi, but also with the Greek κῆπος and κῆβος, also κεῖβος, are much surer; but, on the other hand, the assumption that the Greeks, like the Semitic nations, received the word from the Indians along with the animals, is very improbable: for κῆπος in Greek does not denote the ape (πίθηκος) generally, but simply a species of long-tailed apes, the native land of which, according to the testimony of ancient writers, was Ethiopia,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Ophir ships brought a large quantity of אלמגּים עצי (almuggim wood: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", אלגּמּים). According to Kimchi (on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the אלמוּג or אלגוּם is arbor rubri coloris, dicta lingua arabica albakam (Arabic ‛l-bqm), vulgo brasilica. This tree, according to Abulfadl (Celsius, Hierob. i. p. 176), is a native of India and Ethiopia; and it is still a question in dispute, whether we are to understand by this the Pterocarpus Santal., from which the true sandal-wood comes, and which is said to grow only in the East Indies on Malabar and Java, or the Caesalpinia Sappan L., a tree which grows in the East Indies, more especially in Ceylon, and also in different parts of Africa, the red wood of which is used in Europe chiefly for dyeing. Moreover the true explanation of the Hebrew name is still undiscovered. The derivation of it from the Sanscrit Valgu, i.e., pulcher (Lassen and Ritter), has been set aside by Gesenius as inappropriate, and mocha, mochta, which is said to signify sandal-wood in Sanscrit, has been suggested instead. But no evidence has been adduced in its favour, nor is the word to be found in Wilson's Sanscrit Lexicon. If, however, this derivation were correct, אל would be the Arabic article, and the introduction of this article in connection with the word mocha would be a proof that the sandal-wood, together with its name, came to the Hebrews through merchants who spoke Arabic. - The other articles from Ophir mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are שׁגהבּים, ὀδόντες ἐλεφάντινοι (lxx), dentes elephantorum or ebur (Vulg.), דפיל ,).gluV( שׁן, elephants' teeth (Targ.). But however certain the meaning of the word may thus appear, the justification of this meaning is quite as uncertain. In other cases ivory is designated by the simple term שׁן   (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.), whereas Ezekiel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") calls the whole tusk קרנות שׁן, horns of the tooth. הבּים is said to signify elephants here; and according to Benary it is contracted from האבּים, the Sanscrit word ibha, elephant; according to Ewald, from הלבּים, from the Sanscrit Kalabha; and according to Hitzig, from נהבים  equals  להבים, Libyi; or else שׁגהבּים is a false reading for והבנים שׁן, ivory and ebony, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (see Ges. Thes. p. 1453). Of these four derivations the first two are decidedly wrong: the first, because ibha as a name for the elephant only occurs, according to Weber, in the later Indian writings, and is never used in the earlier writings in this sense (vid., Roediger, Addenda ad Ges. thes. p. 115); the second, because Kalabha does not signify the elephant, but catulum elephanti, before it possesses any teeth available for ivory. The third is a fancy which its originator himself has since given up and the fourth a conjecture, which is not raised to a probability even by the attempt of Bttcher to show that הבּים is a case of backward assimilation from הבנים, because the asyndeton הבּים שׁן between two couples connected by ו is without any analogy, and the passages adduced by Bttcher, viz., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., and Even ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are to be taken in quite a different way. -  The rendering of קפים by apes, and the connection of the name not only with the Sanscrit and Malabar kapi, but also with the Greek κῆπος and κῆβος, also κεῖβος, are much surer; but, on the other hand, the assumption that the Greeks, like the Semitic nations, received the word from the Indians along with the animals, is very improbable: for κῆπος in Greek does not denote the ape (πίθηκος) generally, but simply a species of long-tailed apes, the native land of which, according to the testimony of ancient writers, was Ethiopia,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Compare Aristoteles, hist. animal. ii.:8: ἔστι δὲ ὁ μέν κῆβος πίθηκος ἔχων οὐράν. Strabo, xvii. p. 812: ἔστι δὲ ὁ κῆπος τὸ μέν πρόσωπον ἐοικὼς Σατύρῳ, τ ̓ ἄλλα δὲ κυνὸς καὶ ἄρκτου μεταξύ· γεννᾶται δ ̓ ἐν Αἰθιοπίᾳ. Plinius, h. n. viii. 19 (28): Iidem (the games of Pompey the Great) ostenderunt ex Aethiopia quas vocant κήπους, quarum pedes posteriores pedibus humanis et cruribus, priores manibus fuere similes. Solinus Polyh. says the same (Bochart, Hieroz. i. lib. iii. c. 31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Ethiopian apes are hardly likely to have sprung from India. - And lastly, even in the case of תּכּיּים, according to the ancient versions peacocks, the derivation from the Malabaric or Tamul tgai or tghai (cf. Roediger in Ges. Thes. p. 1502) is not placed beyond the reach of doubt.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]