[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 7:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 7:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Indeed I have sinned — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He seems to make a sincere and ingenuous confession, and loads his sin with all just aggravations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Against the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Against his express command, and glorious attributes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God of Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The true God, who hath chosen me and all Israel to be the people of his peculiar love and care.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:16-26 See the folly of those that promise themselves secrecy in sin. The righteous God has many ways of bringing to light the hidden works of darkness. See also, how much it is our concern, when God is contending with us, to find out the cause that troubles us. We must pray with holy Job, Lord, show me wherefore thou contendest with me. Achan's sin began in the eye. He saw these fine things, as Eve saw the forbidden fruit. See what comes of suffering the heart to walk after the eyes, and what need we have to make this covenant with our eyes, that if they wander they shall be sure to weep for it. It proceeded out of the heart. They that would be kept from sinful actions, must mortify and check in themselves sinful desires, particularly the desire of worldly wealth. Had Achan looked upon these things with an eye of faith, he would have seen they were accursed things, and would have dreaded them; but looking on them with an eye of sense only, he saw them as goodly things, and coveted them. When he had committed the sin, he tried to hide it. As soon as he had got this plunder, it became his burden, and he dared not to use his ill-gotten treasure. So differently do objects of temptation appear at a distance, to what they do when they have been gotten. See the deceitfulness of sin; that which is pleasing in the commission, is bitter in the reflection. See how they will be deceived that rob God. Sin is a very troublesome thing, not only to a sinner himself, but to all about him. The righteous God will certainly recompense tribulation to them that trouble his people. Achan perished not alone in his sin. They lose their own, who grasp at more than their own. His sons and daughters were put to death with him. It is probable that they helped to hide the things; they must have known of them. What fatal consequences follow, even in this world, to the sinner himself, and to all belonging him! One sinner destroys much good. What, then, will be the wrath to come? Let us flee from it to Christ Jesus as the sinner's Friend. There are circumstances in the confession of Achan, marking the progress of sin, from its first entrance into the heart to its being done, which may serve as the history of almost every offence against the law of God, and the sacrifice of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Give glory to the Lord - A form of solemn adjuration by which the person addressed was called upon before God to declare the truth. The phrase assumes that the glory of God is always promoted by manifestation of the truth (compare the marginal references). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Joshua said unto Achan, My son, give … glory to God—a form of adjuration to tell the truth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He seems to make a sincere and ingenuous confession, and loads his sin with all just aggravations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Against the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " against his express command, and just rights, and glorious attributes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord God of Israel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the true God, who hath chosen me and all Israel to be the people of his peculiar love and care. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Achan answered Joshua, and said,.... He made a free and open confession of his sin: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "indeed I have sinned against the Lord God of Israel; against him who had been so good to Israel in many instances, and particularly in delivering Jericho into their hands in so extraordinary a manner; against a law of his, respecting the spoil of that city, which sin was the more aggravated thereby; and that he had committed the sin he was taken for and charged with, he owns was a true and real fact: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and thus and thus have I done; such and such things have I taken, and in the manner as follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and thus and thus have I done; such and such things have I taken, and in the manner as follows. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Achan answered Joshua, and said, Indeed I have sinned against the LORD God of Israel, and thus and thus have I done:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Achan then acknowledge his sin, and confessed that he had appropriated to himself from among the booty a beautiful Babylonish cloak, 200 shekels of silver, and a tongue of gold of 50 shekels weight. The form ואראה is not to be abbreviated into וארא, according to the Keri, as the form is by no means rare in verbs ה.ל \"A Babylonish cloak\" (lit. a cloak of Shinar, or Babylon) is a costly cloak, artistically worked, such as were manufactured in Babylon, and distributed far and wide through the medium of commerce.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Plinius h. n. viii. 48: Colores diversos picturae vestium intexere Babylon maxime celebravit et nomen imposuit. (See Heeren Ideen. i. 2, pp. 205ff., and Movers Phnizier, ii. 3, pp. 258ff.) The Sept. rendering is ψιλή ποικίλη, i.e., a Babylonian cloak ornamented with pictures. It is called ψιλή because it was cut smooth, and ποικίλη because it was covered with coloured figures, either of men or animals, sometimes woven, at other times worked with the needle (Fischer. graec de vers. libr. V. T. pp. 87-8).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Two hundred shekels of silver was about 25. \"A tongue of gold\" (according to Luther, \"ornaments made in the shape of tongues\") was certainly a golden ornament in the form of a tongue, the use of which is unknown; it was of considerable size, as it weighed 50 shekels, i.e., 13,700 grains. It is not necessary to suppose that it was a golden dagger, as many do, simply because the ancient Romans gave the name lingula to an oblong dagger formed in the shape of a tongue. Achan had hidden these things in the ground in the midst of his tent, and the silver \"under it,\" i.e., under these things (the suffix is neuter, and must be understood as referring to all the things with the exception of the silver). The Babylonish cloak and the tongue of gold were probably placed in a chest; at any rate they would be carefully packed up, and the silver was placed underneath. The article in האהלי, which occurs twice, as it also does in Joshua 8:33; Leviticus 27:33; Micah 2:12, is probably to be explained in the manner suggested by Hengstenberg, viz., that the article and noun became so fused into one, that the former lost its proper force. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Two hundred shekels of silver was about 25. \"A tongue of gold\" (according to Luther, \"ornaments made in the shape of tongues\") was certainly a golden ornament in the form of a tongue, the use of which is unknown; it was of considerable size, as it weighed 50 shekels, i.e., 13,700 grains. It is not necessary to suppose that it was a golden dagger, as many do, simply because the ancient Romans gave the name lingula to an oblong dagger formed in the shape of a tongue. Achan had hidden these things in the ground in the midst of his tent, and the silver \"under it,\" i.e., under these things (the suffix is neuter, and must be understood as referring to all the things with the exception of the silver). The Babylonish cloak and the tongue of gold were probably placed in a chest; at any rate they would be carefully packed up, and the silver was placed underneath. The article in האהלי, which occurs twice, as it also does in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 8:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 27:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is probably to be explained in the manner suggested by Hengstenberg, viz., that the article and noun became so fused into one, that the former lost its proper force. ",
            "children": []
          }
        ]
      }
    ]
  }
]