[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-9 The patience of Moses was tried in his own family, as well as by the people. The pretence was, that he had married a foreign wife; but probably their pride was hurt, and their envy stirred up, by his superior authority. Opposition from our near relations, and from religious friends, is most painful. But this is to be looked for, and it will be well if in such circumstances we can preserve the gentleness and meekness of Moses. Moses was thus fitted to the work he was called to. God not only cleared Moses, but praised him. Moses had the spirit of prophecy in a way which set him far above all other prophets; yet he that is least in the kingdom of heaven, is greater than he; and our Lord Jesus infinitely excels him, Heb 3:1. Let Miriam and Aaron consider whom it was they insulted. We have reason to be afraid of saying or doing any thing against the servants of God. And those are presumptuous indeed who are not afraid to speak evil of dignities, 2Pe 2:10. The removal of God's presence is the surest and saddest token of God's displeasure. Woe to us, if he depart! he never departs, till by sin and folly we drive him from us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The man Moses was very meek - In this and in other passages in which Moses no less unequivocally records his own faults (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there is the simplicity of one who bare witness of himself, but not to himself (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The words are inserted to explain how it was that Moses took no steps to vindicate himself, and why consequently the Lord so promptly intervened.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the Lord came down in the pillar of the cloud, and stood the door of the tabernacle—without gaining admission, as was the usual privilege of Aaron, though it was denied to all other men and women. This public exclusion was designed to be a token of the divine displeasure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the door of the tabernacle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where they stood without, not being admitted into the tabernacle, as Aaron used to be; which is noted as a sign of God’s displeasure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord came down in the pillar of the cloud,.... Which was over the most holy place of the tabernacle, and which was a symbol of the presence of the Lord; and who is said to come down, because that was above the tabernacle; whereas he came, as is next expressed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and stood in the door of the tabernacle; where he set up his tribunal, and called them to his bar, courts of judicature being usually held in the gate; not suffering them to go into the tabernacle as they were wont to do, being delinquents: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and called Aaron and Miriam; to come nearer to him, and hear what he had to say to them; Moses keeping at a greater distance, it not being so proper that he should be within hearing of those commendations which were about to be given of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they both came forth; Aaron and Miriam, and stood before the Lord. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they both came forth; Aaron and Miriam, and stood before the Lord. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD came down in the pillar of the cloud, and stood in the door of the tabernacle, and called Aaron and Miriam: and they both came forth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they both came forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. probably from the tent, not from the camp. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. it is said that Moses used habitually to enter the tent, and God talked with him there. The same thing may have occurred in the present case. Aaron and Miriam, in vaunting their claim to equality, imitated the action of Moses and entered with him; and they were then summoned to come forth to hear Jehovah’s oracle. His previous command ‘Come out ye three unto the tent of meeting’ was a challenge to Aaron and Miriam to do as Moses did, and to experience the result. Compare the similar challenge made by Aaron in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. (P ).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord came down in the pillar of the cloud.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The cloud which had been soaring above the tabernacle descended upon it (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Numbers 12:10). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And stood in the door of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the tabernacle.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It would seem most natural to understand by these words the entrance to the holy place itself, and this would manifestly accord best with the movements of the cloud, as here described; for the cloud seems to have sunk down upon the sacred tent in token that the Lord was in some special sense present within it. On the other hand, the phrase must certainly be understood to mean the entrance of the court, or sacred enclosure, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 8:3, 31, 33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and probably in other places. As it is hardly possible that the phrase can have had both meanings, the latter must be preferred. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they both came forth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not out of the sanctuary, into which Miriam could not have entered, but out of the enclosure. The wrath which lay upon them both, and the punishment which was about to be inflicted upon one, were sufficient reasons for calling them out of the holy ground. Numbers 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jehovah summoned the opponents of His servant to come at once before His judgment-seat. He commanded Moses, Aaron, and Miriam suddenly to come out of the camp (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the tabernacle. Then He Himself came down in a pillar of cloud to the door of the tabernacle, i.e., to the entrance to the court, not to the dwelling itself, and called Aaron and Miriam out, i.e., commanded them to come out of the court, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The discrepancy discovered by Knobel, in the fact that, according to the so-called Elohist, no one but Moses, Aaron, and the sons of Aaron were allowed to enter the sanctuary, whereas, according to the Jehovist, others did so, - e.g., Miriam here, and Joshua in Exodus 33:11, - rests entirely upon a groundless fancy, arising from a misinterpretation, as there is not a word about entering the sanctuary, i.e., the dwelling itself, either in the verse before us or in Exodus 33:11.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The discrepancy discovered by Knobel, in the fact that, according to the so-called Elohist, no one but Moses, Aaron, and the sons of Aaron were allowed to enter the sanctuary, whereas, according to the Jehovist, others did so, - e.g., Miriam here, and Joshua in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", - rests entirely upon a groundless fancy, arising from a misinterpretation, as there is not a word about entering the sanctuary, i.e., the dwelling itself, either in the verse before us or in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and said to them (Numbers 12:6.): \"If there is a prophet of Jehovah to you (i.e., if you have one), I make Myself known to him in a vision; I speak to him in a dream (בּו, lit., \"in him,\" inasmuch as a revelation in a dream fell within the inner sphere of the soul-life). Not so My servant Moses: he is approved in My whole house; mouth to mouth I speak to him, and as an appearance, and that not in enigmas; and he sees the form of Jehovah. Why are ye not afraid to speak against My servant, against Moses?\" נביאכם  equals  לכם נביא, the suffix used with the noun instead of the separate pronoun in the dative, as in Genesis 39:21; Leviticus 15:3, etc. The noun Jehovah is in all probability to be taken as a genitive, in connection with the word נביאכם (\"a prophet to you\"), as it is in the lxx and Vulg., and not to be construed with the words which follow (\"I Jehovah will make Myself known\"). The position of Jehovah at the head of the clause without a preceding אנכי (I) would be much more remarkable than the separation of the dependent noun from the governing noun by the suffix, which occurs in other cases also (e.g., Leviticus 6:3; Leviticus 26:42, etc.); moreover, it would be by no means suited to the sense, as no such emphasis is laid upon the fact that it was Jehovah who made Himself known, as to require or even justify such a construction. The \"whole house of Jehovah\" (Numbers 12:7) is not \"primarily His dwelling, the holy tent\" (Baumgarten), - for, in that case, the word \"whole\" would be quite superfluous, - but the whole house of Israel, or the covenant nation regarded as a kingdom, to the administration and government of which Moses had been called: as a matter of fact, therefore, the whole economy of the Old Testament, having its central point in the holy tent, which Jehovah had caused to be built as the dwelling-place of His name. It did not terminate, however, in the service of the sanctuary, as we may see from the fact that god did not make the priests who were entrusted with the duties of the sanctuary the organs of His saving revelation, but raised up and called prophets after Moses for that purpose. Compare the expression in Hebrews 3:6, \"Whose house we are.\" נאמן with בּ does not mean to be, or become, entrusted with anything (Baumgarten, Knobel), but simply to be lasting, firm, constant, in a local or temporal sense (Deuteronomy 28:59; 1 Samuel 2:35; 2 Samuel 7:16, etc.); in a historical sense, to prove or attest one's self (Genesis 42:20); and in an ethical sense, to be found proof, trustworthy, true (Psalm 78:8; 1 Samuel 3:20; 1 Samuel 22:14 : see Delitzsch on Hebrews 3:2). In the participle, therefore, it signifies proved, faithful, πιστός (lxx). \"Mouth to mouth\" answers to the \"face to face\" in Exodus 33:11 (cf. Deuteronomy 34:10), i.e., without any mediation or reserve, but with the same closeness and freedom with which friends converse together (Exodus 33:11). This is still further strengthened and elucidated by the words in apposition, \"in the form of seeing (appearance), and not in riddles,\" i.e., visibly, and not in a dark, hidden, enigmatical way. מראה is an accusative defining the mode, and signifies here not vision, as in Numbers 12:6, but adspectus, view, sight; for it forms an antithesis to בּמּראה in Numbers 12:6. \"The form (Eng. similitude) of Jehovah\" was not the essential nature of God, His unveiled glory, - for this no mortal man can see (vid., Exodus 33:18.), - but a form which manifested the invisible God to the eye of man in a clearly discernible mode, and which was essentially different, not only from the visionary sight of God in the form of a man (Ezekiel 1:26; Daniel 7:9 and Daniel 7:13), but also from the appearances of God in the outward world of the senses, in the person and form of the angel of Jehovah, and stood in the same relation to these two forms of revelation, so far as directness and clearness were concerned, as the sight of a person in a dream to that of the actual figure of the person himself. God talked with Moses without figure, in the clear distinctness of a spiritual communication, whereas to the prophets He only revealed Himself through the medium of ecstasy or dream.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and said to them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".): \"If there is a prophet of Jehovah to you (i.e., if you have one), I make Myself known to him in a vision; I speak to him in a dream (בּו, lit., \"in him,\" inasmuch as a revelation in a dream fell within the inner sphere of the soul-life). Not so My servant Moses: he is approved in My whole house; mouth to mouth I speak to him, and as an appearance, and that not in enigmas; and he sees the form of Jehovah. Why are ye not afraid to speak against My servant, against Moses?\" נביאכם  equals  לכם נביא, the suffix used with the noun instead of the separate pronoun in the dative, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 39:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. The noun Jehovah is in all probability to be taken as a genitive, in connection with the word נביאכם (\"a prophet to you\"), as it is in the lxx and Vulg., and not to be construed with the words which follow (\"I Jehovah will make Myself known\"). The position of Jehovah at the head of the clause without a preceding אנכי (I) would be much more remarkable than the separation of the dependent noun from the governing noun by the suffix, which occurs in other cases also (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.); moreover, it would be by no means suited to the sense, as no such emphasis is laid upon the fact that it was Jehovah who made Himself known, as to require or even justify such a construction. The \"whole house of Jehovah\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is not \"primarily His dwelling, the holy tent\" (Baumgarten), - for, in that case, the word \"whole\" would be quite superfluous, - but the whole house of Israel, or the covenant nation regarded as a kingdom, to the administration and government of which Moses had been called: as a matter of fact, therefore, the whole economy of the Old Testament, having its central point in the holy tent, which Jehovah had caused to be built as the dwelling-place of His name. It did not terminate, however, in the service of the sanctuary, as we may see from the fact that god did not make the priests who were entrusted with the duties of the sanctuary the organs of His saving revelation, but raised up and called prophets after Moses for that purpose. Compare the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Whose house we are.\" נאמן with בּ does not mean to be, or become, entrusted with anything (Baumgarten, Knobel), but simply to be lasting, firm, constant, in a local or temporal sense (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:59",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.); in a historical sense, to prove or attest one's self (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and in an ethical sense, to be found proof, trustworthy, true (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : see Delitzsch on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the participle, therefore, it signifies proved, faithful, πιστός (lxx). \"Mouth to mouth\" answers to the \"face to face\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 34:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., without any mediation or reserve, but with the same closeness and freedom with which friends converse together (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is still further strengthened and elucidated by the words in apposition, \"in the form of seeing (appearance), and not in riddles,\" i.e., visibly, and not in a dark, hidden, enigmatical way. מראה is an accusative defining the mode, and signifies here not vision, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but adspectus, view, sight; for it forms an antithesis to בּמּראה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The form (Eng. similitude) of Jehovah\" was not the essential nature of God, His unveiled glory, - for this no mortal man can see (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), - but a form which manifested the invisible God to the eye of man in a clearly discernible mode, and which was essentially different, not only from the visionary sight of God in the form of a man (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but also from the appearances of God in the outward world of the senses, in the person and form of the angel of Jehovah, and stood in the same relation to these two forms of revelation, so far as directness and clearness were concerned, as the sight of a person in a dream to that of the actual figure of the person himself. God talked with Moses without figure, in the clear distinctness of a spiritual communication, whereas to the prophets He only revealed Himself through the medium of ecstasy or dream.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Through this utterance on the part of Jehovah, Moses is placed above all the prophets, in relation to God and also to the whole nation. The divine revelation to the prophets is thereby restricted to the two forms of inward intuition (vision and dream). It follows from this, that it had always a visionary character, though it might vary in intensity; and therefore that it had always more or less obscurity about it, because the clearness of self-consciousness and the distinct perception of an external world, both receded before the inward intuition, in a dream as well as in a vision. The prophets were consequently simply organs, through whom Jehovah made known His counsel and will at certain times, and in relation to special circumstances and features in the development of His kingdom. It was not so with Moses. Jehovah had placed him over all His house, had called him to be the founder and organizer of the kingdom established in Israel through his mediatorial service, and had found him faithful in His service. With this servant (θεράπων, lxx) of His, He spake mouth to mouth, without a figure or figurative cloak, with the distinctness of a human interchange of thought; so that at any time he could inquire of God and wait for the divine reply. Hence Moses was not a prophet of Jehovah, like many others, not even merely the first and highest prophet, primus inter pares, but stood above all the prophets, as the founder of the theocracy, and mediator of the Old Covenant. Upon this unparalleled relation of Moses to God and the theocracy, so clearly expressed in the verses before us, the Rabbins have justly founded their view as to the higher grade of inspiration in the Thorah. This view is fully confirmed through the history of the Old Testament kingdom of God, and the relation in which the writings of the prophets stand to those of Moses. The prophets subsequent to Moses simply continued to build upon the foundation which Moses laid. And if Moses stood in this unparalleled relation to the Lord, Miriam and Aaron sinned grievously against him, when speaking as they did. Numbers 12:9. After this address, \"the wrath of Jehovah burned against them, and He went.\" As a judge, withdrawing from the judgment-seat when he has pronounced his sentence, so Jehovah went, by the cloud in which He had come down withdrawing from the tabernacle, and ascending up on high. And at the same moment, Miriam, the instigator of the rebellion against her brother Moses, was covered with leprosy, and became white as snow. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Through this utterance on the part of Jehovah, Moses is placed above all the prophets, in relation to God and also to the whole nation. The divine revelation to the prophets is thereby restricted to the two forms of inward intuition (vision and dream). It follows from this, that it had always a visionary character, though it might vary in intensity; and therefore that it had always more or less obscurity about it, because the clearness of self-consciousness and the distinct perception of an external world, both receded before the inward intuition, in a dream as well as in a vision. The prophets were consequently simply organs, through whom Jehovah made known His counsel and will at certain times, and in relation to special circumstances and features in the development of His kingdom. It was not so with Moses. Jehovah had placed him over all His house, had called him to be the founder and organizer of the kingdom established in Israel through his mediatorial service, and had found him faithful in His service. With this servant (θεράπων, lxx) of His, He spake mouth to mouth, without a figure or figurative cloak, with the distinctness of a human interchange of thought; so that at any time he could inquire of God and wait for the divine reply. Hence Moses was not a prophet of Jehovah, like many others, not even merely the first and highest prophet, primus inter pares, but stood above all the prophets, as the founder of the theocracy, and mediator of the Old Covenant. Upon this unparalleled relation of Moses to God and the theocracy, so clearly expressed in the verses before us, the Rabbins have justly founded their view as to the higher grade of inspiration in the Thorah. This view is fully confirmed through the history of the Old Testament kingdom of God, and the relation in which the writings of the prophets stand to those of Moses. The prophets subsequent to Moses simply continued to build upon the foundation which Moses laid. And if Moses stood in this unparalleled relation to the Lord, Miriam and Aaron sinned grievously against him, when speaking as they did. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". After this address, \"the wrath of Jehovah burned against them, and He went.\" As a judge, withdrawing from the judgment-seat when he has pronounced his sentence, so Jehovah went, by the cloud in which He had come down withdrawing from the tabernacle, and ascending up on high. And at the same moment, Miriam, the instigator of the rebellion against her brother Moses, was covered with leprosy, and became white as snow. ",
            "children": []
          }
        ]
      }
    ]
  }
]