[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unto men, whom I know not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—In other words, “Shall I give largesse to the enemies of my king—to a band of rebel freebooters?”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My water.—The LXX., instead of “water,” read “wine.” This is one of the countless alterations this version arbitrarily makes in the original sacred text. The Greek translators were puzzled at Nabal’s enumeration of “water” as one of the demands of David. Its mention, however, is a mark of the accuracy of the record. Water in many parts of the East is exceedingly precious. The words of Joshua 15:19 clearly indicate the especial want of this district of Palestine, when Caleb’s daughter Achsah specially prayed her father for springs of water. Its mention, however, can scarcely, as Dean Payne Smith observes, “mark the abstemious habits of the people,” considering in the same chapter we find the owner of all these flocks prostrate through intoxication.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "My water.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The LXX., instead of “water,” read “wine.” This is one of the countless alterations this version arbitrarily makes in the original sacred text. The Greek translators were puzzled at Nabal’s enumeration of “water” as one of the demands of David. Its mention, however, is a mark of the accuracy of the record. Water in many parts of the East is exceedingly precious. The words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clearly indicate the especial want of this district of Palestine, when Caleb’s daughter Achsah specially prayed her father for springs of water. Its mention, however, can scarcely, as Dean Payne Smith observes, “mark the abstemious habits of the people,” considering in the same chapter we find the owner of all these flocks prostrate through intoxication.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:2-11 We should not have heard of Nabal, if nothing had passed between him and David. Observe his name, Nabal, A fool; so it signifies. Riches make men look great in the eye of the world; but to one that takes right views, Nabal looked very mean. He had no honour or honesty; he was churlish, cross, and ill-humoured; evil in his doings, hard and oppressive; a man that cared not what fraud and violence he used in getting and saving. What little reason have we to value the wealth of this world, when so great a churl as Nabal abounds, and so good a man as David suffers want!, David pleaded the kindness Nabal's shepherds had received. Considering that David's men were in distress and debt, and discontented, and the scarcity of provisions, it was by good management that they were kept from plundering. Nabal went into a passion, as covetous men are apt to do, when asked for any thing, thinking thus to cover one sin with another; and, by abusing the poor, to excuse themselves from relieving them. But God will not thus be mocked. Let this help us to bear reproaches and misrepresentations with patience and cheerfulness, and make us easy under them; it has often been the lot of the excellent ones of the earth. Nabal insists much on the property he had in the provisions of his table. May he not do what he will with his own? We mistake, if we think we are absolute lords of what we have, and may do what we please with it. No; we are but stewards, and must use it as we are directed, remembering it is not our own, but His who intrusted us with it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The mention of water indicates a country where water was scarce (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Or \"bread and water\" may be equivalent to \"meat and drink.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 25:10-13. The Churlish Answer Provokes Him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10-12. Nabal answered David's servants, … Who is David? &c.—Nabal's answer seems to indicate that the country was at the time in a loose and disorderly state. David's own good conduct, however, as well as the important services rendered by him and his men, were readily attested by Nabal's servants. The preparations of David to chastise his insolent language and ungrateful requital are exactly what would be done in the present day by Arab chiefs, who protect the cattle of the large and wealthy sheep masters from the attacks of the marauding border tribes or wild beasts. Their protection creates a claim for some kind of tribute, in the shape of supplies of food and necessaries, which is usually given with great good will and gratitude; but when withheld, is enforced as a right. Nabal's refusal, therefore, was a violation of the established usages of the place.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My water; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he speaketh thus, either because in those hot and dry parts water was scarce and precious; or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here put for any kind of drink, as bread is oft taken for all sorts of meat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall I then take my bread, and my water,.... Which include all food and liquors, everything eatable and drinkable; and \"water\" may be particularly mentioned, because very scarce in the wilderness, and so precious; though the Septuagint version has \"wine\" instead of \"water\": ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and my flesh which I have killed for my shearers; whether oxen, or sheep, or lambs, as there might be of each sort, for an entertainment made on such an occasion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and give it unto men whom I know not whence they be? which is another argument Abarbinel makes use of that he meant not David, but his men only, because he did not know who and from whence they were. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and give it unto men whom I know not whence they be? which is another argument Abarbinel makes use of that he meant not David, but his men only, because he did not know who and from whence they were. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall I then take my bread, and my water, and my flesh that I have killed for my shearers, and give it unto men, whom I know not whence they be?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Perhaps water is specially mentioned because it is scarce in the district. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Sept. however has “wine.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And I should take my bread and my water (i.e., my food and drink), and my cattle, ... and give them to men whom I do not know whence they are?\" ולקחתּי is a perfect with vav consec., and the whole sentence is to be taken as a question.",
        "children": []
      }
    ]
  }
]