[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 25:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This was another instance of human infirmity in David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David sent — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But this doubtless was not done immediately after Nabal’s death, but some time after it; though such circumstances be commonly omitted in the sacred history, which gives only the heads and most important passages of things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:39-44 Abigail believed that David would be king over Israel, and greatly esteemed his pious and excellent character. She deemed his proposal of marriage honourable, and advantageous to her, notwithstanding his present difficulties. With great humility, and doubtless agreeably to the customs of those times, she consented, being willing to share his trails. Thus those who join themselves to Christ, must be willing now to suffer with him, believing that hereafter they shall reign with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He became as a stone - Probably his violent anger at hearing it brought on a fit of apoplexy to which he was disposed by the drunken revel of the night before. After lying senseless for ten days he died. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39-42. the Lord hath returned the wickedness of Nabal upon his own head—If this was an expression of pleasure, and David's vindictive feelings were gratified by the intelligence of Nabal's death, it was an instance of human infirmity which we may lament; but perhaps he referred to the unmerited reproach (1Sa 25:10, 11), and the contempt of God implied in it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "David sent and communed with Abigail, to take her to wife—This unceremonious proceeding was quite in the style of Eastern monarchs, who no sooner take a fancy for a lady than they despatch a messenger to intimate their royal wishes that she should henceforth reside in the palace; and her duty is implicitly to obey. David's conduct shows that the manners of the Eastern nations were already imitated by the great men in Israel; and that the morality of the times which God permitted, gave its sanction to the practice of polygamy. His marriage with Abigail brought him a rich estate.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " How could David rejoice at the death of his enemy? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Although it may be said that he rejoiced not in Nabal’s death as such, but only in the declaration of God’s justice in punishing so great a wickedness; which was an honour to God, and a document, and therefore a benefit to mankind, and so a public good, and cause of joy; yet the matter is not weighty, if we confess that this was another instance of human infirmity in David, and that it is not proposed for our imitation, but for our caution. Yet it may be further said, that this was not purely an act of private revenge, because David was a public person, and anointed king; and therefore Nabal’s reproach cast upon David above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 25:10,11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", was a contempt of God, and of his ordinance and appointment; which was vindicated by this remarkable judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hath kept his servant from evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. from the sin of bloodshed and self-revenge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 25:33",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David sent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, messengers; which he thought fitter than to go himself; partly because if he had met with a repulse, it had been less ignominious; and partly because he would leave her to her freedom and choice, and would not so much as seem to take her by violence. But this doubtless was not done immediately after Nabal’s death, but in some convenient space of time after it; though such circumstances be commonly omitted in the sacred history, which gives only the threads and most important passages of things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when David heard that Nabal was dead,.... As he soon might, Maon and Carmel not being far from the wilderness where David was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he said, blessed be the Lord, that hath pleaded the cause of my reproach from the hand of Nabal; not that he rejoiced at the death of Nabal, simply considered, or from a private spirit of revenge; but because of the glory of divine justice, which he had shown to him in vindicating him from the reproach Nabal had cast upon him, and particularly was thankful for what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and hath kept his servant from evil; from slaying Nabal with his own hand, and doing hurt to his family: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord hath returned the wickedness of Nabal upon his own head; and upon no other, none of his family suffered but himself, and which was another cause of thankfulness to David; had he been suffered to have done as he in his wrath determined, not only Nabal, but all the males in his house, had been cut off; but now, through the righteous judgment of God, only Nabal suffered, and not any of his family: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and David sent and communed with Abigail; by his messengers to her; or \"concerning\" her (h), about marrying her: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to take her to him to wife; for being both a beautiful and wise woman, he thought her a proper person to be his wife; which she might lawfully become, Nabal being dead, and Michal, David's wife, being taken from him, and given to another man, with whom she lived in adultery; or as divorced by David, as the Jews say, David by the law of God was free from her. These messengers were sent by David at a convenient time, at a proper distance from the death of Nabal; and he chose rather to send messengers than to go himself, lest being denied he should be put to shame, she being a rich widow, and he a poor persecuted man, and that her answer might be entirely free and unawed by him, and that it might appear that she was not taken to him by force; and besides, such a method has been always reckoned most honourable with great personages. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) , Sept. \"de Abigail\", Vatabulus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) , Sept. \"de Abigail\", Vatabulus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when David heard that Nabal was dead, he said, Blessed be the LORD, that hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil: for the LORD hath returned the wickedness of Nabal upon his own head. And David sent and communed with Abigail, to {s} take her to him to wife.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when David heard that Nabal was dead, he said, Blessed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD, that hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil: for the LORD hath returned the wickedness of Nabal upon his own head. And David sent and communed with Abigail, to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " take her to him to wife.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) For he had experienced her great godliness, wisdom and humility.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39–44. David’s marriage with Abigail",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pleaded the cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Exacted from Nabal a due penalty for the injury he did me. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In those days godly men looked for visible judgments upon the wicked in this world, and rejoiced in them as a vindication of God’s righteous government.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath kept his servant from evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The E. V. misses the striking contrast between David and Nabal. Render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "hath restrained his servant from wickedness, but the wickedness of Nabal hath Jehovah returned upon his own head.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 39-42.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hath pleaded the cause of my reproach.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In the causes tried at the gate of an Israelite city the friends of the accused both pleaded his cause, defended him from wrong, and punished any who had wronged him. So God had avenged David, while preventing him by Abigail s interference from avenging himself (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As a widow's legal mourning seems to have lasted only seven days, David, on hearing of Nabal's death, sent messengers to Abigail at Carmel to ask her in marriage. He was probably moved to this not merely by her sensible conduct, but also by the news that Michal had been given to another. She expresses her willingness in true Oriental fashion by saying she was ready to perform the most abject menial duties, even for his servants, and at once with five maidens proceeds to join him. It is a proof that David considered himself practically secure against Saul's attempts that he thus married and allowed women to accompany his small force, as their presence would not only impede the rapidity of his movements, but also implies a certain amount of case and comfort for their maintenance. ADDITIONAL PARTICULARS RESPECTING DAVID'S MARRIED Life (vers. 43, 44). 1 Samuel 25:39",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When David heard of Nabal's death, he praised Jehovah that He had avenged his shame upon Nabal, and held him back from self-revenge. וגו רב עשׁר, \"who hath pleaded the cause of my reproach (the disgrace inflicted upon me) against Nabal.\" \"Against Nabal\" does not belong to \"my reproach,\" but to \"pleaded the cause.\" The construction of ריב with מן is a pregnant one, to fight (and deliver) out of the power of a person (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); whereas here the fundamental idea is that of taking vengeance upon a person.",
        "children": []
      }
    ]
  }
]