[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:39-44 Abigail believed that David would be king over Israel, and greatly esteemed his pious and excellent character. She deemed his proposal of marriage honourable, and advantageous to her, notwithstanding his present difficulties. With great humility, and doubtless agreeably to the customs of those times, she consented, being willing to share his trails. Thus those who join themselves to Christ, must be willing now to suffer with him, believing that hereafter they shall reign with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is no note of the exact interval that elapsed between Nabal's death and David's hearing of it, or, again, between David's hearing of it and his message to Abigail; nor is there any reason to suppose that the marriage took place with unbecoming haste. The widow of such a husband as Nabal had been could not, however, be expected to revere his memory. After the usual mourning of seven days, she would probably feel herself free to act as custom allowed. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39-42. the Lord hath returned the wickedness of Nabal upon his own head—If this was an expression of pleasure, and David's vindictive feelings were gratified by the intelligence of Nabal's death, it was an instance of human infirmity which we may lament; but perhaps he referred to the unmerited reproach (1Sa 25:10, 11), and the contempt of God implied in it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "David sent and communed with Abigail, to take her to wife—This unceremonious proceeding was quite in the style of Eastern monarchs, who no sooner take a fancy for a lady than they despatch a messenger to intimate their royal wishes that she should henceforth reside in the palace; and her duty is implicitly to obey. David's conduct shows that the manners of the Eastern nations were already imitated by the great men in Israel; and that the morality of the times which God permitted, gave its sanction to the practice of polygamy. His marriage with Abigail brought him a rich estate.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She went after the messengers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not immediately, but some convenient time after they were gone. She considered not David’s present straits and penury, which site thought her plentiful estate might supply; nor his danger from Saul; but by a true and strong faith rested upon God’s promise made to David, not doubting but God would perform it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Abigail hasted and arose,.... She had no objection nor hesitation in her mind about marrying David but at once consented, and immediately prepared for her journey, having as high an opinion, and as great an esteem of David, as he of her; and though she was rich and he peer this was no obstacle in the way, she knew and believed he would be king of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and though he could not support her, she had enough to support herself, and supply him, till he came to the throne: and ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "rode upon an ass, with five damsels of hers that went after her; whom she took with her, partly to wait upon her, and partly for her honour, and the honour of David, whom she was going to marry: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and she went after the messengers of David: not following them directly, but some time after they were gone; partly for the sake of decency, and partly that they going before might acquaint David with the success of their message, and he might prepare to receive Abigail when she came: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and became his wife; he espoused and married her according to the custom of the times. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and became his wife; he espoused and married her according to the custom of the times. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Abigail hasted, and arose and rode upon an ass, with five damsels of hers that went after her; and she went after the messengers of David, and became his wife.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "She then rose up hastily, and went after the messengers to David with five damsels in her train, and became his wife.",
        "children": []
      }
    ]
  }
]