[{"header":"Moses on Sinai"},{"num":19,"verse":"In the third month after the children of Israel had left the land of Egypt, the very same day, they came into the Wilderness of Sinai. "},{"num":2,"verse":"When they moved out from Rephidim, they came to the Wilderness of Sinai and they camped there; Israel camped at the base of the mountain [of Sinai]. "},{"num":3,"verse":"Moses went up to God [on the mountain], and the Lord called to him from the mountain, saying, “Say this to the house of Jacob and tell the Israelites: "},{"num":4,"verse":"‘You have seen what I did to the Egyptians, and how I carried you on eagles’ wings, and brought you to Myself. "},{"num":5,"verse":"Now therefore, if you will in fact obey My voice and keep My covenant (agreement), then you shall be My own special possession and treasure from among all peoples [of the world], for all the earth is Mine; "},{"num":6,"verse":"and you shall be to Me a kingdom of priests and a holy nation [set apart for My purpose].’ These are the words that you shall speak to the Israelites.”"},{"num":7,"verse":"So Moses called for the elders of the people, and told them all these words which the Lord commanded him. "},{"num":8,"verse":"All the people answered together and said, “We will do everything that the Lord has spoken.” And Moses reported the words of the people to the Lord. "},{"num":9,"verse":"The Lord said to Moses, “Behold, I will come to you in a thick cloud, so that the people may hear when I speak with you and may believe and trust in you forever.” Then Moses repeated the words of the people to the Lord."},{"num":10,"verse":"The Lord also said to Moses, “Go to the people and consecrate them today and tomorrow [that is, prepare them for My sacred purpose], and have them wash their clothes "},{"num":11,"verse":"and be ready by the third day, because on the third day the Lord will come down on Mount Sinai [in the cloud] in the sight of all the people. "},{"num":12,"verse":"You shall set barriers for the people all around [the mountain], saying, ‘Beware that you do not go up on the mountain or touch its border; whoever touches the mountain must be put to death. "},{"num":13,"verse":"No hand shall touch him [that is, no one shall try to save the guilty party], but the offender must be stoned or shot through [with arrows]; whether man or animal [that touches the mountain], he shall not live.’ When the ram’s horn sounds a long blast, they shall come up to the mountain.” "},{"num":14,"verse":"So Moses went down from the mountain to the people and sanctified them [for God’s sacred purpose], and they washed their clothes. "},{"num":15,"verse":"He said to the people, “Be prepared for the third day; do not be intimate with a woman.”"},{"num":16,"verse":"So it happened on the third day, when it was morning, that there were thunder and flashes of lightning, and a thick cloud was on the mountain, and a very loud blast was sounded on a ram’s horn, so that all the people who were in the camp trembled. "},{"num":17,"verse":"Then Moses brought the people out of the camp to meet God, and they stood and presented themselves at the foot of the mountain."},{"header":"The Lord Visits Sinai"},{"num":18,"verse":"Mount Sinai was wrapped in smoke because the Lord descended upon it in fire; its smoke ascended like the smoke of a furnace, and the whole mountain quaked violently. "},{"num":19,"verse":"And it happened, as the blast of the ram’s horn grew louder and louder, Moses spoke and God answered him with [a voice of] thunder. "},{"num":20,"verse":"The Lord came down on Mount Sinai, to the top of the mountain; and the Lord called Moses to the top of the mountain, and he went up. "},{"num":21,"verse":"Then the Lord spoke to Moses, “Go down, warn the people, so that they do not break through [the barriers around the mountain] to the Lord to see [Me], and many of them perish [as a result]. "},{"num":22,"verse":"Also have the priests who approach the Lord consecrate (sanctify, set apart) themselves [for My sacred purpose], or else the Lord will break forth [in judgment] against them [and destroy them].” "},{"num":23,"verse":"Moses said to the Lord, “The people cannot come up to Mount Sinai, because You warned us, saying, ‘Set barriers around the mountain and consecrate it.’” "},{"num":24,"verse":"Then the Lord said to him, “Go down and come up again, you and Aaron with you; but do not let the priests and the people break through [the barriers] to come up to the Lord, or He will break forth [in judgment] against them [and destroy them].” "},{"num":25,"verse":"So Moses went down to the people and told them [again about God’s warning]."}]