[{"num":19,"verse":"1 The Israelites come to Sinai. 5 Israel is chosen from among all other nations. 8 The people promise to obey God. 12 He that toucheth the hill, dieth. 16 God appeareth unto Moses upon the mount in thunder and lightning."},{"num":1,"verse":"In the third month, after the children of Israel were gone out of the land of Egypt, the same day came they into the wilderness of Sinai."},{"num":2,"verse":"For they departed from Rephidim, and came to the desert of Sinai, and camped in the wilderness, even there Israel camped before the mount."},{"num":3,"verse":"But Moses went up unto God, for the Lord had called out of the mount unto him, saying, Thus shalt thou say to the house of Jacob, and tell the children of Israel."},{"num":4,"verse":"Ye have seen what I did unto the Egyptians, and how I carried you upon eagle’s wings, and have brought you unto me."},{"num":5,"verse":"Now therefore if ye will hear my voice indeed, and keep my covenant, then ye shall be my chief treasure above all people, though all the earth be mine."},{"num":6,"verse":"Ye shall be unto me also a kingdom of Priests, and an holy nation. These are the words which thou shalt speak unto the children of Israel."},{"num":7,"verse":"¶ Moses then came and called for the Elders of the people, and proposed unto them all these things, which the Lord commanded him."},{"num":8,"verse":"And the people answered all together, and said, All that the Lord hath commanded, we will do. And Moses reported the words of the people unto the Lord."},{"num":9,"verse":"And the Lord said unto Moses, Lo, I come unto thee in a thick cloud, that the people may hear while I talk with thee, and that they may also believe thee forever. (For Moses had told the words of the people unto the Lord.)"},{"num":10,"verse":"Moreover the Lord said unto Moses, Go to the people, and sanctify them today and tomorrow, and let them wash their clothes."},{"num":11,"verse":"And let them be ready on the third day: for the third day the Lord will come down in the sight of all the people upon mount Sinai:"},{"num":12,"verse":"And thou shalt set marks unto the people round about, saying, Take heed to yourselves, that ye go not up to the mount, nor touch the border of it, whosoever toucheth the mount, shall surely die."},{"num":13,"verse":"No hand shall touch it, but he shall be stoned to death, or stricken through with darts: whether it be beast or man, he shall not live: when the horn bloweth long, they shall come up into the mountain."},{"num":14,"verse":"¶ Then Moses went down from the mount unto the people, and sanctified the people, and they washed their clothes."},{"num":15,"verse":"And he said unto the people, Be ready on the third day, and come not at your wives."},{"num":16,"verse":"And the third day, when it was morning, there was thunders and lightnings, and a thick cloud upon the mount, and the sound of the trumpet exceeding loud, so that all the people that was in the camp was afraid."},{"num":17,"verse":"Then Moses brought the people out of the tents to meet with God, and they stood in the nether part of the mount."},{"num":18,"verse":"And mount Sinai was all on smoke, because the Lord came down upon it in fire, and the smoke thereof ascended, as the smoke of a furnace, and all the mount trembled exceedingly."},{"num":19,"verse":"And when the sound of the trumpet blew long, and waxed louder and louder, Moses spake, and God answered him by voice."},{"num":20,"verse":"(For the Lord came down upon mount Sinai on the top of the mount) and when the Lord called Moses up into the top of the mount, Moses went up."},{"num":21,"verse":"Then the Lord said unto Moses, Go down, charge the people, that they break not their bounds, to go up to the Lord to gaze, lest many of them perish."},{"num":22,"verse":"And let the Priests also which come to the Lord be sanctified, lest the Lord destroy them."},{"num":23,"verse":"And Moses said unto the Lord, The people cannot come up into the mount Sinai: for thou hast charged us, saying, Set marks on the mountain, and sanctify it."},{"num":24,"verse":"And the Lord said unto him, Go, get thee down, and come up thou, and Aaron with thee: but let not the Priests and the people break their bounds to come up unto the Lord, lest he destroy them."},{"num":25,"verse":"So Moses went down unto the people, and told them."}]