[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Strange land.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The feeling expressed in this question is too natural to need any such explanation as that it was contrary to the Law to sing a sacred song in a strange land. Nehemiah’s answer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") offers a direct illustration.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of Jerusalem’s choir in Babylon it might truly be said:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Like strangers’ voices here they sound,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In lands where not a memory strays.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor landmark breathes of other days,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But all is new unhallowed ground.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "TENNYSON: In Mcmoriam.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "TENNYSON: ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "In Mcmoriam.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 137:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How shall we sing the Lord’s song — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Those sacred songs which are appropriated to the worship of the true God in his temple, and are appointed by him to be sung only to his honour and in his service; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in a strange land — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When we are banished from our own temple and country, and among those who are strangers and enemies to our God and his worship? How can you imagine that miserable slaves should be disposed to sing songs of joy? Or that we can frame our minds in the land where we are exiles, to sing those songs which recount the mercies of God unto us in our once flourishing country. How, indeed, says Dr. Horne, “could they tune their voices to festive and eucharistic strains, when God, by punishing them for their sins, called to mourning and weeping? But then Israel in Babylon foresaw a day of redemption; and so doth the church in the world; a day when she shall triumph, and her enemies shall lick the dust. No circumstances, therefore, should make us forget her and the promises concerning her.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "137:1-4 Their enemies had carried the Jews captive from their own land. To complete their woes, they insulted over them; they required of them mirth and a song. This was very barbarous; also profane, for no songs would serve but the songs of Zion. Scoffers are not to be compiled with. They do not say, How shall we sing, when we are so much in sorrow? but, It is the Lord's song, therefore we dare not sing it among idolaters.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How shall we sing the Lord's song - The song designed to celebrate his praise; that is, appropriate to the worship of Yahweh.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In a strange land - Far from our home; far from the temple; exiles; captives: how can we find spirit in such circumstances to sing? How can we do that which would be indicative of what we do not feel, and cannot feel - joy and happiness! The idea is not that those psalms or songs would be profaned by being sung there, or that there would be anything improper in itself in singing them, but that it would be misplaced and incongruous to sing them in their circumstances. It would be doing violence to their own feelings; their feelings would not allow them to do it. There are states of mind when the language of joy is appropriate and natural; there are states where the heart is so sad that it cannot sing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In a strange land - Far from our home; far from the temple; exiles; captives: how can we find spirit in such circumstances to sing? How can we do that which would be indicative of what we do not feel, and cannot feel - joy and happiness! The idea is not that those psalms or songs would be profaned by being sung there, or that there would be anything improper in itself in singing them, but that it would be misplaced and incongruous to sing them in their circumstances. It would be doing violence to their own feelings; their feelings would not allow them to do it. There are states of mind when the language of joy is appropriate and natural; there are states where the heart is so sad that it cannot sing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. Whether the request was in curiosity or derision, the answer intimates that a compliance was incongruous with their mournful feelings (Pr 25:20).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord’s song; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those songs which were appointed by God, and to be sung only to his honour and in his service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In a strange land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; when we are banished from our own temple and land, and amongst those who are strangers and enemies to God and to his worship. So we should prostitute and profane God’s ordinances. And this answer they either expressed to their enemies, or kept in their own breasts when they refused to comply with their desire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How shall we sing the Lord's song in a strange land? This is the answer returned by the Jews to the above request or demand; it may be, particularly, by the Levites, whose business it was to sing these songs: so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"immediately the Levites said, how shall we sing the hymns of the Lord in a strange land?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This they said, not merely on account of their unsuitable circumstances, being in distress and affliction, and so not disposed for such work; nor as if unlawful to them, being forbidden: for, though sacrifices were not to be offered but at Jerusalem, yet songs of praise might be sung elsewhere, on proper occasions, as David did, Psalm 18:49; but as wondering at their insolence, and complaining of their cruelty and inhumanity, thus to insult them and jeer at them: or rather, because it was \"the Lord's song\" they required, and so sacred, and not to be sung in any place, or at any time, and in any company; which would be but casting pearls before swine, and giving that which was holy to dogs, Matthew 7:6; or it may be they required this to be done in one of their temples, and to their idols, just as these songs were sung in the temple at Jerusalem, and to the honour of Jehovah; and therefore they refused to do it: for it may be rendered, or however interpreted, \"in the land of a strange god\" (c); as it is by Aben Ezra, Kimchi, and Ben Melech: they required them to sing with mirth and joy, which they could not do in their present case; see Psalm 137:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This they said, not merely on account of their unsuitable circumstances, being in distress and affliction, and so not disposed for such work; nor as if unlawful to them, being forbidden: for, though sacrifices were not to be offered but at Jerusalem, yet songs of praise might be sung elsewhere, on proper occasions, as David did, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but as wondering at their insolence, and complaining of their cruelty and inhumanity, thus to insult them and jeer at them: or rather, because it was \"the Lord's song\" they required, and so sacred, and not to be sung in any place, or at any time, and in any company; which would be but casting pearls before swine, and giving that which was holy to dogs, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or it may be they required this to be done in one of their temples, and to their idols, just as these songs were sung in the temple at Jerusalem, and to the honour of Jehovah; and therefore they refused to do it: for it may be rendered, or however interpreted, \"in the land of a strange god\" (c); as it is by Aben Ezra, Kimchi, and Ben Melech: they required them to sing with mirth and joy, which they could not do in their present case; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c)   \"in terra peregina, sc. Dei\", Muis, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c)   \"in terra peregina, sc. Dei\", Muis, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "How shall we sing the LORD's song in a strange land?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4–6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The exiles indignantly repudiate the idea of doing what would be treason to the memories of Zion. The protest is dramatically expressed in the words which they would have used at the time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "How shall we sing the Lord's song in a strange land?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"songs of Zion\" are Jehovah's songs, used in his worship, suited only for religious occasions. It would be desecration to sing them \"in a strange land,\" among strange people, not to call forth devotional sentiment, but to gratify curiosity. Psalm 137:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Beginning with perfects, the Psalm has the appearance of being a Psalm not belonging to the Exile, but written in memory of the Exile. The bank of a river, like the seashore, is a favourite place of sojourn of those whom deep grief drives forth from the bustle of men into solitude. The boundary line of the river gives to solitude a safe back; the monotonous splashing of the waves keeps up the dull, melancholy alternation of thoughts and feelings; and at the same time the sight of the cool, fresh water exercises a soothing influence upon the consuming fever within the heart. The rivers of Babylon are here those of the Babylonian empire: not merely the Euphrates with its canals, and the Tigris, but also the Chaboras (Chebar) and Eulaeos ('Ulai), on whose lonesome banks Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Daniel (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") beheld divine visions. The שׁם is important: there, in a strange land, as captives under the dominion of the power of the world. And גּם is purposely chosen instead of ו: with the sitting down in the solitude of the river's banks weeping immediately came on; when the natural scenery around contrasted so strongly with that of their native land, the remembrance of Zion only forced itself upon them all the more powerfully, and the pain at the isolation from their home would have all the freer course where no hostilely observant eyes were present to suppress it. The willow (צפצפה) and viburnum, those trees which are associated with flowing water in hot low-lying districts, are indigenous in the richly watered lowlands of Babylonia. ערב (ערבה), if one and the same with Arab. grb, is not the willow, least of all the weeping-willow, which is called ṣafsâf mustahı̂ in Arabic, \"the bending-down willow,\" but the viburnum with dentate leaves, described by Wetzstein on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Talmud even distinguishes between tsaph-tsapha and ‛araba, but without our being able to obtain any sure botanic picture from it. The ערבה, whose branches belong to the constituents of the lulab of the Feast of Tabernacles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is understood of the crack-willow [Salix fragilis], and even in the passage before us is surely not distinguished with such botanical precision but that the gharab and willow together with the weeping-willow (Salix Babylonica) might be comprehended under the word ערבה. On these trees of the country abounding in streams the exiles hung their citherns. The time to take delight in music was past, for μουσικὰ ἐν πένθει ἄκαιρος διήγησις, Sir. 22:6. Joyous songs, as the word שׁיר designates them, were ill suited to their situation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In order to understand the כּי in Psalm 137:3, Psalm 137:3 and Psalm 137:4 must be taken together. They hung up their citherns; for though their lords called upon them to sing in order that they might divert themselves with their national songs, they did not feel themselves in the mind for singing songs as they once resounded at the divine services of their native land. The lxx, Targum, and Syriac take תּוללינוּ as a synonym of שׁובינוּ, synonymous with שׁוללינוּ, and so, in fact, that it signifies not, like שׁולל, the spoiled and captive one, but the spoiler and he who takes other prisoners. But there is no Aramaic תּלל  equals  שׁלל. It might more readily be referred back to a Poel תּולל ( equals  התל), to disappoint, deride (Hitzig); but the usage of the language does not favour this, and a stronger meaning for the word would be welcome. Either תּולל  equals  תּהולל, like מהולל, Psalm 102:9, signifies the raving one, i.e., a bloodthirsty man or a tyrant, or from ילל, ejulare, one who causes the cry of woe or a tormentor, - a signification which commends itself in view of the words תּושׁב and תּלמיד, which are likewise formed with the preformative ת. According to the sense the word ranks itself with an Hiph. הוליל, like תּועלת, תּוכחה, with הועיל and הוכיח, in a mainly abstract signification (Dietrich, Abhandlungen, S. 160f.). The דּברי beside שׁיר is used as in Psalm 35:20; Psalm 65:4; Psalm 105:27; Psalm 145:5, viz., partitively, dividing up the genitival notion of the species: words of songs as being parts or fragments of the national treasury of song, similar to משּׁיר a little further on, on which Rosenmller correctly says: sacrum aliquod carmen ex veteribus illis suis Sionicis. With the expression \"song of Zion\" alternates in Psalm 137:4 \"song of Jahve,\" which, as in 2 Chronicles 29:27, cf. 1 Chronicles 25:7, denotes sacred or liturgical songs, that is to say, songs belonging to Psalm poesy (including the Cantica).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In order to understand the כּי in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must be taken together. They hung up their citherns; for though their lords called upon them to sing in order that they might divert themselves with their national songs, they did not feel themselves in the mind for singing songs as they once resounded at the divine services of their native land. The lxx, Targum, and Syriac take תּוללינוּ as a synonym of שׁובינוּ, synonymous with שׁוללינוּ, and so, in fact, that it signifies not, like שׁולל, the spoiled and captive one, but the spoiler and he who takes other prisoners. But there is no Aramaic תּלל  equals  שׁלל. It might more readily be referred back to a Poel תּולל ( equals  התל), to disappoint, deride (Hitzig); but the usage of the language does not favour this, and a stronger meaning for the word would be welcome. Either תּולל  equals  תּהולל, like מהולל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 102:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", signifies the raving one, i.e., a bloodthirsty man or a tyrant, or from ילל, ejulare, one who causes the cry of woe or a tormentor, - a signification which commends itself in view of the words תּושׁב and תּלמיד, which are likewise formed with the preformative ת. According to the sense the word ranks itself with an Hiph. הוליל, like תּועלת, תּוכחה, with הועיל and הוכיח, in a mainly abstract signification (Dietrich, Abhandlungen, S. 160f.). The דּברי beside שׁיר is used as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 65:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", viz., partitively, dividing up the genitival notion of the species: words of songs as being parts or fragments of the national treasury of song, similar to משּׁיר a little further on, on which Rosenmller correctly says: sacrum aliquod carmen ex veteribus illis suis Sionicis. With the expression \"song of Zion\" alternates in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"song of Jahve,\" which, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 29:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 25:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", denotes sacred or liturgical songs, that is to say, songs belonging to Psalm poesy (including the Cantica).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Before Psalm 137:4 we have to imagine that they answered the request of the Babylonians at that time in the language that follows, or thought thus within themselves when they withdrew themselves from them. The meaning of the interrogatory exclamation is not that the singing of sacred songs in a foreign land (חוצה לארץ) is contrary to the law, for the Psalms continued to be sung even during the Exile, and were also enriched by new ones. But the shir had an end during the Exile, in so far as that it was obliged to retire from publicity into the quiet of the family worship and of the houses of prayer, in order that that which is holy might not be profaned; and since it was not, as at home, accompanied by the trumpets of the priests and the music of the Levites, it became more recitative than singing properly so called, and therefore could not afford any idea of the singing of their native land in connection with the worship of God on Zion. From the striking contrast between the present and the former times the people of the Exile had in fact to come to the knowledge of their sins, in order that they might get back by the way of penitence and earnest longing to that which they had lost Penitence and home-sickness were at that time inseparable; for all those in whom the remembrance of Zion was lost gave themselves over to heathenism and were excluded from the redemption. The poet, translated into the situation of the exiles, and arming himself against the temptation to apostasy and the danger of denying God, therefore says: If I forget thee, O Jerusalem, ימיני תּשׁכּח. תּשׁכּח has been taken as an address to Jahve: obliviscaris dexterae meae (e.g., Wolfgang Dachstein in his song \"An Wasserflssen Babylon\"), but it is far from natural that Jerusalem and Jahve should be addressed in one clause. Others take ימיני as the subject and תּשׁכּח transitively: obliviscatur dextera mea, scil. artem psallendi (Aben-Ezra, Kimchi, Pagninus, Grotius, Hengstenberg, and others); but this ellipsis is arbitrary, and the interpolation of מנּי after ימיני (von Ortenberg, following Olshausen) produces an inelegant cadence. Others again assign a passive sense to תשׁכח: oblivioni detur (lxx, Italic, Vulgate, and Luther), or a half-passive sense, in oblivione sit (Jerome); but the thought: let my right hand be forgotten, is awkward and tame. Obliviscatur me (Syriac, Saadia, and the Psalterium Romanum) comes nearer to the true meaning. תּשׁכּח is to be taken reflexively: obliviscatur sui ipsius, let it forget itself, or its service (Amyraldus, Schultens, Ewald, and Hitzig), which is equivalent to let it refuse or fail, become lame, become benumbed, much the same as we say of the arms of legs that they \"go to sleep,\" and just as the Arabic nasiya signifies both to forget and to become lame (cf. Gesenius, Thesaurus, p. 921b). La Harpe correctly renders: O Jerusalem! si je t'oublie jamais, que ma main oublie aussi le mouvement! Thus there is a correspondence between Psalm 137:5 and Psalm 137:6 : My tongue shall cleave to my palate if I do not remember thee, if I do not raise Jerusalem above the sum of my joy. אזכּרכי has the affixed Chirek, with which these later Psalms are so fond of adorning themselves. ראשׁ is apparently used as in Psalm 119:160 : supra summam (the totality) laetitiae meae, as Coccejus explains, h.e. supra omnem laetitiam meam. But why not then more simply על כּל, above the totality? ראשׁ here signifies not κεφάλαιον, but κεφαλή: if I do not place Jerusalem upon the summit of my joy, i.e., my highest joy; therefore, if I do not cause Jerusalem to be my very highest joy. His spiritual joy over the city of God is to soar above all earthly joys. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Before ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have to imagine that they answered the request of the Babylonians at that time in the language that follows, or thought thus within themselves when they withdrew themselves from them. The meaning of the interrogatory exclamation is not that the singing of sacred songs in a foreign land (חוצה לארץ) is contrary to the law, for the Psalms continued to be sung even during the Exile, and were also enriched by new ones. But the shir had an end during the Exile, in so far as that it was obliged to retire from publicity into the quiet of the family worship and of the houses of prayer, in order that that which is holy might not be profaned; and since it was not, as at home, accompanied by the trumpets of the priests and the music of the Levites, it became more recitative than singing properly so called, and therefore could not afford any idea of the singing of their native land in connection with the worship of God on Zion. From the striking contrast between the present and the former times the people of the Exile had in fact to come to the knowledge of their sins, in order that they might get back by the way of penitence and earnest longing to that which they had lost Penitence and home-sickness were at that time inseparable; for all those in whom the remembrance of Zion was lost gave themselves over to heathenism and were excluded from the redemption. The poet, translated into the situation of the exiles, and arming himself against the temptation to apostasy and the danger of denying God, therefore says: If I forget thee, O Jerusalem, ימיני תּשׁכּח. תּשׁכּח has been taken as an address to Jahve: obliviscaris dexterae meae (e.g., Wolfgang Dachstein in his song \"An Wasserflssen Babylon\"), but it is far from natural that Jerusalem and Jahve should be addressed in one clause. Others take ימיני as the subject and תּשׁכּח transitively: obliviscatur dextera mea, scil. artem psallendi (Aben-Ezra, Kimchi, Pagninus, Grotius, Hengstenberg, and others); but this ellipsis is arbitrary, and the interpolation of מנּי after ימיני (von Ortenberg, following Olshausen) produces an inelegant cadence. Others again assign a passive sense to תשׁכח: oblivioni detur (lxx, Italic, Vulgate, and Luther), or a half-passive sense, in oblivione sit (Jerome); but the thought: let my right hand be forgotten, is awkward and tame. Obliviscatur me (Syriac, Saadia, and the Psalterium Romanum) comes nearer to the true meaning. תּשׁכּח is to be taken reflexively: obliviscatur sui ipsius, let it forget itself, or its service (Amyraldus, Schultens, Ewald, and Hitzig), which is equivalent to let it refuse or fail, become lame, become benumbed, much the same as we say of the arms of legs that they \"go to sleep,\" and just as the Arabic nasiya signifies both to forget and to become lame (cf. Gesenius, Thesaurus, p. 921b). La Harpe correctly renders: O Jerusalem! si je t'oublie jamais, que ma main oublie aussi le mouvement! Thus there is a correspondence between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : My tongue shall cleave to my palate if I do not remember thee, if I do not raise Jerusalem above the sum of my joy. אזכּרכי has the affixed Chirek, with which these later Psalms are so fond of adorning themselves. ראשׁ is apparently used as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:160",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : supra summam (the totality) laetitiae meae, as Coccejus explains, h.e. supra omnem laetitiam meam. But why not then more simply על כּל, above the totality? ראשׁ here signifies not κεφάλαιον, but κεφαλή: if I do not place Jerusalem upon the summit of my joy, i.e., my highest joy; therefore, if I do not cause Jerusalem to be my very highest joy. His spiritual joy over the city of God is to soar above all earthly joys. ",
            "children": []
          }
        ]
      }
    ]
  }
]