[{"header":"A crisis for the Jews"},{"num":4,"verse":"When Mordecai learned what had been done, he tore his clothes, dressed in mourning clothes, and put ashes on his head. Then he went out into the heart of the city and cried out loudly and bitterly."},{"num":2,"verse":"He went only as far as the King’s Gate because it was against the law for anyone to pass through it wearing mourning clothes."},{"num":3,"verse":"At the same time, in every province and place where the king’s order and his new law arrived, a very great sadness came over the Jews. They gave up eating and spent whole days weeping and crying out loudly in pain. Many Jews lay on the ground in mourning clothes and ashes."},{"num":4,"verse":"When Esther’s female servants and eunuchs came and told her about Mordecai, the queen’s whole body showed how upset she was. She sent everyday clothes for Mordecai to wear instead of mourning clothes, but he rejected them."},{"num":5,"verse":"Esther then sent for Hathach, one of the royal eunuchs whose job it was to wait on her. She ordered him to go to Mordecai and find out what was going on and why he was acting this way."},{"num":6,"verse":"Hathach went out to Mordecai, to the city square in front of the King’s Gate."},{"num":7,"verse":"Mordecai told him everything that had happened to him. He spelled out the exact amount of silver that Haman promised to pay into the royal treasury. It was in exchange for the destruction of the Jews."},{"num":8,"verse":"He also gave Hathach a copy of the law made public in Susa concerning the Jews’ destruction so that Hathach could show it to Esther and report it to her. Through him Mordecai ordered her to go to the king to seek his kindness and his help for her people."},{"num":9,"verse":"Hathach came back and told Esther what Mordecai had said."},{"num":10,"verse":"In reply Esther ordered Hathach to tell Mordecai:"},{"num":11,"verse":"“All the king’s officials and the people in his provinces know that there’s a single law in a case like this. Any man or woman who comes to the king in the inner courtyard without being called is to be put to death. Only the person to whom the king holds out the gold scepter may live. In my case, I haven’t been called to come to the king for the past thirty days.”"},{"num":12,"verse":"When they told Mordecai Esther’s words,"},{"num":13,"verse":"he had them respond to Esther: “Don’t think for one minute that, unlike all the other Jews, you’ll come out of this alive simply because you are in the palace."},{"num":14,"verse":"In fact, if you don’t speak up at this very important time, relief and rescue will appear for the Jews from another place, but you and your family will die. But who knows? Maybe it was for a moment like this that you came to be part of the royal family.”"},{"num":15,"verse":"Esther sent back this word to Mordecai:"},{"num":16,"verse":"“Go, gather all the Jews who are in Susa and tell them to give up eating to help me be brave. They aren’t to eat or drink anything for three whole days, and I myself will do the same, along with my female servants. Then, even though it’s against the law, I will go to the king; and if I am to die, then die I will.”"},{"num":17,"verse":"So Mordecai left where he was and did exactly what Esther had ordered him."}]