[{"num":4,"verse":"¶ When Mordecai perceived all that was done, Mordecai rent his clothes and put on sackcloth with ashes and went out into the midst of the city and cried with a loud and a bitter cry"},{"num":2,"verse":"and came before the king’s gate; for no one was allowed to enter into the king’s gate clothed with sackcloth."},{"num":3,"verse":"And in each province, wherever the king’s commandment and his law came, there was great mourning among the Jews and fasting and weeping and wailing; and many lay in sackcloth and ashes."},{"num":4,"verse":"So Esther’s maids and her eunuchs came and told her. Then the queen was grieved exceedingly, and she sent raiment to clothe Mordecai and to take away his sackcloth from him; but he did not receive it."},{"num":5,"verse":"¶ Then Esther called for Hatach, one of the king’s eunuchs, whom he had appointed to attend her, and sent him to Mordecai, to know what it was and why it was."},{"num":6,"verse":"So Hatach went forth to Mordecai unto the plaza of the city, which was before the king’s gate."},{"num":7,"verse":"And Mordecai told him of all that had happened unto him and of the sum of the money that Haman had promised to pay to the king’s treasuries for the Jews, to destroy them."},{"num":8,"verse":"Also he gave him the copy of the writing of the decree that was given at Shushan to destroy them, to show it unto Esther and to declare it unto her and to charge her that she should go in unto the king to make supplication unto him and to make request before him for her people."},{"num":9,"verse":"And Hatach came and told Esther the words of Mordecai."},{"num":10,"verse":"Again Esther spoke unto Hatach and sent him to say unto Mordecai,"},{"num":11,"verse":"All the king’s slaves and the people of the king’s provinces do know that anyone, whether man or woman, who shall come unto the king into the inner court without being called, by one law shall be put to death, unless the king shall hold out the golden sceptre, that they may live; but I have not been called to come in unto the king these thirty days."},{"num":12,"verse":"And they told to Mordecai Esther’s words."},{"num":13,"verse":"Then Mordecai told them to answer Esther, Do not think in thy soul that thou shalt escape in the king’s house, more than all the Jews."},{"num":14,"verse":"For if thou art silent at this time, then enlargement and deliverance shall arise to the Jews from another place, but thou and thy father’s house shall be destroyed; and who knows whether thou art come to the kingdom for such a time as this?"},{"num":15,"verse":"Then Esther told them to return Mordecai this answer,"},{"num":16,"verse":"Go, gather together all the Jews that are present in Shushan and fast for me, and neither eat nor drink for three days, night or day; I also and my maidens will fast likewise; and so I will go in unto the king, even though this is not according to the law; and if I perish, I perish."},{"num":17,"verse":"So Mordecai went and did according to all that Esther had commanded him."}]