[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A river went out of Eden.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Out of the large region of which the garden formed a part. The tenses, too, are present, as if the main features of the country remained unchanged: “a river goeth forth from Eden, and thence outside of it is parted, and becometh four main streams.” The idea is that of a stream rising in Eden, and flowing through the Paradise, and at some distance outside of it divided into four great rivers. This has made many suppose that the site of Paradise was in the Persian Gulf, in a region now submerged; and the Babylonian legends actually place it there, at Eridu, at the junction of the Tigris and Euphrates. The two other rivers they suppose to have been the Indus and the Nile, represented by the two coasts of the Persian Gulf. Sir H. Rawlinson suggests the Babylonian province of Gan-duniyas, where four rivers may be found; but in neither case could the ark have floated against the current of the flood up to the highlands of Armenia. We must add that many authors of note have regarded the whole as symbolical, among whom is the famous Syriac writer, Bar-Hebraeus, who regards it as a description of the human body.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 2:10-14. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:10-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A river went out of Eden ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This river, branching itself into four streams, contributed much both to the pleasantness and fertility of the garden. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hiddekel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Euphrates ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are rivers of Babylon: but we need not wonder that the rise and situation of all these rivers cannot now be perfectly ascertained, considering the great changes produced in the state of the earth, as well by earthquakes as by the general deluge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Havilah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gold, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "precious stones: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Eden ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "had that which was infinitely better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tree of life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and communion with God. And to these blessings we may have access, although shut out of the literal Eden. Reader, dost thou desire them?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:8-14 The place fixed upon for Adam to dwell in, was not a palace, but a garden. The better we take up with plain things, and the less we seek things to gratify pride and luxury, the nearer we approach to innocency. Nature is content with a little, and that which is most natural; grace with less; but lust craves every thing, and is content with nothing. No delights can be satisfying to the soul, but those which God himself has provided and appointed for it. Eden signifies delight and pleasure. Wherever it was, it had all desirable conveniences, without any inconvenience, though no other house or garden on earth ever was so. It was adorned with every tree pleasant to the sight, and enriched with every tree that yielded fruit grateful to the taste and good for food. God, as a tender Father, desired not only Adam's profit, but his pleasure; for there is pleasure with innocency, nay there is true pleasure only in innocency. When Providence puts us in a place of plenty and pleasure, we ought to serve God with gladness of heart in the good things he gives us. Eden had two trees peculiar to itself. 1. There was the tree of life in the midst of the garden. Of this man might eat and live. Christ is now to us the Tree of life, Re 2:7; 22:2; and the Bread of life, Joh 6:48,51. 2. There was the tree of the knowledge of good and evil, so called because there was a positive revelation of the will of God about this tree, so that by it man might know moral good and evil. What is good? It is good not to eat of this tree. What is evil? It is evil to eat of this tree. In these two trees God set before Adam good and evil, the blessing and the curse.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Here is a river the source of which is in Eden. It passes into the garden and waters it. \"And thence it was parted and became four heads.\" This statement means either that the single stream was divided into four branches, or that there was a division of the river system of the district into four principal streams, whose sources were all to be found in it, though one only passed through the garden. In the latter case the word נהר  nâhār may be understood in its primary sense of a flowing of water in general. This flowing in all the parts of Eden resulted in four particular flowings or streams, which do not require to have been ever united. The subsequent land changes in this district during an interval of five or six thousand years prevent us from determining more precisely the meaning of the text.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. tree of life—so called from its symbolic character as a sign and seal of immortal life. Its prominent position where it must have been an object of daily observation and interest, was admirably fitted to keep man habitually in mind of God and futurity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "tree of the knowledge of good and evil—so called because it was a test of obedience by which our first parents were to be tried, whether they would be good or bad, obey God or break His commands.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rivers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by a common enallage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Eden, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the country in which Paradise was; where those rivers either arose from one spring, or met together in one channel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "From the garden, it was divided into four principal rivers, concerning which there are now many disputes. But it is no wonder if the rise and situation of these rivers be not now certainly known, because of the great changes, which in so long time might happen in this as well as in other rivers, partly by earthquakes, and principally by the general deluge. And yet Euphrates and Tigris, the chief of these rivers, whereof the other two are branches, are discovered by some learned men to have one and the same original or spring, and that in a most pleasant part of Armenia, where they conceive Paradise was. See my Latin Synopsis. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And a river went out of Eden to water the garden,.... Before man was created, as Aben Ezra observes, this river went out of Eden and watered it on every side; but what river is here meant, is hard to say. It is more generally thought to be the river Euphrates, when that and the Tigris met, and became one stream or river, and as such entered and passed through Eden; and as it was parted into four rivers afterwards, in two of which they retained their names: the learned Reland (k) thinks, this river is now lost; but the learned writer before referred to thinks, as has been observed, that it is the river Jordan; see note on Gen  2:8 and which, as Pliny (l) says, was a very pleasant river: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and from thence it was parted, and became into four heads; after it had passed through Eden, and the garden in it, watering it, it divided into four parts or heads of water, or four chief principal rivers, hereafter mentioned; and which circumstance the above writer thinks makes it the more probable to be the river Jordan, which and with the four rivers are spoken of together by the son of Sirach, in the Apocrypha:\"25 He filleth all things with his wisdom, as Phison and as Tigris in the time of the new fruits. 26 He maketh the understanding to abound like Euphrates, and as Jordan in the time of the harvest. 27 He maketh the doctrine of knowledge appear as the light, and as Geon in the time of vintage.'' (Sirach 24)of which in the following verses. This river may be an emblem of the everlasting love of God, that pure river of water of life, which springs from the throne of God, and of the Lamb, from divine sovereignty, and not from the faith, love, and obedience of man; that river, the streams whereof make glad the city of God, and which water the garden, the church, revive its plants, and make it fruitful and delightful; the four heads or branches of which are eternal election of God, particular redemption by Christ, regeneration and sanctification by the Spirit, and eternal life and happiness, as the free gift of God through Christ; see Psalm 46:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and from thence it was parted, and became into four heads; after it had passed through Eden, and the garden in it, watering it, it divided into four parts or heads of water, or four chief principal rivers, hereafter mentioned; and which circumstance the above writer thinks makes it the more probable to be the river Jordan, which and with the four rivers are spoken of together by the son of Sirach, in the Apocrypha:\"25 He filleth all things with his wisdom, as Phison and as Tigris in the time of the new fruits. 26 He maketh the understanding to abound like Euphrates, and as Jordan in the time of the harvest. 27 He maketh the doctrine of knowledge appear as the light, and as Geon in the time of vintage.'' (Sirach 24)of which in the following verses. This river may be an emblem of the everlasting love of God, that pure river of water of life, which springs from the throne of God, and of the Lamb, from divine sovereignty, and not from the faith, love, and obedience of man; that river, the streams whereof make glad the city of God, and which water the garden, the church, revive its plants, and make it fruitful and delightful; the four heads or branches of which are eternal election of God, particular redemption by Christ, regeneration and sanctification by the Spirit, and eternal life and happiness, as the free gift of God through Christ; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Dissert. de Paradiso, p. 53. (l) Nat. Hist. l. 5. c. 15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) Dissert. de Paradiso, p. 53. (l) Nat. Hist. l. 5. c. 15. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And a river went out of Eden to water the garden; and from thence it was parted, and became into four heads.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And a river went out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The description of the river in this verse is as follows: (1) it took its rise in the land of Eden; (2) it flowed through the garden, and irrigated it; (3) after passing through the garden, it separated into four branches, or, as they are here called, “heads.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", “a mist … ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "watered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the whole face of the ground.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The account which follows (11–14) is irreconcilable with scientific geography. But the locality of a garden planted by the Lord God, containing two wonder-working trees, is evidently not to be looked for on maps. In the description of the four rivers, we must remember that the Israelites possessed only a very vague knowledge of distant lands. They depended upon the reports of travellers who possessed no means of accurate survey. Mediaeval maps often present the most fantastic and arbitrary arrangement of rivers and seas to meet the conjectures of the cartographist. We need not be surprised, if the early traditions of the Hebrews claimed that the four greatest known rivers of the world had branched off from the parent stream, which, rising in Eden, had passed through the garden of the Lord God. The four rivers here mentioned are referred to in the order of Pishon, Tigris, Euphrates, and Gihon in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 24:25-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Alexander the Great believed he had found the sources of the Nile in the Indus, because of the crocodiles and beans he saw there (Arrian, vi. i. 2 ff.; Str. xv. i. 25) … Pausanias records the tradition that ‘the same Nile is the river Euphrates, which was lost in a lake, and reemerged as the Nile in the remote part of Ethiopia’ ” (Gordon, p. 278). When such views of geography were held by the most enlightened Greeks, we need wonder at nothing in the primitive traditions of Palestine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "10–14. A Geographical Description of the Garden",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This is very probably a later insertion. It interrupts the sequence of thought.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The precise locality of Eden is indicated by its relation to the great watercourses of the region. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And a river",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, a flowing water, applicable to large oceanic floods - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - as well as to narrow streams) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "went out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, going out) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of Eden to water the garden.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To conclude from this that the river had its source within the limits of the garden is to infer more than the premises will warrant. Nothing more is implied in the language than that a great watercourse proceeded through the district of Eden, and served to irrigate the soil. Probably it intersected the garden, thus occasioning its remarkable fecundity and beauty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And from thence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either on emerging from which, or, taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in its secondary sense, outside of, or at a distance from which) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "it was parted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, divided itself), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and became into four heads.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Roshim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rosh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that which is highest; either principal waters, arms or branches (Taylor Lewis, Alford), or beginnings of rivers, indicating the sources of the streams (Gesenius, Keil, Macdonald, Murphy). If the second of these interpretations be adopted, Eden must be looked for in a spot where some great flowing water is subdivided into four separate streams; if the former be regarded as the proper exegesis, then any great river which is first formed by the junction of two streams, and afterwards disperses its waters in two different directions, will meet the requirements of the case. Genesis 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And there was a river going out of Eden, to water the garden; and from thence it divided itself, and became four heads;\" i.e., the stream took its rise in Eden, flowed through the garden to water it, and on leaving the garden was divided into four heads or beginnings of rivers, that is, into four arms or separate streams. For this meaning of ראשׁים see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of the four rivers whose names are given to show the geographical situation of paradise, the last two are unquestionably Tigris and Euphrates. Hiddekel occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the Hebrew name for Tigris; in the inscriptions of Darius it is called Tigrâ (or the arrow, according to Strabo, Pliny, and Curtius), from the Zendic tighra, pointed, sharp, from which probably the meaning stormy (rapidus Tigris, Hor. Carm. 4, 14, 46) was derived. It flows before (קדמת), in front of, Assyria, not to the east of Assyria; for the province of Assyria, which must be intended here, was on the eastern side of the Tigris: moreover, neither the meaning, \"to the east of,\" nor the identity of קדמת and מקדם has been, or can be, established from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which are the only other passages in which the word occurs, as Ewald himself acknowledges. P'rath, which was not more minutely described because it was so generally known, is the Euphrates; in old Persian, Ufrâtu, according to Delitzsch, or the good and fertile stream; Ufrâtu, according to Spiegler, or the well-progressing stream. According to the present condition of the soil, the sources of the Euphrates and Tigris are not so closely connected that they could be regarded as the commencements of a common stream which has ceased to exist. The main sources of the Tigris, it is true, are only 2000 paces from the Euphrates, but they are to the north of Diarbekr, in a range of mountains which is skirted on three sides by the upper course of the Euphrates, and separates them from this river. We must also look in the same country, the highlands of Armenia, for the other two rivers, if the description of paradise actually rests upon an ancient tradition, and is to be regarded as something more than a mythical invention of the fancy. The name Phishon sounds like the Phasis of the ancients, with which Reland supposed it to be identical; and Chavilah like Cholchis, the well-known gold country of the ancients. But the Φάσις ὁ Κόλχος (Herod. 4, 37, 45) takes its rise in the Caucasus, and not in Armenia. A more probable conjecture, therefore, points to the Cyrus of the ancients, which rises in Armenia, flows northwards to a point not far from the eastern border of Colchis, and then turns eastward in Iberia, from which it flows in a south-easterly direction to the Caspian Sea. The expression, \"which compasseth the whole land of Chavilah,\" would apply very well to the course of this river from the eastern border of Colchis; for סבב does not necessarily signify to surround, but to pass through with different turns, or to skirt in a semi-circular form, and Chavilah may have been larger than modern Colchis. It is not a valid objection to this explanation, that in every other place Chavilah is a district of Southern Arabia. The identity of this Chavilah with the Chavilah of the Joktanites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or of the Cushites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is disproved not only by the article used here, which distinguishes it from the other, but also by the description of it as land where gold, bdolach, and the shohamstone are found; a description neither requisite nor suitable in the case of the Arabian Chavilah, since there productions are not to be met with there. This characteristic evidently shows that the Chavilah mentioned here was entirely distinct from the other, and a land altogether unknown to the Iraelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What we are to understand by הבּדלח is uncertain. There is no certain ground for the meaning \"pearls,\" given in Saad. and the later Rabbins, and adopted by Bochart and others. The rendering βδέλλα or βδέλλιον, bdellium, a vegetable gum, of which Cioscorus says, οἱ δὲ μάδελκον οἱ δὲ βολχὸν καλχὸν, and Pliny, \"alii brochon appellant, alii malacham, alii maldacon,\" is favoured by the similarity in the name; but, on the other side, there is the fact that Pliny describes this gum as nigrum and hadrobolon, and Dioscorus as ὑποπέλιον (blackish), which does not agree with Numbers 11:7, where the appearance of the white grains of the manna is compared to that of bdolach. - The stone shoham, according to most of the early versions, is probably the beryl, which is most likely the stone intended by the lxx (ὁ λίθος ὁ πράσινος, the leek-green stone), as Pliny, when speaking of beryls, describes those as probatissimi, qui viriditatem puri maris imitantur; but according to others it is the onyx or sardonyx (vid., Ges. s.v.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What we are to understand by הבּדלח is uncertain. There is no certain ground for the meaning \"pearls,\" given in Saad. and the later Rabbins, and adopted by Bochart and others. The rendering βδέλλα or βδέλλιον, bdellium, a vegetable gum, of which Cioscorus says, οἱ δὲ μάδελκον οἱ δὲ βολχὸν καλχὸν, and Pliny, \"alii brochon appellant, alii malacham, alii maldacon,\" is favoured by the similarity in the name; but, on the other side, there is the fact that Pliny describes this gum as nigrum and hadrobolon, and Dioscorus as ὑποπέλιον (blackish), which does not agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the appearance of the white grains of the manna is compared to that of bdolach. - The stone shoham, according to most of the early versions, is probably the beryl, which is most likely the stone intended by the lxx (ὁ λίθος ὁ πράσινος, the leek-green stone), as Pliny, when speaking of beryls, describes those as probatissimi, qui viriditatem puri maris imitantur; but according to others it is the onyx or sardonyx (vid., Ges. s.v.).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The two productions furnish no proof that the Phishon is to be sought for in India. The assertion that the name bdolach is Indian, is quite unfounded, for it cannot be proved that madâlaka in Sanscrit is a vegetable gum; nor has this been proved of madâra, which is possibly related to it (cf. Lassen's indische Althk. 1, 290 note). Moreover, Pliny speaks of Bactriana as the land \"in qua Bdellium est nominatissimum,\" although he adds, \"nascitur et in Arabia Indiaque, et Media ac Babylone;\" and Isidorus says of the Bdella which comes from India, \"Sordida est et nigra et majori gleba,\" which, again, does not agree with Numbers 11:7. - The Shoham-stone also is not necessarily associated with India; for although Pliny says of the beryls, \"India eos gignit, raro alibi repertos,\" he also observes, \"in nostro orbe aliquando circa Pontum inveniri putantur.\")",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The two productions furnish no proof that the Phishon is to be sought for in India. The assertion that the name bdolach is Indian, is quite unfounded, for it cannot be proved that madâlaka in Sanscrit is a vegetable gum; nor has this been proved of madâra, which is possibly related to it (cf. Lassen's indische Althk. 1, 290 note). Moreover, Pliny speaks of Bactriana as the land \"in qua Bdellium est nominatissimum,\" although he adds, \"nascitur et in Arabia Indiaque, et Media ac Babylone;\" and Isidorus says of the Bdella which comes from India, \"Sordida est et nigra et majori gleba,\" which, again, does not agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - The Shoham-stone also is not necessarily associated with India; for although Pliny says of the beryls, \"India eos gignit, raro alibi repertos,\" he also observes, \"in nostro orbe aliquando circa Pontum inveniri putantur.\")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Gihon (from גּוּח to break forth) is the Araxes, which rises in the neighbourhood of the Euphrates, flows from west to east, joins the Cyrus, and falls with it into the Caspian Sea. The name corresponds to the Arabic Jaihun, a name given by the Arabians and Persians to several large rivers. The land of Cush cannot, of course, be the later Cush, or Ethiopia, but must be connected with the Asiatic Κοσσαία, which reached to the Caucasus, and to which the Jews (of Shirwan) still give this name. But even though these four streams do not now spring from one source, but on the contrary their sources are separated by mountain ranges, this fact does not prove that the narrative before us is a myth. Along with or since the disappearance of paradise, that part of the earth may have undergone such changes that the precise locality can no longer be determined with certainty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: That the continents of our globe have undergone great changes since the creation of the human race, is a truth sustained by the facts of natural history and the earliest national traditions, and admitted by the most celebrated naturalists. (See the collection of proofs made by Keerl.) These changes must not be all attributed to the flood; many may have occurred before and many after, like the catastrophe in which the Dead Sea originated, without being recorded in history as this has been. Still less must we interpret Genesis 11:1 (compared with Genesis 10:25), as Fabri and Keerl have done, as indicating a complete revolution of the globe, or a geogonic process, by which the continents of the old world were divided, and assumed their present physignomy.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: That the continents of our globe have undergone great changes since the creation of the human race, is a truth sustained by the facts of natural history and the earliest national traditions, and admitted by the most celebrated naturalists. (See the collection of proofs made by Keerl.) These changes must not be all attributed to the flood; many may have occurred before and many after, like the catastrophe in which the Dead Sea originated, without being recorded in history as this has been. Still less must we interpret ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as Fabri and Keerl have done, as indicating a complete revolution of the globe, or a geogonic process, by which the continents of the old world were divided, and assumed their present physignomy.) ",
            "children": []
          }
        ]
      }
    ]
  }
]