[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) Of the “Hiddekel” and “Euphrates” there is no doubt: the former is the Tigris, or Tigres, which is a mere Graecising of its Oriental name, Daglath in Arabic, and Deklath in Syriac, and in the Targum of Onkelos. The word Hiddekel is startling as being a quadriliteral, but the Samaritan Codex reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Dehel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, it has the article instead of the Hebrew Kheth. Mr. Sayce accepts the uncertain reading Hiddekel, and says (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Chald. Gen., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 84) that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hid ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is the Accadian name for river. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dekel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Tigris, is said to mean an arrow. The Samaritan reading is probably right.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Euphrates.—No description is given of this as being the largest and best known of Asiatic rivers. Hence, probably, the Pison and Gihon were but small streams. Euphrates is the Greek manner of pronouncing the Hebrew Phrath, the first syllable being simply a help in sounding the double consonant. In Accadian it is called Purrat, and means “the curving water,” being so named from its shape.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Euphrates.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—No description is given of this as being the largest and best known of Asiatic rivers. Hence, probably, the Pison and Gihon were but small streams. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Euphrates ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is the Greek manner of pronouncing the Hebrew ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Phrath, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the first syllable being simply a help in sounding the double consonant. In Accadian it is called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Purrat, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and means “the curving water,” being so named from its shape.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:8-14 The place fixed upon for Adam to dwell in, was not a palace, but a garden. The better we take up with plain things, and the less we seek things to gratify pride and luxury, the nearer we approach to innocency. Nature is content with a little, and that which is most natural; grace with less; but lust craves every thing, and is content with nothing. No delights can be satisfying to the soul, but those which God himself has provided and appointed for it. Eden signifies delight and pleasure. Wherever it was, it had all desirable conveniences, without any inconvenience, though no other house or garden on earth ever was so. It was adorned with every tree pleasant to the sight, and enriched with every tree that yielded fruit grateful to the taste and good for food. God, as a tender Father, desired not only Adam's profit, but his pleasure; for there is pleasure with innocency, nay there is true pleasure only in innocency. When Providence puts us in a place of plenty and pleasure, we ought to serve God with gladness of heart in the good things he gives us. Eden had two trees peculiar to itself. 1. There was the tree of life in the midst of the garden. Of this man might eat and live. Christ is now to us the Tree of life, Re 2:7; 22:2; and the Bread of life, Joh 6:48,51. 2. There was the tree of the knowledge of good and evil, so called because there was a positive revelation of the will of God about this tree, so that by it man might know moral good and evil. What is good? It is good not to eat of this tree. What is evil? It is evil to eat of this tree. In these two trees God set before Adam good and evil, the blessing and the curse.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Gihon, the second river, flows by the land of Kush. It is possible that the name Kush remains in Caucasus and in the Caspian. The Gihon is the stream that breaks or bursts forth; a quality common to many rivers. The name is preserved in the Jyhoon, flowing into the sea of Aral. Here it probably designates the leading stream flowing out of Armenia into the Caspian, or in that direction. Hiddekel, the third, goes in front, or on the east of Asshur. The original Asshur embraced northern Mesopotamia, as well as the slopes of the mountain range on the other side of the Tigris. Perath, the fourth, is the well-known Frat or Euphrates.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In endeavoring to determine the situation of Eden, it is evident we can only proceed on probable grounds. The deluge, and even the distance of time, warrant us in presuming great land changes to have taken place since this geographical description applied to the country. Let us see, however, to what result the simple reading of the text will lead us. A river is said to flow out of Eden into the garden. This river is not named, and may, in a primary sense of the term, denote the running water of the district in general. This is then said to be parted into four heads - the upper courses of four great rivers. One of these rivers is known to this day as the Frat or Euphrates. A second is with almost equal unanimity allowed to be the Dijlah or Tigris. The sources of these lie not far asunder, in the mountains of Armenia, and in the neighborhood of the lakes Van and Urumiah. Somewhere in this region must have been the celebrated but unnamed stream. The Hiddekel flowed east of Asshur; the primitive portion of which seems therefore to have been in Mesopotamia. The Gihon may have flowed into the Caspian, on the banks of which was the original Kush. The Pishon may have turned towards the Euxine, and compassed the primitive Havilah, lying to the south and east of that sea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It may be said that the Kush and Havilah of later times belong to different localities. This, however, is no solid objection, on two grounds:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "First. Geography affords numerous examples of the transferrence of names from one place to another along the line of migration. Thus, Galatia in Asia Minor would be inexplicable or misleading, did not history inform us that tribes from Gallia had settled there and given their name to the province. We may therefore expect names to travel with the tribes that bear them or love them, until they come to their final settlements. Hence, Kush may have been among the Caucasian glens and on the Caspian shores. In the progress of his development, whether northward or southward, he may have left his mark in Kossaea and Kissia, while he sent his colonies into southern Arabia Aethiopia and probably India.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second. Countries agreeing in name may be totally unconnected either in time or place. Thus, in the table of nations we meet with two persons called Havilah Genesis 10:7, Genesis 10:29; the one a Kushite, who settled probably in the south of Arabia, the other a Joctanite, who occupied a more northerly locality in the same peninsula. A primitive Havilah, different from both, may have given his name to the region southeast of the Euxine.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Second. Countries agreeing in name may be totally unconnected either in time or place. Thus, in the table of nations we meet with two persons called Havilah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the one a Kushite, who settled probably in the south of Arabia, the other a Joctanite, who occupied a more northerly locality in the same peninsula. A primitive Havilah, different from both, may have given his name to the region southeast of the Euxine.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The rivers Pishon and Gihon may have been greatly altered or even effaced by the deluge and other causes. Names similar to these may be found in various places. They cannot prove much more than resemblance in language, and that may be sometimes very remote. There is one other Gihon mentioned in Scripture 1 Kings 1:33, and several like names occur in profane history. At first sight it seems to be stated that the one stream branched into four. If so, this community of origin has disappeared among the other changes of the country. But in the original text the words \"and thence\" come before the verb \"parted.\" This verb has no subject expressed, and may have its subject implied in itself. The meaning of the sentence will then be, \"and thence,\" after the garden had been watered by the river, \"it,\" the river, or the water system of the country, \"was parted into four heads.\" We cannot tell, and it is not material, which of these interpretations correctly represents the original fact.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The rivers Pishon and Gihon may have been greatly altered or even effaced by the deluge and other causes. Names similar to these may be found in various places. They cannot prove much more than resemblance in language, and that may be sometimes very remote. There is one other Gihon mentioned in Scripture ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 1:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and several like names occur in profane history. At first sight it seems to be stated that the one stream branched into four. If so, this community of origin has disappeared among the other changes of the country. But in the original text the words \"and thence\" come before the verb \"parted.\" This verb has no subject expressed, and may have its subject implied in itself. The meaning of the sentence will then be, \"and thence,\" after the garden had been watered by the river, \"it,\" the river, or the water system of the country, \"was parted into four heads.\" We cannot tell, and it is not material, which of these interpretations correctly represents the original fact.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "According to the above view, the land and garden of Eden lay in Armenia, around the lakes Van and Urumiah, or the district where these lakes now are. The country here is to this day a land of delight, and very well suited in many respects to be the cradle of the human race. There is only one other locality that has any claim to probability from an examination of Scripture. It is the alluvial ground where the Euphrates and Tigris unite their currents, and then again separate into two branches, by which their waters are discharged into the Persian Gulf. The neck in which they are united is the river that waters the garden. The rivers, before they unite, and the branches, after they separate; are the four rivers. The claim of this position to acceptance rests on the greater contiguity to Kissia or Susiana, a country of the Kushites, on the one side and on the other to Havilah, a district of Arabia, as well as its proximity to Babel, where the confusion of tongues took place. These claims do not constrain our assent. Susiana is nearer the Tigris itself than the present eastern branch after the separation. Havilah is not very near the western branch. If Babel be near, Armenia, where the ark rested, is very far away. Against this position is the forced meaning it puts on the text by its mode of accounting for the four rivers. The garden river in the text rises in Eden, and the whole four have their upper currents in that land. All is different in the case here supposed. Again, the land of Shinar is a great wheat country, and abounds in the date palm. But it is not otherwise distinguished for trees. It is a land of the simoon, the mirage, and the drought, and its summer heat is oppressive and enfeebling. It cannot therefore claim to be a land of delight (Eden), either in point of climate or variety of produce. It is not, consequently, so well suited as the northern position, either to the description in the text or the requirements of primeval man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is evident that this geographical description must have been written long after the document in which it is found might have been composed. Mankind must have multiplied to some extent, have spread themselves along these rivers, and become familiar with the countries here designated. All this might have taken place in the lifetime of Adam, and so have been put on record, or handed down by tradition from an eye-witness. But it is remarkable that the three names of countries reappear as proper names among the descendants of Noah after the flood.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, arises a question of great interest concerning the composition of the document in which they are originally found. If these names be primeval, the document in its extant form may have been composed in the time of Adam, and therefore before the deluge. In this case Moses has merely authenticated it and handed it down in its proper place in the divine record. And the sons of Noah, from some unexplained association, have adopted the three names and perpetuated them as family names. If, on the other hand, these countries are named after the descendants of Noah, the geographical description of the garden must have been composed after these men had settled in the countries to which they have given their names. At the same time, these territorial designations apply to a time earlier than Moses; hence, the whole document may have been composed in the time of Noah, who survived the deluge three hundred and fifty years, and may have witnessed the settlement and the designation of these countries. And, lastly, if not put together in its present form by any previous writer, then the document is directly from the pen of Moses, who composed it out of pre-existent memorials. And as the previous document was solely due to inspiration, we shall in this case be led to ascribe the whole of Genesis to Moses as the immediate human composer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It must be admitted that any of these ways of accounting for the existing form of this document is within the bounds of possibility. But the question is, Which is the most probable? We are in a fair position for discussing this question in a dispassionate manner, and without any anxiety, inasmuch as on any of the three suppositions Moses, who lived long after the latest event expressed or implied, is the acknowledged voucher for the document before us. It becomes us to speak with great moderation and caution on a point of so remote antiquity. To demonstrate this may be one of the best results of this inquiry.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I. The following are some of the grounds for the theory that the names of countries in the document are original and antediluvian:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "First, it was impossible to present to the postdiluvians in later terms the exact features and conditions of Eden, because many of these were obliterated. The four rivers no longer sprang from one. Two of the rivers remained, indeed, but the others had been so materially altered as to be no longer clearly distinguishable. The Euxine and the Caspian may now cover their former channels. In circumstances like these later names would not answer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second, though the name Asshur represents a country nearly suitable to the original conditions, Havilah and Kush cannot easily have their postdiluvian meanings in the present passage. The presumption that they have has led interpreters into vain and endless conjectures. Supposing Kush to be Aethiopia, many have concluded the Gihon to be the Nile, which in that case must have had the same fountain-head, or at least risen in the same region with the Euphrates. Others, supposing it to be a district of the Tigris, near the Persian Gulf, imagine the Gihon to be one of the mouths of the united Euphrates and Tigris, and thus, give a distorted sense to the statement that the four streams issued from one. This supposition, moreover, rests on the precarious hypothesis that the two rivers had always a common neck. The supposition that Havilah was in Arabia or on the Indian Ocean is liable to the same objections. Hence, the presumption that these names are postdiluvian embarrasses the meaning of the passage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Third, if these names be primeval, the present document in its integrity may have been composed in the time of Adam; and this accounts in the most satisfactory manner for the preservation of these traditions of the primitive age.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. tree of life—so called from its symbolic character as a sign and seal of immortal life. Its prominent position where it must have been an object of daily observation and interest, was admirably fitted to keep man habitually in mind of God and futurity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "tree of the knowledge of good and evil—so called because it was a test of obedience by which our first parents were to be tried, whether they would be good or bad, obey God or break His commands.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hiddekel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Tigris, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or an eminent branch of it. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Daniel 10:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The name of the third river is Hiddekel,.... A river which ran by Shushan in Persia, and retained its name in the times of Daniel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where it is called the great river; and it seems it bears the same name now among the Persians; at least it did an hundred and fifty years ago, when Rauwolff (m) travelled in those parts. The Targum of Jonathan here calls it Diglath, the same with the Diglito of Pliny (n); and according to him it is called Tigris, from its swiftness, either from the tiger, a swift creature, or from  \"to dart\", in the Chaldee language; and so Curtius (o) says, that in the Persian language they call a dart \"tigris\": and with this agrees the word \"Hiddekel\", which in the Hebrew language signifies sharp and swift, as a polished arrow is; and Jarchi says it is so called, because its waters are sharp and swift: though this is contradicted by some modern travellers (p) who say it is a slower stream than the Euphrates, and is not only very crooked, and full of meanders, but also choked up with islands, and great banks of stone: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that is it which goeth towards the east of Assyria: a country which had its name from Ashur, a son of Shem, Genesis 10:11 it became a famous kingdom and monarchy, Nineveh was the metropolis of it, which was built on the river Tigris or Hiddekel; and, as before observed, it ran by Shushan in Persia; and so, as Diodorus Siculus (q) says, it passed through Media into Mesopotamia; and which very well agrees with its being, according to Moses, one of the rivers of Eden. Twelve miles up this river, from Mosul, near which Nineveh once stood, lies an island, called the island of Eden, in the heart of the Tigris, about ten English miles in circuit, and is said to be undoubtedly a part of paradise (r): ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that is it which goeth towards the east of Assyria: a country which had its name from Ashur, a son of Shem, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it became a famous kingdom and monarchy, Nineveh was the metropolis of it, which was built on the river Tigris or Hiddekel; and, as before observed, it ran by Shushan in Persia; and so, as Diodorus Siculus (q) says, it passed through Media into Mesopotamia; and which very well agrees with its being, according to Moses, one of the rivers of Eden. Twelve miles up this river, from Mosul, near which Nineveh once stood, lies an island, called the island of Eden, in the heart of the Tigris, about ten English miles in circuit, and is said to be undoubtedly a part of paradise (r): ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the fourth river is Euphrates: or \"Phrat\", as in the Hebrew tongue. Reland (s) seems rightly to judge, that the syllable \"eu\", prefixed to it, is the Persian \"au\" or \"cu\", which in that language signifies \"water\"; so that \"Euphrates\" is no other than \"the water of Phrat\", so called from the fruitfulness of it; for its waters, as Jarchi says, fructify, increase, and fatten the earth; and who rightly observes that these names, and so those of other rivers, and of the countries here mentioned, are named by a prolepsis or anticipation, these being the names they bore when Moses wrote; unless it may be thought to be the Hebrew  \"Hu, the, that Phrat\"; and which the Greeks have made an \"eu\" of. (After the global destruction of Noah's flood, it is doubtful that the location of these rivers could be determined with any degree of certainty today. Ed.) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Travels, part. 2. c. 9. p. 159. ed. Ray. (n) Nat. Hist. l. 6. c. 27. (o) Hist. l. 4. c. 9. (p) De la Valle & Thevenot, apud Universal History, vol. 4. p. 248. (q) Bibliothec. l. 2. p. 99. (r) Cartwright's Preacher's Travels, p. 91. (s) Ut supra, (De Situ Paradisi) p. 45. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Travels, part. 2. c. 9. p. 159. ed. Ray. (n) Nat. Hist. l. 6. c. 27. (o) Hist. l. 4. c. 9. (p) De la Valle & Thevenot, apud Universal History, vol. 4. p. 248. (q) Bibliothec. l. 2. p. 99. (r) Cartwright's Preacher's Travels, p. 91. (s) Ut supra, (De Situ Paradisi) p. 45. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the name of the third river is Hiddekel: that is it which goeth toward the east of Assyria. And the fourth river is Euphrates.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hiddekel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tigris",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Assyrian name is “Idiklat,” or “Diklat,” the old Persian “Tigra,” whence the Greek “Tigris” (modern ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Digle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is mentioned in the Bible elsewhere only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 24:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This famous river rises not far from the source of the Euphrates, and flows at first east from Diarbekr and unites with the Bohtan Tsckai, after which it flows south-east. It approaches the Euphrates at Bagdad, but continues a separate course until it unites at Korna with that river, and enters the Persian Gulf as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Schatt-el-Arab",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In earlier times the two rivers entered the sea at different points. The Tigris was so called from an old Persian word meaning “arrow,” and probably because of its swiftness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in front of Assyria",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew expression rendered “in front of” generally denotes “to the east of,” cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " notes. The Hebrew standpoint is always that of a person facing east. That which is in front is east: towards his right hand is the south, towards his left the north, at his back the west. It is objected that Assyria was a country, through which the Tigris flowed, and that, as Assyrian territory lay on the east as well as the west bank of the Tigris, it would not be correct to describe the Tigris as “that which goeth towards the east of Assyria.” Hence Sayce conjectures that we should here understand, not the country “Assyria,” but the country’s old capital “Asshur” which gave its name to the country, and which lay on the west bank of the Tigris. But Asshur, the city, is not mentioned elsewhere in the Bible; presumably, therefore, it was little known to the Hebrews, and was not likely to be mentioned in a geographical description. On the other hand, “Asshur” is the regular Hebrew designation of the country “Assyria”1[4]; the mention here of “Assyria” is parallel to that of “Cush” in the preceding verse. There seems no sufficient reason for doubting that the name “Asshur” is here used, in its usual Biblical application, for the land of Assyria. If so, the geographical description of the Tigris may not be strictly accurate. Considering its remoteness from Palestine, this need not surprise us, especially in a writing dating from a period previous to the active Assyrian interference in the course of Israelite affairs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[4] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “Asshur” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is mentioned with “Sheba … and Chilmad.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Euphrates",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Assyrian “Puratu,” old Persian ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ufrâtû",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence the Greek and Latin “Euphrates.” The Euphrates rises in the mountains near Erzerum, and, after following a tortuous course through the Taurus Mts., flows first in a southerly, and then, from Balis, in a S.E. direction, uniting with the Tigris before entering the Persian Gulf.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Israelites seem to have regarded the Euphrates as “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " river par excellence.” Hence “the River,” as a proper name, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the name of the third river is the, Hiddekel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or \"the darting,\" from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "חַד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "דֶּקֶל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a sharp and swift arrow, referring to its rapidity. It is unanimously agreed that this must be identified with the Tigris; in the present language of the Persians designated ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tir",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which signifies an arrow. It is styled in Aramaic ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "diglath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "diglah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "That is it which goeth towards the east of Assyria",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "That is it which goeth towards the east of Assyria",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its identity is thus placed beyond a question. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the fourth river is Euphrates",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or \"the sweet,' from an unused root, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "parath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", signifying to be sweet, referring to the sweet and pleasant taste of its waters (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Further description of this great water was unnecessary, being universally known to the Hebrews as \"the great river\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and \"the river\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "par excellence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The river still bears its early name. In the cuneiform inscriptions deciphered by Rawlinson it is called \"Ufrata.\" Recurring now to the site of Eden, it must be admitted that, notwithstanding this description, the whole question is involved in uncertainty. The two solutions of the problem that have the greatest claim on our attention are, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that which places Eden near the head of the Persian Gulf, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that which looks for it in Armenia. The latter is favored by the close proximity to that region of the sources of both the Euphrates and the Tigris; but, on the other hand, it is hampered by the difficulty of discovering other two rivers that will correspond with the Gihon and the Pison, and the almost certainty that Cush and Havilah are to be sought for in the vicinity of the Persian Gulf. The former (Calvin, Kalisch, T. Lewis) is supported by this last consideration, that Cush and Havilah are not remote from the locality, though it too has its encumbrances. It seems to reverse the idea of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לֺיּעֵא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which according to Le Clerc indicates the direction of the stream. Then its advocates, no more than the supporters of the alternate theory, are agreed upon the Gihon and the Pison: Calvin finding them in the two principal mouths of the Euphrates and the Tigris, which Sir Charles Lyell declares to be of comparatively recent formation; Kalisch identifying them with the Indus and the Nile; and Taylor Lewis regarding them as the two sides of the Persian Gulf. Sir H. Rawlinson, from a study of the Assyrian texts, has pointed out the coincidence of the Babylonian region of Karduniyas or Garduniyas with the Eden of the Bible; and the late George Smith finds in its four rivers, Euphrates, Tigris, Surappi, and Ukui, its known fertility, and its name, Gandunu, so similar to Ganeden (the garden of Eden), \"considerations all tending towards the view that it is the paradise of Genesis\" ('Chald. Genesis,' pp. 3-305). Genesis 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And there was a river going out of Eden, to water the garden; and from thence it divided itself, and became four heads;\" i.e., the stream took its rise in Eden, flowed through the garden to water it, and on leaving the garden was divided into four heads or beginnings of rivers, that is, into four arms or separate streams. For this meaning of ראשׁים see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of the four rivers whose names are given to show the geographical situation of paradise, the last two are unquestionably Tigris and Euphrates. Hiddekel occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the Hebrew name for Tigris; in the inscriptions of Darius it is called Tigrâ (or the arrow, according to Strabo, Pliny, and Curtius), from the Zendic tighra, pointed, sharp, from which probably the meaning stormy (rapidus Tigris, Hor. Carm. 4, 14, 46) was derived. It flows before (קדמת), in front of, Assyria, not to the east of Assyria; for the province of Assyria, which must be intended here, was on the eastern side of the Tigris: moreover, neither the meaning, \"to the east of,\" nor the identity of קדמת and מקדם has been, or can be, established from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which are the only other passages in which the word occurs, as Ewald himself acknowledges. P'rath, which was not more minutely described because it was so generally known, is the Euphrates; in old Persian, Ufrâtu, according to Delitzsch, or the good and fertile stream; Ufrâtu, according to Spiegler, or the well-progressing stream. According to the present condition of the soil, the sources of the Euphrates and Tigris are not so closely connected that they could be regarded as the commencements of a common stream which has ceased to exist. The main sources of the Tigris, it is true, are only 2000 paces from the Euphrates, but they are to the north of Diarbekr, in a range of mountains which is skirted on three sides by the upper course of the Euphrates, and separates them from this river. We must also look in the same country, the highlands of Armenia, for the other two rivers, if the description of paradise actually rests upon an ancient tradition, and is to be regarded as something more than a mythical invention of the fancy. The name Phishon sounds like the Phasis of the ancients, with which Reland supposed it to be identical; and Chavilah like Cholchis, the well-known gold country of the ancients. But the Φάσις ὁ Κόλχος (Herod. 4, 37, 45) takes its rise in the Caucasus, and not in Armenia. A more probable conjecture, therefore, points to the Cyrus of the ancients, which rises in Armenia, flows northwards to a point not far from the eastern border of Colchis, and then turns eastward in Iberia, from which it flows in a south-easterly direction to the Caspian Sea. The expression, \"which compasseth the whole land of Chavilah,\" would apply very well to the course of this river from the eastern border of Colchis; for סבב does not necessarily signify to surround, but to pass through with different turns, or to skirt in a semi-circular form, and Chavilah may have been larger than modern Colchis. It is not a valid objection to this explanation, that in every other place Chavilah is a district of Southern Arabia. The identity of this Chavilah with the Chavilah of the Joktanites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or of the Cushites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is disproved not only by the article used here, which distinguishes it from the other, but also by the description of it as land where gold, bdolach, and the shohamstone are found; a description neither requisite nor suitable in the case of the Arabian Chavilah, since there productions are not to be met with there. This characteristic evidently shows that the Chavilah mentioned here was entirely distinct from the other, and a land altogether unknown to the Iraelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What we are to understand by הבּדלח is uncertain. There is no certain ground for the meaning \"pearls,\" given in Saad. and the later Rabbins, and adopted by Bochart and others. The rendering βδέλλα or βδέλλιον, bdellium, a vegetable gum, of which Cioscorus says, οἱ δὲ μάδελκον οἱ δὲ βολχὸν καλχὸν, and Pliny, \"alii brochon appellant, alii malacham, alii maldacon,\" is favoured by the similarity in the name; but, on the other side, there is the fact that Pliny describes this gum as nigrum and hadrobolon, and Dioscorus as ὑποπέλιον (blackish), which does not agree with Numbers 11:7, where the appearance of the white grains of the manna is compared to that of bdolach. - The stone shoham, according to most of the early versions, is probably the beryl, which is most likely the stone intended by the lxx (ὁ λίθος ὁ πράσινος, the leek-green stone), as Pliny, when speaking of beryls, describes those as probatissimi, qui viriditatem puri maris imitantur; but according to others it is the onyx or sardonyx (vid., Ges. s.v.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What we are to understand by הבּדלח is uncertain. There is no certain ground for the meaning \"pearls,\" given in Saad. and the later Rabbins, and adopted by Bochart and others. The rendering βδέλλα or βδέλλιον, bdellium, a vegetable gum, of which Cioscorus says, οἱ δὲ μάδελκον οἱ δὲ βολχὸν καλχὸν, and Pliny, \"alii brochon appellant, alii malacham, alii maldacon,\" is favoured by the similarity in the name; but, on the other side, there is the fact that Pliny describes this gum as nigrum and hadrobolon, and Dioscorus as ὑποπέλιον (blackish), which does not agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the appearance of the white grains of the manna is compared to that of bdolach. - The stone shoham, according to most of the early versions, is probably the beryl, which is most likely the stone intended by the lxx (ὁ λίθος ὁ πράσινος, the leek-green stone), as Pliny, when speaking of beryls, describes those as probatissimi, qui viriditatem puri maris imitantur; but according to others it is the onyx or sardonyx (vid., Ges. s.v.).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The two productions furnish no proof that the Phishon is to be sought for in India. The assertion that the name bdolach is Indian, is quite unfounded, for it cannot be proved that madâlaka in Sanscrit is a vegetable gum; nor has this been proved of madâra, which is possibly related to it (cf. Lassen's indische Althk. 1, 290 note). Moreover, Pliny speaks of Bactriana as the land \"in qua Bdellium est nominatissimum,\" although he adds, \"nascitur et in Arabia Indiaque, et Media ac Babylone;\" and Isidorus says of the Bdella which comes from India, \"Sordida est et nigra et majori gleba,\" which, again, does not agree with Numbers 11:7. - The Shoham-stone also is not necessarily associated with India; for although Pliny says of the beryls, \"India eos gignit, raro alibi repertos,\" he also observes, \"in nostro orbe aliquando circa Pontum inveniri putantur.\")",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The two productions furnish no proof that the Phishon is to be sought for in India. The assertion that the name bdolach is Indian, is quite unfounded, for it cannot be proved that madâlaka in Sanscrit is a vegetable gum; nor has this been proved of madâra, which is possibly related to it (cf. Lassen's indische Althk. 1, 290 note). Moreover, Pliny speaks of Bactriana as the land \"in qua Bdellium est nominatissimum,\" although he adds, \"nascitur et in Arabia Indiaque, et Media ac Babylone;\" and Isidorus says of the Bdella which comes from India, \"Sordida est et nigra et majori gleba,\" which, again, does not agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - The Shoham-stone also is not necessarily associated with India; for although Pliny says of the beryls, \"India eos gignit, raro alibi repertos,\" he also observes, \"in nostro orbe aliquando circa Pontum inveniri putantur.\")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Gihon (from גּוּח to break forth) is the Araxes, which rises in the neighbourhood of the Euphrates, flows from west to east, joins the Cyrus, and falls with it into the Caspian Sea. The name corresponds to the Arabic Jaihun, a name given by the Arabians and Persians to several large rivers. The land of Cush cannot, of course, be the later Cush, or Ethiopia, but must be connected with the Asiatic Κοσσαία, which reached to the Caucasus, and to which the Jews (of Shirwan) still give this name. But even though these four streams do not now spring from one source, but on the contrary their sources are separated by mountain ranges, this fact does not prove that the narrative before us is a myth. Along with or since the disappearance of paradise, that part of the earth may have undergone such changes that the precise locality can no longer be determined with certainty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: That the continents of our globe have undergone great changes since the creation of the human race, is a truth sustained by the facts of natural history and the earliest national traditions, and admitted by the most celebrated naturalists. (See the collection of proofs made by Keerl.) These changes must not be all attributed to the flood; many may have occurred before and many after, like the catastrophe in which the Dead Sea originated, without being recorded in history as this has been. Still less must we interpret Genesis 11:1 (compared with Genesis 10:25), as Fabri and Keerl have done, as indicating a complete revolution of the globe, or a geogonic process, by which the continents of the old world were divided, and assumed their present physignomy.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: That the continents of our globe have undergone great changes since the creation of the human race, is a truth sustained by the facts of natural history and the earliest national traditions, and admitted by the most celebrated naturalists. (See the collection of proofs made by Keerl.) These changes must not be all attributed to the flood; many may have occurred before and many after, like the catastrophe in which the Dead Sea originated, without being recorded in history as this has been. Still less must we interpret ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as Fabri and Keerl have done, as indicating a complete revolution of the globe, or a geogonic process, by which the continents of the old world were divided, and assumed their present physignomy.) ",
            "children": []
          }
        ]
      }
    ]
  }
]