[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And every plant . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Authorised Version follows the LXX. in so translating this as to make it simply mean that God created vegetation. The more correct rendering is, “There was no shrub of the field (no wild shrub) as yet on the earth, and no herb of the field had as yet sprung up.” The purpose of the writer is to prepare for the planting of the paradise, though geology teaches us the literal truth of his words. When the earth was so hot that water existed only in the form of vapour, there could be no vegetation. Rain began on the second day; on the third the vapours were so largely condensed as for the waters to form seas; and on the same day vegetation began to clothe the cool, dry surface of the ground. To understand these opening words, we must bear in mind that the object of the narrative is not now the formation of the world, but man’s relation to Jehovah, and thus the long stages of creation appear but as one day’s work.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 2:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Every plant before it was in the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, when there was neither any plant, nor so much as any seed from which any could spring: and when, as is here observed, the two great means of the growth of vegetables were both wanting, rain from heaven and the labour of man. So that they were evidently produced by the word of God’s power alone. The English reader will observe in these two verses, the word LORD occurring for the first time. And he must remember that, whenever it occurs in our translation in capital letters, it stands for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is that name of God which implies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "self-existence, independence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eternity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and signifies one that has being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and is the source of being to all that exists. It is well explained by himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am Alpha and Omega, the beginning and the ending, which is and was, and is to come; the Almighty!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:4-7 Here is a name given to the Creator, Jehovah. Where the word LORD is printed in capital letters in our English Bibles, in the original it is Jehovah. Jehovah is that name of God, which denotes that he alone has his being of himself, and that he gives being to all creatures and things. Further notice is taken of plants and herbs, because they were made and appointed to be food for man. The earth did not bring forth its fruits of itself: this was done by Almighty power. Thus grace in the soul grows not of itself in nature's soil, but is the work of God. Rain also is the gift of God; it came not till the Lord God caused it. Though God works by means, yet when he pleases he can do his own work without them; and though we must not tempt God in the neglect of means, we must trust God, both in the use and in the want of means. Some way or other, God will water the plants of his own planting. Divine grace comes down like the dew, and waters the church without noise. Man was made of the small dust, such as is on the surface of the earth. The soul was not made of the earth, as the body: pity then that it should cleave to the earth, and mind earthly things. To God we must shortly give an account, how we have employed these souls; and if it be found that we have lost them, though it were to gain the world, we are undone for ever! Fools despise their own souls, by caring for their bodies before their souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This verse corresponds to the second verse of the preceding narrative. It describes the field or arable land in the absence of certain conditions necessary to the progress of vegetation. Plant and herb here comprise the whole vegetable world. Plants and herbs of the field are those which are to be found in the open land. A different statement is made concerning each.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Not a plant of the field was yet in the land. - Here it is to be remembered that the narrative has reverted to the third day of the preceding creation. At first sight, then, it might be supposed that the vegetable species were not created at the hour of that day to which the narrative refers. But it is not stated that young trees were not in existence, but merely that plants of the field were not yet in the land. Of the herbs it is only said that they had not yet sent forth a bud or blade. And the actual existence of both trees and herbs is implied in what follows. The reasons for the state of things above described are the lack of rain to water the soil, and of man to cultivate it. These would only suffice for growth if the vegetable seeds, at least, were already in existence. Now, the plants were made before the seeds Genesis 1:11-12, and therefore the first full-grown and seed-bearing sets of each kind were already created. Hence, we infer that the state of things described in the text was this: The original trees were confined to a center of vegetation, from which it was intended that they should spread in the course of nature. At the present juncture, then, there was not a tree of the field, a tree of propagation, in the land; and even the created trees had not sent down a single root of growth into the land. And if they had dropped a seed, it was only on the land, and not in the land, as it had not yet struck root.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Not a plant of the field was yet in the land. - Here it is to be remembered that the narrative has reverted to the third day of the preceding creation. At first sight, then, it might be supposed that the vegetable species were not created at the hour of that day to which the narrative refers. But it is not stated that young trees were not in existence, but merely that plants of the field were not yet in the land. Of the herbs it is only said that they had not yet sent forth a bud or blade. And the actual existence of both trees and herbs is implied in what follows. The reasons for the state of things above described are the lack of rain to water the soil, and of man to cultivate it. These would only suffice for growth if the vegetable seeds, at least, were already in existence. Now, the plants were made before the seeds ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and therefore the first full-grown and seed-bearing sets of each kind were already created. Hence, we infer that the state of things described in the text was this: The original trees were confined to a center of vegetation, from which it was intended that they should spread in the course of nature. At the present juncture, then, there was not a tree of the field, a tree of propagation, in the land; and even the created trees had not sent down a single root of growth into the land. And if they had dropped a seed, it was only on the land, and not in the land, as it had not yet struck root.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And not an herb of the field yet grew. - The herbage seems to have been more widely diffused than the trees. Hence, it is not said that they were not in the land, as it is said of field trees. But at the present moment not an herb had exhibited any signs of growth or sent forth a single blade beyond the immediate product of creative power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rain upon the land - and man to till it, were the two needs that retarded vegetation. These two means of promoting vegetable growth differed in their importance and in their mode of application. Moisture is absolutely necessary, and where it is supplied in abundance the shifting wind will in the course of time waft the seed. The browsing herds will aid in the same process of diffusion. Man comes in merely as an auxiliary to nature in preparing the soil and depositing the seeds and plants to the best advantage for rapid growth and abundant fruitfulness. The narrative, as usual, notes only the chief things. Rain is the only source of vegetable sap; man is the only intentional cultivator.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Rain upon the land - and man to till it, were the two needs that retarded vegetation. These two means of promoting vegetable growth differed in their importance and in their mode of application. Moisture is absolutely necessary, and where it is supplied in abundance the shifting wind will in the course of time waft the seed. The browsing herds will aid in the same process of diffusion. Man comes in merely as an auxiliary to nature in preparing the soil and depositing the seeds and plants to the best advantage for rapid growth and abundant fruitfulness. The narrative, as usual, notes only the chief things. Rain is the only source of vegetable sap; man is the only intentional cultivator.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. rain, mist—(See on [5]Ge 1:11).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Before it was in the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. when as yet there were no plants, nor so much as seeds of them, there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Before it grew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, out of the earth, as afterwards they did by God’s appointment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The two great means of the growth of plants and herbs, viz. rain from heaven, and the labour of man, were both lacking, to show that they were now brought forth by God’s almighty power and word. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And every plant of the field, before it was in the earth,.... That is, God made it, even he who made the heavens and the earth; for these words depend upon the preceding, and are in close connection with them; signifying that the plants of the field, which were made out of the earth on the third day, were made before any were planted in it, or any seed was sown therein from whence they could proceed, and therefore must be the immediate production of divine power: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and every herb of the field before it grew: those at once sprung up in perfection out of the earth, before there were any that budded forth, and grew up by degrees to perfection, as herbs do now: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord God had not caused it to rain upon the earth: so that the production of plants and herbs in their first formation could not be owing to that; since on the third day, when they were made, there was no sun to exhale and draw up the waters into the clouds, in order to be let down again in showers of rain: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and there was not a man to till the ground; who was not created till the sixth day, and therefore could have no concern in the cultivation of the earth, and of the plants and herbs in it; but these were the produce of almighty power, without the use of any means: some Jewish writers (f), by the plant and herb of the field, mystically understand the first and second Messiah, for they sometimes feign two; see Isaiah 4:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and there was not a man to till the ground; who was not created till the sixth day, and therefore could have no concern in the cultivation of the earth, and of the plants and herbs in it; but these were the produce of almighty power, without the use of any means: some Jewish writers (f), by the plant and herb of the field, mystically understand the first and second Messiah, for they sometimes feign two; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Zohar in Gen. fol. 32. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Zohar in Gen. fol. 32. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And every plant of the field before it was in the earth, and every herb of the field before it grew: for the LORD God had not caused it to {d} rain upon the earth, and there was not a man to till the ground.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And every plant of the field before it was in the earth, and every herb of the field before it grew: for the LORD God had not caused it to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rain upon the earth, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not a man to till the ground.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) God only opens the heavens and shuts them, he sends drought and rain according to his good pleasure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And no plant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] If, as is possible, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " are a parenthesis then ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " carries on the sentence of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " b. The whole sentence would then run, “At the time when Jehovah Elohim made earth and heaven (there was as yet no plant of the field … face of the ground), Jehovah Elohim formed man.” But this arrangement is too cumbrous to be probable. Moreover, the state of things described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is evidently one of considerable duration; it intervenes between the making of the earth and the heavens (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " b) and the formation of man (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is better to regard ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " as the apodosis to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 2:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " b, “At the time when Jehovah Elohim made, &c., (5) there was as yet no plant, &c., (6) but a mist (or, flood) used to come up, &c.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "plant of the field … herb of the field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word “plant “is the same in the original as that rendered “shrub” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the stunted growth of the desert under which Hagar cast her child, and “bushes” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “herb” is the vegetation useful for food and requiring cultivation. There was no “plant” or “bush,” because the Lord God had not yet caused it to rain: there was no “herb,” because there was no man to prepare the ground. In the absence of rain and of tillage there was no vegetation. The ground originally was desert, without tree, bush, or grass.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And every plant of the field before it was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, not yet) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the earth, and every herb of the field before it grew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, had not yet sprouted). Following the LXX., the English Version suggests an intention on the writer's part to emphasize the fact that the vegetation of the globe - here comprehended under the general terms, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", shrub, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "eseb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", herb - was not a natural production, but, equally with the great earth and heavens, was the creation of Jehovah Elohim - a rendering which has the sanction of Taylor Lewis; whereas the writer's object clearly is to depict the appearance of the earth at the time when the man-ward development of the heavens and the earth began. Then not a single plant was in the ground, not a green blade was visible. The land, newly sprung from the waters, was one desolate region of bleak, bare lava-hills and extensive mud-fiats. Up to that point the absence of vegetation is accounted for by the circumstance that the presently existing atmospheric conditions of the globe had not then been established, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for the Lord God had not caused it to rain upon the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the ordinary agricultural operations on which its production was afterwards to depend had not then been begun, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and there was not a man to till the ground",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Genesis 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The account in vv. 5-25 is not a second, complete and independent history of the creation, nor does it contain mere appendices to the account in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it describes the commencement of the history of the human race. This commencement includes not only a complete account of the creation of the first human pair, but a description of the place which God prepared for their abode, the latter being of the highest importance in relation to the self-determination of man, with its momentous consequences to both earth and heaven. Even in the history of the creation man takes precedence of all other creatures, as being created in the image of God and appointed lord of all the earth, though he is simply mentioned there as the last and highest link in the creation. To this our present account is attached, describing with greater minuteness the position of man in the creation, and explaining the circumstances which exerted the greatest influence upon his subsequent career. These circumstances were-the formation of man from the dust of the earth and the divine breath of life; the tree of knowledge in paradise; the formation of the woman, and the relation of the woman to the man. Of these three elements, the first forms the substratum to the other two. Hence the more exact account of the creation of Adam is subordinated to, and inserted in, the description of paradise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with which the narrative commences, there is an evident allusion to paradise: \"And as yet there was (arose, grew) no shrub of the field upon the earth, and no herb of the field sprouted; for Jehovah El had not caused it to rain upon the earth, and there was no man to till the ground; and a mist arose from the earth and watered the whole surface of the ground.\" היה in parallelism with צמח means to become, to arise, to proceed. Although the growth of the shrubs and sprouting of the herbs are represented here as dependent upon the rain and the cultivation of the earth by man, we must not understand the words as meaning that there was neither shrub nor herb before the rain and dew, or before the creation of man, and so draw the conclusion that the creation of the plants occurred either after or contemporaneously with the creation of man, in direct contradiction to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The creation of the plants is not alluded to here at all, but simply the planting of the garden in Eden. The growing of the shrubs and sprouting of the herbs is different from the creation or first production of the vegetable kingdom, and relates to the growing and sprouting of the plants and germs which were called into existence by the creation, the natural development of the plants as it had steadily proceeded ever since the creation. This was dependent upon rain and human culture; their creation was not. Moreover, the shrub and herb of the field do not embrace the whole of the vegetable productions of the earth. It is not a fact that the field is used in the second section in the same sense as the earth in the first.\" שׂדה is not \"the widespread plain of the earth, the broad expanse of land,\" but a field of arable land, soil fit for cultivation, which forms only a part of the \"earth\" or \"ground.\" Even the \"beast of the field\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not synonymous with the \"beast of the earth\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but is a more restricted term, denoting only such animals as live upon the field and are supported by its produce, whereas the \"beast of the earth\" denotes all wild beasts as distinguished from tame cattle and reptiles. In the same way, the \"shrub of the field\" consists of such shrubs and tree-like productions of the cultivated land as man raises for the sake of their fruit, and the \"herb of the field,\" all seed-producing plants, both corn and vegetables, which serve as food for man and beast. - The mist (אד, vapour, which falls as rain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 36:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is correctly regarded by Delitzsch as the creative beginning of the rain (המטיר) itself, from which we may infer, therefore, that it rained before the flood. ",
        "children": []
      }
    ]
  }
]