[{"header":"Nathan pronounces God’s judgment"},{"num":12,"verse":"So the Lord sent Nathan to David. When Nathan arrived he said, “There were two men in the same city, one rich, one poor."},{"num":2,"verse":"The rich man had a lot of sheep and cattle,"},{"num":3,"verse":"but the poor man had nothing—just one small ewe lamb that he had bought. He raised that lamb, and it grew up with him and his children. It would eat from his food and drink from his cup—even sleep in his arms! It was like a daughter to him."},{"num":4,"verse":"“Now a traveler came to visit the rich man, but he wasn’t willing to take anything from his own flock or herd to prepare for the guest who had arrived. Instead, he took the poor man’s ewe lamb and prepared it for the visitor.”"},{"num":5,"verse":"David got very angry at the man, and he said to Nathan, “As surely as the Lord lives, the one who did this is demonic!"},{"num":6,"verse":"He must restore the ewe lamb seven times over because he did this and because he had no compassion.”"},{"num":7,"verse":"“You are that man!” Nathan told David. “This is what the Lord God of Israel says: I anointed you king over Israel and delivered you from Saul’s power."},{"num":8,"verse":"I gave your master’s house to you, and gave his wives into your embrace. I gave you the house of Israel and Judah. If that was too little, I would have given even more."},{"num":9,"verse":"Why have you despised the Lord’s word by doing what is evil in his eyes? You have struck down Uriah the Hittite with the sword and taken his wife as your own. You used the Ammonites to kill him."},{"num":10,"verse":"Because of that, because you despised me and took the wife of Uriah the Hittite as your own, the sword will never leave your own house."},{"num":11,"verse":"“This is what the Lord says: I am making trouble come against you from inside your own family. Before your very eyes I will take your wives away and give them to your friend, and he will have sex with your wives in broad daylight."},{"num":12,"verse":"You did what you did secretly, but I will do what I am doing before all Israel in the light of day.”"},{"num":13,"verse":"“I’ve sinned against the Lord!” David said to Nathan."},{"num":14,"verse":"However, because you have utterly disrespected the Lord by doing this, the son born to you will definitely die.”"},{"num":15,"verse":"Then Nathan went home."},{"header":"Bathsheba’s child dies"},{"num":16,"verse":"David begged God for the boy. He fasted and spent the night sleeping on the ground."},{"num":17,"verse":"The senior servants of his house approached him to lift him up off the ground, but he refused, and he wouldn’t eat with them either."},{"num":18,"verse":"On the seventh day, the child died. David’s servants were afraid to tell him that the child had died. “David wouldn’t listen to us when we talked to him while the child was still alive,” they said. “How can we tell him the child has died? He’ll do something terrible!”"},{"num":19,"verse":"But when David saw his servants whispering, he realized the child had died."},{"num":20,"verse":"Then David rose from the ground, bathed, anointed himself, and changed his clothes. He entered the Lord’s house and bowed down. Then he entered his own house. He requested food, which was brought to him, and he ate."},{"num":21,"verse":"“Why are you acting this way?” his servants asked. “When the child was alive, you fasted and cried and kept watch, but now that the child is dead, you get up and eat food!”"},{"num":22,"verse":"David replied, “While the child was alive I fasted and wept because I thought, Who knows? The Lord may have mercy on me and let the child live."},{"num":23,"verse":"But he is dead now. Why should I fast? Can I bring him back again? No. I am going where he is, but he won’t come back to me.”"},{"num":24,"verse":"Then David comforted his wife Bathsheba. He went to her and had sex with her. She gave birth to a son and named him Solomon. The Lord loved him"},{"num":25,"verse":"and sent word by the prophet Nathan to name him Jedidiah because of the Lord’s grace."},{"header":"Defeat of the Ammonites"},{"num":26,"verse":"Meanwhile, Joab fought the Ammonites at Rabbah and captured the royal city."},{"num":27,"verse":"Joab then sent messengers to David, saying, “I have fought against Rabbah and captured the city’s water supply."},{"num":28,"verse":"So gather the rest of the troops, attack the city, and capture it. Otherwise, I will capture the city myself, and it will be named after me.”"},{"num":29,"verse":"So David gathered all the troops, marched to Rabbah, fought against it, and captured it."},{"num":30,"verse":"David took Milcom’s crown off his head. It weighed one kikkar of gold and was set with a valuable stone. It was placed on David’s head. The amount of loot David took from the city was huge."},{"num":31,"verse":"He brought out the people who were in the city and put them to work making bricks. David demolished the city with saws, iron picks, and axes; he did this to all the Ammonite cities. Then David and all the troops returned to Jerusalem."}]