[{"header":"Nathan Speaks to David"},{"num":12,"verse":"The Lord sent Nathan to David. Nathan went to him and said, “There were two men in a city. One man was rich, but the other man was poor."},{"num":2,"verse":"The rich man had lots of sheep and cattle."},{"num":3,"verse":"But the poor man had nothing except one little female lamb that he bought. The poor man fed the lamb, and the lamb grew up with this poor man and his children. She ate from the poor man’s food and drank from his cup. The lamb slept on the poor man’s chest. The lamb was like a daughter to the poor man."},{"num":4,"verse":"“Then a traveler stopped to visit the rich man. The rich man wanted to give food to the traveler, but he did not want to take any of his own sheep or cattle to feed the traveler. No, the rich man took the lamb from the poor man and cooked it for his visitor.”"},{"num":5,"verse":"David became very angry with the rich man. He said to Nathan, “As the Lord lives, the man who did this should die!"},{"num":6,"verse":"He must pay four times the price of the lamb because he did this terrible thing and because he had no mercy.”"},{"header":"Nathan Tells David About His Sin"},{"num":7,"verse":"Then Nathan said to David, “You are that rich man! This is what the Lord, the God of Israel, says: ‘I chose you to be the king of Israel. I saved you from Saul."},{"num":8,"verse":"I let you take his family and his wives, and I made you king of Israel and Judah. As if that had not been enough, I would have given you more and more."},{"num":9,"verse":"So why did you ignore my command? Why did you do what I say is wrong? You let the Ammonites kill Uriah the Hittite, and you took his wife. It is as if you yourself killed Uriah in war."},{"num":10,"verse":"So your family will never have peace! When you took Uriah’s wife, you showed that you did not respect me.’"},{"num":11,"verse":"“This is what the Lord says: ‘I am bringing trouble against you. This trouble will come from your own family. I will take your wives from you and give them to someone who is very close to you. He will have sexual relations with your wives, and everyone will know it!"},{"num":12,"verse":"You had sexual relations with Bathsheba in secret, but I will punish you so that all the people of Israel can see it.’”"},{"num":13,"verse":"Then David said to Nathan, “I have sinned against the Lord.”"},{"num":14,"verse":"But you did things that made the Lord’s enemies lose their respect for him, so your new baby son will die.”"},{"header":"David and Bathsheba’s Baby Dies"},{"num":15,"verse":"Then Nathan went home. And the Lord caused the baby boy who was born to David and Uriah’s wife to become very sick."},{"num":16,"verse":"David prayed to God for the baby. David refused to eat or drink. He went into his house and stayed there and lay on the ground all night."},{"num":17,"verse":"The leaders of David’s family came and tried to pull David up from the ground, but he refused to get up. He refused to eat with these leaders."},{"num":18,"verse":"On the seventh day the baby died. David’s servants were afraid to tell him that the baby was dead. They said, “Look, we tried to talk to David while the baby was alive, but he refused to listen to us. If we tell David that the baby is dead, he might do something bad to himself.”"},{"num":19,"verse":"David saw his servants whispering and understood that the baby was dead. So David asked his servants, “Is the baby dead?”"},{"num":20,"verse":"Then David got up from the floor. He washed himself. He changed his clothes and got dressed. Then he went into the Lord’s house to worship. After that he went home and asked for something to eat. His servants gave him some food, and he ate."},{"num":21,"verse":"David’s servants asked him, “Why are you doing this? When the baby was alive, you cried and refused to eat. But when the baby died you got up and ate food.”"},{"num":22,"verse":"David said, “While the baby was still living, I cried and refused to eat because I thought, ‘Who knows? Maybe the Lord will feel sorry for me and let the baby live.’"},{"num":23,"verse":"But now the baby is dead, so why should I refuse to eat? Can I bring the baby back to life? No. Some day I will go to him, but he cannot come back to me.”"},{"header":"Solomon Is Born"},{"num":24,"verse":"Then David comforted Bathsheba his wife. He slept with her and had sexual relations with her. Bathsheba became pregnant again and had another son. David named the boy Solomon. The Lord loved Solomon"},{"num":25,"verse":"and sent word for Nathan the prophet to give Solomon the name Jedidiah. So Nathan did this for the Lord."},{"header":"David Captures Rabbah"},{"num":26,"verse":"Rabbah was the capital city of the Ammonites. Joab fought against Rabbah and captured it."},{"num":27,"verse":"Joab sent messengers to David and said, “I have fought against Rabbah and have captured its water supply."},{"num":28,"verse":"Now bring the rest of the army together and attack Rabbah. Capture this city before I do, or else it will be called by my name.”"},{"num":29,"verse":"So David gathered all the soldiers together and went to Rabbah. He fought against Rabbah and captured the city."},{"num":30,"verse":"David took the crown off their king’s head. The crown was gold and weighed about 75 pounds. This crown had precious stones in it. They put the crown on David’s head. David took many valuable things out of the city."},{"num":31,"verse":"David also brought out the people of the city of Rabbah and made them work with saws, iron picks, and axes. He also forced them to build things with bricks. He did the same thing to all the Ammonite cities. Then David and the army went back to Jerusalem."}]