[{"num":65,"verse":"I let Myself be sought of them that asked not for Me; I let Myself be found of them that sought me not; I said, Hineni, behold Me, unto a Goy (Nation, People) that was not called by My Shem."},{"num":2,"verse":"I have spread out My yad kol hayom unto an Am Sorer (stubbornly rebellious people), which walketh in a derech lo tov, after their own machshevot (thoughts);"},{"num":3,"verse":"HaAm that provoketh Me to anger continually to My face; that sacrificeth in ganot (gardens), and burneth sacrifices upon brick;"},{"num":4,"verse":"Which remain among the kevarim, and spend the night in closed places, which eat basar hachazir, and broth of piggulim (unclean meat, Lv.7:18) in their vessels;"},{"num":5,"verse":"Which say, Stand by thyself, come not near to me; for I am kadosh to thee (holier than thou). These are a smoke in My nose, an eish that burneth kol hayom."},{"num":6,"verse":"Hinei, it is written before Me: I will not keep silent, but will recompense fully, even recompense into their kheyk,"},{"num":7,"verse":"Your avonot, and the iniquities of your avot together, saith Hashem, because they burned sacrifices upon the mountains, and insulted Me upon the hills; therefore will I measure their former peulot into their kheyk."},{"num":8,"verse":"Thus saith Hashem, As the tirosh is found in the cluster, and one saith, Destroy it not; for a brocha is in it; so will I do in behalf of My Servants, that I may not destroy them all."},{"num":9,"verse":"And I will bring forth a zera out of Ya’akov, and out of Yehudah a yoresh (inheritor) of My mountains; and Mine Bechir (Chosen ones) shall inherit it, and My Servants shall dwell there."},{"num":10,"verse":"And Sharon shall be a meadow for tzon, and the valley of Achor a place for the flock to lie down, for Ami (My People) who seek Me."},{"num":11,"verse":"But ye are they that forsake Hashem, that forget My Har Kadosh, that prepare a shulchan for Fortune, and that furnish the drink offering for Destiny."},{"num":12,"verse":"Therefore will I destine you for the cherev, and ye shall all bow down to the slaughtering place; because when I called, ye did not answer; when I spoke, ye did not hear; but did the rah before Mine eyes, and did choose that wherein I delighted not."},{"num":13,"verse":"Therefore thus saith Adonoi Hashem, Hinei, My Servants shall eat, but ye shall be hungry; hinei, My Servants shall drink, but ye shall be thirsty; hinei, My Servants shall rejoice, but ye shall be ashamed;"},{"num":14,"verse":"Hinei, My Servants shall sing for joy of lev, but ye shall cry out from anguish of lev, and shall wail from brokenness of ruach."},{"num":15,"verse":"And ye shall leave your shem for a curse unto My Bechir; for Adonoi Hashem shall put thee to death, and call His Avadim by another shem;"},{"num":16,"verse":"That he who blesseth himself in ha’aretz shall bless himself by Elohei Omein (the G-d of [the] Amen, the G-d of Truth); and he that taketh an oath in ha’aretz shall take the oath by Elohei Omein; because the former tzoros are forgotten, and because they are hid from Mine eyes."},{"num":17,"verse":"For, hinei, I create Shomayim Chadashim and eretz Chadashah; and the rishonot shall not be remembered, nor come into mind."},{"num":18,"verse":"But be ye glad and rejoice forever in that which I create; for, hinei, I create Yerushalayim a rejoicing, and her people a joy."},{"num":19,"verse":"And I will rejoice in Yerushalayim, and joy in Ami; and the voice of weeping shall be no more heard in her, nor the voice of crying out."},{"num":20,"verse":"There shall be no more in there an infant of days, nor a zaken (old man) that hath not filled his days; for he that shall die a hundred years old will be regarded a na’ar; but the choteh (sinner), a hundred years old, will be accursed."},{"num":21,"verse":"And they shall build batim (houses), and inhabit them; and they shall plant kramim (vineyards), and eat the fruit of them."},{"num":22,"verse":"They shall not build, and another inhabit; they shall not plant, and another eat; for as the days of HaEtz are the days of Ami, and Mine Bechir shall long enjoy the ma’aseh of their hands."},{"num":23,"verse":"They shall not labor in vain, nor bring forth for misfortune; for they are the Zera Beruchei Hashem (Seed of the Blessed ones of Hashem), and their offspring with them."},{"num":24,"verse":"And it shall come to pass, that before they call, I will answer; and while they are yet medaberim (speaking), I will hear."},{"num":25,"verse":"The wolf and the lamb shall feed together, and the lion shall eat straw like the ox; and aphar shall be the lechem of the nachash. They shall not hurt nor destroy in all My Har Kadosh, saith Hashem. [T.N. This last chapter makes a reference to Gehinnom and the just retribution coming.]"}]