[{"header":"Jehoshaphat Faces War"},{"num":20,"verse":"Later, the Moabites, the Ammonites, and some Meunites came to start a war with Jehoshaphat."},{"num":2,"verse":"Some men came and told Jehoshaphat, “There is a large army coming against you from Edom. They are coming from the other side of the Dead Sea. They are already in Hazazon Tamar!” (Hazazon Tamar is also called En Gedi.)"},{"num":3,"verse":"Jehoshaphat became afraid, and he decided to ask the Lord what to do. He announced a time of fasting for everyone in Judah."},{"num":4,"verse":"The people of Judah came together to ask the Lord for help. They came from out of all the towns of Judah to ask for the Lord’s help."},{"num":5,"verse":"Jehoshaphat was in the new courtyard of the Lord’s Temple. He stood up in the meeting of the people from Judah and Jerusalem"},{"num":6,"verse":"and said,"},{"num":7,"verse":"You are our God! You forced the people living in this land to leave. You did this in front of your people Israel. You gave this land to the descendants of Abraham forever. Abraham was your friend."},{"num":8,"verse":"His descendants lived in this land, and built a Temple for your name."},{"num":9,"verse":"They said, ‘If trouble comes to us—the sword, punishment, sicknesses, or famine—we will stand in front of this Temple and in front of you. Your name is on this Temple. We will shout to you when we are in trouble. Then you will hear and save us.’"},{"num":10,"verse":"“But now, here are men from Ammon, Moab, and Mount Seir. You would not let the Israelites enter their lands when they came out of Egypt. So the Israelites turned away and didn’t destroy them."},{"num":11,"verse":"But see the kind of reward those people give us for not destroying them. They have come to force us out of your land that you gave to us."},{"num":12,"verse":"Our God, punish those people. We don’t have the strength to stop this large army that is coming against us. We don’t know what to do! We are looking to you for help.”"},{"num":13,"verse":"All the men of Judah stood before the Lord with their wives, babies, and children."},{"num":14,"verse":"Then the Spirit of the Lord came on Jahaziel son of Zechariah. (Zechariah was the son of Benaiah, the son of Jeiel, the son of Mattaniah.) Jahaziel was a Levite from the family of Asaph. In the middle of the meeting,"},{"num":15,"verse":"Jahaziel said, “Listen to me King Jehoshaphat and everyone living in Judah and Jerusalem! The Lord says this to you: ‘Don’t be afraid or worry about this large army, because the battle is not your battle. It is God’s battle!"},{"num":16,"verse":"Tomorrow, they will come up through the Ziz Pass. You must go down to them. You will find them at the end of the valley on the other side of the desert of Jeruel."},{"num":17,"verse":"You will not have to fight this battle. Just stand there and watch the Lord save you. Judah and Jerusalem, don’t be afraid. Don’t worry, because the Lord is with you. So go out to stand against those people tomorrow.’”"},{"num":18,"verse":"Jehoshaphat bowed with his face to the ground. And all the people of Judah and Jerusalem bowed down before the Lord and worshiped him."},{"num":19,"verse":"The Levites from the Kohath family groups and the Korah family stood up to praise the Lord, the God of Israel. They sang very loudly."},{"num":20,"verse":"Early the next morning, Jehoshaphat’s army went out into the desert of Tekoa. As they marched out, Jehoshaphat stood there saying, “Listen to me, men of Judah and Jerusalem. Have faith in the Lord your God, and you will stand strong! Have faith in his prophets, and you will succeed!”"},{"num":21,"verse":"Jehoshaphat encouraged the men and gave them instructions. Then he had the Temple singers stand up in their special clothes to praise the Lord. They marched in front of the army and sang,"},{"num":22,"verse":"As they began to sing and to praise God, the Lord set an ambush for the army from Ammon, Moab, and Mount Seir who had come to attack Judah. The enemy was defeated!"},{"num":23,"verse":"The Ammonites and the Moabites started to fight the men from Mount Seir. After they killed them, the Ammonites and Moabites turned on themselves and killed each other."},{"num":24,"verse":"The men from Judah arrived at the lookout point in the desert. They looked for the enemy’s large army, but all they saw were dead bodies lying on the ground. There were no survivors."},{"num":25,"verse":"Jehoshaphat and his army came to take things from the bodies. They found many animals, riches, clothes, and other valuable things. It was more than Jehoshaphat and his men could carry away. There was so much that they spent three days taking everything from the dead bodies."},{"num":26,"verse":"On the fourth day Jehoshaphat and his army met in the Valley of Beracah. They praised the Lord. That is why people still call that place, “The Valley of Beracah.”"},{"num":27,"verse":"All the men from Judah and Jerusalem were very happy as they marched back to Jerusalem with Jehoshaphat in the front. The Lord made them very happy when he defeated their enemy."},{"num":28,"verse":"They entered Jerusalem with lyres, harps, and trumpets and went to the Temple of the Lord."},{"num":29,"verse":"People in all the surrounding kingdoms became afraid of God when they heard that the Lord fought against the enemies of Israel."},{"num":30,"verse":"That is why there was peace for Jehoshaphat’s kingdom—his God brought him rest from the enemies that were all around him."},{"header":"Summary of Jehoshaphat’s Rule"},{"num":31,"verse":"Jehoshaphat ruled over the country of Judah. He was 35 years old when he became king, and he ruled 25 years in Jerusalem. His mother’s name was Azubah, the daughter of Shilhi."},{"num":32,"verse":"Like his father Asa, Jehoshaphat was good and did everything that the Lord wanted, except he did not destroy the high places. Also, the people did not turn back to the God their ancestors worshiped."},{"num":34,"verse":"Everything else Jehoshaphat did, from beginning to end, is written in The Official Records of Jehu Son of Hanani. It was copied and included in the book, The History of the Kings of Israel."},{"num":35,"verse":"Later on, King Jehoshaphat of Judah made an agreement with King Ahaziah of Israel. Ahaziah was very evil."},{"num":36,"verse":"Jehoshaphat joined with Ahaziah to make ships to go to the town of Tarshish. They built some ships at Ezion Geber."},{"num":37,"verse":"There was a man from the town of Mareshah named Eliezer son of Dodavahu. He spoke against Jehoshaphat and said, “Jehoshaphat, since you have joined with Ahaziah, the Lord will destroy what you have built.” The ships were wrecked, so Jehoshaphat and Ahaziah were not able to send them to Tarshish."}]