[{"num":20,"verse":"Later on the armies of the kings of Moab, Ammon, and of the Meunites declared war on Jehoshaphat and the people of Judah. "},{"num":2,"verse":"Word reached Jehoshaphat that “a vast army is marching against you from beyond the Dead Sea from Syria. It is already at Hazazon-tamar” (also called Engedi). "},{"num":3,"verse":"Jehoshaphat was badly shaken by this news and determined to beg for help from the Lord; so he announced that all the people of Judah should go without food for a time, in penitence and intercession before God. "},{"num":4,"verse":"People from all across the nation came to Jerusalem to plead unitedly with him. "},{"num":5,"verse":"Jehoshaphat stood among them as they gathered at the new court of the Temple and prayed this prayer:"},{"num":6,"verse":"“O Lord God of our fathers—the only God in all the heavens, the ruler of all the kingdoms of the earth—you are so powerful, so mighty. Who can stand against you? "},{"num":7,"verse":"O our God, didn’t you drive out the heathen who lived in this land when your people arrived? And didn’t you give this land forever to the descendants of your friend Abraham? "},{"num":8,"verse":"Your people settled here and built this Temple for you, "},{"num":9,"verse":"truly believing that in a time like this—whenever we are faced with any calamity such as war, disease, or famine—we can stand here before this Temple and before you—for you are here in this Temple—and cry out to you to save us; and that you will hear us and rescue us."},{"num":10,"verse":"“And now see what the armies of Ammon, Moab, and Mount Seir are doing. You wouldn’t let our ancestors invade those nations when Israel left Egypt, so we went around and didn’t destroy them. "},{"num":11,"verse":"Now see how they reward us! For they have come to throw us out of your land which you have given us. "},{"num":12,"verse":"O our God, won’t you stop them? We have no way to protect ourselves against this mighty army. We don’t know what to do, but we are looking to you.”"},{"num":13,"verse":"As the people from every part of Judah stood before the Lord with their little ones, wives, and children, "},{"num":14,"verse":"the Spirit of the Lord came upon one of the men standing there—Jahaziel (son of Zechariah, son of Benaiah, son of Jeiel, son of Mattaniah the Levite, who was one of the sons of Asaph)."},{"num":15,"verse":"“Listen to me, all you people of Judah and Jerusalem, and you, O king Jehoshaphat!” he exclaimed. “The Lord says, ‘Don’t be afraid! Don’t be paralyzed by this mighty army! For the battle is not yours, but God’s! "},{"num":16,"verse":"Tomorrow, go down and attack them! You will find them coming up the slopes of Ziz at the end of the valley that opens into the wilderness of Jeruel. "},{"num":17,"verse":"But you will not need to fight! Take your places; stand quietly and see the incredible rescue operation God will perform for you, O people of Judah and Jerusalem! Don’t be afraid or discouraged! Go out there tomorrow, for the Lord is with you!’”"},{"num":18,"verse":"Then King Jehoshaphat fell to the ground with his face to the earth, and all the people of Judah and the people of Jerusalem did the same, worshiping the Lord. "},{"num":19,"verse":"Then the Levites of the Kohath clan and the Korah clan stood to praise the Lord God of Israel with songs of praise that rang out strong and clear."},{"num":20,"verse":"Early the next morning the army of Judah went out into the wilderness of Tekoa. On the way Jehoshaphat stopped and called them to attention. “Listen to me, O people of Judah and Jerusalem,” he said. “Believe in the Lord your God and you shall have success! Believe his prophets and everything will be all right!”"},{"num":21,"verse":"After consultation with the leaders of the people, he determined that there should be a choir leading the march, clothed in sanctified garments and singing the song “His Loving-Kindness Is Forever” as they walked along praising and thanking the Lord! "},{"num":22,"verse":"And at the moment they began to sing and to praise, the Lord caused the armies of Ammon, Moab, and Mount Seir to begin fighting among themselves, and they destroyed each other! "},{"num":23,"verse":"For the Ammonites and Moabites turned against their allies from Mount Seir and killed every one of them. And when they had finished that job, they turned against each other! "},{"num":24,"verse":"So, when the army of Judah arrived at the watchtower that looks out over the wilderness, as far as they could look there were dead bodies lying on the ground—not a single one of the enemy had escaped. "},{"num":25,"verse":"King Jehoshaphat and his people went out to plunder the bodies and came away loaded with money, garments, and jewels stripped from the corpses—so much that it took them three days to cart it all away! "},{"num":26,"verse":"On the fourth day they gathered in the Valley of Blessing, as it is called today, and how they praised the Lord!"},{"num":27,"verse":"Then they returned to Jerusalem, with Jehoshaphat leading them, full of joy that the Lord had given them this marvelous rescue from their enemies. "},{"num":28,"verse":"They marched into Jerusalem accompanied by a band of harps, lyres, and trumpets and proceeded to the Temple. "},{"num":29,"verse":"And as had happened before, when the surrounding kingdoms heard that the Lord himself had fought against the enemies of Israel, the fear of God fell upon them. "},{"num":30,"verse":"So Jehoshaphat’s kingdom was quiet, for his God had given him rest."},{"num":31,"verse":"A thumbnail sketch of King Jehoshaphat: He became king of Judah when he was thirty-five years old and reigned twenty-five years in Jerusalem. His mother’s name was Azubah, the daughter of Shilhi. "},{"num":32,"verse":"He was a good king, just as his father Asa was. He continually tried to follow the Lord "},{"num":33,"verse":"with the exception that he did not destroy the idol shrines on the hills, nor had the people as yet really decided to follow the God of their ancestors."},{"num":34,"verse":"The details of Jehoshaphat’s reign from first to last are written in the history of Jehu the son of Hanani, which is inserted in The Annals of the Kings of Israel."},{"num":35,"verse":"But at the close of his life, Jehoshaphat, king of Judah, went into partnership with Ahaziah, king of Israel, who was a very wicked man. "},{"num":36,"verse":"They made ships in Ezion-geber to sail to Tarshish. "},{"num":37,"verse":"Then Eliezer, son of Dodavahu from Mareshah, prophesied against Jehoshaphat, telling him, “Because you have allied yourself with King Ahaziah, the Lord has destroyed your work.” So the ships met disaster and never arrived at Tarshish."}]