[{"header":"On the Island of Malta"},{"num":28,"verse":"After reaching land safely, we learned that the island was called Malta."},{"num":2,"verse":"The islanders showed us extraordinary kindness. Because it was rainy and cold, they built a fire and welcomed all of us."},{"num":3,"verse":"Paul gathered a bunch of dry sticks and put them on the fire. As he did, a poisonous snake, driven out by the heat, latched on to his hand."},{"num":4,"verse":"When the islanders saw the snake hanging from his hand, they said to each other, “This man must be a murderer! He was rescued from the sea, but the goddess Justice hasn’t let him live!”"},{"num":5,"verse":"Paul shook the snake into the fire and suffered no harm."},{"num":6,"verse":"They expected him to swell up with fever or suddenly drop dead. After waiting a long time and seeing nothing unusual happen to him, they changed their minds and began to claim that he was a god."},{"num":7,"verse":"Publius, the island’s most prominent person, owned a large estate in that area. He welcomed us warmly into his home as his guests for three days."},{"num":8,"verse":"Publius’ father was bedridden, sick with a fever and dysentery. Paul went to see him and prayed. He placed his hand on him and healed him."},{"num":9,"verse":"Once this happened, the rest of the sick on the island came to him and were healed."},{"num":10,"verse":"They honored us in many ways. When we were getting ready to sail again, they supplied us with what we needed."},{"header":"Paul makes it to Rome"},{"num":11,"verse":"After three months we put out to sea in a ship that had spent the winter at the island. It was an Alexandrian ship with carvings of the twin gods Castor and Pollux as its figurehead."},{"num":12,"verse":"We landed in Syracuse where we stayed three days."},{"num":13,"verse":"From there we sailed to Rhegium. After one day a south wind came up, and we arrived on the second day in Puteoli."},{"num":14,"verse":"There we found brothers and sisters who urged us to stay with them for a week. In this way we came to Rome."},{"num":15,"verse":"When the brothers and sisters there heard about us, they came as far as the Forum of Appius and the Three Taverns to meet us. When Paul saw them, he gave thanks to God and was encouraged."},{"num":16,"verse":"When we entered Rome, Paul was permitted to live by himself, with a soldier guarding him."},{"header":"Paul meets Jewish leaders in Rome"},{"num":17,"verse":"Three days later, Paul called the Jewish leaders together. When they gathered, he said, “Brothers, although I have done nothing against our people or the customs of our ancestors, I’m a prisoner from Jerusalem. They handed me over to the Romans,"},{"num":18,"verse":"who intended to release me after they examined me, because they couldn’t find any reason for putting me to death."},{"num":19,"verse":"When the Jews objected, I was forced to appeal to Caesar. Don’t think I appealed to Caesar because I had any reason to bring charges against my nation."},{"num":20,"verse":"This is why I asked to see you and speak with you: it’s because of the hope of Israel that I am bound with this chain.”"},{"num":21,"verse":"They responded, “We haven’t received any letters about you from Judea, nor have any of our brothers come and reported or said anything bad about you."},{"num":22,"verse":"But we think it’s important to hear what you think, for we know that people everywhere are speaking against this faction.”"},{"num":23,"verse":"On the day scheduled for this purpose, many people came to the place where he was staying. From morning until evening, he explained and testified concerning God’s kingdom and tried to convince them about Jesus through appealing to the Law from Moses and the Prophets."},{"num":24,"verse":"Some were persuaded by what he said, but others refused to believe."},{"num":25,"verse":"They disagreed with each other and were starting to leave when Paul made one more statement: “The Holy Spirit spoke correctly when he said to your ancestors through Isaiah the prophet,"},{"num":28,"verse":"“Therefore, be certain of this: God’s salvation has been sent to the Gentiles. They will listen!”"},{"header":"Paul’s ministry in Rome"},{"num":30,"verse":"Paul lived in his own rented quarters for two full years and welcomed everyone who came to see him."},{"num":31,"verse":"Unhindered and with complete confidence, he continued to preach God’s kingdom and to teach about the Lord Jesus Christ."}]