[[],[{"type":"header","content":"Safe at Malta"},{"type":"prose","content":"When they had been brought safely through, then we found out that the island was called Malta."}],[{"type":"prose","content":"The natives showed us extraordinary kindness, for they kindled a fire and took us all in because of the rain that had started and because of the cold."}],[{"type":"prose","content":"But when Paul had gathered a bundle of sticks and laid them on the fire, a viper came out because of the heat and fastened itself on his hand."}],[{"type":"prose","content":"When the natives saw the creature hanging from his hand, they  saying to one another, “Undoubtedly this man is a murderer, and though he has been saved from the sea, justice has not allowed him to live.”"}],[{"type":"prose","content":"However, Paul shook the creature off into the fire and suffered no harm."}],[{"type":"prose","content":"Now they were expecting that he was going to swell up or suddenly fall down dead. But after they had waited a long time and had seen nothing unusual happen to him, they changed their minds and  to say that he was a god."}],[{"type":"prose","content":"Now in the neighboring parts of that place were lands belonging to the leading man of the island, named Publius, who welcomed us and entertained us warmly for three days."}],[{"type":"prose","content":"And it happened that the father of Publius was lying  afflicted with a  fever and dysentery. Paul went in  him, and after he prayed, he laid his hands on him and healed him."}],[{"type":"prose","content":"After this happened, the rest of the people on the island who had diseases were coming to him and being cured."}],[{"type":"prose","content":"They also showed us many honors, and when we were  set sail, they supplied  with everything we needed."}],[{"type":"header","content":"Paul Arrives in Rome"},{"type":"prose","content":"After three months we set sail on an Alexandrian ship which had wintered at the island, and which had the Twin Brothers for its figurehead."}],[{"type":"prose","content":"After we put in at Syracuse, we stayed there for three days."}],[{"type":"prose","content":"From there we sailed around and arrived at Rhegium, and a day later a south wind came up, and on the second day we came to Puteoli."}],[{"type":"prose","content":"There we found  brothers , and were invited to stay with them for seven days; and that is how we came to Rome."}],[{"type":"prose","content":"And from there the brothers , when they heard about us, came as far as the Market of Appius and the Three Inns to meet us; and when Paul saw them, he thanked God and took courage."}],[{"type":"prose","content":"When we entered Rome, Paul was allowed to stay by himself, with the soldier who was guarding him."}],[{"type":"prose","content":"After three days Paul called together those who were the leading men of the Jews, and when they came together, he  saying to them, “Brothers, though I had done nothing against our people or the customs of our fathers,  I was handed over to the Romans as a prisoner from Jerusalem."}],[{"type":"prose","content":"And when they had examined me, they were willing to release me because there were no grounds for putting me to death."}],[{"type":"prose","content":"But when the Jews objected, I was forced to appeal to Caesar, not that I had any accusation against my nation."}],[{"type":"prose","content":"For this reason, therefore, I requested to see you and to speak with you, since I am wearing this chain for the sake of the hope of Israel.”"}],[{"type":"prose","content":"They said to him, “We have neither received letters from Judea concerning you, nor has any of the brothers come here and reported or spoken anything bad about you."}],[{"type":"prose","content":"But we desire to hear from you what your views are; for regarding this sect, it is known to us that it is spoken against everywhere.”"}],[{"type":"prose","content":"When they had set a day for Paul,  came to him at his lodging in large numbers; and he was explaining to them by solemnly testifying about the kingdom of God and trying to persuade them concerning Jesus, from both the Law of Moses and from the Prophets, from morning until evening."}],[{"type":"prose","content":"Some were being persuaded by the things said , but others would not believe."}],[{"type":"prose","content":"And when they disagreed with one another, they  leaving after Paul said one  statement: “The Holy Spirit rightly spoke through Isaiah the prophet to your fathers,"}],[{"type":"prose","content":"saying,"},{"type":"poetry","content":"‘,"},{"type":"poetry","content":"“;"},{"type":"poetry","content":" ;"}],[{"type":"poetry","content":" ,"},{"type":"poetry","content":" ,"},{"type":"poetry","content":";"},{"type":"poetry","content":","},{"type":"poetry","content":","},{"type":"poetry","content":","},{"type":"poetry","content":".”’"}],[{"type":"prose","content":"Therefore, let it be known to you that this salvation of God has been sent to the Gentiles; they will also listen.”"}],[{"type":"prose","content":"Now Paul stayed two full years in his own rented lodging and welcomed all who came to him,"}],[{"type":"prose","content":"preaching the kingdom of God and teaching things about the Lord Jesus Christ with all openness, unhindered."}]]