[{"header":"Paul on the Island of Malta"},{"num":28,"verse":"After we had reached safety, we then learned that the island was called Malta. "},{"num":2,"verse":"The natives showed us unusual kindness. Since it had begun to rain and was cold, they kindled a fire and welcomed all of us round it. "},{"num":3,"verse":"Paul had gathered a bundle of brushwood and was putting it on the fire, when a viper, driven out by the heat, fastened itself on his hand. "},{"num":4,"verse":"When the natives saw the creature hanging from his hand, they said to one another, ‘This man must be a murderer; though he has escaped from the sea, justice has not allowed him to live.’ "},{"num":5,"verse":"He, however, shook off the creature into the fire and suffered no harm. "},{"num":6,"verse":"They were expecting him to swell up or drop dead, but after they had waited a long time and saw that nothing unusual had happened to him, they changed their minds and began to say that he was a god."},{"num":7,"verse":"Now in the neighbourhood of that place were lands belonging to the leading man of the island, named Publius, who received us and entertained us hospitably for three days. "},{"num":8,"verse":"It so happened that the father of Publius lay sick in bed with fever and dysentery. Paul visited him and cured him by praying and putting his hands on him. "},{"num":9,"verse":"After this happened, the rest of the people on the island who had diseases also came and were cured. "},{"num":10,"verse":"They bestowed many honours on us, and when we were about to sail, they put on board all the provisions we needed."},{"header":"Paul Arrives at Rome"},{"num":11,"verse":"Three months later we set sail on a ship that had wintered at the island, an Alexandrian ship with the Twin Brothers as its figurehead. "},{"num":12,"verse":"We put in at Syracuse and stayed there for three days; "},{"num":13,"verse":"then we weighed anchor and came to Rhegium. After one day there a south wind sprang up, and on the second day we came to Puteoli. "},{"num":14,"verse":"There we found believers and were invited to stay with them for seven days. And so we came to Rome. "},{"num":15,"verse":"The believers from there, when they heard of us, came as far as the Forum of Appius and Three Taverns to meet us. On seeing them, Paul thanked God and took courage."},{"num":16,"verse":"When we came into Rome, Paul was allowed to live by himself, with the soldier who was guarding him."},{"header":"Paul and Jewish Leaders in Rome"},{"num":17,"verse":"Three days later he called together the local leaders of the Jews. When they had assembled, he said to them, ‘Brothers, though I had done nothing against our people or the customs of our ancestors, yet I was arrested in Jerusalem and handed over to the Romans. "},{"num":18,"verse":"When they had examined me, the Romans wanted to release me, because there was no reason for the death penalty in my case. "},{"num":19,"verse":"But when the Jews objected, I was compelled to appeal to the emperor—even though I had no charge to bring against my nation. "},{"num":20,"verse":"For this reason therefore I have asked to see you and speak with you, since it is for the sake of the hope of Israel that I am bound with this chain.’ "},{"num":21,"verse":"They replied, ‘We have received no letters from Judea about you, and none of the brothers coming here has reported or spoken anything evil about you. "},{"num":22,"verse":"But we would like to hear from you what you think, for with regard to this sect we know that everywhere it is spoken against.’"},{"header":"Paul Preaches in Rome"},{"num":23,"verse":"After they had fixed a day to meet him, they came to him at his lodgings in great numbers. From morning until evening he explained the matter to them, testifying to the kingdom of God and trying to convince them about Jesus both from the law of Moses and from the prophets. "},{"num":24,"verse":"Some were convinced by what he had said, while others refused to believe. "},{"num":25,"verse":"So they disagreed with each other; and as they were leaving, Paul made one further statement: ‘The Holy Spirit was right in saying to your ancestors through the prophet Isaiah,"},{"num":28,"verse":"Let it be known to you then that this salvation of God has been sent to the Gentiles; they will listen.’"},{"num":30,"verse":"He lived there for two whole years at his own expense and welcomed all who came to him, "},{"num":31,"verse":"proclaiming the kingdom of God and teaching about the Lord Jesus Christ with all boldness and without hindrance."}]