[{"header":"Paul on the Island of Malta"},{"num":28,"verse":"After we had safely reached land, we discovered that the island we were on was Malta. "},{"num":2,"verse":"The people who lived there showed us extraordinary kindness, for they welcomed us around the fire they had built because it was cold and rainy."},{"num":3,"verse":"When Paul had gathered an armful of brushwood and was setting it on the fire, a venomous snake was driven out by the heat and latched onto Paul’s hand with its fangs. "},{"num":4,"verse":"When the islanders saw the snake dangling from Paul’s hand, they said to one another, “No doubt about it, this guy is a murderer. Even though he escaped death at sea, Justice has now caught up with him!”"},{"num":5,"verse":"But Paul shook the snake off, flung it into the fire, and suffered no harm at all. "},{"num":6,"verse":"Everyone watched him, expecting him to swell up or suddenly drop dead. After observing him for a long time and seeing that nothing unusual happened, they changed their minds and said, “He must be a god!”"},{"num":7,"verse":"The Roman governor of the island, named Publius, had his estate nearby. He graciously welcomed us as his houseguests and showed us hospitality for the three days that we stayed with him. "},{"num":8,"verse":"His father lay sick in bed, suffering from fits of high fever and dysentery. So Paul went into his room, and after praying, placed his hands on him. He was instantly healed. "},{"num":9,"verse":"When the people of the island heard about this miracle, they brought all the sick to Paul, and they were also healed. "},{"num":10,"verse":"The islanders honored us greatly, and when we were preparing to set sail again, they gave us all the supplies we needed for our journey."},{"header":"Paul Reaches Rome"},{"num":11,"verse":"After three months we put out to sea on an Egyptian ship from Alexandria that had wintered at the island. The ship had carved on its prow as its emblem the “Heavenly Twins.”"},{"num":12,"verse":"When we landed at Syracuse, we stayed there for three days. "},{"num":13,"verse":"From there we set sail for the Italian city of Rhegium. The day after we landed, a south wind sprang up that enabled us to reach Puteoli in two days. "},{"num":14,"verse":"There we found some believers, who begged us to stay with them for a week. Afterward, we made our way to Rome."},{"num":15,"verse":"When the believers were alerted we were coming, they came out to meet us at the Forum of Appius while we were still a great distance from Rome. Another group met us at the Three Taverns. When Paul saw the believers, his heart was greatly encouraged and he thanked God."},{"num":16,"verse":"When we finally entered Rome, Paul was turned over to the authorities and was allowed to live where he pleased, with one soldier assigned to guard him."},{"header":"Paul Speaks to Prominent Jews of Rome"},{"num":17,"verse":"After three days Paul called together all the prominent members of the Jewish community of Rome. When they had all assembled, Paul said to them, “My fellow Jews, while I was in Jerusalem, I was handed over as a prisoner of the Romans for prosecution, even though I had done nothing against any of our people or our Jewish customs. "},{"num":18,"verse":"After hearing my case, the Roman authorities wanted to release me since they found nothing that deserved a death sentence. "},{"num":19,"verse":"When the Jews objected to this, I felt it necessary, with no malice against them, to appeal to Caesar. "},{"num":20,"verse":"This, then, is the reason I’ve asked to speak with you, so that I could explain these things. It is only because I believe in the Hope of Israel that I am in chains before you.”"},{"num":21,"verse":"They replied, “We haven’t received any letters from the Jews of Judea, nor has anyone come to us with a bad report about you. "},{"num":22,"verse":"But we are anxious to hear you present your views regarding this Christian sect we’ve been hearing about, for people everywhere are speaking against it.”"},{"num":23,"verse":"So they set a time to meet with Paul. On that day an even greater crowd gathered where he was staying. From morning until evening Paul taught them, opening up the truths of God’s kingdom. With convincing arguments from both the Law and the Prophets, he tried to persuade them about Jesus. "},{"num":24,"verse":"Some were converted, but others refused to believe. They argued back and forth, "},{"num":25,"verse":"still unable to agree among themselves. They were about to leave when Paul made one last statement to them: “The Holy Spirit stated it well when he spoke to your ancestors through the prophet Isaiah:"},{"num":26,"verse":"‘I send you to this people to say to them, “You will keep learning, but not understanding. You will keep staring at truth but not perceiving it. "},{"num":27,"verse":"For your hearts are hard and insensitive to me—you must be hard of hearing! For you’ve closed your eyes so that you won’t be troubled by the truth, and you’ve covered your ears so that you won’t have to listen and be pierced by what I say. For then you would have to respond and repent, so that I could heal your hearts.” ’"},{"num":28,"verse":"“So listen well. This wonderful salvation given by God is now being presented to the non-Jewish nations, and they will believe and receive it!”"},{"num":30,"verse":"Paul lived two more years in Rome, in his own rented quarters, welcoming all who came to visit. "},{"num":31,"verse":"He continued to proclaim to all the truths of God’s kingdom realm, teaching them about the Lord Jesus, the Anointed One, speaking triumphantly and without any restriction."}]