[{"num":28,"verse":"We quickly learned that we were on the island of Malta. "},{"num":2,"verse":"The Maltese people found us and were extraordinarily kind to us. They kindled a bonfire and welcomed us around it, which we greatly appreciated because it was raining and cold. "},{"num":3,"verse":"Paul was gathering firewood and helping build the fire. A viper had been hiding in some of the wood, and as it tried to escape the heat, it bit Paul on the hand. It sank its fangs in and wouldn’t let go. "},{"num":4,"verse":"The natives saw it dangling from his hand."},{"num":5,"verse":"Paul simply shook the snake off into the fire and suffered no harm. "},{"num":6,"verse":"The natives knew what to expect—rapid swelling followed by death—but when they waited a long time and saw that Paul suffered no ill effects of the bite, they changed their minds and concluded that he was a god."},{"num":7,"verse":"The leading man of the island, Publius, owned large amounts of land near this beach. Publius received us and hosted us for three days. "},{"num":8,"verse":"Publius’s father was sick, bedridden with fever and dysentery. Paul visited the invalid and prayed for him, placing his hands on Publius’s father. The man was cured. "},{"num":9,"verse":"Soon people from all over the island who had diseases came, and they were cured as well."},{"num":10,"verse":"We stayed on Malta for the next three months and were treated with great honor. When spring arrived, we prepared to continue our journey on a ship that had wintered there—an Alexandrian vessel with the Twin Brothers as its figurehead. The Maltese people showed us a final kindness as we departed: they came with all the provisions we needed for our journey and put them on board."},{"num":12,"verse":"We set sail from Malta and stopped first at Syracuse. After three days, "},{"num":13,"verse":"we weighed anchor and came to Rhegium. We waited there a day, and then a south wind sprang up and sped us to Puteoli. "},{"num":14,"verse":"We found some believers there, and they invited us to stay with them for seven days. Then we reached Rome. "},{"num":15,"verse":"The believers from Rome heard we were coming, so they traveled out to meet us at the Forum of Appius and Three Taverns. Paul thanked God and felt encouraged to see them. "},{"num":16,"verse":"Once inside the city, Paul lived under house arrest by himself, with only one soldier to guard him."},{"num":17,"verse":"Three days after his arrival, he called together the local Jewish leaders."},{"num":23,"verse":"They scheduled a day to meet again, and a large number came to his lodging. From morning until evening, he explained his message to them—giving his account of the kingdom of God, trying to convince them about Jesus from the Law of Moses and the Prophets’ writings. "},{"num":24,"verse":"Some were convinced, but others refused to believe."},{"num":29,"verse":"[Then the local Jewish leaders left Paul to discuss all he had told them.]"},{"num":30,"verse":"For two full years, he lived there in Rome, paying all his own expenses, receiving all who came to him. "},{"num":31,"verse":"With great confidence and with no hindrance, he proclaimed the kingdom of God and taught about the ultimate authority—the Lord Jesus, God’s Anointed, the Liberating King."}]