[{"num":15,"verse":"Then Moses and the people of Israel sang this song to the Lord, saying, “I will sing to the Lord, for He is praised for His greatness. He has thrown the horse and horseman into the sea. "},{"num":2,"verse":"The Lord is my strength and song. He is the One Who saves me. He is my God and I will praise Him. He is my father’s God and I will honor Him. "},{"num":3,"verse":"The Lord is a fighter. The Lord is His name. "},{"num":4,"verse":"He has thrown Pharaoh’s war-wagons and army into the sea. The best of Pharaoh’s leaders are under the Red Sea. "},{"num":5,"verse":"The water covers them. They went down in the deep water like a stone. "},{"num":6,"verse":"O Lord, Your right hand is great in power. O Lord, Your right hand destroys those who hate You. "},{"num":7,"verse":"In the greatness of Your power You destroy those who fight against You. You send Your burning anger and it burns them like straw. "},{"num":8,"verse":"The waters were lifted up by Your breath. The flowing waters stood up like a wall. The water became hard in the middle of the sea. "},{"num":9,"verse":"Those who hated us said, ‘I will go after them. I will catch them. I will divide the riches taken from them. My soul will have its way against them. I will take out my sword and my hand will destroy them.’ "},{"num":10,"verse":"You, Lord, blew with Your wind and the sea covered them. They went down like iron in the powerful sea. "},{"num":11,"verse":"Who is like You among the gods, O Lord? Who is like You, great and holy, praised in fear, doing powerful works? "},{"num":12,"verse":"You put out Your right hand, and the earth swallowed them. "},{"num":13,"verse":"You have led with loving-kindness the people You have made free. You have led them in Your strength to Your holy place. "},{"num":14,"verse":"The nations have heard of it, and they shake in fear. Pain has come upon the people of Philistia. "},{"num":15,"verse":"Now the leaders of Edom are afraid. The leaders of Moab shake in fear. All the people of Canaan have become weak. "},{"num":16,"verse":"Much fear comes upon them. They see Your strength, O Lord. They are afraid and do not move until Your people have passed by, the people You have bought and made free. "},{"num":17,"verse":"You will bring them in and put them on Your own mountain. It is the place, O Lord, where You have made Your house, the holy place, which Your hands have built. "},{"num":18,"verse":"The Lord will rule forever and ever.”"},{"num":19,"verse":"For Pharaoh’s horses and war-wagons and horsemen went in the sea. The Lord brought the waters of the sea upon them. But the people of Israel walked on dry land through the sea. "},{"num":20,"verse":"Then Aaron’s sister Miriam, the woman who spoke for the Lord, took a timbrel in her hand. And all the women followed her, with timbrels and dancing. "},{"num":21,"verse":"Miriam said to them, “Sing to the Lord, for He is praised for His greatness. He has thrown the horse and horseman into the sea.”"},{"header":"Bitter Water"},{"num":22,"verse":"Then Moses led Israel from the Red Sea. They went into the Desert of Shur. They went three days in the desert and found no water. "},{"num":23,"verse":"When they came to Marah, they could not drink the water of Marah because it was bitter. So it was given the name Marah. "},{"num":24,"verse":"The people complained to Moses, saying, “What can we drink?” "},{"num":25,"verse":"Moses cried to the Lord, and the Lord showed him a tree. He threw it into the water, and the water became sweet."},{"num":26,"verse":"He said, “Listen well to the voice of the Lord your God. Do what is right in His eyes. Listen to what He tells you, and obey all His Laws. If you do this, I will put none of the diseases on you which I have put on the Egyptians. For I am the Lord Who heals you.”"},{"num":27,"verse":"Then they came to Elim, where there were twelve wells of water and seventy trees. They set up their tents there beside the water."}]