[{"num":15,"verse":"Then sang Moshe and the Bnei Yisroel this shirah (song) to Hashem, and spoke, saying, I will sing unto Hashem, for He hath triumphed gloriously: the sus and its rider hath He cast into the yam."},{"num":2,"verse":"Hashem is my oz and zimrah (song of praise), and He is become to me Yeshuah (salvation); He is Eli (my G-d), and I will praise Him; Elohei Avi, and I will exalt Him."},{"num":3,"verse":"Hashem is an Ish Milchamah; Hashem shmo."},{"num":4,"verse":"Markevot Pharaoh and his army hath He cast into the yam; his select commanders also are drowned in Yam Suf."},{"num":5,"verse":"The tehomot (depths) have covered them; they sank into the bottom like an even (stone)."},{"num":6,"verse":"Thy right hand, Hashem, is become glorious in ko’ach; Thy right hand, Hashem, hath dashed into pieces the oyev."},{"num":7,"verse":"And in the greatness of Thine majesty Thou hast overthrown them that rose up against Thee; Thou sentest forth Thy charon (wrath), which consumed them as stubble."},{"num":8,"verse":"And with the blast of Thy nostrils the mayim were gathered together, the floods stood upright like a stack, and the tehomot were congealed in the lev yam (heart of the sea)."},{"num":9,"verse":"The oyev said, I will pursue, I will overtake, I will share the plunder; my battlelust shall be satisfied upon them; I will draw my cherev, my yad shall take possession of them."},{"num":10,"verse":"Thou didst blow with Thy ruach, the yam covered them; they sank like lead in the mighty waters."},{"num":11,"verse":"Mi chamochah ba’elim, Adonoi (Who is like unto Thee, Hashem, among the elim [g-ds])? Who is like Thee, glorious in kodesh (holiness), awesome in praiseworthy acts, doing wonders?"},{"num":12,"verse":"Thou didst stretch out Thy right hand, eretz swallowed them."},{"num":13,"verse":"Thou in Thy chesed hast led forth the people which Thou hast redeemed (acquired back); Thou hast guided them in Thy oz unto Thy neveh kodesh (holy habitation, i.e., a neveh is the abode of a shepherd)."},{"num":14,"verse":"The nations shall hear, and be afraid; anguish shall take hold on the inhabitants of Peleshet (Philistia)."},{"num":15,"verse":"Then the chief men of Edom shall be amazed; the mighty men of Moav, trembling shall take hold upon them; all the inhabitants of Kena’an shall melt away with weakness."},{"num":16,"verse":"Terror and pachad shall fall upon them; by the greatness of Thine zero’a they shall be struck dumb as an even (stone); till Thy people pass by, Hashem, till the people pass by, which Thou hast purchased."},{"num":17,"verse":"Thou shalt bring them in, and plant them in the har of Thine nachalah, in the place, Hashem, which Thou hast made for Thee to dwell in, in the Mikdash, Adonoi, which Thy hands have established."},{"num":18,"verse":"Hashem shall reign l’olam va’ed."},{"num":19,"verse":"For the sus Pharaoh went in with his chariots and with his parash into the yam, and Hashem brought again the waters of the yam upon them; but the Bnei Yisroel went on yabashah (dry land) in the middle of the yam."},{"num":20,"verse":"And Miryam the neviah, the achot Aharon, took the tof (hand drum) in her yad; and all the nashim went out after her with hand-drums and with dancing."},{"num":21,"verse":"And Miryam sang to them, Sing ye to Hashem, for He hath triumphed gloriously; the sus and its rider hath He thrown into the yam."},{"num":22,"verse":"So Moshe brought Yisroel from the Yam Suf, and they went out into the midbar of Shur; and they went shloshet yamim in the midbar, and found no mayim."},{"num":23,"verse":"And when they came to Marah (Bitter Place), they could not drink of the mayim from Marah, for they were marim; therefore the shem of it was called Marah."},{"num":24,"verse":"So the people murmured against Moshe, saying, Mah nishteh (what shall we drink)?"},{"num":25,"verse":"And he cried unto Hashem; and Hashem showed him an etz (tree) which when he had cast into the mayim, the waters were made sweet (i.e., potable, fit for drinking); at that place He made for them a chok (statute, requirement, obligation) and a mishpat (divine judgment), and there He tested them,"},{"num":26,"verse":"And said, If thou wilt diligently pay heed to the voice of Hashem Eloheicha, and will do that which is yashar in His sight, and will give ear to do His mitzvot, and be shomer over all His chok, I will put none of these machalah (diseases) upon thee, which I put upon the Egyptians; for Ani Adonoi rofecha (I am Hashem that healeth thee). [2Kgs15:5;Amos 4:10]"},{"num":27,"verse":"And they came to Elim (Great Trees). There were twelve springs of mayim, and threescore and ten date-palm trees; and they encamped there by the mayim."}]