[[],[{"type":"header","content":"Blessings at Gerizim"},{"type":"prose","content":"“Now it shall be, if you diligently listen to  obey the voice of the LORD your God, being careful to do all of His commandments which I am commanding you today, the LORD your God will set you high above all the nations of the earth. "}],[{"type":"prose","content":"All these blessings will come upon you and overtake you if you pay attention to the voice of the LORD your God."}],[{"type":"prose","content":"“You  blessed in the city, and you  blessed in the field."}],[{"type":"prose","content":"“The offspring of your body and the produce of your ground and the offspring of your animals, the offspring of your herd and the young of your flock  blessed."}],[{"type":"prose","content":"“Your basket and your kneading bowl  blessed."}],[{"type":"prose","content":"“You  blessed when you come in and you  blessed when you go out."}],[{"type":"prose","content":"“The LORD will cause the enemies who rise up against you to be defeated before you; they will come out against you one way, but flee before you seven ways. "}],[{"type":"prose","content":"The LORD will command the blessing upon you in your storehouses and in all that you undertake, and He will bless you in the land which the LORD your God gives you. "}],[{"type":"prose","content":"The LORD will establish you as a people holy [and set apart] to Himself, just as He has sworn to you, if you keep the commandments of the LORD your God and walk [that is, live your life each and every day] in His ways. "}],[{"type":"prose","content":"So all the peoples of the earth will see that you are called by the name of the LORD, and they will be afraid of you. "}],[{"type":"prose","content":"The LORD will give you great prosperity, in the offspring of your body and in the offspring of your livestock and the produce of your ground, in the land which the LORD swore to your fathers to give you. "}],[{"type":"prose","content":"The LORD will open for you His good treasure house, the heavens, to give rain to your land in its season and to bless all the work of your hand; and you will lend to many nations, but you will not borrow. "}],[{"type":"prose","content":"The LORD will make you the head (leader) and not the tail (follower); and you will be above only, and you will not be beneath, if you listen  pay attention to the commandments of the LORD your God, which I am commanding you today, to observe them carefully. "}],[{"type":"prose","content":"Do not turn aside from any of the words which I am commanding you today, to the right or to the left, to follow and serve other gods."}],[{"type":"header","content":"Consequences of Disobedience"},{"type":"prose","content":"“But it shall come about, if you do not listen to  obey the voice of the LORD your God, being careful to do all His commandments and His statutes which I am commanding you today, then all these curses will come upon you and overtake you:"}],[{"type":"prose","content":"“You  cursed in the city and cursed in the field."}],[{"type":"prose","content":"“Your basket and your kneading bowl  cursed."}],[{"type":"prose","content":"“The offspring of your body and the produce of your land, the offspring of your herd and the young of your flock  cursed."}],[{"type":"prose","content":"“You  cursed when you come in and you  cursed when you go out."}],[{"type":"prose","content":"“The LORD will send upon you curses, confusion, and rebuke in everything that you undertake to do, until you are destroyed, perishing quickly because of the evil of your deeds, because you have turned away from Me. "}],[{"type":"prose","content":"The LORD will make the pestilence  plague cling to you until He has consumed  eliminated you from the land which you are entering to possess. "}],[{"type":"prose","content":"The LORD will strike you with consumption [causing you to waste away] and with fever and with inflammation and with fiery heat and with the sword and with blight and with mildew [on your crops]; and they will pursue you until you perish. "}],[{"type":"prose","content":"The heaven which is over your head shall be bronze [giving no rain and blocking all prayers], and the earth which is under you, iron [hard to plow and yielding no produce]. "}],[{"type":"prose","content":"The LORD will make the rain of your land powder and dust; from heaven it will come down on you until you are destroyed."}],[{"type":"prose","content":"“The LORD will cause you to be defeated before your enemies; you will go out against them one way, but flee before them seven ways, and you will be  terror to all the kingdoms of the earth [when they see your destruction]. "}],[{"type":"prose","content":"Your carcasses will be food for all the birds of the sky and the beasts of the earth, and there will be no one to frighten them away."}],[{"type":"prose","content":"“The LORD will strike you with the boils of Egypt and with tumors and with the scab and the itch that you cannot heal. "}],[{"type":"prose","content":"The LORD will strike you with madness and with blindness and with bewilderment of heart  mind; "}],[{"type":"prose","content":"and you will be groping at noon [in broad daylight], just as the blind grope in the darkness, and nothing you do will prosper; but you will only be oppressed  exploited and robbed continually, with no one to save you. "}],[{"type":"prose","content":"You will be pledged to marry a wife, but another man will be intimate with her [before you]; you will build a house, but you will not live in it; you will plant a vineyard, but you will not use its fruit. "}],[{"type":"prose","content":"Your ox will be slaughtered before your eyes, but you will not eat any of it; your donkey will be torn away from you, and it will not be returned to you; your sheep will be given to your enemies, and you will have no one to save you. "}],[{"type":"prose","content":"Your sons and daughters will be given to another people, while your eyes look on and long for them continually; but there will be nothing you can do. "}],[{"type":"prose","content":"A people whom you do not know will eat the produce of your land and all the products of your labors, and you will never be anything but oppressed  exploited and crushed continually. "}],[{"type":"prose","content":"You shall be driven mad by the sight of the things you see. "}],[{"type":"prose","content":"The LORD will strike you on the knees and on the legs with sore boils that you cannot heal, from the sole of your foot to the crown of your head. "}],[{"type":"prose","content":"The LORD will bring you and your king, whom you appoint over you, to a nation which you and your fathers have never known; there you will [be forced to] serve other gods, [lifeless gods of] wood and stone. "}],[{"type":"prose","content":"And you will become a horror, a proverb [a mere object lesson], and a taunt [a derisive joke] among all the people to which the LORD drives you."}],[{"type":"prose","content":"“You will bring out a great quantity of seed to the field, but you will gather in little, because the locusts will consume it. "}],[{"type":"prose","content":"You will plant vineyards and cultivate them, but you will not drink the wine or gather , because the worm will eat them. "}],[{"type":"prose","content":"You will have olive trees throughout your territory but you will not anoint yourselves with the oil, because your olives will drop off. "}],[{"type":"prose","content":"You will have sons and daughters, but they will not be yours [for long], because they will go into captivity. "}],[{"type":"prose","content":"The cricket will take possession of all your trees and the produce of your ground. "}],[{"type":"prose","content":"The stranger who lives among you will rise above you higher and higher, and you will go down lower and lower. "}],[{"type":"prose","content":"He will lend to you [out of his affluence], but you will not lend to him [because of your poverty]; he will be the head, and you the tail."}],[{"type":"prose","content":"“So all these curses will come on you and pursue you and overtake you until you are destroyed, because you would not obey the voice of the LORD your God by keeping His commandments and His statutes which He has commanded you. "}],[{"type":"prose","content":"They will be a sign and a wonder to you and your descendants forever."}],[{"type":"prose","content":"“Because you did not serve the LORD your God with a heart full of joy and gladness for the abundance of all things [with which He blessed you], "}],[{"type":"prose","content":"you will therefore serve your enemies whom the LORD sends against you, in hunger and in thirst, in nakedness and in lack of all things; and He will put an iron yoke [of slavery] on your neck until He has destroyed you."}],[{"type":"prose","content":"“The LORD will bring a nation against you from far away, from the end of the earth, [as swift] as the eagle swoops down [to attack], a nation whose language you will not understand, "}],[{"type":"prose","content":"a defiant nation who will have no respect for the old, nor show favor to the young, "}],[{"type":"prose","content":"and it will eat the offspring of your herd and the produce of your ground until you are destroyed, who will leave you no grain, new wine, or oil, nor the offspring of your herd or the young of your flock until they have caused you to perish. "}],[{"type":"prose","content":"They will besiege you in all your cities until your high and fortified walls in which you trusted come down throughout your land; and they will besiege you in all your cities throughout your land which the LORD your God has given you. "}],[{"type":"prose","content":"Then you will eat the offspring of your own body [to avoid starvation], the flesh of your sons and daughters whom the LORD your God has given you, during the siege and the misery by which your enemy will oppress you. "}],[{"type":"prose","content":"The man who is most refined and well-bred among you will be cruel  hostile toward his brother and toward the wife he cherishes and toward the rest of his children who remain, "}],[{"type":"prose","content":"so that he will not give  one of them any of the flesh of his children which he will eat, because he has nothing else left, during the siege and the misery by which your enemy will oppress you in all your cities. "}],[{"type":"prose","content":"The most refined and well-bred woman among you, who would not venture to set the sole of her foot on the ground because she is so delicate and pampered, will be cruel  hostile toward the husband she cherishes and toward her son and daughter, "}],[{"type":"prose","content":"and toward her afterbirth that comes from between her legs and toward the children whom she bears; for she will eat them secretly for lack of anything else, during the siege and the misery by which your enemy will oppress you in your cities."}],[{"type":"prose","content":"“If you are not careful to do all the words of this law that are written in this book, to fear  honor with reverence this glorious and awesome name, the LORD your God, "}],[{"type":"prose","content":"then the LORD will bring extraordinary plagues on you and your descendants, even severe and lasting plagues, and miserable and chronic sicknesses. "}],[{"type":"prose","content":"Moreover, He will bring on you all the diseases of Egypt of which you were afraid, and they will cling to you. "}],[{"type":"prose","content":"Also the LORD will bring on you every sickness and every plague which is not written in this book of this law, until you are destroyed. "}],[{"type":"prose","content":"Because you did not obey the voice of the LORD your God, you who were as numerous as the stars of heaven shall be left few in number. "}],[{"type":"prose","content":"It shall come about that just as the LORD delighted over you to make you prosper and multiply, so the LORD will delight over you to bring you to ruin and destruction; and you will be uprooted [violently] from the land which you are entering to possess. "}],[{"type":"prose","content":"And the LORD will scatter you among all the nations, from one end of the earth to the other; and there you will [be forced to] serve other gods, [lifeless gods of] wood and stone, which neither you nor your fathers have known. "}],[{"type":"prose","content":"Among those nations you will find no peace (rest), and there will be no resting place for the sole of your foot; but there the LORD will give you a trembling heart, failing eyes, and a despairing soul. "}],[{"type":"prose","content":"Your life will hang in doubt before you; night and day you will be filled with anxiety and have no assurance of living. "}],[{"type":"prose","content":"In the morning you will say, ‘I wish it were evening!’ and in the evening you will say, ‘I wish it were morning!’—because of the dread in your heart with which you tremble, and because of the sight of your eyes which you will see. "}],[{"type":"prose","content":"The LORD will bring you back to Egypt in ships, by the way about which I said to you, ‘You will never see it again!’ And there you will offer yourselves for sale to your enemies as male and female slaves, but there will be no one to buy you."}]]