[[],[{"type":"header","content":"The Blessings at Mount Gerizim"},{"type":"prose","content":"“Now it shall be, if you diligently obey the  your God, being careful to do all His commandments which I am commanding you today, that the  your God will put you high above all the nations of the earth."}],[{"type":"prose","content":"And all these blessings will come to you and reach you if you obey the  your God:"}],[{"type":"prose","content":"“Blessed  you  in the city, and blessed  you  in the country."}],[{"type":"prose","content":"“Blessed  the children of your womb, the produce of your ground, and the offspring of your animals: the newborn of your herd and the young of your flock."}],[{"type":"prose","content":"“Blessed  your basket and your kneading bowl."}],[{"type":"prose","content":"“Blessed  you  when you come in, and blessed  you  when you go out."}],[{"type":"prose","content":"“The  will cause your enemies who rise up against you to be defeated by you; they will go out against you one way and will flee at your presence seven ways."}],[{"type":"prose","content":"The  will command the blessing for you in your barns and in everything that you put your hand to, and He will bless you in the land that the  your God is giving you."}],[{"type":"prose","content":"The  will establish you as a holy people to Himself, as He swore to you, if you keep the commandments of the  your God and walk in His ways."}],[{"type":"prose","content":"So all the peoples of the earth will see that you are called by the name of the , and they will be afraid of you."}],[{"type":"prose","content":"And the  will give you more than enough prosperity, in the children of your womb, in the offspring of your livestock, and in the produce of your ground, in the land which the  swore to your fathers to give you."}],[{"type":"prose","content":"The  will open for you His good storehouse, the heavens, to give rain to your land in its season and to bless every work of your hand; and you will lend to many nations, but you will not borrow."}],[{"type":"prose","content":"And the  will make you the head and not the tail, and you will only be above, and not be underneath, if you listen to the commandments of the  your God which I am commanding you today, to follow  carefully,"}],[{"type":"prose","content":"and do not turn aside from any of the words which I am commanding you today, to the right or the left, to pursue other gods to serve them."},{"type":"header","content":"Consequences of Disobedience"}],[{"type":"prose","content":"“But it shall come about, if you do not obey the  your God, to be careful to follow all His commandments and His statutes which I am commanding you today, that all these curses will come upon you and overtake you:"}],[{"type":"prose","content":"“Cursed  you  in the city, and cursed  you  in the country."}],[{"type":"prose","content":"“Cursed  your basket and your kneading bowl."}],[{"type":"prose","content":"“Cursed  the children of your womb, the produce of your ground, the newborn of your herd, and the offspring of your flock."}],[{"type":"prose","content":"“Cursed  you  when you come in, and cursed  you  when you go out."}],[{"type":"prose","content":"“The  will send against you curses, panic, and rebuke, in everything you undertake to do, until you are destroyed and until you perish quickly, on account of the evil of your deeds, because you have abandoned Me."}],[{"type":"prose","content":"The  will make the plague cling to you until He has eliminated you from the land where you are entering to take possession of it."}],[{"type":"prose","content":"The  will strike you with consumption, inflammation, fever, feverish heat, and with the sword, with blight, and with mildew, and they will pursue you until you perish."}],[{"type":"prose","content":"The heaven which is over your head shall be bronze, and the earth which is under you, iron."}],[{"type":"prose","content":"The  will make the rain of your land powder and dust; from heaven it shall come down on you until you are destroyed."}],[{"type":"prose","content":"“The  will cause you to be defeated by your enemies; you will go out one way against them, but you will flee seven ways from their presence, and you will be  terror to all the kingdoms of the earth."}],[{"type":"prose","content":"Your dead bodies will serve as food for all birds of the sky and for the animals of the earth, and there will be no one to frighten ."}],[{"type":"prose","content":"“The  will strike you with the boils of Egypt and with tumors, the festering rash, and with scabies, from which you cannot be healed."}],[{"type":"prose","content":"The  will strike you with insanity, blindness, and with confusion of mind;"}],[{"type":"prose","content":"and you will be groping about at noon, just as a person who is blind gropes in the darkness, and you will not be successful in your ways; but you will only be oppressed and robbed all the time, with no one to save you."}],[{"type":"prose","content":"You will betroth a woman, but another man will violate her; you will build a house, but you will not live in it; you will plant a vineyard, but you will not make use of its fruit."}],[{"type":"prose","content":"Your ox  slaughtered before your eyes, but you will not eat of it; your donkey  snatched away from you, and will not be restored to you; your sheep  given to your enemies, and you will have no one to save you."}],[{"type":"prose","content":"Your sons and your daughters  given to another people, while your eyes look on and long for them constantly; but there will be nothing you can do."}],[{"type":"prose","content":"A people whom you do not know will eat the produce of your ground and every product of your labor, and you will never be anything but oppressed and mistreated continually."}],[{"type":"prose","content":"You will also be driven insane by the sight of what you see."}],[{"type":"prose","content":"The  will strike you on the knees and thighs with severe boils from which you cannot be healed,  from the sole of your foot to the top of your head."}],[{"type":"prose","content":"The  will bring you and your king, whom you appoint over you, to a nation that neither you nor your fathers have known, and there you shall serve other gods,  wood and stone."}],[{"type":"prose","content":"And you will become an  horror, a song of mockery, and an object of taunting among all the peoples where the  drives you."}],[{"type":"prose","content":"“You will bring out a great amount of seed to the field, but you will gather in little, because the locust will devour it."}],[{"type":"prose","content":"You will plant and cultivate vineyards, but you will neither drink of the wine nor bring in , because the worm will eat it."}],[{"type":"prose","content":"You will have olive trees throughout your territory but you will not anoint yourself with the oil, because your olives will drop off ."}],[{"type":"prose","content":"You will father sons and daughters but they will not remain yours, because they will go into captivity."}],[{"type":"prose","content":"The cricket will take possession of all your trees and the produce of your ground."}],[{"type":"prose","content":"The stranger who is among you will rise above you higher and higher, and you will go down lower and lower."}],[{"type":"prose","content":"He will lend to you, but you will not lend to him; he will be the head, and you will be the tail."}],[{"type":"prose","content":"“So all these curses shall come upon you and pursue you and overtake you until you are destroyed, because you would not obey the  your God by keeping His commandments and His statutes which He commanded you."}],[{"type":"prose","content":"And they will become a sign and a wonder against you and your descendants forever."}],[{"type":"prose","content":"“Since you did not serve the  your God with joy and a cheerful heart,  for the abundance of all ,"}],[{"type":"prose","content":"you will serve your enemies whom the  will send against you, in hunger, thirst, nakedness, and devoid of all ; and He will put an iron yoke on your neck until He has destroyed you."}],[{"type":"prose","content":"“The  will bring a nation against you from far away, from the end of the earth, as the eagle swoops down; a nation whose language you will not understand,"}],[{"type":"prose","content":"a nation with a defiant attitude, who will have no respect for the old, nor show favor to the young."}],[{"type":"prose","content":"Furthermore, it will eat the offspring of your herd and the produce of your ground until you are destroyed;  that will leave you no grain, new wine, or oil, nor the newborn of your cattle or the young of your flock, until they have eliminated you."}],[{"type":"prose","content":"And it will besiege you in all your towns until your high and fortified walls in which you trusted come down throughout your land, and it will besiege you in all your towns throughout your land which the  your God has given you."}],[{"type":"prose","content":"Then you will eat the offspring of your own body, the flesh of your sons and of your daughters whom the  your God has given you, during the siege and the hardship by which your enemy will oppress you."}],[{"type":"prose","content":"The man who is refined and very delicate among you will be hostile toward his brother, toward the wife he cherishes, and toward the rest of his children who are left,"}],[{"type":"prose","content":"so that he will not give  one of them any of the flesh of his children which he will eat, since he has nothing  left, during the siege and the hardship by which your enemy will oppress you in all your towns."}],[{"type":"prose","content":"The refined and delicate woman among you, who would not venture to set the sole of her foot on the ground because of her delicateness and tenderness, will be hostile toward the husband she cherishes and toward her son and daughter,"}],[{"type":"prose","content":"and toward her afterbirth that comes from between her legs, and toward her children to whom she gives birth, because she will eat them secretly for lack of anything , during the siege and the hardship with which your enemy will oppress you in your towns."}],[{"type":"prose","content":"“If you are not careful to follow all the words of this Law that are written in this book, to fear this honored and awesome name, the  your God,"}],[{"type":"prose","content":"then the  will bring extraordinary plagues on you and your descendants, severe and lasting plagues, and miserable and chronic sicknesses."}],[{"type":"prose","content":"And He will bring back on you every disease of Egypt of which you were afraid, and they will cling to you."}],[{"type":"prose","content":"Also every sickness and every plague, which are not written in the book of this Law, the  will bring on you until you are destroyed."}],[{"type":"prose","content":"Then you will be left few in number, whereas you were as numerous as the stars of heaven, because you did not obey the  your God."}],[{"type":"prose","content":"And it will come about that, just as the  rejoiced over you to be good to you, and make you numerous, so will the  rejoice over you to wipe you out and destroy you; and you will be torn away from the land which you are entering to possess."}],[{"type":"prose","content":"Furthermore, the  will scatter you among all the peoples, from  end of the earth to the other; and there you will serve other gods,  wood and stone, which you and your fathers have not known."}],[{"type":"prose","content":"Among those nations you will find no peace, and there will be no resting place for the sole of your foot; but there the  will give you a trembling heart, failing of eyes, and despair of soul."}],[{"type":"prose","content":"So your lives will be hanging in doubt before you; and you will be terrified night and day, and have no assurance of your life."}],[{"type":"prose","content":"In the morning you will say, ‘If only it were evening!’ And at evening you will say, ‘If only it were morning!’ because of the terror of your heart which you fear, and the sight of your eyes which you will see."}],[{"type":"prose","content":"And the  will bring you back to Egypt in ships, by the way about which I said to you, ‘You will never see it again!’ And there you will offer yourselves for sale to your enemies as male and female slaves, but there will be no buyer.”"}]]