[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(h)",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ". Eighth Discourse:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Against Adultery, and in Praise of Marriage ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 5:7-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) Hear me now therefore, O ye children.—In this verse Solomon apparently ceases to report the words of his father, and resumes his speech in his own person.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(7) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hear me now therefore, O ye children.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In this verse Solomon apparently ceases to report the words of his father, and resumes his speech in his own person.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-14 Solomon cautions all young men, as his children, to abstain from fleshly lusts. Some, by the adulterous woman, here understand idolatry, false doctrine, which tends to lead astray men's minds and manners; but the direct view is to warn against seventh-commandment sins. Often these have been, and still are, Satan's method of drawing men from the worship of God into false religion. Consider how fatal the consequences; how bitter the fruit! Take it any way, it wounds. It leads to the torments of hell. The direct tendency of this sin is to the destruction of body and soul. We must carefully avoid every thing which may be a step towards it. Those who would be kept from harm, must keep out of harm's way. If we thrust ourselves into temptation we mock God when we pray, Lead us not into temptation. How many mischiefs attend this sin! It blasts the reputation; it wastes time; it ruins the estate; it is destructive to health; it will fill the mind with horror. Though thou art merry now, yet sooner or later it will bring sorrow. The convinced sinner reproaches himself, and makes no excuse for his folly. By the frequent acts of sin, the habits of it become rooted and confirmed. By a miracle of mercy true repentance may prevent the dreadful consequences of such sins; but this is not often; far more die as they have lived. What can express the case of the self-ruined sinner in the eternal world, enduring the remorse of his conscience!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Or (with the Septuagint and Vulgate), Lest she should ponder (or \"She ponders not\") the way of life, her paths move to and fro (unsteady as an earthquake); she knows not. The words describe with a terrible vividness the state of heart and soul which prostitution brings upon its victims; the reckless blindness that will not think, tottering on the abyss, yet loud in its defiant mirth, ignoring the dreadful future. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. her ways … know—Some prefer, \"that she may not ponder the path of life,\" &c.; but perhaps a better sense is, \"her ways are varied, so as to prevent your knowledge of her true character, and so of true happiness.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear me now therefore, O ye children,.... Since such is the character, this the wretched end, and these the ways of the adulterous woman; those that are young in years, and liable to be ensnared by her, should hear what Solomon, or Christ, here says, for their caution and instruction; and especially such who are, or profess themselves to be, the children of God and of Christ; and therefore, as dear children, should be followers of them, and not of an harlot; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and depart not from the words of my mouth; the warnings, directions, and exhortations given to avoid the whorish woman; the doctrines of Christ, the truths of the Gospel: these should not be forsaken, but abode by; and also his precepts and ordinances, which should be closely attended unto. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and depart not from the words of my mouth; the warnings, directions, and exhortations given to avoid the whorish woman; the doctrines of Christ, the truths of the Gospel: these should not be forsaken, but abode by; and also his precepts and ordinances, which should be closely attended unto. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Hear me now therefore, O ye children, and depart not from the words of my mouth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "my sons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.V., as the same Heb. word is rendered throughout these exhortations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 7-14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The ruinous consequences of indulgence in illicit pleasures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The subject of which the teacher is heating demands the utmost attention of youth. Enough, it might be supposed, had been said to deter from intercourse with the \"strange woman.\" She has been portrayed in her real colours, plunging recklessly into ruin herself, and carrying her victims with her; deceitful, full of intrigues, neither walking in nor knowing the way of life. But the warning is amplified and made more impressive. There is another side of the picture, the complete bodily and temporal ruin of her victim. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "argumentum ad hominem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is applied. There is an appeal to personal interest in the details which follow, which ought not to fail in holding youth back. The form of the address which is repeated is very similar to that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The plural form, \"O ye children\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Proverbs 7:24), immediately passes into the singular for the reason mentioned before, that, though the address is made to all, yet each individually is to apply it to himself. Proverbs 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eighth discourse springs out of the conclusion of the seventh, and connects itself by its reflective מעליה so closely with it that it appears as its continuation; but the new beginning and its contents included in it, referring only to social life, secures its relative independence. The poet derives the warning against intercourse with the adulteress from the preceding discourse, and grounds it on the destructive consequences.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 And now, ye sons, hearken unto me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   And depart not from the words of my mouth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8 Hold thy path far from her neighbourhood,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   And come not to the door of her house!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9 That thou mayest not give the freshness of thy youth to another,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   Nor thy years to the cruel one;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 That strangers may not sate themselves with thy possessions,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   And the fruit of thy toils come into the house of a stranger,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11 And thou groanest at the end,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   When thy flesh and thy body are consumed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither here nor in the further stages of this discourse is there any reference to the criminal punishment inflicted on the adulterer, which, according to Leviticus 20:10, consisted in death, according to Ezekiel 16:40, cf. John. PRomans 8:5, in stoning, and according to a later traditional law, in strangulation (חנק). Ewald finds in Proverbs 5:14 a play on this punishment of adultery prescribed by law, and reads from Proverbs 5:9. that the adulterer who is caught by the injured husband was reduced to the state of a slave, and was usually deprived of his manhood. But that any one should find pleasure in making the destroyer of his wife his slave is a far-fetched idea, and neither the law nor the history of Israel contains any evidence for this punishment by slavery or the mutilation of the adulterer, for which Ewald refers to Grimm's Deutsche Rechtsaltertmer. The figure which is here sketched by the poet is very different. He who goes into the net of the wanton woman loses his health and his goods. She stands not alone, but has her party with her, who wholly plunder the simpleton who goes into her trap. Nowhere is there any reference to the husband of the adulteress. The poet does not at all think on a married woman. And the word chosen directs our attention rather to a foreigner than to an Israelitish woman, although the author may look upon harlotry as such as heathenish rather than Israelitish, and designate it accordingly. The party of those who make prostitutes of themselves consists of their relations and their older favourites, the companions of their gain, who being in league with her exhaust the life-strength and the resources of the befooled youth (Fl.). This discourse begins with ועתּה, for it is connected by this concluding application (cf. Proverbs 7:24) with the preceding.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither here nor in the further stages of this discourse is there any reference to the criminal punishment inflicted on the adulterer, which, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", consisted in death, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. John. P",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in stoning, and according to a later traditional law, in strangulation (חנק). Ewald finds in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a play on this punishment of adultery prescribed by law, and reads from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 5:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". that the adulterer who is caught by the injured husband was reduced to the state of a slave, and was usually deprived of his manhood. But that any one should find pleasure in making the destroyer of his wife his slave is a far-fetched idea, and neither the law nor the history of Israel contains any evidence for this punishment by slavery or the mutilation of the adulterer, for which Ewald refers to Grimm's Deutsche Rechtsaltertmer. The figure which is here sketched by the poet is very different. He who goes into the net of the wanton woman loses his health and his goods. She stands not alone, but has her party with her, who wholly plunder the simpleton who goes into her trap. Nowhere is there any reference to the husband of the adulteress. The poet does not at all think on a married woman. And the word chosen directs our attention rather to a foreigner than to an Israelitish woman, although the author may look upon harlotry as such as heathenish rather than Israelitish, and designate it accordingly. The party of those who make prostitutes of themselves consists of their relations and their older favourites, the companions of their gain, who being in league with her exhaust the life-strength and the resources of the befooled youth (Fl.). This discourse begins with ועתּה, for it is connected by this concluding application (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") with the preceding.",
            "children": []
          }
        ]
      }
    ]
  }
]