[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "VIII.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) And when he had opened the seventh seal . . .—Translate, And when he opened the seventh seal there took place a silence in heaven as it were for half an hour. It is greatly to be regretted that this verse should have been prefixed to this chapter. The section of the book with which it is connected is that which goes before, not that which follows. The second verse of this eighth chapter introduces a new series of visions: the first verse gives the close of the visions which follow the opening of the seals. But what is the meaning of this verse which describes a half-hour’s silence in heaven? It is a disputed point whether the book, or roll, fastened with the seven seals (Revelation 5:1-2) is ever really unrolled to view. Some have thought that as each seal is opened a portion of the roll is displayed, unfolding the vision of the seal: others have regarded the visions as mere accompaniments of the opening of the seals, and quite distinct from the writing on the roll; those who take this view are disposed to think that the roll never is read, for that when the last seal is broken, and all are expecting to hear what is written in the book, no reading takes place, but only a silence ensues. It does not seem to me that this latter view is altogether tenable. It appears a singularly harsh interpretation to say that the contents of the roll are never disclosed. The book of God’s purposes was seen in the hand of Him who sat on the throne. The Evangelist longed to know something of its contents; vain efforts were made to open it; the Evangelist wept with disappointment; he was then comforted in his sorrow by hearing that the Lion of the tribe of Judah had conquered to open the book; but then, after all this, not a line or word of the book, it is said, is ever revealed. The servant is waiting to hear the divine word; the seer is waiting to record what is unfolded; but though the seals are opened, we are told that the words he waits for never came. St. John himself gives no hint of so disappointing a conclusion. Later on (Revelation 10:4) he is told not to record the utterances of the seven thunders, but there the concealing of the utterances is clearly commanded. Here he evidently associates the visions of the seals with the contents of the roll. It is only a spirit in bondage to foolish literalisms which will ask how the visions can be the writing in the roll. The book represents God’s purposes and principles of His government in relation to the world-history; the seals show us some typical scenes in that world-history, and if not seen on the parchment of the roll, are yet unfoldings of principles and truths in the book. But it does not follow that all that is in the roll is ever unfolded. Such portions are made manifest as the seer could hear, and as the Church of Christ needed; and thus it may well be that the half-hour’s silence is significant that all God’s purposes and revelations are not exhausted—that there is something behind which it is not well that we should know—that prophecy as well as knowledge is partial. But the stillness of this half hour, if it reminds us of what is yet untold, yet proclaims to us a time of deep, unbroken tranquility, when the cries and groans of the earth, and even the grateful doxologies of heaven are hushed into calm. It is the silence which tells us that sorrow is ended, and eloquently tells us of heart peace. It is the rest of the troubled on the breast of God. All the earth, with her strife of tongues is still; all the cries of men (Revelation 6:15), of trafficker and warrior, of struggling wise, and suffering good, are stilled; all flesh keeps silence before Him; He gives His people peace.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And when he had opened the seventh seal . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " .",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Translate, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And when he opened the seventh seal there took place a silence in heaven as it were for half an hour.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " It is greatly to be regretted that this verse should have been prefixed to this chapter. The section of the book with which it is connected is that which goes before, not that which follows. The second verse of this eighth chapter introduces a new series of visions: the first verse gives the close of the visions which follow the opening of the seals. But what is the meaning of this verse which describes a half-hour’s silence in heaven? It is a disputed point whether the book, or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "roll,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fastened with the seven seals (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is ever really unrolled to view. Some have thought that as each seal is opened a portion of the roll is displayed, unfolding the vision of the seal: others have regarded the visions as mere accompaniments of the opening of the seals, and quite distinct from the writing on the roll; those who take this view are disposed to think that the roll never is read, for that when the last seal is broken, and all are expecting to hear what is written in the book, no reading takes place, but only a silence ensues. It does not seem to me that this latter view is altogether tenable. It appears a singularly harsh interpretation to say that the contents of the roll are never disclosed. The book of God’s purposes was seen in the hand of Him who sat on the throne. The Evangelist longed to know something of its contents; vain efforts were made to open it; the Evangelist wept with disappointment; he was then comforted in his sorrow by hearing that the Lion of the tribe of Judah had conquered to open the book; but then, after all this, not a line or word of the book, it is said, is ever revealed. The servant is waiting to hear the divine word; the seer is waiting to record what is unfolded; but though the seals are opened, we are told that the words he waits for never came. St. John himself gives no hint of so disappointing a conclusion. Later on (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") he is told not to record the utterances of the seven thunders, but there the concealing of the utterances is clearly commanded. Here he evidently associates the visions of the seals with the contents of the roll. It is only a spirit in bondage to foolish literalisms which will ask how the visions can be the writing in the roll. The book represents God’s purposes and principles of His government in relation to the world-history; the seals show us some typical scenes in that world-history, and if not seen on the parchment of the roll, are yet unfoldings of principles and truths in the book. But it does not follow that all that is in the roll is ever unfolded. Such portions are made manifest as the seer could hear, and as the Church of Christ needed; and thus it may well be that the half-hour’s silence is significant that all God’s purposes and revelations are not exhausted—that there is something behind which it is not well that we should know—that prophecy as well as knowledge is partial. But the stillness of this half hour, if it reminds us of what is yet untold, yet proclaims to us a time of deep, unbroken tranquility, when the cries and groans of the earth, and even the grateful doxologies of heaven are hushed into calm. It is the silence which tells us that sorrow is ended, and eloquently tells us of heart peace. It is the rest of the troubled on the breast of God. All the earth, with her strife of tongues is still; all the cries of men (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), of trafficker and warrior, of struggling wise, and suffering good, are stilled; all flesh keeps silence before Him; He gives His people peace.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“O earth, so full of dreary noises!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O men with wailing in your voices!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O delved gold, the waiter’s heap!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O strife, O curse, that o’er it fall!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God strikes a silence through you all,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And giveth His beloved sleep.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only those who have been carried away by an over- refined philosophy or morbid sentimentalism can see anything selfish in longing, out of earth’s cares and injustices, for such a rest as this. It is surely not ignoble to pray—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Vouchsafe us such a half-hour’s hush alone,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In compensation for our stormy years;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As heaven has paused from song, let earth from moan.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 8:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when he had opened the seventh seal ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This seal is introductory to the trumpets contained under it, as the seventh trumpet introduces the vials which belong to it. The period, therefore, of this seal is of much longer duration, and comprehends many more events, than any of the former seals. It comprehends, indeed, seven periods, distinguished by the sounding of seven trumpets. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There was silence in heaven about half an hour — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This seems to have been intended, not only as an interval and pause, as it were, between the foregoing and the succeeding revelations, distinguishing in a remarkable manner the seventh seal from the six preceding; but as expressive of the solemn expectation excited on this occasion of great events about to be revealed. And the time of this silence being only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "half an hour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it seems, was intended to signify that the peace of the church would continue for a short season only, which was the case, namely, during the last fifteen years of Constantine’s reign, from A.D. 323 to A.D. 337. Of this silence some expositors think they find a figure in the following ceremonies of the Jews, mentioned by Philo. The incense, in the worship of God in the temple, used to be offered before the morning and after the evening sacrifice: and while the sacrifices were made, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:25-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) the voices, and instruments, and trumpets sounded; while the priest went into the temple to burn incense, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) all were silent, and the people prayed without in silence or to themselves. Now this was the morning of the church, and therefore the silence precedes the sounding of the trumpets.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-6 The seventh seal is opened. There was profound silence in heaven for a space; all was quiet in the church, for whenever the church on earth cries through oppression, that cry reaches up to heaven; or it is a silence of expectation. Trumpets were given to the angels, who were to sound them. The Lord Jesus is the High Priest of the church, having a golden censer, and much incense, fulness of merit in his own glorious person. Would that men studied to know the fulness that is in Christ, and endeavoured to be acquainted with his excellency. Would that they were truly persuaded that Christ has such an office as that of Intercessor, which he now performs with deep sympathy. No prayers, thus recommended, was ever denied hearing and acceptance. These prayers, thus accepted in heaven, produced great changes upon earth. The Christian worship and religion, pure and heavenly in its origin and nature, when sent down to earth and conflicting with the passions and worldly projects of sinful men, produced remarkable tumults, here set forth in prophetical language, as our Lord himself declared, Lu 12:49.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had opened the seventh seal - See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There was silence in heaven - The whole scene of the vision is laid in heaven Revelation 4:1-11, and John represents things as they seem to be passing there. The meaning here is, that on the opening of this seal, instead of voices, thunderings, tempests, as perhaps was expected from the character of the sixth seal (Revelation 6:12 ff), and which seemed only to have been suspended for a time Revelation 7, there was an awful stillness, as if all heaven was reverently waiting for the development. Of course this is a symbolical representation, and is designed not to represent a pause in the events themselves, but only the impressive and fearful nature of the events which are now to be disclosed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There was silence in heaven - The whole scene of the vision is laid in heaven ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:1-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and John represents things as they seem to be passing there. The meaning here is, that on the opening of this seal, instead of voices, thunderings, tempests, as perhaps was expected from the character of the sixth seal (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff), and which seemed only to have been suspended for a time ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", there was an awful stillness, as if all heaven was reverently waiting for the development. Of course this is a symbolical representation, and is designed not to represent a pause in the events themselves, but only the impressive and fearful nature of the events which are now to be disclosed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "About the space of half an hour - He did not profess to designate the time exactly. It was a brief period - yet a period which in such circumstances would appear to be long - about half an hour. The word used here - ἡμιώριον  hēmiōrion - does not occur elsewhere in the New Testament. It is correctly rendered \"half an hour\"; and, since the day was divided into twelve parts from the rising to the setting of the sun, the time designated would not vary much from half an hour with us. Of course, therefore, this denotes a brief period. In a state, however, of anxious suspense, the moments would seem to move slowly; and to see the exact force of this, we are to reflect on the scenes represented - the successive opening of seals disclosing most important events - increasing in interest as each new one was opened; the course of events which seemed to be leading to the consummation of all things, arrested after the opening of the sixth seal; and now the last in the series to be opened, disclosing what the affairs of the world would be at the consummation of all things.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "John looks on this; and in this state of suspense the half hour may have seemed an age. We are not, of course, to suppose that the silence in heaven is produced by the character of the events which are now to follow - for they are as yet unknown. It is caused by what, from the nature of the previous disclosures, was naturally apprehended, and by the fact that this is the last of the series - the finishing of the mysterious volume. This seems to me to be the obvious interpretation of this passage, though there has been here, as in other parts of the Book of Revelation, a great variety of opinion as to the meaning. Those who suppose that the whole book consists of a triple series of visions designed to prefigure future events, parallel with each other, and each leading to the consummation of all things - the series embracing the seals, the trumpets, and the vials, each seven in number - regard this as the proper ending of the first of this series, and suppose that we have on the opening of the seventh seal the beginning of a new symbolical representation, going over the same ground, under the representations of the trumpets, in a new aspect or point of view.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eichorn and Rosenmuller suppose that the silence introduced by the apostle is merely for effect, and that, therefore, it is without any special signification. Grotius applies the whole representation to the destruction of Jerusalem, and supposes that the silence in heaven refers to the restraining of the winds referred to in Revelation 7:1 - the wrath in respect to the city, which was now suspended for a short time. Prof. Stuart also refers it to the destruction of Jerusalem, and supposes that the seven trumpets refer to seven gradations in the series of judgments that were coming upon the persecutors of the church. Mr. Daubuz regards the silence here referred to as a symbol of the liberty granted to the church in the time of Constantine; Vitringa interprets it of the peace of the millennium which is to succeed the overthrow of the beast and the false prophet; Dr. Woodhouse and Mr. Cunninghame regard it as the termination of the series of events which thee former seals denote, and the commencement of a new train of revelations; Mr. Elliott, as the suspension of the winds during the sealing of the servants of God; Mr. Lord, as the period of repose which intervened between the close of the persecution by Diocletian and Galerius, in 311, and the commencement, near the close of that year, of the civil wars by which Constantine the Great was elevated to the imperial throne.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Eichorn and Rosenmuller suppose that the silence introduced by the apostle is merely for effect, and that, therefore, it is without any special signification. Grotius applies the whole representation to the destruction of Jerusalem, and supposes that the silence in heaven refers to the restraining of the winds referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - the wrath in respect to the city, which was now suspended for a short time. Prof. Stuart also refers it to the destruction of Jerusalem, and supposes that the seven trumpets refer to seven gradations in the series of judgments that were coming upon the persecutors of the church. Mr. Daubuz regards the silence here referred to as a symbol of the liberty granted to the church in the time of Constantine; Vitringa interprets it of the peace of the millennium which is to succeed the overthrow of the beast and the false prophet; Dr. Woodhouse and Mr. Cunninghame regard it as the termination of the series of events which thee former seals denote, and the commencement of a new train of revelations; Mr. Elliott, as the suspension of the winds during the sealing of the servants of God; Mr. Lord, as the period of repose which intervened between the close of the persecution by Diocletian and Galerius, in 311, and the commencement, near the close of that year, of the civil wars by which Constantine the Great was elevated to the imperial throne.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It will be seen at once how arbitrary and unsatisfactory most of those interpretations are, and how far from harmony expositors have been as to the meaning of this symbol. The most simple and obvious interpretation is likely to be the true one; and that is, as above suggested, that it refers to silence in heaven as expressive of the fearful anticipation felt on opening the last seal that was to close the series, and to wind up the affairs of the church and the world. Nothing would be more natural than such a state of solemn awe on such an occasion; nothing would introduce the opening of the seal in a more impressive manner; nothing would more naturally express the anxiety of the church, the probable feelings of the pious on the opening of these successive seals, than the representation that incense, accompanied with their prayers, was continually offered in heaven. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It will be seen at once how arbitrary and unsatisfactory most of those interpretations are, and how far from harmony expositors have been as to the meaning of this symbol. The most simple and obvious interpretation is likely to be the true one; and that is, as above suggested, that it refers to silence in heaven as expressive of the fearful anticipation felt on opening the last seal that was to close the series, and to wind up the affairs of the church and the world. Nothing would be more natural than such a state of solemn awe on such an occasion; nothing would introduce the opening of the seal in a more impressive manner; nothing would more naturally express the anxiety of the church, the probable feelings of the pious on the opening of these successive seals, than the representation that incense, accompanied with their prayers, was continually offered in heaven. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 8",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Re 8:1-13. Seventh Seal. Preparation for the Seven Trumpets. The First Four and the Consequent Plagues.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. was—Greek, \"came to pass\"; \"began to be.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "silence in heaven about … half an hour—The last seal having been broken open, the book of God's eternal plan of redemption is opened for the Lamb to read to the blessed ones in heaven. The half hour's silence contrasts with the previous jubilant songs of the great multitude, taken up by the angels (Re 7:9-11). It is the solemn introduction to the employments and enjoyments of the eternal Sabbath-rest of the people of God, commencing with the Lamb's reading the book heretofore sealed up, and which we cannot know till then. In Re 10:4, similarly at the eve of the sounding of the seventh trumpet, when the seven thunders uttered their voices, John is forbidden to write them. The seventh trumpet (Re 11:15-19) winds up God's vast plan of providence and grace in redemption, just as the seventh seal brings it to the same consummation. So also the seventh vial, Re 16:17. Not that the seven seals, the seven trumpets, and the seven vials, though parallel, are repetitions. They each trace the course of divine action up to the grand consummation in which they all meet, under a different aspect. Thunders, lightnings, an earthquake, and voices close the seven thunders and the seven seals alike (compare Re 8:5, with Re 11:19). Compare at the seventh vial, the voices, thunders, lightnings, and earthquake, Re 16:18. The half-hour silence is the brief pause GIVEN TO John between the preceding vision and the following one, implying, on the one hand, the solemn introduction to the eternal sabbatism which is to follow the seventh seal; and, on the other, the silence which continued during the incense-accompanied prayers which usher in the first of the seven trumpets (Re 8:3-5). In the Jewish temple, musical instruments and singing resounded during the whole time of the offering of the sacrifices, which formed the first part of the service. But at the offering of incense, solemn silence was kept (\"My soul waiteth upon God,\" Ps 62:1; \"is silent,\" Margin; Ps 65:1, Margin), the people praying secretly all the time. The half-hour stillness implies, too, the earnest adoring expectation with which the blessed spirits and the angels await the succeeding unfolding of God's judgments. A short space is implied; for even an hour is so used (Re 17:12; 18:10, 19).Revelation 8:1 The seventh seal opened.Revelation 8:2 Seven angels receive seven trumpets.Revelation 8:3-5 An angel presenteth the prayers of the saints with incenseon the golden altar before the throne.Revelation 8:6-13 Four of the angels sound their trumpets, and greatplagues severally follow. And when he;  that is, the Lamb, mentioned Revelation 5:7, who took the book out of the hand of him that sat upon the throne,  the book of God’s counsels, and had now revealed mysteriously to John what should come to pass (under all the pagan emperors) to the church of Christ, until the time of Constantine the Great, who, (as was said), about the year 325, had settled the Christian religion, and shut up all the idols’ temples, having conquered the apostate Licinius. Had opened the seventh seal;  he cometh now to open the seventh seal, that is, to reveal to John what should be in the succeeding time of the church to the end of the world. There was silence in heaven about the space of half an hour: but before the great evils should break out, which were to come to pass in this time, there was in the church a rest for a small time; for from the year 317, when Constantine bare the greatest sway in the empire, or 325, when he had got a full victory over Licinius, the church had a great peace for a little time, till 339, when the empire being divided, and Constantius having the eastern part, and Constans the western, (both sons of Constantine), Constanius, being an Arian, (who denied the Godhead of Christ), began again to persecute the Christians; and after him Julian, who apostatized to paganism. But after him they had a little further respite to the year 395, when Theodosius died, and the Christians’ quiet died with him. I rather choose to interpret this thus, than with those who understand the silence in heaven,  of a silence in the third heavens, in allusion to the Jewish order; who, though they sung during the time of the sacrifice, and played upon instruments of music all that time, yet kept silence while the incense was offering. For (as divers have noted) it seemeth hard to judge, that in this Revelation there should be no mention of that short truce which the church had during the reign of Constantine, and for a small time after. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "silence in heaven about … half an hour—The last seal having been broken open, the book of God's eternal plan of redemption is opened for the Lamb to read to the blessed ones in heaven. The half hour's silence contrasts with the previous jubilant songs of the great multitude, taken up by the angels (Re 7:9-11). It is the solemn introduction to the employments and enjoyments of the eternal Sabbath-rest of the people of God, commencing with the Lamb's reading the book heretofore sealed up, and which we cannot know till then. In Re 10:4, similarly at the eve of the sounding of the seventh trumpet, when the seven thunders uttered their voices, John is forbidden to write them. The seventh trumpet (Re 11:15-19) winds up God's vast plan of providence and grace in redemption, just as the seventh seal brings it to the same consummation. So also the seventh vial, Re 16:17. Not that the seven seals, the seven trumpets, and the seven vials, though parallel, are repetitions. They each trace the course of divine action up to the grand consummation in which they all meet, under a different aspect. Thunders, lightnings, an earthquake, and voices close the seven thunders and the seven seals alike (compare Re 8:5, with Re 11:19). Compare at the seventh vial, the voices, thunders, lightnings, and earthquake, Re 16:18. The half-hour silence is the brief pause GIVEN TO John between the preceding vision and the following one, implying, on the one hand, the solemn introduction to the eternal sabbatism which is to follow the seventh seal; and, on the other, the silence which continued during the incense-accompanied prayers which usher in the first of the seven trumpets (Re 8:3-5). In the Jewish temple, musical instruments and singing resounded during the whole time of the offering of the sacrifices, which formed the first part of the service. But at the offering of incense, solemn silence was kept (\"My soul waiteth upon God,\" Ps 62:1; \"is silent,\" Margin; Ps 65:1, Margin), the people praying secretly all the time. The half-hour stillness implies, too, the earnest adoring expectation with which the blessed spirits and the angels await the succeeding unfolding of God's judgments. A short space is implied; for even an hour is so used (Re 17:12; 18:10, 19).",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The seventh seal opened.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Seven angels receive seven trumpets.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 8:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " An angel presenteth the prayers of the saints with incense",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "on the golden altar before the throne.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 8:6-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Four of the angels sound their trumpets, and great",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "plagues severally follow.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And when he; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that is, the Lamb, mentioned ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "took the book out of the hand of him that sat upon the throne, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the book of God’s counsels, and had now revealed mysteriously to John what should come to pass (under all the pagan emperors) to the church of Christ, until the time of Constantine the Great, who, (as was said), about the year 325, had settled the Christian religion, and shut up all the idols’ temples, having conquered the apostate Licinius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Had opened the seventh seal; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he cometh now to open the seventh seal, that is, to reveal to John what should be in the succeeding time of the church to the end of the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "There was silence in heaven about the space of half an hour:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but before the great evils should break out, which were to come to pass in this time, there was in the church a rest for a small time; for from the year 317, when Constantine bare the greatest sway in the empire, or 325, when he had got a full victory over Licinius, the church had a great peace for a little time, till 339, when the empire being divided, and Constantius having the eastern part, and Constans the western, (both sons of Constantine), Constanius, being an Arian, (who denied the Godhead of Christ), began again to persecute the Christians; and after him Julian, who apostatized to paganism. But after him they had a little further respite to the year 395, when Theodosius died, and the Christians’ quiet died with him. I rather choose to interpret this thus, than with those who understand the ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "silence in heaven, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of a silence in the third heavens, in allusion to the Jewish order; who, though they sung during the time of the sacrifice, and played upon instruments of music all that time, yet kept silence while the incense was offering. For (as divers have noted) it seemeth hard to judge, that in this Revelation there should be no mention of that short truce which the church had during the reign of Constantine, and for a small time after. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had opened the seventh seal,.... That is, when the Lamb had opened the seventh and last seal of the scaled book: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there was silence in heaven about the space of half an hour; not in the third heaven, the seat of the divine Being, of angels and glorified saints, where are hallelujahs without intermission; but in the church, which is oftentimes signified by heaven in this book, and where now the throne of God was placed, in that form as described in Revelation 4:4, or rather in the Roman empire: nor is this silence the sum of this seal, or the only thing in it; for it includes the preparation of the seven angels to take their trumpets, though none of them were sounded during this period. This space of time some think refers to the time which elapsed, while the angel, who had incense given him to offer it with the prayers of saints, did so, and took fire off the altar with his censer, and cast it on the earth: and while the seven angels had their trumpets given them, and they were preparing to sound. Others are of opinion that this was only a pause, a breathing time for John between the former visions and seals, and the following; nothing being said or done, or anything exhibited to him during this interval; but he was at leisure to reflect on what he had seen, and to prepare for what was to come. Others understand it of the amazement of the saints at the judgments of God, which were coming upon the Christian empire, and of their quiet and silent preparations for these troubles and combats, both within and without, they were to be exercised with; see Zechariah 2:13. Others have thought that this refers to the state of the saints after the day of judgment, when there will be an entire cessation from persecution and trouble, and when the souls under the altar will have done crying for vengeance; but this will be not for half an hour only, but to all eternity; nor will angels and saints be then silent. Rather this is to be understood of that peace and rest which the church enjoyed upon Constantine's having defeated all his enemies, when he brought the church into a state of profound tranquillity and ease; and this lasted but for a little while, which is here expressed by about, or almost half an hour, as the Syriac version renders it; for in a short time the Arian heresy broke out, which introduced great troubles in the church, and at last violent persecutions. The allusion is, as in the whole of the following vision of the angel at the altar, to the offering of incense; at which time the people were removed from the temple, from between the porch and altar (l), to some more distant place; and the priest was alone while he offered incense, and then prayed a short prayer, that the people might not be affrighted lest he should be dead (m): and who in the mean while were praying in a silent, manner without; see Luke 1:9; hence the Jews say (n), that the offering of incense atones for an ill tongue, for it is a thing that is introduced  \"silently\", and it atones for what is done silently, such as whisperings, backbitings, &c. and they call (o) silence the best of spices, even of those of which the sweet incense was made. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there was silence in heaven about the space of half an hour; not in the third heaven, the seat of the divine Being, of angels and glorified saints, where are hallelujahs without intermission; but in the church, which is oftentimes signified by heaven in this book, and where now the throne of God was placed, in that form as described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or rather in the Roman empire: nor is this silence the sum of this seal, or the only thing in it; for it includes the preparation of the seven angels to take their trumpets, though none of them were sounded during this period. This space of time some think refers to the time which elapsed, while the angel, who had incense given him to offer it with the prayers of saints, did so, and took fire off the altar with his censer, and cast it on the earth: and while the seven angels had their trumpets given them, and they were preparing to sound. Others are of opinion that this was only a pause, a breathing time for John between the former visions and seals, and the following; nothing being said or done, or anything exhibited to him during this interval; but he was at leisure to reflect on what he had seen, and to prepare for what was to come. Others understand it of the amazement of the saints at the judgments of God, which were coming upon the Christian empire, and of their quiet and silent preparations for these troubles and combats, both within and without, they were to be exercised with; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Others have thought that this refers to the state of the saints after the day of judgment, when there will be an entire cessation from persecution and trouble, and when the souls under the altar will have done crying for vengeance; but this will be not for half an hour only, but to all eternity; nor will angels and saints be then silent. Rather this is to be understood of that peace and rest which the church enjoyed upon Constantine's having defeated all his enemies, when he brought the church into a state of profound tranquillity and ease; and this lasted but for a little while, which is here expressed by about, or almost half an hour, as the Syriac version renders it; for in a short time the Arian heresy broke out, which introduced great troubles in the church, and at last violent persecutions. The allusion is, as in the whole of the following vision of the angel at the altar, to the offering of incense; at which time the people were removed from the temple, from between the porch and altar (l), to some more distant place; and the priest was alone while he offered incense, and then prayed a short prayer, that the people might not be affrighted lest he should be dead (m): and who in the mean while were praying in a silent, manner without; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; hence the Jews say (n), that the offering of incense atones for an ill tongue, for it is a thing that is introduced  \"silently\", and it atones for what is done silently, such as whisperings, backbitings, &c. and they call (o) silence the best of spices, even of those of which the sweet incense was made. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) T. Tab. Yoma, fol. 44. 1. Maimon. Hilchot Tamidin, c. 3. sect. 3.((m) Misn. Yoma, c. 5. sect. 1.((n) T. Bab. Yoma, fol. 44. 1. & Zebachim, fol. 88. 2.((o) T. Bab. Megilla, fol. 18. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) T. Tab. Yoma, fol. 44. 1. Maimon. Hilchot Tamidin, c. 3. sect. 3.((m) Misn. Yoma, c. 5. sect. 1.((n) T. Bab. Yoma, fol. 44. 1. & Zebachim, fol. 88. 2.((o) T. Bab. Megilla, fol. 18. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And {1} when he had opened the seventh seal, there was silence in heaven about the space of half an hour.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{1}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " when he had opened the seventh seal, there was silence in heaven about the space of half an hour.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) He returns to the history of the seals of the book, which the Lamb opens. The seventh seal is the next sign, a precise commandment for the execution of the most severe judgment of God on this wicked world, and being understood by the seal, all things in heaven are silent, and in horror through admiration, until the command to act is given by God to the ministers of his wrath. So he moves to the third part which I spoke of before in Re 6:1 which is the enacting of those evils with which God most justly determined to afflict the world.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅταν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[2386] as is not unusual among the Byzantines.[2387]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓῊ ἘΝ Τῷ ΟὐΡΑΝῷ Ὡς ἩΜΊΩΡΟΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓῊ ἘΝ Τῷ ΟὐΡΑΝῷ Ὡς ἩΜΊΩΡΟΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The silence in heaven, lasting about[2388] a half-hour, begins at the place where the songs of praise still resound, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq. The voice also of the elder who speaks immediately before the opening of the seventh seal is silent. When the Lamb took the book with the seven seals, the music of the harp and the song of praise resounded in heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq.; also at the opening of the first six seals, it was in many ways audible;[2389] but when the last seal is opened, a profound silence ensues. The reason for this is the anxious expectation of the inhabitants of heaven, who not only after the precedency of the sixth seal must now expect the final decisive catastrophe, but, also, can infer the proximity of that catastrophe from the appearing of the seven angels, and their being furnished with trumpets. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγὴ ἐν τῷ οὐρανῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is thus a “silent expectation and contemplation of the seven trumpets,”[2390] and, as an expression of “the stupor of the heavenly beings,” belongs to “the adornment and fitness of the dramatic scene.”[2391] Thus, essentially, Andr., Areth., Par., Vieg., Rib., Aret., Calov., Beng., Ew., De Wette, Stern, Ebrard, all of whom are one on the main point,[2392] that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " compose the entire contents of the seventh seal, but that rather from this last seal the entire series of trumpet-visions is developed. If this is denied, as by Vitr., and recently by Hengstenb., not only is the organic connection of the visions as a whole rent,—since “the group of the seven trumpets” appears immediately beside “the group of the seven seals,”[2393] but results follow with respect to the exposition as a whole, and in its details, that are entirely inadmissible. Hengstenb. interprets the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγὴ ἐν τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., as the silencing of the enemies of Christ and his Church, which corresponds with their mourning,[2394] and is regarded as caused by the punishments of the preceding six seals. And, besides, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ οὐρανῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which alone is strong enough to render this mode of statement impossible, is explained away by the remark: “Heaven here comes into consideration only as a theatre (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In reality the silence belongs to the earth”!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Vitr. seeks, in a better way, to meet the demands of the text. He refutes, first, the view according to which it is thought that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the entire contents of the seventh seal are described,[2395] by the excellent remark that already, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the angels of the trumpets enter, and that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:2-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contain in general a certain preparation for ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq. But while Vitr. thus properly hesitates to sunder ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq. from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq., he separates ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq. by finding in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the contents of the seventh seal, i.e., the complete conclusion of the series of seal-visions, according to their prophetic significance extending until the end of the world, which, in their way, comprise the entire breadth of Apocalyptic prophecy; for from this it necessarily follows that the prophecy begins again with the first trumpet-vision, which runs parallel to the first seal-vision, etc. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγὴ ἐν τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". designates, according to Vitr., “the condition of the most recent period of the Church, in which the Church in the possession of peace, tranquillity, and an abundance of all spiritual blessings, celebrates a triumph over its enemies.” This ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", therefore, actually lasts a long time, although it appears to John a half-hour,[2396]—as Lange with entire consistency says, one thousand years.[2397] The connection with the trumpet-visions lies in the fact that here “the Spirit explains in what way and by what steps God led the Church into that state,” viz., as those trumpet-visions describe: “Evils intended for the punishment of the Roman Empire, the enemy of the Church of Christ, to be terminated in the total destruction of the same empire.” There are two main points characteristic of this mode of conception, which is best advocated by Vitr., in which, however, the distortion is evident; viz., the explanation of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓῊ ἘΝ Τ. ΟὐΡ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓῊ ἘΝ Τ. ΟὐΡ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the statement of the connection with the trumpet-visions. If it is assumed that the seventh seal brings nothing else than that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓῊ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓῊ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",—although as well after the events of the first six seals, as after the interposed ch. 7, a certain fulness of significant contents is to be expected,—the question for which neither reasons are assigned, nor to which an answer is in any way given in the context itself, is raised; viz., as to what that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " “means,” i.e, what historical fact, what state of the world or Church, is typified by that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " whose allegorical meaning is presupposed. And this question arbitrarily raised can be answered only arbitrarily: the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " means the sabbath rest of the Church after the plagues of the first six seals,[2398] “the beginning of the eternal rest,”[2399] the thousand-years rest before the final end,[2400] or perhaps, in case the sixth seal be not regarded as extending so far, the rest of the Church under Constantine.[2401] As to what the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " “means,” expositors of an entirely different class have investigated also when they even with formal correctness acknowledged that not only does the seventh seal contain that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but also the seven trumpets introduce it. Here belong especially the expositors who refer ch. 8 also to the events of the Romano-Judaic war. According to Grot., the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΣΙΓῊ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΣΙΓῊ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἘΝ Τ. ΟὐΡ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἘΝ Τ. ΟὐΡ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the brief rest of the winds of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which are at the four corners ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of the earth!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Wetst. explains more minutely: “Since all things now looked to a revolt of the Jews, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "brief pause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " followed by the intervention of Agrippa and the priests.”[2402] Alcas.: “The remarkable forbearance of Christians who silently endured persecution from the Jews.” Against all these arbitrary explanations, we must hold fast simply to the text, which says that at the opening of the seventh seal a profound silence occurred in heaven, where the sealed book was opened,—a silence which “signifies” something earthly, as little as the speech and songs heard in heaven at the opening of the preceding seals. But thereby the knowledge is gained that such silence occurs just because of the peculiar contents of this seal. Thereby, besides, the exposition is preserved from the second offence against the context, with which not only Beda but also Ebrard, etc., are chargeable, viz., the idea of a recapitulation in the entire series of trumpet-visions. For what Beda expressly says[2403] is said essentially not only by Vitr., but also, e.g., by Ebrard, when he passes the opinion that in the trumpets, “a retrogression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as it were",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is taken,” viz., by the representation “of classes and kinds of judicial punishments which belong only to the godless,[2404] and that, too, not first after or with the sixth seal, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even already before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” In exegetical principle, this exposition stands upon a line with the one of N. de Lyra, who, by the theory of recapitulation, explains that only the conflict of the Church with heretics is portrayed, after[2405] its conflict against tyrants, the heathen oppressors, is stated. Accordingly, the exposition in the trumpet-visions can recur again to the centuries of Church history, from which, on the other side, all sort of facts have already been gathered for ch. 6, in order to show the fulfilment of prophecy. The only apparent occasion which the context gives for the idea that the trumpet-visions recur again before the sixth seal—an idea which has led not only to the further statement that the individual trumpets in some way concur with the individual seals, but also to numberless and unlimited attempts to find the fulfilment of the individual trumpet-visions in historical events—lies in the fact that the final catastrophe, the extreme end, whose description is to be expected after chs. 6. and 7 in the seventh seal, does not yet, at least immediately, appear.[2406] But the expedient adopted here by many expositors to limit the contents of the seventh seal to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to understand the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σιγὴ ἐν τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". as the eternal rest of the perfected Church, or the eternal silencing of condemned enemies, has been proved to be mistaken. Yet that difficulty is solved by the view, attained already by Ew., Lücke, De Wette, Rinck,[2407] into the skilful, carefully designed plan of the entire book, which here, just from the fact that from the last seal a new series of visions is to proceed, describes the trial of the patience of saints who are regarded as awaiting the day of the Lord;[2408] but at the same time the expectation excited by the events of the first six seals, and increased by the entire ch. 7, as well as by the silence occurring at the opening of the seventh seal, that in this last seal the final completion is to come, in no way deceives, since the full conclusion is actually disclosed in the seventh seal, although only through a long series of visions in whose chain the trumpet-visions themselves form only the first members.[2409]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2386] See Critical Notes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2387] Winer, p. 290.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2388] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2389] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2390] C. a Lap.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2391] Eichh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2392] Cf. also Grot., Wetst., Herder, etc., who in other respects deny the reference of the whole.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2393] Hengstenb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2394] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2395] Braun, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Select. Sacr.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ii. cc. 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2396] Cf. Aret., Bengel; the latter of whom reckoned the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμίμωρον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as about four ordinary days.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2397] Cf. also Beda, Hofm., etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2398] Beda, Hofm., Christiani.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2399] Vict., Primas.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2400] Lange.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2401] Laun, Brightm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2402] Josephus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "B. J",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ii. 15, 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2403] “But now he recapitulates from the origin, in order to say the same things in another way.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2404] Cf., on the other hand, the general remarks above on ch. 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2405] Up to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2406] Other reasons, as that asserted by Ebrard: “How could the third part of the sun and moon be darkened (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), after they have first lost all their ight” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")?—from which it would follow that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " actually belongs ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—may be contradicted directly from their own standpoint. For against ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "such",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " considerations, it may be said: How ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " speak of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "entire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " moon, when in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the third of it is already eclipsed?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The opening of the seventh seal is followed by half an hour’s silence in heaven: “he opened” looks back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the absence of subject showing that 7 is a parenthesis foreign to the seal-series in its original shape. Probably this series, like each of the others, was originally a separate oracle upon the latter days. When woven by the author into his large work, they suffered a literary treatment which has interrupted but not altogether obliterated their original form and sequence. The book of destiny is now open; what follows (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.) is the course of the future, which naturally corresponds at some points to the predictions already sketched proleptically in chap. 6. A brief interval, not of exhaustion but of expectation, of breathless suspense (a pause in the ecstasy, LXX of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ushers in a preliminary series of judicial plagues heralded by seven trumpet-blasts (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Half an hour (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Win. § 5, 22 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for form) may have been an ominous period; Josephus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "B. J.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vi. 5, § 3) describes a portent at the siege of Jerusalem which consisted of a bright light shining at twilight for half an hour, and the collocation of silence with reverence is illustrated by the LXX version (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐλαβείσθω πᾶσα σάρξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. The following trumpet-series has been woven into the frame of the work by the device of making it take the place of the climax which (after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") one would naturally expect to occur at this point. When the dénouement should take place, nothing happens; the judgment is adjourned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Seventh Seal. Chap. 8 ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there was silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] All the promised signs of Christ’s Coming have been fulfilled—everything has, apparently, been made ready for it: and we expect Him to come, and the world to come to an end: but the series of signs concludes—not with a catastrophe but—in silence. The same is the case, though less markedly, after the seventh trumpet in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and in fact, similar cases occur throughout the book. We have the choice between three explanations of this phenomenon. (I.) The preceding series of visions does describe the events leading up to Christ’s Coming: when they are ended, He does come, but His Coming itself is not described. Here, it is passed over in silence, or only symbolised by the opening of the seventh seal: the half-hour’s silence is, as St Victorinus grandly says, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "initium quietis aeternae",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” (II.) The previous series of visions describes events preparatory, indeed, to Christ’s Coming, but not leading directly up to it: the events symbolised by these visions ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " been fulfilled, but those of the rest of the Book must be fulfilled also, before He really comes. (III.) These visions represent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on a smaller scale",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the preparations for Christ’s final Coming and Judgement: but they do not wait for their fulfilment till then, but have their proportionate fulfilment in any anticipatory judgement which He executes on one nation or generation. The similar series of visions which follow are therefore not parallel with this, but successive: again and again God executes His Judgements, foreshadowing the last Judgement of all, and leading men to expect it: and at last He will execute that also. The last view is the one generally taken in these notes: see Introduction, p. lv. On any view it is a pity that this verse is joined with this chapter rather than with the preceding: the blowing of the seven trumpets can hardly be regarded as the effect of the opening the seal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Σιγὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", silence) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is opposed to a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "voice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The more frequent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "voices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are in this book, for instance, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and foil, verses, the more remarkable is this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of awful expectation, preceding the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "clang",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of trumpets. D. Lange interprets it as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keeping rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sabbatism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of a thousand years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Hermen. Einleit. pp. 30, 68, etc.), by an error (I am compelled to speak the truth), which introduces great confusion. Neither is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a sabbath, nor is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "half-hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the millennium. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Erkl. Offenb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 407 and following.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Καὶ ὅταν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ ὅτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as in the other seals), is read in A, C, and gives a certain indefiniteness which does not belong to any of the rest (Altbrd). ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Οτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is, however, found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", B, P, Andreas. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He had opened the seventh seal;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he opened.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As in the case of the other seals, the silence accompanies the opening (see on Revelation 6:1, 3, 5, etc.). This completes the number, and sets the roll free (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The contents of the roll do not, however, become visible, nor are they portrayed otherwise than by the silence of half an hour (see on Revelation 5:1). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There was silence in heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "there followed a silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a silence became",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where there had not been silence previously, owing to the praises set forth at the close of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This image may have been suggested by the silence kept by the congregation without, while the priest offered incense within, the temple (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This thought, too, may have led to the following vision, in which the angel offers incense (ver. 3), and in this souse the vision of the trumpets may be said to have grown out of the seventh seal, though a similar act precedes the visions of the seals (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But in no other way is there any connection between the two visions; the events narrated under the vision of the trumpets are not an exposition of the seventh seal, but a separate vision, supplementing what has been set forth by the seven seals. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is typical of the eternal peace of heaven, the ineffable bliss of which it is impossible for mortals to comprehend, and which is, therefore, symbolized by silence. In the same way the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "new name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is left unexplained, as something beyond the knowledge of man in this life, and reserved for the life in heaven (see on Revelation 3:12). It is the sabbath of the Church's history, into the full comprehension of which man cannot now enter. The interpretation of this seal varies with different writers, according to the view taken of the vision as a whole. Bede, Primasius, Victorinus, Wordsworth, agree in considering that it denotes the beginning of eternal peace. Those who take the preterist view variously assign the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "silence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the destruction of Jerusalem (Manrice); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A.D. 312-337 (King); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the period following A.D.  (Eiliott); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the millennium (Lange); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the decree of Julian imposing silence on the Christians (De Lyra), etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Vitringa thinks it relates to the time when the Church will be triumphant on earth; Hengstenberg, the astonishment of Christ's enemies; Ebrard, the silence of creation in awe at the catastrophes about to happen; and Dusterdieck, similarly, the silence of those in heaven, waiting for the same events. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "About the space of half an hour.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Most writers are agreed that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "half hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "short",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " time. But if (as we have indicated above) the silence is typical of the eternal rest of heaven, how can it be short? Possibly the answer is that the shortness refers to the time during which the seer was contemplating this aspect of the vision. He had now arrived at the end; the fate of the Church had been in some measure foreshadowed, and the final assurance is peace in heaven. That part of the fate in store for the Church cannot be expounded by the seer. He is permitted, as it were, to visit the threshold for an instant, and then he is called away. His message is not yet complete; he is summoned to receive yet further revelations. But may not the half hour signify \"a long time\"? The seer, in his vision, after beholding a succession of events, experiences a pause - complete silence for the space of half an hour. This time would appear almost interminable in such circumstances; and the phrase may therefore be intended to express \"an exceedingly lengthened period,\" such as a stillness of such a length in the midst of numbers would appear to St. John. Here, then, closes the vision of the seals. The first four, prefaced by the assurance of final victory, deal with events more immediately connected with this life, and explain to the suffering Christian of all ages that it is part of God's eternal purpose that he should be exposed to persecution, trial, and temptation while in the world, and that such suffering is not the result of God's forgetfulness or heedlessness. The last three seats refer to three sets of events connected with the life hereafter. The fifth shows the security of those who have departed this life; the sixth portrays the safe gathering of God's own, and the fear and condemnation of the unjust at the judgment day; the seventh affords a prospect rather than a sight of the eternal sabbath of heaven, undescribed because indescribable. The whole is thus completed; the seer is called away to review the ages once more - to behold new visions, which shall impress more fully, and supplement, the truths which the visions of the seals have, in a measure, revealed. Revelation 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When (ὅτε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Read ὅταν, the indefinite particle with the indicative mood. For a similar construction, see Mark 11:19 (correct reading). Alford observes that it occurs in the opening of this seal only, giving it an indefiniteness which does not belong to any of the rest.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Read ὅταν, the indefinite particle with the indicative mood. For a similar construction, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (correct reading). Alford observes that it occurs in the opening of this seal only, giving it an indefiniteness which does not belong to any of the rest.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There was (ἐγένετο)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "More literally, come to pass. Rev., there followed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "About (ὡς)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A usual form of expression with John. See John 1:39; John 6:19; John 11:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A usual form of expression with John. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]