[{"header":"Jesus Speaks to His Disciples"},{"num":12,"verse":"Meanwhile, thousands of people had gathered. They were so crowded that they stepped on each other. Jesus spoke to his disciples and said, “Watch out for the yeast of the Pharisees. I’m talking about their hypocrisy. "},{"num":2,"verse":"Nothing has been covered that will not be exposed. Whatever is secret will be made known. "},{"num":3,"verse":"Whatever you have said in the dark will be heard in the daylight. Whatever you have whispered in private rooms will be shouted from the housetops."},{"num":4,"verse":"“My friends, I can guarantee that you don’t need to be afraid of those who kill the body. After that they can’t do anything more. "},{"num":5,"verse":"I’ll show you the one you should be afraid of. Be afraid of the one who has the power to throw you into hell after killing you. I’m warning you to be afraid of him."},{"num":6,"verse":"“Aren’t five sparrows sold for two cents? God doesn’t forget any of them. "},{"num":7,"verse":"Even every hair on your head has been counted. Don’t be afraid! You are worth more than many sparrows. "},{"num":8,"verse":"I can guarantee that the Son of Man will acknowledge in front of God’s angels every person who acknowledges him in front of others. "},{"num":9,"verse":"But God’s angels will be told that I don’t know those people who tell others that they don’t know me. "},{"num":10,"verse":"Everyone who says something against the Son of Man will be forgiven. But the person who dishonors the Holy Spirit will not be forgiven."},{"num":11,"verse":"“When you are put on trial in synagogues or in front of rulers and authorities, don’t worry about how you will defend yourselves or what you will say. "},{"num":12,"verse":"At that time the Holy Spirit will teach you what you must say.”"},{"header":"A Story about Material Possessions"},{"num":13,"verse":"Someone in the crowd said to him, “Teacher, tell my brother to give me my share of the inheritance that our father left us.”"},{"num":14,"verse":"Jesus said to him, “Who appointed me to be your judge or to divide ⌞your inheritance⌟?”"},{"num":15,"verse":"He told the people, “Be careful to guard yourselves from every kind of greed. Life is not about having a lot of material possessions.”"},{"num":16,"verse":"Then he used this illustration. He said, “A rich man had land that produced good crops. "},{"num":17,"verse":"He thought, ‘What should I do? I don’t have enough room to store my crops.’ "},{"num":18,"verse":"He said, ‘I know what I’ll do. I’ll tear down my barns and build bigger ones so that I can store all my grain and goods in them. "},{"num":19,"verse":"Then I’ll say to myself, “You’ve stored up a lot of good things for years to come. Take life easy, eat, drink, and enjoy yourself.” ’"},{"num":20,"verse":"“But God said to him, ‘You fool! I will demand your life from you tonight! Now who will get what you’ve accumulated?’ "},{"num":21,"verse":"That’s how it is when a person has material riches but is not rich in his relationship with God.”"},{"header":"Stop Worrying(A)"},{"num":22,"verse":"Then Jesus said to his disciples, “So I tell you to stop worrying about what you will eat or wear. "},{"num":23,"verse":"Life is more than food, and the body is more than clothes. "},{"num":24,"verse":"Consider the crows. They don’t plant or harvest. They don’t even have a storeroom or a barn. Yet, God feeds them. You are worth much more than birds."},{"num":25,"verse":"“Can any of you add an hour to your life by worrying? "},{"num":26,"verse":"If you can’t do a small thing like that, why worry about other things? "},{"num":27,"verse":"Consider how the flowers grow. They never work or spin yarn for clothes. But I say that not even Solomon in all his majesty was dressed like one of these flowers. "},{"num":28,"verse":"That’s the way God clothes the grass in the field. Today it’s alive, and tomorrow it’s thrown into an incinerator. So how much more will he clothe you people who have so little faith?"},{"num":29,"verse":"“Don’t concern yourself about what you will eat or drink, and quit worrying about these things. "},{"num":30,"verse":"Everyone in the world is concerned about these things, but your Father knows you need them. "},{"num":31,"verse":"Rather, be concerned about his kingdom. Then these things will be provided for you. "},{"num":32,"verse":"Don’t be afraid, little flock. Your Father is pleased to give you the kingdom."},{"num":33,"verse":"“Sell your material possessions, and give the money to the poor. Make yourselves wallets that don’t wear out! Make a treasure for yourselves in heaven that never loses its value! In heaven thieves and moths can’t get close enough to destroy your treasure. "},{"num":34,"verse":"Your heart will be where your treasure is."},{"header":"The Son of Man Will Return When You Least Expect Him"},{"num":35,"verse":"“Be ready for action, and have your lamps burning. "},{"num":36,"verse":"Be like servants waiting to open the door at their master’s knock when he returns from a wedding. "},{"num":37,"verse":"Blessed are those servants whom the master finds awake when he comes. I can guarantee this truth: He will change his clothes, make them sit down at the table, and serve them. "},{"num":38,"verse":"They will be blessed if he comes in the middle of the night or toward morning and finds them awake."},{"num":39,"verse":"“Of course, you realize that if the homeowner had known at what hour the thief was coming, he would not have let him break into his house. "},{"num":40,"verse":"Be ready, because the Son of Man will return when you least expect him.”"},{"num":41,"verse":"Peter asked, “Lord, did you use this illustration just for us or for everyone?”"},{"num":42,"verse":"The Lord asked, “Who, then, is the faithful, skilled manager that the master will put in charge of giving the other servants their share of food at the right time? "},{"num":43,"verse":"That servant will be blessed if his master finds him doing this job when he comes. "},{"num":44,"verse":"I can guarantee this truth: He will put that servant in charge of all his property. "},{"num":45,"verse":"On the other hand, that servant may think that his master is taking a long time to come home. The servant may begin to beat the other servants and to eat, drink, and get drunk. "},{"num":46,"verse":"His master will return at an unexpected time. Then his master will punish him severely and assign him a place with unfaithful people."},{"num":47,"verse":"“The servant who knew what his master wanted but didn’t get ready to do it will receive a hard beating. "},{"num":48,"verse":"But the servant who didn’t know ⌞what his master wanted⌟ and did things for which he deserved punishment will receive a light beating. A lot will be expected from everyone who has been given a lot. More will be demanded from everyone who has been entrusted with a lot."},{"header":"Jesus Will Cause Conflict"},{"num":49,"verse":"“I have come to throw fire on the earth. I wish that it had already started! "},{"num":50,"verse":"I have a baptism to go through, and I will suffer until it is over."},{"num":51,"verse":"“Do you think I came to bring peace to earth? No! I can guarantee that I came to bring nothing but division. "},{"num":52,"verse":"From now on a family of five will be divided. Three will be divided against two and two against three. "},{"num":53,"verse":"A father will be against his son and a son against his father. A mother will be against her daughter and a daughter against her mother. A mother-in-law will be against her daughter-in-law and a daughter-in-law against her mother-in-law.”"},{"header":"Use Good Judgment"},{"num":54,"verse":"Jesus said to the crowds, “When you see a cloud coming up in the west, you immediately say, ‘There’s going to be a rainstorm,’ and it happens. "},{"num":55,"verse":"When you see a south wind blowing, you say, ‘It’s going to be hot,’ and that’s what happens. "},{"num":56,"verse":"You hypocrites! You can forecast the weather by judging the appearance of earth and sky. But for some reason you don’t know how to judge the time in which you’re living. "},{"num":57,"verse":"So why don’t you judge for yourselves what is right? "},{"num":58,"verse":"For instance, when an opponent brings you to court in front of a ruler, do your best to settle with him before you get there. Otherwise, he will drag you in front of a judge. The judge will hand you over to an officer who will throw you into prison. "},{"num":59,"verse":"I can guarantee that you won’t get out until you pay every penny of your fine.”"}]