[{"header":"A Warning against Hypocrisy"},{"num":12,"verse":"Meanwhile, the people had gathered by the thousands and were trampling on one another. Jesus began to speak first to his disciples. “Watch out for the yeast—that is, the hypocrisy—of the Pharisees! "},{"num":2,"verse":"There is nothing covered up that won’t be exposed and nothing secret that won’t be made known. "},{"num":3,"verse":"Therefore, what you have said in darkness will be heard in the daylight, and what you have whispered in private rooms will be shouted from the housetops.”"},{"header":"Fear God(A)"},{"num":4,"verse":"“But I tell you, my friends, never be afraid of those who kill the body and after that can’t do anything more. "},{"num":5,"verse":"I’ll show you the one you should be afraid of. Be afraid of the one who has the authority to throw you into hell after killing you. Yes, I tell you, be afraid of him!"},{"num":6,"verse":"“Five sparrows are sold for two pennies, aren’t they? Yet not one of them is forgotten by God. "},{"num":7,"verse":"Why, even all the hairs on your head have been counted! Stop being afraid. You are worth more than a bunch of sparrows.”"},{"header":"Acknowledging the Messiah(B)"},{"num":8,"verse":"“But I tell you, the Son of Man will acknowledge before God’s angels everyone who acknowledges me before people. "},{"num":9,"verse":"But whoever denies me before people will be denied before God’s angels. "},{"num":10,"verse":"Everyone who speaks a word against the Son of Man will be forgiven, but the person who blasphemes against the Holy Spirit won’t be forgiven. "},{"num":11,"verse":"When people bring you before synagogue leaders, rulers, or authorities, don’t worry about how you will defend yourselves or what you will say, "},{"num":12,"verse":"because at that time the Holy Spirit will teach you what you are to say.”"},{"header":"The Parable of the Rich Fool"},{"num":13,"verse":"Then someone in the crowd told him, “Teacher, tell my brother to divide the family inheritance with me.”"},{"num":14,"verse":"But Jesus asked him, “Mister, who appointed me to be a judge or arbitrator over you people?” "},{"num":15,"verse":"Then he told them, “Be careful to guard yourselves against every kind of greed, because a person’s life doesn’t consist of the amount of possessions he has.”"},{"num":16,"verse":"Then he told them a parable. He said, “The land of a certain rich man produced good crops. "},{"num":17,"verse":"So he began to think to himself, ‘What should I do, since I have no place to store my crops?’ "},{"num":18,"verse":"Then he said, ‘This is what I’ll do. I’ll tear down my barns and build bigger ones, and I’ll store all my grain and goods in them. "},{"num":19,"verse":"Then I’ll say to myself, “You’ve stored up plenty of good things for many years. Take it easy, eat, drink, and enjoy yourself.”’ "},{"num":20,"verse":"But God told him, ‘You fool! This very night your life will be demanded back from you. Now who will get the things you’ve accumulated?’ "},{"num":21,"verse":"That’s how it is with the person who stores up treasures for himself rather than with God.”"},{"header":"Stop Worrying(C)"},{"num":22,"verse":"Then Jesus told his disciples, “That’s why I’m telling you to stop worrying about your life—what you will eat—or about your body—what you will wear, "},{"num":23,"verse":"because life is more than food, and the body more than clothing. "},{"num":24,"verse":"Consider the crows. They don’t plant or harvest, they don’t even have a storeroom or barn, yet God feeds them. How much more valuable are you than birds! "},{"num":25,"verse":"Can any of you add an hour to the length of your life by worrying? "},{"num":26,"verse":"So if you can’t do a small thing like that, why worry about other things? "},{"num":27,"verse":"Consider how the lilies grow. They don’t work or spin yarn, but I tell you that not even Solomon in all his splendor was clothed like one of them. "},{"num":28,"verse":"Now if that’s the way God clothes the grass in the field, which is alive today and thrown into an oven tomorrow, how much more will he clothe you—you who have little faith?"},{"num":29,"verse":"“So stop concerning yourselves about what you will eat or what you will drink, and stop being distressed, "},{"num":30,"verse":"because it is the unbelievers who are concerned about all these things. Surely your Father knows that you need them! "},{"num":31,"verse":"Instead, be concerned about his kingdom, and these things will be provided for you as well. "},{"num":32,"verse":"Stop being afraid, little flock, because your Father is pleased to give you the kingdom."},{"num":33,"verse":"“Sell your possessions, and give the money to the poor. Make yourselves wallets that don’t wear out—a dependable treasure in heaven, where no thief can get close and no moth can destroy anything. "},{"num":34,"verse":"Because where your treasure is, there your heart will be also.”"},{"header":"The Watchful Servants(D)"},{"num":35,"verse":"“You must keep your belts fastened and your lamps burning. "},{"num":36,"verse":"Be like people who are waiting for their master to return from a wedding. As soon as he arrives and knocks, they will open the door for him. "},{"num":37,"verse":"How blessed are those servants whom the master finds watching for him when he comes! I tell all of you with certainty, he himself will put on an apron, make them sit down at the table, and go around and serve them. "},{"num":38,"verse":"How blessed they will be if their master comes in the middle of the night or near dawn and finds them awake! "},{"num":39,"verse":"But be sure of this: if the homeowner had known at what time the thief were coming, he would have watched and would not have let his house be broken into. "},{"num":40,"verse":"So be ready, because the Son of Man is coming at a time when you don’t expect him.”"},{"num":41,"verse":"Peter asked, “Lord, are you telling this parable just for us or for everyone?”"},{"num":42,"verse":"The Lord said, “Who, then, is the faithful and careful servant manager whom his master will put in charge of giving all his other servants their share of food at the right time? "},{"num":43,"verse":"How blessed is that servant whom his master finds doing this when he comes! "},{"num":44,"verse":"I tell you with certainty, he will put him in charge of all his property. "},{"num":45,"verse":"But if that servant says to himself, ‘My master is taking a long time to come back,’ and begins to beat the other servants and to eat, drink, and get drunk, "},{"num":46,"verse":"the master of that servant will come on a day when he doesn’t expect him and at an hour that he doesn’t know. Then his master will punish him severely and assign him a place with unfaithful people. "},{"num":47,"verse":"That servant who knew what his master wanted but didn’t prepare himself or do what was wanted will receive a severe beating. "},{"num":48,"verse":"But the servant who did things that deserved a beating without knowing it will receive a light beating. Much will be required from everyone to whom much has been given. But even more will be demanded from the one to whom much has been entrusted.”"},{"header":"Not Peace, but Division(E)"},{"num":49,"verse":"“I’ve come to set the earth on fire, and how I wish it were already ablaze! "},{"num":50,"verse":"I have a baptism to be baptized with, and what stress I am under until it’s completed! "},{"num":51,"verse":"Do you think that I came to bring peace on earth? Not at all, I tell you, but rather division! "},{"num":52,"verse":"From now on, five people in one household will be divided, three against two and two against three. "},{"num":53,"verse":"They will be divided father against son, son against father, mother against daughter, daughter against mother, mother-in-law against daughter-in-law, and daughter-in-law against mother-in-law.”"},{"header":"Interpreting the Time(F)"},{"num":54,"verse":"Then Jesus told the crowds, “When you see a cloud coming in from the west, you immediately say, ‘There’s going to be a storm,’ and that’s what happens. "},{"num":55,"verse":"When you see a south wind blowing, you say, ‘It’s going to be hot,’ and so it is. "},{"num":56,"verse":"You hypocrites! You know how to interpret the appearance of the earth and the sky, yet you don’t know how to interpret the present time?”"},{"header":"Settling with Your Opponent(G)"},{"num":57,"verse":"“Why don’t you judge for yourselves what is right? "},{"num":58,"verse":"For example, when you go with your opponent in front of a ruler, do your best to settle with him on the way there. Otherwise, you will be dragged in front of the judge, and the judge will hand you over to an officer, and the officer will throw you into prison. "},{"num":59,"verse":"I tell you, you will never get out of there until you pay back the last penny!”"}]