[{"header":"An Aside with the Disciples"},{"num":12,"verse":"Meanwhile, when thousands of people had gathered, so many that they were trampling one another, Yeshua began speaking first to His disciples, “Be on guard yourselves against the hametz of the Pharisees, which is hypocrisy. "},{"num":2,"verse":"There is nothing covered up that will not be revealed, and nothing hidden that will not be made known. "},{"num":3,"verse":"Therefore, whatever you have said in the dark will be heard in the light, and what you have spoken in private rooms will be proclaimed from the housetops."},{"num":4,"verse":"“I say to you, My friends, you should not be afraid of those who kill the body, since after this they have nothing more they can do. "},{"num":5,"verse":"But I will show you whom you should fear. Fear the One who, after the killing, has authority to cast into Gehenna. Yes, I tell you, fear this One!"},{"num":6,"verse":"“Aren’t five sparrows being sold for two pennies? Yet not one of them is forgotten before God. "},{"num":7,"verse":"Indeed, even the hairs of your head are all numbered. So do not fear; you are more valuable than many sparrows. "},{"num":8,"verse":"Now I tell you, whoever acknowledges Me before men, the Son of Man also will acknowledge him before the angels of God. "},{"num":9,"verse":"But the one who denies Me before men will be denied before the angels of God. "},{"num":10,"verse":"And everyone who speaks a word against the Son of Man will be forgiven, but the one who slanders the Ruach ha-Kodesh will not be forgiven. "},{"num":11,"verse":"And when they bring you to the synagogues, rulers, and authorities, do not worry about how you should defend yourself or what you should say, "},{"num":12,"verse":"because the Ruach ha-Kodesh will teach you at that time what is necessary to say.”"},{"header":"A Request from the Crowd"},{"num":13,"verse":"Then someone from the crowd said to him, “Teacher, tell my brother to divide the inheritance with me.”"},{"num":14,"verse":"But Yeshua said to him, “Man, who made Me a judge or arbitrator over you?” "},{"num":15,"verse":"Then He said to them, “Watch out! Be on guard against all kinds of greed, because one’s life does not consist in the abundance of the material goods he possesses.”"},{"num":16,"verse":" And Yeshua told them a parable, saying, “The land of a certain rich man produced good crops. "},{"num":17,"verse":"And he began thinking to himself, saying, ‘What shall I do? I don’t have a place to store my harvest!’ "},{"num":18,"verse":"And he said, ‘Here’s what I’ll do! I’ll tear down my barns and build larger ones, and there I’ll store all my grain and my goods. "},{"num":19,"verse":"And I’ll say to myself, ’O my soul, you have plenty of goods saved up for many years! So take it easy! Eat, drink, and be merry.”’ "},{"num":20,"verse":"But God said to him, ‘You fool! Tonight your soul is being demanded back from you! And what you have prepared, whose will that be?’"},{"num":21,"verse":" So it is with the one who stores up treasure for himself and is not rich in God.”"},{"header":"Instructions for the Disciples"},{"num":22,"verse":"Then Yeshua said to His disciples, “So I say to you, do not worry about life, what you will eat; nor about the body, what you will wear. "},{"num":23,"verse":"For life is more than food and the body more than clothing. "},{"num":24,"verse":"Consider the ravens. They do not sow or reap, they have no storeroom or barn, yet God feeds them. How much more valuable you are than birds!"},{"num":25,"verse":"“And which of you by worrying can add a single hour to his life?"},{"num":26,"verse":" So if you cannot do even something very little, why do you worry about other things? "},{"num":27,"verse":"Consider the lilies, how they grow. They neither toil nor spin. Yet I tell you that not even Solomon in all his glory was clothed like one of these."},{"num":28,"verse":" But if God so clothes the grass in the field—which is here today and thrown into the furnace tomorrow—then how much more will He clothe you, O you of little faith?"},{"num":29,"verse":"“So do not seek what you will eat and what you will drink, and do not keep worrying. "},{"num":30,"verse":"For all the nations of the world strive after these things. But your Father knows that you need these things. "},{"num":31,"verse":"Instead, seek His kingdom, and these things shall be added to you. "},{"num":32,"verse":"Do not be afraid, little flock, for your Father chose to give you the kingdom."},{"num":33,"verse":"“Sell your possessions and do tzedakah. Make money pouches for yourselves that do not get old—a treasure in the heavens that never runs out, where no thief approaches and no moth destroys. "},{"num":34,"verse":"For where your treasure is, there will your heart be also."},{"num":35,"verse":"“Have your belt strapped on and lamps burning. "},{"num":36,"verse":"Be like people waiting for their master to return from a wedding feast, so that when he comes and knocks, they may open to him immediately."},{"num":37,"verse":"“Happy are those slaves whose master finds them alert when he comes. Amen, I tell you, he will prepare himself and have them recline at table, and will come and serve them."},{"num":38,"verse":"“And if he comes in the second or even the third watch and finds them so, they will be happy. "},{"num":39,"verse":"But understand this, that if the master of the house had known at what hour the thief was coming, he would not have allowed his house to be broken into. "},{"num":40,"verse":"You also must be ready, for the Son of Man is coming at an hour you don’t expect.”"},{"num":41,"verse":"Then Peter said, “Master, are You telling this parable for us, or for everyone?”"},{"num":42,"verse":"And the Lord said, “Who then is the faithful and wise manager, whom the master will put in charge of his servants, to give them their food portion at the proper time? "},{"num":43,"verse":"Blessed is that servant whose master finds him so doing when he comes. "},{"num":44,"verse":"Truly I tell you, his master will put him in charge of all his possessions."},{"num":45,"verse":"“But if that servant says in his heart, ‘My master is taking a long time to come,’ and he begins to beat the young slave boys and girls and to eat and drink and get drunk, "},{"num":46,"verse":"the master of that servant will come on a day when he does not expect him and at an hour he does not know. And he will cut him in two and assign him a place with the unfaithful."},{"num":47,"verse":"“That slave who knew his master’s will but did not prepare or act according to his desire will be harshly whipped. "},{"num":48,"verse":"But the one who did not know and did things worthy of a beating will be whipped lightly. From everyone given much, much will be required; and from the one for whom more is provided, all the more they will ask of him."},{"num":49,"verse":"“I came to pour out fire on the earth, and how I wish it were already ablaze! "},{"num":50,"verse":"But I have an immersion to endure, and how distressed I am until it is finished!"},{"num":51,"verse":"“Do you suppose that I have come to bring shalom on earth? No, I tell you, but rather division. "},{"num":52,"verse":"From now on there will be five in one house in opposition, three against two and two against three. "},{"num":53,"verse":"They will be divided, father against son and son against father,"},{"header":"Lessons for the Crowds"},{"num":54,"verse":"Then He also was saying to the crowds, “When you see a cloud rising in the west, instantly you say, ‘A rainstorm is coming’—and so it is. "},{"num":55,"verse":"And when a south wind is blowing, you say, ‘It will be a scorcher’—and so it is. "},{"num":56,"verse":"Hypocrites! The surface of the earth and sky you know how to interpret yet you don’t know how to interpret this present time? "},{"num":57,"verse":"Why can’t you judge for yourselves what is right? "},{"num":58,"verse":"For while you are going with your accuser to the authorities, make an effort to come to a settlement with him—so he doesn’t drag you before the judge, and the judge hand you over to the officer of the court, and the officer of the court throw you into prison. "},{"num":59,"verse":"I tell you, you will never get out of there until you have paid back the last little bit.”"}]