[{"num":25,"verse":"If there is a controversy between men, they are to go to court for judgment, so that the judges may judge them. Then they shall justify the righteous and condemn the wicked. "},{"num":2,"verse":"It must be, if the wicked man is worthy to be beaten, then the judge must make him lie down and be beaten in his presence, with the number of strikes his guilt deserves. "},{"num":3,"verse":"He may give him forty stripes, but no more, lest, if he should exceed and beat him more with numerous stripes, then your brother may appear contemptible to you."},{"num":4,"verse":"You must not muzzle the ox when he treads out the grain."},{"header":"Levirate Marriage"},{"num":5,"verse":"If brothers dwell together, and one of them dies without having had a child, the wife of the deceased may not marry outside the family to a stranger. Her husband’s brother must go to her and take her to himself as a wife and perform the duty of a husband’s brother to her. "},{"num":6,"verse":"It shall be, that the firstborn whom she bears shall continue in the name of his brother who is deceased, so that his name will not be blotted out of Israel."},{"num":7,"verse":"If the man does not want to take his brother’s wife, then let his brother’s wife go up to the gate to the elders and say, “My husband’s brother refuses to raise up his brother’s name in Israel. He will not perform the duty of my husband’s brother.” "},{"num":8,"verse":"Then the elders of his city shall call him, and speak to him, and if he persists and says, “I do not want to take her,” "},{"num":9,"verse":"then his brother’s wife must come to him in the presence of the elders and remove his sandal from his foot, and spit in his face, and answer and say, “So shall it be done to that man who will not build up his brother’s house.” "},{"num":10,"verse":"His name will be called in Israel, “The house of him who has his sandal removed.”"},{"header":"Various Laws"},{"num":11,"verse":"When a man and his brother fight one another, and the wife of the one draws near in order to deliver her husband out of the hand of him who fights him, and reaches out her hand and seizes him by the private parts, "},{"num":12,"verse":"then you must cut off her hand. You must not pity her."},{"num":13,"verse":"You must not have in your bag different weights, a large and a small. "},{"num":14,"verse":"You must not have in your house differing measures, a large and a small. "},{"num":15,"verse":"But you must have a perfect and just weight—a perfect and just measure you must have, so that your days may be lengthened in the land which the Lord your God is giving you. "},{"num":16,"verse":"For all who do such things and all who act unjustly are an abomination to the Lord your God."},{"num":17,"verse":"Remember what Amalek did to you by the road when you were coming out of Egypt, "},{"num":18,"verse":"how he met you by the way and attacked at your rear all that were stragglers behind you, when you were exhausted and weary. He did not fear God. "},{"num":19,"verse":"Therefore it shall be, when the Lord your God has given you rest from all your surrounding enemies, in the land which the Lord your God is giving you for an inheritance to possess, that you must blot out the remembrance of Amalek from under heaven. You must not forget it."}]