[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Besought him . . . to put away the mischief.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Esther’s work was as yet only half done. She has seen the condemnation of the foe of her race, and the exaltation of her kinsman to his office. But the royal edict sent out against the Jews still remains valid, and being a written decree, sealed with the king’s seal, is supposed to be beyond the possibility of alteration. It was not, therefore, a case where Mordecai’s newly-acquired dignity would authorise him to interfere, and therefore Esther, who, now that the ice is once broken, becomes more courageous, makes a fresh appeal to the king to do what theoretically was beyond the king’s power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Esther",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE NET BROKENEsther 8:3 - Esther 8:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE NET BROKEN",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 8:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The spirit of this passage may perhaps be best caught by taking the three persons appearing in it, and the One who does not appear, but acts unseen through them all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The heroine of the whole book and of this chapter is Esther, one of the sweetest and noblest of the women of Scripture. The orphan girl who had grown up into beauty under the care of her uncle Mordecai, and was lifted suddenly from sheltered obscurity into the ‘fierce light that beats upon a throne,’ like some flower culled in a shady nook and set in a king’s bosom, was true to her childhood’s protector and to her people, and kept her sweet, brave gentleness unspoiled by the rapid elevation which ruins so many characters. Her Jewish name of Hadassah {‘myrtle’} well befits her, for she is clothed with unostentatious beauty, pure and fragrant as the blossoms that brides twine in their hair. But, withal, she has a true woman’s courage which is always ready to endure any evil and dare any danger at the bidding of her heart. She took her life in her hand when she sought an audience of Ahasuerus uninvited, and she knew that she did. Nothing in literature is nobler than her quiet words, which measure her danger without shrinking, and front it without heroics: ‘If I perish, I perish!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The danger was not past, though she was queen and beloved; for a despot’s love is a shifting sand-bank, which may yield anchorage to-day, and to-morrow may be washed away. So she counted not her life dear unto herself when, for the second time, as in our passage, she ventured, uninvited, into the king’s presence. The womanly courage that risks life for love’s sake is nobler than the soldier’s that feels the lust of battle maddening him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Esther’s words to the king are full of tact. She begins with what seems to have been the form of address prescribed by custom, for it is used by her in her former requests {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. But she adds a variation of the formula, tinged with more personal reference to the king’s feeling towards her, as well as breathing entire submission to his estimate of what was fitting. ‘If the thing seem right before the king,’ appeals to the sense of justice that lay dormant beneath the monarch’s arbitrary will; ‘and I be pleasing in his eyes,’ drew him by the charm of her beauty. She avoided making the king responsible for the plot, and laid it at the door of the dead and discredited Haman. It was his device, and since he had fallen, his policy could be reversed without hurting the king’s dignity. And then with fine tact, as well as with a burst of genuine feeling, she flings all her personal influence into the scale, and seeks to move the king, not by appeals to his justice or royal duty, but to his love for her, which surely could not bear to see her suffer. One may say that it was a low motive to appeal to, to ask the despot to save a people in order to keep one woman from sorrow; and so it was. It was Ahasuerus’s fault that such a reason had more weight with him than nobler ones. It was not Esther’s that she used her power over him to carry her point. She used the weapons that she had, and that she knew would be efficacious. The purpose for which she used them is her justification.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Esther may well teach her sisters to-day to be brave and gentle, to use their influence over men for high purposes of public good, to be the inspirers of their husbands, lovers, brothers, for all noble thinking and doing; to make the cause of the oppressed their own, to be the apostles of mercy and the hinderers of wrong, to keep true to their early associations if prosperity comes to them, and to cherish sympathy with their nation so deep that they cannot ‘endure to see the evil that shall come unto them’ without using all their womanly influence to avert it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Ahasuerus plays a sorry part beside Esther.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He knows no law but his own will, and that is moved, not by conscience or reason, but by ignoble passions and sensual desires. He tosses his subjects’ lives as trivial gifts to any who ask for them. Haman’s wife knew that he had only to ‘speak to the king,’ and Mordecai would be hanged; Haman had no difficulty in securing the royal mandate for the murder of all the Jews. Sated with the indulgence of low desires, he let all power slip from his idle hands, and his manhood was rotted away by wallowing in the pigsty of voluptuousness. But he was tenacious of the semblance of authority, and demanded the appearance of abject submission from the ‘servants’ who were his masters. He yielded to Esther’s prayer as lightly as to Haman’s plot. Whether the Jews were wiped out or not mattered nothing to him, so long as he had no trouble in the affair.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " To shift all responsibility off his own shoulders on to somebody else’s was his one aim. He was as untrue to his duty when he gave his signet to Mordecai, and bade him and Esther do as they liked, as when he had given it to Haman. And with all this slothful indifference to his duty, he was sensitive to etiquette, and its cobwebs held him whom the cords of his royal obligations could not hold. It mattered not to him that the edict which he allowed Mordecai to promulgate practically lit the flames of civil war. He had washed his hands of the whole business.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is a hideous picture of an Eastern despot, and has been said to be unhistorical and unbelievable. But the world has seen many examples of rulers whom the possession of unlimited and irresponsible power has corrupted in like fashion. And others than rulers may take the warning that to live to self is the mother of all sins and crimes; that no man can safely make his own will and his own passions his guides; that there is no slavery so abject as that of the man who is tyrannised by his lower nature; that there is a temptation besetting us all to take the advantages and neglect the duties of our position, and that to yield to it is sure to end in moral ruin. We are all kings, even if our kingdom be only our own selves, and we shall rule wisely only if we rule as God’s viceroys, and think more of duty than of delight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Mordecai is a kind of duplicate of Joseph, and embodies valuable lessons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Contented acceptance of obscurity and neglect of his services, faithfulness to his people and his God in the foul atmosphere of such a court, wise reticence, patient discharge of small duties, undoubting hope when things looked blackest fed by stedfast faith in God, unchangedness of character and purpose when lifted to supreme dignity, the use of influence and place, not for himself, but for his people,-all these are traits which may be imitated in any life. We should be the same men, whether we sit unnoticed among the lackeys at the gate, or are bearing the brunt of the hatred of powerful foes, or are clothed ‘in royal apparel of blue and white, and with a great crown of gold.’ These gauds were nothing to Mordecai, and earthly honours should never turn our heads. He valued power because it enabled him to save his brethren, and we should cultivate the same spirit. The political world, with its fierce struggles for personal ends, its often disregard of the public good, and its use of place and power for ‘making a pile’ or helping relations up, would be much the better for some infusion of the spirit of Mordecai.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. But we must not look only at the visible persons and forces.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This book of Esther does not say much about God, but His presence broods over it all, and is the real spring that moves the movers that are seen. It is all a lesson of how God works out His purposes through men that seem to themselves to be working out theirs. The king’s criminal abandonment to lust and luxury, Haman’s meanly personal pique, Esther’s beauty, the fall of the favourite, the long past services of Mordecai, even the king’s sleepless night, are all threads in the web, and God is the weaver. The story raises the whole question of the standing miracle of the co-existence and co-operation of the divine and the human. Man is free and responsible, God is sovereign and all-pervading. He ‘makes the wrath of man to praise Him, and with the remainder thereof He girdeth Himself.’ To-day, as then, He is working out His deep designs through men whom He has raised up, though they have not known Him. Amid the clash of contending interests and worldly passions His solemn purpose steadily advances to its end, like the irresistible ocean current, which persists through all storms that agitate the surface, and draws them into the drift of its silent trend. Ahasuerus, Haman, Esther, Mordecai, are His instruments, and yet each of them is the doer of his or her deed, and has to answer to Him for it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 8:3. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Esther spake yet again before the king ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Haman, the chief enemy of the Jews, was hanged, Esther and Mordecai, their chief friends, were sufficiently protected; but many others there were in the king’s dominions that hated the Jews, and desired their ruin, and to their rage and malice all the rest of that people lay exposed. For the edict against them was still in force, in pursuance of which their enemies, at the day appointed, would fall upon them, and they would be deemed rebels against the king and his government, if they should offer to resist, and take up arms in their own defence. To prevent this, the queen makes intercession with much affection and importunity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And fell down at his feet, and besought him with many tears — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was time to be earnest, when the church of God lay at stake. Let none be so great as to be unwilling to stoop, none so joyful as to be unwilling to weep, when thereby they may do any service to God’s church and people. Esther, though safe herself, here falls down and begs with tears for the deliverance of her people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To put away the mischief of Haman — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To repeal that cruel and bloody decree which he had obtained from the king.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:3-14 It was time to be earnest, when the church of God was at stake. Esther, though safe herself, fell down and begged for the deliverance of her people. We read of no tears when she begged for her own life, but although she was sure of that, she wept for her people. Tears of pity and tenderness are the most Christ-like. According to the constitution of the Persian government, no law or decree could be repealed or recalled. This is so far from speaking to the wisdom and honour of the Medes and Persians, that it clearly shows their pride and folly. This savours of that old presumption which ruined all, We will be as gods! It is God's prerogative not to repent, or to say what can never be altered or unsaid. Yet a way was found, by another decree, to authorize the Jews to stand upon their defence. The decree was published in the languages of all the provinces. Shall all the subjects of an earthly prince have his decrees in languages they understand, and shall God's oracles and laws be locked up from any of his servants in an unknown tongue?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Though Haman was dead, his work was not yet undone. The royal decree had gone forth, and, according to Persian notions, could not be directly recalled or reversed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mordecai did not dare, without express permission from the king, to take any steps even to stay execution. And Esther, being in favor, once more took the initiative. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Esther spake yet again before the king, and fell down at his feet—The king was then not reclining at table, but sitting on a divan, most probably in the Persian attitude, leaning back against the cushions, and one foot under him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "besought him with tears to put away the mischief of Haman—that is, to repeal the sanguinary edict which, at the secret instigation of Haman, had been recently passed (Es 3:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To put away the mischief of Haman; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to repeal that cruel decree, of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 3:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 3:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Esther spake yet again before the king,.... Went into his presence, without being called for as before, with a new petition: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and fell down at his feet, and besought him with tears; the more to work upon his affections, and move him to grant her request; which she might be the more encouraged to hope for, through the success she already had: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to put away the mischief of Haman the Agagite, and his device that he had devised against the Jews; to revoke, abolish, and make void a mischievous scheme Haman had devised against the Jews, to root out the whole nation of them in the Persian empire. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to put away the mischief of Haman the Agagite, and his device that he had devised against the Jews; to revoke, abolish, and make void a mischievous scheme Haman had devised against the Jews, to root out the whole nation of them in the Persian empire. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Esther spake yet again before the king, and fell down at his feet, and besought him with tears to put away the {c} mischief of Haman the Agagite, and his device that he had devised against the Jews.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Esther spake yet again before the king, and fell down at his feet, and besought him with tears to put away the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mischief of Haman the Agagite, and his device that he had devised against the Jews.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Meaning, that he should abolish the wicked decrees, which he had made for the destruction of the Jews.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:3-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Arrangements for the deliverance of the Jews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spake yet again before the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] thus apparently taking the risk of again entering his presence unsummoned, but, under the new circumstances, free from such forebodings of evil as those which had attended her previous essay.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to put away the mischief etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This first form of request (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Esther 8:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 8:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") was vague. Her anxiety is still for her people, Haman’s fall not of itself securing their deliverance from danger. Mordecai, even in his access to fortune and royal favour, seems to think it safest that Esther, and not he, should make the needful appeal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Esther spake yet again before the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It might have seemed to be the business of Mordecai, as the king's chief minister, to advise him in a matter of public policy, and one in which the interests of so many of his subjects were vitally concerned. But the new minister did not perhaps feel sure of his influence, or quite know what to recommend. Esther was therefore again put forward to address the king. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Fell down at his feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ". And besought him...  to put away the mischief of Haman.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " begged him, first of all, in a vague way, to \"cause to pass\" - put away, or undo - the mischief of Haman - not suggesting how it was to be done. Esther 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The chief enemy of the Jews was now destroyed; but the edict, written in the king's name, sealed with the royal seal, and published in all the provinces of the kingdom, for the destruction of all the Jews on the 13th day of the twelfth month, was still in force, and having been issued in due legal form, could not, according to the laws of the Persians and Medes, be revoked. Queen Esther therefore entreated the king to annul the designs of Haman against the Jews. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Esther spake again before the king, and fell down at his feet, and wept, and besought him to do away with (העביר, to cause to depart) the mischief of Haman the Agagite, and his device that he devised against the Jews. And the king held out his golden sceptre towards Esther, and Esther arose and stood before the king.\" This verse gives a summary of the contents of Esther's speech, which is reported verbally in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so that we must translate the imperfects ותּתחנּן ותּבך - ותּפּל: She spoke before the king, falling at his feet and beseeching him with weeping, that he would do away with המן רעת, the evil that Haman had done, and his device against the Jews. The king stretched out his sceptre (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as a sign that he would graciously grant her petition; whereupon she arose, stood before the king, and made known her request. ",
        "children": []
      }
    ]
  }
]