[{"header":"God Gives Most"},{"num":9,"verse":"Now it is unnecessary for me to write to you about the offering [that is to be made] for the saints [in Jerusalem]; "},{"num":2,"verse":"for I know your eagerness [to promote this cause], and I have [proudly] boasted to the people of Macedonia about it, telling them that Achaia has been prepared since last year [for this contribution], and your enthusiasm has inspired the majority of them [to respond]. "},{"num":3,"verse":"Still, I am sending the brothers [on to you], so that our pride in you may not be an empty boast in this case, and so that you may be prepared, just as I told them you would be; "},{"num":4,"verse":"otherwise, if any Macedonians come with me and find you unprepared, we—to say nothing of yourselves—will be humiliated for being so confident. "},{"num":5,"verse":"That is why I thought it necessary to urge these brothers to go to you [before I come] and make arrangements in advance for this generous, previously promised gift of yours, so that it would be ready, not as something extorted [or wrung out of you], but as a [voluntary and] generous gift."},{"num":6,"verse":"Now [remember] this: he who sows sparingly will also reap sparingly, and he who sows generously [that blessings may come to others] will also reap generously [and be blessed]. "},{"num":7,"verse":"Let each one give [thoughtfully and with purpose] just as he has decided in his heart, not grudgingly or under compulsion, for God loves a cheerful giver [and delights in the one whose heart is in his gift]. "},{"num":8,"verse":"And God is able to make all grace [every favor and earthly blessing] come in abundance to you, so that you may always [under all circumstances, regardless of the need] have complete sufficiency in everything [being completely self-sufficient in Him], and have an abundance for every good work and act of charity. "},{"num":9,"verse":"As it is written and forever remains written,"},{"num":10,"verse":"Now He who provides seed for the sower and bread for food will provide and multiply your seed for sowing [that is, your resources] and increase the harvest of your righteousness [which shows itself in active goodness, kindness, and love]. "},{"num":11,"verse":"You will be enriched in every way so that you may be generous, and this [generosity, administered] through us is producing thanksgiving to God [from those who benefit]. "},{"num":12,"verse":"For the ministry of this service (offering) is not only supplying the needs of the saints (God’s people), but is also overflowing through many expressions of thanksgiving to God. "},{"num":13,"verse":"Because of this act of ministry, they will glorify God for your obedience to the gospel of Christ which you confess, as well as for your generous participation [in this gift] for them and for all [the other believers in need], "},{"num":14,"verse":"and they also long for you while they pray on your behalf, because of the surpassing measure of God’s grace [His undeserved favor, mercy, and blessing which is revealed] in you. "},{"num":15,"verse":"Now thanks be to God for His indescribable gift [which is precious beyond words]!"}]