[{"header":"Please Have the Gift Ready!"},{"num":9,"verse":"When it comes to the service you are doing for God’s people, you see, I don’t need to write to you. "},{"num":2,"verse":"For I know your eagerness, and indeed I boasted about it to the Macedonians, saying that Achaea had been ready since last year. Your enthusiasm has stimulated most of them into action. "},{"num":3,"verse":"I have sent the brothers so that our boasting about you in this respect may turn out to be true – so that you may be ready, just as I said you were. "},{"num":4,"verse":"Otherwise, imagine what it would be like if people from Macedonia came with me and found you weren’t ready! That would bring shame on us in this business, not to say on you. "},{"num":5,"verse":"So I thought it necessary to exhort the brothers that they should go on to you in advance, and get everything about your gracious gift in order ahead of time. You’ve already promised it, after all. Then it really will appear as a gift of grace, not something that has had to be extorted from you."},{"header":"God Loves a Cheerful Giver"},{"num":6,"verse":"This is what I mean: someone who sows sparingly will reap sparingly as well. Someone who sows generously will reap generously. "},{"num":7,"verse":"Everyone should do as they have determined in their heart, not in a gloomy spirit or simply because they have to, since ‘God loves a cheerful giver’. "},{"num":8,"verse":"And God is well able to lavish all his grace upon you, so that in every matter and in every way you will have enough of everything, and may be lavish in all your own good works, "},{"num":9,"verse":"just as the Bible says:"},{"num":10,"verse":"The one who supplies ‘seed to be sown and bread to eat’ will supply and increase your seed, and multiply the yield of your righteousness. "},{"num":11,"verse":"You will be enriched in every way in all single-hearted goodness, which is working through us to produce thanksgiving to God. "},{"num":12,"verse":"The service of this ministry will not only supply what God’s people so badly need, but it will also overflow with many thanksgivings to God. "},{"num":13,"verse":"Through meeting the test of this service you will glorify God in two ways: first, because your confession of faith in the Messiah’s gospel has brought you into proper order, and second, because you have entered into genuine and sincere partnership with them and with everyone. "},{"num":14,"verse":"What’s more, they will then pray for you and long for you because of the surpassing grace God has given to you. "},{"num":15,"verse":"Thanks be to God for his gift, the gift we can never fully describe!"}]