[{"num":9,"verse":"Now, as far as the ministry to the Saints, it is superfluous for me to write to you."},{"num":2,"verse":"For I know your readiness of mind, of which I boast to the Macedonians myself, saying that Achaia was prepared a year ago, and your zeal has incited many."},{"num":3,"verse":"Now, I have sent the brothers, lest our boasting over you should be in vain in this matter, that you (as I have said) be ready."},{"num":4,"verse":"Or else perhaps the Macedonians might come with me and find you unprepared, so that we (and not you) should be ashamed by my constant boasting."},{"num":5,"verse":"Therefore, I thought it necessary to exhort the brothers to come to you beforehand, and to finish your previously-promised blessing, that it might be ready, and be received as a blessing, not with greed."},{"num":6,"verse":"But remember this:  whoever sows sparingly, shall also reap sparingly. And whoever sows liberally, shall also reap liberally."},{"num":7,"verse":"As everyone purposes in his heart, so let him give, not grudgingly or of necessity. For God loves a cheerful giver."},{"num":8,"verse":"And God is able to make all grace to abound toward you. So that you always - having all sufficiency in all things - may abound in every good work,"},{"num":9,"verse":"As it is written, “He has scattered abroad and has given to the poor. His benevolence remains forever.”"},{"num":10,"verse":"Also, He Who supplies seed to the sower will likewise provide bread for food and multiply your seed, and increase the fruits of your righteousness,"},{"num":11,"verse":"that you may be enriched in every way unto all simplicity, which causes thanksgiving to God through us."},{"num":12,"verse":"For the ministry of this service not only supplies the necessities of the Saints, but also abundantly causes many to give thanks to God,"},{"num":13,"verse":"who, by the trials of this ministry, praise God for your voluntary submission to the Gospel of Christ, and for your liberal sharing with them, and to all."},{"num":14,"verse":"And in their prayer for you, they long after you greatly, for the abundant grace of God in you."},{"num":15,"verse":"Therefore, thanks be to God for His unspeakable gift."}]