[{"header":"Sanballat and Tobiah"},{"num":4,"verse":"When Sanballat heard that we were building the wall of Jerusalem, he was very angry and upset. He started making fun of the Jews."},{"num":2,"verse":"Sanballat talked with his friends and the army at Samaria and said, “What are these weak Jews doing? Do they think we will leave them alone? Do they think they will offer sacrifices? Maybe they think they can finish building in only one day. They cannot bring stones back to life from these piles of trash and dirt. These are just piles of ashes and dirt!”"},{"num":3,"verse":"Tobiah the Ammonite was with Sanballat. Tobiah said, “What do these Jews think they are building? If even a small fox climbed up on it, he would break down their wall of stones!”"},{"num":4,"verse":"Nehemiah prayed and said, “Our God, listen to our prayer. These men hate us. Sanballat and Tobiah are insulting us. Make bad things happen to them. Make them ashamed, like people taken away as prisoners."},{"num":5,"verse":"Don’t take away their guilt or forgive the sins they have done in your sight. They have insulted and discouraged the builders.”"},{"num":6,"verse":"We built the wall of Jerusalem all the way around the city. But it was only half as tall as it should be. We did this much because the people worked with all their heart."},{"num":7,"verse":"But Sanballat, Tobiah, the Arabs, the Ammonites, and the men from Ashdod were very angry. They heard that the people continued working on the walls of Jerusalem. They heard the people were repairing the holes in the wall."},{"num":8,"verse":"So all these men got together and made plans against Jerusalem. They planned to stir up trouble against Jerusalem. They planned to come and fight against the city."},{"num":9,"verse":"But we prayed to our God. And we put guards on the walls to watch day and night so that we could be ready to meet them."},{"num":10,"verse":"And so at that time the people of Judah said, “The workers are becoming tired. There is too much dirt and trash in the way. We cannot continue to build the wall."},{"num":11,"verse":"And our enemies are saying, ‘Before the Jews know it or see us, we will be right there among them. We will kill them and that will stop the work.’”"},{"num":12,"verse":"Then the Jews living among our enemies came and said this to us ten times, “Our enemies are all around us. They are everywhere we turn.”"},{"num":13,"verse":"So I put some of the people behind the lowest places along the wall, and I put them by the holes in the wall. I put families together, with their swords, spears, and bows."},{"num":14,"verse":"After looking over everything, I stood up and spoke to the important families, the officials, and the rest of the people. I said, “Don’t be afraid of our enemies. Remember the Lord, who is great and powerful! You must fight for your brothers, your sons, and your daughters! You must fight for your wives and your homes!”"},{"num":15,"verse":"Then our enemies heard that we knew about their plans. They knew that God ruined their plans. So we all went back to work on the wall. Everyone went back to their own place and did their part."},{"num":16,"verse":"From that day on, half of my men worked on the wall. The other half of my men were on guard, ready with spears, shields, bows, and armor. The army officers stood behind all the people of Judah who were building the wall."},{"num":17,"verse":"The builders and their helpers had their tools in one hand and a weapon in the other hand."},{"num":18,"verse":"Each of the builders wore his sword at his side as he worked. The man who blew the trumpet to warn the people stayed next to me."},{"num":19,"verse":"Then I spoke to the leading families, the officials, and the rest of the people. I said, “This is a very big job and we are spread out along the wall. We are far from one another."},{"num":20,"verse":"So if you hear the trumpet, run to that place. We will all meet together there, and our God will fight for us!”"},{"num":21,"verse":"So we continued to work on the wall of Jerusalem, and half the men held spears. We worked from the first light of the morning until the stars came out at night."},{"num":22,"verse":"At that time I also said this to the people, “Every builder and his helper must stay inside Jerusalem at night. Then they can be guards at night and workers during the day.”"},{"num":23,"verse":"So none of us took off our clothes—not me, not my brothers, not my men, and not the guards. Each of us had our weapon ready at all times, even when we went to get water."}]