[{"header":"Those Against the Rebuilding"},{"num":4,"verse":"Sanballat heard we were rebuilding the wall. He was very angry, even furious. He made fun of the Jews. "},{"num":2,"verse":"He said to his friends and the army of Samaria, “What are these weak Jews doing? They think they can rebuild the wall. They think they will offer sacrifices. Maybe they think they can finish rebuilding it in only one day. They can’t bring stones back to life. These are piles of trash and ashes.”"},{"num":3,"verse":"Tobiah the Ammonite was next to Sanballat. Tobiah said, “A fox could climb up on what they are building. Even it could break down their stone wall.”"},{"num":4,"verse":"I prayed, “Hear us, our God. We are hated. Turn the insults of Sanballat and Tobiah back on their own heads. Let them be captured and taken away like valuables that are stolen. "},{"num":5,"verse":"Do not hide their guilt. Do not take away their sins so you can’t see them. The builders have seen them make you angry.”"},{"num":6,"verse":"So we rebuilt the wall until all of it went halfway up. The people were willing to work hard."},{"num":7,"verse":"But Sanballat, Tobiah, the Arabs, the Ammonites and the men from Ashdod were very angry. They heard that the repairs to Jerusalem’s walls were continuing. And they heard that the holes in the wall were being closed. "},{"num":8,"verse":"So they all made plans against Jerusalem. They planned to come and fight and stir up trouble. "},{"num":9,"verse":"But we prayed to our God. And we appointed guards to watch for them day and night."},{"num":10,"verse":"The people of Judah said, “The workers are getting tired. There is too much dirt and trash. We cannot rebuild the wall.”"},{"num":11,"verse":"And our enemies said, “The Jews won’t know it or see us. But we will come among them and kill them. We will stop the work.”"},{"num":12,"verse":"Then the Jews who lived near our enemies came. They told us ten times, “Everywhere you turn, the enemy will attack us.” "},{"num":13,"verse":"So I put some of the people behind the lowest places along the wall. And I put some at the open places. I put families together with their swords, spears and bows. "},{"num":14,"verse":"Then I looked around. I stood up and spoke to the important men, the leaders and the rest of the people. I said, “Don’t be afraid of them. Remember the Lord. He is great and others are afraid of him. And fight for your brothers, your sons and daughters, your wives and your homes.”"},{"num":15,"verse":"Then our enemies heard that we knew about their plans. God had ruined their plans. So we all went back to the wall. Each person went back to his own work."},{"num":16,"verse":"From that day on, half my men worked on the wall. The other half was ready with spears, shields, bows and armor. The officers stood in back of the people of Judah "},{"num":17,"verse":"who were building the wall. Those who carried materials did their work with one hand. They carried a weapon in the other hand. "},{"num":18,"verse":"Each builder wore his sword at his side as he worked. The man who blew the trumpet to warn the people stayed next to me."},{"num":19,"verse":"Then I spoke to the important men, the leaders and the rest of the people. I said, “This is a very big job. We are spreading out along the wall. We are far apart. "},{"num":20,"verse":"So wherever you hear the sound of the trumpet, assemble there. Our God will fight for us.”"},{"num":21,"verse":"So we continued to work. Half the men held spears. We worked from sunrise till the stars came out. "},{"num":22,"verse":"At that time I also said to the people, “Let every man and his helper stay inside Jerusalem at night. They can be our guards at night. And they can be workmen during the day.” "},{"num":23,"verse":"Neither I, my brothers, my men nor the guards with me ever took off our clothes. Each person carried his weapon even when he went for water."}]