[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Blessed is he that shall eat bread . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The form of the exclamation was obviously determined by the words which our Lord had just spoken. It may have been a more or less familiar formula among devout Jews who expected the coming of the Christ. It may have embodied some recollections of the great discourse at Capernaum (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:26-59",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On the whole it seems more natural to see in it a burst of honest, unwonted enthusiasm, kindled by sympathy with what our Lord had said, than to regard it as spoken hypocritically, with a view to drawing from His lips some heretical utterance that might ensure His condemnation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 14:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When one of them that sat at meat heard these things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "being touched therewith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he said, Blessed is he that shall eat bread in the kingdom of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Blessed is the man who shall live in the time of the Messiah, and share the entertainments he will prepare for his people, when these virtues of humility, condescension, and charity shall flourish in all their glory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To eat bread, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is a well-known Hebrew phrase for sharing in a repast, whether it be at a common meal or at a sumptuous feast. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bread ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is not understood as suggesting either the scantiness or the meanness of the fare. “The kingdom of God, here, does not signify the kingdom of heaven in the highest sense, but only the kingdom of the Messiah, of which the carnal Jew here speaks, according to the received sense of his nation, as of a glorious temporal kingdom, in which the Jews should lord it over the Gentile world, enjoy their wealth and be provided with all temporal blessings and delights, in which they placed their happiness.” — Whitby. Thus also Dr. Campbell, who assigns the following reasons for understanding the expression in the same light: “1st, This way of speaking of the happiness of the Messiah’s administration suits entirely the hopes and wishes which seem to have been long entertained by the nation concerning it. 2d, The parable which, in answer to the remark, was spoken by our Lord, is on all hands understood to represent the Christian dispensation. 3d, The obvious intention of that parable is, to suggest the prejudices which, from notions of secular felicity and grandeur, the nation in general entertained on that subject; in consequence of which prejudices, what in prospect they fancied so blessed a period, would, when present, be exceedingly neglected and despised; and, in this view, nothing could be more apposite, whereas there appears no appositeness in the parable on the other interpretation;” that is, on understanding ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the kingdom of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the preceding remark, as signifying the kingdom of future glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:15-24 In this parable observe the free grace and mercy of God shining in the gospel of Christ, which will be food and a feast for the soul of a man that knows its own wants and miseries. All found some pretence to put off their attendance. This reproves the Jewish nation for their neglect of the offers of Christ's grace. It shows also the backwardness there is to close with the gospel call. The want of gratitude in those who slight gospel offers, and the contempt put upon the God of heaven thereby, justly provoke him. The apostles were to turn to the Gentiles, when the Jews refused the offer; and with them the church was filled. The provision made for precious souls in the gospel of Christ, has not been made in vain; for if some reject, others will thankfully accept the offer. The very poor and low in the world, shall be as welcome to Christ as the rich and great; and many times the gospel has the greatest success among those that labour under worldly disadvantages and bodily infirmities. Christ's house shall at last be filled; it will be so when the number of the elect is completed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed is he that shall eat bread in the kingdom of God - The kingdom of God here means the kingdom which the Messiah was to set up. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Jews supposed that he would be a temporal prince, and that his reign would be one of great magnificence and splendor. They supposed that the \"Jews\" then would be delivered from all their oppressions, and that, from being a degraded people, they would become the most distinguished and happy nation of the earth. To that period they looked forward as one of great happiness. There is some reason to think that they supposed that the ancient just people would then be raised up to enjoy the blessings of the reign of the Messiah. Our Saviour having mentioned the \"resurrection of the just,\" this man understood it in the common way of the Jews, and spoke of the special happiness which they expected at that time. The Jews \"only,\" he expected, would partake of those blessings. Those notions the Saviour corrects in the parable which follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15-24. when one … heard … he said, Blessed, &c.—As our Lord's words seemed to hold forth the future \"recompense\" under the idea of a great Feast, the thought passes through this man's mind, how blessed they would be who should be honored to sit down to it. Our Lord's reply is in substance this: \"The great Feast is prepared already; the invitations are issued, but declined; the feast, notwithstanding, shall not want abundance of guests; but not one of its present contemners—who shall yet come to sue for admission—shall be allowed to taste of it.\" This shows what was lacking in the seemingly pious exclamation of this man. It was Balaam's, \"Let me die the death of the righteous, and let my last end be like his\" (Nu 23:10), without any anxiety about living his life; fondly wishing that all were right with him at last, while all heedless of the precious present.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whether this person had any gross conceptions of the kingdom of God, as a state of external happiness, and sensible satisfactions, I cannot say (though it be the opinion of some valuable interpreters): he might mean no more than, Blessed is he that shall come to heaven, and enjoy the celestial pleasures and satisfactions there; for that blessed state is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the marriage supper of the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lamb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Christ spake to his disciples in this dialect, when he spake of drinking wine with them in his kingdom. But this passage both lets us know the good influence of spiritual discourse, to set the tongues of others on work, and also it lets us see what good meditations may be founded almost upon any subjects, if we have any heart thereunto. This gives our Saviour an occasion to put forth the following parable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when one of them that sat at meat with him,.... One of the Scribes, lawyers, or Pharisees, that were guests at this feast: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "heard these things: which were spoken by Christ, and was pleased and affected with them, though he was ignorant: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he said unto him, blessed is he that shall eat bread in the kingdom of God; in the world to come, in the kingdom of the Messiah; concerning feasting in which, the Jews had entertained very gross notions; and which this man was reminded of by Christ's making mention of the resurrection of the just, and of recompense at that time, which the Jews expected at the Messiah's coming. They suppose, that God will make a splendid feast, a sumptuous entertainment; in which, besides \"bread\", which they call,  , \"the bread of the kingdom\", and \"the bread of the world to come\" (m), there will be great variety of flesh, fish, and fowl, plenty of generous wine, and all sorts of delicious fruit: particularly they speak of a large ox, which they suppose to be the Behemoth in Job, that will then be prepared; and of Leviathan and his mate, which will then be dressed; and of a large fowl, called Ziz, of a monstrous size; and of old wine kept in the grape from the creation of the world, which will then be drank; and of the rich fruits of the garden of Eden, that will then be served up (n): such gross and carnal notions have they entertained of the world to come; and which this man seemed to have imbibed, and placed happiness in. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Midrash Ruth, fol. 33. 2. Bereshit Rabba, sect. 82. fol. 72. 4. (n) See my Notes on the Targum in Cant. viii. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Midrash Ruth, fol. 33. 2. Bereshit Rabba, sect. 82. fol. 72. 4. (n) See my Notes on the Targum in Cant. viii. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when one of them that sat at meat with him heard these things, he said unto him, Blessed is he that shall eat bread in the kingdom of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To the idea of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστασις τῶν δικαίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is very naturally linked in the case of this fellow-guest the thought of the future eating (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φάγεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "future",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with the patriarchs of the nation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; Bertholdt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". § 39) in the (millennial) Messianic kingdom about to be set up. This transporting prospect, in which his mistaken security is manifested, compels his exclamation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:15-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The great feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:1-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), very naturally introduced by the pious reflection of a guest whose religious sentiment had been touched by the allusion to the resurrection-felicity of the just. Like many other pious observations of the conventional type it did not amount to much, and was no guarantee of genuine godliness in the speaker. The parable expresses this truth in concrete form, setting forth that many care less for the Kingdom of God and its blessings than they seem to care, and teaching that these will be offered to those who do care indeed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15-21. The Refused Banquet; a Lesson to a Guest.15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "15-21. The Refused Banquet; a Lesson to a Guest.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when one of them that sat at meat with him heard these things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He may have wanted to diminish the force of the rebukes implied in the previous lessons by a vapid general remark. At any rate, he seems to have assumed that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would be one of those who would sit at the heavenly feast which should inaugurate the new aeon, and from which, like all Jews, he held it to be almost inconceivable that any circumcised son of Abraham should be excluded. Hence the warning involved in this parable which was meant to prove how small was the real anxiety to accept the divine invitation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall eat bread in the kingdom of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Almost the same words occur in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Jews connected the advent of the Messianic",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Kingdom with banquets of food more delicious than manna, the flesh of Leviathan, and the bird Bar Juchne.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀκούσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "having heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and having been touched thereby. [However one feels inclined to suspect, that something of a worldly character crept into His thoughts concerning the kingdom of GOD.—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μακάριος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Alluding to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μακάριος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Often this epithet includes in its signification the idea of something that is rare and uncommon. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not enough to pronounce godly men ‘blessed;’ but each must exert himself for his part to the best of his ability. Comp. the following verses: also ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:23-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φάγεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall eat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄρτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Many read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄριστον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄρτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is better established, especially as there is joined to it the verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φάγεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is more appropriate to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄρτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", than ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄριστον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φαγεῖν ἄρτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "].[146] However at that time it seems to have been the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἌΡΙΣΤΟΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἌΡΙΣΤΟΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prandium, breakfast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "luncheon, the early meal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On that account it is worthy of the greater attention that in the parable set before them in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεῖπνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cæna,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "supper",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our late dinner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which is specified.[147]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[146] All the oldest authorities have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄρτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". None but inferior uncial MSS. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄριστον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[147] No doubt alluding to the coming marriage ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "supper, at the end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the day of the present ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "last",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " dispensation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at the end, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 15-24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "In",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "reply to an observation of one of the guests, Jesus relates the parable of the great supper, in which he shows how few really cared for the joys of God's kingdom in the world to come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "- And when one of them that sat at meat with him heard these things, he said unto him, Blessed is he that shall eat bread in the kingdom of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " One of those who were partaking of the banquet, and had witnessed the whole scene, now speaks to the Stranger Guest. He had looked on the miracle performed for the afflicted man: he had heard the wise words spoken by the Galilaean Rabbi; he had listened to the gentle and yet pungent rebuke to the Pharisee for his ostentatious hospitality to the rich and great; he had marked the quiet reminder as to the many sufferers who really stood in need of the viands so plentifully spread for those who wanted them not; he had been specially struck by the mention of the recompense which the just who remembered the poor would receive at the resurrection. This quiet observer, noticing that the Master's remarks were touching upon the recompense of the just in the world to come, now breaks in with a remark on the blessedness of him who should eat bread in the kingdom of God. The words do not seem to have been spoken in a mocking spirit, but to have been the genuine outcome of the speaker's admiration of the Guest so hated and yet so wondered at. There is, no doubt, lurking in the words a certain Pharisaic self-congratulation - a something which seems to imply, \"Yes, that blessedness to which you, O Master, are alluding, I am looking forward confidently to share in. How happy will it be for us, Jews as we are, when the time comes for us to sit down at that banquet in the kingdom of heaven l\" Luke 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on Matthew 5:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]