[{"header":"Vision of the Glory of God Filling the Temple"},{"num":43,"verse":"Then he led me to the gate, the gate facing east;"},{"num":2,"verse":"and behold, the glory of the God of Israel was coming from the way of the east. And His voice was like the sound of many waters; and the earth shone from His glory."},{"num":3,"verse":"And it was like the appearance of the vision which I saw, like the vision which I saw when He came to destroy the city. And the visions were like the vision which I saw by the river Chebar; and I fell on my face."},{"num":4,"verse":"And the glory of the Lord entered the house by way of the gate facing east."},{"num":5,"verse":"And the Spirit lifted me up and brought me into the inner courtyard; and behold, the glory of the Lord filled the house."},{"num":6,"verse":"Then I heard Him speaking to me from the house, while a man was standing beside me."},{"num":7,"verse":"And He said to me, “Son of man, this is the place of My throne and the place of the soles of My feet, where I will dwell among the sons of Israel forever. And the house of Israel will not again defile My holy name, neither they nor their kings, by their prostitution and by the corpses of their kings when they die,"},{"num":8,"verse":"by putting their threshold by My threshold, and their door post beside My door post, with only the wall between Me and them. And they have defiled My holy name by their abominations which they have committed. So I have consumed them in My anger."},{"num":9,"verse":"Now let them remove their prostitution and the corpses of their kings far from Me, and I will dwell among them forever."},{"num":10,"verse":"“As for you, son of man, inform the house of Israel of the temple, so that they will be ashamed of their wrongdoings; and have them measure the plan."},{"num":11,"verse":"And if they are ashamed of everything that they have done, make known to them the plan of the house, its layout, its exits, its entrances, all its plans, all its statutes, and all its laws. And write it in their sight, so that they may observe its entire plan and all its statutes and execute them."},{"num":12,"verse":"This is the law of the house: its entire area on the top of the mountain all around shall be most holy. Behold, this is the law of the house."},{"header":"The Altar of Sacrifice"},{"num":13,"verse":"“And these are the measurements of the altar by cubits (the cubit being a cubit and a hand width): the base shall be a cubit and the width a cubit, and its border on its edge all around one span; and this shall be the height of the base of the altar."},{"num":14,"verse":"And from the base on the ground to the lower ledge shall be two cubits, and the width one cubit; and from the smaller ledge to the larger ledge shall be four cubits, and the width one cubit."},{"num":15,"verse":"The altar hearth shall be four cubits; and from the altar hearth shall extend upward four horns."},{"num":16,"verse":"Now the altar hearth shall be twelve cubits long by twelve wide, square in its four sides."},{"num":17,"verse":"And the ledge shall be fourteen cubits long by fourteen wide in its four sides, the border around it shall be half a cubit, and its base shall be a cubit all around; and its steps shall face east.”"},{"header":"The Offerings"},{"num":18,"verse":"And He said to me, “Son of man, this is what the Lord God says: ‘These are the statutes for the altar on the day it is built, to offer burnt offerings on it and to sprinkle blood on it."},{"num":19,"verse":"You shall give to the Levitical priests who are from the descendants of Zadok, who come near to Me to serve Me,’ declares the Lord God, ‘a bull as a sin offering."},{"num":20,"verse":"And you shall take some of its blood and put it on its four horns and on the four corners of the ledge, and on the border all around; so you shall cleanse it and make atonement for it."},{"num":21,"verse":"You shall also take the bull as the sin offering, and it shall be burned in the appointed place of the house, outside the sanctuary."},{"num":22,"verse":"‘And on the second day you shall offer a male goat without blemish as a sin offering, and they shall cleanse the altar from sin as they cleansed it with the bull."},{"num":23,"verse":"When you have finished cleansing it, you shall offer a bull without blemish and a ram without blemish from the flock."},{"num":24,"verse":"You shall offer them before the Lord, and the priests shall throw salt on them, and they shall offer them up as a burnt offering to the Lord."},{"num":25,"verse":"For seven days you shall prepare a goat as a sin offering daily; also a bull and a ram from the flock, both without blemish, shall be prepared."},{"num":26,"verse":"For seven days they shall make atonement for the altar and purify it; so shall they consecrate it."},{"num":27,"verse":"When they have completed the days, it shall be that on the eighth day and onward, the priests shall offer your burnt offerings on the altar, and your peace offerings; and I will accept you,’ declares the Lord God.”"}]