[{"header":"The Lord Returns to the House of God"},{"num":43,"verse":"Then he brought me to the east gate, "},{"num":2,"verse":"and I saw the shining-greatness of the God of Israel coming from the east. His voice was like the sound of many waters, and the earth was shining because of His greatness. "},{"num":3,"verse":"It was like the special dream that I saw when He came to destroy the city. It was like the special dream that I saw by the Chebar River. I fell with my face to the ground. "},{"num":4,"verse":"As the shining-greatness of the Lord came into the house through the east gate, "},{"num":5,"verse":"the Spirit lifted me up and brought me into the inner open space. And the shining-greatness of the Lord filled the house."},{"num":6,"verse":"While the man was standing beside me, I heard Someone speaking to me from inside the house. "},{"num":7,"verse":"And He said to me, “Son of man, this is the place for My throne and for the bottom of My feet, where I will live among the people of Israel forever. No longer will the people of Israel or their kings make My holy name unclean, by worshiping other gods or by the dead bodies of their kings. "},{"num":8,"verse":"They put their doorways by My doorways, and their door pillars beside My door pillars, with only a wall between Me and them. In doing so, they have made My holy name unclean by the hated sins they have done. So I have destroyed them in My anger. "},{"num":9,"verse":"Now let them put their worship of other gods and the dead bodies of their kings far from Me. And I will live among them forever."},{"num":10,"verse":"“Son of man, tell the people of Israel about the house of the Lord, that they may be ashamed of their sins. Let them look over the plan. "},{"num":11,"verse":"And if they are ashamed of all that they have done, let them know how the house is built, the house with its doors and gateways, and its whole plan. Let them know all its laws. Write it down in front of them, so that they will see its whole plan and obey all its laws. "},{"num":12,"verse":"This is the law of the house: All the ground around it on top of the mountain will be most holy. This is the law of the house."},{"header":"The Altar"},{"num":13,"verse":"“This is the length, width, and height of the altar by cubits (with the length of the hand being added to the length of each arm). The base will be one cubit long and one cubit wide, with a side piece going around it as wide as a man’s spread hand. This will be the height of the altar: "},{"num":14,"verse":"The base will be two cubits long from the base on the ground to its top, and one cubit wide. And it will be four cubits from the smaller part up to its larger top part, and one cubit wide. "},{"num":15,"verse":"The altar fireplace will be four cubits high, and four horns will go up from the top four corners of the altar one cubit high. "},{"num":16,"verse":"This top part of the altar will be twelve cubits long and twelve cubits wide, the same on each of the four sides. "},{"num":17,"verse":"The side of it will be fourteen cubits long and fourteen cubits wide, the same on each of the four sides. And a side piece half a cubit will be around that. Its base will be a cubit wide all around, and its steps will be on the east side.”"},{"num":18,"verse":"And He said to me, “Son of man, the Lord God says, ‘These are the laws for giving burnt gifts and for putting blood on the altar on the day it is built: "},{"num":19,"verse":"You must give a young bull for a sin gift to the Levite religious leaders of the sons of Zadok. They are the ones who come near Me to do My work,’ says the Lord God. "},{"num":20,"verse":"‘You must take some of the bull’s blood and put it on the four horns of the altar, and on the four corners of the top of the altar, and on the side piece that goes around it. In this way you will make it clean and free from sin. "},{"num":21,"verse":"You must also take the bull for the sin gift, and burn it in the chosen place of the house, outside the holy place. "},{"num":22,"verse":"On the second day you must give a male goat that is perfect for a sin gift. And the altar will be made clean, as it was made clean with the bull. "},{"num":23,"verse":"When you have finished making it clean, you must give a young bull that is perfect, and a ram from the flock that is perfect. "},{"num":24,"verse":"You must bring them before the Lord. The religious leaders will throw salt on them, and burn them on the altar as a gift to the Lord. "},{"num":25,"verse":"You must make ready a goat for a sin gift each day for seven days. Also make ready a young bull and a ram from the flock. They must be perfect. "},{"num":26,"verse":"For seven days they must make the altar free from sin and make it pure, so it will be set apart to Me. "},{"num":27,"verse":"At the end of these days, from the eighth day on, the religious leaders will give your burnt gifts and peace gifts on the altar. And I will receive you,’ says the Lord God.”"}]