[{"num":13,"verse":"Continue to love each other with true brotherly love. "},{"num":2,"verse":"Don’t forget to be kind to strangers, for some who have done this have entertained angels without realizing it! "},{"num":3,"verse":"Don’t forget about those in jail. Suffer with them as though you were there yourself. Share the sorrow of those being mistreated, for you know what they are going through."},{"num":4,"verse":"Honor your marriage and its vows, and be pure; for God will surely punish all those who are immoral or commit adultery."},{"num":5,"verse":"Stay away from the love of money; be satisfied with what you have. For God has said, “I will never, never fail you nor forsake you.” "},{"num":6,"verse":"That is why we can say without any doubt or fear, “The Lord is my Helper, and I am not afraid of anything that mere man can do to me.”"},{"num":7,"verse":"Remember your leaders who have taught you the Word of God. Think of all the good that has come from their lives, and try to trust the Lord as they do."},{"num":8,"verse":"Jesus Christ is the same yesterday, today, and forever. "},{"num":9,"verse":"So do not be attracted by strange, new ideas. Your spiritual strength comes as a gift from God, not from ceremonial rules about eating certain foods—a method which, by the way, hasn’t helped those who have tried it!"},{"num":10,"verse":"We have an altar—the cross where Christ was sacrificed—where those who continue to seek salvation by obeying Jewish laws can never be helped. "},{"num":11,"verse":"Under the system of Jewish laws, the high priest brought the blood of the slain animals into the sanctuary as a sacrifice for sin, and then the bodies of the animals were burned outside the city. "},{"num":12,"verse":"That is why Jesus suffered and died outside the city, where his blood washed our sins away."},{"num":13,"verse":"So let us go out to him beyond the city walls (that is, outside the interests of this world, being willing to be despised) to suffer with him there, bearing his shame. "},{"num":14,"verse":"For this world is not our home; we are looking forward to our everlasting home in heaven."},{"num":15,"verse":"With Jesus’ help we will continually offer our sacrifice of praise to God by telling others of the glory of his name. "},{"num":16,"verse":"Don’t forget to do good and to share what you have with those in need, for such sacrifices are very pleasing to him. "},{"num":17,"verse":"Obey your spiritual leaders and be willing to do what they say. For their work is to watch over your souls, and God will judge them on how well they do this. Give them reason to report joyfully about you to the Lord and not with sorrow, for then you will suffer for it too."},{"num":18,"verse":"Pray for us, for our conscience is clear and we want to keep it that way. "},{"num":19,"verse":"I especially need your prayers right now so that I can come back to you sooner."},{"num":20,"verse":"And now may the God of peace, who brought again from the dead our Lord Jesus, equip you with all you need for doing his will. May he who became the great Shepherd of the sheep by an everlasting agreement between God and you, signed with his blood, produce in you through the power of Christ all that is pleasing to him. To him be glory forever and ever. Amen."},{"num":22,"verse":"Brethren, please listen patiently to what I have said in this letter, for it is a short one. "},{"num":23,"verse":"I want you to know that Brother Timothy is now out of jail; if he comes here soon, I will come with him to see you. "},{"num":24,"verse":"Give my greetings to all your leaders and to the other believers there. The Christians from Italy who are here with me send you their love. God’s grace be with you all. Good-bye."}]