[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he shall wave the sheaf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and he shall wave the omer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The priest mixed with the omer of meal a log of oil, put on a handful of frankincense (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as on other meat-offerings, waved it, took a handful of it and caused it to ascend in smoke (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and then consumed the residue in company with his fellow-priests. Immediately after this ceremony, bread, parched corn, green ears, &c, of the new crop were exposed for sale in the streets of Jerusalem, as, prior to the offering of the omer, no use whatever was allowed to be made of the new corn.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On the morrow after the sabbath.—The interpretation of this phrase also constituted one of the differences between the Pharisees and the Sadducees during the second Temple. According to the Pharisees, the term sabbath here, as elsewhere (see Leviticus 23:24; Leviticus 23:32; Leviticus 23:39), is not the weekly sabbath, but the next day, or the first day of the holy convocation, the first day of Passover, on which the Israelites had to abstain from all unnecessary work. It is the 16th of Nisan. The Sadducees, however, maintained that it is to be understood in its literal sense as denoting the weekly sab-bath in the Passover week, which might happen to fall within the seven days, and possibly the fifth or sixth day of the festival. But this is against the import of Leviticus 23:15. Here the feast of Pentecost is to be reckoned from this sabbath, and if this sabbath might either be on the second or sixth day of the Passover, not only would the feast of Pentecost have no definite day, but the Passover itself would, in the course of time, be displaced from the fundamental position which it occupies in the order of the annual festivals. Hence the Pharisees, rightly regarding the word sabbath here as an alternative term for the day of holy convocation, took the morrow after the sabbath to denote Nisan 16. On the afternoon of this day, therefore, the inhabitants of the neighbouring towns of Jerusalem assembled together “so that the reaping might take place amidst great tumult.” As soon as it became dark, each of the reapers asked, “Has the sun gone down?” To which the people replied, “Yes.” They asked twice again, “Has the sun gone down?” to which the people each time replied, “Yes.” Each reaper then asked three times, “Is this the scythe? “to which the people each time replied “Yes.” “Is this the box?” they next asked three times. “Yes,” was again thrice the reply of the people. “Is this the Sabbath?” the reaper asked three times; and three times the people replied, “Yes.” “Shall I cut?” he asked three times; and three times the people replied, “Yes.” When cut it was laid in boxes, brought into the court of the Temple, threshed with canes and sticks, that the grains might not be crushed, and laid in a roast with holes, so that the fire might touch each grain. Thereupon it was spread in the court of the sanctuary for the wind to pass over it, and ground in a barley mill which left the hulls unground. The flour thus obtained was sifted through thirteen different sieves, each one finer than its predecessor. In this manner was the prescribed omer or tenth part got from the seah.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "On the morrow after the sabbath.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The interpretation of this phrase also constituted one of the differences between the Pharisees and the Sadducees during the second Temple. According to the Pharisees, the term sabbath here, as elsewhere (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is not the weekly sabbath, but the next day, or the first day of the holy convocation, the first day of Passover, on which the Israelites had to abstain from all unnecessary work. It is the 16th of Nisan. The Sadducees, however, maintained that it is to be understood in its literal sense as denoting the weekly sab-bath in the Passover week, which might happen to fall within the seven days, and possibly the fifth or sixth day of the festival. But this is against the import of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here the feast of Pentecost is to be reckoned from this sabbath, and if this sabbath might either be on the second or sixth day of the Passover, not only would the feast of Pentecost have no definite day, but the Passover itself would, in the course of time, be displaced from the fundamental position which it occupies in the order of the annual festivals. Hence the Pharisees, rightly regarding the word sabbath here as an alternative term for the day of holy convocation, took the morrow after the sabbath to denote Nisan 16. On the afternoon of this day, therefore, the inhabitants of the neighbouring towns of Jerusalem assembled together “so that the reaping might take place amidst great tumult.” As soon as it became dark, each of the reapers asked, “Has the sun gone down?” To which the people replied, “Yes.” They asked twice again, “Has the sun gone down?” to which the people each time replied, “Yes.” Each reaper then asked three times, “Is this the scythe? “to which the people each time replied “Yes.” “Is this the box?” they next asked three times. “Yes,” was again thrice the reply of the people. “Is this the Sabbath?” the reaper asked three times; and three times the people replied, “Yes.” “Shall I cut?” he asked three times; and three times the people replied, “Yes.” When cut it was laid in boxes, brought into the court of the Temple, threshed with canes and sticks, that the grains might not be crushed, and laid in a roast with holes, so that the fire might touch each grain. Thereupon it was spread in the court of the sanctuary for the wind to pass over it, and ground in a barley mill which left the hulls unground. The flour thus obtained was sifted through thirteen different sieves, each one finer than its predecessor. In this manner was the prescribed omer or tenth part got from the seah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 23:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall wave the sheaf — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "omer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "rather. In the name of the whole congregation, it was lifted up toward heaven, as an acknowledgment to God for his goodness, and with prayer for his blessing upon all their ensuing harvest, which it, as it were, sanctified to them, and of which it gave them a comfortable use. For then we may ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eat our bread with joy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "when God hath accepted our works. And thus should we always begin with God; begin our lives with him, begin every day with him, begin every work and business with him: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seek ye first the kingdom of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Reader, dost thou do this? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The morrow after the sabbath — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "After the first day of the feast of unleavened bread, which was a sabbath, or day of rest, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or upon the sixteenth day of the month. And this was the first of those fifty days, in the close whereof was the feast of pentecost.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:4-14 The feast of the Passover was to continue seven days; not idle days, spent in sport, as many that are called Christians spend their holy-days. Offerings were made to the Lord at his altar; and the people were taught to employ their time in prayer, and praise, and godly meditation. The sheaf of first-fruits was typical of the Lord Jesus, who is risen from the dead as the First-fruits of them that slept. Our Lord Jesus rose from the dead on the very day that the first-fruits were offered. We are taught by this law to honour the Lord with our substance, and with the first-fruits of all our increase, Pr 3:9. They were not to eat of their new corn, till God's part was offered to him out of it; and we must always begin with God: begin every day with him, begin every meal with him, begin every affair and business with him; seek first the kingdom of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the morrow after the sabbath - It is most probable that these words denote the 16th of Abib, the day after the first day of holy convocation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:5-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note), and that this was called \"the Sabbath of the Passover\", or, \"the Sabbath of unleavened bread\".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. ye shall bring a sheaf of the first-fruits of your harvest unto the priest—A sheaf, literally, an omer, of the first-fruits of the barley harvest. The barley being sooner ripe than the other grains, the reaping of it formed the commencement of the general harvest season. The offering described in this passage was made on the sixteenth of the first month, the day following the first Passover Sabbath, which was on the fifteenth (corresponding to the beginning of our April); but it was reaped after sunset on the previous evening by persons deputed to go with sickles and obtain samples from different fields. These, being laid together in a sheaf or loose bundle, were brought to the court of the temple, where the grain was winnowed, parched, and bruised in a mortar. Then, after some incense had been sprinkled on it, the priest waved the sheaf aloft before the Lord towards the four different points of the compass, took a part of it and threw it into the fire of the altar—all the rest being reserved to himself. It was a proper and beautiful act, expressive of dependence on the God of nature and providence—common among all people, but more especially becoming the Israelites, who owed their land itself as well as all it produced to the divine bounty. The offering of the wave-sheaf sanctified the whole harvest (Ro 11:16). At the same time, this feast had a typical character, and pre-intimated the resurrection of Christ (1Co 15:20), who rose from the dead on the very day the first-fruits were offered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To be accepted for you; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that God may accept of you, and bless you in the rest of your harvest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "On the morrow after the sabbath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. after the first day of the feast of unleavened bread, which was a sabbath, or day of rest, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 23:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or upon the sixteenth day of the month. And this was the first of those fifty days, in the close whereof was the feast of pentecost, or Whitsuntide. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he shall wave the sheaf before the Lord,.... Or the omer of barley; this was done by the priest in the tabernacle and temple, where was the presence of God, and that before the handful of it was put upon the altar; which agitation or waving was, as Gersom says, towards the cast; it was moved to and fro, backwards and forwards, upwards and downwards, to make an acknowledgment to the Lord of heaven and earth, that the fruits of the earth and the plentiful harvest were of him, and to give him the praise and glory of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to be accepted for you; of the Lord, as a thanksgiving to him, for the harvest now ripe, and the appointed time of it, and the plenty thereof; and that the remainder might be sanctified and blessed to them, and they have leave to gather it in, which they had not till this was done: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "on the morrow after the sabbath the priest shall wave it; not after the seventh day, but after the first day of the feast of unleavened bread, which was a sabbath, in which no servile work was to be done, Leviticus 23:7; and so the Targum of Jonathan calls it the day after the first good day of the passover, which was the sixteenth of Nisan, as Josephus expressly says, in the place above referred to; and so it is generally understood by Jewish writers (m) the account given of this affair is this; the messengers of the sanhedrim went out (from Jerusalem over the brook Kidron to the fields near it) on the evening of the feast, (i.e. at the going out of the fifteenth) and at the beginning of the sixteenth of Nisan, and bound the standing corn in bundles, that so it might be the more easily reaped; and all the neighbouring cities gathered together there, that it might be reaped in great pomp; and when it was dark, one said to them, is the sun set? they said, yes. With this sickle (shall I reap?) they said, yes. In this basket (shall I put it?) they said, yes. If on a sabbath day, he said to them, On this sabbath day (shall I do it?) they said, yes (n). These questions were put and answered three times; then they reaped it and put it into the baskets, and brought it to the court, where they parched it before the fire, to fulfil the commandment of parched corn; then they put it in mills for grinding beans, and took out of it a tenth part (of an ephah), which was sifted with eighteen sieves; then oil and frankincense were poured upon it, being mixed; and it was waved, and brought, and a handful taken and burnt, and the rest was eaten by the priests; and when they had offered the omer, they went out and found the streets of Jerusalem full of meal and parched corn (o), there being now full liberty to reap what they would: now this sheaf of the firstfruits was typical of Christ; it being of barley, may denote the mean estate of Christ in his humiliation; and but one sheaf for all the people, may signify that Christ is the one Mediator, Saviour, and Redeemer: yet as a sheaf comprehends many stalks and grains, so Christ has a complication of blessings in him; yea, he had all his people representatively in him, when he was offered for the whole body of his mystical Israel, all the children of God scattered abroad; the manner of reaping it, by persons deputed by the sanhedrim on the eve of a festival of the passover, in the sight of much people, without Jerusalem, near Kidron, exactly agrees with the apprehending of Christ in the night near Kidron, by persons sent from the Jewish sanhedrim, and his suffering publicly without the gates of Jerusalem; it being brought to the priests in the court, and threshed, winnowed, dried, and parched by the fire, and ground in mills, may denote the various dolorous sufferings of Christ, by means of the priests and elders of the people; and oil and frankincense being put on it, may denote the acceptableness of his sacrifice to God; and the waving of it, his resurrection from the dead, which was on the very day this sheaf was waved; who is the firstfruits of them that sleep in him, and which sanctifies the whole body of them, and ensures their resurrection unto eternal life; see 1 Corinthians 15:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "on the morrow after the sabbath the priest shall wave it; not after the seventh day, but after the first day of the feast of unleavened bread, which was a sabbath, in which no servile work was to be done, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so the Targum of Jonathan calls it the day after the first good day of the passover, which was the sixteenth of Nisan, as Josephus expressly says, in the place above referred to; and so it is generally understood by Jewish writers (m) the account given of this affair is this; the messengers of the sanhedrim went out (from Jerusalem over the brook Kidron to the fields near it) on the evening of the feast, (i.e. at the going out of the fifteenth) and at the beginning of the sixteenth of Nisan, and bound the standing corn in bundles, that so it might be the more easily reaped; and all the neighbouring cities gathered together there, that it might be reaped in great pomp; and when it was dark, one said to them, is the sun set? they said, yes. With this sickle (shall I reap?) they said, yes. In this basket (shall I put it?) they said, yes. If on a sabbath day, he said to them, On this sabbath day (shall I do it?) they said, yes (n). These questions were put and answered three times; then they reaped it and put it into the baskets, and brought it to the court, where they parched it before the fire, to fulfil the commandment of parched corn; then they put it in mills for grinding beans, and took out of it a tenth part (of an ephah), which was sifted with eighteen sieves; then oil and frankincense were poured upon it, being mixed; and it was waved, and brought, and a handful taken and burnt, and the rest was eaten by the priests; and when they had offered the omer, they went out and found the streets of Jerusalem full of meal and parched corn (o), there being now full liberty to reap what they would: now this sheaf of the firstfruits was typical of Christ; it being of barley, may denote the mean estate of Christ in his humiliation; and but one sheaf for all the people, may signify that Christ is the one Mediator, Saviour, and Redeemer: yet as a sheaf comprehends many stalks and grains, so Christ has a complication of blessings in him; yea, he had all his people representatively in him, when he was offered for the whole body of his mystical Israel, all the children of God scattered abroad; the manner of reaping it, by persons deputed by the sanhedrim on the eve of a festival of the passover, in the sight of much people, without Jerusalem, near Kidron, exactly agrees with the apprehending of Christ in the night near Kidron, by persons sent from the Jewish sanhedrim, and his suffering publicly without the gates of Jerusalem; it being brought to the priests in the court, and threshed, winnowed, dried, and parched by the fire, and ground in mills, may denote the various dolorous sufferings of Christ, by means of the priests and elders of the people; and oil and frankincense being put on it, may denote the acceptableness of his sacrifice to God; and the waving of it, his resurrection from the dead, which was on the very day this sheaf was waved; who is the firstfruits of them that sleep in him, and which sanctifies the whole body of them, and ensures their resurrection unto eternal life; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Jarchi & Ben Gersom in loc. Jarchi in Misn. Succah, c. 3. sect. 12. (n) Misn. Menachot, c. 10. sect. 3, 4. (o) Ib. sect. 4, 5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Jarchi & Ben Gersom in loc. Jarchi in Misn. Succah, c. 3. sect. 12. (n) Misn. Menachot, c. 10. sect. 3, 4. (o) Ib. sect. 4, 5. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he shall wave the sheaf before the LORD, to be accepted for you: on the morrow after the {d} sabbath the priest shall wave it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he shall wave the sheaf before the LORD, to be accepted for you: on the morrow after the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sabbath the priest shall wave it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) That is, the second sabbath of the Passover.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ritual here set forth has no parallel elsewhere in the Pentateuch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " prescribes that ‘the first of all the fruit of the ground’ shall be offered, but gives no direction as to any particular day. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the nature of the offering is left undetermined, and the date is seven weeks ‘from the time thou beginnest to put the sickle to the standing corn.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall wave",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See Appendix IV, pp. 183 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the morrow after the sabbath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For this vague expression see introd. note to ch. Driver (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "LO T.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "9 p. 55 note) says that it is understood traditionally of the 1st day of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Maẓẓoth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (unleavened bread); but this is an unusual sense of ‘sabbath.’ He considers it probable that in its original connexion the ‘sabbath’ meant here was the ordinary weekly sabbath which fell during the seven days of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Maẓẓoth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Leviticus 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The leading directions for the Passover and feast of Mazzoth are repeated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:15-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". עבדה מלאכת, occupation of a work, signifies labour at some definite occupation, e.g., the building of the tabernacle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; hence occupation in connection with trade or one's social calling, such as agriculture, handicraft, and so forth; whilst מלאכה is the performance of any kind of work, e.g., kindling fire for cooking food (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On the Sabbath and the day of atonement every kind of civil work was prohibited, even to the kindling of fire for the purpose of cooking (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); on the other feast-days with a holy convocation, only servile work (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the explanation on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 12:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :15ff., and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To this there is appended a fresh regulation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:9-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with the repetition of the introductory clause, \"And the Lord spake,\" etc. When the Israelites had come into the land to be given them by the Lord, and had reaped the harvest, they were to bring a sheaf as first-fruits of their harvest to the priest, that he might wave it before Jehovah on the day after the Sabbath, i.e., after the first day of Mazzoth. According to Josephus and Philo, it was a sheaf of barley; but this is not expressly commanded, because it would be taken for granted in Canaan, where the harvest began with the barley. In the warmer parts of Palestine the barley ripens about the middle of April, and is reaped in April or the beginning of May, whereas the wheat ripens two or three weeks later (Seetzen; Robinson's Pal. ii. 263, 278). The priest was to wave the sheaf before Jehovah, i.e., to present it symbolically to Jehovah by the ceremony of waving, without burning any of it upon the altar. The rabbinical rule, viz., to dry a portion of the ears by the fire, and then, after rubbing them out, to burn them on the altar, was an ordinance of the later scribes, who knew not the law, and was based upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the law in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers to the offerings of first-fruits made by private persons, which are treated of in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sheaf of first-fruits, on the other hand, which was to be offered before Jehovah as a wave-offering in the name of the congregation, corresponded to the two wave-loaves which were leavened and then baked, and were to be presented to the Lord as first-fruits (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As no portion of these wave-loaves was burned upon the altar, because nothing leavened was to be placed upon it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but they were assigned entirely to the priests, we have only to assume that the same application was intended by the law in the case of the sheaf of first-fruits, since the text only prescribes the waving, and does not contain a word about roasting, rubbing, or burning the grains upon the altar. השּׁבּת מחרת (the morrow after the Sabbath) signifies the next day after the first day of the feast of Mazzoth, i.e., the 16th Abib (Nisan), not the day of the Sabbath which fell in the seven days' feast of Mazzoth, as the Baethoseans supposed, still less the 22nd of Nisan, or the day after the conclusion of the seven days' feast, which always closed with a Sabbath, as Hitzig imagines.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The view advocated by the Baethoseans, which has been lately supported by W. Schultz, is refuted not only by Joshua 5:11, but by the definite article used, השּׁבּת, which points back to one of the feast-days already mentioned, and still more decisively by the circumstance, that according to Leviticus 23:15 the seven weeks, at the close of which the feast of Pentecost was to be kept, were to be reckoned from this Sabbath; and if the Sabbath was not fixed, but might fall upon any day of the seven days' feast of Mazzoth, and therefore as much as give or six days after the Passover, the feast of Passover itself would be forced out of the fundamental position which it occupied in the series of annual festivals (cf. Ranke, Pentateuch ii. 108). Hitzig's hypothesis has been revived by Hupfeld and Knobel, without any notice of the conclusive refutation given to it by Bהhr and Wieseler; only Knobel makes \"the Sabbath\" not the concluding but the opening Sabbath of the feast of Passover, on the ground that \"otherwise the festal sheaf would not have been offered till the 22nd of the month, and therefore would have come post festum.\" But this hypothesis, which renders it necessary that the commencement of the ecclesiastical year should always be assigned to a Saturday (Sabbath), in order to gain weekly Sabbaths for the 14th and 21st of the month, as the opening and close of the feast of Passover, gives such a form to the Jewish year as would involve its invariably closing with a broken week; a hypothesis which is not only incapable of demonstration, but, from the holiness attached to the Jewish division of weeks, is a priori improbable, and in fact inconceivable. The Mosaic law, which gave such sanctity to the division of time into weeks, as founded upon the history of creation, by the institution of the observance of the Sabbath, that it raised the Sabbath into the groundwork of a magnificent festal cycle, could not possibly have made such an arrangement with regard to the time for the observance of the Passover, as would involve almost invariably the mutilation of the last week of the year, and an interruption of the old and sacred weekly cycle with the Sabbath festival at its close. The arguments by which so forced a hypothesis is defended, must be very conclusive indeed, to meet with any acceptance. But neither Hitzig nor his followers have been able to adduce any such arguments as these. Besides the word \"Sabbath\" and Joshua 5:11, which prove nothing at all, the only other argument adduced by Knobel is, that \"it is impossible to see why precisely the second day of the azyma, when the people went about their ordinary duties, and there was no meeting at the sanctuary, should have been distinguished by the sacrificial gift which was the peculiar characteristic of the feast,\" - an argument based upon the fallacious principle, that anything for which I can see no reason, cannot possibly have occurred.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The view advocated by the Baethoseans, which has been lately supported by W. Schultz, is refuted not only by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but by the definite article used, השּׁבּת, which points back to one of the feast-days already mentioned, and still more decisively by the circumstance, that according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the seven weeks, at the close of which the feast of Pentecost was to be kept, were to be reckoned from this Sabbath; and if the Sabbath was not fixed, but might fall upon any day of the seven days' feast of Mazzoth, and therefore as much as give or six days after the Passover, the feast of Passover itself would be forced out of the fundamental position which it occupied in the series of annual festivals (cf. Ranke, Pentateuch ii. 108). Hitzig's hypothesis has been revived by Hupfeld and Knobel, without any notice of the conclusive refutation given to it by Bהhr and Wieseler; only Knobel makes \"the Sabbath\" not the concluding but the opening Sabbath of the feast of Passover, on the ground that \"otherwise the festal sheaf would not have been offered till the 22nd of the month, and therefore would have come post festum.\" But this hypothesis, which renders it necessary that the commencement of the ecclesiastical year should always be assigned to a Saturday (Sabbath), in order to gain weekly Sabbaths for the 14th and 21st of the month, as the opening and close of the feast of Passover, gives such a form to the Jewish year as would involve its invariably closing with a broken week; a hypothesis which is not only incapable of demonstration, but, from the holiness attached to the Jewish division of weeks, is a priori improbable, and in fact inconceivable. The Mosaic law, which gave such sanctity to the division of time into weeks, as founded upon the history of creation, by the institution of the observance of the Sabbath, that it raised the Sabbath into the groundwork of a magnificent festal cycle, could not possibly have made such an arrangement with regard to the time for the observance of the Passover, as would involve almost invariably the mutilation of the last week of the year, and an interruption of the old and sacred weekly cycle with the Sabbath festival at its close. The arguments by which so forced a hypothesis is defended, must be very conclusive indeed, to meet with any acceptance. But neither Hitzig nor his followers have been able to adduce any such arguments as these. Besides the word \"Sabbath\" and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which prove nothing at all, the only other argument adduced by Knobel is, that \"it is impossible to see why precisely the second day of the azyma, when the people went about their ordinary duties, and there was no meeting at the sanctuary, should have been distinguished by the sacrificial gift which was the peculiar characteristic of the feast,\" - an argument based upon the fallacious principle, that anything for which I can see no reason, cannot possibly have occurred.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The \"Sabbath\" does not mean the seventh day of the week, but the day of rest, although the weekly Sabbath was always the seventh or last day of the week; hence not only the seventh day of the week (Exodus 31:15, etc.), but the day of atonement (the tenth of the seventh month), is called \"Sabbath,\" and \"Shabbath shabbathon\" (Leviticus 23:32; Leviticus 16:31). As a day of rest, on which no laborious work was to be performed (Leviticus 23:8), the first day of the feast of Mazzoth is called \"Sabbath,\" irrespectively of the day of the week upon which it fell; and \"the morrow after the Sabbath\" is equivalent to \"the morrow after the Passover\" mentioned in Joshua 5:11, where \"Passover\" signifies the day at the beginning of which the paschal meal was held, i.e., the first day of unleavened bread, which commenced on the evening of the 14th, in other words, the 15th Abib. By offering the sheaf of first-fruits of the harvest, the Israelites were to consecrate their daily bread to the Lord their God, and practically to acknowledge that they owed the blessing of the harvest to the grace of God. They were not to eat any bread or roasted grains of the new corn till they had presented the offering of their God (Leviticus 23:14). This offering was fixed for the second day of the feast of the Passover, that the connection between the harvest and the Passover might be kept in subordination to the leading idea of the Passover itself (see at Exodus 12:15.). But as the sheaf was not burned upon the altar, but only presented symbolically to the Lord by waving, and then handed over to the priests, an altar-gift had to be connected with it, - namely, a yearling sheep as a burnt-offering, a meat-offering of two-tenths of an ephah of fine flour mixed with oil, and a drink-offering of a quarter of a hin of wine, - to give expression to the obligation and willingness of the congregation not only to enjoy their earthly food, but to strengthen all the members of their body for growth in holiness and diligence in good works. The burnt-offering, for which a yearling lamb was prescribed, as in fact for all the regular festal sacrifices, was of course in addition to the burnt-offerings prescribed in Numbers 28:19-20, for every feast-day. The meat-offering, however, was not to consist of one-tenth of an ephah of fine flour, as on other occasions (Exodus 29:40; Numbers 28:9, Numbers 28:13, etc.), but of two-tenths, that the offering of corn at the harvest-feast might be a more plentiful one than usual. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The \"Sabbath\" does not mean the seventh day of the week, but the day of rest, although the weekly Sabbath was always the seventh or last day of the week; hence not only the seventh day of the week (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.), but the day of atonement (the tenth of the seventh month), is called \"Sabbath,\" and \"Shabbath shabbathon\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As a day of rest, on which no laborious work was to be performed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the first day of the feast of Mazzoth is called \"Sabbath,\" irrespectively of the day of the week upon which it fell; and \"the morrow after the Sabbath\" is equivalent to \"the morrow after the Passover\" mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where \"Passover\" signifies the day at the beginning of which the paschal meal was held, i.e., the first day of unleavened bread, which commenced on the evening of the 14th, in other words, the 15th Abib. By offering the sheaf of first-fruits of the harvest, the Israelites were to consecrate their daily bread to the Lord their God, and practically to acknowledge that they owed the blessing of the harvest to the grace of God. They were not to eat any bread or roasted grains of the new corn till they had presented the offering of their God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This offering was fixed for the second day of the feast of the Passover, that the connection between the harvest and the Passover might be kept in subordination to the leading idea of the Passover itself (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). But as the sheaf was not burned upon the altar, but only presented symbolically to the Lord by waving, and then handed over to the priests, an altar-gift had to be connected with it, - namely, a yearling sheep as a burnt-offering, a meat-offering of two-tenths of an ephah of fine flour mixed with oil, and a drink-offering of a quarter of a hin of wine, - to give expression to the obligation and willingness of the congregation not only to enjoy their earthly food, but to strengthen all the members of their body for growth in holiness and diligence in good works. The burnt-offering, for which a yearling lamb was prescribed, as in fact for all the regular festal sacrifices, was of course in addition to the burnt-offerings prescribed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for every feast-day. The meat-offering, however, was not to consist of one-tenth of an ephah of fine flour, as on other occasions (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.), but of two-tenths, that the offering of corn at the harvest-feast might be a more plentiful one than usual. ",
            "children": []
          }
        ]
      }
    ]
  }
]