[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(34) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The fifteenth day of this seventh month.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, the month Tishri, corresponding to the end of September and the beginning of October, and only four days after the day of Atonement.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall be the feast of tabernacles.—How and where these tabernacles are to be erected the law here gives no directions. The details, as in many other enactments, are left to the administrators of the Law. From the account of the first celebration of this festival after the return from Babylon, the Jews, according to the command of Ezra, made themselves booths upon the roofs of houses, in the courts of their dwellings, and of their sanctuary, in the streets of the Water-gate and the gate of Ephraim. These tabernacles they made of olive branches, pine branches, myrtle branches, palm branches, and branches of thick trees (Nehemiah 8:15-18). The construction of these temporary abodes, however, was more minutely defined by Ezra’s successors. It was ordained during the second Temple that the interior of each tabernacle must not be higher than twenty cubits, and not lower than ten palms, it must at least have three walls, with a thatched roof partially open so as to admit a view of the sky and the stars. It must not be under a tree, nor must it be covered with a cloth, or with any material which contracts defilement. Only branches or shrubs which grow out of the ground are to be used for the covering. These booths the Israelites began to erect on the morrow after the Day of Atonement. On the fourteenth, which was the day of preparation, the pilgrims came up to Jerusalem, and on the eve of this day the priests proclaimed the approach of the holy convocation by the blasts of trumpets. As on the feasts of Passover and Pentecost, the altar of burnt-offering was cleansed in the first night watch, and the gates of the Temple, as well as those of the inner court, were opened immediately after midnight, for the convenience of the priests who resided in the city, and for the people, who filled the court before the cock crew, to have their sacrifices duly examined by the priests.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall be the feast of tabernacles.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—How and where these tabernacles are to be erected the law here gives no directions. The details, as in many other enactments, are left to the administrators of the Law. From the account of the first celebration of this festival after the return from Babylon, the Jews, according to the command of Ezra, made themselves booths upon the roofs of houses, in the courts of their dwellings, and of their sanctuary, in the streets of the Water-gate and the gate of Ephraim. These tabernacles they made of olive branches, pine branches, myrtle branches, palm branches, and branches of thick trees (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:15-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The construction of these temporary abodes, however, was more minutely defined by Ezra’s successors. It was ordained during the second Temple that the interior of each tabernacle must not be higher than twenty cubits, and not lower than ten palms, it must at least have three walls, with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "a ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "thatched roof partially open so as to admit a view of the sky and the stars. It must not be under a tree, nor must it be covered with a cloth, or with any material which contracts defilement. Only branches or shrubs which grow out of the ground are to be used for the covering. These booths the Israelites began to erect on the morrow after the Day of Atonement. On the fourteenth, which was the day of preparation, the pilgrims came up to Jerusalem, and on the eve of this day the priests proclaimed the approach of the holy convocation by the blasts of trumpets. As on the feasts of Passover and Pentecost, the altar of burnt-offering was cleansed in the first night watch, and the gates of the Temple, as well as those of the inner court, were opened immediately after midnight, for the convenience of the priests who resided in the city, and for the people, who filled the court before the cock crew, to have their sacrifices duly examined by the priests.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:33-44 In the feast of Tabernacles there was a remembrance of their dwelling in tents, or booths, in the wilderness, as well as their fathers dwelling in tents in Canaan; to remind them of their origin and their deliverance. Christ's tabernacling on earth in human nature, might also be prefigured. And it represents the believer's life on earth: a stranger and pilgrim here below, his home and heart are above with his Saviour. They would the more value the comforts and conveniences of their own houses, when they had been seven days dwelling in the booths. It is good for those who have ease and plenty, sometimes to learn what it is to endure hardness. The joy of harvest ought to be improved for the furtherance of our joy in God. The earth is the Lord's, and the fullness thereof; therefore whatever we have the comfort of, he must have the glory of, especially when any mercy is perfected. God appointed these feasts, Beside the sabbaths and your free-will offerings. Calls to extraordinary services will not excuse from constant and stated ones.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seven days - Like the Passover, the feast of tabernacles commenced at the full moon, on the fifteenth day of the month, and lasted for seven days. The week of the feast was followed by an eighth day, forming strictly no part of it ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which was a day of holy convocation, and appears to have been generally distinguished by the word translated \"solemn assembly\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From its derivation the word in the original appears strictly to denote a closing festival, and this rendering would apply with the most perfect fitness to the day after the week of the Feast of tabernacles, as the conclusion of the series of yearly festivals. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34-44. the feast of tabernacles, for seven days unto the Lord—This festival, which was instituted in grateful commemoration of the Israelites having securely dwelt in booths or tabernacles in the wilderness, was the third of the three great annual festivals, and, like the other two, it lasted a week. It began on the fifteenth day of the month, corresponding to the end of our September and beginning of October, which was observed as a Sabbath; and it could be celebrated only at the place of the sanctuary, offerings being made on the altar every day of its continuance. The Jews were commanded during the whole period of the festival to dwell in booths, which were erected on the flat roofs of houses, in the streets or fields; and the trees made use of are by some stated to be the citron, the palm, the myrtle, and the willow, while others maintain the people were allowed to take any trees they could obtain that were distinguished for verdure and fragrance. While the solid branches were reserved for the construction of the booths, the lighter branches were carried by men, who marched in triumphal procession, singing psalms and crying \"Hosanna!\" which signifies, \"Save, we beseech thee!\" (Ps 118:15, 25, 26). It was a season of great rejoicing. But the ceremony of drawing water from the pool, which was done on the last day, seems to have been the introduction of a later period (Joh 7:37). That last day was the eighth, and, on account of the scene at Siloam, was called \"the great day of the feast.\" The feast of ingathering, when the vintage was over, was celebrated also on that day [Ex 23:16; 34:22], and, as the conclusion of one of the great festivals, it was kept as a sabbath.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of tabernacles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of tents, or booths, or arbours. This feast was appointed principally to remind them of that time when they had no other dwellings in the wilderness, as it is expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 23:43",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to stir them up to bless God as well for the gracious conduct and protection then afforded them, as for their more commodious and secure habitations now given them; and secondarily, to excite them to gratitude for all the fruits of the year newly ended, which were now completely brought in, as may be gathered from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 23:39 Exodus 23:16 Deu 16:13,14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 16:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See an instance of this feast ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Nehemiah 8:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Speak unto the children of Israel, saying,.... Giving them directions about keeping a feast, in which the whole body of them had a very special and particular concern: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the fifteenth day of this seventh month; the month Tisri or September: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall be the feast of tabernacles for seven days unto the Lord; the design of which was, partly to give thanks for the fruits of the earth, now all gathered in, Leviticus 23:39; but chiefly to commemorate the dwelling of the children of Israel in tents and booths, during their forty years' abode in the wilderness, Leviticus 23:43; whereby their posterity in later times would be led to observe the difference between them and their forefathers, who lived in tents or booths, pitched sometimes in one place, and sometimes in another, in the open fields, in wastes, and deserts; whereas they dwelt in spacious cities, fortified towns, and magnificent houses; and were possessed of various kingdoms and nations, as was the land of Canaan: the reason, the Jews say (s), why this feast was kept at this time of the year and not at the season when they went out of Egypt and first dwelt in booths, as at Succoth which had its name from thence, Exodus 12:37, was this; because then the summer season began when men commonly used to build tabernacles to shelter them from the heat of the sun, wherefore, if the feast had been kept at that time, it would not have been known that it was kept at the command of God, and in remembrance of the above circumstance; but the month Tisri or September being usually a cold and rainy season in those parts, men were wont to leave their tabernacles and go into their houses; and so it was a plain case that the feast was observed not for convenience or through custom, but that it was at the command of God they went out of their houses into tabernacles at this season of the year, in commemoration of the miraculous benefit of dwelling in tents under the clouds of glory: and they also say, that for this reason it was ordered to begin on the fifteenth day, because it was on the fifteenth day of the month (though of another month) they went out of Egypt, and the clouds began to protect and accompany them; and this was enjoined them seven days, to teach them that the miraculous benefits of God are always and every day to be remembered: the Jews have a whole treatise in their Misnah, called \"Succah\", the \"booth\" or \"tabernacle\"; in which they give an account of the form and fabric and measure of their tabernacles, and of their dwelling and dining in them; and of the branches they carry in their hands, and of the manner of carrying and shaking them; and of the pouring out of water at this time, and of their piping and singing and other rites and ceremonies attending this feast; See Gill on John 7:2; besides, the uses of this feast before mentioned, it was typical of spiritual and evangelical things, and especially of the incarnation of Christ, whose human nature is the true tabernacle, in distinction from those typical ones, and in which he is expressly said to \"tabernacle\" among us, John 1:14; and it is highly probable that his incarnation or birth was at the time of this feast; at which time the temple of Solomon, a type of Christ's body, was also dedicated; and this season of the year suits better than that in which it is usually placed; and his baptism and the time of his death show it; see Luke 1:1; and as Christ, our passover, was sacrificed for us at the exact time of the passover, and the firstfruits of the Spirit were given on the very day of Pentecost, or feast of firstfruits; so it is most likely, that Christ was born, or first began to tabernacle in human nature at the feast of tabernacles, which we, in Gospel times, are to keep, by believing in the incarnate Saviour, and by attending to the Gospel ordinances he has appointed, to commemorate the benefits of his incarnation, sufferings, and death, Zechariah 14:16; moreover, the dwelling of the children of Israel in booths in the wilderness, and so at this feast in commemoration of it, may be an emblem of the tabernacles of the saints in their present wilderness state: this world, through which they are passing, is like a wilderness to them; their bodies are called tabernacles, which are pitched for a while; and their state and condition here is that of sojourners, pilgrims, and travellers; yea, these tents and tabernacles may be figures of the several particular churches of Christ, in the present state of things, which are set up for a while for the convenience, comfort, refreshment, and joy of the spiritual Israel of God; see Psalm 46:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shall be the feast of tabernacles for seven days unto the Lord; the design of which was, partly to give thanks for the fruits of the earth, now all gathered in, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but chiefly to commemorate the dwelling of the children of Israel in tents and booths, during their forty years' abode in the wilderness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; whereby their posterity in later times would be led to observe the difference between them and their forefathers, who lived in tents or booths, pitched sometimes in one place, and sometimes in another, in the open fields, in wastes, and deserts; whereas they dwelt in spacious cities, fortified towns, and magnificent houses; and were possessed of various kingdoms and nations, as was the land of Canaan: the reason, the Jews say (s), why this feast was kept at this time of the year and not at the season when they went out of Egypt and first dwelt in booths, as at Succoth which had its name from thence, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was this; because then the summer season began when men commonly used to build tabernacles to shelter them from the heat of the sun, wherefore, if the feast had been kept at that time, it would not have been known that it was kept at the command of God, and in remembrance of the above circumstance; but the month Tisri or September being usually a cold and rainy season in those parts, men were wont to leave their tabernacles and go into their houses; and so it was a plain case that the feast was observed not for convenience or through custom, but that it was at the command of God they went out of their houses into tabernacles at this season of the year, in commemoration of the miraculous benefit of dwelling in tents under the clouds of glory: and they also say, that for this reason it was ordered to begin on the fifteenth day, because it was on the fifteenth day of the month (though of another month) they went out of Egypt, and the clouds began to protect and accompany them; and this was enjoined them seven days, to teach them that the miraculous benefits of God are always and every day to be remembered: the Jews have a whole treatise in their Misnah, called \"Succah\", the \"booth\" or \"tabernacle\"; in which they give an account of the form and fabric and measure of their tabernacles, and of their dwelling and dining in them; and of the branches they carry in their hands, and of the manner of carrying and shaking them; and of the pouring out of water at this time, and of their piping and singing and other rites and ceremonies attending this feast; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; besides, the uses of this feast before mentioned, it was typical of spiritual and evangelical things, and especially of the incarnation of Christ, whose human nature is the true tabernacle, in distinction from those typical ones, and in which he is expressly said to \"tabernacle\" among us, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it is highly probable that his incarnation or birth was at the time of this feast; at which time the temple of Solomon, a type of Christ's body, was also dedicated; and this season of the year suits better than that in which it is usually placed; and his baptism and the time of his death show it; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and as Christ, our passover, was sacrificed for us at the exact time of the passover, and the firstfruits of the Spirit were given on the very day of Pentecost, or feast of firstfruits; so it is most likely, that Christ was born, or first began to tabernacle in human nature at the feast of tabernacles, which we, in Gospel times, are to keep, by believing in the incarnate Saviour, and by attending to the Gospel ordinances he has appointed, to commemorate the benefits of his incarnation, sufferings, and death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; moreover, the dwelling of the children of Israel in booths in the wilderness, and so at this feast in commemoration of it, may be an emblem of the tabernacles of the saints in their present wilderness state: this world, through which they are passing, is like a wilderness to them; their bodies are called tabernacles, which are pitched for a while; and their state and condition here is that of sojourners, pilgrims, and travellers; yea, these tents and tabernacles may be figures of the several particular churches of Christ, in the present state of things, which are set up for a while for the convenience, comfort, refreshment, and joy of the spiritual Israel of God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) Buxtorf. Synagog. Jud. c. 21. p. 447. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) Buxtorf. Synagog. Jud. c. 21. p. 447. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Speak unto the children of Israel, saying, The fifteenth day of this seventh month shall be the feast of tabernacles for seven days unto the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the fifteenth of the same month the feast of Tabernacles was to be kept to the Lord for seven days: on the first day with a holy meeting and rest from all laborious work, and for seven days with sacrifices, as appointed for every day in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:13-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Moreover, on the eighth day, i.e., the 22nd of the month, the closing feast was to be observed in the same manner as on the first day (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:34-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The name, \"feast of Tabernacles\" (booths), is to be explained from the fact, that the Israelites were to dwell in booths made of boughs for the seven days that this festival lasted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). עצרת, which is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the eighth day, which terminated the feast of Tabernacles, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the seventh day of the feast of Mazzoth, signifies the solemn close of a feast of several days, clausula festi, from עצר to shut in, or close (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), not a coagendo, congregando populo ad festum, nor a cohibitione laboris, ab interdicto opere, because the word is only applied to the last day of the feasts of Mazzoth and Tabernacles, and not to the first, although this was also kept with a national assembly and suspension of work. But as these clausaulae festi were holidays with a holy convocation and suspension of work, it was very natural that the word should be transferred at a later period to feasts generally, on which the people suspended work and met for worship and edification (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The azareth, as the eighth day, did not strictly belong to the feast of Tabernacles, which was only to last seven days; and it was distinguished, moreover, from these seven days by a smaller number of offerings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The eighth day was rather the solemn close of the whole circle of yearly feasts, and therefore was appended to the close of the last of these feasts as the eighth day of the feast itself (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seq.). - With ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the enumeration of all the yearly feasts on which holy meetings were to be convened is brought to an end. This is stated in the concluding formula (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which answers to the heading in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the Sabbaths are excepted, as they simply belonged to the moadim in the more general sense of the word. In this concluding formula, therefore, there is no indication that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:39-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are later additions to the original list of feasts which were to be kept with a meeting for worship. וגו להקריב (to offer, etc.) is not dependent upon \"holy convocations,\" but upon the main idea, \"feasts of Jehovah.\" Jehovah had appointed moadim, fixed periods in the year, for His congregation to offer sacrifices; not as if no sacrifices could be or were to be offered except at these feasts, but to remind His people, through these fixed days, of their duty to approach the Lord with sacrifices. אשּׁה is defined by the enumeration of four principal kinds of sacrifice-burnt-offerings, meat-offerings, slain (i.e., peace-) offerings, and drink-offerings. בּ יום דּבר: \"every day those appointed for it,\" as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]