[[],[],[{"type":"header","content":"Time and Again We’ve Betrayed God"},{"type":"prose","content":"’s Message that came to Jeremiah regarding the drought:"},{"type":"poetry","content":"“Judah weeps,"},{"type":"poetry","content":"The people fall to the ground, moaning,"},{"type":"poetry","content":"The rich people sent their servants for water."},{"type":"poetry","content":"They came back with empty buckets,"},{"type":"poetry","content":"All the farm work has stopped."},{"type":"poetry","content":"The farmers don’t know what to do."},{"type":"poetry","content":"Even the doe abandons her fawn in the field"},{"type":"poetry","content":"Eyes glazed over, on her last legs,"}],[{"type":"prose","content":"Then  said of these people:"},{"type":"poetry","content":"“Since they loved to wander this way and that,"},{"type":"poetry","content":"I will now have nothing more to do with them—"}],[{"type":"header","content":"The Killing Fields"},{"type":"prose","content":" said to me, “Don’t pray that everything will turn out all right for this people. When they skip their meals in order to pray, I won’t listen to a thing they say. When they redouble their prayers, bringing all kinds of offerings from their herds and crops, I’ll not accept them. I’m finishing them off with war and famine and disease.”"}],[{"type":"prose","content":"I said, “But Master, ! Their preachers have been telling them that everything is going to be all right—no war and no famine—that there’s nothing to worry about.”"}],[{"type":"prose","content":"Then  said, “These preachers are liars, and they use my name to cover their lies. I never sent them, I never commanded them, and I don’t talk with them. The sermons they’ve been handing out are sheer illusion, tissues of lies, whistlings in the dark."}],[{"type":"prose","content":"“So this is my verdict on them: All the preachers who preach using my name as their text, preachers I never sent in the first place, preachers who say, ‘War and famine will never come here’—these preachers will die in war and by starvation. And the people to whom they’ve been preaching will end up as corpses, victims of war and starvation, thrown out in the streets of Jerusalem unburied—no funerals for them or their wives or their children! I’ll make sure they get the full brunt of all their evil."}],[{"type":"prose","content":"“And you, Jeremiah, will say this to them:"},{"type":"poetry","content":"“‘My eyes pour out tears."},{"type":"poetry","content":"My dear, dear people are battered and bruised,"},{"type":"poetry","content":"I walk out into the fields,"},{"type":"poetry","content":"I walk into the city,"},{"type":"poetry","content":"And I watch the preachers and priests"}]]