[{"num":27,"verse":"When Isaac had become an old man and was nearly blind, he called his eldest son, Esau, and said, “My son.”"},{"num":2,"verse":"“I’m an old man,” he said; “I might die any day now. Do me a favor: Get your quiver of arrows and your bow and go out in the country and hunt me some game. Then fix me a hearty meal, the kind that you know I like, and bring it to me to eat so that I can give you my personal blessing before I die.”"},{"num":5,"verse":"Rebekah was eavesdropping as Isaac spoke to his son Esau. As soon as Esau had gone off to the country to hunt game for his father, Rebekah spoke to her son Jacob. “I just overheard your father talking with your brother, Esau. He said, ‘Bring me some game and fix me a hearty meal so that I can eat and bless you with God’s blessing before I die.’"},{"num":8,"verse":"“Now, my son, listen to me. Do what I tell you. Go to the flock and get me two young goats. Pick the best; I’ll prepare them into a hearty meal, the kind that your father loves. Then you’ll take it to your father, he’ll eat and bless you before he dies.”"},{"num":11,"verse":"“But Mother,” Jacob said, “my brother Esau is a hairy man and I have smooth skin. What happens if my father touches me? He’ll think I’m playing games with him. I’ll bring down a curse on myself instead of a blessing.”"},{"num":13,"verse":"“If it comes to that,” said his mother, “I’ll take the curse on myself. Now, just do what I say. Go and get the goats.”"},{"num":14,"verse":"So he went and got them and brought them to his mother and she cooked a hearty meal, the kind his father loved so much."},{"num":15,"verse":"Rebekah took the dress-up clothes of her older son Esau and put them on her younger son Jacob. She took the goatskins and covered his hands and the smooth nape of his neck. Then she placed the hearty meal she had fixed and fresh bread she’d baked into the hands of her son Jacob."},{"num":18,"verse":"He went to his father and said, “My father!”"},{"num":19,"verse":"Jacob answered his father, “I’m your firstborn son Esau. I did what you told me. Come now; sit up and eat of my game so you can give me your personal blessing.”"},{"num":20,"verse":"Isaac said, “So soon? How did you get it so quickly?”"},{"num":21,"verse":"Isaac said, “Come close, son; let me touch you—are you really my son Esau?”"},{"num":22,"verse":"So Jacob moved close to his father Isaac. Isaac felt him and said, “The voice is Jacob’s voice but the hands are the hands of Esau.” He didn’t recognize him because his hands were hairy, like his brother Esau’s."},{"num":23,"verse":"But as he was about to bless him he pressed him, “You’re sure? You are my son Esau?”"},{"num":25,"verse":"Isaac said, “Bring the food so I can eat of my son’s game and give you my personal blessing.” Jacob brought it to him and he ate. He also brought him wine and he drank."},{"num":26,"verse":"Then Isaac said, “Come close, son, and kiss me.”"},{"num":27,"verse":"He came close and kissed him and Isaac smelled the smell of his clothes. Finally, he blessed him,"},{"num":30,"verse":"And then right after Isaac had blessed Jacob and Jacob had left, Esau showed up from the hunt. He also had prepared a hearty meal. He came to his father and said, “Let my father get up and eat of his son’s game, that he may give me his personal blessing.”"},{"num":32,"verse":"His father Isaac said, “And who are you?”"},{"num":33,"verse":"Isaac started to tremble, shaking violently. He said, “Then who hunted game and brought it to me? I finished the meal just now, before you walked in. And I blessed him—he’s blessed for good!”"},{"num":34,"verse":"Esau, hearing his father’s words, sobbed violently and most bitterly, and cried to his father, “My father! Can’t you also bless me?”"},{"num":35,"verse":"“Your brother,” he said, “came here falsely and took your blessing.”"},{"num":36,"verse":"Esau said, “Not for nothing was he named Jacob, the Heel. Twice now he’s tricked me: first he took my birthright and now he’s taken my blessing.”"},{"num":37,"verse":"Isaac answered Esau, “I’ve made him your master, and all his brothers his servants, and lavished grain and wine on him. I’ve given it all away. What’s left for you, my son?”"},{"num":38,"verse":"“But don’t you have just one blessing for me, Father? Oh, bless me my father! Bless me!” Esau sobbed inconsolably."},{"num":39,"verse":"Isaac said to him,"},{"num":41,"verse":"Esau seethed in anger against Jacob because of the blessing his father had given him; he brooded, “The time for mourning my father’s death is close. And then I’ll kill my brother Jacob.”"},{"num":42,"verse":"When these words of her older son Esau were reported to Rebekah, she called her younger son Jacob and said, “Your brother Esau is plotting vengeance against you. He’s going to kill you. Son, listen to me. Get out of here. Run for your life to Haran, to my brother Laban. Live with him for a while until your brother cools down, until his anger subsides and he forgets what you did to him. I’ll then send for you and bring you back. Why should I lose both of you the same day?”"},{"num":46,"verse":"Rebekah spoke to Isaac, “I’m sick to death of these Hittite women. If Jacob also marries a native Hittite woman, why live?”"}]