[{"header":"Chapter 27"},{"num":1,"verse":"Jacob’s Deception. When Isaac was so old that his eyesight had failed him, he called his older son Esau and said to him, “My son!” “Here I am!” he replied. "},{"num":2,"verse":"Isaac then said, “Now I have grown old. I do not know when I might die. "},{"num":3,"verse":"So now take your hunting gear—your quiver and bow—and go out into the open country to hunt some game for me. "},{"num":4,"verse":"Then prepare for me a dish in the way I like, and bring it to me to eat, so that I may bless you before I die.”"},{"num":5,"verse":"Rebekah had been listening while Isaac was speaking to his son Esau. So when Esau went out into the open country to hunt some game for his father, "},{"num":6,"verse":"Rebekah said to her son Jacob, “Listen! I heard your father tell your brother Esau, "},{"num":7,"verse":"‘Bring me some game and prepare a dish for me to eat, that I may bless you with the Lord’s approval before I die.’ "},{"num":8,"verse":"Now, my son, obey me in what I am about to order you. "},{"num":9,"verse":"Go to the flock and get me two choice young goats so that with these I might prepare a dish for your father in the way he likes. "},{"num":10,"verse":"Then bring it to your father to eat, that he may bless you before he dies.” "},{"num":11,"verse":"But Jacob said to his mother Rebekah, “But my brother Esau is a hairy man and I am smooth-skinned! "},{"num":12,"verse":"Suppose my father feels me? He will think I am making fun of him, and I will bring on myself a curse instead of a blessing.” "},{"num":13,"verse":"His mother, however, replied: “Let any curse against you, my son, fall on me! Just obey me. Go and get me the young goats.”"},{"num":14,"verse":"So Jacob went and got them and brought them to his mother, and she prepared a dish in the way his father liked. "},{"num":15,"verse":"Rebekah then took the best clothes of her older son Esau that she had in the house, and gave them to her younger son Jacob to wear; "},{"num":16,"verse":"and with the goatskins she covered up his hands and the hairless part of his neck. "},{"num":17,"verse":"Then she gave her son Jacob the dish and the bread she had prepared."},{"num":18,"verse":"Going to his father, Jacob said, “Father!” “Yes?” replied Isaac. “Which of my sons are you?” "},{"num":19,"verse":"Jacob answered his father: “I am Esau, your firstborn. I did as you told me. Please sit up and eat some of my game, so that you may bless me.” "},{"num":20,"verse":"But Isaac said to his son, “How did you get it so quickly, my son?” He answered, “The Lord, your God, directed me.” "},{"num":21,"verse":"Isaac then said to Jacob, “Come closer, my son, that I may feel you, to learn whether you really are my son Esau or not.” "},{"num":22,"verse":"So Jacob moved up closer to his father. When Isaac felt him, he said, “Although the voice is Jacob’s, the hands are Esau’s.” "},{"num":23,"verse":"(He failed to identify him because his hands were hairy, like those of his brother Esau; so he blessed him.) "},{"num":24,"verse":"Again Isaac said, “Are you really my son Esau?” And Jacob said, “I am.” "},{"num":25,"verse":"Then Isaac said, “Serve me, my son, and let me eat of the game so that I may bless you.” Jacob served it to him, and Isaac ate; he brought him wine, and he drank. "},{"num":26,"verse":"Finally his father Isaac said to him, “Come closer, my son, and kiss me.” "},{"num":27,"verse":"As Jacob went up to kiss him, Isaac smelled the fragrance of his clothes. With that, he blessed him, saying,"},{"num":30,"verse":"Jacob had scarcely left his father after Isaac had finished blessing him, when his brother Esau came back from his hunt. "},{"num":31,"verse":"Then he too prepared a dish, and bringing it to his father, he said, “Let my father sit up and eat some of his son’s game, that you may then give me your blessing.” "},{"num":32,"verse":"His father Isaac asked him, “Who are you?” He said, “I am your son, your firstborn son, Esau.” "},{"num":33,"verse":"Isaac trembled greatly. “Who was it, then,” he asked, “that hunted game and brought it to me? I ate it all just before you came, and I blessed him. Now he is blessed!” "},{"num":34,"verse":"As he heard his father’s words, Esau burst into loud, bitter sobbing and said, “Father, bless me too!” "},{"num":35,"verse":"When Isaac said, “Your brother came here by a ruse and carried off your blessing,” "},{"num":36,"verse":"Esau exclaimed, “He is well named Jacob, is he not! He has supplanted me twice! First he took away my right as firstborn, and now he has taken away my blessing.” Then he said, “Have you not saved a blessing for me?” "},{"num":37,"verse":"Isaac replied to Esau: “I have already appointed him your master, and I have assigned to him all his kindred as his servants; besides, I have sustained him with grain and wine. What then can I do for you, my son?” "},{"num":38,"verse":"But Esau said to his father, “Have you only one blessing, father? Bless me too, father!” and Esau wept aloud. "},{"num":39,"verse":"His father Isaac said in response:"},{"num":41,"verse":"Esau bore a grudge against Jacob because of the blessing his father had given him. Esau said to himself, “Let the time of mourning for my father come, so that I may kill my brother Jacob.” "},{"num":42,"verse":"When Rebekah got news of what her older son Esau had in mind, she summoned her younger son Jacob and said to him: “Listen! Your brother Esau intends to get his revenge by killing you. "},{"num":43,"verse":"So now, my son, obey me: flee at once to my brother Laban in Haran, "},{"num":44,"verse":"and stay with him a while until your brother’s fury subsides— "},{"num":45,"verse":"until your brother’s anger against you subsides and he forgets what you did to him. Then I will send for you and bring you back. Why should I lose both of you in a single day?”"},{"num":46,"verse":"Jacob Sent to Laban. Rebekah said to Isaac: “I am disgusted with life because of the Hittite women. If Jacob also should marry a Hittite woman, a native of the land, like these women, why should I live?”"}]