[{"num":27,"verse":"When Isaac was old, and his eyes were dim, so that he could not see, he called Esau his elder son, and said to him, “My son?”"},{"num":2,"verse":"He said, “See now, I am old. I don’t know the day of my death. "},{"num":3,"verse":"Now therefore, please take your weapons, your quiver and your bow, and go out to the field, and get me venison. "},{"num":4,"verse":"Make me savory food, such as I love, and bring it to me, that I may eat, and that my soul may bless you before I die.”"},{"num":5,"verse":"Rebekah heard when Isaac spoke to Esau his son. Esau went to the field to hunt for venison, and to bring it. "},{"num":6,"verse":"Rebekah spoke to Jacob her son, saying, “Behold, I heard your father speak to Esau your brother, saying, "},{"num":7,"verse":"‘Bring me venison, and make me savory food, that I may eat, and bless you before Yahweh before my death.’ "},{"num":8,"verse":"Now therefore, my son, obey my voice according to that which I command you. "},{"num":9,"verse":"Go now to the flock and get me two good young goats from there. I will make them savory food for your father, such as he loves. "},{"num":10,"verse":"You shall bring it to your father, that he may eat, so that he may bless you before his death.”"},{"num":11,"verse":"Jacob said to Rebekah his mother, “Behold, Esau my brother is a hairy man, and I am a smooth man. "},{"num":12,"verse":"What if my father touches me? I will seem to him as a deceiver, and I would bring a curse on myself, and not a blessing.”"},{"num":13,"verse":"His mother said to him, “Let your curse be on me, my son. Only obey my voice, and go get them for me.”"},{"num":14,"verse":"He went, and got them, and brought them to his mother. His mother made savory food, such as his father loved. "},{"num":15,"verse":"Rebekah took the good clothes of Esau, her elder son, which were with her in the house, and put them on Jacob, her younger son. "},{"num":16,"verse":"She put the skins of the young goats on his hands, and on the smooth of his neck. "},{"num":17,"verse":"She gave the savory food and the bread, which she had prepared, into the hand of her son Jacob."},{"num":18,"verse":"He came to his father, and said, “My father?”"},{"num":19,"verse":"Jacob said to his father, “I am Esau your firstborn. I have done what you asked me to do. Please arise, sit and eat of my venison, that your soul may bless me.”"},{"num":20,"verse":"Isaac said to his son, “How is it that you have found it so quickly, my son?”"},{"num":21,"verse":"Isaac said to Jacob, “Please come near, that I may feel you, my son, whether you are really my son Esau or not.”"},{"num":22,"verse":"Jacob went near to Isaac his father. He felt him, and said, “The voice is Jacob’s voice, but the hands are the hands of Esau.” "},{"num":23,"verse":"He didn’t recognize him, because his hands were hairy, like his brother Esau’s hands. So he blessed him. "},{"num":24,"verse":"He said, “Are you really my son Esau?”"},{"num":25,"verse":"He said, “Bring it near to me, and I will eat of my son’s venison, that my soul may bless you.”"},{"num":26,"verse":"His father Isaac said to him, “Come near now, and kiss me, my son.” "},{"num":27,"verse":"He came near, and kissed him. He smelled the smell of his clothing, and blessed him, and said,"},{"num":30,"verse":"As soon as Isaac had finished blessing Jacob, and Jacob had just gone out from the presence of Isaac his father, Esau his brother came in from his hunting. "},{"num":31,"verse":"He also made savory food, and brought it to his father. He said to his father, “Let my father arise, and eat of his son’s venison, that your soul may bless me.”"},{"num":32,"verse":"Isaac his father said to him, “Who are you?”"},{"num":33,"verse":"Isaac trembled violently, and said, “Who, then, is he who has taken venison, and brought it to me, and I have eaten of all before you came, and have blessed him? Yes, he will be blessed.”"},{"num":34,"verse":"When Esau heard the words of his father, he cried with an exceedingly great and bitter cry, and said to his father, “Bless me, even me also, my father.”"},{"num":35,"verse":"He said, “Your brother came with deceit, and has taken away your blessing.”"},{"num":36,"verse":"He said, “Isn’t he rightly named Jacob? For he has supplanted me these two times. He took away my birthright. See, now he has taken away my blessing.” He said, “Haven’t you reserved a blessing for me?”"},{"num":37,"verse":"Isaac answered Esau, “Behold, I have made him your lord, and all his brothers I have given to him for servants. I have sustained him with grain and new wine. What then will I do for you, my son?”"},{"num":38,"verse":"Esau said to his father, “Do you have just one blessing, my father? Bless me, even me also, my father.” Esau lifted up his voice, and wept."},{"num":39,"verse":"Isaac his father answered him,"},{"num":41,"verse":"Esau hated Jacob because of the blessing with which his father blessed him. Esau said in his heart, “The days of mourning for my father are at hand. Then I will kill my brother Jacob.”"},{"num":42,"verse":"The words of Esau, her elder son, were told to Rebekah. She sent and called Jacob, her younger son, and said to him, “Behold, your brother Esau comforts himself about you by planning to kill you. "},{"num":43,"verse":"Now therefore, my son, obey my voice. Arise, flee to Laban, my brother, in Haran. "},{"num":44,"verse":"Stay with him a few days, until your brother’s fury turns away— "},{"num":45,"verse":"until your brother’s anger turns away from you, and he forgets what you have done to him. Then I will send, and get you from there. Why should I be bereaved of you both in one day?”"},{"num":46,"verse":"Rebekah said to Isaac, “I am weary of my life because of the daughters of Heth. If Jacob takes a wife of the daughters of Heth, such as these, of the daughters of the land, what good will my life do me?”"}]