[{"num":2,"verse":"And you [He made alive], when you were dead (slain) by [your] trespasses and sins"},{"num":2,"verse":"In which at one time you walked [habitually]. You were following the course and fashion of this world [were under the sway of the tendency of this present age], following the prince of the power of the air. [You were obedient to and under the control of] the [demon] spirit that still constantly works in the sons of disobedience [the careless, the rebellious, and the unbelieving, who go against the purposes of God]."},{"num":3,"verse":"Among these we as well as you once lived and conducted ourselves in the passions of our flesh [our behavior governed by our corrupt and sensual nature], obeying the impulses of the flesh and the thoughts of the mind [our cravings dictated by our senses and our dark imaginings]. We were then by nature children of [God’s] wrath and heirs of [His] indignation, like the rest of mankind."},{"num":4,"verse":"But God—so rich is He in His mercy! Because of and in order to satisfy the great and wonderful and intense love with which He loved us,"},{"num":5,"verse":"Even when we were dead (slain) by [our own] shortcomings and trespasses, He made us alive together in fellowship and in union with Christ; [He gave us the very life of Christ Himself, the same new life with which He quickened Him, for] it is by grace (His favor and mercy which you did not deserve) that you are saved (delivered from judgment and made partakers of Christ’s salvation)."},{"num":6,"verse":"And He raised us up together with Him and made us sit down together [giving us joint seating with Him] in the heavenly sphere [by virtue of our being] in Christ Jesus (the Messiah, the Anointed One)."},{"num":7,"verse":"He did this that He might clearly demonstrate through the ages to come the immeasurable (limitless, surpassing) riches of His free grace (His unmerited favor) in [His] kindness and goodness of heart toward us in Christ Jesus."},{"num":8,"verse":"For it is by free grace (God’s unmerited favor) that you are saved (delivered from judgment and made partakers of Christ’s salvation) through [your] faith. And this [salvation] is not of yourselves [of your own doing, it came not through your own striving], but it is the gift of God;"},{"num":9,"verse":"Not because of works [not the fulfillment of the Law’s demands], lest any man should boast. [It is not the result of what anyone can possibly do, so no one can pride himself in it or take glory to himself.]"},{"num":10,"verse":"For we are God’s [own] handiwork (His workmanship), recreated in Christ Jesus, [born anew] that we may do those good works which God predestined (planned beforehand) for us [taking paths which He prepared ahead of time], that we should walk in them [living the good life which He prearranged and made ready for us to live]."},{"num":11,"verse":"Therefore, remember that at one time you were Gentiles (heathens) in the flesh, called Uncircumcision by those who called themselves Circumcision, [itself a mere mark] in the flesh made by human hands."},{"num":12,"verse":"[Remember] that you were at that time separated (living apart) from Christ [excluded from all part in Him], utterly estranged and outlawed from the rights of Israel as a nation, and strangers with no share in the sacred compacts of the [Messianic] promise [with no knowledge of or right in God’s agreements, His covenants]. And you had no hope (no promise); you were in the world without God."},{"num":13,"verse":"But now in Christ Jesus, you who once were [so] far away, through (by, in) the blood of Christ have been brought near."},{"num":14,"verse":"For He is [Himself] our peace (our bond of unity and harmony). He has made us both [Jew and Gentile] one [body], and has broken down (destroyed, abolished) the hostile dividing wall between us,"},{"num":15,"verse":"By abolishing in His [own crucified] flesh the enmity [caused by] the Law with its decrees and ordinances [which He annulled]; that He from the two might create in Himself one new man [one new quality of humanity out of the two], so making peace."},{"num":16,"verse":"And [He designed] to reconcile to God both [Jew and Gentile, united] in a single body by means of His cross, thereby killing the mutual enmity and bringing the feud to an end."},{"num":17,"verse":"And He came and preached the glad tidings of peace to you who were afar off and [peace] to those who were near."},{"num":18,"verse":"For it is through Him that we both [whether far off or near] now have an introduction (access) by one [Holy] Spirit to the Father [so that we are able to approach Him]."},{"num":19,"verse":"Therefore you are no longer outsiders (exiles, migrants, and aliens, excluded from the rights of citizens), but you now share citizenship with the saints (God’s own people, consecrated and set apart for Himself); and you belong to God’s [own] household."},{"num":20,"verse":"You are built upon the foundation of the apostles and prophets with Christ Jesus Himself the chief Cornerstone."},{"num":21,"verse":"In Him the whole structure is joined (bound, welded) together harmoniously, and it continues to rise (grow, increase) into a holy temple in the Lord [a sanctuary dedicated, consecrated, and sacred to the presence of the Lord]."},{"num":22,"verse":"In Him [and in fellowship with one another] you yourselves also are being built up [into this structure] with the rest, to form a fixed abode (dwelling place) of God in (by, through) the Spirit."}]